{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "evil child",
         "id": 177201
      }],
      "imdb_id": "tt0048977",
      "video": false,
      "title": "The Bad Seed",
      "recommendations": [
         10299,
         11773,
         3031,
         25319,
         3019,
         13549,
         28501,
         31592,
         16372,
         27452,
         17965,
         31682,
         11815,
         25504,
         20246,
         26857,
         30924,
         31417,
         16180,
         16093
      ],
      "backdrop_path": "/hdiCDITLt7KvJEWwnmq9ph1EP6W.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "528741fa760ee31cd723c373",
         "content": "Sowing the seeds of evil.\r\n\r\nThe Bad Seed is directed by Mervyn LeRoy and adapted to screenplay by Maxwell Anderson from the novel of the same name written by William March. Anderson had also adapted for the stage play as well. It stars Nancy Kelly, William Hopper, Patty McCormack, Henry Jones, Eileen Heckart and Evelyn Varden. Music is by Alex North and cinematography by Harold Rossen.\r\n\r\nIs there such a thing as Bad Seed? Where I grew up there was a violent family of four brothers, each one would think nothing of doing a Begbie on you. It was the first time I heard the saying Bad Seed, with the conversation basically saying that their father was a psychopath and the four lads just inherited the violent tendencies by way of Pops. It's this theory that drives LeRoy's movie, only here it's a young \"butter-wouldn't-melt-in-her-mouth\" girl who has murderous leanings courtesy of her Nana's iffy genetics.\r\n\r\nThe theatre origins are very much evident, there is no hiding this fact, with the acting (some of the actors are held over from the play here) very much as if playing to an open auditorium, while at over two hours in length there's an over stretching of the talk heavy material. However, this is a very engrossing piece of horror cinema, pulsing unpleasantness and mood oppressive by way of black and white photography and a musical score that underlines the blending of sweet innocence and sinister evil.\r\n\r\nMcCormack as the Devil Child is outstanding, likewise Jones as the simpleton handyman who recognises evil when he sees it. Kelly, Heckart, McCormack and Rossen were all Academy Award nominated for their respective work in the film. As for the much discussed finale? Personally I have no problem with what transpires as regards mother and child. Oh for sure the ending to both the novel and play is far darker and dramatic, but there's a campy bizarreness in this Production Code influenced denouement that befits the whole production. Though the end credits curtain calls by the cast members is pushing it too far... 7.5/10",
         "url": "https://www.themoviedb.org/review/528741fa760ee31cd723c373"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Rhoda Penmark",
               "gender": 1,
               "credit_id": "52fe45f3c3a36847f80e3f13",
               "name": "Patty McCormack",
               "profile_path": "/gwXt1ypL7l2iL6A82q9K0ihCQW1.jpg",
               "id": 125026,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Hortense Daigle",
               "gender": 1,
               "credit_id": "52fe45f3c3a36847f80e3f17",
               "name": "Eileen Heckart",
               "profile_path": "/6NOXsgcudnmTAt8oK5ycMlBelUe.jpg",
               "id": 40618,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Leroy Jessup",
               "gender": 2,
               "credit_id": "52fe45f3c3a36847f80e3f21",
               "name": "Henry Jones",
               "profile_path": "/hOO3CG2qUq6wvM4BkjtJ05kIU1C.jpg",
               "id": 5732,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Christine Penmark",
               "gender": 1,
               "credit_id": "52fe45f3c3a36847f80e3f25",
               "name": "Nancy Kelly",
               "profile_path": "/g4dlFst7WfPHHBWph50yRWoBHr0.jpg",
               "id": 94036,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Monica Breedlove",
               "gender": 1,
               "credit_id": "52fe45f3c3a36847f80e3f29",
               "name": "Evelyn Varden",
               "profile_path": "/nJp3VYN2zz9VOR5aF1dQGuw9gqC.jpg",
               "id": 30538,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Col. Kenneth Penmark",
               "gender": 2,
               "credit_id": "52fe45f3c3a36847f80e3f2d",
               "name": "William Hopper",
               "profile_path": "/lv9KfbxJP01uSlw7ZnjzHP9aT1b.jpg",
               "id": 2776,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Richard Bravo",
               "gender": 2,
               "credit_id": "52fe45f3c3a36847f80e3f31",
               "name": "Paul Fix",
               "profile_path": "/5uySf96UVra95Ru24YvbjLuiBS5.jpg",
               "id": 8496,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Emory Wages",
               "gender": 2,
               "credit_id": "52fe45f3c3a36847f80e3f35",
               "name": "Jesse White",
               "profile_path": "/5q5wzKTgFEzjYHYQybm1OHi6ivk.jpg",
               "id": 93664,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Reginald 'Reggie' Tasker",
               "gender": 0,
               "credit_id": "52fe45f3c3a36847f80e3f39",
               "name": "Gage Clarke",
               "profile_path": "/ss2orebpqeAv9nLFy81uEPhZRSw.jpg",
               "id": 114329,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Claudia Fern",
               "gender": 1,
               "credit_id": "52fe45f3c3a36847f80e3f3d",
               "name": "Joan Croydon",
               "profile_path": null,
               "id": 195936,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Henry Daigle",
               "gender": 2,
               "credit_id": "52fe45f3c3a36847f80e3f41",
               "name": "Frank Cady",
               "profile_path": "/1st0r0fw1GfB7RRE7GJzbDkkP00.jpg",
               "id": 93622,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "Woman in dinner party scene (uncredited)",
               "gender": 1,
               "credit_id": "5849219f92514119b30106b5",
               "name": "Frances Bavier",
               "profile_path": "/8oKsw1dSx7GZ4Ngqhtiq2HGwqHG.jpg",
               "id": 12283,
               "order": 13
            },
            {
               "cast_id": 20,
               "character": "Margie (uncredited)",
               "gender": 1,
               "credit_id": "584921b2c3a368141a0118ea",
               "name": "Shelley Fabares",
               "profile_path": "/5u2sIGqSNkArtpWNIt2eYR6DApp.jpg",
               "id": 83433,
               "order": 14
            },
            {
               "cast_id": 21,
               "character": "Ginny",
               "gender": 1,
               "credit_id": "59ab006b9251410723016d8c",
               "name": "Patricia Morrow",
               "profile_path": null,
               "id": 1225419,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45f3c3a36847f80e3f1d",
               "name": "Mervyn LeRoy",
               "profile_path": "/bbzImfUjJ7v9U86WCpXMjAF4Nap.jpg",
               "id": 9054,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45f3c3a36847f80e3f47",
               "name": "John Lee Mahin",
               "profile_path": null,
               "id": 29618,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe45f3c3a36847f80e3f4d",
               "name": "Maxwell Anderson",
               "profile_path": "/fNn8i1ktvg2IKtiImHQlvMBH5wD.jpg",
               "id": 67807,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 0,
               "credit_id": "52fe45f3c3a36847f80e3f53",
               "name": "William March",
               "profile_path": null,
               "id": 1152088,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 6.225662,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 42196,
      "vote_count": 108,
      "budget": 0,
      "overview": "Young Rhoda Penmark is sweet, smart … and inherently evil! After a school chum dies during a picnic, no one suspects Rhoda, except the janitor of her apartment building. But when Rhoda's mother finds out that her own mother was a cold-blooded killer, she begins to suspect Rhoda might be the victim of some faulty genetics.",
      "similar": [
         10320,
         43751,
         58792,
         40217,
         82990,
         241927,
         127884,
         11773,
         55538,
         64623,
         511439,
         3560,
         84107,
         62521,
         54013,
         72648,
         30202,
         48630,
         60632,
         290590
      ],
      "original_title": "The Bad Seed",
      "runtime": 129,
      "poster_path": "/iAgSkpZslQ2s3onL9TaHbyWygtC.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
         "name": "Warner Bros. Pictures",
         "id": 174,
         "origin_country": "US"
      }],
      "release_date": "1956-09-12",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "A WOMAN'S SHAME...Out in the Open!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Mervyn LeRoy"],
      "runtime": 129,
      "synopsis": "Lovely, well-to-do Christine Bravo Penmark has everything: a loving, well-paid husband with a respectable career (as an Air Force colonel, no less), a swank apartment in a respectable part of town, and an adorable, cherubic eight-year-old daughter. But as Col. Kenneth Penmark leaves for an assignment in Washington, DC, the strains that have lurked beneath the surface of the Penmark household now begin to manifest. For example, her daughter Rhoda gives every indication of being a grasping, greedy child, whom their landlady, Monica Breedlove, indulges with extravagant presents that Rhoda gives some indication of not being satisfied with. For another, Rhoda protests loudly and resentfully when reminded that she had lost a penmanship competition, saying that she ought to have won first place, and the medal that goes with that honor. The apartment-house handyman, Leroy, presents another complication. Though an adult, he seems to have an eight-year-old mind himself. He is also mean and spiteful, and regularly spars with Rhoda. Rhoda leaves for a school picnic, wearing two shoes that have been modified with iron plates to make them sound like tap shoes. As she leaves, Leroy sprays her shoes with the garden hose, earning a stern reprimand from Monica. Leroy nurses resentment of Mrs. Breedlove, a lustful attitude toward Christine, and a clear enmity toward Rhoda. At the picnic, Christine tries to sound out Claudia Fern, the headmistress of Rhoda's school, about how Rhoda is fitting in and getting along. Miss Fern at first is effusive in her praise of Rhoda but then becomes evasive and abruptly excuses herself. Christine confesses at this point that Rhoda seems overly mature for her age, in a \"disturbing\" manner. That afternoon, Christine entertains her \"psychiatry club,\" at which Monica fairly boasts of having been under analysis by some of the most droppable names in the profession of psychiatry. (That she could actually have been a patient of Sigmund Freud, as she boasts, is a stretch, and her fellow clubbers seem to know it.) Then, as the club starts to discuss a case of a recently convicted serial murderess, Christine finds the conversation disturbing, prompting Monica to tease her about it. The conversation then continues onto the case of one Bessie Denker, a name that Christine recognizes but won't elaborate on. In the middle of this conversation, someone turns on the radio, and the announcer gives a shocking report: that Claude Daigle, a fellow student of Rhoda's, has drowned on an old, rickety pier that the students had been forbidden to play on or near. As expected, the school bus brings Rhoda home early--and Rhoda, far from being in any to-be-expected state of shock, seems to care nothing about the death of her classmate, and casually asks for a peanut-butter sandwich and a glass of milk, and then goes out roller-skating. The one adult who takes the most notice of Rhoda's casual attitude is the handyman, Leroy. He says flat-out that she's not even sorry that he died, and Rhoda half-innocently, half-sardonically asks why she should feel sorry. As she skates away, Leroy forms a resolve to find something to scare her with, thinking only as an eight-year-old thinks, to \"take her down a peg.\" A few days later, Claudia Fern comes to visit Christine, and to reveal some startling information: that Rhoda was the last student to see Claude Daigle alive, and that Claude's penmanship medal, which he had worn to the picnic, was now missing. Miss Fern also reveals that Rhoda had been pestering Claude all morning, trying to snatch his medal from him. Furthermore, Miss Fern reveals that a lifeguard had shouted a warning to a girl answering to Rhoda's description, as she was coming off the wharf. Christine now remembers that Claudia Fern and her sisters never asked Christine to pay for a share of the flowers for Claude Daigle's funeral, and Miss Fern states that she thought that Christine would prefer to send flowers individually. Now Christine asks flatly why Miss Fern would take that attitude, and ask Christine Penmark about the missing medal. In reply, Miss Fern reveals what she had earlier not wanted to discuss with Christine: that Rhoda has no sense of fair play, is a sore loser, and has earned the enmity of all the other pupils in the school. Furthermore, Miss Fern announces that Rhoda will not be welcome when school takes up again in the following fall. This prompts Christine to ask Miss Fern flat-out whether she supposes that Rhoda had anything to do with Claude's death. Shocked, Miss Fern disclaims any such suspicion, but her behavior indicates that, whether she harbored such a suspicion or not, her sisters do. Their conversation is interrupted when Hortense Daigle, the dead boy's mother, stumbles into the apartment, drunk and barely able to walk in a straight line, followed closely by Henry Daigle, her embarrassed husband. Mrs. Daigle sarcastically observes that Christine is her social superior, an \"honor\" that Christine hastily disclaims, and then comes to the point of her visit: she demands to know what became of the penmanship medal, and what Miss Fern, concerned as she probably is with liability issues, won't reveal. Mrs. Daigle also reveals that Claude, when found, had bruises on his hand and a crescent-moon-shaped wound on his forehead. In the end Mrs. Daigle becomes terrifically angry, and then almost collapses in tears, allowing her otherwise-ineffectual husband to lead her away. After Hortense leaves, Christine and Miss Fern have a tearful parting. Shortly after this, Col. Penmark calls to ask about the accident, and to reveal that his Washington assignment will last at least another four weeks. When Monica calls and asks Christine to lend her a locket that she had given Rhoda, so that she can have its gemstone changed, Christine is horrified to find the penmanship medal in Rhoda's little \"treasure chest.\" She then shows the medal to Rhoda and demands that Rhoda explain how she came by the medal. Rhoda at first tries to change the subject, then denies that she had had the medal, then tells a variety of stories that Christine recognizes as false almost at once, and finally says that she had somehow persuaded Claude to let her hold the medal, and then had gone out onto the pier and fallen in later on. In between these activities, Rhoda indulges in a bit of flattery that now seems anything but flattering. Then Christine recalls a fatal accident that had happened to a neighbor in Wichita, KS, an accident by which Rhoda came into possession of a keepsake belonging to the neighbor. Christine finally announces her intention to call Miss Fern, intending to surrender the medal, but Rhoda, in a frightened tone, begs her not to, saying that the school officials don't like her and were persecuting her. Miss Fern is not available, and Rhoda seems to care most of all about retaining the medal, insisting that she, not Claude, had actually earned it. Back in Washington, Col. Penmark buys an expensive children's tea set for Rhoda and has it shipped to Rhoda, packed in excelsior. Rhoda goes out to play with it, and takes the packing material with her. Leroy sees her at play, and begins his scare campaign by accusing her of beating Claude Daigle with a stick and saying that she could never clean a murder weapon enough to remove all trace of blood, that the police have \"stick bloodhounds\" that can find a thrown-away stick in any forest, and that the police laboratory will sprinkle \"blood powder\" on a blood-soaked stick and make it turn blue. Rhoda, for her part, gives Leroy the excelsior, saying that she knows about the bed of excelsior that Leroy has made for himself so that he can sleep on the job in the furnace room without being caught. Nor is she afraid of Leroy's accusations, saying that he made them all up. Christine catches Leroy talking to Rhoda and warns him never to speak to Rhoda again, or she will report him to Monica Breedlove. When Rhoda comes back into the house, she asks her mother about police tests for blood. Christine offers to ask Miss Fern about it, but again Rhoda does not want Christine to ask Miss Fern any such thing. Christine instructs Rhoda to go up to Mrs. Breedlove's apartment for dinner, while the famous psychiatrist Reginald Tasker dines in the Penmark apartment with the local \"psychiatry club.\" Mr. Tasker reveals that he has great respect for Christine's father, Richard Bravo, who had been quite an authority on crime and criminals in his younger days. Tasker and Bravo engage in good-natured professional sparring, and also discuss Christine Penmark's own dreams of writing a murder mystery. Christine asks Tasker whether children ever commit murder, and Tasker says that they do, and even that many adult criminals begin their careers in childhood. Christine insists that criminals are made in bad environments, but Tasker insists that some criminals are born that way, that they are \"bad seeds,\" possessing atavistic, consciousless minds, and even that one might inherit a tendency to criminality. Richard Bravo refuses to accept such a theory, but Tasker politely stands by his theory, and even states that a child criminal would not present a sour countenance at all, but would instead present a quite convincing \"normal\" and \"innocent\" manner. Then the conversation turns to the case of Bessie Denker, one of Richard Bravo's own case-history subjects. Bravo wants to avoid the subject, but Christine insists, and Tasker reveals that Ms. Denker vanished without a trace before the authorities could make an arrest. Tasker even remembers that Ms. Denker left a child behind, a part of the story that Bravo hastily denies. Shortly after making this revelation, Tasker leaves. Now that Christine and her father are alone together, Mr. Bravo challenges Christine with the worry that shows plainly on her countenance. Now Christine starts to talk freely of her fear of having been an adopted child, and not the actual daughter of Richard Bravo and his wife. Christine also says that her concerns about Rhoda have prompted a return of her old fear. She mentions a recurring nightmare that she had always talked to Richard about, but Mr. Bravo clearly does not want to discuss it, and especially does not want Christine to lend credence to the inherited-criminality theory. But now Mr. Bravo reveals that he did find Christine in \"a very strange place.\" Then Christine reveals her recurring nightmare, about living in a farmhouse with her brother and a very beautiful lady, then not having a brother anymore, then being terrified of being in the room, then being outside in an orchard. Finally she remembers the name she originally had: her name was not Christine Bravo at all, but Ingold Denker, Bessie Denker's daughter. This, then, is the truth: Richard Bravo found Ingold Denker, whom he renamed Christine, in the orchard on the Denker farm after Bessie Denker had died. But Christine now feels that she would have done better to die, because she is afraid that she inherited a tendency to extreme criminality from her real mother, Bessie Denker--and passed this on to her own daughter, Rhoda Penmark. At this moment, Monica Breedlove returns with Rhoda. Rhoda greets her grandfather cheerfully, but now Richard Bravo takes a long, hard look at his granddaughter, though he will not explain his misgivings. Bravo agrees to stay in a spare room in Monica's apartment overnight. Later, Christine catches Rhoda trying to dispose of something in a paper bag. Rhoda doesn't want to reveal the contents of the bag, so Christine struggles with Rhoda and forces her to reveal what she had been trying to dispose of: her shoes with the iron half-moon reinforcements. Now Rhoda knows the horrible truth and extracts a confession from her: that Rhoda killed Claude Daigle by beating him with her toe shoes, after he had refused to let her handle his penmanship medal. After the first blow, Claude surrendered the medal, and then tried to escape, and Rhoda struck him again, and again, until he fell in the water. When he tried to climb back onto the wharf, Rhoda beat the backs of his hands with her shoes to make him let go, and so he drowned. Rhoda also confesses something else: that she had in fact deliberately caused their neighbor in Wichita to fall on some ice. Christine, totally distraught, instructs Rhoda to throw the shoes into the incinerator slot and say nothing to anyone. Rhoda again asks about the medal, and Christine half-promises not to give the medal back to Miss Fern. The next morning, Richard Bravo leaves, and Leroy again tries to tease Rhoda. This time Leroy says that if the police find the stick with which she killed Claude Daigle, they'll sentence her to death in the electric chair, and even that the police have his-and-her child-sized electric chairs. Next, Leroy says that he hasn't seen her in her tap shoes, and now says that he knows that she hit Claude Daigle with the shoes, and even that he has retrieved them from the incinerator. That last boast causes Rhoda to take alarm and demand that Leroy return the shoes. At last Leroy has found something to scare her with, and he presses his point--and finally realizes that she really did the deed, and that's the reason why she is scared and is demanding the return of the shoes. In fact, Leroy did not retrieve the shoes when he said he did, but after Christine chases Leroy away from Rhoda a second time, Leroy opens the incinerator and finds the shoes, but is now too afraid to say anything. Christine, for her part, reprimands Rhoda for talking about this subject after they had agreed never to speak of it to anyone. When Monica calls to give Rhoda the locket, after it has been modified, Rhoda asks permission to catch the ice-cream man and buy a popsicle. On her way, Rhoda tries to steal several matches. Christine tells her to replace them, but manages to hide two of them. When Rhoda leaves, Monica probes Christine, knowing that something is troubling her, but not knowing what. Monica offers to give Christine some sleeping pills to help her sleep. Christine collapses in a pool of tears, but still is afraid to tell Monica anything. At that moment, Hortense Daigle, drunk as before, returns to the apartment, seeking yet another confrontation, not only with Christine, but this time also with Rhoda. Hortense has by now tried to talk to Miss Fern a dozen times without result, and has also spoken to the lifeguard from the fatal picnic. What she now knows makes her firmly suspect Rhoda of something, though she is not even sure herself what she suspects. Hortense does not succeed in getting the information she seeks, or in scaring Rhoda (because Monica hastily takes Rhoda away on a pretext). But she does succeed in frightening Christine very badly before her husband finally shows up to take her home again. After Hortense leaves, Christine starts to call Col. Penmark, but despairs of having anything constructive to tell him. Monica returns and reveals that she allowed Rhoda to go out and buy another popsicle. Rhoda then comes back into the apartment, crosses to the music room, and starts again to play her favorite tune, \"Au clair de la lune,\" on the piano over and over--slowly at first, and then faster and faster until she is playing it at break-neck speed. While she is playing, Christine hears a man's voice from below, screaming at the top of his voice for someone to let him out. She then hears a desperate knocking from inside the sloping cellar door, and then sees a cloud of smoke emanating from that cellar. Monica's brother Emory and Mr. Tasker, who is still staying in the house, try desperately to break the cellar door open, but before they can get in, the screams rise to a blood-curdling crescendo and then stop. The owner of that voice was Leroy, who has, quite simply, burned to death. Christine now suffers a nervous breakdown and starts to strike the dining-room table with her right hand and babble about being blind, and finally screams at Rhoda to stop playing that piano tune over and over. When Rhoda does come out of the room, Monica has to restrain Christine from striking Rhoda. Christine then collapses in tears as she confronts the realization that Rhoda has killed yet another person. But Christine blames herself, not Rhoda, because Christine is now fully convinced that Rhoda inherited her murderous tendencies from Christine herself. That night, she induces Rhoda to confess to killing Leroy, which Rhoda does, all the while insisting that the fault was not hers, but Leroy's, because Leroy shouldn't have scared her with his loose talk about police investigations, evidence, and little blue and pink electric chairs for children. Christine reveals at this point that she has dropped Claude Daigle's medal onto the pilings at the pier where he drowned. Finally, Christine gives Rhoda what she says are \"new vitamins,\" but are actually sleeping pills, in an amount that is obviously an overdose. After putting Rhoda to bed, Christine shoots herself with Col. Penmark's revolver that they keep in the apartment. Two days later, Mr. Bravo and Col. Penmark, both returned from their respective cities, discuss the apparent attempt at murder and suicide. Rhoda recovers completely, but Christine must stay in the hospital to recover. Col. Penmark takes Rhoda home, but Richard Bravo asks the hospital doctor whether Christine had mumbled anything while he was attending to her. The doctor remembers that she kept repeating the phrase \"bad seed\" over and over. Mr. Bravo says that Christine was about to write a book about inherited criminality, but the doctor, as Mr. Bravo had done, totally rejects the theory, saying that no one would dare bear or adopt children if that were the case. Col. Penmark puts Rhoda to bed and then waits up. He takes a call from the hospital, as Christine desperately wants to confess to Kenneth that she has \"sinned a great sin.\" The colonel says that whatever the problem is, they will face it together. Rhoda, meanwhile, has put on her raincoat and sou'wester and gone out of the house. She walks all the way to the Fern school grounds, and onto the wharf where Claude died. Rhoda wants, quite simply, to retrieve the medal. Using a flashlight, she spots the medal underwater, and takes an old fishing net to try to snag it. Lightning strikes her and knocks her into the water. The movie, as such, ends here--but then a casting-call sequence appears in which the actors playing the various parts introduce themselves. Rhoda appears next to last, and finally Christine--but then Christine steps toward Rhoda, seizes her, turns her over her knee, and gives her a sound spanking. The last frame is a plea to the audience not to reveal the \"unusual climax.\"",
      "writers": [
         "John Lee Mahin",
         "Maxwell Anderson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0048977/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA4MTc3MjUyOF5BMl5BanBnXkFtZTgwNzkyMzcxMTE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Nancy Kelly, Patty McCormack, Henry Jones | See full cast and crew »"],
      "reviews": [
         "Christine Penmark (Nancy Kelly) is the daughter of a famous writer, Richard Bravo (Paul Fix). She's married to Kenneth (William Hopper), a military Colonel who seems to spend most of his time away from home, usually on short-term call in some other city. The landlady of their apartment building, Monica Breedlove (Evelyn Varden), is obsessed with psychology, having even been analyzed by Freud. Because of this, she courts friendships with other intellectuals, including a criminology author, Reginald Tasker (Gage Clarke). But by far the most important character is Christine's young daughter, Rhoda (Patricia McCormick). Rhoda is oddly adult in her behavior. She goes out of her way to excel at everything she does, to be prim and proper, to seem amicable and innocent. However, in the wake of one of Rhoda's classmates falling victim to a drowning accident while on a school picnic, suspicion falls on Rhoda. As more facts come out, Christine realizes with horror that her child just might be a \"bad seed\". A tightly focused ensemble piece, heavy on dialogue and taking place primarily in one interior location, The Bad Seed is one of the better but more understated horror films from the 1950s. Because of its ideas, its unusual portrayal of a manipulatively \"evil\" child (and a weirdly cute young girl at that), and its nihilistic and abruptly mind-blowing ending, The Bad Seed was quite a shocking film in 1956. In my book, it still is. That's not to say that the film is graphic. Much more so than, say, The Haunting (1963), The Bad Seed is the classic example of how something implied and not shown can be just as effective and disturbing as something shown. Still, not everyone loves it, of course. \"Staginess\" is often cited with either a direct claim or an implication that that quality is necessarily a flaw. The Bad Seed's \"staginess\" is easily explicable. It is a film adaptation of a play by Maxwell Anderson, which was itself adapted from William March's last novel, published in 1954. It's easy to see how only minor changes would allow the film to be performed on a stage. However, I don't see The Bad Seed's staginess as a flaw. It's not as if plays are bad merely for the fact that they're plays, right? There seems to be some unspoken or unanalyzed attendant assumption that cinema shouldn't bear strong similarities to other artistic media and/or a belief that cinema should always be \"naturalistic\". I don't agree with either of those assumptions. Cinema can do many different things. It shouldn't all just be one way or another. Rather than being a flaw, the staginess of The Bad Seed is an asset. It catalyzed the effective \"tell, don't show\" attitude towards the film's violence. It allows all attention to be placed on the fantastic ensemble performances, and especially on McCormack, who turns in the best young female performance this side of Dakota Fanning. And it helps make the film feel like the parable that it is. Under director Mervyn LeRoy's hand, The Bad Seed is an extended meditation on two philosophical ideas--twisted psychologies and the nature versus nurture debate. It's not just Rhoda who has psychologically-rooted problems and dysfunctions, but everyone in the film. Christine is in denial, and shows that she has long been in denial, about her happiness, her life and her daughter. She continually tries to act as if everything is kosher and normal, but as the film progresses, she has periodic cracks in the armor, until the \"breakdown\" at the end--and even in the midst of that, she tries to act as if everything is okay and mundane. Monica, who keeps trying to psychoanalyze everyone (except the one person she most needs to psychoanalyze), tends to also intellectually browbeat or overpower them. Kenneth is an absentee husband. Leroy Jessup (Henry Jones), the apartment maintenance man, presents himself as just as twisted, deceptive and manipulative as Rhoda, and there is a pedophile subtext with the character. Claudia Fern (Joan Croydon), the head of Rhoda's school, seems on the verge of a nervous breakdown, and also seems to be in denial, as does Christine's father Richard, who also has elements of absenteeism and emotional distancing. Hortense Daigle (Eileen Heckart), the mother of the drowned boy, is an alcoholic, and her tragedy puts her over the edge. In fact, the only character in the entire film who seems well-adjusted is Reginald, and perhaps that's symbolic of his function as a criminologist. The nature versus nurture material is incorporated in an unusual way. Characters debate this to an extent, but most take the nurture side. However, the film itself makes more of an argument for the nature side, and Christine, despite being in denial, comes to believe the nature side, as does Reginald, the even-keeled character. In fact, William March (the author of the novel) believed more in the nature side, and said as much to colleagues while he was working on the book, including doing research into psychotic killers. What helps to amp up the disturbing qualities of the film is that Rhoda is manipulating the audience as well as she is manipulating other characters. Only very seldom does LeRoy have her \"true nature\" come through, and it's a shock to us in the same way that it's a shock to the other characters. The ending of the book was changed to be in line with the \"moral code\" for Hollywood films at the time, but the resultant, somewhat bizarre ending, is probably more shocking in retrospect than March's original ending would have been. There have been many horror films over the years with endings somewhat similar to March's. There haven't been many that end in quite the same way that The Bad Seed does. While the film would certainly require a bit of adjustment for many younger modern horror fans, it is well worth watching, especially if you've become acclimated to slower-paced, dramatic, understated horror.",
         "As the closing statement says, \"This motion picture presents a premise that is daringly different.\" It may seem to be a self-indulgent thing to say, but in 1956, a film about an angelic looking child named Rhoda Penmark (the remarkable Patty McCormack, whose performance is absolutely brilliant, vicious, and mercurial...she transforms with ease from a sweetie-pie to a bristling monster and back to a sweetie-pie), complete with cutesy dresses, disarming curtsies, and blonde braids, who in fact is a homicidal, amoral murderer, was indeed \"daringly different\". After the generation of Shirley Temple's angelic dresses and bouncy curles and darling dimples, the idea of a perfectly beautiful little girl being a chillingly cold killer is unnerving to say the least. I love this movie, the controversy surrounding its theme: is a murderous personality inherited??? The book HIDEAWAY by Dean Koontz may have been inspired by this classic B&W film. Koontz describes the malefactor in that book in much the same way little Rhoda is contemplated in this film. Something missing in their genetic codes. \"The fundementals of nucleotides, DNA proteins...\" As in HIDEAWAY, where the reader was shocked to discover that Vassago's grandpa was a maniac who slaughtered his family, we discover in THE BAD SEED that there was a grandmother back in Christine's (Nancy Kelly) family who methodically murdered her own brood and then calmly left the country, never to be heard from again. Just the sight of little Rhoda in that infamous scene with the ex-con/yardman LeRoy is enough to have your hair standing on end: \"YOU GIVE ME MY SHOES!!! THEY'RE MINE!!! GIVE THEM TO ME NOW, LEROY!!! RIGHT HERE TO ME!!!\" Ooh!!! {{{Shiver}}}!!! That is one nasty little seed, that is!!! And not one any sensible person would dare mess with. Poor LeRoy learns this the hard way. Not a film for the easily upset or faintish. It's not a horror movie, but laden with truly horrific scenes. The \"daringly different\" premise is brilliant and far ahead of its time of the sweet, Mrs. Cleaver 1950s. A+",
         "What we have here is a fantastic classic horror film, which benefits from great performances from all concerned and a plot not typical of serial killer films. The film doesn't adhere to convention and builds its story around an idea that was frightening for the time - and still is to this day. The murderer in this film is as evil as any other; the only difference being that here the killings are committed by a decidedly amoral child. The film presents a good portrait of its star, as it presents its ideas very much from a child's point of view. The young girl doesn't see what she's doing as wrong as she is always given a reason to pass on the blame for wrongdoings, and this always comes across in a plausible way. The plot surrounding the atrocities is even more interesting than the central idea, as we follow the torment inflicted on the girl's mother. The situation that Christine Penmark finds herself in is the stuff of nightmares; just what can you do if you find that your eight year old child has committed murder? The Bad Seed makes excellent use of this dilemma, and the fact that it's incredibly easy to buy into the plot ensures that The Bad Seed prevails as an potently chilling film. The film is based on a stage play by Maxwell Anderson, and this comes across often as the film takes place in just a few settings and the whole thing is very stagy. This is, however, to its benefit; as the locations make the whole piece more claustrophobic, and the fact that we don't see the murders themselves benefits the film immensely as it allows the audience to spend more time considering the implications; which are what the film is actually about. The main reason why this film works so well is down to a great performance by talented child actor Patricia McCormack. McCormack presents a portrayal that finds exactly the right pitch between the sweet and innocent youngster that she appears; and the dark persona that lies just beneath her exterior. Nancy Kelly similarly gives a defining performance as her tortured mother, and excellently puts across a torrent of emotion. The acting is typically melodramatic, but all the cast somehow manage to keep their acting down to earth. Every scene in the movie is perfectly pitched and nothing is wasted as we are continually taught more about the characters and their situations. The climax to the film is fabulously poetic, despite being implemented on the producer's orders and overall, I really don't see much wrong with this film. Highly recommended!",
         "I saw \"The Bad Seed\" years ago, circa 1970, for the first time, and have seen it periodically over the years. When I first saw the film, as a child, I found the film, expectedly, quite chilling. I saw it again this afternoon, after not having seen it for about three years, and still find it quite disturbing. Now that we have IMDb, I decided to offer my thoughts. And so, I was shocked to find SO MANY comments about it...more than for any other film that I've reviewed on IMDb to date. If I add anything of unique value, great. If not, I'm happy to share my review anyway. Certainly, there are flaws, or perhaps only \"unique differences\", in this film. Primarily, it can very easily be considered a filmed play, as the staging, the dialog, and the entrances and exits of the characters throughout the film seem to be lifted directly from the stage version. Therefore, some may find the film a bit too sterile or unnatural in many ways. However, I think it is this very sterile, staged, stark-from-a-production-standpoint quality that gives the film an even eerier and in some ways far more realistic edge than might be found were it to be produced today for film, with far more slick and sophisticated sets, dialog, camera work, etc. The realism and pronounced disturbing quality of this version stems from the simple story itself, the psychological horror of which could be in some ways obfuscated from a much more sophisticated, big-studio, modern-day production. As for the subject matter itself, I know that the number of cases, historically, involving child murderers is actually low. Therefore, some critics have argued that to take a relatively rare phenomenon, such as the child murderer, and build a motion picture around it, portraying it in the vein of plausibility, can be misleading and dangerous, giving the impression, especially to younger viewers, that child criminals are more commonplace than you may think. I wholeheartedly reject this notion. The whole purpose of acting is to portray the entire range of the human condition with as much truth as possible, no matter how rare or commonplace certain aspects of human behavior might be. Though child murderers may be few in number, it's an area worthy of as much exploration, in film, as is an ugly, unrealistic alien telling us to \"phone home\" or the sinking of the Titanic. Even though this film possesses a definite \"campy\", staged, and perhaps even \"cult\" quality, it is chillingly effective. One reason for which this film works is due to the character of Rhoda herself, played by Patty McCormack. The smiling, blond, blue-eyed veneer of the child juxtaposed with the idea of her criminal potential (and actions) is just plain \"creepy\". Moreover, the less you see, in terms of the actual crimes she commits, the more you conjure. And, you continually wonder who her next victim will be. Furthermore, you wonder how many people will eventually \"come on to her\" and become aware of whom she is, and how that knowledge will affect their fate. Another reason for which this film works is because of the mother, Christine, played by Nancy Kelly. As we slowly watch her become aware of what has become of her daughter, we can't help but empathize with her predicament and her decision in handling it. The first few times I saw the film, just as I felt that Patty McCormack's portrayal and dialog delivery were probably mere replicas of what she offered on stage, I felt that Nancy Kelly's performance was affected and probably lifted directly from her work on the stage (I've never seen a stage version, nor have I read the book, yet). But in the case of Ms. Kelly, watching her realize what she has ultimately given birth to and raised is very heart wrenching. Moreover, I have always wondered if the use of her right hand was a direction given to her by either of her directors (for play or film), or if it was something she came up with herself. Two instances come to mind. In the first one, the manner in which she hits the table with her right hand as she listens to what is happening outside near her shed while Rhoda plays \"Au Claire de la Lune\" on her piano is very pronounced, appears somewhat odd and is perhaps symbolic. She seemed to be pounding her hand not only in outward denial and anger at the realization she now has of what her child is capable of committing, but as a means to torture and punish herself for having given birth to her in the first place. In the second instance, Nancy Kelly used her right hand again in a very pronounced manner when she offers Rhoda her vitamins \"that night\". Again, I couldn't help but wonder what symbolism she wanted us to draw from her gesture. It might be said that this very hand, which once comforted and fed her child all her life, has now become the tool that feeds the ultimate fate of her child toward the end of the film. (Again, not having read it, I have a fairly good idea how the book ends). As for how the ending/epilogue in the film was handled, practically everyone on this site who has offered a review knows that the use of the \"casting call\" was basically dictated by the mandates of the Hays Code. I'll just add that I find that the chilling effect of the story carries over to this bizarre \"epilogue\". I still find it a bit unsettling to see each of these actors take their bows, especially considering that some of the characters they portrayed would, in my estimation, appear stranger to a child than does Rhoda....particularly Leroy, when he bows to the viewing audience carrying his large pitchfork.",
         "My daughter, Rachel, always found this the most frightening movie she ever saw, and from a psychological perspective, it's easy to see why. Patty McCormack is magnificent as charming but evil first-grader Rhoda Penmark. Nancy Kelly is terrific in some scenes, but almost comically overwrought in others, as Rhoda's gradually terrified mother. Paul Fix deserves special mention in a strong performance as Kelly's father. And, Eileen Heckart is also a standout as the grief-stricken mother of a boy that we suspect Rhoda of killing. But, my personal favorite character is LeRoy, incredibly portrayed by Henry Jones. This is a characters I have never forgotten from the moment I first saw this one in the late 50's. \"That Rhoda is smart, almost as smart as me\", he repeats for the camera several times in obsessive fashion. The ending which differed from the play has disturbed a lot of purists, but I think it has a lot of merit. Altogether, I give it 8 out of 10, very memorable and extremely well done.",
         "I was blown away! I was at the edge of my seat the whole time. Those people gave me the creeps. I was just flipping through the channels when I came across it. Normally I'll change the channel after a minute or two to see what else is on, but not when I saw this movie! I was so terrified, I sat through the whole movie, uninterrupted. I'm shivering just thinking about it right now!",
         "Minor 1950's classic that holds up well fifty year later. The film does have its flaws. Occasionally it has the feel of a staged play--at times it seems Mrs. Penmark has to answer the door every five minutes so as to get the other major characters on screen. The Freudian psychobabble and the altered ending add an unnecessary half hour or so to the running time. And the acting can be very overwrought (although the scene in which Mrs. Penmark is screaming in the apartment as Leroy screams outside--both counterpointed by Rhoda's untalented but very loud rendition of \"Au Clair de la Lune\"--is a moment of high camp horror on par with anything in \"Whatever Happened to Baby Jane?\") Still the movie works, largely because of Rhoda, the eerily self controlled little murderess who despite her sweet smiles always looks at though her hair is braided a bit too tight. It helps that an actress was cast who was cute enough, but not too pretty--Patty McCormack looks like a miniature gargoyle when she drops the sunny mask and starts roaring. Leroy, the leering simple minded caretaker is almost as unsettling--the scenes in which he sadistically taunts Rhoda almost amount to a very twisted flirtation, as he is clearly more delighted than appalled by her capacity for evil (at least until he learns just how far this capacity goes). I haven't seen the 1980's remake, but I can't see how it could top the original, if only because evil little girls in jeans and T-shirts just aren't as scary as evil little girls with hair bows and starched frocks.",
         "With some familiar elements of classic thrillers plus some creative turns, this is an unusual and effective thriller. Patty McCormack is memorable as young Rhoda, and the rest of the cast succeed in making their characters react believably to some nearly unbelievable situations. The story moves slowly enough to build suspense carefully, while still holding your interest the whole time. For this kind of story to work, it has to keep the tension and uncertainty without becoming obviously implausible or annoyingly overplayed. In \"The Bad Seed\", we see the tension and fear that build in the characters as the story develops, but events also unfold within an atmosphere that otherwise would be peaceful and normal, making for an interesting contrast that helps to maintain a good balance. Unlike the many banal movies made in recent years about serial killers and the like, \"The Bad Seed\" also contains some substance. The characters, especially the mother (played by Nancy Kelly), not only have to make difficult decisions, but also must fearfully attempt to understand the reasons for everything. It's a good example of how well a thriller can work when carefully made without a lot of extraneous elements, and it's a demonstration that a movie can have a tense, dark story without being shallow or superficial at the same time.",
         "I first saw this movie when I was about 10-11. I cried my eyes out....doesn't effect me the same way now, but I truly admire Patty McCormick's acting ability. A true classic and now-a-days the premise of the story is maybe truer than the writer ever would have guessed",
         "This is a movie that stands the test of time because of the period in which it was filmed, its methods of filming and acting, and the level of knowledge of the subject matter at that time. It is truly a period piece and as such, it is a powerful chiller-thriller. A hit on Broadway, 'The Bad Seed' was translated into film as though it were a play; hence various commentators speak of its staginess and sometimes overwrought acting as if they were serious objections to the enjoyability of the movie. But does anyone complain that 'Dracula' was stagy and overwrought? No, because the movie is classic in and of itself, and so is 'The Bad Seed'. Translate your mind back to the early nineteen-fifties and 'The Bad Seed' takes on new levels of meaning and challenge. Christine Penrose, whose military husband is called away from home, is raising her darling daughter Rhoda on her own when things start slowly coming apart. Rhoda is the perfect eight-year-old, a pretty, intelligent and very affectionate child, in crinoline dresses and blonde braids, to whom everyone around gives praise and, often, gifts. She is always grateful and loving in her delight with what she gets. What is wrong with this picture? Rhoda wants something very badly, something she feels she won and has been unjustly denied, something that disappeared when its owner died a sudden, tragic death. So why does it turn up in Rhoda's possessions? Christine Penmark has no idea what is going on. Children were not believed to have mature personalities according to the psychology of the day, and the case of Leopold and Loeb was brutal and startling, and apparently a singular aberration, just a few years before the play debuted. There was then no way to explain what Christine begins to perceive: that Rhoda takes what she wants if she can't charm her way to it, and anyone who gets in her way she simply 'removes'. This wasn't supposed to happen in the 1950's. Today we may be more reliably informed, especially to the statistics that point clearly to the 'nurture rather than nature' explanation, but Christine is alone with her manipulative little murderess with no world-view to encompass what she faces. Her confusion and denial aren't weaknesses of character but the product of the general understanding of the day. It is not until she has a chance encounter with a criminal psychologist who posits the 'nature, not nurture' theory of criminality, and then digs more deeply into the dark secret of her own childhood that things begin to add up, and Christine Penmark herself unravels in as ghastly a manner as her life has done. The play is in black and white, and so are the performances and the ethics and morality of its message. Rhoda has only two sides to her: the apparently good, affectionate, perfect angel and the manifestly evil, selfish, deadly crocodile-brained killer. Patty MacCormack is excellent in the dual portrayal, and her performance as a child actress is an achievement seldom rivaled and never bettered. Nancy Kelly's utter devastation, step by step, is carefully crafted and touched with a dread terror that recognizes, though never states, that Christine knows that she herself is not safe around Rhoda, let alone anyone else. Her response to that knowledge is telling; she is the mother of a murderess, after all. The performances of Henry Jones as the unsavory handyman the audience ends up wanting Rhoda to put out of our misery and Eileen Heckart as the bereft and alcoholic mother of Rhoda's dead schoolmate are both stand-outs. Again, look to the time of the filming. People had no access to the psychiatric and sociological services both of these two characters needed in spades. People like them were out there in the 50's, more of them than we -- five decades or so later -- want to think, and without help or restraints we expect to come naturally now. Terrifying or pitiable, they were there when the movie was made. I read the book before I saw the movie, so I expected the original ending and was somewhat disappointed that it was changed. But the add-on tag is yet another level of good v. evil, one the audience might embrace emotionally if not intellectually, and perhaps more reflective of other beliefs of the 1950's, also. Beware if the Penmarks move in next door. They may not be good neighbors, no matter how much they smile and compliment you. After all, it runs in the family. Oh, and as Christine Penmark had to do, take a long look at your own...."
      ],
      "genres": [
         "Drama",
         "Horror",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": ["Warner Bros."],
      "summaries": [
         "Christine Penmark seems to have it all: a lovely home, a loving husband and the most \"perfect\" daughter in the world. But since childhood, Christine has suffered from the most terrible recurring nightmare. And her \"perfect\" daughter's accomplishments include lying, theft and possibly much, much worse. Only Christine knows the truth about her daughter and only Christine's father knows the truth about her nightmare.",
         "Colonel Kenneth and Mrs. Christine Penmark are a loving couple, which makes it difficult in their lives when the colonel is transferred to Washington D.C. While the colonel is gone, Christine is left to take care of their eight year old daughter, Rhoda, on her own. Rhoda is a little princess of a girl, always wearing pretty dresses and with her hair always in perfect pigtails. Rhoda strives for perfection and feels she deserves whatever nice things comes her way, since she is continually asking for gifts beyond what people are already willing to give. Although Christine loves her daughter as does the colonel, she feels that Rhoda perhaps is a little too mature for her age, not displaying those typical tendencies of most eight year olds. The one person who doesn't seem to like Rhoda is Leroy, the seemingly simple handyman of the apartment building in which the Penmarks live. Tragedy strikes when one of Rhoda's classmates, Claude Daigle, drowns in a lake while at a school picnic. Claude was recently discussed in the Penmark home as the boy who won the class penmanship medal, the medal which Rhoda felt she herself deserved. Rhoda shows no emotion about the tragedy. As the authorities and the parents discuss what happened, Christine increasingly believes that Rhoda knows more about Claude's death than she is willing to divulge. Although prone to the same dream for the better part of her life, Christine begins to wonder if that dream, which outlines an alternate childhood for herself, is really a dream or a repressed memory. That dream leads Christine to find out more about what Rhoda's true involvement in Claude's death is as well as the cause of other tragic deaths that have occurred around them.",
         "A housewife suspects that her seemingly perfect 8-year-old daughter is a heartless killer."
      ],
      "budget": 1000000
   },
   "movielensId": 2967,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1956-09-12",
      "dvdReleaseDate": "2004-08-10",
      "directors": ["Mervyn LeRoy"],
      "runtime": 129,
      "movieId": 2967,
      "title": "The Bad Seed",
      "mpaa": "NR",
      "actors": [
         "Patty McCormack",
         "Eileen Heckart",
         "Henry Jones",
         "Nancy Kelly",
         "Evelyn Varden",
         "William Hopper",
         "Paul Fix",
         "Jesse White",
         "Gage Clarke",
         "Joan Croydon",
         "Frank Cady",
         "Frances Bavier",
         "Shelley Fabares",
         "Patricia Morrow"
      ],
      "imdbMovieId": "0048977",
      "originalTitle": "The Bad Seed",
      "genres": [
         "Crime",
         "Drama",
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": ["fZt7gtFiVJk"],
      "plotSummary": "Young Rhoda Penmark is sweet, smart … and inherently evil! After a school chum dies during a picnic, no one suspects Rhoda, except the janitor of her apartment building. But when Rhoda's mother finds out that her own mother was a cold-blooded killer, she begins to suspect Rhoda might be the victim of some faulty genetics.",
      "tmdbMovieId": 42196,
      "avgRating": 3.69837,
      "releaseYear": "1956",
      "numRatings": 920,
      "posterPath": "/iAgSkpZslQ2s3onL9TaHbyWygtC.jpg"
   }
}