{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "widow",
            "id": 4129
         },
         {
            "name": "widower",
            "id": 33476
         }
      ],
      "imdb_id": "tt0061138",
      "video": false,
      "title": "A Man and a Woman",
      "recommendations": [
         53016,
         2813,
         42631,
         77915,
         43778,
         192104,
         190305,
         189995,
         259103,
         190280,
         189941,
         189591,
         116352,
         189448,
         228695,
         3424,
         47113,
         66027,
         42206,
         46278
      ],
      "backdrop_path": "/4nTiHqD1gwGzt9bFqs8ukDa6cCO.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Jean-Louis Duroc",
               "gender": 2,
               "credit_id": "52fe4615c3a36847f80ebcb3",
               "name": "Jean-Louis Trintignant",
               "profile_path": "/rvwO5Rsm2ZohPCQjwEvY30PBp68.jpg",
               "id": 1352,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Anne Gauthier",
               "gender": 1,
               "credit_id": "52fe4615c3a36847f80ebcb7",
               "name": "Anouk Aimée",
               "profile_path": "/vLGlUZvzffKEJ2zB943Qx0PWgPD.jpg",
               "id": 5682,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Pierre Gauthier",
               "gender": 2,
               "credit_id": "52fe4615c3a36847f80ebcbb",
               "name": "Pierre Barouh",
               "profile_path": null,
               "id": 70179,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Valérie Duroc",
               "gender": 1,
               "credit_id": "52fe4615c3a36847f80ebcbf",
               "name": "Valérie Lagrange",
               "profile_path": "/egWOTfWX1ZWZahrE2iwIP176xE4.jpg",
               "id": 39199,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "la directrice de la pension",
               "gender": 0,
               "credit_id": "52fe4615c3a36847f80ebcc3",
               "name": "Simone Paris",
               "profile_path": "/iy3CI9LKiWzHo7SLKReKoOXpXW5.jpg",
               "id": 111305,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Antoine Duroc",
               "gender": 0,
               "credit_id": "52fe4615c3a36847f80ebcc7",
               "name": "Antoine Sire",
               "profile_path": null,
               "id": 244518,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Françoise Gauthier",
               "gender": 0,
               "credit_id": "52fe4615c3a36847f80ebccb",
               "name": "Souad Amidou",
               "profile_path": "/6xCspZe3OdKrzwTcLFjOsm2ZH1s.jpg",
               "id": 146628,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "l'autre pilote",
               "gender": 0,
               "credit_id": "52fe4615c3a36847f80ebccf",
               "name": "Henri Chemin",
               "profile_path": null,
               "id": 327203,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "la maîtresse de Jean-Louis",
               "gender": 0,
               "credit_id": "52fe4615c3a36847f80ebcd3",
               "name": "Yane Barry",
               "profile_path": null,
               "id": 278332,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "le speaker radio",
               "gender": 0,
               "credit_id": "52fe4615c3a36847f80ebcd7",
               "name": "Gérard Sire",
               "profile_path": null,
               "id": 578327,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "un pilote de rallye",
               "gender": 0,
               "credit_id": "52fe4615c3a36847f80ebcdb",
               "name": "Gérard Larrousse",
               "profile_path": null,
               "id": 578328,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "un pilote de rallye",
               "gender": 0,
               "credit_id": "52fe4615c3a36847f80ebcdf",
               "name": "Clive Roberts",
               "profile_path": null,
               "id": 578329,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "le pompiste",
               "gender": 2,
               "credit_id": "52fe4615c3a36847f80ebcfb",
               "name": "Paul Le Person",
               "profile_path": "/ilGPm0RdkvEieIiGO6zjmYgM523.jpg",
               "id": 24477,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4615c3a36847f80ebcaf",
               "name": "Claude Lelouch",
               "profile_path": "/ngmASNQKQLSMriQajGZKaEcWcqc.jpg",
               "id": 16862,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4615c3a36847f80ebce5",
               "name": "Claude Lelouch",
               "profile_path": "/ngmASNQKQLSMriQajGZKaEcWcqc.jpg",
               "id": 16862,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4615c3a36847f80ebceb",
               "name": "Pierre Uytterhoeven",
               "profile_path": null,
               "id": 24455,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4615c3a36847f80ebcf1",
               "name": "Francis Lai",
               "profile_path": null,
               "id": 19607,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4615c3a36847f80ebcf7",
               "name": "Pierre Barouh",
               "profile_path": null,
               "id": 70179,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 4.585284,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 42726,
      "vote_count": 46,
      "budget": 0,
      "overview": "A man and a woman meet by accident on a Sunday evening at their childrens' boarding school. Slowly, they reveal themselves to each other, finding that each is a widow.",
      "similar": [
         441728,
         40787,
         158800,
         10779,
         1587,
         866,
         13885,
         13223,
         1429,
         284276,
         441701,
         403,
         82525,
         1266,
         10862,
         11704,
         11305,
         37257,
         9663,
         395814
      ],
      "original_title": "Un homme et une femme",
      "runtime": 102,
      "poster_path": "/gqzc2QioT9cg3PhVVhuaHfw9Ayh.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Les Films 13",
         "id": 1742,
         "origin_country": ""
      }],
      "release_date": "1966-01-01",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Claude Lelouch"],
      "runtime": 102,
      "synopsis": null,
      "writers": ["Pierre Uytterhoeven"],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0061138/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI5MzU4NTI3OF5BMl5BanBnXkFtZTcwODM2NjIyMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Anouk Aimée, Jean-Louis Trintignant, Pierre Barouh | See full cast and crew »"],
      "reviews": [
         "That night Anne Gauthier (Aimée) missed her train\u0085 Jean-Louis Duroc (Trintignant) offered her a ride back to Paris\u0085 Both had their children at the Deauville boarding school\u0085 She has a girl named Françoise and he has a boy named Antoine\u0085 Jean-Louis knew that her husband was a stuntman who had a tragic accident\u0085 She knew that he was married and his wife commits suicide\u0085 Claude Lelouch begins his sensitive exploration on that boat ride where there was a completely different energy in the air, where the sea was seen alive in all its many mood and through intentions looks, and lingering hands he let us know that yes, something was beginning to happen between Anne and Jean-Louis\u0085 On that wonderful beach\u0097and through long shots\u0097we see the couple with their children walking, playing, running with hundreds of seagulls screaming all around\u0085 There was a great chemistry between Aimée and Trintignant in \"A Man and a Woman\"\u0085 The attraction between the two stars really resonated\u0085 Aimée was very sweet and gorgeous as a woman, but her constant incursions into the past left her experience with more sorrow than joy\u0085 Trintignant was charming\u0085 His acting extremely natural\u0085 When he received Anne's telegram he left his elegant dinner and took his car driving hundreds of kilometers to join Anne and be with the children\u0085 Lelouch captures breathtaking shots of Deauville's spectacular beach\u0085 We all remember the unforgettable scene of the man walking alike as his dog\u0085 The film won Oscars for Best Original Screenplay and Best Foreign Language Film\u0085",
         "This film moved me as a 21-year-old college student with almost no experience in romance, relationships, etc. It has remained a favorite for 34 years now. I think as highly of it with many experiences in life and love as I did with none. It is simply excellent.",
         "I saw this film twice when it came out in 1966. The leading characters are quite handsome and appealing to watch. At the time I loved the music soundtrack and even bought the soundtrack album. Seeing it is available on DVD and has some bonus footage, it was a real pleasure to watch this film again, as a bonus, with my second wife. Although it seems a bit dated and many films have copied elements of its style, it still captures and stirs the emotions about the possibility of falling in love and the reality of being a \"walking wounded\" mid 30's single person. The bonus footage showing how the film was made on the cheap with minimum rehearsing is quite amazing. Films today are often made for hundreds to thousands times the cost, and are as spontaneous as a log pile. I recommend a revisit to this film, but imagine today's young film watchers could be bored with the absence of violence, swearing, kinky sex, and other predictable ingredients of today's formula films. one amusing feature which dates the film is the near chain smoking both stars in the film keep doing on screen. That is mostly not cool these days.",
         "This is a movie that resonated to my core. I identified with the main character on numerous levels. First, the way he responded to his feelings about her; the way he took a chance and \"went for it.\" The way he responded to her telegram at the ball. He jumped in his car and drove another few hundred miles to be with her; I have taken an equivalent leap in my own life, and never have regretted it. One doesn't get many such chances in this world. The way he drove again and met her train in Paris. One must grab for the gold ring when it comes around and hang on. One must be willing to risk looking ridiculous on occasion in order to have a shot at winning the Big Prize. I know, I'm a hopeless romantic. I love being a hopeless romantic. I know, most of the heavyweight reviewers have been somewhat lukewarm about this movie. Doesn't bother me a bit.",
         "I'm a total sucker for foreign films from the 1960s, even though I have not seen as many as I should. This is one of the best, in my experience. Nothing really happens, but the chemistry between the leads, the strangely non-nominated soundtrack and the overall atmosphere make it completely memorable and worthwhile. I am glad it did well at the Oscars and that its gained a certain amount of 'classic' status. There are probably critics who didn't think it was a big deal, too. Several of the scenes seemed improvised, like the one where the leads are in a café with their children. Can't wait to see it again. 10/10.",
         "`A Man and A Woman (Un homme et une femme)'. ****. (1966, France, Not Rated 102 min. Directed by Claude Lelouch with Anouk Aimée, Jean-Louis Trintignant). I recently watched `Lumière and Company' which celebrates the 100th Anniversary of the movie industry. Forty directors from around the world produced 52-second films using the Lumière camera. The fifty-two second time limit and other constraints follow the construct of the first Lumière movie. Of the 40 films, the by-far-and-away best is the one of two lovers kissing. The man and woman are on a rotating stage so we get a 360-degree view of their kiss. In the background we see photographers each with progressively more modern cameras. The love or passion of the man and the woman don't change only the way we are able to view them now and then. So what does this have to do with Claude Lelouch's 1996 movie, `A Man and A Woman'? Well he's the director that made the above mentioned film and it reminded me that it has been years since I last watched `A Man and A Woman.' I rented and watched it again. Jean-Louis Duroc (Trintignant) and Anne Gauthier (Aimée) are a man and woman. They meet incidentally at the boarding school where they visit their children each weekend. He visits his son, she her daughter. She misses her train and he offers her ride back to ride back to Paris in his car. Slowly and cautiously we learn about them as they learn about one another. We learn about their jobs, their former spouses, and other details of their lives that have the movie viewer hoping this man and woman can become a couple. Lelouch's technique in telling the story is wonderful. The film switches from black and white to color. The switch usually comes on the change from person-to-person conversation to personal thoughts or a recounting of the past. It's like Lelouch is using this change as quotation marks or thought balloons on the screen. We see/hear Jean-Louis' and Anne's thoughts as they question their feelings about beginning a new personnel relationship. I first saw this movie as a college student in 1966. I really liked it then. I wondered if I'd liked it now. The movie hasn't changed but I can assure you I have. `A Man and A Woman' proves that a good story, well told can be appreciated now and then. I highly recommend that you rent and watch `A Man and A Woman.'",
         "I was a film major and saw this movie in a class and it became my No.1 movie immediately and has been ever since. This film is where you think maybe movie can be art and really influence people's life. the storyline is simple but the mood of the film is so deep but natural. I especially like the part when Anne and Jean-Louis walk on the beach in the late afternoon and talk about the story of an artist and his cat. Lelouch did the love story about two mid-age parents when he was 28 and he did a brilliant job. He couldn't afford all colored film but he totally made this film a colored/ black-and-white style classic. The only scene looks bad in color and should be in black-and-white is the scene with Jean-Louis's ex. a great movie and it doesn't age at all.",
         "It is so refreshing to watch a movie like this one. Those comparing it with Hollywood standards such as the density of the plot, the stunts or 'the sex scene' would be wise to take another look. Such standards cannot be applied here. Lelouch plays with colors, objects, and our natural capacity for associative memory to tell us what is neither written nor spoken. The main actors, Jean-Louis Trintignant and Anouk Aimée master the art of expressing the message. Dialogs are far from poor, but the meaning sometimes has to be found in their tone, their breaks, their pace or, again, the characters' play. What would be cinema for if these were useless ?",
         "A Man and a Woman (1966)**** Simple and brilliant love story about one week in lives of a french widow and a widower is enriched by inventive cinematography and directing (by Lelouch), great performances (Aimee and Trintignant) and amazing score (by Francis Lai). Very unique and subtle script (by Lelouch and Uytterhoeven) was worth an Oscar. This movie also deservedly won Cannes Golden Palm and Foreign Language Oscar. Music score was, however, neglected by Academy but remains memorable today (after 40 years) and is often used in similar (would-be) movies. It also inspired a sequel \u0096 A Man and a Woman: 20 Years Later - in 1986. also directed by Lelouch. However, it was a major disappointment with lack of any real sense and various unnecessary subplots. Except of stunning opening car race sequence. (I would recommend a sequel only because of this).",
         "I personally think that this movie is one of the greatest ever made concerning the emotional-romantic content. Yesterday I had the chance to see it, but unfortunately I missed the part of the flashback (thanks to the visit of some friends grrrrr!) when he had the car accident, his then wife is in the hospital, blah, blah, blah, so I have no idea what went on in Jean-Louise life before meeting Ann. If anyone can let me know what happened, please tell me!! I loved the end and I wept like crazy from the moment she sort of regretted her relation with him because of his late husband memories 'till the moment he waits for her at the train station... she arrives... they hug each other , and sha-la-la-la-la! What a great movie!!"
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Les Films 13"],
      "summaries": [
         "A man and a woman meet by accident on a Sunday evening at their childrens' boarding school. Slowly they reveal themselves to each other, finding that each is a widow/widower. Each is slow to reveal anything personal so that each revelation is hidden by a misperception. They become friends, then close friends, and then she reveals that she can't have a lover because, for her, her husband's memory is still too strong. Much of the film is told wordlessly in action, or through hearing one of their thoughts as they go about their day.",
         "Paris based race car driver Jean-Louis Duroc and movie script supervisor Anne Gauthier - both widowed - meet when they drop off their respective adolescent children, Antoine and Françoise, at their Deauville boarding school after their regular weekend outings. Despite being attracted to each other, they are guarded with each other, speaking as if their respective spouse were still alive. Initially, they spend time together in their weekend outings with their children. As they get to know each other, as their attraction grows, and as their true marital status comes to light, they each make calculated moves to advance their relationship, however slowly and cautiously each still is in this venture. However, each must overcome some emotional baggage with which each is burdened, most specifically around their respective former spouse."
      ],
      "budget": 0
   },
   "movielensId": 2969,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1966-01-01",
      "dvdReleaseDate": "2003-03-18",
      "directors": ["Claude Lelouch"],
      "runtime": 102,
      "movieId": 2969,
      "title": "A Man and a Woman",
      "mpaa": "",
      "actors": [
         "Jean-Louis Trintignant",
         "Anouk Aimée",
         "Pierre Barouh",
         "Valérie Lagrange",
         "Simone Paris",
         "Antoine Sire",
         "Souad Amidou",
         "Henri Chemin",
         "Yane Barry",
         "Gérard Sire",
         "Gérard Larrousse",
         "Clive Roberts",
         "Paul Le Person"
      ],
      "imdbMovieId": "0061138",
      "originalTitle": "Un homme et une femme",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["ERe7FGUEtE8"],
      "plotSummary": "A man and a woman meet by accident on a Sunday evening at their childrens' boarding school. Slowly, they reveal themselves to each other, finding that each is a widow.",
      "tmdbMovieId": 42726,
      "avgRating": 3.843,
      "releaseYear": "1966",
      "numRatings": 707,
      "posterPath": "/gqzc2QioT9cg3PhVVhuaHfw9Ayh.jpg"
   }
}