{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0142201",
      "video": false,
      "title": "Crazy in Alabama",
      "recommendations": [
         43638,
         83489,
         61280,
         78691,
         73249,
         54933,
         24936,
         38953,
         42134,
         46021,
         87358,
         58467,
         19958,
         50043,
         38294,
         41963,
         32059,
         223042,
         41944,
         10445
      ],
      "backdrop_path": "/n5kP33efxqphJhhBbxuGhGFb0Vc.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Lucille Vinson",
               "gender": 1,
               "credit_id": "52fe44729251416c910110d1",
               "name": "Melanie Griffith",
               "profile_path": "/rdRjFsPQDQqPE8JlDQcuT5JDpED.jpg",
               "id": 29369,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Dove Bullis",
               "gender": 2,
               "credit_id": "52fe44729251416c910110d5",
               "name": "David Morse",
               "profile_path": "/5PuSGfBw3Hsdo5jkhZ59NDFCZUm.jpg",
               "id": 52,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Peter Joseph 'Peejoe' Bullis",
               "gender": 2,
               "credit_id": "52fe44729251416c910110d9",
               "name": "Lucas Black",
               "profile_path": "/41qZZc6vRVm5ZOoXWfEf5NGoIZR.jpg",
               "id": 155,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Earlene Bullis",
               "gender": 1,
               "credit_id": "52fe44729251416c910110dd",
               "name": "Cathy Moriarty",
               "profile_path": "/sxSwB6uVUMjmeCw3XZzZytbqgRp.jpg",
               "id": 14702,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Sheriff John Doggett",
               "gender": 2,
               "credit_id": "52fe44729251416c910110e1",
               "name": "Meat Loaf",
               "profile_path": "/43nyfW3TxD3PxDqYB8tyqaKpDBH.jpg",
               "id": 7470,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Judge Louis Mead",
               "gender": 2,
               "credit_id": "52fe44729251416c910110e5",
               "name": "Rod Steiger",
               "profile_path": "/cc96tXM1O0PAoyog9hzo1GgSwB5.jpg",
               "id": 522,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Norman the Chauffeur",
               "gender": 2,
               "credit_id": "52fe44729251416c910110e9",
               "name": "Richard Schiff",
               "profile_path": "/gHFxL7MIGvmcbg5hhTNrbjIttQN.jpg",
               "id": 31028,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Nehemiah Jackson",
               "gender": 2,
               "credit_id": "52fe44729251416c910110ed",
               "name": "John Beasley",
               "profile_path": "/i3p3yH1DfxNqnD3DnUFvM1suFBR.jpg",
               "id": 38571,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Harry Hall",
               "gender": 2,
               "credit_id": "52fe44729251416c910110f1",
               "name": "Robert Wagner",
               "profile_path": "/nlRWGpsQPo8sSFdl8larlPUy1rS.jpg",
               "id": 9208,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Sheriff Raymond",
               "gender": 2,
               "credit_id": "52fe44729251416c910110f5",
               "name": "Noah Emmerich",
               "profile_path": "/iTPoDQq2R5zU17hRwLtWkm2gCmK.jpg",
               "id": 11315,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "D.A. Mackie",
               "gender": 2,
               "credit_id": "52fe44729251416c910110f9",
               "name": "Paul Ben-Victor",
               "profile_path": "/80xWsGSGwTektmHd9xcPdqeOmlI.jpg",
               "id": 85142,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Sondra",
               "gender": 1,
               "credit_id": "52fe44729251416c91011103",
               "name": "Dakota Johnson",
               "profile_path": "/razONK0A0UUZUCtxLryQwodNzWO.jpg",
               "id": 118545,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Sally",
               "gender": 1,
               "credit_id": "5305b02fc3a3685a9e15f048",
               "name": "Fannie Flagg",
               "profile_path": "/nelYB0M6WvF7uwArMwhYJZZkyjv.jpg",
               "id": 18251,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Organizer",
               "gender": 0,
               "credit_id": "5596fd5d9251413d91000166",
               "name": "Barbara Tasker",
               "profile_path": null,
               "id": 1484155,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44729251416c910110ff",
               "name": "Antonio Banderas",
               "profile_path": "/85197jARsr06xQ84NhP9YoBL3sR.jpg",
               "id": 3131,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "57b9ebb59251413618000e95",
               "name": "James Dyer",
               "profile_path": "/nj7U5fz4SVIuibmGkxl97mGZgs3.jpg",
               "id": 58471,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "57b9edaa925141361e000ed0",
               "name": "James Dyer",
               "profile_path": "/nj7U5fz4SVIuibmGkxl97mGZgs3.jpg",
               "id": 58471,
               "department": "Production",
               "job": "Unit Production Manager"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.722126,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 31306,
      "vote_count": 25,
      "budget": 0,
      "overview": "An abused wife heads to California to become a movie star while her nephew back in Alabama has to deal with a racially-motivated murder involving a corrupt sheriff.",
      "similar": [],
      "original_title": "Crazy in Alabama",
      "runtime": 111,
      "poster_path": "/pomzJulFwRudsJUYWaPsmxSE9Ai.jpg",
      "spoken_languages": [
         {
            "name": "Magyar",
            "iso_639_1": "hu"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Pусский",
            "iso_639_1": "ru"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Green Moon Productions",
            "id": 4434,
            "origin_country": ""
         },
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         }
      ],
      "release_date": "1999-10-22",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Antonio Banderas"],
      "runtime": 111,
      "synopsis": "This film moves back and forth between its two main characters. 1- Peejoe Bullis (Lucas Black) and his brother Wiley (David Speck) are orphans who live with their grandmother (Sandra Seacat). 2- Lucille Vinson (Melanie Griffith) kills her husband Chester because he won't let her go to Hollywood to star in the sitcom Bewitched, where she has been cast on a 2-episode role. Lucille is Peejoe and Wiley's aunt, and the sister of Dove, another uncle of the two boys. When Lucille goes to Hollywood with Chester's head in a Tupperware container after having poisoned him with rat poison, she leaves her seven children with her mother, so Grandma has no more place for Peejoe and Wiley. They have to go to live with Uncle Dove (David Morse), and his wife Earlene (Cathy Moriarty). Dove tells sheriff John Doggett (Meat Loaf), that they don't know where Lucille is heading for. On her way to New Orleans, Lucille can hear Chester's head talking to her (represented by the voice of Brent Briscoe), making sarcastic comments. The assistant at the Fleur de Lys hat shop (Marion Zinser) is a bit sarcastic at the beginning as well, but she is not so when Lucille buys a 500-dollar couture hat because she needs the hatbox to put Chester's head in. Later, Lucille stops at a bar, and a barman (John Fleck) thinks she is a whore and is rude to her. She gets annoyed, and steals the barman's money and car. Later on, she stops at a road coffee shop. There, Sally (writer Fannie Flagg) is a waitress, and realizes Lucille's being sought by the police, but she doesn't give her in. She talks to her for a while, and then she tells her to go without paying saying \"it is on me\". Because of the stolen car, Lucille gets pulled over by a police officer, who gets all excited hearing the story she is telling with sexual overtones. When they are kissing, Lucille handcuffs the police officer and steals his gun, although she leaves it outside the police station. Back home, Peejoe sees black people queueing up to register for voting although it's illegal in Alabama, and focuses on 17-year old Taylor Jackson (Louis Miller). Peejoe and Wiley go to a small swimming-pool, the only one in town but only-white. Taylor jumps in the pool, and all the white people get out of the pool, except Peejoe. Peejoe watches how the sheriff kills Taylor when he was running away from him, pulling him down from a railing, hitting his head on the cement and killing him. Later, Peejoe has an incident with a lawn mower, which hits him in an eye with a golf ball, and everybody wants to think he was attacked by the sheriff. Peejoe will carry a patch in his eye for almost the rest of the film. At the funeral, Peejoe parades with Taylor's mourners. He coaxes Wiley into following him. They all finish at the same pool, singing and jumping in, only to be disbanded by the sheriff. A Look magazine photographer (Michael Arata) is there, and takes a close-up picture of Peejoe's face. Peejoe is considered a hero, although he insists he only happened to be there. When Martin Luther King (Dudley F. Craig II) arrives in town -we never see his face-, Peejoe is introduced to him, and they shake hands. Lucille had earned some money in Las Vegas, having the time of her life playing roulette and shagging a very handsome bellboy (Brad Beyer). Eccentric limousine driver (Richard Schiff) takes her to Hollywood, where her agent Harry Hall (Robert Wagner) is expecting her. She presents herself under the name of Caroline Clay. There, bitchy actress Joan Blake (Elizabeth Perkins) is rude to her. Lucille works on the set of Bewitched, with the stand-in actors (Charlie Dell, Oliver Clark and Tracy Griffith) giving her the cue lines. Hall thinks Lucille should appear in films as well. At a party, the bitchy actress investigates what's in the hatbox, because her badly-behaved dogs are snuffing at it. When she sees Chester's head, she walks stiffy and dizzily, goes through a closed window and drowns herself out of shock, but nobody suspects Lucille had anything to do with it. Norman drives her out of the party. Back in Alabama, Earlene complains because the whole town is ostracizing her, because of Peejoe's involvement with the cause. She wants the two siblings out of her house, but Dove won't allow it. In the middle of the discussion, they see Lucille's episode on TV. They stop quarrelling and they watch it in amazement. Back to Hollywood, when Lucille is about to throw Chester's head from the Golden Gate Bridge, all her money -kept in a red bag- slips away. She tries to retrieve it. Two patrolmen (Kirk Fox and Jordan Lund) ask her questions, because they think she's trying to commit suicide, and that's when one of them see all the money and the head in the hatbox. Lucille is discovered and sent back to Alabama, where she could be sentenced to the electric chair. Peejoe and Dove have been talking to FBI Agent Murphy (William Converse Roberts) in secret, but Dove is afraid of Peejoe's security and doesn't want him to testify. Nehemiah Jackson (John Beasley) is Taylor's grandfather. He's in prison as well, because of his demonstrations and parades. He gives Lucille something to eat. Judge Louis Mead (Rod Steiger) is an eccentric man, who makes Lucille's children go away, in order not to influence the jury. At one moment in the trial, he wants to talk to Lucille alone. She's pleading self-defence and sanity. When Peejoe testifies, he says that there is a deal between sheriff Doggett and Dove: if he doesn't accuse the sheriff of Taylor's murder, Lucille will not be given the death penalty. Later in the trial, Lucille tells the jury how Chester abused and mistreated her and her children -all with cinema stars' names like Marlon, Rock, Marilyn... (Dane Le Blanc, Dakota Johnson, Estella del Carmen Banderas and Jackson Isaacs) However, the jury isn't adamant to feel pity for her, and they find Lucille guilty on all counts. Outside the courtroom, Murphy arrests sheriff Doggett, who is unrepentant. Dove asks Peejoe if he had planned it all, and he said it just came to him in the spur of the moment. Dove tells Peejoe that that was something he couldn't run from, so that he won't have the opportunity to change his mind. Peejoe is happy about that. Judge Mead gives a long speech when sentencing Lucille. He says the jury wants Lucille to go to the electric chair, but that he has never sent a woman there. He doesn't think she's a danger to anybody, except her late husband. First he sentences her to 20 years, then he suspends the sentence and makes it a 5-year probation sentence, if she seeks psychiatric counselling. Lucille can go free, although the prosecutor shouts and is really angry. Outside the court, Norman is waiting with a car and a bunch of flowers. He and Lucille go away with all of Lucille's children, presumably back to Hollywood. Back in Alabama, the town is filling the pool with cement, because a judge has ruled it should be integrated (be for everybody, not only for white people). Peejoe and Wiley find it ludicrous. They go away fishing with a black friend, and he says that now nobody has a pool.",
      "writers": [
         "Mark Childress",
         "Mark Childress"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0142201/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM2MzgwMjEwMl5BMl5BanBnXkFtZTYwMzgxOTE5._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Melanie Griffith, David Morse, Lucas Black | See full cast and crew »"],
      "reviews": [
         "One doesn't tend to expect much from an actor's directorial debut, especially from a relatively young actor and especially from one who seemed to have risen to fame at least partially by being, um, well, a studmuffin. One also typically expects a movie in which a husband directs his wife in a lead role to be fairly shallow or at least unbalanced. I crossed this movie off my list pretty early, expecting a forgettable Griffith-overload creation and little more. Wrong! It's well-acted, engrossing, funny, and uplifting without feeling schmaltzy or (despite its farfetched plot) artificial. Every so often you want to rewind a bit, to hear some extra-cute bit of dialog again, or savor an especially well-done shot. (The camera work and sets, both indoor and outdoor, show unusual care, flash, and detail; this didn't dawn on me for most of the first hour but a rewind made it obvious.) Overall, 9 stars out of ten. But: I wouldn't urge anyone to see this movie for Melanie Griffith. She does a fine job, but she's not what puts it over the top. As with quite a few recent films, I found that the performances of the extremely well-chosen supporting actors were a big part of what held the film together and made it so much more than it might have been. Most notable here is Rod Steiger as the judge, who captivates utterly; John Beasley as Nehemiah -- though his character could have stood a lot more development; and the perpetually underrated Meat Loaf as the slimy sheriff. Performances like Steiger's make you want to ransack the video store to rent all his older films. Finally, I believe Lucas Black is destined for greatness. I couldn't watch him without remembering River Phoenix as Chris in \"Stand By Me.\" Why this film doesn't even rate a Maltin summary is beyond me.",
         "I wasn't sure what to expect of this film but afterwards I was glad I had watched it. Great performances, esp. from Meatloaf and Lucas Black. He's going to be a star when he's older! When I saw that Antonio Banderas had directed it, I thought \"Oh, here's another one of those films where the actor/director has to put his wife in the leading role.. blah blah blah\" but it was a really good film. Overall, I give it a 8/10.",
         "A real treat, much better than it had any right to be. It's the 1960s in Alabama and Lucille (Melanie Griffith) murders and decapitates her abusive husband Chester, and heads to Hollywood with his head. Meanwhile back home, segregation is being fought in her small town. Our narrator is Lucille's nephew, he is living with his uncle (David Morse), witnessing the evil of the town sheriff (Meat Loaf) and trying to make sense of the civil rights movement. This is an odd, yet ultimately successful, merging of two very different stories. The Alabama civil rights story is a gentle, human drama, while the Lucille story is broadly colored, with flashy costumes, comical characters, and tart dialogue. Lucille dazzles everyone who meets her, and everything goes her way, despite the fact that Chester's head continues to speak to her, calling her a slut who'll never amount to anything. I can't explain why the surreal comedy works so well in parallel to the small town drama, but it does. Griffith is compelling -- her husband, Antonio Banderas, directs her as he sees her, the camera keeps finding the perfect woman; thrilling, sensual and sweet. In the \"featurette\" on the DVD, both Griffith and Banderas say the movie is about freedom, and the stories parallel well because Lucille's freedom from her husband's oppression parallels the blacks' freedom from civil oppression. But I saw it more as an R.D. Laing movie. The truth of Crazy in Alabama is in its title -- sanity IS a sane answer to an insane world. The nation WAS watching Bewitched and shopping for hats while blacks were beaten to death for the right to use whites-only facilities. \"Crazy,\" in this movie, defies definition -- what is individual craziness when the world goes crazy? Lucille's craziness is sweet and understandable; the world's, less so. 9/10",
         "Crazy in Alabama is a great movie the depicts the changing of the world in the 1960s in the south as well as one woman's adventure and dreams. Lucille was a woman abused by her husband for many years and finally had enough. In one foul swoop she killed her husband and ran for Hollywood talking his head with her on her new found freedom. Griffith as the free spirited Lucille is fantastic. Other actresses could have made this character a lot more sinister or evil but Griffith made her some one that you could relate to. The other story line is that of Lucille's nephew P. Joe, whom she left behind in Alabama. He is dealing with the aftermath of Lucille's departure from Alabama and all of the racism and hatred that is in his town. Meatloaf is great as the racist police chief that has a personal vendetta against Lucille, P. Joe and his family. This movie is very touching and I believe that Banderas did a good job at directing. I home that he continues he will do more projects in the future that have this kind of caliber. I recommend that you watch this movie because it is great for viewing at home.",
         "I am in the process of trying to clean out an oversupply of VHS tapes and some of them are so easy to toss. Not this one. I had to sit down and watch it again and now I could only get rid of the VHS if I had it on DVD! I have not watched this movie in more than six years and it was \"feel good\" and \"feel\" all over again. David Morse is always wonderful. Lucas Black, Cathy Moriarty, Meat Loaf, Elizabeth Perkins, and many others are just a treat to watch. There's something about Melanie. I can't help liking her - even when I am finding fault with her. This movie really is strange with its incredibly serious (and gruesome) subject matter of a woman who methodically murders and decapitates her husband and then carries his head around with her - first in Tupperware and then in a very stylish hat box! The surprising part is that there is any plausibility at all, but it somehow existed for me. It had a strange feeling floating about it that was akin to \"Forrest Gump\" or \"Nurse Betty\", because it involved situations that were truly horrible, but everything kept working out for a sweet and naive character. The civil rights story was a very poignant counterpoint to the fantastic silliness of Lucille's odyssey. If I were a film student I may have sat there and criticized the way things came together, but I just watched it with an untrained eye, so it was fine. I certainly would have made the connection about a freedom theme even if they hadn't come out and stated it in the end. No one says a story has to be believable or plausible for it to work. This did work. I laughed a lot when I least expected to.",
         "I had seen the trailers several times for this movie before running across it in the video store looking through the titles for something I had not seen. After seeing it, I wondered why I had not heard more of it. The trailers did not give away anything about this wonderfully written script. Antonio Banderas did a great job in direction, but Lucas Black stole the show with his acting. After thinking he was masterful in \"Sling Blade,\" it was great seeing him get another role to show off his talents. Steiger was perfect for the role, although anyone could have played the Robert Wagner role. However, seeing such big stars playing cameos, should tell you that the script was a great read. I don't want to give you any insight into the story line, because it is so well interwoven that it has to be seen to understand. It gets nicely tied up in the end from a small statement from Lucas Black. Melody Griffith has not always been a favorite of mine, mostly because she does always pick roles that she fits, but in this one, I cannot imagine anyone else fitting the role. She did an excellent job. I say that, because there were parts where I forgot it was her, and got caught up in the actual character she was playing. This is one that is definitely worth a look. The overtones of the era are played nicely and figure greatly in the story line. Why it was overlooked when the big awards came out, I have no idea. This one should have won something. It is that good.",
         "Aunt Lucille just could not stand her husband destroying her life. After poisoning and beheading her \"problem,\" she leaves home for Hollywood or bust, the latter not being an option. Meanwhile back at the ranch, poor Pee Joe gets into trouble from the the law. He is not actually in trouble, but a key witness to a murder the sheriff committed. The movie feels great, and Melanie Griffith does an excellent job playing the \"crazy\" Lucille. Stand out belongs to the actor who played Judge Mead, who's over the top role was excellently done. Feel good slow pace may make everything feel lame compared to other movies of the time (let's face it, this movie does not have special eye candy for people's attention). Not a movie to see in the theater, but a good one to wind down to.",
         "A woman chops her husband's head off and leaves a punch of kids behind to go fill her dream to become a movie star. The name of this movie is a rather good description. But behind this crazy story line this movie holds a truly honest, sarcastic, picture of a strong, loving woman. In addition there is another story of a boy who will also become a star even without wanting to become one. In the middle of racism this boy becomes a hero while standing against this oppression. This part of the movie is quite naive, but that didn't bother me, not a bit. The actors did their job not only well, but great. I know I'm not very critical person, but I really loved this movie and I think I could watch it again and again just to get some energy and to regain my sometimes vanishing positivity. I was amazed not to see this movie in the top 250. I really believe it belongs there. I've seen Shawshank Redemption and I think this movie, while lighter, doesn't fall far behind.",
         "Crazy In alabama is one of the best movies of the year. Antonio Banderas did an awesome job as a director and Melanie Griffith is outrageous. It truly reveals the feelings of the 50s, the quest for freedom , and the insanity of racism.",
         "I have such a high opinion of the book from which this was made that I should've been better prepared to be disappointed with any film version, but it seems my guard was down. It's not a BAD movie, actually is pretty entertaining while maintaining the high points of the book. The book, however, is both funnier and more touching. The Eudora Welty-ish family central to the story is much more clearly described in the book, and seems comparatively flavorless in the movie. Writing with any depth and substance is hard to translate to film, but is has been done; see the Jessica Tandy version of Truman Capote's \"A Christmas Memory.\" If you haven't read the book you'll probably like this just fine. If you're a fan of the book, be forewarned that the film is not going to be the same experience."
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Drama"
      ],
      "productionCompanies": [
         "Columbia Pictures Corporation",
         "Green Moon Productions",
         "Global Entertainment Productions GmbH & Company Medien KG"
      ],
      "summaries": [
         "A backwoods Alabama boy named Peejoe -short for Peter Joseph- gets a quick education in grown-up matters like freedom in 1965. The catalyst is an unlikely source - his glamorous, eccentric Aunt Lucille, who escapes from her abusive husband and takes off for Hollywood to pursue her dreams of TV stardom.",
         "An abused wife heads to California to become a movie star while her nephew back in Alabama has to deal with a racially-motivated murder involving a corrupt sheriff."
      ],
      "budget": 15000000
   },
   "movielensId": 2977,
   "movielens": {
      "languages": [
         "Magyar",
         "English",
         "Pусский"
      ],
      "releaseDate": "1999-10-22",
      "dvdReleaseDate": "2000-03-28",
      "directors": ["Antonio Banderas"],
      "runtime": 111,
      "movieId": 2977,
      "title": "Crazy in Alabama",
      "mpaa": "PG-13",
      "actors": [
         "Melanie Griffith",
         "David Morse",
         "Lucas Black",
         "Cathy Moriarty",
         "Meat Loaf",
         "Rod Steiger",
         "Richard Schiff",
         "John Beasley",
         "Robert Wagner",
         "Noah Emmerich",
         "Paul Ben-Victor",
         "Dakota Johnson",
         "Fannie Flagg",
         "Barbara Tasker"
      ],
      "imdbMovieId": "0142201",
      "originalTitle": "Crazy in Alabama",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["N087EJuQudM"],
      "plotSummary": "An abused wife heads to California to become a movie star while her nephew back in Alabama has to deal with a racially-motivated murder involving a corrupt sheriff.",
      "tmdbMovieId": 31306,
      "avgRating": 2.7167,
      "releaseYear": "1999",
      "numRatings": 443,
      "posterPath": "/pomzJulFwRudsJUYWaPsmxSE9Ai.jpg"
   }
}