{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0099710",
      "video": false,
      "title": "The Guardian",
      "recommendations": [
         36599,
         41971,
         28762,
         15711,
         49365,
         47045,
         38772,
         73218,
         83489,
         49126,
         38222,
         40549,
         41374,
         28498,
         13549,
         40060,
         4928,
         56705,
         66192,
         37464
      ],
      "backdrop_path": "/gRQEPYD5vQuUYaA3LOAT5JwUyQz.jpg",
      "revenue": 17037887,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Camilla",
               "gender": 1,
               "credit_id": "52fe44b49251416c91019f6f",
               "name": "Jenny Seagrove",
               "profile_path": "/9hdSZS8XnJkGpn89BiNpwoxxbyo.jpg",
               "id": 36820,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Phil",
               "gender": 2,
               "credit_id": "52fe44b49251416c91019f73",
               "name": "Dwier Brown",
               "profile_path": "/qipSMklcWJtFjxILumRzywancMt.jpg",
               "id": 23974,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Kate",
               "gender": 1,
               "credit_id": "52fe44b49251416c91019f77",
               "name": "Carey Lowell",
               "profile_path": "/2NbOMG1sab6uNSuedsgYM0hQ0lp.jpg",
               "id": 10679,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Ned Runcie",
               "gender": 2,
               "credit_id": "52fe44b49251416c91019f7b",
               "name": "Brad Hall",
               "profile_path": "/2YRqEMFBKLqwj3l3ejh1pT112MF.jpg",
               "id": 70743,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Ralph Hess",
               "gender": 2,
               "credit_id": "52fe44b49251416c91019f7f",
               "name": "Miguel Ferrer",
               "profile_path": "/fvRncqShcaV8R45IJGYZ7IAvrsO.jpg",
               "id": 15860,
               "order": 4
            },
            {
               "cast_id": 19,
               "character": "Molly Sheridan",
               "gender": 1,
               "credit_id": "53969ef0c3a3684f4500337c",
               "name": "Natalija Nogulich",
               "profile_path": "/4NKMj3FHdZUGWmvcCiayw9nwWVa.jpg",
               "id": 65017,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Gail Krasno",
               "gender": 1,
               "credit_id": "53969ea40e0a266dc50083b3",
               "name": "Pamela Brull",
               "profile_path": null,
               "id": 942839,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Punk",
               "gender": 2,
               "credit_id": "53969e5c0e0a266dca008586",
               "name": "Jack David Walker",
               "profile_path": "/mCKc6eZO9zaHHZ5mGKRAVCqu8bk.jpg",
               "id": 1329280,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Arlene Russell",
               "gender": 1,
               "credit_id": "53969dfcc3a3684e36001c9f",
               "name": "Theresa Randle",
               "profile_path": "/cbngAGNDoWK9vGoaENUhZQgd4J9.jpg",
               "id": 4604,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Detective",
               "gender": 2,
               "credit_id": "53969dcac3a3684f4500336e",
               "name": "Xander Berkeley",
               "profile_path": "/vlZ9FDMk2Xd1WHixPKxnheZoXgR.jpg",
               "id": 3982,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44b49251416c91019f6b",
               "name": "William Friedkin",
               "profile_path": "/1iBd92izRHpkSH4hOhcUBmF2cv7.jpg",
               "id": 15175,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "53525fa1c3a3681d7b0027e1",
               "name": "Dan Greenburg",
               "profile_path": null,
               "id": 1096990,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "53525fafc3a3681d8d002720",
               "name": "Stephen Volk",
               "profile_path": null,
               "id": 110833,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "53525fb9c3a3681da50026cf",
               "name": "Dan Greenburg",
               "profile_path": null,
               "id": 1096990,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "53525fc2c3a3681d8d002722",
               "name": "William Friedkin",
               "profile_path": "/1iBd92izRHpkSH4hOhcUBmF2cv7.jpg",
               "id": 15175,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "53525fcfc3a3681d9300272c",
               "name": "Joe Wizan",
               "profile_path": null,
               "id": 21024,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "53525fe1c3a3681d980026de",
               "name": "Jack Hues",
               "profile_path": null,
               "id": 59880,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "53525febc3a3681d980026e0",
               "name": "John A. Alonzo",
               "profile_path": "/7HN8Ifyp5hNBhBurx0q3rlsQX8r.jpg",
               "id": 1153,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "53525ff6c3a3681d87002814",
               "name": "Seth Flaum",
               "profile_path": null,
               "id": 21794,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 2.658088,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 32043,
      "vote_count": 40,
      "budget": 0,
      "overview": "The idyllic lives of Phil and Kate seem complete when they select the winsome young Camilla as a live-in nanny for their newborn child. But the lovely young Camilla s not what she appears to be.",
      "similar": [],
      "original_title": "The Guardian",
      "runtime": 92,
      "poster_path": "/yjJcKN50qUr8rCgDsaXkuGuc4Jp.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
         "name": "Universal Pictures",
         "id": 33,
         "origin_country": "US"
      }],
      "release_date": "1990-04-27",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "Tonight, while the world is asleep... an ancient evil is about to awaken.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["William Friedkin"],
      "runtime": 92,
      "synopsis": null,
      "writers": [
         "Dan Greenburg",
         "Stephen Volk"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0099710/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY3NjQyMDI0MV5BMl5BanBnXkFtZTcwODcwOTAwMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Jenny Seagrove, Dwier Brown, Carey Lowell | See full cast and crew »"],
      "reviews": [
         "** 1/2 out of **** I always enjoy a good splatter flick and while I wouldn't necessarily call The Guardian a \"good\" film, it sure as hell is an entertaining one. The plot's pretty silly, with Jenny Seagrove as Camilla, a newly hired caretaker of a young couple's (Dwier Brown and Cary Lowell) infant son. Camilla appears to be the perfect nanny, sweet and loving, but actually, she's a Druid who needs the baby to prolong her immortal life, or something to that effect (the movie really didn't explain too much, and if you think I gave anything away by mentioning her as a Druid, the opening subtitles already state that info). She's also got a weird relationship with a big tree in the forest. The film's got a lot of stupidity here and there, especially the young couple, who don't bother checking Camilla's references before hiring her, or the fact that this caretaker happens to be able to move around so many residences freely without too much suspicion (okay, for a while, at least). And considering the fact Camilla's a Druid, where'd she get this tree? This is set in L.A., not Europe. As I said before, not much is answered, and I guess I should be grateful because I can't imagine any answers that wouldn't delve the material into further silliness. But I credit director William Friedkin for handling all this with a straight face. Some of this stuff (particularly the scenes with the tree) could have been played as camp, but I'm rather glad Friedkin plays this seriously and, as he did with The Exorcist, he manages to craft some truly suspenseful and frightening moments. Still, the film does slide into scenes that are too silly to be taken very seriously; you'll know what I mean when you see the chainsaw scene near the end of the movie. Unlike The Exorcist, he shows no restraint with violence, preferring to give us several enjoyably gory death scenes and a LOT of blood spattering everywhere. There's also a decent amount of nudity present, courtesy of the rather lovely Jenny Seagrove. She's not quite as effective a horror villainess as, say, Mathilda May in Lifeforce, but gets the job done. Dwier Brown and Cary Lowell are okay, a little flat during some scenes and certainly not aided by a script that makes them act like idiots, but are convincing enough as caring and concerned parents. Surprisingly very little music is used, with Friedkin trying to use the sounds of the wind and other such natural elements to create goosebumps. It's a good attempt, and while it works during two very lengthy, suspenseful sequences, he's still no M. Night Shyamalan. Considering the rather negative critical response The Guardian received, it's easy to see why Friedkin hasn't made a genre film since. But I enjoyed almost every minute of it would recommend it to horror fans seeking a quick-paced, gory thriller.",
         "Giant trees, huge dark forests, coyotes appearing from nowhere, evil nannies.....it's certainly full of scary things, but the movie isn't really that scary. This is because Jenny Seagrove's character is far too humansied at the start for us to fear her as a monster. She is actually put in jeapordy, and she runs away from a group of rapists, which makes it seem as if she isn't very powerful. Then when she wants to she turns into a monster and flies after her victims. She should be fearsome and nasty straight away, and the audience should not be able to associate with her. It is pretty scary at the end - especially when coyotes start appearing from nowhere to attack people, and when Seagrove flies after the hero, that really is frightening. And the look on her face after she's been hit by the truck.......that's REALLY frightening. The cast is pretty good, and the effects, save for the tree, are good. The tree should have been terrifying, but it isn't very well designed. Still, this is an above average horror tale, with some very supernatural goings-on. And there is no explanation for the monster's existence, which adds to the scariness. Good stuff.",
         "Phil and Kate are a young yuppie couple just on the verge of having a child of their own. As both parents are too busy to take care of the baby,they decide to enlist the services of a nanny,and after screening many candidates,they eventually welcome Camilla.It turns out that Camilla isn't quite all she claims to be,as the baby is being groomed for an ultimate union with the tree she is beholden to.\"The Guardian\" is William Friedkin's return to the horror genre.The film itself is well-made and offers some suspense and a decent amount of gore.However the plot is cheesy and predictable and the main performances are rather bland.Sadly neglected English actress Jenny Seagrove is the definitive highlight of the film.Despite some flaws \"The Guardian\" is worth checking out for serious genre fans.7 out of 10.",
         "Somewhat creepy horror movie with a supernatural edge to it, kind of a more horror oriented \"Hand that Rocks the Cradle\". Basically, a couple with their first child hires a nanny with a very dark and disturbing secret. She has chosen this baby for a reason and it is not to simply make it hers. As far as horror movies it is somewhat good, it has some gore, a couple of tense scenes and some nudity. However, if you watch the cut version of this movie the whole thing changes to the point almost all the scares and creepy stuff is taken out. They seem to completely edit over the first scene involving the baby taken to the tree, a scene later with the mother makes it out that the child survived and is safe and sound. The regular version is not so chipper. The ending is screwed up to as it ends earlier and they basically cut out the final scene. I realize that you want to cut out some stuff so you can show your movie on the happy time family network, but in the end you should not edit a movie to the point its plot and meaning change. So for an okay horror movie with some creepy scenes and such give this movie a shot, for a pedestrian movie with basically no scares and all creepiness removed try and find the cut version of the film.",
         "To all those who gave this a 4 or less--you wouldn't know a good piece of film-making if it bit you in the ass.Granted,it's one of Friedkin's lesser efforts,but it blows away 95% percent of the horror films out there,in my opinion.There's some cornball stuff in it,but there's a well-executed kind of tension in the way it's filmed-great cinematography,a mood to some of the scenes that is creepy & effective.Also,I think the distributors made a mistake pumping the fact it was from \"the director of the Exorcist\".Big mistake.Anyhow,most people would think \"The Hand that Rocks The Cradle\" was a better movie(it scores a 6.2)than \"The Guardian\",but there's no accounting for taste,as the man said.",
         "I remember seeing the edited version of this film years ago on cable and thinking. Gee, that was weird. Finally now though, the original version of William Friedkin's film is out. Frankly, given its ludicrous plot, the film isn't bad. There are some good scares here. The scene where Camilla's wolves stalk Runcie in his glass house is great. Scary, violent and real. Unfortunately, its the best scene by far. The cast is really good in this \"nanny from hell\" story. Jenny Seagrove is sexy, yet spooky. Cary Lowell and Dwier Brown are fine. The supporting work from Miguel Ferrer and Brad Hall is top-notch. The plot is just too silly to be true, so this doesn't work that well and too many scenes are just dumb. The punks at the park, the chainsaw versus bloody tree, etc. The music is bad and the photography sucks. So why give this a shot? Because its by a master film-maker and and, if your'e really into film, you can see about 3 or 4 different endings they could have used. Fun on a dark, rainy night.",
         "THE GUARDIAN seems like one of the more average achievements of master Friedkin\u0096an urban Gothic tale, a grim fairy tale fostering the audiences' fear of the woods. Jenny Seagrove was a fine beauty and an average but interesting actress; here she gets to play 'Camilla', name of LeFanuesque resonance, and at least she offers something to glimpse at in her few nude scenes. The action keeps linear, the treatment will appear like quite unsubtle. A young and not very likable couple has a newborn son and hires a babysitter to look after him\u0097the babysitter is Mrs. Seagrove. Very quickly Friedkin reveals that Jenny is a freak.",
         "I've seen this film now 3 or 4 times over the last 14 years or so, and everytime I'm amazed how bad it is and embarrassed that I'd forgotten and watched it again. It's bad filmmaking from start to finish, very sad when you consider who the director is. I can't for the life of me understand why Friedkin made this film, must've payed nicely but it's got \"TV-movie\" written all over it. The script is utterly bad, I'm sure Friedkin must've known because he doesn't seem to invest anything in the direction, it's completely flat and uninvolving save for the (thankfully) lack of music. The lovely Seagrove (ooo', British accent, scaaary villain) seems uninterested as Camilla while ex-Bond girl Lowell (sporting a terrible haircut) just stands around doing absolutely nothing pretty much throughout the entire film. Brown is probably best, giving it his all with a character as dumb as they come. Some other fine actors are wasted; Ferrer and Randle are seen in two short scenes, and Berkley in one - alright, so he was a bit-part player back then but still. The different babies playing the todler are given a rough-and-tumble time, snatched out of hands, pushed, and thrown around. This film is just a mess, it's boring, no sense of timing, badly paced and constructed. It's supposed to be a horror film, but it lacks the two all important ingredients - atmosphere and suspense.",
         "This is an entertaining horror movie that tries to cover fairytale and occult aspects with the aid of splatter and some tension. The beginning of the movie is actually very creepy and sets the mood for the rest of the movie although it gets dull at some points. The plot is very interesting and truly makes you worry about the lead character and her baby (you can clearly notice the baby is a dummy in the climatic scene). Really, the plot is macabre and very well done executed. The direction is pretty stylish for a low budgeter like this. The man who brought us \"The Exorcist\" still got the touch when creating tense scenes with bits of macabre. I can say that the direction was eerie and that early 90's feeling adds some tension to the picture. The husband , who looks somehow like Ash from \"EviL Dead II\" sawing the tree is the highlight of the movie and offers some glorious gore. Talking about gore, the ending is memorable. Gorehounds will be very pleased with all the splatter and tree massacre sequences. Overall, this is an entertaining movie that should be more enjoyed by b-enthusiasts. The creepy scenes and direction make it an interesting option.",
         "Jenny Seagrove is an attractive nanny who is actually a wicked druid tree priestess who needs the life-forces of newborn infants in order to preserve her powers (or something like that) in William Friedkin's failed but decent horror/thriller. Proud new parents, Jill and Kate think that their new nanny is the perfect woman until their friends start getting murdered and conspiracies about missing babies start to unfold. Due to plot contrivances and muddled intentions that make the action seem at times preposterous, this is considered by many as Friedkin's most worthless effort. Although, if folk/horror combined with some good, moody suspenseful kills and plenty of blood and eroticism, you won't go wrong. The film's best scene has an inquiring neighbor surrounded and circled by ravenous coyotes through his lavish, decor house just before he's ripped to pieces. Seagrove heads a pretty good cast if not always believable, but what do you expect from a story about a tree-witch that steals babies anyway? Enjoy it for what it is."
      ],
      "genres": [
         "Drama",
         "Horror",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "Universal Pictures",
         "Nanny Productions"
      ],
      "summaries": [
         "Phil and Kate have a baby boy named Jake. They hire a baby-sitter, Camilla, to look after Jake and she becomes part of the family. The Sheridan's friend and neighbor, Ned, takes a liking to Camilla and asks her out. She refuses, but Ned follows her and discovers that she is not quite human. Camilla discovers that she has been followed and Phil is pursued. He leaves a desperate message for Phil and Kate which reveals that Camilla has special plans for baby Jake.",
         "From Chicago for a new job, Phil and Kate Sterling have moved into one of the remote canyon areas of Los Angeles. Within the year, Kate gives birth to their first baby, who they name Jake. Within a few weeks of the delivery, they make the decision for Kate to return to work as a designer immediately, which means hiring a full-time, live-in nanny. Of the prospects sent by the Guardian Angel agency, they hire Camilla Grandier, a young, beautiful British woman. They believe Camilla is the perfect nanny for Jake as she has an easy going, natural way of child-rearing. This view is supported by their new group of friends, one in particular, famed local architect and contractor Ned Runcie, who is attracted to her. Immediately after hiring Camilla, Phil begins to have dreams/nightmares concerning Jake and Camilla, these nightmares from which he awakens in a cold sweat solely because of how real they feel. Phil specifically begins to get warnings about Camilla, which he initially does not know whether to believe. If the specifics behind those warnings are indeed true, Phil and Kate will have to protect Jake and themselves against Camilla and the natural/supernatural forces surrounding her and one specific locale in the forested area behind their house.",
         "Allan and Molly were the first couple we see who have Camilla as their baby's nanny. After they discover their daughter is missing, Camilla (who took the baby for her Druid practices), inquires about working for Kate and Phil, who have a son named Jake. Ned Runcie - who designed Kate and Phils house is the one stalked by Camilla after he is found lurking after her (he is the one who has an attraction for her)."
      ],
      "budget": 0
   },
   "movielensId": 2982,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1990-04-27",
      "dvdReleaseDate": "1999-10-12",
      "directors": ["William Friedkin"],
      "runtime": 92,
      "movieId": 2982,
      "title": "The Guardian",
      "mpaa": "R",
      "actors": [
         "Jenny Seagrove",
         "Dwier Brown",
         "Carey Lowell",
         "Brad Hall",
         "Miguel Ferrer",
         "Natalija Nogulich",
         "Pamela Brull",
         "Jack David Walker",
         "Theresa Randle",
         "Xander Berkeley"
      ],
      "imdbMovieId": "0099710",
      "originalTitle": "The Guardian",
      "genres": [
         "Drama",
         "Horror",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "kbl1b664ivk",
         "XB6TGtVghMY"
      ],
      "plotSummary": "The idyllic lives of Phil and Kate seem complete when they select the winsome young Camilla as a live-in nanny for their newborn child. But the lovely young Camilla s not what she appears to be.",
      "tmdbMovieId": 32043,
      "avgRating": 2.30435,
      "releaseYear": "1990",
      "numRatings": 207,
      "posterPath": "/yjJcKN50qUr8rCgDsaXkuGuc4Jp.jpg"
   }
}