{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "motor sport",
            "id": 9571
         },
         {
            "name": "motorcycle",
            "id": 14735
         }
      ],
      "imdb_id": "tt0067527",
      "video": false,
      "title": "On Any Sunday",
      "recommendations": [
         72455,
         112323,
         20238
      ],
      "backdrop_path": "/h96exeDpF4yhsuSt4bmqwD0pLkY.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe45d3c3a368484e070f33",
               "name": "Steve McQueen",
               "profile_path": "/ddL8NHnuVCPOLSiNGjrmIQK9kdO.jpg",
               "id": 13565,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Narrator",
               "gender": 2,
               "credit_id": "52fe45d3c3a368484e070f27",
               "name": "Bruce Brown",
               "profile_path": "/t2yDx3OLqFNzCjIOWIjEHbzrRcb.jpg",
               "id": 86,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe45d3c3a368484e070f2b",
               "name": "David Evans",
               "profile_path": null,
               "id": 130137,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe45d3c3a368484e070f2f",
               "name": "Mert Lawwill",
               "profile_path": null,
               "id": 130138,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Himself",
               "gender": 0,
               "credit_id": "58c3623dc3a368668d0037bf",
               "name": "Malcolm Smith",
               "profile_path": null,
               "id": 1479412,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Himself",
               "gender": 0,
               "credit_id": "58c36272c3a3686672003594",
               "name": "J. N. Roberts",
               "profile_path": null,
               "id": 1774114,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45d3c3a368484e070f23",
               "name": "Bruce Brown",
               "profile_path": "/t2yDx3OLqFNzCjIOWIjEHbzrRcb.jpg",
               "id": 86,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "598b3b84925141329e02d94f",
               "name": "Dominic Frontiere",
               "profile_path": null,
               "id": 21810,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "598b3b8b9251413706026b13",
               "name": "Robert E. Collins",
               "profile_path": null,
               "id": 27051,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "598b3b94c3a368755f035b29",
               "name": "Robert Bagley",
               "profile_path": null,
               "id": 1487336,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "598b3ba1c3a36874f203561d",
               "name": "Bruce Brown",
               "profile_path": "/t2yDx3OLqFNzCjIOWIjEHbzrRcb.jpg",
               "id": 86,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "598b3bac9251414bfa0316d5",
               "name": "Steve McQueen",
               "profile_path": "/ddL8NHnuVCPOLSiNGjrmIQK9kdO.jpg",
               "id": 13565,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 1.592002,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 29251,
      "vote_count": 8,
      "budget": 0,
      "overview": "Documentary on motorcycle racing featuring stars of the sport, including film star Steve McQueen, a racer in his own right.",
      "similar": [
         9659,
         71676,
         2252,
         5925,
         36648,
         82690,
         1948,
         97367,
         18487,
         20526,
         260514,
         681,
         699,
         714,
         2503,
         238636,
         61979,
         9718,
         58496,
         1885
      ],
      "original_title": "On Any Sunday",
      "runtime": 96,
      "poster_path": "/aBBx0SkkN40UiwA2PrF3DglUUY7.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Bruce Brown Films",
            "id": 13723,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Monterey Films",
            "id": 2403,
            "origin_country": ""
         }
      ],
      "release_date": "1971-07-28",
      "vote_average": 7.1,
      "belongs_to_collection": {
         "backdrop_path": "/bkjRchI1uUTXgkFiKVrGhtdLsQk.jpg",
         "name": "On Any Sunday Collection",
         "id": 391047,
         "poster_path": "/lyFw74vS95xGUq44yPbmGIgP8Xo.jpg"
      },
      "tagline": "Take a trip at 265 mph",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Bruce Brown"],
      "runtime": 96,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0067527/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkxODMxNTM3MF5BMl5BanBnXkFtZTgwNjQ0Njg4MDE@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Steve McQueen, Bruce Brown, David Evans | See full cast and crew »"],
      "reviews": [
         "Modest aspirations, budget and technique made this a surprising box-office hit back in 1971, and to this day nobody's done it better. Populist documentarian Bruce Brown (of ENDLESS SUMMER fame) wanted to show how much fun motorcycling is and succeeded. It's that simple. I remember as a nerdy kid being dragged to see this, grumbling all the way, \"I don't want to see some stupid documentary about stupid motorcycles!\" Well, the movie surprised me with its infectious air of fun and camaraderie. Trust me, when it's over you're going to want to rush out and buy yourself a dirt bike. Although much of the photography is 16mm, MOS, hand-held or too zoomy, the editing and slow-motion sequences, backed by a charming pop score from Dominic Frontiere (he of the original superb OUTER LIMITS), overcome the minor technical limitations. Brown's narration is also good if not quite perfect: not overwritten, maybe a bit hokey sometimes, but mostly funny or informative. Perhaps the film tries to cover too much. But when it concentrates on its three main protagonists -- American Motorcycling Association star Mert Lawwill, multi-talented expert Malcolm Smith, and movie star Steve McQueen (whose production company provided financing) -- it's a heckuva fun ride.",
         "More than a couple of times every year I have to watch \"On Any Sunday.\" I can't tell you why exactly except that it makes me feel good. It's kind of like smelling something that you haven't in a long time and all those feelings that you had the first time you experienced \"it\" come flooding back. For me, I was twelve years old when I first saw this movie. It was on a rainy summer Saturday afternoon with my best friend Dean (we had nothing better to do...). The film was both funny and seriously awe-inspiring at the same time. As we walked out of the theater, Dean and I looked at each other and exclaimed at the same time, \"I can do that!\" When I got home from the movie, I immediately went to work lobbying my brothers and pestering my parents to get us (me) a \"bike.\" Between all of us, we finally came to an agreement with us boys finding a way to finance most of it (our dad flitting the bill for the rest) and mom consenting to let us anywhere near \"the thing\" in the first place (lots of promises were made that day I can tell you). That first bike was a Bultaco Sherpa some 3 or four years old. It was set up as a trails bike and all of us boys, our friends (until they talked their parents into one), and even a sister or two took many turns over the next few trying to figure out how to negotiate a 30 inch diameter log that lay across the creek...without putting our feet down (a la Malcolm Smith in the movie of course)! Many of us, some 35 years later, still wear faded scars that mark these great, but dangerous, days. This movie got me started loving something that I didn't even really think about existing until then. We had mainly bicycles and horses where I grew up. A friend down the rode apiece did have a mini-bike with a 5 hp Briggs and Stratton powering it, but it was touchy and didn't always start when you wanted it too (although, I can also say this about the Sherpa at times). This was really the first time that I started to learn about motors...what it was like to get greasy-dirty...the smell of gasoline and oil...and what it took to get both yourself and the bike clean again (to Mom's satisfaction). My love of motorcycles began on that wet summer day and has continued to the present. Indirectly (through me), and just within my own circle of friends and relatives, \"On Any Sunday\" is probably responsible for some 100 to 200 new motorcycle riders - who otherwise may never have known what it's like to fly on two wheels or pick prickly pear cactus needles out of your ...well you know. Although the film is somewhat dated (both the motorcycles as well as the background music)...it wears well and the spirit remains the same...just ask my twelve year old...,\"Pretty cool Dad. I can do that!\"",
         "\"On Any Sunday\" is a film you will definitely enjoy...even if you've never been on a motorcycle. Not only is this film highly entertaining, it's also beautifully photographed and filled with many laughs. The segment with Steve McQueen at the end of the film is wonderful and it truly captures what going out and taking a ride with your friends is all about. See this film!",
         "I remember loving this documentary from the very first time I saw it on video as a young kid. I've been riding motorcycles since I was 6 years old, and it's true what they say about motorcycling: Once you've experienced riding a motorcycle, you'll always look forward to your next ride. \"On Any Sunday\" does an excellent job in capturing what motorcycling is all about. This film has it all: entertaining information, a keen sense of humor, nail-biting intensity, and good-natured fun. Having been made in the late '60s/early '70s, the soundtrack of the movie is truly \"groovy!\" Definitely see this if you've ever wanted to go for a ride on a bike without leaving your living room!",
         "I somehow missed this when it first came out. There was this thing called Viet Nam going on and me wearing green clothes, but I digress.... The first time I saw this movie I was already an experienced rider, having ridden all over the North American Continent and the island of Oahu on everything from 90cc dirt bikes to Harleys to Ninjas to full-boat tourers. But like other reviewers on this forum, it's now Must See at least twice a year. While it centers on off-road competition rather than road riding, OAS still conveys the thrill riders get when in the wind. Bruce Brown knows how to tell a story, and he does a fantastic job. On one hand, he tries to cover too much in the allotted time; on the other hand, there are so many more stories in the motorcycle world that didn't get told. Just enjoy the movie for what it is, a neat little story, photographed and narrated by a talented story-teller with genuine love for the sport. For those that are not motorcyclists: while Steve McQueen indeed has the draw, the two other riders in the movie are today giants in their chosen fields. Mert Lawwill today is a gifted engineering pioneer in the field of human hand prosthesis, and Malcom Smith still owns a dealership and runs Malcom Smith Racing, a producer of off-road rider equipment.",
         "I was 11 years old, born and growing up in California when On Any Sunday came out and it was the catalyst for an obsession that continues to this day (I own 33 motorcycles). Every time I watch the film I want to run out and ride one of my bikes. The ending especially gives me that warm fuzzy feeling to ride that Steve, Bruce, Malcolm, Mert and the rest talk about. The beginning scene of the kids on their Schwinn bicycles with their tall handle bars, banana seats (if you had a seat), in T-shirts and racing around, doing wheelies and jumps was EXACTLY my friends and I were doing at the time. I cannot count how many VHS tapes of On Any Sunday I've worn out.",
         "I don't like motorcycles but I do like this movie! Bruce Brown's ability to wrap a viewer up in a blanket of entertainment is uncanny. He approaches this documentary about motorcycle racing and recreation with a zeal and thoroughness that leaves you wanting more by the film's end. Featuring Steve McQueen, Malcolm Smith and Mert Lawwill - coupled with a snappy and involving music score by Dominic Frontiere (The Outer Limits series), On Any Sunday is sure to please.",
         "I watched this with my teenager on DVD--he just got a KLR 650. I don't care for motorcycles, but what's great about this movie is that it makes you grasp just why other people do; the thrill of it, the risk and challenge are vividly portrayed. If you're the sort who enjoys understanding how the \"other guy\" ticks and are curious about all kinds of things, you'll like this. It was also fun as a peek back at the era in which I grew up. The passionate, dedicated amateur was very much in the American tradition--this film made me realize how much we've lost with with the corporate takeover of sports.",
         "Motorcycling is a complex subject, and no one film can do ALL of motorcycling justice. But this one treats a part of it very well. With the help of actor Steve McQueen, who also financed the film, we see a cross-section which includes a bit of road racing, mostly Daytona, and lots of flat track racing where the rider has a metal skid pad on his left boot, for stabilizing the motorcycle in curves, which are always turning left. We also see a little ice racing where the tires have long metal spikes. I think ice racers are just plain crazy! There is also much devoted to such things as desert racing and hill climbing competition. But the most interesting to me was profiling Malcolm Smith, who raced a bit of everything, almost always with a smile on his face. He simply was better than everyone else, he rode with such an ease that it looked like the motorcycle was part of him. Steve McQueen was a pretty accomplished motorcyclist himself, but in DVD clips which show him riding for fun with the experts, he definitely showed himself as an amateur. I have been a motorcyclist for most of my adult life. I found this film very enjoyable.",
         "I have only seen one Bruce Brown film titled \"On Any Sunday\". I was turned onto the title 2 years ago (2004) by some friends I ride motorcycles with but, since the first viewing, I have probably watched the film 20 times and look forward to 20 more. It seems that all of the people I know who have seen it... feel the same. YES, we are all bike enthusiasts but, it's just a wonderful, informative and now historical doc of motorcycling activities in the early 70's with great period music and superb narration. It's my opinion that \"On Any Sunday\" is the best motorcycle movie ever made. If you ride motorcycles, think about getting a video projector and inviting your riding buddies over and showing the movie on your garage door or side of your house after dark. Call it \"(instert your name)'s Motorcycle Ride In Theater\". Get some beer or tea or whatever, it's a good time! Three thumbs up!"
      ],
      "genres": [
         "Documentary",
         "Sport"
      ],
      "productionCompanies": [
         "Brown-Solar",
         "Solar Productions"
      ],
      "summaries": [
         "A documentary following the lives of motorcycle racers and racing enthusiasts, including actor Steve McQueen. First asking the question \"Why do they do it?\" this film looks at the people who devote (and sometimes risk) their lives to racing on tracks and off-road courses around the world.",
         "Documentary on motorcycle racing featuring stars of the sport, including film star Steve McQueen, a racer in his own right."
      ],
      "budget": 313000
   },
   "movielensId": 2984,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1971-07-28",
      "dvdReleaseDate": "1999-10-12",
      "directors": ["Bruce Brown"],
      "runtime": 96,
      "movieId": 2984,
      "title": "On Any Sunday",
      "mpaa": "G",
      "actors": [
         "Steve McQueen",
         "Bruce Brown",
         "David Evans",
         "Mert Lawwill",
         "Malcolm Smith",
         "J. N. Roberts"
      ],
      "imdbMovieId": "0067527",
      "originalTitle": "On Any Sunday",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["xSLRlPiiiQE"],
      "plotSummary": "Documentary on motorcycle racing featuring stars of the sport, including film star Steve McQueen, a racer in his own right.",
      "tmdbMovieId": 29251,
      "avgRating": 3.71795,
      "releaseYear": "1971",
      "numRatings": 156,
      "posterPath": "/aBBx0SkkN40UiwA2PrF3DglUUY7.jpg"
   }
}