{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "california",
            "id": 387
         },
         {
            "name": "nevada",
            "id": 1197
         },
         {
            "name": "strip club",
            "id": 3688
         },
         {
            "name": "game show",
            "id": 4325
         },
         {
            "name": "utah",
            "id": 5303
         },
         {
            "name": "reno",
            "id": 5876
         },
         {
            "name": "stripper",
            "id": 6593
         },
         {
            "name": "road trip",
            "id": 7312
         },
         {
            "name": "wedding",
            "id": 13027
         },
         {
            "name": "pregnancy",
            "id": 13149
         },
         {
            "name": "las vegas",
            "id": 14570
         },
         {
            "name": "divorce",
            "id": 15160
         },
         {
            "name": "courtroom",
            "id": 33519
         },
         {
            "name": "will",
            "id": 41351
         }
      ],
      "imdb_id": "tt0081150",
      "video": false,
      "title": "Melvin and Howard",
      "recommendations": [
         42176,
         31944,
         43047,
         49815,
         30709,
         42719,
         41944,
         26798,
         27224,
         22976,
         19317,
         43812,
         40476,
         120518,
         38132,
         27674,
         56386,
         47874,
         13903,
         83105
      ],
      "backdrop_path": "/fSzT98b2SznYiIp34HVj96tzaNE.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Howard Hughes",
               "gender": 2,
               "credit_id": "52fe46de9251416c910626f3",
               "name": "Jason Robards",
               "profile_path": "/d5t554TsCjMvI9zwe7M5gNLvZeX.jpg",
               "id": 4765,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Melvin Dummar",
               "gender": 2,
               "credit_id": "52fe46de9251416c910626f7",
               "name": "Paul Le Mat",
               "profile_path": "/zdXz9llyKWBRojikxjvtCs3Jt3W.jpg",
               "id": 12406,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Darcy Dummar",
               "gender": 1,
               "credit_id": "52fe46de9251416c910626fb",
               "name": "Elizabeth Cheshire",
               "profile_path": null,
               "id": 118487,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Lynda Dummar",
               "gender": 1,
               "credit_id": "52fe46de9251416c910626ff",
               "name": "Mary Steenburgen",
               "profile_path": "/yJhfuqS3yXW7kLSyvRU6n3b35mq.jpg",
               "id": 2453,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Clark Taylor",
               "gender": 0,
               "credit_id": "52fe46de9251416c91062703",
               "name": "Chip Taylor",
               "profile_path": null,
               "id": 147077,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Bus Depot Counterman",
               "gender": 0,
               "credit_id": "52fe46de9251416c91062707",
               "name": "Melvin E. Dummar",
               "profile_path": null,
               "id": 147078,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Little Red",
               "gender": 2,
               "credit_id": "52fe46de9251416c9106270b",
               "name": "Michael J. Pollard",
               "profile_path": "/pZzGaBrDi27Ve7X4BCzslgt2mZi.jpg",
               "id": 6451,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Patient Ronnie",
               "gender": 1,
               "credit_id": "55eea40cc3a3682c640167ad",
               "name": "Cheryl Smith",
               "profile_path": "/kF9xavhj9yJkdrC8mWOofOEKT8z.jpg",
               "id": 45480,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Milkman George",
               "gender": 2,
               "credit_id": "581f59b8c3a3685568000632",
               "name": "Sonny Carl Davis",
               "profile_path": "/bdpZH2zUh9WSRfxViA3oyvizNl0.jpg",
               "id": 63214,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Milkman Ralph",
               "gender": 2,
               "credit_id": "583bd469925141254a0050bb",
               "name": "Brendan Kelly",
               "profile_path": "/jEL7xxW23CHbKKI367cy3JwNrj8.jpg",
               "id": 1468322,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Go-Go Club Owner #2",
               "gender": 2,
               "credit_id": "5986a088c3a368328700e751",
               "name": "Joe Spinell",
               "profile_path": "/wzZZO8xXn9OgljCmrGGR4L6wBdg.jpg",
               "id": 16525,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Judge Keith Hayes",
               "gender": 2,
               "credit_id": "5986a0acc3a36832340108da",
               "name": "Dabney Coleman",
               "profile_path": "/95I1LdB2PS2RcAL4mqUzAmJWI5x.jpg",
               "id": 12850,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Bonnie Dummar",
               "gender": 1,
               "credit_id": "5986a0ed9251413d4a00f353",
               "name": "Pamela Reed",
               "profile_path": "/lJgMi6Y4OvB8ZTpopFmJ3Efe5Sq.jpg",
               "id": 14699,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Ventura",
               "gender": 2,
               "credit_id": "5986a11a9251413d5300f167",
               "name": "Charles Napier",
               "profile_path": "/90flwc0xLUDvS4pSUimZzyme2PD.jpg",
               "id": 16119,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46de9251416c910626e9",
               "name": "Jonathan Demme",
               "profile_path": "/17dEjoWccPf9NDm43XP44vhSTEd.jpg",
               "id": 16294,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46de9251416c910626ef",
               "name": "Bo Goldman",
               "profile_path": null,
               "id": 4181,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.746399,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 38772,
      "vote_count": 19,
      "budget": 0,
      "overview": "The story of hard-luck Melvin Dummar, who claimed to have received a will naming him an heir to the fortune of Howard Hughes.",
      "similar": [
         182560,
         773,
         9029,
         44896,
         291870,
         90,
         258480,
         12220,
         50456,
         161,
         87567,
         84174,
         7511,
         11775,
         1656,
         264999,
         7942,
         49022,
         20312,
         7090
      ],
      "original_title": "Melvin and Howard",
      "runtime": 95,
      "poster_path": "/gpPeYelaljgZ3HVJcjfTvwVTPca.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
         "name": "Universal Pictures",
         "id": 33,
         "origin_country": "US"
      }],
      "release_date": "1980-09-19",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "Poor Melvin. All he wanted was to be Milkman of the Month. Instead, he lost his job, his truck, and his wife. Then Howard Hughes left him $156,000,000.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jonathan Demme"],
      "runtime": 95,
      "synopsis": null,
      "writers": ["Bo Goldman"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0081150/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM4NzQ3NTk4NF5BMl5BanBnXkFtZTcwMDIzNDQyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Paul Le Mat, Jason Robards, Elizabeth Cheshire | See full cast and crew »"],
      "reviews": [
         "I just noticed that \"Melvin and Howard\" registered a mere 6.6 on the IMDb rating scale. Don't you believe it! This is a great American movie. Director Demme and writer Goldman take a footnote to history -- a contested Howard Hughes will that named Melvin Dummar, a milkman who once loaned him a quarter, as one of his heirs -- and turn that slight material into a wry meditation on the American Dream. Or more specifically, the thin line that separates the American Dream from pure hell. Demme has a great eye for people like Dummar, a dreamer whose clock for realizing his dreams is winding down. The performances are terrific, especially Paul Le Mat as Dummar (whatever happened to Le Mat?) and Mary Steenburgen who won an Oscar for playing his wife. Jason Robards does one of his patented cameos playing a real life character (his Howard Hughes makes a neat hat trick with his Oscar winning performances as Dashiell Hammett and Ben Bradley.) Watch for the real-life Melvin Dummar as the counterman in the bus station where Steenburgen makes a sandwich for her daughter. This is a small but knowing and winning movie. It definitely gets my vote for \"Milkman of the Month\"!",
         "Here's a strange tale of a couple and their on-and-off again marriage and the stupid things they do.....and the eventual flak over money billionaire Howard Hughes supposedly left the man. Paul LaMat plays the husband and supposed beneficiary. He's just fun to watch, a likable, never-loses-his-cool kind of guy. Mary Steenburgen plays his wife and kind of surprised me by how much skin she showed, not the usual scenario with her. Both of them are somewhat low-lifes. Heck, even Hughes (Jason Robards) is pictured to look kind of scummy character in here. Then again, his last years on this earth were a bit strange! It's a fictional story but those of us who remember, there WAS a lot of flak over the will of Howard Hughes. Despite this being on the grungy side (typical for movies between 1970-1981) this is still an appealing film in a sweet kind of way. One thing for sure: it's different. Well worth a look.",
         "In this day of $100 million plus movies with special effects that drown out the dialog and stars with out-sized egos and paychecks to match, a film like Jonathan Demme's minor masterwork, \"Melvin and Howard,\" would be lucky to get a video distributor. Even a quarter century ago on its initial release, the film was largely ignored by audiences despite glowing reviews, Academy Awards, and critics kudos. However, those who make the effort to seek out this wonderful fable will be rewarded. Based on a story that may or may not have been true, \"Melvin and Howard\" spins the tale of an easy going hard luck kinda guy named Melvin Dummar who gives a lift to an old man he finds asleep in the desert. The man says that he is Howard Hughes, and, years later, when Hughes dies, Melvin finds a will that has been left on his filling station desk that names him as one of the heirs to the Hughes fortune. Since we know the ending before the film starts, the pleasures lie in the quirky characters and situations that screenwriter Bo Goldman and a terrific cast have created. Despite the circus that surrounded the question of the will's validity, Melvin was content just knowing that, during their drive, Howard Hughes had sung a song that Melvin had written. His evident joy in that simple event was a rare personal quality even in 1980. There are a lot of other unpretentious, yet memorable, moments in this outstanding film.",
         "Don't be surprised if you have never heard of \"Melvin and Howard\" because most people haven't. But if the chance comes up to watch it then grab it. It's a true american classic involving a down on his luck man (Paul Le Mat, so great as Milner in \"American Graffiti\") who gives a ride to an injured hitchhiker in the desert that turns out to be none other than Howard Hughes (Jason Robards, who is brilliant in a small, understated performance). Years later after Hughes has died Melvin learns he is in Hughes' will. The only problem is that there is no will to be found. Mary Steenburgen won as Oscar as Melvin's kooky first wife. The scene where she appears on a game show is priceless. This is a sweet and very funny slice of life movie directed by Jonathan Demme who went on to many fine films such as \"Silence of the Lambs.\" This is a true classic. Don't miss it.",
         "The film's opening interaction between Dumar (the quintessential dreamer/loser) and Hughes (who found his dream but lost himself)is hauntingly brilliant. As they drive along in Melvin's truck, on the cusp of desert's dawn, Melvin manages to draw Hughes out of his crusty and maniacal shell by getting him to sing one of his self-written songs. As dawn opens, Hughes is still singing. It is probably his most uncomplicated - yet happiest moment in years. Melvin never does receive any money from the disputed and disregarded will. But he really does not care. He still has his dreams, and knows that validation can be found in impecunity as he reflects upon his encounter with Hughes: \"No, I'm not going to see that money. That's all right. Because you know what happened? Howard Hughes sang Melvin Dumar's song. He sang it.\" Some moments are truly better than all the pain that money can buy.",
         "Winning combination of scattershot comedy and wry, wistful drama tells the (alleged) true story of a milkman with big dreams and no money who is curiously named a recipient in the will of multi-millionaire Howard Hughes. Melvin Dummar (played by Paul LeMat, in a terrific performance) had been saying all along he once helped out an old guy in the desert near Las Vegas who claimed he was Hughes, but Dummar didn't really believe him (they had a nice chat anyway, and Melvin got Howard to sing one of his self-written novelty songs as well as \"Bye Bye Blackbird\"). Good-natured film directed by Jonathan Demme rarely loses its way, and features an endearing collection of screwballs who make the loopy craziness of the situations and dialogue immediate and real--their eccentricities are the roots of the story. Mary Steenburgen won a Supporting Oscar as Dummar's first wife, a dreamer like Melvin who is far less satisfied with struggling and who just wants to amount to something (but to Melvin, the struggles are the best part). Jason Robards is perfect as Hughes; the normally bombastic actor takes a small role and lets it bloom subtly and beautifully for us, giving the movie a misty hue and making all of Melvin's hopes sweetly credible. ***1/2 from ****",
         "1980 was one of Hollywoods' true 'golden years'( the strongest was, probably 1939, and the weakest was-probably- 1956.) Everyone remembers such great films as Raging Bull, The Elephant Man, Ordinary People, and Coal Miners daughter, but there were other, overlooked or nearly overlooked films. Of these, the finest was, beyond a doubt, Melvin and Howard.Based on a twentieth century addition to American folklore( the improbable saga of Howard Hughes and Melvin Dummar), Jonathan Demmes' film tells the story of a chronically unsuccessful Everyman, Melvin Dummar, who claimed to have unknowingly picked up Howard Hughes one night in the Nevada desert, and who also claimed to have been written into Hughes' will. Demme uses these materials to fashion a parable about the American dream and human aspiration.It is funny, superbly acted ( Robards probably deserved a third Oscar, and Mary Steenburgen fully deserved hers), well written, and profoundly human. Melvin Dummar may not have actually picked up Hughes in the desert, and the will may have been a forgery, but his life story does tell some important truths about the meaning of life.",
         "Everyone thinks Raging Bull is the best film of the 1980's, but Melvin and Howard holds up better for me. Paul Le Mat should have been nominated for an Oscar, and this film should have made him a star. It's such a waste that Le Mat isn't used in more films. At least Mary Steenburgen's excellent performance didn't go unnoticed -- she won the Best Supporting Actress Oscar. Bo Goldman's cleverly constructed, highly nuanced script won another Oscar. Director Jonathan Demme went on to greater success and acclaim with Silence of the Lambs, but he achieved something special with Melvin and Howard. Most directors would play Melvin Dummar's story for easy laughs, and while Demme finds humor in the material, he also explores with depth and sensitivity how the American Dream has failed some of its most ardent aspirants.",
         "The most interesting parts of this film are the beginning and the end, because those are the parts in which Jason Robards plays a morose old man who may or may not be Howard Hughes. Robards' performance is very effective, and sadly it is under-used. The rest of the film concerns the life of Melvin, with very little to do with Howard, and Melvin is by far and away the lesser interesting character of the two. Nothing much happens during the main body of the film: all it shows is the unexciting life of one person. The soundtrack is often noisy, which makes it hard to hear what the characters are say, and Steenburgen goes over-the-top in a role that she very questionably won an Oscar for. Some have interpreted the film as some commentary or satire on American lifestyle and society, but I personally can find little evidence to support that theory, and therefore I only recommend this film to those who want to see one of Jason Robards' best performances.",
         "I saw this film back in 1980/81 when it was first released and liked it a lot then. Now have seen it again recently, and it still holds up. There is a certain joy of life depicted in this film that is in some ways also bittersweet (and yet refreshing). What is sad in some regards now is the realization upon seeing it again that the era of life portrayed here is now gone from the collective American psyche to some extent. That isn't to say the film is dated per se. It's just that Melvin isn't cynical at all and he doesn't seem to have a hateful bone in his body. He's neither a wimp nor a man of intellect but someone whose basic humanity emanates. What helps the film, too, is the pairing of actors Paul LeMat as Melvin, and Mary Steenburgen as Melvin's wife, Linda -- they are an endearing couple. I attribute the film's memorable tone and spirit to not only the actors (including Jason Robards & some of the supporting cast) -- I like to believe that director, Jonathan Demme, put his stamp on this, too. Now in retrospect am learning that the writer (Bo Goldman) probably deserves some kudos."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": ["Universal Pictures"],
      "summaries": [
         "This movie tells the possibly true story of Melvin Dummar. Melvin is a nice guy, but he is a total loser: unlucky, impractical and can't keep a job. One night, however, he helps an old man who has had a motorcycle accident in the desert. Melvin laughs when the old man says he is Howard Hughes, the eccentric multimillionaire. But when Howard Hughes dies, Melvin is mailed a will leaving him part of the estate!",
         "Melvin E. Dummar is a working class stiff who has been trying to find his professional place in life, he moving from job to job over his adult life as he hasn't been able to find anything to which he can stick. This life does wreak havoc on his marriage to Lynda Dummar, the two who live in a trailer park in the Nevada desert with their daughter, Darcy. Their possessions are routinely repossessed as Melvin has no concept of repayment of debt, always spending on those things he wants whenever they solely have the down payment. Their marriage is also not helped by Lynda's larger focus on wanting to be a dancer in whatever means rather than be wife and mother. These issues lead to an up and down marriage for the two, with Darcy often thrown between parents at a whim. One day, while Melvin is managing a gas station, he receives anonymously what looks to be the handwritten last will and testament for Howard Hughes, no other will which has been discovered following his death. Melvin received this document as years earlier, he picked up who he thought was solely a drifter in need in the middle of the night in the desert, that drifter who claimed to be Hughes, which at the time Melvin thought was just the rambling of a crazy old man. This will bequeaths Hughes' estate to a handful of people, with Melvin's share being $156 million. Melvin's actions following receipt of the will and public reaction as the story hits the media further affect Melvin's life as the authenticity of the will is questioned.",
         "The story of hard-luck Melvin Dummar, who claimed to have received a will naming him an heir to the fortune of Howard Hughes."
      ],
      "budget": 0
   },
   "movielensId": 2988,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1980-09-19",
      "dvdReleaseDate": "1999-10-19",
      "directors": ["Jonathan Demme"],
      "runtime": 95,
      "movieId": 2988,
      "title": "Melvin and Howard",
      "mpaa": "",
      "actors": [
         "Jason Robards",
         "Paul Le Mat",
         "Elizabeth Cheshire",
         "Mary Steenburgen",
         "Chip Taylor",
         "Melvin E. Dummar",
         "Michael J. Pollard",
         "Cheryl Smith",
         "Sonny Carl Davis",
         "Brendan Kelly",
         "Joe Spinell",
         "Dabney Coleman",
         "Pamela Reed",
         "Charles Napier"
      ],
      "imdbMovieId": "0081150",
      "originalTitle": "Melvin and Howard",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["mGeLSef8S7M"],
      "plotSummary": "The story of hard-luck Melvin Dummar, who claimed to have received a will naming him an heir to the fortune of Howard Hughes.",
      "tmdbMovieId": 38772,
      "avgRating": 3.61626,
      "releaseYear": "1980",
      "numRatings": 744,
      "posterPath": "/gpPeYelaljgZ3HVJcjfTvwVTPca.jpg"
   }
}