{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "monster",
            "id": 1299
         },
         {
            "name": "ireland",
            "id": 14985
         }
      ],
      "imdb_id": "tt0091829",
      "video": false,
      "title": "Rawhead Rex",
      "recommendations": [
         26680,
         24929,
         18274,
         34223,
         84152,
         98209,
         39997,
         58797,
         26962,
         9680,
         17245,
         10725,
         37936,
         39195,
         24274,
         24038,
         28168,
         56242,
         48302,
         70984
      ],
      "backdrop_path": "/jc6p4j8GkXvG9QuJ6YW80wpcMNP.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Howard Hallenbeck",
               "gender": 2,
               "credit_id": "52fe45749251416c75057097",
               "name": "David Dukes",
               "profile_path": "/3mGdu1jF7TO66rUbyI6seaH5ahP.jpg",
               "id": 29792,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Reverend Coot",
               "gender": 2,
               "credit_id": "52fe45749251416c7505709b",
               "name": "Niall Toibin",
               "profile_path": null,
               "id": 140230,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Minty Hallenbeck",
               "gender": 0,
               "credit_id": "52fe45749251416c7505709f",
               "name": "Cora Lunny",
               "profile_path": null,
               "id": 140231,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Declan O'Brien",
               "gender": 0,
               "credit_id": "52fe45749251416c750570a3",
               "name": "Ronan Wilmot",
               "profile_path": "/ni6zAJgibpY9Jy5LZZWyUEQ8DTf.jpg",
               "id": 140232,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Tom Garron",
               "gender": 2,
               "credit_id": "52fe45749251416c750570a7",
               "name": "Donal McCann",
               "profile_path": "/xGjV73QUTFPvNwWSv6R1dNqsMt.jpg",
               "id": 87435,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Rawhead Rex",
               "gender": 0,
               "credit_id": "52fe45749251416c750570ab",
               "name": "Heinrich von Schellendorf",
               "profile_path": null,
               "id": 140233,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Elaine Hallenbeck",
               "gender": 1,
               "credit_id": "52fe45749251416c750570af",
               "name": "Kelly Piper",
               "profile_path": null,
               "id": 101610,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Det. Insp. Isaac Gissing",
               "gender": 0,
               "credit_id": "52fe45749251416c750570b3",
               "name": "Niall O'Brien",
               "profile_path": "/6qdAoraMGiIOSnhiXtQNfQUHkF2.jpg",
               "id": 104758,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Robbie Hallenbeck",
               "gender": 2,
               "credit_id": "52fe45749251416c750570b7",
               "name": "Hugh O'Conor",
               "profile_path": "/hHyWq3z3zjmF61859iCwDpc2mBM.jpg",
               "id": 5312,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Jenny Nicholson",
               "gender": 0,
               "credit_id": "52fe45749251416c750570bb",
               "name": "Eleanor Feely",
               "profile_path": null,
               "id": 1205545,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe45749251416c7505708d",
               "name": "George Pavlou",
               "profile_path": null,
               "id": 74590,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45749251416c75057093",
               "name": "Clive Barker",
               "profile_path": "/1Hlv4fojc9ogiWfqREB0iP47yVI.jpg",
               "id": 31211,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 1.625431,
      "production_countries": [
         {
            "iso_3166_1": "IE",
            "name": "Ireland"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         }
      ],
      "id": 13511,
      "vote_count": 34,
      "budget": 0,
      "overview": "Ireland will never be the same after Rawhead Rex, a particularly nasty demon, is released from his underground prison by an unwitting farmer. The film follows Rex's cross country rampage, while a man struggles to stop it.",
      "similar": [
         39256,
         52728,
         40761,
         10973,
         7191,
         124905,
         21930,
         5876,
         588,
         22899,
         339530,
         46261,
         35616,
         1927,
         293167,
         339967,
         8078,
         36647,
         9426,
         55341
      ],
      "original_title": "Rawhead Rex",
      "runtime": 89,
      "poster_path": "/iaUdeKLtKBuZJavToGiRHySXAPA.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1986-10-01",
      "vote_average": 4.8,
      "belongs_to_collection": null,
      "tagline": "He's pure evil, pure power, pure terror",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["George Pavlou"],
      "runtime": 89,
      "synopsis": "Howard Hallenbeck (David Dukes) is an American professor who travels to Ireland to research items of religious significance. He goes to a rural church to photograph some graves. Meanwhile, three farmers are attempting to remove an ominous stone column from a field. Two of the farmers head home. A thunderstorm appears out of nowhere, and smoke pours from the ground. Lightning strikes the column. The monster Rawhead Rex rises from the dirt. Howard meets Declan O'Brien (Ronan Wilmot), who directs him to Reverend Coot. The curious O'Brien approaches the altar and places his hand on it. Images flash before his eyes. This experience apparently destroys O'Brien's sanity. Afterwards, Howard inquires about the church's parish records. Coot says he can arrange to have Howard look at them. Later, a man arrives at the home of locals Dennis and Jenny. He discovers a clearly traumatized Jenny. The police arrive at the scene and investigate. Meanwhile, Rawhead drags Dennis' dead body through the forest and comes upon a trailer park. A teenager named Andy Johnson is trying to make out with his girlfriend. The two teens head into the woods. Soon after, Howard sees Rawhead on top of a distant hill with Andy's head in his hand. Afterwards, Howard speaks again with Coot, who tells him the church's parish records have been stolen. Declan O'Brien destroys his camera. He takes his family on the road again. On the road, Howard's daughter needs to go to the bathroom, so Howard pulls over and lets her go by a tree. Hearing her suddenly scream, Howard and his wife rush to her; Howard's son stays in the van, alone. Rawhead kills Howard's son and takes the body into the woods. Infuriated by the police's unsuccessful efforts to track down Rawhead, Howard returns to the church. He discovers that there is a weapon shown in the stained glass window that can be used to defeat the monster. After Howard leaves, Coot curiously touches the altar but resists the temptations and images it shows him. Rawhead arrives at the church to baptize O'Brien by urinating on him. A bewildered Coot goes outside to investigate the noise and sees Rawhead. Horrified, Coot flees inside the church and into the basement while Rawhead destroys everything inside. Coot finds the missing parish records, showing what appears to be some kind of blueprint of Rawhead himself. The insane O'Brien catches Coot and forces him upstairs to be sacrificed to Rawhead. The police arrive at the church and prepare to open fire on Rawhead, but they hesitate because he is carrying Coot. The brainwashed inspector dumps gasoline around the police cars and ignites it just as they begin to shoot at Rawhead, killing all the police, including himself. Howard leaves his wife and daughter and goes back to the church where a dying Coot tells him that Rawhead is afraid of something in the altar. Howard goes inside where O'Brian is burning books and is overpowered by Howard. Howard, by using a candle stick, opens the altar and gets to the weapon. O'Brian retreats to Rawhead to tell him, leaving Rawhead displeased. Howard tries to use the weapon, but has no affect. In anger, Rawhead kills O'Brian by tearing out his throat, with Howard's wife watching in terror. As Rawhead tries to kill Howard, his wife picks up the weapon, it activates, stopping Rawhead from killing Howard. A ray of light comes out of the weapon and hits Rawhead, hurting him. Howard realizes that it has to be a woman for it to work. Then the form of a woman appears from the stone and shoots electric rays through the stones and into Rawhead's body, knocking him to the ground. After a few more blasts, Rawhead is drained and weakened to the point where he has no hair, has aged, ill and dying. Finally he falls through the ground with Howard's wife dropping the weapon in with him. Rawhead is smashed under giant stones and finished. Both Howard and his wife cry in light of it being over. In the final scene, the boy from the trailer park places flowers on Andy Johnson's grave. As he walks away, Rawhead emerges from the ground and roars....",
      "writers": ["Clive Barker"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0091829/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcyMjU4NzgyNV5BMl5BanBnXkFtZTcwNzcwNTgyMQ@@._V1_SY317_CR7,0,214,317_AL_.jpg",
      "actors": ["Stars: David Dukes, Kelly Piper, Hugh O'Conor | See full cast and crew »"],
      "reviews": [
         "This film just doesn't get the credit it merits, its a cheaply made film which inevitably relies on the viewer to accept the limitations of the genre and \"go with it\", just as an old tom baker doctor who episode never had anything going for it except the characters and storyline so it goes with rawhead rex,the story and characters are good enough to carry the film, the setting in celtic ireland and the roots of the beast from the underworld are classic horror fare and i just don't see what more you can expect from this genre, its a blast from start to finish with gore and an unusual baptism scene for good measure, I've seen much worse major budget films, some of the acting . particularly the irish priest is gloriously over the top and all the more entertaining for it, its funny and gory at the same time, it sort of meets hammer and the evil dead and comes up with an entertaining movie, i voted a ten to hype the figures lol but its a good seven if truth be told:)",
         "Im the kind of person who alot of the time will buy movies before I have even seen them. That was the case with this movie. I loved this movie! People say it was cheezy, maybe a little but if you love cult horror, get this movie. Its defently a fun little satanic film and I would recomend it to anyone that are fans of the horror / cult genre.",
         "`Rawhead Rex' is one of the more unusual monster movies to come around. **SPOILERS** A photographer, Howard (David Dukes) comes to Ireland to do a book on sacred church sites. He stumbles across a site where three workers are raising a giant stone. Unbeknown to Howard, the stone is the resting spot for a creature called Rawhead Rex. As Howard checks around the town with various members of the church for permission to photograph the church, Rex kills one of the men who raised the stone. As Howard's wife (Kelly Piper) displays her dislike of the town, he goes to visit the man since the local priest, (Niall Tobian) gave him permission to do so. He stumbles across the murder and alerts the police. They believe that the murder is caused by someone in the town wanting revenge on the man, and start their investigation. Another couple nearby, arguing, walks off into the woods and leave their son. He finds Rex's first kill in the woods, as do the couple, and they race out of the woods, leaving only the woman and the son to reach safety. As the murders continue, the police chief (Naill O'Brian) realizes that a monster is behind it. Howard begins to suspect that the local verger for the church, Declan O'Brian, (Ronan Wilmont) is behind the monster's appearance, and he searches for the truth before Rex finds him. The Good News: `Rawhead Rex' is a better movie than people give it credit for being. The locale switch to Ireland is a great twist and is very creative. It allows Ireland's landscape to be fully exposed to the outside world, and it's sweeping landscapes, dense forest, and luscious mountains are put on full display. The locale also gives Rex tons of hiding places to pop out of, allowing for some nice scares. Almost all of his appearances are great scares, having him pop out or showing up unexpectedly. Some were better than others were, but all in all the shock of his first appearances allow for some nice scares. The monster's roar was also very creepy. It was very deep, very loud, and very chilling. It sent a chill down your back when you heard it. It was effective for Rex in that a monster of that power and ugliness had a roar to match it. The killings in the film were also very gory. Rex had a violent end for all of his victims, and made the film a bit better to stand, with the gore in it. The gore was very realistically done, with as much burned or damaged skin as cut and bleeding. The blood flow wasn't as great as would be expected, but it was more of the aftereffect that provided more bloodletting. However, the best part of the film is easily the creativity used in telling the story and setting up the plot. No real reason is given for Rex to appear, but was certainly clever in allowing the characters to get into the plot and get it going. Harry's character is given an interesting job and a reason to be in the location when the events go down. His job of locating ancient sacred places where churches are now built is a great new, creative job to have in a horror movie. The ending is also very creative and was one of the more unusual endings in horror movies. The Bad News: For being the central character, Rex was one really weird monster. It was an unusual movie, but Rex needed to be designed better. He looked imposing only in very few scenes and his power was displayed only in one scene, towards the end. As the central character, he needed to be a better monster. The main problem was his face. It resembled too much that of a gorilla on steroids, with the exposed lower jaw, fanged teeth, and human-ish face. His eyes were creepy, and could be left alone, but the rest could've been altered. The move to Ireland was creative, but that means that the viewers have to sit through the Irish accents for most of the movie. Only harry and his family are not Irish, so the rest of the cast has the almost indistinguishable accent that will probably hinder some viewers from enjoying it, as they should. The Final Verdict: `Rawhead Rex' is an unusual film, but that is not necessarily a bad thing. It will grow on you after repeated viewings, but most may not make it to repeated viewings. That is a shame, since it is a creative movie that will surprise the casual horror viewer as well as those who want to see a new twist in horror films. Rated R: Graphic Violence, Graphic Language.",
         "The short story Rawhead Rex is a gory and stomach churning piece of literature appearing in Clive Barker's Books of Blood Volume 3. Reading it one sees the possibilities of a good old fashioned monster on the loose movie. Unfortunately, most of the graphic violence of the story is removed from the film that followed. Although many of the character details remain the same, except that the protagonist and his family are Londoners instead of Americans in the short story. The setting, score, a few actors and the occasional scare make the films worth seeing for true Clive Barker completists. Be warned, what does make the proceedings less alluring is the fact that Rawhead himself is a great disappointment; the direction somewhat poor and from a script by Barker himself I expected more. Not even in league with his superior Hellraiser, effective Candyman or intriguing Nightbreed. Though I must admit I must've seen this film about eight times since it was initially released. Trivia note: The mother of the American Family is the actress who plays the nurse Joe Spinell skewers in Maniac.",
         "I've given this a 10 to bump up the average, because 4.2 doesn't reflect the core 'horror' quality that is a strong undercurrent to this movie. I saw Rawhead when I was quite a bit younger but all those who saw it with me said the same thing; that this movie contains a genuine flavor of something you can't quite put your finger on, but other directors / collectors of horror should take note of. Don't dismiss this movie, its stupid on many levels, but like Evil Dead (One) contains that low budget horror magic that only a few directors can capture. Am I wrong?",
         "\"Rawhead Rex\" was one of several \"unknown\" films I prided myself on \"discovering\" during the late 1980s, when friends would visit for a day or four. I seemed to have a knack (seemingly lost, now!) to pick out videos I had never heard of, which turned out to be surprisingly quite good. Rawhead Rex was one of these. I found it a quite riveting, scary movie. As with almost all horror movies, I thought a few things could have been done better. Still, Rex was infinitely more satisfying to me than a number of present-day \"horror\" flicks which center on someone hacking people up with a knife for no apparent reason or which drift confusingly between reality and halucination. I thought the monster looked pretty convincing -- then again, I was weaned in the pre-Speilberg era. I have to agree with the reviewer who said the scene where Rex kills the farmer in the shed and the wife sees him from the kitchen window, then tries to hide, is quite scary. So was the boy glancing up from his comic books in the van, to see Rex standing outside. I loved the touches with the stained glass puzzle & the chief detective's stunned \"I'll be d****, the Yank was right\" when he looks at the horrific crayon drawing made by the young survivor of the trailer park attack, too stunned to speak. (The severed arm was a very nice touch, too.) Anyone who thinks Rawhead Rex was \"hilarious,\" is no horror fan. It may not have been one of the genre's best efforts ever, but it was one of a number of very meaty horror flicks of the 1980s which are still have plenty bite today (pun intended)!",
         "I remembered seeing this picture when I was very young & liking it so when I spotted it at my local pawn shop I bought it. And although the film was not as incredible as it was back then (The film did have it's slow spots) all in all it still turned out to be the awesome horror flick I remembered. Based on a novel by Clive Barker (He also wrote the screenplay for this) The story centers on an ancient demon that use to rule the earth, that was defeated & sent back to the very bowels of hell, whom is accidentally unearthed in a village near Ireland. Upon it's release, it hypnotizes people to be it's servants & goes around ripping up the usual humans that happen to stumble upon him in the woods. The monster himself in particular is terrifying, with it's glowing red eyes, quick speed, huge teeth & it's unearthly growls. Horror fans should have a fine time. What a shame Rawhead never came back for a RAWHEAD REX 2! Directed by GEORGE PAVLOU whom also helmed another Clive Barker project called TRANSMUTATIONS & like that film, Clive later disowned this. ***1/2 (stars)",
         "There is a scene in this movie in which someone screams \"He is god!\", and then we cut to a shot of a big guy in a ridiculous rubber mask. That pretty much sums Rawhead Rex up, as the movie is so completely ridiculous that the audience is never allowed to take it seriously. However, believe it or not; horror fans have a lot to be thankful for when it comes to Rawhead Rex, as it was the crappiness of this movie (and the earlier 'Underworld' by the same director) that lead to Clive Barker's decision to direct Hellraiser himself...and that turned out pretty well. The plot is based on the story by Clive Barker, and features his typical ideas of otherworldly evil. The story takes place in the British countryside, and we follow the idea of a farmer who accidentally unearths a demon. After plaguing the English countryside for a while and upsetting a few people by doing things such as killing children and smashing up kids' toys, it soon becomes apparent that there may be more to this demon than just a daft-looking killing machine, and perhaps the church has the answer... It's easy to see why Clive Barker wasn't happy with this adaptation of his story. The themes of good against evil and religion are put across rather well, and the story behind Rawhead Rex is full of intrigue. The screenplay isn't bad either, and while the story feels stretched (despite the 85 minute running time), it's usually at least entertaining. The reason why it's brought down if you ask me is almost completely down to the demon itself. After the ridiculous intro scene, it's impossible not to approach every scene that the monster is in without laughing; thus making being scared impossible. The demon at the centre is supposed to be absolute evil...but if absolute evil really did exist, I doubt it would look as silly as it does here. The murder scenes aren't bad, though, and the British countryside bodes well with the story and provides an excellent location for having victims picked off in. I liked the way that the characters speak with thick country accents too; it gives the whole piece a little bit of credibility, which it lacks in so many other areas. Many viewers pass this film off as absolute rubbish, and while the film is terrible; I've got rate it more as a shame than anything. I'd be pleased if Barker himself one day decided to remake it.",
         "It's really simple: dire film, fantastic short story concerning entities older than organised religion, which also looks at the idea of the female as divine, without being preachy or even vaguely normal. Like all Barker horror stories; dark, twisted and original, if you don't own the Books of Blood, you should. For the uninitiated the Books of Blood (1-6) are collections of short stories. As well as containing the short story 'Rawhead Rex', the Books of Blood also contain the short stories 'The Forbidden'(which was filmed as Candyman), 'The Last Illusion' (filmed as Lord of Illusions), 'The Body Politic' (filmed as part of Quicksilver Highway)and 'The Yattering and Jack' which was also committed to screen as an episode of Tales from the Darkside. The only good thing about this film is that it prompted Clive Barker to start making his own text to screen adaptations, starting with Hellraiser.",
         "This is one hell of an odd movie yet it always makes me think of dear old mom. A few years ago my mother had a chemical peel on her face and for a few days she looked just like the monster in Rawhead Rex, in fact I still call her Rawhead Rex every now and again (just for fun). This picture is good for a laugh but that's about it. Pity this picture stars the wonderful David Dukes but i won't hold that against him."
      ],
      "genres": [
         "Fantasy",
         "Horror",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "Alpine Pictures",
         "Green Man Productions",
         "Paradise"
      ],
      "summaries": ["Ireland will never be the same after Rawhead Rex, a particularly nasty demon, is released from his underground prison by an unwitting farmer. The film follows Rex's cross country rampage, while a man struggles to stop it."],
      "budget": 0
   },
   "movielensId": 2992,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1986-10-01",
      "dvdReleaseDate": null,
      "directors": ["George Pavlou"],
      "runtime": 89,
      "movieId": 2992,
      "title": "Rawhead Rex",
      "mpaa": "",
      "actors": [
         "David Dukes",
         "Niall Toibin",
         "Cora Lunny",
         "Ronan Wilmot",
         "Donal McCann",
         "Heinrich von Schellendorf",
         "Kelly Piper",
         "Niall O'Brien",
         "Hugh O'Conor",
         "Eleanor Feely"
      ],
      "imdbMovieId": "0091829",
      "originalTitle": "Rawhead Rex",
      "genres": ["Horror"],
      "youtubeTrailerIds": ["AI0nhiSKOCY"],
      "plotSummary": "Ireland will never be the same after Rawhead Rex, a particularly nasty demon, is released from his underground prison by an unwitting farmer. The film follows Rex's cross country rampage, while a man struggles to stop it.",
      "tmdbMovieId": 13511,
      "avgRating": 2.32339,
      "releaseYear": "1986",
      "numRatings": 218,
      "posterPath": "/iaUdeKLtKBuZJavToGiRHySXAPA.jpg"
   }
}