{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "new york",
            "id": 242
         },
         {
            "name": "immigration",
            "id": 1900
         },
         {
            "name": "immigrant",
            "id": 2356
         },
         {
            "name": "anthology",
            "id": 9706
         }
      ],
      "imdb_id": "tt0168589",
      "video": false,
      "title": "The City",
      "recommendations": [
         256959,
         88599,
         24952,
         134754,
         52799,
         426238,
         78294,
         267480,
         377462
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe470dc3a36847f8120cd5",
               "name": "David Riker",
               "profile_path": null,
               "id": 1053508,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe470dc3a36847f8120cdb",
               "name": "David Riker",
               "profile_path": null,
               "id": 1053508,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.584072,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 46798,
      "vote_count": 9,
      "budget": 0,
      "overview": "The stories of four Hispanic immigrants living in New York City.",
      "similar": [
         594,
         101,
         241239,
         4978,
         2539,
         16288,
         1429,
         1813,
         3131,
         7345,
         284,
         1213,
         13223,
         553,
         244772,
         242,
         104,
         164,
         639,
         1164
      ],
      "original_title": "La ciudad",
      "runtime": 88,
      "poster_path": "/abBdx8J84KbkGGE7PxBoXQ2onUS.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         },
         {
            "name": "한국어/조선말",
            "iso_639_1": "ko"
         }
      ],
      "production_companies": [],
      "release_date": "1999-10-22",
      "vote_average": 7.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["David Riker"],
      "runtime": 88,
      "synopsis": null,
      "writers": ["David Riker"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0168589/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY1NTUxMjczM15BMl5BanBnXkFtZTcwMDU3MDkyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Anthony Rivera, Joseph Rigano, Miguel Maldonado | See full cast and crew »"],
      "reviews": [
         "The City is one of the most important (and true) American films yet. David Riker has found the key to perfection in non-sensationalism. He has told the rarely told truth of one of our most glamourized cities. His passion for these people shows. The courage he displays by making this film the way he wanted to, in Spanish, intensifies the beautifully filmed, emotionally moving scenes. David Riker is my hero! He is the most non-sold out director I've found. If you have the chance, SEE THIS FILM!",
         "\"The City\" is a movie to treasure. It tells four stories about recent illegal immigrants to New York City. They come from Mexico and further south in Latin America, and they carry the hopes of their families at home that they will send back money from the promised land. It doesn't work that way. Although the TV news and music videos have drilled us to think of Latin Americans in terms of flash and style, music and sometimes drugs, the characters in this movie come from an entirely different world. They are hard-working people, who come from a world where they were respected. After all, anyone who goes to the trouble of becoming an illegal immigrant is, by definition, one of the most confident and ambitious citizens in his home community. The losers would be afraid to try. New York, we see, offers little. Men line the streets hoping to be hired as day laborers, and the cops threaten to sweep them away--for the crime of wanting to work. They're paid 15 cents apiece to scrape and hammer the mortar off of old bricks. In another story, a woman gets a job in a garment sweatshop, where piecework workers are hired and fired on whim. A man lives in his car and supports himself with a portable Punch and Judy show; he wants to enroll his daughter in school, which is their legal right, but because he has no permanent address no school will have her. And in a more hopeful story, a young man meets a woman and they fall in love--but the city defies them to be happy. \"The City (La Ciudad)\" was written and directed by David Riker, who comes out of the New York University Film School; fellow graduates like Spike Lee and Martin Scorsese have also been interested in the streets. It was photographed by Harlan Bosmajian, whose b&w work is realistic and poetic. One is reminded of \"Bicycle Thief.\"",
         "This is a black & white movie with subtitles made in 1999 by David Riker. I was lucky enough to see it in a class at school, but it is an important film for anyone that is interested in humanity itself. The film is broken down into 4 stories of immigrants and their assimilation (or lack of) into their new society. The first story is the story of street corner workers. The street workers themselves aren't even wanted there - one of the men tells of how the vendors & city are organizing to remove them from this locale where they find sporadic work. This is a tragic story of disunity and dishonesty. The dishonesty when an employer loads men into a truck & tells them it will be $50 for the days work. He doesn't tell them what they will be doing. When they arrive at the outskirts of the city, they are told they are to dismantle a brick building, clean the bricks (to be reused) and that they will receive .15 cents per brick. Not the $50/day they were promised. What are their choices? They get to work. On site, they bicker & turn contentious. I hope you will watch the movie to see how this turns out. This episode is beautifully and poignantly done with one of the workers, José reading a letter from his wife back home. It humanizes it. Yes, immigrants are people not unlike you & I. They have families, dreams and desires, like all people. In the 2nd story, a young man, Francisco arrives in the city with only an address to go to. He goes there & is told that there is no one there by the name he is looking for. Not knowing where to go, what to do, he walks the city. He sees a \"boda\" or wedding going on. He watches the people dancing to cumbias and having a good time, reminded of his own home. He goes in & meets María. She seems serious and somewhat suspicious of this man's intentions. They talk and find out they are both from Tulcingo, Puebla in México. She eventually invites him to her home where she & her uncle live. She knows he has no where to go or spend the night. Her uncle isn't home and he asks for a kiss. He tells her that until he saw her, he didn't know why he had come here (America). She says they can have breakfast in the morning together. He sleeps on the couch and in the morning, she still sleeping, he goes to the fridge and sees she needs supplies. I'm sure with what little extra money he has, he goes to a store to buy breakfast. Upon returning, he realizes he is lost. Wandering around a huge project, he has no idea where his friend is and is once again alone. The 3rd story is one of a man and his daughter, Dulce. He makes a meager living with a puppet show, living out of his station wagon. But he is concerned for his daughter's health & education. He tries to register her in school & they said they require a proof of residence. Being homeless, he has no receipt for utilities or anything else. In the 4th installment, it revolves around Ana, who works in a sweatshop sewing clothes. Already, we find out right away the \"dueños\" or bosses haven't paid them in over 2 weeks. Ana's daughter, Carmelita is still back home in México & is very sick. Ana needs to send her money for the hospital, but cannot raise the money. She goes to her cousin who owes her $100 but he is busy drinking away whatever money he had. A friend tries to sell some communion dresses for girls at a local merchant. He resolutely tells them he doesn't buy dresses he \"didn't order.\" Her friends give her what little they have. She goes to her boss (who appears to be an immigrant too) and asks for her money, telling her that her daughter is sick. To no avail. In the final scene, she sits tearfully immobile in front of her sewing machine. The boss sees her & tells her to get busy. She again pleads for her daughter. He tells her to go home. He yells that she is not needed, to leave. She grabs her machine & holds on for dear life, crying and saying, \"¡no puedo!\" (I can't!) Finally, the people around her stop their din of sewing, until at last not a single machine or presser is working in the shop. The camera pans outside the building- leaving you to your own conclusions. This movie is VERY powerful & sad. I'm afraid it isn't the sunny success story many people want to see about immigration. I'm sure some people would say it's \"over the top.\" But it seems that way because it is so much sadness packed into four stories. This is a slice of immigrant life that not many people see. It is so much to be borne. The struggle of life in their sending country, the difficulties in getting here. Then lack of work, dishonest employers, even compatriots that take advantage of the newly arrived. Then the additional vicissitudes such as a sick family member or no network of friends or family in the receiving country that can seem so very overwhelming. Truly this movie is a testament to the immigrants that survive and sometimes thrive in a very difficult system that is totally geared against their success. This movie is really a tribute to the human spirit. But it is also here to hopefully make people more cognizant of injustice and the lack of support that immigrants face here. Not to be missed, this movie is extremely well done. If you don't cry watching this movie, then the empathy gene is missing in your DNA.",
         "La Ciudad is a wonderful, and beautiful movie with twisting story lines. Its black and white imagery gives us a feeling of being there; the vacant lot along the East River waterfront, the empty lot in Bushwick, the streets of Mott Haven, the sweatshops. I will say that my opinion of the movie is slightly tainted. I got to view it at New York's Museum of the Moving Image and met the director afterwards to talk about the film's unique production. Filmed over years, using black and white film was actually a necessity in order to create consistancy in lighting. The stories that make up the film's parts were developed by the actors shown in the film; which may explain its lack of any Hollywood-type ending. This is a good film to watch.",
         "This is certainly not a movie for the Ahnold, Rambo, blast 'em out of the galaxy crowd. It is, rather, a spare, black and white, mise en scene depiction of Hispanic immigrants in New York City. There are four different stories, the first three ending in a somewhat frustrating, unresolved manner. The fourth story lifts the film up tremendously with a subtle, but very powerful scene that involves no dialogue or music at all. This is the type of film that is not overly exciting, but will stay with you for quite a while and has many layers of meaning that all come together at the end.",
         "La Ciudad tells four stories of what illegal immigrant life is like in New York City. It is a black and white film with English subtitles. The first story depicts the life of illegal immigrants trying to find any work. A Italian man tells and hires a few of the Hispanic men for fifty dollars a day, and loads them in a truck and takes them to a site with broken down buildings. The Hispanics are supposed to clean and stack bricks for only fifteen cents each, not the fifty dollars they were promised by the Italian man. The second story deals with a young man, Francisco, who just arrived in America and is looking for his Uncle. As he is searching for his Uncle's apartment, he hears music from a wedding and decides to go and see what is going on. There he meets a girl, Maria, who he dances with and begins to talk to her. After the wedding is over, both Francisco and Maria go back to her apartment, where Francisco spends the night on the couch and plans to have breakfast with Maria in the morning. When he wakes up, he realized that there is no food to eat and decides to go and buy some food. On his way back from picking up food, he realized he had no idea where he was and even how to get back to her apartment. The third story is about a homeless Hispanic man and his daughter. The man takes his daughter and tries to enroll her in school; however, he is unable to do so because he has no address or telephone bill. The schools needed proof that he lived in the city, and with no proof he could not enroll her in school. Finally, the fourth story is about a woman, Ana, who works in a sewing factory. The factory has not paid any of the employees for approximately a month, and the workers cannot do anything about it. They just hope and pray that they will get a paycheck the next week. She gets a phone call from back home and discovers that her daughter is ill and she needs four hundred dollars to pay medical bills. She asks her employer to pay her because she needs to pay medical bills; however, her boss says that they don't have the money. She also tried to sell dresses to a dress store however the store would not accept dresses from someone on the street. Finally, Ana became fed up and decided not to work at the factory and just sat at her sewing machine and would not work until she was paid. Then all of the other workers one by one began to stop working as well. This movie is heartfelt. It shows what an illegal immigrant's life is like and the conditions they live and work in. It really opened my eyes more. I actually saw some of the atrocities that immigrants are put through each day. This movie is extremely powerful. It really makes each person think about why this happens. I'm sure many people think that immigrants who come into the United States live just as good of lives as everyone else, but that is not the case. This movie is an important movie for each person to see. But don't let me be the judge of this movie, watch it yourself and make up your own mind!",
         "La Ciudad is a very silent movie. I think the overall silence brings out a lot about what these immigrants really feel. The focus is on their faces (thus the photo studio), and on what they live through each vignette. That is how it says a lot without having to go deep into the short stories it presents. Its being black & white also helps to set the tone, one of helplessness, one of being lost. It also helps present the movie as a documentary for a mainstream audience which I think is a rather clever way to reach the targeted audience. The question is how well does it represent the latino immigrant experience? Pretty good, I think. Definitely something to see.",
         "This film was very beautiful and quite moving. While watching it, I noticed how wonderfully the cinematographer (Harlan Bosmajian) had captured the light throughout the four vignettes of the film. He created an intimacy between he characters and the viewer that many attempt to do these days but just spoil by giving the viewer too much \"eye candy.\" The director, David Riker has done such a good job with this film, I highly recommend it and urge everyone to see it as soon as possible. Riker not only shows us how many immigrants live and work in this country, but he shows it in a way that we can all relate to it. I thought of my parents and wondered how their own immigration process was. Visually, emotionally, and intellectually, this is definitely a film to experience. Go see it!",
         "Live long enough and we all learn a truth in life, that your grief is not enough to stop all activity from swirling on around you. This film says, \"I can see you, even in your grief\" in much the same way a great photograph captures the vitality of its subject, and hands it to you like a gift. The center of the film, fittingly enough, is a photography studio, and we get delicious glimpses of the photographer lovingly photographing his subjects - there is no need to build up mystery as to his identity, because he is all of us, those who find themselves willing to watch as life plays out, sometimes unbearably, before our eyes. I will definitely be watching this again.",
         "(Possible spoilers) David Riker means well (I suppose), intending to show us the oppressive lives of recent Latino immigrants in New York City. But he apparently decided to strip his stories of all joy, all spirit, all struggle. No one laughs, no one fights back, no one gets ahead. There are only dead ends for all the people he portrays--they are all victims. And he emphasizes this by moving the stories along at a snail's pace, accompanied by a funeral-dirge soundtrack. His characters are crushed--in one case, literally. Even when one of his vignettes leads in a positive direction, he shoots it down (the love story) or leaves it hanging (the factory). This is an insult to the real lives of immigrants, which is a far more complex mixture of hope and sadness, victories and defeats. It therefore sends a very negative political and cultural message. I have a personal and professional interest in multicultural perspectives on American life; in that regard, this film is a real disappointment. For two much better films about Latino immigrants, see El Norte or La Familia."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Journeyman Pictures",
         "Echo Lake Entertainment",
         "Independent Television Service (ITVS)"
      ],
      "summaries": ["The stories of four Hispanic immigrants living in New York City."],
      "budget": 0
   },
   "movielensId": 2994,
   "movielens": {
      "languages": [
         "English",
         "Español",
         "한국어/조선말"
      ],
      "releaseDate": "1999-10-22",
      "dvdReleaseDate": "2005-06-14",
      "directors": ["David Riker"],
      "runtime": 88,
      "movieId": 2994,
      "title": "The City",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "0168589",
      "originalTitle": "La ciudad",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "The stories of four Hispanic immigrants living in New York City.",
      "tmdbMovieId": 46798,
      "avgRating": 3.22561,
      "releaseYear": "1999",
      "numRatings": 82,
      "posterPath": "/abBdx8J84KbkGGE7PxBoXQ2onUS.jpg"
   }
}