{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "lust",
            "id": 14794
         },
         {
            "name": "love crime",
            "id": 160780
         }
      ],
      "imdb_id": "tt0144178",
      "video": false,
      "title": "Dreaming of Joseph Lees",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 7,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Joseph Lees",
               "gender": 2,
               "credit_id": "52fe4a98c3a36847f81d734f",
               "name": "Rupert Graves",
               "profile_path": "/erhJMyO6Cuh95TmSTAfQHNfCAi9.jpg",
               "id": 11278,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Eva",
               "gender": 1,
               "credit_id": "52fe4a98c3a36847f81d7353",
               "name": "Samantha Morton",
               "profile_path": "/zRvK2T98rz5smCwRiAaFRq1CoDo.jpg",
               "id": 2206,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Mr. Dian",
               "gender": 2,
               "credit_id": "52fe4a98c3a36847f81d7357",
               "name": "Nicholas Woodeson",
               "profile_path": "/mJEQiX9inQzWEJb8LCm2xr7mgyl.jpg",
               "id": 118617,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Harry",
               "gender": 2,
               "credit_id": "52fe4a98c3a36847f81d735b",
               "name": "Lee Ross",
               "profile_path": "/lMOJz7ZSs4iOWYON0NdKlVuWvlo.jpg",
               "id": 93177,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Robert",
               "gender": 0,
               "credit_id": "52fe4a98c3a36847f81d735f",
               "name": "Felix Billson",
               "profile_path": null,
               "id": 1043950,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Janie",
               "gender": 0,
               "credit_id": "52fe4a98c3a36847f81d7363",
               "name": "Lauren Richardson",
               "profile_path": null,
               "id": 1043951,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Italian Doctor",
               "gender": 2,
               "credit_id": "52fe4a98c3a36847f81d7367",
               "name": "Vernon Dobtcheff",
               "profile_path": "/lcPki2IDdmRvqiBbv2RUBfgm3IH.jpg",
               "id": 649,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4a98c3a36847f81d7339",
               "name": "Eric Styles",
               "profile_path": null,
               "id": 231521,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe4a98c3a36847f81d733f",
               "name": "Catherine Linstrum",
               "profile_path": null,
               "id": 413175,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a98c3a36847f81d7345",
               "name": "Christopher Milburn",
               "profile_path": null,
               "id": 61927,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a98c3a36847f81d734b",
               "name": "Mark Thomas",
               "profile_path": null,
               "id": 1043949,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.425365,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 108346,
      "vote_count": 3,
      "budget": 2000000,
      "overview": "Set in rural England in the 1950s Eva (Samantha Morton) fantasises about her handsome, worldly cousin Joseph Lees (Rupert Graves), with whom she fell in love as a girl. However, stuck in a closed community she becomes the object of someone else's fantasy, Harry (Lee Ross). When Harry learns that Eva is planning to leave the village in order to live with and look after the injured Lees, he devises a gruesome scheme in order to force her to stay and look after him.",
      "similar": [
         370663,
         41280,
         37265,
         393850,
         116,
         28468,
         1813,
         13885,
         9453,
         134764,
         158907,
         27066,
         20075,
         290098,
         14174,
         9769,
         10995,
         4823,
         235271,
         152584
      ],
      "original_title": "Dreaming of Joseph Lees",
      "runtime": 92,
      "poster_path": "/5l68j63lCPjBuy5Hvmi7RH8fvHq.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Fox Entertainment Group",
         "id": 85721,
         "origin_country": ""
      }],
      "release_date": "1999-10-29",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "£",
      "directors": ["Eric Styles"],
      "runtime": 92,
      "synopsis": "An intense and destructive love-triangle leads to complete heart-ache.",
      "writers": ["Catherine Linstrum"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0144178/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY3OTE3OTA3OF5BMl5BanBnXkFtZTYwMjgwNTg5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Rupert Graves, Samantha Morton, Nicholas Woodeson | See full cast and crew »"],
      "reviews": [
         "Luminous acting, plus painterly cinematography, plus expert musical scoring, equals heavenly cinema. Woody Allen cast Samantha Morton as the mute co-star to Sean Penn in `Sweet and Low Down' (remember the girl who never said a word, but spoke volumes?). After seeing her in this film, I don't think she even needed to audition. This film is especially for those who know that movies which are described by some as `about nothing' are usually the ones that are really about everything-everything that really matters. An intense and unforgettable journey for anyone with an emotional life.",
         "Sepia-toned, understated, Hardyesque - Dreaming of Joseph Lees is one of those rare, quiet films that hits with brute force. Its only serious fault is in a too-slim characterization of Harry - his desperation could and should have been a little more fleshed out. We're only given glimpses into the reasons behind his crippling dependency on Eva. Apparently lots of folks feel that Joseph Lees suffers from a similar near-transparency, but his character is what it must be - he has always been a romanticized ideal for Eva. And his fleshing out in her eyes, is present, but also patient, as it must be. Near the end of the film, Morton turns in some of the best acting I've seen in years in a scene in which her Eva finds herself just inside the front door, literally caught between Harry (further inside the house) and Joseph (just outside the door). Rarely has heartbreak ever been so beautifully rendered in a performance as it is here. It's a crying shame that this film has yet to find its audience.",
         "DREAMING OF Joseph LEES is one of the most romantic pictures of recent years but it is seriously marred by a pretentious streak, improbable character actions, and a artsy ambiguous ending that is a cheat. Samantha Morton gives an excellent performance but Eva is such an incredibly plain heroine that it's odd why two quite handsome (one of them, Rupert, extraordinarily handsome) men would be obsessed with this little church mouse. Set in 1958 rural England, Eva has long mooned over a distant cousin, Joseph Lees, who unlike the rest of her relatives has gone off to see the world and is interested in \"books and things\". Eva is pursued by a local pig farmer Harry who longs to be a prizefighter and longs to bed Eva. Having not hear anything about Joseph in years, Eva decides to slide into a relationship with the persistent Harry, only to have Joseph suddenly reappear and for the dark side of Harry's obsession to be revealed. I found the screenwriter's sympathy with Harry downright offensive given his truly dangerous personality. When Eva, upset with his barking dogs, tells him to \"get rid of them\", he does - he shoots them!! Later he goes and self-mutilates himself ( thinking perhaps Eva's emotional tie to Joseph was sympathy based?) - this is some scary sh*t and yet the screenwriter treats it all like, poor thing he really loves her and its tearing him apart. I realize this is set in the late 1950's (though you would never know it from some of the clothes and hairstyles) but even then women had more options that just feeling obligated for life to the person who deflowered them. That everybody was so sympathetic to Harry for all the emotional BS he put Eva through was just bizarre to me. The ending leaves it up in the air what will be Eva's final decision - Harry or Joseph - it's an artsy twist that the producers should have demanded be rewritten. There is a slight hint she will go with Joseph (her sister's smile) but it's certainly not clear what her final decision will be. Had the producers brought in someone to rewrite the script they may have had themselves a major hit instead of what it is, a obscure little film not seen by many and one of the very few from recent years that has never been released on DVD. The performances are excellent though - the young actress playing the little sister is really good and the ever dashing Rupert Graves proves once again he is one of the best actors in films today. But let's face it - if a woman has to choose between Rupert Graves or somebody else, unless that woman is mentally unbalanced herself, \"somebody else\" hasn't got a snowball's chance in hell.",
         "Out of curiosity, I picked up this movie at a video store, and was very pleasantly surprised. Samantha Morton is exquisite and believeable as Eva, a quiet girl who harbors a deep love for Joseph Lees, a geologist and distant relative. I had never heard of Rupert Graves before but he too was tremendous as a lonely man with a personal sorrow. The supporting cast was top-notch. This is a movie that I have seen several times and will certainly rent it again in the future. It is unforgettable.",
         "Again, the Brits show off their capacity for quality adult drama, story lines not dummied down for public consumption, and actors whose ability to shine in roles without special effects, gratuitous nudity, and oversize lips makes this film a viewing delight. Rupert Graves is an actor whose face reflects emotional pain and sensuality in equal amounts. He is a treasure in this film. Stories of human dilema, period costumes, and location interiors add to the brilliant presentation.",
         "Another transcendent performance from Samantha Morton (she was also the female lead in Woody Allen's \"Sweet and Lowdown\"). This is a truly lovely film, \"small\" in the sense that only a few characters and their lives are affected by the love triangle, but \"large\" in the sense that it will strike a familiar chord for many viewers. Morton's face seems to show every thought or feeling that passes through her. Eva (Morton) experiences both ends of an obsessive love relationship. She has been dreaming of her glamorous-seeming second cousin Joseph Lees (Rupert Graves in a fine performance) since a girlhood visit. A neighboring young pig farmer (Lee Ross)adores Eva; his attentions are charming but uninvited. I had truly never heard of this film when it came on TV late one night - and was delighted that I stayed up late to see it through to the end. I recommend you seek it out to do the same. Beautiful cinematography in a quiet film, written and directed with a restrained, well-modulated hand.",
         "Film-making is all about Waiting they say. So is Love. This film epitomizes the seemingly unending Wait for the Right Man - that one man who signifies all that is beautiful and pure and noble of mind and body - someone worth living and fighting for. For Eva this Wait has even more poignance because she knows who that man is...that he's not just a figment of her imagination, but a living breathing man named Joseph Lees - someone whom she knows can broaden the horizons of her restricted world and love her for who she is and not for what he derives from her(which is how Harry loves her). The case against Harry is not predetermined. It is established gradually. There are some touching moments between Eva and him when he's actually likeable. The scene in which he takes Eva out of the crowded boxing room is one such incident. Harry is at once boyish and likeable and selfish and despicable. Lee Ross has brought out these shades in his character brilliantly. As much as it is Eva's story, it is also the story of Joseph Lees. And it is Rupert Graves, in the title role, who makes this film for what it is. He is a Dream(don't mean to pun!) in the film! I had only seen him in Louis Malle's 'Damage' which he did 7 years before 'Dreaming...', a film in which he looked much younger, though he was completely overshadowed by the oh-so-powerful Jeremy Irons who played his father. For the audience to feel any empathy whatsoever for Eva for dreaming of Joseph Lees for so long, the actor had to be someone for whom the audience would feel the same. And Rupert Graves is absolutely divine in the role! It is because of him that the audience too gets involved in Eva's quest for Joseph Lees. In any film of this sort, deriving empathy for the characters is everything. It is to the credit of Eric Styles, the director that he has managed that. From the beginning you know that these two people, Eva and Joseph *have to* be together. You laud Janie, Eva's little sister(wonderfully played by Lauren Richardson) in her efforts to bring them together. You frown at Eva's father who unknowingly acts as an obstacle between them. Samantha Morton is excellent as Eva. It must be tough to act in a film where you have to cry so much and make it look real. She manages that. Her convulsive fit of tears in the end just before she rejoins Joseph is very well rendered by Morton. She has rendered the character with due grace and sensitivity. Cinematography and music are two of the other wonders of this film. The former has added to the atmospheric quality of the film, capturing well the wild undulating beauty of the Isle of Man where the film was shot. The music has added beautiful lyrical cadences to the emotions in the film. Not surprisingly it is composed by a master-composer like Zbigniew Preisner whose music for Kieslowski's 'Blue' and other films is equally beautiful. Worth dreaming....!!",
         "I have recently seen the movie on television, and after the first time, I found myself compelled to rent the movie, so I did. I find the characters Joseph and Eva to be utterly captivating. The cinematography of the film perfectly captured their passion, their desire, their unextinguishable love. Lee Ross perfectly played the character Harry Flite in regards to capturing the character's desperation, and maddening obsession. Ross captured the character so perfectly that it made me despise the character. With all this said and done, I found the ending to be one of two things, thus bringing me to an undecisive state. Other than that, the movie is a must see for the melancholic ambiance of the film is undeniable.",
         "i rented dreaming of joseph lees as a fan of rupert graves. i was not disappointed. samantha morton portrays eva as fragile, passionate, and naive, pining after her cousin joseph while living with the local pig farmer harry. harry's dependency and mental illness is disturbing and vaguely unexplainable; however, graves steals the film, sympathetically and realistically playing the mysterious joseph lees, carrying his own burden of a terrible accident in which is lost his leg. the ending is powerful and worth wading through the last half hour of harry's violent, pointless insanity and eva's maddening indecision.",
         "I thought this was an exceptionally well-directed, superbly-acted movie with a winding (albeit erotic!) plot . . . but a terrible, \"didn't see it coming\" end. The end was abrupt and totally out of place. At the very least, the \"cuckoo\" suggested in the title should've died off and the story should've then ended with Eva and her lover boy staring off into the sunset together Without yielding spoilers, I will also say pish posh to all the hogwash about how it should have been an easy choice for her to abandon her \"dreamer\" boy and stay with the \"one that loved her.\" The one that loved her did not love her, folks--he was a sick, depraved, mentally-ill soul who could not love properly, treat her properly, nor ever perceive her properly. He could not even relate properly to the real world let alone truly \"love\" Eva. He was a twisted, childish narcissist incapable of rendering her a suitable existence--unlike his dashing and mentally-sound rival. I wouldn't have even done for Harry what she did after the crazed stunt he pulled toward the movie's end--I would have left him to the State and not allowed him to manipulate me through his own self-destructive threats or actions like he did Eva. And then I would have happily sailed off with Joseph without batting an eye. Somehow in the movie she was made to bear the guilt and responsibility of every errant thought, motive, or action of Harry, and I don't think that was fair or deserving. Despite the \"too many unanswered questions\" ending, the movie--though a bit predictable--draws one in and holds him to the end with an eerie blend of nostalgia, sweet sentamentalism, erotic interest, and blimey--that strange, unusual, and tentacular \"twist\" so prevalent in English films (where they almost twist away from the norm or conventional a bit . . . but then, is that just the English?) The film is definitely worth its time."
      ],
      "genres": [
         "Romance",
         "Drama"
      ],
      "productionCompanies": [
         "Christopher Milburn Production",
         "Fox Searchlight Pictures",
         "Isle of Man Film Commission"
      ],
      "summaries": ["Somerset, 1958. Eva enters adulthood with good humor, keeping house for her absent-minded father, letting her younger sister Janie in on the secrets of growing up, working at a furniture factory, and dreaming of Joseph Lees, her second cousin who's off in Africa and Italy as a geologist, but has lost a leg in an accident. She's also considering the advances of a local farmer, Harry Flite, ebullient and head over heels for Eva. She agrees to live with him and seems happy, then at a family wedding, Joseph appears, she asks him to dance, and her fantasy begins to clash with Harry's obsession."],
      "budget": 2000000
   },
   "movielensId": 2998,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-10-29",
      "dvdReleaseDate": null,
      "directors": ["Eric Styles"],
      "runtime": 92,
      "movieId": 2998,
      "title": "Dreaming of Joseph Lees",
      "mpaa": "R",
      "actors": [
         "Rupert Graves",
         "Samantha Morton",
         "Nicholas Woodeson",
         "Lee Ross",
         "Felix Billson",
         "Lauren Richardson",
         "Vernon Dobtcheff"
      ],
      "imdbMovieId": "0144178",
      "originalTitle": "Dreaming of Joseph Lees",
      "genres": [
         "Romance",
         "Drama"
      ],
      "youtubeTrailerIds": ["ls5GxyWTp1M"],
      "plotSummary": "Set in rural England in the 1950s Eva (Samantha Morton) fantasises about her handsome, worldly cousin Joseph Lees (Rupert Graves), with whom she fell in love as a girl. However, stuck in a closed community she becomes the object of someone else's fantasy, Harry (Lee Ross). When Harry learns that Eva is planning to leave the village in order to live with and look after the injured Lees, he devises a gruesome scheme in order to force her to stay and look after him.",
      "tmdbMovieId": 108346,
      "avgRating": 3.25904,
      "releaseYear": "1999",
      "numRatings": 83,
      "posterPath": "/5l68j63lCPjBuy5Hvmi7RH8fvHq.jpg"
   }
}