{
   "tmdb": {
      "original_language": "zh",
      "keywords": [
         {
            "name": "servant",
            "id": 964
         },
         {
            "name": "cabaret",
            "id": 2311
         },
         {
            "name": "shanghai",
            "id": 2682
         },
         {
            "name": "diva",
            "id": 2992
         },
         {
            "name": "uncle",
            "id": 6464
         },
         {
            "name": "mistress",
            "id": 11869
         },
         {
            "name": "umbrella",
            "id": 41277
         }
      ],
      "imdb_id": "tt0115012",
      "video": false,
      "title": "Shanghai Triad",
      "recommendations": [
         118895,
         47102,
         200989,
         64015,
         59164,
         33341,
         135283,
         17342,
         24403,
         54659,
         133476,
         190415,
         53267,
         29972,
         60278,
         54291,
         93387,
         25650,
         9050,
         86261
      ],
      "backdrop_path": "/n78lIMVBMhZT7nMvEwxUcgGaPkh.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Xiao Jingbao",
               "gender": 1,
               "credit_id": "52fe46559251416c910511c3",
               "name": "Gong Li",
               "profile_path": "/dgGWKMAP5vbgACkXTazZXt3JQoT.jpg",
               "id": 643,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Tang, the Gang Boss",
               "gender": 0,
               "credit_id": "52fe46559251416c910511d9",
               "name": "Li Bao-Tian",
               "profile_path": "/iakW6UTcQG2utvTdvBlE6IsAa0p.jpg",
               "id": 146097,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Shuisheng, the boy",
               "gender": 0,
               "credit_id": "52fe46559251416c910511dd",
               "name": "Wang Xiaoxiao",
               "profile_path": null,
               "id": 150151,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Liu, 6th Uncle",
               "gender": 0,
               "credit_id": "52fe46559251416c910511e1",
               "name": "Li Xuejian",
               "profile_path": "/ramX1jQg0oFmxkQDE790EOY2irj.jpg",
               "id": 143358,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Song, Tang's No. 2",
               "gender": 0,
               "credit_id": "52fe46559251416c910511e5",
               "name": "Chun Sung",
               "profile_path": null,
               "id": 150152,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Zheng, Tang's No.3",
               "gender": 0,
               "credit_id": "52fe46559251416c910511e9",
               "name": "Fu Biao",
               "profile_path": "/cjJzkGG7mEfRquMnZlUzY35A8Uf.jpg",
               "id": 150153,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46559251416c910511c9",
               "name": "Zhang Yimou",
               "profile_path": "/uU5vECl94jDQYjiRk4eOpVRMEi9.jpg",
               "id": 607,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46559251416c910511cf",
               "name": "Bi Feiyu",
               "profile_path": null,
               "id": 146103,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46559251416c910511d5",
               "name": "Li Xiao",
               "profile_path": null,
               "id": 146104,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "58961384c3a368089f00ccd6",
               "name": "Lü Yue",
               "profile_path": null,
               "id": 72204,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 1.75079,
      "production_countries": [
         {
            "iso_3166_1": "CN",
            "name": "China"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 37557,
      "vote_count": 20,
      "budget": 0,
      "overview": "A provincial boy related to a Shanghai crime family is recruited by his uncle into cosmopolitan Shanghai in the 1930s to be a servant to a ganglord's mistress.",
      "similar": [
         11236,
         19101,
         46975,
         513552,
         31777,
         52239,
         133119,
         199030,
         188912,
         153168
      ],
      "original_title": "摇啊摇，摇到外婆桥",
      "runtime": 108,
      "poster_path": "/qcoOCoN7viOhboGwhYXyApdDuiq.jpg",
      "spoken_languages": [{
         "name": "普通话",
         "iso_639_1": "zh"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Ministère des Affaires Étrangères",
            "id": 2588,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Alpha Films",
            "id": 4507,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "La Sept Cinéma",
            "id": 23647,
            "origin_country": ""
         }
      ],
      "release_date": "1995-04-30",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "In 1930's Shanghai violence was not the problem. It was the solution.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Yimou Zhang"],
      "runtime": 108,
      "synopsis": null,
      "writers": [
         "Bi Feiyu",
         "Li Xiao"
      ],
      "originalLanguage": "Mandarin",
      "imdbLink": "http://www.imdb.com/title/tt0115012/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgyMzAwOTQyNF5BMl5BanBnXkFtZTcwNDU1MjgxMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Li Gong, Baotian Li, Wang Xiaoxiao | See full cast and crew »"],
      "reviews": [
         "Here's something you don't see every day - a mobster movie that focuses on the evil of criminals, instead of their coolness. \"Shanghai Triad\" shows you how mob violence destroys the life of a gangster's moll and endangers her innocent, fresh-from-the-country servant. It's exactly the kind of story you wouldn't see in a Hollywood movie - which is, I suppose, why we watch this weird foreign stuff! Gong Li is, as ever, forceful and compelling, with a role that's infinitely more interesting than what America's \"lead\" actresses usually get. She's very glamorous here, and totally unlike the peasant characters she played in \"To Live\" and several other films. What a wonderful, versatile actress. The film's other strengths include gorgeous, award-winning cinematography, interesting point-of-view shots, and an effective shift from an urban to a country setting that's pulled off very smoothly. It's a shame that this is the last film that director Zhang Yimou and Gong Li made together, but at least it caps off their collaboration on a high note.",
         "This is a fine movie - wonderfully acted, beautifully shot, quite simple. Without being heavy-handed, one comes to sense the presence of real evil that tempts and corrupts and destroys. It's a little slow at times because the story is so simple - yet the slowness and simplicity does allow the messages of the movie to hit home. Something else I like is that the protagonist boy is not made to be cute or winning - he just is who he is - largely an observer but sometimes acting with generosity and sometimes with contempt. Much has been said by others about the beautiful cinematography and that's certainly true - but I'm also struck by the amazing work of those who constructed or chose the sets, costumes, background characters - they were quite memorable. What a star in Gong Li, and what a director! I don't agree with those who contrast this with American movies - surely we feel the same evil in watching either version of Scarface or The Petrified Forest or The Road to Perdition. In fact, I would say this movie is most like The Road to Perdition of any I've seen - not in its story particularly but in its tone, its simplicity, its contrasts of character, its cinematography. This is also a good movie for those who say they don't like foreign movies - you'll like this one.",
         "This film is, foremost, a gangster film, but Zhang Yimou tells it from a much more interesting angle. As far as the plot about moles and trying to find the traitor in the group, it's old hat. What isn't, however, is seeing how the children, practically enslaved by a triad boss, begin to slowly turn into the type of people that Tang and Bijou are throughout the movie. Another refreshing change was, despite Tang's wealth, the triads are not romanticized like the mafia often is in this country. Tang, unlike Vito Corleone, is a ruthless killer, born and bred, not a family man forced into a situation. What impresses me most about Zhang Yimou's films are the cyclic nature, where everything comes full circle in the end. For many, the colors and political messages are the topic of discussion, but watching events carry out within a restricted time, and follow the Eastern idea of cyclical rather than linear time, is more interesting, since these characters continue to develop in one's head even after the movie has ended.",
         "There has been way to much chatter about how beautiful this film is with its sumptuous sets, costumes, and magnificent photography. On the surface this looks like another gangster film, this time taking place in Shanghai. But of course, it isn't. The gangster scenario is just the backdrop really. Shuisheng, a boy of 14, has come to the city to serve the haughty and beautiful Xiao Jingbao, the nightclub singing moll of Tang, head of the most powerful gang in Shanghai. Shuisheng's uncle is a riot as he gives the boy a whacky set of instructions on how to be a proper servant to snobby Xiao, wonderfully played by Gong Li. \"Call her 'Miss'. Follow her wherever she goes, not to far behind, and not to close. That's the rule. Hold her coat in your left hand and her hat in the right, but don't let the coat drag on the floor. That's the rule. Got it?\" And the Shuisheng replies, \"Got it.\" However, after \"Miss\" delights in calling him a country bumpkin, and chews him out a couple of times, (And why not, Shuisheng can't tell a red dress from a green one.) the kid starts looking for the exit. When his uncle tells him, \"When she rings for you, stop everything (yes, everything) and go to her. Got it?\" His reply this time is, \"I want to leave.\" Bad move, uncle is most displeased. In many ways, Shuisheng is the most inscrutable character in the movie. He's got a real poker face, and you'll probably have a tough time deciding if he's an idiot, or a sharp kid who's observing things closely and learning fast. This is the heart of the film, the relationship between the boy and the woman. Eventually, the boy will find out the self-important, hip swinging Xiao Jingbao is miserable. She is the beautiful songbird hopelessly trapped in a world where she is bathed in luxury by the ruthless Tang, with no hope of freedom. The boy's whole attitude changes when he realizes this, and the question the film poses from here is ... what, if anything, can he do about it? If this was an American film, (and I'd love to see such a version) probably plenty, but director Yimou Zhang is a cynical man with a dark outlook on life. All his films have downbeat endings, and this one is no exception. What really bothers me though, is that events take place that result in a complete shift in setting half way through the film, and that's always a dangerous move in the cinema. And this abrupt shift comes at a time when things are just getting interesting in the nightclub, when Shuisheng realizes \"Miss\" is very unhappy. He might have been able to help her in the big city and spacious confines of the nightclub, but marooned on an island, there's not much he can do. This is a good film, but I would have liked to see the plot move in a different direction in the second half.",
         "The big plus here is in the visual department It is gorgeously filmed with deep, rich colors. The story isn't that much. You keep excepting it to get better. It holds that promise but doesn't deliver until the ending, which has a neat no-nonsense twist. I really liked and admired that ending and wish more movies had realistic finishes like this. Gong Li, who stars in here, plays a character that is interesting for the first half of the film but her spoiled-brat routine gets annoying after awhile. The main gangster, however, is an interesting guy throughout. I've watched this twice and, frankly, expected more both times.",
         "A young boy is brought to 1930's Shanghai from the countryside to be the manservant of a gang boss's mistress. The mistress (Gong Li) is a glamourous nightclub singer and a royal bitch. Soon after he arrives, the boy is witness to a power play in the underworld that results in the uncovering of lots of treachery and quite a bit of violence. It's a nicely constructed story with good acting from everybody involved. It's fairly straightforward, but satisfying, and seeing the gang land activity from the perspectives of two outsiders makes it all the more interesting. SHANGHAI TRIAD became my favourite Zhang Yimou film when I saw it some years ago, for the simple reason that it was one of the most beautiful films I'd seen. The production design, costumes, lighting and camerawork are all quite remarkable - creating stunning images from the opulence of Shanghai's nightclubs and mansions to the simplicity of the rural island where the second half of the film takes place. Unfortunately, the R1 DVD fails to do the film justice. The colours are far too subdued, giving the film a rather lifeless look, and the demon of the digital age, Edge Enhancement, rears its ugly head again. The result looks rather like a VHS transfer, but I'd swear in court that the film looked a lot better on my UK VHS copy (mainly because of the colours). Poor Zhang Yimou, he hardly ever seems to get good representation on DVD. The film is recommended for fans of Zhang Yimou or Gong Li, though without the vibrant cinematography the film wouldn't be ranked as his best by many people. If you've already got the film on VHS, it's not worth \"upgrading\" to the DVD though.",
         "Gong-Li and film making partner Zhang Yimou have another fine hit; in a series that is beautiful filmmaking as well as one the government would find disapproving of the reality of triads. She plays a \"moll\" , also a singing star triggering more than an ample reward for the conniving under bosses who would try to topple the boss. Stunningly photographed and acted, maybe near the Hang Zhou coast (or a rare unfilled canal in Shanghai?) ... with his beautiful concubine, and the narrative device of a young male orphan as fellow observer; the Boss hits the mattresses due to an attempted murder from within; and retires to an island to discern the traitor giving orders to kill anyone who arrives or leaves the island without his permission. Then the Boss waits, and Gong-Li idles no longer singing in the cabaret; and the \"smoke out\" begins. Excellent poignant drama sensitively photographed. As in all her films, and the directors, the people as bystanders and victims of any corruption is a subtle attended theme!",
         "When I first saw Zhang Yimou's wonderful 'Raise the Red Lantern', I missed all but the last 30 minutes. This is the most regretful episode of my life for the film has now been deleted. My life was honestly changed as that half an hour was a real time anomoly, obeying the theory of relativity and breaking that particular convention by immersing me so fully that it seemed to last forever and yet, not long enough. 'Shanghai Triad' does not contain that one off quality, however, it is in itself a fascinating film. The colour scheme, of many Yimou films remains, his use of colour is deeply moving as it becomes sublime and almost 'old school'. You can see movies of the studio system being played out again but in a whole new style. Red is so prominent once again and for reasons we can only speculate. Personally I see the colour red as an exciting colour, it conveys to me a sense of a past in which I did not belong to, how I did not exist. The fascination I have in history pre-1982 and more importantly the early 20th century glamour and ancient history. The splendour of the whole thing is beyond belief, it could almost have the production values of a Hollywood mainstream movie. It shows that perhaps you can create a better effect with lower production values. The Tang household is splendid, but it's vastness perfectly encapsulates a lonely feeling that puts you in the place of the child as well as any cliched point of view shots ever could. It is moments like these that prove Yimou's background as a cinematographer, he is a master of the visual, able to simply show a character's mood in an implicit sweep of camera and minutely fine detail within the mise-en-scene excluding cliche from his work completely. This is the sort of filmmaking we would associate with Ridley Scott, Scott is a visualist, he works with far darker tones than Yimou, which from a personal point of view, makes Yimou my prefered choice, but Scott himself blended both dark and light in 'Thelma and Louise' like Yimou has done for most of his career. The characters themselves have layers of light and dark which are conveyed well in all of their surroundings. This comparison with Scott brings me to the point in Triad when the empathy shifts from the boy to be shared by him and Bijou. This does echo a bit of the Roy Batty syndrome which was probably the reason for 'Blade Runner's' limited success on it's original release, or so says Robert McKee. But Gong Li's performance is outstanding. She nails Bijou's nasty streak to a tee and then compels us to believe that she is more than that. Of course it is helped when the viewer feels that the situation she is in is a frightening one, not unlike mountaineering where one false step could end up in death, at what ever height you are at. Li is one of the finest actresses in the world, not to mention that her beauty is unparalleled. (Despite the fact that she is just four years younger than my mother) The film may not be seen as very moral but it is clear that it has heart as we feel so bad about the events that end the film. Li shows her hardness of character and complete vulnerability then finally her loss of control, shame and regret. This heart is not made of solid stone, rather a quite flexible rubber. It requires a period of reflection, one that does not equal that of 'Raise the Red Lantern' but is the only film to have such a numbing effect since. By now though, I have Lantern in such a high regard that it borders on gaining a mythical quality as I have yet to see it in it's entirety. It's not every day that a heavily opinionated young man will be reduced to a pathetic single syllable, but when Triad is finished, many of you will be reduced to it too, lay back and just clear your head of anything other than the film, all that enters the head will be \"Wow\".",
         "This could be an American gangster movie except that it is so beautiful. Well, that and the fact that it takes place in Shanghai in the 1930s. Gong Li plays Xiao Jingbao (\"Bijou\") the moll, a self-centered, vain, mean, slutty songstress kept by the \"Boss\" (Baotian Li) of Shanghai's underworld. As usual with director Zhang Yimou every set is gorgeous and artfully planned, the story compelling, and the human psychology veracious. We see the events through the eyes of Shuisheng (Wang Xiaoxiao) a 14-year-old boy from the country who, because he is a member of the trusted Tang family, is brought to the city to be a servant to Bijou. She treats him and everybody else like dirt while she plays the Boss for a fool. We can guess that her comeuppance will be severe. Oh, but HOW severe? In this Zhang Yimou goes beyond what one has seen in American gangster movies and gives us something from Machiavelli and Genghis Kahn. The film is a little slow in parts and Gong Li plays her role so well that she is most disagreeable\u0097that is, until what I might call the \"turn.\" This occurs when she is forced to go with the Boss to the country after a rival has attempted to kill him. Bijou is bored. There is nothing for her to do so she goes to the house of a country widow named Cuihua (Baoying Jiang) with a nine year old daughter Ah Jiao (Yang Qianquan) to lord it over her and to amuse herself with these country bumpkins. But the surprise is that in the process she is returned to her childhood when she herself was a country bumpkin. Zhang Yimou plays this part of the film masterfully as we slowly realize that Bijou is jealous of Cuihua and her poor but idyllic life. But that is something she can never admit to herself as she spies on Cuihua with her lover. One almost gets the sense that Bijou would like to be in Cuihua's place with that crude country lover. At one point Bijou makes Cuihua loan her some of her peasant clothes and then takes delight in wearing them. We can see that Bijou is in denial about how much of a slave to the master she really is and how unsatisfying is the life of a kept woman regardless of how well kept. She realizes that her life is empty. And now we see a certain generosity of spirit: she gives the boy some silver coins; she tells the boss to spare the woman, but it is too late. Because you talked to her she knows too much, he says. He adds, you see, it is your fault again. This film sits well with the current communist government of China despite or perhaps partly because the Boss with his small round eyeglasses looks a little like a Chinese Trotsky. But more importantly Zhang Yimou's depiction of the criminal decadence of China in the 30s before the rise of communism is exactly what Maoists like to see. Communism freed the Chinese from all that, is perhaps the idea. This is not the only film of Zhang Yimou's to play to communist sensibilities. His Raise the Red Lantern (1991) also shows in a different way the moral corruption of what might be called the ancient regime. But Zhang Yimou can be forgiven for playing to the powers that be because he does it with subtle irony and for a purpose, the purpose being to give himself the celebrity and an international reputation so that he is able to make films that might in some way criticize the communist state while he maintains a position of loyalty to that state. Working from within, it might be said. We see this in his To Live (Huozhe) from 1994 in which the hardships under communism are not euphemized. To be more exact it might be said that Zhang Yimou sees the excesses of Mao's regime but realizes that Mao was a stage through which China had to pass; and at any rate, who would want to go back to the time of the capitalist gangsters? The airy, white tops of the reeds wave in the breeze. The colors are straw and the cottage on the island is neat and holds out against the rain. Inside Cuihua cooks and weaves a basket. She is content. Bijou, in her red dress and her red lips, wearing her jewelry and her superior manner, is not. She recalls the mulberry trees of her childhood and how she would climb the trees and eat the tree-ripened fruit. All the riches in the world cannot bring back those days, nor can she return to them. She would like to take nine year old Ah Jiao with her back to Shanghai. Ironically Ah Jiao in her innocence wants to be like \"Miss,\" which is Bijou's \"title.\" Ironically, however, it is the Boss who takes the little girl back so that she can grow into the next Bijou. The ending of the film is as brutal as anything you might expect to see, and yet there is a kind of poetic justice in what happens. In part. Zhang Yimou is always about politics, even though the politics are sometimes \"just\" domestic politics, as in Raise the Red Lantern. But he does the politics in a way that leaves no doubt: justice or what comes to pass is shaped by those who hold the power, whether it is the power of the state, or the power of the gangster boss, or the power of the master of the house, not by those who do not hold power. And that is the trenchant reality behind the great beauty of any Zhang Yimou film. (Note: Over 500 of my movie reviews are now available in my book \"Cut to the Chaise Lounge or I Can't Believe I Swallowed the Remote!\" Get it at Amazon!)",
         "\"Shanghai Triad\" is the last of the great collaborations between director Zhang Yimou and actress Gong Li. They will not work together until 2006's \"Curse of the Golden Flower\", and that period drama is a negligible work. A school of thought has it that this film is the last and the least of the collaborations between the two (a point made by American critic Roger Ebert). However, watching this movie after catching the director's excellent \"To Live\" again, \"Shanghai Triad\" does not strike one as a lesser movie. In fact, technically and narratively, this film is even more ambitious that its earlier counterpart and could be said to be something like Zhang Yimou experimenting on the gangster genre. Only that the gangster genre does not yet exist in mainland Chinese cinema and the director has to breathe life to the genre by consulting Western models. Hence it is set in Shanghai in the 1930s, the most Western (and crime-ridden) of Chinese cities. \"Shanghai Triad\" has a lot of nuances which would be lost on non-native speakers. For some, this film is merely one of many mobster movies, a la Chinese style. But the Chinese title of the film hints on its primary theme: the corruption of the naive through (Triad) violence and bloodshed. The Chinese title alludes to a typical Chinese lullaby/rhyming song sung by children and which personifies itself in little Jiao, the young girl in the island. In a way, she is also young Jinbao, going back many years. The young country lad Shuisheng is similarly tainted. He cannot fight against the Chief of the Triad no matter how much he knows about his rottenness. At the film's end it is hinted that Shuisheng will probably end up as one of the Chief's men, probably as he bids a time to avenge the death of the Gong Li character. Technically, this film is astounding. The Shanghai nightclub scenes are splendidly realized and show that the Chinese technicians are more than a match for their Hollywood counterparts. This film rightly won a Technical Award at Cannes, and the cinematographer Lü Yue was nominated for an Oscar. Nonetheless, it is Zhang Yimou's helming which makes this film truly unique. He is able to show us the perspective from young boy Shuisheng, and make us share his fears amidst all the novelty of coming to a large city and then witnessing countless murders himself. The directing is fluid and seamless yet does not draw attention to itself. It is truly a marvelous technical achievement. The resplendent Gong Li is always watchable, and here her movement from a pampered cabaret singer to a sympathetic character entirely believable. Zhao Baotian is excellent as a Triad Boss. The other characters all hold themselves up well, including the boy playing Shuisheng, who is asked to downplay his emotions so as to depict a wooden \"country bumpkin\". Thanks to Roger Ebert this film has been thought to be one of Zhang Yimou's lesser films but it really shouldn't be so. Maybe something is lost in the translation, but if you really watch it in its original language understanding every nuance and every line of the dialog, \"Shanghai Triad\" will reveal itself as what it is: a masterpiece. A very underrated film. Highest recommendation."
      ],
      "genres": [
         "Crime",
         "Drama"
      ],
      "productionCompanies": [
         "Alpha Films",
         "La Sept Cinéma",
         "Ministère des Affaires Étrangères"
      ],
      "summaries": [
         "Uncle Liu brings his cousin to Shanghai to work for 'Boss,' the leader of a powerful drug empire in the 1930's. Shuisheng, a simple country boy is awed and overwhelmed by the opulence and immense wealth he is suddenly surrounded by. He is to be the attendant of Xiao Jingbao, the new mistress of 'Boss.' While he fumbles with the demands of his new role, much intrigue is going on around him, well beyond his bewildered perception. Xiao Jingbao is having a tumultuous affair, Fat Yu is starting a gang war, and 'Boss' is beginning to suspect that one of his trusted men is not loyal.",
         "A provincial boy related to a Shanghai crime family is recruited by his uncle into cosmopolitan Shanghai in the 1930s to be a servant to a ganglord's mistress."
      ],
      "budget": 0
   },
   "movielensId": 30,
   "movielens": {
      "languages": ["普通话"],
      "releaseDate": "1995-04-30",
      "dvdReleaseDate": "2000-12-12",
      "directors": ["Zhang Yimou"],
      "runtime": 108,
      "movieId": 30,
      "title": "Shanghai Triad",
      "mpaa": "",
      "actors": [
         "Gong Li",
         "Li Bao-Tian",
         "Wang Xiaoxiao",
         "Li Xuejian",
         "Chun Sung",
         "Fu Biao"
      ],
      "imdbMovieId": "0115012",
      "originalTitle": "摇啊摇，摇到外婆桥",
      "genres": [
         "Drama",
         "Crime"
      ],
      "youtubeTrailerIds": ["mQf3Ngg2cks"],
      "plotSummary": "A provincial boy related to a Shanghai crime family is recruited by his uncle into cosmopolitan Shanghai in the 1930s to be a servant to a ganglord's mistress.",
      "tmdbMovieId": 37557,
      "avgRating": 3.63576,
      "releaseYear": "1995",
      "numRatings": 1359,
      "posterPath": "/qcoOCoN7viOhboGwhYXyApdDuiq.jpg"
   }
}