{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "concentration camp",
            "id": 1631
         },
         {
            "name": "holocaust",
            "id": 1739
         },
         {
            "name": "jewish life",
            "id": 2315
         },
         {
            "name": "deportation",
            "id": 2428
         },
         {
            "name": "jew",
            "id": 2606
         },
         {
            "name": "nazi",
            "id": 2652
         },
         {
            "name": "eastern europe",
            "id": 3023
         },
         {
            "name": "fool",
            "id": 5090
         },
         {
            "name": "village",
            "id": 5331
         },
         {
            "name": "nazi germany",
            "id": 11064
         },
         {
            "name": "train",
            "id": 13008
         }
      ],
      "imdb_id": "tt0170705",
      "video": false,
      "title": "Train of Life",
      "recommendations": [
         70443,
         62365,
         298986,
         253496,
         65673,
         48318,
         268159,
         17974,
         31398,
         120399,
         288778,
         266036,
         26495,
         73872,
         58098,
         57507,
         24225,
         3418,
         53014,
         22916
      ],
      "backdrop_path": "/huLxfwq5xjIFt9qOOju2gzOcCht.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Shlomo",
               "gender": 0,
               "credit_id": "52fe448fc3a36847f809ce71",
               "name": "Lionel Abelanski",
               "profile_path": "/opIpeTJJGTR49xr1VZJNJuUWrqN.jpg",
               "id": 7278,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Mordechai",
               "gender": 2,
               "credit_id": "52fe448fc3a36847f809ce75",
               "name": "Rufus",
               "profile_path": "/bbMPwEFZaALc3VqBPZ8od2rmRuv.jpg",
               "id": 2407,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Rabbi",
               "gender": 0,
               "credit_id": "52fe448fc3a36847f809ce79",
               "name": "Clément Harari",
               "profile_path": "/iVykmgZ9Ue5qIQ7mNczefwNVXN8.jpg",
               "id": 32162,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Esther",
               "gender": 1,
               "credit_id": "52fe448fc3a36847f809ce7d",
               "name": "Agathe de La Fontaine",
               "profile_path": "/4LeMOBBoLJ8YV0miTM3VE3Bmf6k.jpg",
               "id": 53903,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Yossi",
               "gender": 2,
               "credit_id": "52fe448fc3a36847f809ce81",
               "name": "Michel Muller",
               "profile_path": "/scfCDYoAEnv1NP9rh9mTSVrYvu0.jpg",
               "id": 21659,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Schmecht",
               "gender": 2,
               "credit_id": "52fe448fc3a36847f809ce85",
               "name": "Johan Leysen",
               "profile_path": "/cjLEEzFfEGoEEpHnNxjfso04Dd0.jpg",
               "id": 53904,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Yankele",
               "gender": 2,
               "credit_id": "52fe448fc3a36847f809ce89",
               "name": "Bruno Abraham-Kremer",
               "profile_path": "/6PXh65Yyw0IGbFJb6UTHzOYYJSx.jpg",
               "id": 53906,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Manzatou",
               "gender": 0,
               "credit_id": "52fe448fc3a36847f809ce91",
               "name": "Gad Elmaleh",
               "profile_path": "/ay3csj0Wmn8OppIcArmHRiwmBLc.jpg",
               "id": 51100,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Sura",
               "gender": 1,
               "credit_id": "54fc9a3ac3a36869cf00512a",
               "name": "Marie-José Nat",
               "profile_path": null,
               "id": 543091,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe448fc3a36847f809ce97",
               "name": "Radu Mihaileanu",
               "profile_path": null,
               "id": 20430,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe448fc3a36847f809ce9d",
               "name": "Radu Mihaileanu",
               "profile_path": null,
               "id": 20430,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe448fc3a36847f809cea3",
               "name": "Goran Bregović",
               "profile_path": null,
               "id": 53908,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe448fc3a36847f809cea9",
               "name": "Giorgos Arvanitis",
               "profile_path": null,
               "id": 20572,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe448fc3a36847f809ceaf",
               "name": "Laurent Dailland",
               "profile_path": null,
               "id": 6316,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe448fc3a36847f809ceb5",
               "name": "Monique Rysselinck",
               "profile_path": null,
               "id": 53909,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "War",
            "id": 10752
         }
      ],
      "popularity": 4.579692,
      "production_countries": [
         {
            "iso_3166_1": "BE",
            "name": "Belgium"
         },
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "IL",
            "name": "Israel"
         },
         {
            "iso_3166_1": "NL",
            "name": "Netherlands"
         },
         {
            "iso_3166_1": "RO",
            "name": "Romania"
         }
      ],
      "id": 8056,
      "vote_count": 75,
      "budget": 154790,
      "overview": "In 1941, the inhabitants of a small Jewish village in Central Europe organize a fake deportation train so that they can escape the Nazis and flee to Palestine.",
      "similar": [
         424,
         637,
         423,
         9045,
         16869,
         14574,
         228150,
         289222,
         13752,
         821,
         1771,
         2253,
         5925,
         203833,
         289,
         914,
         613,
         339259,
         351339,
         369885
      ],
      "original_title": "Train de vie",
      "runtime": 103,
      "poster_path": "/ziMr7tTwe7eop2XqaNPWlTg6C9E.jpg",
      "spoken_languages": [
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/oA5OLrPPlfbaskzPAo7J4uLydzD.png",
            "name": "Canal Plus",
            "id": 104,
            "origin_country": ""
         },
         {
            "logo_path": "/h4ZJb3wnffXHeeU6mtcldII84fo.png",
            "name": "Centre National de la Cinématographie",
            "id": 310,
            "origin_country": "FR"
         }
      ],
      "release_date": "1998-09-16",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Radu Mihaileanu"],
      "runtime": 103,
      "synopsis": null,
      "writers": [
         "Radu Mihaileanu",
         "Moni Ovadia"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0170705/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM0OTEzMDc4OF5BMl5BanBnXkFtZTYwNDMwNTM5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Lionel Abelanski, Rufus, Clément Harari | See full cast and crew »"],
      "reviews": [
         "I was disappointed recently as I read poor reviews of one of the best films I've ever seen. I saw this film twice at the Sundance Film Festival and was impressed and enjoyed the sensitive and comedic depiction of WW2 and populations facing war, however, you must stay to the very end, and let the final scene sink in to get the complete effect. This is not a heartwarming story of the holocaust, but a fantasy that thrusts the viewer back into reality and the horrors of the holocaust with a final shot that is one of the most heartwrenching and shocking scenes I've seen. Don't compare it with \"Life is Beautiful\"- many have done this and they are not similar. This film deserves better.",
         "This is a magnificent film. Like \"Life Is Beautiful\" it manages to be a comedy about the Holocaust but also a sensitive and thoughtful study of it. It's beautifully filmed, wonderfully acted, superbly directed. I can't think of a film I've seen this year that is more entertaining and more thought provoking. It's a comedy, it's a fantasy, it's a musical, it's a drama, it's a romance, it's an allegory and, yes, it's a tragedy. It's also wonderfully European with none of the predictable Hollywood cliches but with fascinating symbolism and revealing studies of human dynamics. But not the least artsey-dartsey. And how I'm tempted to give away the ending. But no! I wouldn't want anyone to miss that cinematic fist in the gut. Wow!!! The whole hour and a half is crystalized in a five second closeup. You won't be prepared for it! This is one of the few films I've ever given a ten!",
         "This film is often compared to LIFE IS BEAUTIFUL, and with good reason. They are both comedies that take on the treacherously delicate subject of the Holocaust. Also, Benigni turned down the opportunity to make this film and then \"borrowed\" the idea of a Holocaust comedy to make his film. Which is fine with me because in his hands, the film would have sunk into offensive silliness. Benigni is Italian, which means he is great at Italian humour. But he hasn't an idea as to what real Jewish humour is like. This film is a quintessentially Jewish film. It is about the old world Jewish experience that can only be understood and articulated by a Jew with old world roots. Unfortunately, much of the old world Jewish lifestyle and humour has been lost to recent generations. To some viewers, the characters in this film may seem like characters out of FIDDLER ON THE ROOF. But despite the broad characterizations for the benefit of Jewish humour, the characters here are all quite human and honest. Jewish humour by the way, depends on flagrant exaggeration and waggish expression. The film even uses a great analogy of this when it explains that Yiddish is basically German with a sense of humour. Take away the exaggerated humour, and you've got basic German. The story is about the inhabitants of a French shtetl (Jewish village) who decide to deport themselves to Palestine before the Nazis come and deport them to concentration camps. They buy a train, tailor a few dozen Nazi uniforms and flee across the continent, sidestepping real Nazis and French resistance fighters who think that the train of Jews is a Nazi train. There is a subplot involving an outbreak of communism among some of the Jews on the train that gets a little tired. But then that does live up to the film's title. This train of life is a microcosm of society, with all of its pettiness and short-sightedness. This is a beautiful film that is much funnier and bittersweet than LIFE IS BEAUTIFUL without the unnecessary manipulations to pull on our heartstrings. For those who want to taste the real Jewish experience, I recommend this highly! ADDENDUM: There are many who feel that it is sacrilege to make any type of comedy about the Jewish experience during WWll. To make light of suffering or to drastically bend or cover up the truth for the sake of \"entertainment\", is sacrilege. But this film does not do any of those things. It retains the humour and the dignity of a culture that was almost made extinct. It provides us with a great tribute to the spirit and perseverance of those people.",
         "Rarely does one has the pleasure of watching a movie that combines melancholy, drama, humor and insight into the human heart as this one does. A superb cast does honor to a powerful script. All of those who loved Roberto Benigni's \"Life is beautiful\" will be pleased to know that this film treats the same general subject with at least as much humor and sensitivity, but with more depth. I was not familiar with either the director or any of the actors. I just hope we will see more from them, as I can't praise this work enough.",
         "Quote: \"Mordechai: So Shlomo, have you ever been in love? Slomo: No!!! That would be madness!!\" OK, so there have been too many movies about the Holocaust and there are a lot of people \"complaining\" about that, but this is not necessary such a movie. It is more like one of the stories written by Isaac Bashevis Singer, and full of the same humor and sadness and irony... it may even be called a comedy, a black Balcanic humor, if people won't be offended by the association comedy - Holocaust... It is somehow the same way that \"Life is beautiful\" is a comedy, and the subjects are contiguous... It is a shame that the movie does not have an English subtitle (or at least one that I could find) but for the French speaker it is wonderful to watch in its original language. But try to find it. Give it a chance, even just because it comes mainly from Romania, and you are curious what can these guys do (check out the \"Awards\" section). And I promise you you'll be impressed. Or at least touched.",
         "It's amazing how many people seem to be complaining about the unrealism of this film. Given that anyone with two brain cells to rub together can see that the film is not trying to be realistic from scene 1 onwards, the question is not whether the film tried to be realistic and failed, but whether a film about the Holocaust must try to be realistic to be any good. The trouble is that unless as part of the performance the entire audience is deported in cattle-trucks, slowly starved, and then gassed, it is rather difficult to see how any film can be realistic about the Holocaust. So, if there are to be movies about the Holocaust at all, or if they are to do much beyond telling us that the Holocaust was ghastly (we knew that, didn't we?) they have to give up on trying to be realistic, and try to look at the Holocaust in an indirect way. This is where I think \"Train de Vie\" succeeds, for example by the deliberate parallels between the society inside the train, and the society that helped caused the Holocaust. I could list them at length, but if you've seen the movie and didn't notice them, you won't be convinced by anything I say, and if you haven't seen the movie, I'd rather leave you the pleasure of discovering them for yourself. I never actually thought of the film's relation to \"Life is Beautiful\" until reading the IMDB comments, after I'd seen both films. Well it's very hard to compare the two films, but I don't think \"Train de Vie\" needs to be ashamed of the comparison. True, Roberto Benigni does not star in it, and that is a heavy handicap for any film. On the other hand I think I like the exuberant un-reality of \"Train de Vie\" better. After all the portrayal of the Holocaust in \"Life is Beautiful\" is just as unrealistic as that of \"Train de Vie\"; the only difference is that \"Train de Vie\" revels from the first scene to the last in its unreality. If we must be unreal, let us at least enjoy it.",
         "There's quite a bit going on in \"Train of Life\" but it's worth following. The premise is that a shtetl (Jewish community) fears it will be deported to a World War II concentration camp. The village fool, Shlomo, comes up with the idea to purchase a locomotive, train some of the villagers to talk/act/dress like Nazis and head for Palestine in hopes they can fool the real Nazis. Okay, the premise is far fetched. That's a given. But for this film, it works. The close-knit village buys into the plan and sets to work creating the ruse. Shlomo rises about his \"village idiot\" persona and finds new worth. The fake Nazi commander, Mordechai, begins to take his role a little too literally. There's a subplot about some of the young men converting to Communism. And a small band of resistance workers who try to blow up the train. But the star of this film is not one person, it is the village. They've banded together to survive, which isn't lost amid the humor. There's true fear and hope. Some may feel the villagers are made fun of and lampooned, but there's a healthy respect for the Jewish customs and family closeness in this film. Watch the scene where the villagers prepare for the Sabbath during their journey and you'll see what I mean. Too many films to count have focused on the reality of the Holocaust. There's no deny that it was a horrific event that should never be forgotten. This film does not desecrate or abandon that truth. It simply adds a new dimension worth exploring.",
         "I saw this movie on Showtime, after a late night shift. Never went looking for it. I found the movie reveting. I saw some comments about \"Life is Beautiful\", and the comparison. A more apt comparison would be, I believe to \"Fiddler on the Roof\". In the same sense, perhaps not as musical though, the story seems to weave through the life and times of a community facing oncoming winds of change. In a way, with the arguments of the imitation Nazis, and the \"revolutionary\" communists, the pattern of life is both touchingly human, and comically sarcastic of how men are \"seemingly\" separated with each other. Although the Jewish communal environment seeps through the wonderful story, the later union with the gypsies who are also seeking a haven, relents to truly human and comic parody of the WWII era.",
         "Despite a really annoying audience of noisy senior citizens I got into the spirit of \"Train of Life (Train de vie)\" (though it was odd having the shtetl residents in a foreign-language film speak French until I realized of course in \"Jakob the Liar\" Robin Williams and Liev Schreiber speak English so why not in a Belgian/Romanian-produced movie wouldn't they speak French?). It has the immediate feel of the magic realism of \"The Milagro Beanfields War\" and it no more cheapens the Holocaust than \"The Occurrence at Owl Creek Bridge\" cheapens the Civil War. It is full of the warmth and love of everyday life and personalities come sweetly to life. I thought the Fool as the Seer was getting a bit much until it's made clear he's not really the Village Idiot so no heavy-handed symbolism.(originally written 11/14/1999)",
         "This is one of the best humor movies I've ever seen. It's really hard to mix a war plot with nice fine humor. Some try it but the result is very bad. This movie is an exception, it's great and funny. I think the soul of this movies is it near naive humor. There is no that boring kind of \"intelligent and cool humor for intelligent and cool people\". It's plain humor works fine. But don't think this movie is just humor because it has a humanitarian story bellow the humorous cover that touches the heart. It's about human beings doing their best to escape from death. The soundtrack of this movie is great. I love the music, it's fabulous. It's a great movie worth of seeing."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "War"
      ],
      "productionCompanies": [
         "Belfilms",
         "Canal+",
         "Centre National de la Cinématographie (CNC)"
      ],
      "summaries": [
         "Central Europe, WWII. The village fool of a small Jewish community warns the townsfolk that the Nazis are coming, and advises them to build a fake deportation train to cross the Russian border and get to Palestine. Some Jews are dressed up with German uniforms, and soon they start getting strange ideas about how it feels to be a Nazi; others are infected with the fast-spreading germ of communism. Meanwhile, the Russian border gets closer and closer...",
         "Europa Centrale. Seconda Guerra Mondiale. Per sfuggire ai nazisti che stanno arrivando, la comunità ebraica di un piccolo villaggio decide di fuggire organizzando un......finto treno di deportati ! Attraverseranno così l'Europa ed il confine russo, per arrivare in Palestina. Alcuni saranno travestiti da ufficiali nazisti, per confondere i nazisti veri. Il viaggio si fa avventuroso e grottesco. Alla fine.......... Naturalmente non sveliamo il finale di questo GRANDE PICCOLO film. Generalmente, non si dovrebbe usare l'aggettivo \"bello\" per giudicare un'opera d'arte, perchè non si spiegherebbero le scelte estetiche, tecniche, artistiche che si è dati, ma si esprimerebbe l'emozione ricevuta. Per quest'opera, però, lasciateci disgredire : TRAIN DE VIE è il film più bello della stagione 1998/99. E' divertente (e si ride di gusto), intelligente (e si riflette parecchio), poetico, delicato, girato bene ed interpretato meglio. I personaggi ci restano in mente e le situazioni comiche fanno pensare a Chaplin, ai fratelli Marx, al migliore Mel Brooks. Senza dimenticare la poetica del migliore cinema europeo. E' un film grottesco, che irride la stupidità e la assurdità delle guerre e delle intolleranze. E' un film sulla vita e sulla possibilità della convivenza pacifica (l'incontro fra gli ebrei e gli zingari è delirante ed emozionante).",
         "In 1941, the inhabitants of a small Jewish village in Central Europe organize a fake deportation train so that they can escape the Nazis and flee to Palestine."
      ],
      "budget": 0
   },
   "movielensId": 3003,
   "movielens": {
      "languages": [
         "Français",
         "Deutsch"
      ],
      "releaseDate": "1998-09-16",
      "dvdReleaseDate": null,
      "directors": ["Radu Mihaileanu"],
      "runtime": 103,
      "movieId": 3003,
      "title": "Train of Life",
      "mpaa": "",
      "actors": [
         "Lionel Abelanski",
         "Rufus",
         "Clément Harari",
         "Agathe de La Fontaine",
         "Michel Muller",
         "Johan Leysen",
         "Bruno Abraham-Kremer",
         "Gad Elmaleh",
         "Marie-José Nat"
      ],
      "imdbMovieId": "0170705",
      "originalTitle": "Train de vie",
      "genres": [
         "Drama",
         "Comedy",
         "War"
      ],
      "youtubeTrailerIds": ["t4esViss83M"],
      "plotSummary": "In 1941, the inhabitants of a small Jewish village in Central Europe organize a fake deportation train so that they can escape the Nazis and flee to Palestine.",
      "tmdbMovieId": 8056,
      "avgRating": 3.47015,
      "releaseYear": "1998",
      "numRatings": 201,
      "posterPath": "/hiMf74Vf0hPSOxpydnLuafjiZov.jpg"
   }
}