{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "underdog",
            "id": 240
         },
         {
            "name": "obsession",
            "id": 1523
         },
         {
            "name": "wisconsin",
            "id": 2024
         },
         {
            "name": "ambition",
            "id": 3734
         },
         {
            "name": "beer",
            "id": 4552
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "filmmaker",
            "id": 11614
         }
      ],
      "imdb_id": "tt0181288",
      "video": false,
      "title": "American Movie",
      "recommendations": [
         16636,
         52862,
         40819,
         26564,
         13958,
         9403,
         25099,
         36867,
         2260,
         42918,
         41480,
         12698,
         212185,
         178998,
         143770,
         120015,
         195092,
         231423,
         195073,
         196534
      ],
      "backdrop_path": "/crxlmQX74S5GRratmocQq2MauDi.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Filmmaker",
               "gender": 2,
               "credit_id": "52fe45de9251416c7506525f",
               "name": "Mark Borchardt",
               "profile_path": "/d9uBnnjwDNe6fcuFx0YgNInCJdq.jpg",
               "id": 87794,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Friend / Musician",
               "gender": 2,
               "credit_id": "52fe45de9251416c75065263",
               "name": "Mike Schank",
               "profile_path": null,
               "id": 84924,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Actor in 'Coven'",
               "gender": 0,
               "credit_id": "52fe45de9251416c7506526d",
               "name": "Tom Schimmels",
               "profile_path": null,
               "id": 545831,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Mark's Mom",
               "gender": 0,
               "credit_id": "55e45dbcc3a368272a000084",
               "name": "Monica Borchardt",
               "profile_path": null,
               "id": 1502565,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Mark's Brother",
               "gender": 0,
               "credit_id": "55e45dcac3a36841970042c4",
               "name": "Alex Borchardt",
               "profile_path": null,
               "id": 1502566,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Mark's Brother",
               "gender": 0,
               "credit_id": "55e45de4c3a368418e003b76",
               "name": "Chris Borchardt",
               "profile_path": null,
               "id": 1502567,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Friend / Associate Producer",
               "gender": 0,
               "credit_id": "55e45df4c3a3684185004048",
               "name": "Ken Keen",
               "profile_path": null,
               "id": 1502568,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Casting Director",
               "gender": 0,
               "credit_id": "55e45e0492514137d700409c",
               "name": "Matt Weisman",
               "profile_path": null,
               "id": 1502569,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Mark's Uncle / Executive Producer",
               "gender": 0,
               "credit_id": "55e45e1592514137dd00404f",
               "name": "Bill Borchardt",
               "profile_path": null,
               "id": 1502570,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Mark's Dad",
               "gender": 0,
               "credit_id": "55e45e2192514137e0003fed",
               "name": "Cliff Borchardt",
               "profile_path": null,
               "id": 1502571,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Production Manager",
               "gender": 0,
               "credit_id": "55e45e2e92514137d70040a3",
               "name": "Tom Beach",
               "profile_path": null,
               "id": 1502572,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Mark's Girlfriend / Associate Producer",
               "gender": 0,
               "credit_id": "55e45e4292514137e9004052",
               "name": "Joan Petrie",
               "profile_path": null,
               "id": 1502573,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45de9251416c75065269",
               "name": "Chris Smith",
               "profile_path": "/kM0jh8l0iByCeccUuWr6ygnjKXz.jpg",
               "id": 31654,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "55e45e5992514137e6004111",
               "name": "Chris Smith",
               "profile_path": "/kM0jh8l0iByCeccUuWr6ygnjKXz.jpg",
               "id": 31654,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "55e45e5f92514137d70040ab",
               "name": "Chris Smith",
               "profile_path": "/kM0jh8l0iByCeccUuWr6ygnjKXz.jpg",
               "id": 31654,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "55e45e87c3a36841910047f2",
               "name": "Sarah Price",
               "profile_path": null,
               "id": 31653,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "55e45ebdc3a3684185004068",
               "name": "Jim McKay",
               "profile_path": "/hrrBk9T8Ds0UH9NKds1gkbJioTo.jpg",
               "id": 205639,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 2,
               "credit_id": "55e45ecdc3a368272a0000b2",
               "name": "Michael Stipe",
               "profile_path": "/dF5PVRN0kAz1XK4zCP2jE5HVgDj.jpg",
               "id": 6957,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 2,
               "credit_id": "55e45edac3a3684191004800",
               "name": "Mike Schank",
               "profile_path": null,
               "id": 84924,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "55e45eeec3a368418b003e57",
               "name": "Jun Diaz",
               "profile_path": null,
               "id": 1502574,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "55e45ef9c3a3684191004803",
               "name": "Barry Poltermann",
               "profile_path": null,
               "id": 937827,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 5.39992,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 14242,
      "vote_count": 78,
      "budget": 0,
      "overview": "American Movie is the story of filmmaker Mark Borchardt, his mission, and his dream. Spanning over two years of intense struggle with his film, his family, financial decline, and spiritual crisis, American Movie is a portrayal of ambition, obsession, excess, and one man's quest for the American Dream.",
      "similar": [
         298312,
         2142,
         1813,
         4771,
         4982,
         431,
         10285,
         23483,
         205,
         562,
         59967,
         244786,
         339692,
         261023,
         281957,
         292280,
         8810,
         281,
         681,
         948
      ],
      "original_title": "American Movie",
      "runtime": 107,
      "poster_path": "/y8dJgWr1HeW0RRxwANDWvgIXdsF.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Civilian Pictures",
            "id": 62136,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Bluemark Productions",
            "id": 62137,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "C-Hundred Film Corporation",
            "id": 62138,
            "origin_country": ""
         }
      ],
      "release_date": "1999-11-05",
      "vote_average": 7.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Chris Smith"],
      "runtime": 107,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0181288/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BOTA1OTEzMjM4MV5BMl5BanBnXkFtZTcwOTgwNDcxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Mark Borchardt, Mike Schank, Tom Schimmels | See full cast and crew »"],
      "reviews": [
         "I just watched this again the other night. It's probably the ninth or tenth time I've seen it, and I think it gets better every time. Contrary to what some people are saying, I don't think the makers of this film are laughing at and ridiculing Mark. Sure, some of the humor in the film is of the car-crash can't look away variety, but I feel underneath that they really admire the guy and his dogged tenacity. Another thing is I think Mark does show some skill as a director. Remember he has zero money shooting this stuff, and Coven was conceived as a money-making venture so he could make Northwestern. I think some of the samples they were showing from Northwestern actually looked very good. Now I don't think Mark writes the best dialogue in the world, but looking just at his photographic eye I'd say if the guy had any kind of schooling he might be shooting movies for someone right now. And finally, I think some of the people making negative comments about this movie need to look in the mirror and think about themselves a bit. OK, you don't like the movie, that's fine. But I've seen enough smug, superior, comments on here to make me want to puke. I love how as long as you're a poor, lower middle-class white in America people love to throw around terms like \"white trash\", \"redneck\", and other such pleasantries. I believe some scribe from Orange County at the beginning of the reviews even called them \"inferior\". I'm sure most of the people making the comments consider themselves liberals too; as if they have any concept of what that word means.",
         "I have mixed feelings towards this movie. I found the movie fascinating in the way people are fascinated by car wrecks, and I found it funny in the way one might uncontrollably burst out a laugh at the sight of an eldelry person slipping on an icy sidewalk. It's a sick and guilt ridden enjoyment. The lives of most of the people this movie brings you in contact with are so pathetic that you can't help being intrigued. But lives hardly worth living do not a good movie make. No; there was more to it than that. What sucked me in to this documentary was the perserverence and tenacity of the characters that carry on day after day in an existence that would drive most people to jump off the nearest bridge. People standing around in robes in a forst in the dead of winter for hours on end to help a friend that will no doubt produce a film only 400 locals would pay to see. A barely coherent old man who's too cheap to use the phone for local calls lends $3,000 to his nephew for a project he is certain is doomed. A mother who is as clueless as her heart is big sticks by her son through thick and thin. These things tug at the heart and, despite all the pity and head shaking they provoke, reveal a humanity that one can't help but be in awe of. Oh, and the comedic moments are priceless. Uncle Bill steals the show in that department, but many others contribute. (The kitchen cabinet door scene nearly rolled me off the couch.) Yep; there are some priceless laugh spots in this film that almost make you wonder whether this isn't truly a mockumentary in the style Christofer Guest (Spinal Tap, Best In Show). But it's not; it's real life making you laugh, and that makes it funnier. Yes; I enjoyed the movie quite a bit, but probably for the wrong reasons. But so did countless others. In the end, it doesn't matter. A good movie is a good movie.",
         "At several points in \"American Movie,\" would-be filmmaker Mark Borchadt is forced to confront what compels him on a trail with seemingly few rewards. A constant refrain is heard in his answers. He doesn't want to work the forgettable life of a newspaper boy; he wants to achieve celebrity. Why? Though Mark doesn't quite know, his volumnious collection of scripts and tomes underscores his simple love of film. Yet \"American Movie\" is brutally honest in its treatment of Mark. While it allows his dreams of making \"the great American film\" to fly free on film, it also captures a life filled with lower-class constraints and realities. Despite all of Mark's desire, his motivation is frequently lost in a life gush with alcohol. Hence, the making of Borchadt's film, \"Coven\", goes from 6 months to 3 years and the movie suffers a bit from being drawn out. \"American Movie\" is rife with memorable supporting characters and Mark is an able lead. This film is really the story of two filmmakers, the one in front of the camera and the one behind. Director Chris Smith has already received his plaudits, and once \"American Movie\" makes the rounds of the indy circuit, Mark Borchadt will also have his share of fame. Maybe then he'll know what to do with it.",
         "Okay, so I'm a sucker for a good documentary, particularly where it tells a modern-day Don Quixote story. A caveat: I met Mark Borchardt in the winter of 1995/96 while he was still working on Coven. But I'll save that story for later. American Movie, which commenced production not long after, accurately portrays the person that I knew, although in greater depth than I expected or believed existed. This is simultaneously a very funny and very sad film, and is brilliantly executed. Mark comes across as his own worse enemy: his childlike ambition and optimism -- which I admire -- is undermined by his apparent artistic ineptitude as well as his bizarre fiscal expectations. But he's also a charismatic guy. His loyal Sancho Panza sidekick is equally likeable: loyal, if frazzled, to the core. Like Don Quixote, American Movie presents an often-ignored inefficient aspect of freedom -- that people will be drawn toward professions to which they are not particularly well-suited, irrespective of repeated failure. It is a great film.",
         "This documentary is the most hypnotizing film I have seen in a long while. I must have had it on for an entire day. The selected material included in the piece flow amazingly well and develop three characters that are impossible to ever forget. The different layers of these people peel back to make an oddly moving film about perseverance, loyalty and determination. These characters ended up suprisingly fascinating and the film is unforgettable.",
         "Praised by some, loathed by others, this Chris Smith documentary tells the real-life story of a twenty-something, amateur filmmaker named Mark Borchardt who sets out to complete his thirty minute film \"Coven\", as a first step toward what he hopes will be a lifelong career in feature film-making. Working menial jobs, Mark lives at home in his parent's basement. He's deep in debt. And he has no professional experience. What he does have is idealism, enthusiasm, supreme confidence, and enormous determination and zeal. The question in my mind was: does Mark have ... talent? Reminiscent of Michael Moore's \"Roger & Me\" (1989), \"American Movie\" is both funny and depressing. We watch Mark: write a script, cast players, direct, edit, and especially crucial in Mark's case, find funding. With every one of these tasks Mark plods along frustrated, but determined. All of these activities involve other people, including his mom, his spaced-out friend Mike, and other locals. One of these locals is his real-life Uncle Bill who looks to be in his eighties. At one point Uncle Bill, sitting in his cluttered trailer, demands to be fed before he will consent to being filmed. Later, Mark, being a perfectionist, requires more \"takes\" since Uncle Bill can't seem to get it right. Mark to Uncle Bill: \"You have to believe in what you're saying\", to which Uncle Bill responds: \"Well, I don't; I don't believe in nothing you're doing\". After \"take\" 31, Uncle Bill rebels: \"Isn't that enough now? That's all for me\". Some reviewers of \"American Movie\" have criticized it as pointless voyeurism into the life of a no-talent loser. They refer to Mark and his cohorts as \"trailer park white trash\". Certainly, that is one interpretation, and along with it the conclusion that the film is a sad commentary on the impossibility of achieving Hollywood's idea of the American Dream, when you have no money to work with. But other reviewers find the film to be inspiring, a cinematic pep talk for the underdog, and brutally honest about the realities of indie film-making. These viewers point out that despite the fact that Mark had no money to speak of, he still completed his film \"Coven\", and got it shown at the local theater. My own conclusion is that \"American Movie\" is a well-crafted documentary useful for first time indie filmmakers. It's similar to a TV reality show, but without the competition. The cinematography and the editing are excellent. Although I found Mark to be irritating at times and overconfident of his skills, I admired his optimism and determination. \"Coven\", included as an extra on the DVD, may be a cinematic train wreck. But Mark's overall experience is no less valid as a guide to others. In essence, the message of \"American Movie\" is: don't let this happen to you.",
         "Looking for proof that real life is more entertaining than fiction? You just found it. This superb documentary about an aspiring feature filmmaker (Mark Bortchart) who refuses to admit defeat is the funniest film I have ever seen -- probably because it's also one of the most tragic. Oddly enough, the more I watch the film the more inspired I become.",
         "This is a very well made documentary. I read some of the other comments and I get a feeling that a few of these viewers don't watch too many documentaries (and all the reality TV crap doesn't count). Yes, this movie is painful at times because of the ineptness of the horro film director struggling to get his pals and relatives to help him make his demonic movie. But it shows someone (however debatable his talent)following a dream, a passion, a desire to do something. To break out of his hellish life of debts, and child out of wedlock and dreary 9-5 job. The camera captures wonderful moments of human behavior and just like project Greenlight, it shows what happens when people get in over their heads with trying to just film a simple scene (or a scene where someone's head has to go through a cabinet, or an old man has to clearly say ONE line and can't, etc.) BUT, a much better documentary about the same world is the much earlier 1975 documentary Demon Lover Diary - where someone tagged along as these Michigan guys tried to make their horror film. Hard to track down but highly recommended.",
         "After seeing American Movie, you either hate Mark Borchardt or you understand him. If you are a struggling film maker trying to be the next George Romero, John Cassavetes or Alfred Hitchcock, you will understand Mark's determination and where he gets his talentless motivation. The audience that makes up American Movie is just that. Struggling film makers or die hard fans of Troma. Either way, they are all members of the club of hard knocks and non-union independent feature film. The moral of Mark's story is something short of following your dream. It's more and less than that. Whether you relate with Mark in more ways that one, Mark is living a lot of people's reality. Because of that, American Movie is important and should be watched by every film student in America.",
         "For me, the best & most memorable movies are often those which on first viewing I know nothing about. American Movie is a perfect example of just such a gem. Watching TV late one evening, I spotted the one & only good review among the dross - thankfully I settled in for a real treat. American Movie is a documentary following the unforgettable Mark Borchardt (pronounced \"orchard\", I believe), a highly articulate & charismatic Wisconson lad, as he struggles to write, direct and produce \"MidWestern\", a gritty, low-budget Horror movie on which he has been working for years. In Mark we discover a young man filled with contrast. His appearance is of the classic trailer-trash stereotype - skinny, bum-fluff mustache, '80s heavy metal styling, mullet hairdo, etc. To camera however, Mark reveals startling wit & insight as he philosophizes upon life, love, movies & the American way. As the movie unfolds, it sadly becomes clear that Mark's lack of discipline & heavy drinking are relentlessly sabotaging his creative efforts. American Movie is a charming watch, filled with hilarious moments & vivid characters. Chief among these is Mark's lovable buddy Mike Schank, a soft-spoken reformed stoner who, having conquered an addiction to scratch cards, is now dependent on soda pop. I absolutely loved American Movie. It generates real empathy between the viewer & principal characters, and provides hilarity without feeling exploitative. I would wholeheartedly recommend it to anyone."
      ],
      "genres": ["Documentary"],
      "productionCompanies": [
         "Bluemark Productions",
         "C-Hundred Film Corporation",
         "Civilian Pictures"
      ],
      "summaries": [
         "On the northwest side of Milwaukee, Mark Borchardt dreams the American dream: for him, it's making movies. Using relatives, local theater talent, slacker friends, his Mastercard, and $3,000 from his Uncle Bill, Mark strives over three years to finish \"Covan,\" a short horror film. His own personal demons (alcohol, gambling, a dysfunctional family) plague him, but he desperately wants to overcome self-doubt and avoid failure. In moments of reflection, Mark sees his story as quintessentially American, and its the nature and nuance of his dream that this film explores.",
         "Documentary about an aspiring filmmaker's attempts to finance his dream project by finally completing the low-budget horror film he abandoned years before."
      ],
      "budget": 0
   },
   "movielensId": 3007,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-11-05",
      "dvdReleaseDate": "2000-05-23",
      "directors": ["Chris Smith"],
      "runtime": 107,
      "movieId": 3007,
      "title": "American Movie",
      "mpaa": "R",
      "actors": [
         "Mark Borchardt",
         "Mike Schank",
         "Tom Schimmels",
         "Monica Borchardt",
         "Alex Borchardt",
         "Chris Borchardt",
         "Ken Keen",
         "Matt Weisman",
         "Bill Borchardt",
         "Cliff Borchardt",
         "Tom Beach",
         "Joan Petrie"
      ],
      "imdbMovieId": "0181288",
      "originalTitle": "American Movie",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["zMFZOu8rDUQ"],
      "plotSummary": "American Movie is the story of filmmaker Mark Borchardt, his mission, and his dream. Spanning over two years of intense struggle with his film, his family, financial decline, and spiritual crisis, American Movie is a portrayal of ambition, obsession, excess, and one man's quest for the American Dream.",
      "tmdbMovieId": 14242,
      "avgRating": 3.90761,
      "releaseYear": "1999",
      "numRatings": 2273,
      "posterPath": "/y8dJgWr1HeW0RRxwANDWvgIXdsF.jpg"
   }
}