{
   "tmdb": {
      "original_language": "fr",
      "keywords": [],
      "imdb_id": "tt0117365",
      "video": false,
      "title": "Portraits chinois",
      "recommendations": [],
      "backdrop_path": "/iKa5EdiGMfxcwnkQRm1tsdV7m2.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Ada",
               "gender": 1,
               "credit_id": "55d3c2cbc3a368508c000170",
               "name": "Helena Bonham Carter",
               "profile_path": "/rHZMwkumoRvhKV5ZvwBONKENAhG.jpg",
               "id": 1283,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "L",
               "gender": 1,
               "credit_id": "55d3c33092514102c3000181",
               "name": "Romane Bohringer",
               "profile_path": "/keVDM0uUbKmo0yOVNrjMuKiH1B2.jpg",
               "id": 40938,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Lisa",
               "gender": 1,
               "credit_id": "55d3c40792514102c80001a0",
               "name": "Romane Bohringer",
               "profile_path": "/keVDM0uUbKmo0yOVNrjMuKiH1B2.jpg",
               "id": 40938,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Nina",
               "gender": 1,
               "credit_id": "55d3c452c3a368507200019d",
               "name": "Marie Trintignant",
               "profile_path": "/27apFXn2nZMl5FpDNXAOdpePDiR.jpg",
               "id": 39689,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Emma",
               "gender": 1,
               "credit_id": "55d3c495c3a36850700001f3",
               "name": "Elsa Zylberstein",
               "profile_path": "/bw1bIuyfyOyxRlx2qIKk4AwQLTU.jpg",
               "id": 39195,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Yves",
               "gender": 2,
               "credit_id": "55d3c4b5c3a368507f0001e1",
               "name": "Yvan Attal",
               "profile_path": "/kSP1gv3n06amj8zoajm8Gam5Mzl.jpg",
               "id": 2245,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Guido",
               "gender": 2,
               "credit_id": "55d3c4d4c3a368508c000190",
               "name": "Sergio Castellitto",
               "profile_path": "/uq5xz7kinzgdclGOcechgfPBgYC.jpg",
               "id": 2166,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Alphonse",
               "gender": 2,
               "credit_id": "55d3c4f8c3a3685070000200",
               "name": "Miki Manojlović",
               "profile_path": "/mIQ7f8wQ18AAGkrR7qMIsurosDM.jpg",
               "id": 48791,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Rene Sandre",
               "gender": 2,
               "credit_id": "55d3c56d92514102d5000205",
               "name": "Jean-Claude Brialy",
               "profile_path": "/g3kkYcAvq90tALMErxmdAIcIXsE.jpg",
               "id": 24299,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Fanny",
               "gender": 1,
               "credit_id": "55d3c5a092514102d500020a",
               "name": "Mathilde Seigner",
               "profile_path": "/2aH71AKpo9qbkjOU1XQFv97r4Fj.jpg",
               "id": 48577,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Philippe",
               "gender": 2,
               "credit_id": "59ee637f9251413db901b03f",
               "name": "Jean-Philippe Écoffey",
               "profile_path": "/pDqyHLXunSkR5By0hToZxH3e8rI.jpg",
               "id": 49946,
               "order": 12
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe4a2dc3a36847f81beb5f",
            "name": "Martine Dugowson",
            "profile_path": null,
            "id": 933201,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 0.101185,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 104103,
      "vote_count": 2,
      "budget": 0,
      "overview": "Ada and Lise are both costume designers, the first is around 20, the other around 30. Both are working hard on their break through. There are also jobs for the movies. This is where Lise meets producer Alphonse, who is nearly 20 years older than she. Because he is unhappy with his girlfriend a secret relationship evolves. Ada has problems as well, but she's not the only one. There are also the young Emma and Nina, as well as Yves and Guido - enough people to get into complicated relationship entanglements.",
      "similar": [],
      "original_title": "Portraits chinois",
      "runtime": 111,
      "poster_path": "/dlRkBu3ANPbDYaRa4wx8wKLZ3z5.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [],
      "release_date": "1996-09-12",
      "vote_average": 7.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Martine Dugowson"],
      "runtime": 111,
      "synopsis": null,
      "writers": [
         "Martine Dugowson",
         "Peter Chase"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0117365/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk0OTAzMzcyN15BMl5BanBnXkFtZTcwMDM1OTIzMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Helena Bonham Carter, Romane Bohringer, Marie Trintignant | See full cast and crew »"],
      "reviews": [
         "It was interesting to see this film directed by the woman who made the fascinating 'Mina Tannenbaum', which succeeded better than this one, possibly because it involved fewer characters. This is an ensemble piece on the 'group of friends' theme. These are not as easy to direct as they seem, as there are too many balls in the air at one time. The main problem with this attempt is that we don't really care about these people very much, because they are silly and spoilt and self-indulgent. Apparently, this film is meant to deal with this issue satirically, but this dimension was lost on me, as I am not French and clearly 'don't get that'. The only character with whom I had the slightest sympathy was the one played by Romane Bohringer, who always seems to make her characters of compelling concern, even when they should be repellent. Here again, as in 'L'Appartement', made earlier the same year, Romane plays a girl in the compulsive grip of obsessive love. She is eerily convincing at this, and she must be dangerous to meet, in case she becomes fixated. She gets 'that manic look in her eye' and you have to run! Strangely, Romane seems much slimmer in this film than in the one made earlier in that year. Her performance is certainly the best, but not far behind are Helena Bonham Carter and Elsa Zylberstein, who are also extremely powerful in their performances. Helena B.C. (there is no A.D. version) seems more at ease and casual in this film than in her English films, and as a foreigner her French sounds great to me, though doubtless the Academie Francaise would accuse her of something, and so would those shoulder shruggers to be found all over Omnia Gallia which as we all know divisa est, as no one there ever stops quarreling or quibbling. This film gets better as it goes along, starting rather slowly, with us not knowing who everybody is for some time. Eventually it all pulls together and we think 'how quaint', wistfully thinking: 'Wouldn't it be nice if I cared?' It was disturbing and tragic to see Marie Trintignant in this film, knowing her terrible fate to come, poor girl. She seems shy and occasionally a bit spaced-out, with a hint of decadence, but does well, and one cannot help but sense, 'bravely', as she seems by nature an introvert who was forcing herself to perform in public against her nature.",
         "Episodic film dealing with the lives and loves of a group of young professional Parisians. Helena Bonham-Carter in her first French film is good and speaks the language like a native. Romane Bohringer is very sexy as usual, and Elsa Zylberstein and Marie Trintignant are very amusing. The male characters are less interesting and rather two-dimensional, with the exception of screenwriter Paul (Jean-Philippe Ecoffey). The film concentrates mainly on the on-off relationship between Ada and Paul and the effect that the young Lise has on both their personal relationship and Ada's professional career. The film is an improvement on Dugowson's previous \"Mina Tannenbaum\", but the large number of characters makes it difficult to get emotionally involved with, and care what happens to, any of them.",
         "This is a rather sublime movie if you think of it as the other half of \"Fight Club.\" Its where the Helena Bonham Carter character came from, a banal empty movie with a similar structure. The structure here is a group of men involved in movies, and young women mostly involved in the fashion industry. Each worries about their own types of stories. The two overlap in terms of profession. And of course the central part of the thing is how they engage each other in relationships. Swaps and disappointments. At the center of all the human dynamics is Ada, played by Helena. She loses her man, the filmmaker and toward the end he makes a film of the experience, with the intent of getting her back. He does. All this small folding is supposed to charm us in simple ways. There's talk about the film within the film, about it being a failure because it has the qualities of the film we see. There's talk about a woman dress designer wanting to design a dress that by itself can eliminate the pain men cause women. There's the implication, typically French, that love is a matter of defining self. Its not sharp. Its not illuminating, its just quiet, somewhat structured wondering about love with an artificially happy ending. You'll do well to see this before Fight Club. Ted's Evaluation -- 2 of 3: Has some interesting elements.",
         "I very much enjoyed this delightfully unusual film. The French are noted for their style, their self-assurance, their savoir-faire and savoir-vivre, and French films from Rohmer to Sautet present us with a world of elegance, intelligence, and charm. The inner angst of this world is normally shown in dramas like Un Coeur en Hiver or Une Femme Française, and there is no question that the French are, in fact, very self-aware and conscious of their own limitations. Portraits Chinois, however, uses humour and wit to convey the inner lives of its characters, their fantasies, the lies they tell themselves, and the ways in which they resolve their (mainly romantic) dilemmas. There isn't a false note anywhere, and there are several very fine performances, among which Helena Bonham-Carter's stands out. Her French is nothing less than flawless. It's just the sort of film that is worth re-watching once one knows how their stories pan out. The reviewer who thought it was awful rubbish obviously hasn't watched much French cinema.",
         "Paris is the setting for this film, written and directed by Martine Dugowson which was shown recently on cable. Not having seen it before we decided to take a chance. We are taken to meet a group of friends working in fashion and movies as they go through their lives. The focus of the piece is Ada, an English fashion designer now working for Rene Sandre, a famous fashion stylist. Ada's move to a fabulous apartment facing the Seine which she shares with Paul, her writer boyfriend working on a screenplay with Guido. Enter Lise, an intense looking woman, younger than Ada, to work for Sandre. The designer feels an attraction for the new girl, but she has set her eyes on Paul, at the expense of hurting Ada's feelings, and breaking her relationship. The others in the group include Alphonse, a producer, Yves a film director whose latest film has bombed with the critics, and his wife Nina. There is Emma, an unstable woman who lacks talent, as shown in her attempt to do a show in a small theater. All these friends intermingle, but the crux of the story is basically how Lise get in between Paul and Ada, bringing their relationship to an end. Paul goes on to tell the story of their love for a film that Yves directs. Although not a terrible movie, this well paced and directed film by Martine Dugowson, does not ring true in many aspects. The closeness between the people in the group is not real and the friendships are put to a test. The film has been compared to a Woody Allen film, but we must add it does not have the humor one always finds in the American counterpart's movies. All the women fare better in the picture. Helena Bonhan Carter has some good moments as Ada. Romane Bohringer is fine as Lise. Marie Trintignant makes a good Nina and Elsa Zylberstein does great work as the untalented Emma. The men characters are not as interesting as those of the women, which in a way make sense coming from a woman director telling the story from the feminine side. Sergio Castellitto, the great Italian actor is totally wasted.",
         "A waste of time, Helena Bonham-Carter's French was excellent throughout. Very good. Ignore the 'linguist' who obviously is NOT a linguist as his/her use of basic English is well below even High School standard. Just someone who thinks they know about accurate use of foreign languages.Clearly a moron.A linguist? ha ha that is so funny. Who do they think they are? Chomsky? I only wanted to ridicule this person and the only way I seem to be able to do this is by submitting a minimum of ten lines as a review. I just wasted 2 hours of my life on this worthless piece of trash, now I have to vent my spleen on some loser who purports to be a linguist. Just go and see 'Midnight In Paris' if you want to see a masterpiece!",
         "This plays like a French Woody Allen movie. Even the music is reminiscent of a New York scene. And, of course, they talk and talk and talk and talk and flirt and talk and talk and talk and make love and talk and talk and talk and jerk off at the office and talk and talk... You get the idea. Heck, you can even hear their inner dialogue and see the fantasies they're picturing in their heads at any given moment. By the first 10 minutes, though, you wish they would just get it over with. I only lasted through about half of the movie, then I just got too bored. AND, for about a quarter of the movie, all this talking is unintelligible if you don't understand French because the **(@#(*$ white subtitles get lost in the white tablecloth, in the white dresses, etc. But this is just another reason to not bother with this one.",
         "France has been making the same old films: Group of close friends or people going through ups and downs. That's it. Such as \"Le gout des autres\", \"Les Bronzés\", and \"Mille Millièmes\". As a Linguist, I found Helena Bonham Carter fairly good in this film. Her french was good but not excellent. There is something about actors that I find pitiful when playing in foreign films or speak a second language; They don't truly speak it fluently and so therefore when playing a role such as Carter's, one can tell that she hasn't truly digested the French language and the consequences are that when one hasn't perfected a certain language, one becomes over the top. One can see that Carter is a bit self-conscious about her linguistic skills and in this case she ends up being theatrical and clownish. I admire and revere her as an actress but stick to english speaking films. The whole cast does fairly well but it's the plot that doesn't fare well. Marie Trintignant shines and look for Jean Claude Brialy as the fed up fashion designer. If you watch \"Robert & Robert\" you will see how truly gifted this actor is.",
         "France has been making the same old films: Group of close friends or people going through ups and downs. That's it. Such as \"Le gout des autres\", \"Les Bronzés\", and \"Mille Millièmes\". As a Linguist, I found Helena Bonham Carter fairly good in this film. Her french was good but not excellent. There is something about actors that I find pitiful when playing in foreign films or speak a second language; They don't truly speak it fluently and so therefore when playing a role such as Carter's, one can tell that she hasn't truly digested the French language and the consequences are that when one hasn't perfected a certain language, one becomes over the top. One can see that Carter is a bit self-conscious about her linguistic skills and in this case she ends up being theatrical and clownish. I admire and revere her as an actress but stick to english speaking films. The whole cast does fairly well but it's the plot that doesn't fare well. Marie Trintignant shines and look for Jean Claude Brialy as the fed up fashion designer. If you watch \"Robert & Robert\" you will see how truly gifted this actor is."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": ["IMA Productions"],
      "summaries": ["Ada and Lise are both costume designers, the first is around 20, the other around 30. Both are working hard on their break through. There are also jobs for the movies. This is where Lise meets producer Alphonse, who is nearly 20 years older than she. Because he is unhappy with his girlfriend a secret relationship evolves. Ada has problems as well, but she's not the only one. There are also the young Emma and Nina, as well as Yves and Guido - enough people to get into complicated relationship entanglements."],
      "budget": 0
   },
   "movielensId": 3009,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1996-09-12",
      "dvdReleaseDate": "2000-10-31",
      "directors": ["Martine Dugowson"],
      "runtime": 111,
      "movieId": 3009,
      "title": "Portraits chinois",
      "mpaa": null,
      "actors": [
         "Helena Bonham Carter",
         "Romane Bohringer",
         "Romane Bohringer",
         "Marie Trintignant",
         "Elsa Zylberstein",
         "Yvan Attal",
         "Sergio Castellitto",
         "Miki Manojlović",
         "Jean-Claude Brialy",
         "Mathilde Seigner",
         "Jean-Philippe Écoffey"
      ],
      "imdbMovieId": "0117365",
      "originalTitle": "Portraits chinois",
      "genres": [
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Ada and Lise are both costume designers, the first is around 20, the other around 30. Both are working hard on their break through. There are also jobs for the movies. This is where Lise meets producer Alphonse, who is nearly 20 years older than she. Because he is unhappy with his girlfriend a secret relationship evolves. Ada has problems as well, but she's not the only one. There are also the young Emma and Nina, as well as Yves and Guido - enough people to get into complicated relationship entanglements.",
      "tmdbMovieId": 104103,
      "avgRating": 2.51786,
      "releaseYear": "1996",
      "numRatings": 28,
      "posterPath": "/dlRkBu3ANPbDYaRa4wx8wKLZ3z5.jpg"
   }
}