{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0016630",
      "video": false,
      "title": "Battling Butler",
      "recommendations": [
         51303,
         51364,
         42368,
         45807,
         37360,
         50704,
         87859,
         51358,
         51367,
         51392,
         51362,
         33015,
         177335,
         36818,
         8468,
         49966,
         131366,
         37311,
         126764,
         58776
      ],
      "backdrop_path": "/huAUBkwLVCEPHauXRR7WCUZ8DFV.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Alfred Butler",
               "gender": 2,
               "credit_id": "52fe47f0c3a36847f81502f3",
               "name": "Buster Keaton",
               "profile_path": "/8weZnW4cxkbMxtFAtO1NhfTrM9D.jpg",
               "id": 8635,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "The mountain girl",
               "gender": 1,
               "credit_id": "52fe47f0c3a36847f81502f7",
               "name": "Sally O'Neil",
               "profile_path": "/94TCvBfuiGGxAlyc4dJIPUTvUIa.jpg",
               "id": 144019,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Her father",
               "gender": 2,
               "credit_id": "52fe47f0c3a36847f81502fb",
               "name": "Walter James",
               "profile_path": null,
               "id": 97996,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Her brother (as Bud Fine)",
               "gender": 2,
               "credit_id": "52fe47f0c3a36847f81502ff",
               "name": "Budd Fine",
               "profile_path": null,
               "id": 141139,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Alfred Battling Butler",
               "gender": 2,
               "credit_id": "52fe47f0c3a36847f8150303",
               "name": "Francis McDonald",
               "profile_path": "/17jRSxdkNutYoRea5fqZrh5QX9J.jpg",
               "id": 102327,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "His wife",
               "gender": 0,
               "credit_id": "52fe47f0c3a36847f8150307",
               "name": "Mary O'Brien",
               "profile_path": null,
               "id": 144020,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "His trainer",
               "gender": 2,
               "credit_id": "52fe47f0c3a36847f815030b",
               "name": "Tom Wilson",
               "profile_path": null,
               "id": 96061,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "His manager",
               "gender": 2,
               "credit_id": "52fe47f0c3a36847f815030f",
               "name": "Eddie Borden",
               "profile_path": null,
               "id": 144021,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Alfred's valet",
               "gender": 2,
               "credit_id": "52fe47f0c3a36847f8150313",
               "name": "Snitz Edwards",
               "profile_path": null,
               "id": 14488,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47f0c3a36847f81502e3",
               "name": "Buster Keaton",
               "profile_path": "/8weZnW4cxkbMxtFAtO1NhfTrM9D.jpg",
               "id": 8635,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe47f0c3a36847f81502e9",
               "name": "Al Boasberg",
               "profile_path": null,
               "id": 1500,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47f0c3a36847f81502ef",
               "name": "Lex Neal",
               "profile_path": null,
               "id": 144015,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "57e885cac3a3682227015f86",
               "name": "Buster Keaton",
               "profile_path": "/8weZnW4cxkbMxtFAtO1NhfTrM9D.jpg",
               "id": 8635,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "57e885d3c3a3687c5c002645",
               "name": "Joseph M. Schenck",
               "profile_path": "/h4CrbfNzM5W1edUruPjyvl0uxSj.jpg",
               "id": 10520,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "57e885da9251412ae30172a3",
               "name": "Bert Haines",
               "profile_path": null,
               "id": 14410,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "57e885e1c3a3687c5f00275d",
               "name": "Devereaux Jennings",
               "profile_path": null,
               "id": 14411,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 1.863373,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 51371,
      "vote_count": 17,
      "budget": 0,
      "overview": "Alfred's father feels his son has grown up too comfortably and as a result has not become what a man should be. To remedy this predicament he sends his son Alfred off on a hunting trip. On the trip, in the midst of many follies brought on by his inexperience with the outdoors, he meets a young mountain girl and falls in love with her. Alfred's butler, who has accompanied him on the outing, is sent to arrange the marriage with the girl's father, who thinks Alfred is too weak to become a member of the family. In an attempt to change the father's mind, the butler tells the girl's father and brother that Alfred is actually Alfred \"Battling\" Butler, a professional boxer. The deception works and a wedding is arranged. Comic mischief ensues as Alfred and his butler attempt to make their newly fabricated story seem plausible to the family of his new bride.",
      "similar": [],
      "original_title": "Battling Butler",
      "runtime": 77,
      "poster_path": "/7MVdo4OyzIcwycN58J9n855ggoS.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Buster Keaton Productions",
         "id": 12190,
         "origin_country": ""
      }],
      "release_date": "1926-09-19",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Buster Keaton"],
      "runtime": 77,
      "synopsis": null,
      "writers": [
         "Paul Girard Smith",
         "Al Boasberg"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0016630/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEzMDA5NTgzNV5BMl5BanBnXkFtZTgwNjk0NzE2MjE@._V1_SX189_AL_.jpg",
      "actors": ["Stars: Buster Keaton, Sally O'Neil, Walter James | See full cast and crew »"],
      "reviews": [
         "It's curious that Buster Keaton, whose training was in a knockabout vaudeville act and slapstick comedy shorts, was so good at playing pampered, effete young millionaires. He just happened to be one of nature's aristocrats. Buster appreciated the comic possibilities of this character\u0097starting out so helpless allowed plenty of room for dramatic development--and the role also suited his innate gentleness and quiet dignity. Buster played wealthy idlers in several of his movies, including The Navigator, but he was never more placidly twitty than in Battling Butler. For the first half of the movie he looks like a 1920s fashion plate, exquisitely groomed, demonstrating What the Well-Dressed Man Will Wear for hunting, fishing, etc. He is Alfred Butler, whose tycoon father, annoyed by his son's languid existence, sends him an a camping expedition to toughen him up. In the mountains, he sleeps in a vast tent complete with bed, wardrobe and tiger rug; his faithful valet lays out his clothes, draws his bath, and serves his meals on silver dishes. This is my idea of roughing it! While attempting to hunt (obliviously missing every animal in the forest) and fish (capsizing his boat in pursuit of a bobbing duck), Alfred encounters a pretty \"mountain girl\" (Sally O'Neil.) They fall in love, but her family won't accept this sissy as an in-law until Alfred's valet tells them that his employer is actually Alfred \"Battling\" Butler, a boxer contending for the lightweight title. Alfred goes along with the ruse for the sake of the girl. Then he encounters the real \"Battling\" Butler, and after a misunderstanding involving the boxer's wife, \"Battling\" tells Alfred that HE can fight the title bout with the \"Alabama Murderer\"\u0097or he'll blow his cover. The rest of the film follows Alfred's difficulties as the trainers try to turn the playboy into a fighter. Along with the athletic sequences in his later movie College, these scenes offer the most sustained focus on Buster's extraordinary physique and what he could do with it. With his small stature, Buster could convincingly portray a milquetoast as long as he kept his clothes on, but once he strips down to boxing shorts it's all too obvious how exceptionally fit he was. In the opening shot of the training sequence, he's obviously supposed to look puny and defenseless; instead he looks like he could easily be a boxer. Despite his sculpted body, Buster plays these scenes with a realism that renders them almost painful to watch. He reacts the way any normal, soft-bellied human being would to being mercilessly pummeled. He shows hurt and exhaustion, and displays his own nearly limitless endurance of both. Buster had, it must be said, an unhealthy capacity to take punishment. It wasn't masochism, just that his pride in his physical abilities and the authenticity of his stuntwork outweighed any concern for his own well-being. He must have been used to pain: as the star of an act renowned as the roughest in vaudeville, he'd been \"taking it like a man\" ever since he was a toddler. At the end of the movie, \"Battling\" attacks Alfred viciously, and finally Alfred retaliates and beats the boxer unconscious. Many people dislike this fight, feeling it's uncharacteristic for Buster to triumph through brute force, sheer slugging, rather than ingenuity or pluck. The fight was Keaton's own addition to the play that was the source for the movie. The original ending simply let Alfred off the hook without having to fight, which Buster felt was dramatically unsatisfying. Pushed too far, humiliated too deeply, his meek character finally responds with fury and violence. It is uncharacteristic, but maybe he liked it for just that reason. Off-screen, Buster had a troubling passivity, especially in his unhappy married life, and he must have enjoyed playing a character who effectively fights back. Still, I prefer the first half of the movie, with its gentle pace, low-key jokes and elegant touches. Alfred's valet is played by Snitz Edwards, a tiny actor (he makes Buster look imposing) with a goblin face and a delicate performing style. Cute as a button, Sally O'Neil makes one of Buster's most effective leading ladies. In a sweet image typical of Keaton's sophisticated film-making style, when Alfred parts from his wife, as he drives away her face remains framed, like a cameo, in the oval window at the back of the car. Battling Butler was one of Keaton's most successful movies when it was released. Like Seven Chances and College, it lacks the otherworldly originality of his best work, but I've always liked it better than the other two and considered it a handsome, mature and underrated work. Lacking any large-scale set-pieces, this film rests almost entirely on Buster's performance. \"Do you think you could learn to love me?\" he asks Sally O'Neil. She replies, as I would: \"I have.\"",
         "Neither the prospect of eighty minutes of biting headwind nor snow showers has been able to keep me from the National Film Theatre over the three weeks so far of its Buster Keaton season, and every time the films have yet to disappoint: \"Battling Butler\" is no exception! I'd instantly give this a 9 if only I could justify it relative to the early scenes; despite the pitch of enthusiasm I'd reached by the end of the film, I'm still not quite sure in all fairness that I can. It definitely takes a while to get up to speed (at the start, I took the father to be a doctor giving his sickly son only three months to live!) and for the initial reel or so it depends largely on a single extended gag -- the elegant fop's complete unsuitability for an outdoor environment. Alfred's elaborate al-fresco living arrangements echo Keaton's trademark fascination with complicated contrivances, and there's one very typical bit of misdirection where we wait for the shotgun's recoil to knock Alfred backwards into the water, only for a somewhat different turn of events to prove his downfall; but this film doesn't come properly to life until its hero engages our sympathy as well as being a walking joke. In \"The General\", we engage with Johnnie Gray almost immediately -- in \"Battling Butler\", Alfred remained a cipher for me until the moment when he nervously rehearses \"Beatrice Faircatch\"'s newspaper advice on making a proposal, with such an earnest air: it's funny, but it's also touching, and it's no coincidence that it is with his subsequent first steps towards standing on his own two feet -- tearing up and throwing aside the useless newspaper column -- that Alfred Butler may finally be said to have progressed beyond a simple one-dimensional character, and the film can really begin. From here on the picture becomes a Keaton classic, sweeping the hapless hero further and further from the cushioned normality of his life with a series of escalating and plausible coincidences. Ultimately the worm will turn, of course -- but not in the time and manner that we are expecting. And Keaton acts here not just with that famous face but with every line of his whole body: triumph, exhaustion, despair, apprehension, indignation, timidity, pugnacity... and finally, in the last scene, sublime confidence in his own skin, modelling a costume so incongruous that only Buster Keaton could carry it off with such genuine elegance! The scenes of Alfred's ordeal are hilarious and moving by degrees -- it's almost impossible to analyse Keaton's appeal. 'Sweet' is quite definitely the wrong word, as is 'lovable': Buster is no Little Tramp. 'Bittersweet' might be closer to the mark... or 'poignant'; the metaphor of the man who gets knocked down but keeps on trying has never been more apt. There is a brief vivid moment when Alfred, bewildered and worn out, turns his face aside into the arms of his second with such a hopeless little air that instead of a laugh, it raised a murmur of pity from the auditorium. But Keaton never allows himself to milk the audience for sympathy -- the best of his films may mingle laughter through tears, but he never falls into the trap of sentimentality. I'm not sure if this is among the best of Keaton's films... but it's certainly one of those I've ultimately enjoyed the most so far. I've changed my mind: I'll give it a 9 after all, and say I'm dropping a mark down instead from a 10! :-)",
         "First of all, I don't quite understand why all these people have been saying this is a \"lesser\" film by Keaton! I think it's a fast energetic and hilarious film, that shows Keaton to be in fine form! Now, when I called this film my favorite by Keaton some might agrue, that's not the \"correct\" choice. One MUST say they love \"The General\" or \"Sherlock Jr.\" While I do think both films are great and funny. But there's something about this one that I enjoy just a bit more. I like the film's spirit. As everyone mentions there are several funny moments in this film. If your a Keaton fan, you should definitely see this one. If you've never seen a Keaton film, I personally think this is a wonderful place to start. **** out of ****",
         "While it's a cut below Keaton's best features, \"Battling Butler\" has some good comic material and an amusing, if lightweight, story. There are some good performances from the supporting cast, a wide enough assortment of gags, and the story-line also gives Buster a chance to demonstrate a few of his many acrobatic talents. The first few minutes contain lots of good visual gags as we are introduced to Keaton's hapless character. Then, when his identity gets tangled up with that of a prize-fighter, \"Battling Butler\", from there on in Buster finds himself in some increasingly complicated and tricky situations. As his character's physical ineptness is emphasized, Keaton's own agility and versatility are displayed in various antics. (The same is true to some degree of his character in \"College\".) Most of the specific stunts, though, are relatively routine compared to those in his best work. In lesser hands, the fragile premise would run out of steam quickly, but here things keep moving along steadily, and there are some very good moments. It doesn't ever really hit high gear, though, and it's missing the kind of top-notch climactic sequence that distinguishes Keaton's best films. Thus it will probably be of interest primarily to those who are already fans of Keaton, but most such fans should find it worth a look. While there's nothing spectacular, there is more than enough good material to make it worthwhile as light entertainment.",
         "The entire set up sequence which runs for a third of the film has more gags and is more fun than the latter two thirds set at the training camp. The sheer lunacy of \"roughing it\" with all the comforts of home, including one's own butler, is inspired. This sequence in the wilds contains all of the best gags: wildfowl all around but unobserved by our hero; the duck who keeps ducking under the boat when Buster is trying to get organized to shoot it; the dinner table slowly sinking in the mud; the heroine walking a lost Buster back to his camp after he has gallantly walked her home. In contrast the rest of the film has only the eight mile run dupe and Buster combating with the fighting ring ropes to make us chuckle. That's a lot of film time with nothing amusing happening. Buster seems to have become uninspired once the pathos of the mistaken identity narrative take over. Still it's worth seeing the film for the first sequence. KINO's print is crisp and clear and the music accompanying their print is made up of player organ, drums, violin and triangle.",
         "One of the best paced of all Keaton films, `Battling Butler' is not uproariously funny but is consistently amusing and entertaining. Being mistaken for an up-and-coming boxer, Alfred Butler (Keaton) falls in love and marries on the basis of this mistaken identity. Trying to keep his wife from finding out creates the needed comic situation to allow the humor to emerge. His leading lady, Sally O'Neil, sparkles in her supporting role. Snitz Edwards, humorous in his own right, is a delight as Keaton's valet. The final scene is a gem!",
         "This is a very good Buster Keaton film. However, some might be put off by the scarcity of pratfalls and belly laughs compared to many of his other efforts. That's because this film is much more plot driven and character driven than most silent comedies--and that works well for me, though you might miss the more acrobatic and violent character he plays in his shorts and in some of his full-length ones. Buster plays a spoiled rich young man who really needs to be toughened up--so his dad tells him to go camping. The next segment is probably the funniest, as it cuts to a \"wilderness\" scene--complete with a butler, tub, poster bed, and all the other modern conveniences (that's the way I'd like to camp!). While \"camping\" he meets a nice girl and he is smitten. Instead of Buster going to propose, he sends his butler--who immediately knows her dad will say \"no\" because he wants a virile, more \"studly\" son-in-law. So, the butler panics and says that Buster is the famous boxer Alfred \"Battling\" Butler! Now, the two men do have the same name and are roughly the same size--but that's about the only similarity. Daddy gives his hearty approval and Buster is married. But, when the real Butler wins the title, Buster has a hard time pretending any longer. Later, the real Butler retires and Buster takes his place--going to training camp and working for a title defense! You'll have to tune in to see what happens next, as this only takes you through about half the film--watch it and enjoy.",
         "Sybil Seely, Marceline Day, Brown Eyes: All of Buster Keaton's best on-screen partners were female. All but one. Snitz Edwards here plays Buster's faithful valet, a gnomish, gentle character whose eagerness to arrange whatever his master wants lands him in trouble. Buster is Alfred Butler, rich and so passive he lets Snitz tap the ash off his cigarette. While on a camping trip, he meets a girl (Sally O'Neil) who strikes his fancy. Her father and brother disapprove of her going off with a \"jellyfish.\" Snitz to the rescue: He tells them this is the same \"Battling Butler\" who just won the lightweight boxing crown. Alas, the ruse works too well. You can argue that Snitz plays the title character here as much as Buster or Francis McDonald, who plays the boxer Butler. Whether laying out a ridiculously ornate table at Buster's camp site or laboring to keep up with his boss during an arduous run through the mud, there's no give-up in the guy. \"I'd like to marry that pretty little mountain girl\" Buster says. \"Shall I arrange it?\" Snitz answers. Buster nods, setting the plot in motion. Like a lot of silent comedies, this is a film of pieces. The first half, of Buster and Snitz roughing it in the outdoors, could be a clever short all by itself. Buster's idea of duck-hunting is to row up to one wading in the water, and then lean out of the boat to point a shotgun at it at point-blank range. You expect him to fire and roll off from the gun's kickback, so naturally that's the one thing that doesn't happen. The transition to the boxing comedy is well done, helped along by Snitz, McDonald, and O'Neil, really a cutie with her Zooey Deschanel eyes. It's O'Neil's desperate desire to see her man in the ring duking it out that forces Buster and Snitz to scramble in the last half-hour or so, coming up with all sorts of ruses. The comedy wears a bit thin at times with some protracted workout scenes in the boxing ring, yet Buster goes a long way to selling them with his amazingly elastic physicality. Buster doesn't wear a porkpie in this film, and his pampered lifestyle distances you a bit more than his inexpressiveness usually did, but he has that dogged quality of classic Keaton heroes. He may not be the champion boxer his girl thinks he is, but he'll not give her up without a fight. \"I'm going back and tell her the truth,\" he tells Snitz. \"I'd rather lose her that way.\" It's funny how \"Battling Butler\" doesn't really engage a lot of Keaton fans. Perhaps there's some resentment there because it was a hit for Buster right before \"The General\" flopped. Taken on its own merits, \"Battling Butler\" is a clever and engaging comedy with a likeably different lead role for Buster and a surprising double-twist ending, in which Buster (and the audience) have the wool lifted from their eyes one minute, only for Buster to do the same with us the next. Maybe \"Battling Butler\" isn't as inventive as Keaton fans are used to, but it has its share of arresting visuals and a solid mix of varied comedic moments that still connect. Plus it works as a story all the way through. Finally there's the winning chemistry of Buster and Snitz, The Great Stoneface and The Great Cragface.",
         "Although robbed of its delightful songs by Douglas Furber (lyrics) and Philip Brabham (music), \"Battling Butler\" more than makes up for this unavoidable lapse by casting one of our favorite character players, Snitz Edwards, in a major role. He is wonderful; and it's to Keaton's credit, both as a fellow comic and as the director, that he allows Snitz to steal many of his scenes. In fact, Keaton and Edwards make a great comedy team. Except for one or two sequences, they don't play against each other, they play with each other\u0097a feat that is more difficult to bring off successfully. Following the construction of the stage musical, the film splits neatly into two halves. Tom Wilson's harassed trainer, who expertly pits himself against the seemingly hopeless Keaton, supplies much of the comedy in the second half until the star unexpectedly turns the tables in a grand climax especially written for the film. In the play, the McDonald character simply drops out and doesn't return at all. It could be said that the stage musical actually ends on rather a limp note plot-wise, but this problem has now been neatly licked. Doubtless due to the fact that comic fight scenes have been done to death by just about every comedian you could name in sound films, \"Battling Butler\" is not wholly prized among Keaton addicts, but I regard it as one of his best outings.",
         "A nice little comedy about a wealthy young man with nothing to do. He finds himself taking a trip into the mountain country to put some adventure into his life. It is here where he meets a young Mountain girl played by actress Sally O'Neil. Soon, Keaton and O'Neil fall in love and want to marry. The problem is O'Neil's father and brother are giant of men and won't allow her to marry such a small man. It is Keaton's butler / servant who gets the idea to lie to her parents by telling them that Keaton is a professional boxer (who happens to have the same name as Keaton's character (Butler). One lie leads to another as Keaton as to pretend he is a boxer. A nice story with some moments of comedy, Battling Butler is a Keaton comedy with very little stunt work from Buster Keaton. Besides the moments spent in the ring, Keaton hardly does any stunts. Most of the comedy comes from Keaton's silent comedy as oppose to his physical (stunt) comedy."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Buster Keaton Productions"],
      "summaries": [
         "Alfred's father wants him to make of a man of himself so sends him off on a hunting and fishing trip. He doesn't catch or shoot anything, but he does fall in love with a mountain girl. When her father and brothers laugh at this they are informed that he is Alfred \"Battling\" Butler, the championship fighter. From there on the masquerade must be maintained.",
         "A love-struck weakling must pretend to be boxer in order to gain respect from the family of the girl he loves."
      ],
      "budget": 0
   },
   "movielensId": 3012,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1926-09-19",
      "dvdReleaseDate": "1999-10-26",
      "directors": ["Buster Keaton"],
      "runtime": 77,
      "movieId": 3012,
      "title": "Battling Butler",
      "mpaa": "",
      "actors": [
         "Buster Keaton",
         "Sally O'Neil",
         "Walter James",
         "Budd Fine",
         "Francis McDonald",
         "Mary O'Brien",
         "Tom Wilson",
         "Eddie Borden",
         "Snitz Edwards"
      ],
      "imdbMovieId": "0016630",
      "originalTitle": "Battling Butler",
      "genres": [
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Alfred's father feels his son has grown up too comfortably and as a result has not become what a man should be. To remedy this predicament he sends his son Alfred off on a hunting trip. On the trip, in the midst of many follies brought on by his inexperience with the outdoors, he meets a young mountain girl and falls in love with her. Alfred's butler, who has accompanied him on the outing, is sent to arrange the marriage with the girl's father, who thinks Alfred is too weak to become a member of the family. In an attempt to change the father's mind, the butler tells the girl's father and brother that Alfred is actually Alfred \"Battling\" Butler, a professional boxer. The deception works and a wedding is arranged. Comic mischief ensues as Alfred and his butler attempt to make their newly fabricated story seem plausible to the family of his new bride.",
      "tmdbMovieId": 51371,
      "avgRating": 3.53061,
      "releaseYear": "1926",
      "numRatings": 98,
      "posterPath": "/7MVdo4OyzIcwycN58J9n855ggoS.jpg"
   }
}