{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "bus",
            "id": 992
         },
         {
            "name": "road trip",
            "id": 7312
         },
         {
            "name": "teacher",
            "id": 10508
         },
         {
            "name": "school",
            "id": 10873
         },
         {
            "name": "farm life",
            "id": 11332
         }
      ],
      "imdb_id": "tt0082121",
      "video": false,
      "title": "Bustin' Loose",
      "recommendations": [
         27858,
         38925,
         43812,
         67772,
         22994,
         40480,
         27464,
         23148,
         43269,
         42243,
         29737,
         45840,
         15360,
         19507,
         16471,
         34014,
         42597,
         22711,
         18513,
         16972
      ],
      "backdrop_path": "/ul95AJoGQaE5y9czQEYn8z39DW.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Joe Braxton",
               "gender": 2,
               "credit_id": "52fe44779251416c91011b7d",
               "name": "Richard Pryor",
               "profile_path": "/hzJ3Q7wDLv4m82eMTbK2tzVzCHG.jpg",
               "id": 9309,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Vivian Perry",
               "gender": 1,
               "credit_id": "52fe44779251416c91011b81",
               "name": "Cicely Tyson",
               "profile_path": "/j7j7Qc1qi3W6JOqmPVWqqs5awjt.jpg",
               "id": 18249,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Julio",
               "gender": 0,
               "credit_id": "52fe44779251416c91011b85",
               "name": "Ángel Ramírez",
               "profile_path": null,
               "id": 107970,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Harold",
               "gender": 2,
               "credit_id": "52fe44779251416c91011b89",
               "name": "Jimmy Hughes",
               "profile_path": null,
               "id": 107971,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Ernesto",
               "gender": 2,
               "credit_id": "52fe44779251416c91011b8d",
               "name": "Edwin DeLeon",
               "profile_path": null,
               "id": 107972,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Anthony",
               "gender": 2,
               "credit_id": "52fe44779251416c91011b91",
               "name": "Edwin Kinter",
               "profile_path": null,
               "id": 107973,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Linda",
               "gender": 0,
               "credit_id": "52fe44779251416c91011b95",
               "name": "Tami Luchow",
               "profile_path": null,
               "id": 107974,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Annie",
               "gender": 1,
               "credit_id": "52fe44779251416c91011b99",
               "name": "Janet Wong",
               "profile_path": null,
               "id": 107975,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Martin",
               "gender": 2,
               "credit_id": "52fe44779251416c91011b9d",
               "name": "Alphonso Alexander",
               "profile_path": null,
               "id": 107976,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Samantha",
               "gender": 1,
               "credit_id": "52fe44779251416c91011ba1",
               "name": "Kia Cooper",
               "profile_path": null,
               "id": 107977,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Donald",
               "gender": 2,
               "credit_id": "52fe44779251416c91011ba5",
               "name": "Robert Christian",
               "profile_path": null,
               "id": 107978,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Doctor Wilson T. Renfrew",
               "gender": 2,
               "credit_id": "52fe44779251416c91011ba9",
               "name": "George Coe",
               "profile_path": "/2ygklxHSWcNuWg4hjZe5J9MlzNR.jpg",
               "id": 14102,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Judge Antonio Runzuli",
               "gender": 2,
               "credit_id": "52fe44779251416c91011bad",
               "name": "Bill Quinn",
               "profile_path": null,
               "id": 107980,
               "order": 12
            },
            {
               "cast_id": 14,
               "character": "Klan Leader",
               "gender": 2,
               "credit_id": "52fe44779251416c91011bb1",
               "name": "Roy Jenson",
               "profile_path": "/swkMoVqkIw3CKTKkIzR2yHEfyF3.jpg",
               "id": 12298,
               "order": 13
            },
            {
               "cast_id": 15,
               "character": "Alfred Schuyler",
               "gender": 2,
               "credit_id": "52fe44779251416c91011bb5",
               "name": "Fred Carney",
               "profile_path": null,
               "id": 107981,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44779251416c91011bbb",
               "name": "Oz Scott",
               "profile_path": "/q9my0SV04JuabbUPcIJ03cIiVZk.jpg",
               "id": 109095,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44779251416c91011bc1",
               "name": "Lonne Elder III",
               "profile_path": null,
               "id": 1271429,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 2,
               "credit_id": "52fe44779251416c91011bc7",
               "name": "Richard Pryor",
               "profile_path": "/hzJ3Q7wDLv4m82eMTbK2tzVzCHG.jpg",
               "id": 9309,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe44779251416c91011bcd",
               "name": "Roger L. Simon",
               "profile_path": null,
               "id": 932923,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 2.873819,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 31361,
      "vote_count": 18,
      "budget": 0,
      "overview": "After ex-con Joe Braxton violates his probation he is given a second chance, all he has to do is drive a group of special kids across the country. What could possibly go wrong?",
      "similar": [
         52449,
         8457,
         37735,
         8363,
         437670,
         233063,
         20178,
         13523,
         9276,
         77949,
         1807,
         59861,
         9377,
         118,
         810,
         1584,
         2108,
         20453,
         34584,
         50456
      ],
      "original_title": "Bustin' Loose",
      "runtime": 94,
      "poster_path": "/2i36PR2gazJXhs03SlsD9NpRMZG.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
            "name": "Universal Pictures",
            "id": 33,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Richard Pryor Productions",
            "id": 18205,
            "origin_country": ""
         }
      ],
      "release_date": "1981-05-22",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "He's mad, he's bad, and he's Bustin' Loose!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Oz Scott",
         "Michael Schultz"
      ],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "Lonne Elder III",
         "Richard Pryor"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0082121/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc1ODYyMzQ5Ml5BMl5BanBnXkFtZTcwNDg3NTcyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Richard Pryor, Cicely Tyson, Ángel Ramírez | See full cast and crew »"],
      "reviews": [
         "Over the years when nothing else is on I watch Bustin' Loose from time to time, it is such a good feel good movie. Neat story which has Richard Pryor as con man Joe Braxton who is maneuvered into taking a group of disturbed kids from Philadelphia, Pennsylvania along with their teacher Cicely Tyson to a farm in Washington state owned by the aunt and uncle of Cicely Tyson. This movie is a great journey of respect and friendship it shows just how that no matter how different people are they can become friends and learn to care and respect one another. This is not typical Richard Pryor you don't find much strong language but Pryor is plenty enough his comical and funny self to make this film a winner. So if you haven't seen this give it a watch it shows from time to time on cable. Probably one of the better movies of Richard Pryor.",
         "This is a really nice film. I bought it on DVD and saw it last night. I had seen it various times through the years. Last night was the first time I had seen it in along time. Without Richard Pryor it could have been an after school special. I have always liked Richard Pryor in his films, he always played a normal human being, he never got into the supercop comedies like Eddie Murphy did. Pryor showed in this film that he could be tender as well as funny. It is a little gem of movie, very lite, but very funny and heartwarming. Grade: B",
         "Richard Pryor portrays con men so often yet he always manages to make it funny. The plot this time around involves con man Pryor being on the run and taking the time to escort a group of kids and their keeper (Cicely Tyson) cross country by means of a bus that he has to drive. The comic hilarity that can be exepcted from Pryor is evident here.",
         "This is one of those movies that, unless you have too many expectations, turn out to be quite entertaining. It stars Richard Pryor as an ex-con who agrees to transport a teacher (Cicely Tyson) and eight misfit children from Philadelphia to Washington, as part of his probation. Richard Pryor is known for his abilities in physical comedy. Surprisingly enough, the best part of the film are the more emotional scenes, where he gets to interact with the children. However, there are some other scenes, clearly going for the big laughs, that are not as successful, like the one with the KKK or the ones in the bank near the end of the film, and they threaten to spoil the fun. \"Bustin' loose\" is a good comedy, although it would have been even better if the script had relied more on Pryor's relationship with the children than on the physical comedy parts. It is definitely not a masterpiece, but if you need an evening of relaxation in front of the TV, then this film is for you. Rating: 7/10, or B1",
         "In reviewing African-Americans in film in chronological order for Black History Month, we're now at 1981 with Bustin' Loose. In this one, Richard Pryor is a small-time crook who gets a chance at redemption when his parole officer asks him to drive a bus of troubled children and his fiancée (Cicely Tyson) across country from Philadelphia to Seattle on the way to Tyson's family farm. That obviously doesn't sound like a hilarious comedy and there are indeed some scenes Pryor has with some of the kids that expresses more of his dramatic abilities, as heartfelt as some of those scenes may be. There's still some of his unique comic talents here that may make you glad you gave this one a shot like his attempted con of several TV sets in a bogus delivery truck or his fooling the Ku Klux Klan into pushing the bus out of a mud-hole because they think all the kids in it are blind! Then there's his cowboy disguise with fake accent near the end that made me laugh pretty hard. Ms. Tyson, normally a dramatic actress, has a few humorous moments of her own that puts her in a new light. Threatens to lose steam after a while but all in all, Bustin' Loose is nothing Mr. Pryor had to be ashamed about especially since he thought up the story and was co-producer. P.S. It was here that he set himself on fire when he freebased on cocaine.",
         "This movie may appear to be a family movie, but yet Richard Pryor's Braxton character is clearly not a family man. He swears and yells at children, slaps them, teaches them strip poker and is constantly smoking stogies. I found myself really enjoying this movie though. There are quite a few laugh out loud moments. I especially liked when the Miss Perry character told Braxton to be careful with his cigar because he might set himself on fire! The movie even features comedian Paul Mooney in a small cameo at the beginning.",
         "I guess that \"Bustin' Loose\" is most famous because it was during the production of this movie that Richard Pryor had his near-death experience with freebasing. But there's more to the movie than that. Pryor plays an ex-con who gets a second chance by getting assigned to drive a bus load of special needs children from Philadelphia to Washington state. Much of the humor derives from Richard Pryor's and Cicely Tyson's personalities bouncing off of each other: he's the irresponsible goof-off, she's the stern teacher. There's also a look at the children's stories: there's a blind boy, a pyromaniac, and a former child prostitute from Vietnam. And then of course, there's the scene with the Ku Klux Klan; I bet that Richard Pryor had wanted to do something like that for years! So, it's a pretty silly movie, but still very enjoyable. It's too bad that Richard Pryor is no longer with us.",
         "Bustin' Loose (1981) *** (out of 4) Richard Pryor plays a con man who is blackmailed by his probation officer into taking eight troubled kids on a bus trip from Philadelphia to Seattle. Having been made in a politically incorrect time and featuring Pryor with troubled kids means you're going to have a great load of laughs but the film also has a heart of gold but more on this in a bit. As for pure laughs this is probably the best film I've seen from Pryor, although Moving is still my favorite movie of his due to it just being a personal favorite. This movie here features non-stop laughs from start to finish and it really gives Pryor a chance to act and he proves to be very reliable here. Pryor does a great job with the comedy and really delivers the jokes but what's most refreshing is seeing how well he does with the more dramatic moments. The film has a heart of gold but I think there are a few too many tender scenes meant to make the viewer get tears in their eyes. A lot of these dramatic scenes are pretty heartfelt but I think there are just too many of them. Pryor handles all of this very well though. Cicely Tyson plays the woman trying to save the kids and she's does a good job, although the romantic subplot with Pryor is pretty weak. There are numerous great scenes in the film including a great sequence where Pryor runs into the KKK but the highlight of the movie is certainly the scene where Pryor is driving the bus and three of the kids, acting like thugs, come up and start messing with him.",
         "\"Bustin' Loose\" is a surprisingly delightful, even occasionally moving film. An ex-con (Richard Pryor) helps a teacher (Cicely Tyson) move a group of 'special' children three thousand miles across the U.S. from Philadelphia to Washington State. After a slow, and somewhat not so promising start, the movie picks up as the journey across country begins. \"Bustin' Loose\" has its comic moments and remains quite simple throughout, with a warm and touching finale that makes it all worthwhile. Credit this to astute director Oz Scott, and the inspired teaming of comic genius Richard Pryor and co-star Cicely Tyson. Monday, July 1, 1991 - Video",
         "Let's face it, Cicely Tyson and Richard Pryor play an unlikely pair. Cicely plays a good-hearted social worker who is determined to transport a school bus-load of abandoned orphans across the country to a farm with animals. She gets Richard Pryor's character who plays an ex-con who redeems himself in this film. Of course, Tyson and Pryor are quite simply marvelous in roles that would have otherwise failed. I know if I wanted somebody that would be Cicely who plays Vivian Perry whose heart and mind are always in the right place. While Pryor's character feels like a failure, she and the kids inspire him as well he inspires them. It's not a wholesome after-school special but it's touching at moments to see the outcasts look and treat upon each other as friends and family because they could have treated this film like silly film but it's a serious film about serious problems and they do it admirably."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Richard Pryor Productions",
         "Universal Pictures"
      ],
      "summaries": ["Joe Braxton is an ex-con who has been given a second chance to freedom after violating his probation. He has been hired by a school teacher named Vivian Perry to repair and drive an old school bus and drive a group of Special kids to Ms. Perry's Washington Farm from Philadelphia, Pennsylvania to give them a new home after The Clarmont Center for Children is shut down by the city. The kids have severe mental problems and Joe is not looking forward to the trip at all, but Joe later bonds with Vivian and the children, offering his support and love and changes his outlook on life. But Donald, the social worker and Vivian's lover who gave Joe his break is hot on their tail and wants Joe back in prison. Joe and Vivian must now prevent Donald from sending the children back to Philidelphia where they'll have no future."],
      "budget": 0
   },
   "movielensId": 3014,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "1981-05-22",
      "dvdReleaseDate": "1999-10-26",
      "directors": ["Oz Scott"],
      "runtime": 94,
      "movieId": 3014,
      "title": "Bustin' Loose",
      "mpaa": "R",
      "actors": [
         "Richard Pryor",
         "Cicely Tyson",
         "Ángel Ramírez",
         "Jimmy Hughes",
         "Edwin DeLeon",
         "Edwin Kinter",
         "Tami Luchow",
         "Janet Wong",
         "Alphonso Alexander",
         "Kia Cooper",
         "Robert Christian",
         "George Coe",
         "Bill Quinn",
         "Roy Jenson",
         "Fred Carney"
      ],
      "imdbMovieId": "0082121",
      "originalTitle": "Bustin' Loose",
      "genres": [
         "Adventure",
         "Comedy"
      ],
      "youtubeTrailerIds": ["D9hr4RGGj8Y"],
      "plotSummary": "After ex-con Joe Braxton violates his probation he is given a second chance, all he has to do is drive a group of special kids across the country. What could possibly go wrong?",
      "tmdbMovieId": 31361,
      "avgRating": 2.81923,
      "releaseYear": "1981",
      "numRatings": 260,
      "posterPath": "/2i36PR2gazJXhs03SlsD9NpRMZG.jpg"
   }
}