{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "coma",
            "id": 732
         },
         {
            "name": "boston",
            "id": 1680
         },
         {
            "name": "black market",
            "id": 2449
         },
         {
            "name": "suspense",
            "id": 9937
         }
      ],
      "imdb_id": "tt0077355",
      "video": false,
      "title": "Coma",
      "recommendations": [
         988,
         18196,
         11935,
         10765,
         13550,
         11850,
         12502,
         2990,
         10540,
         26578,
         11495,
         10514,
         9491,
         9542,
         11060,
         22828,
         20287,
         2107,
         11558,
         11864
      ],
      "backdrop_path": "/lqSrXYzmMEAFkintG5WfIJ57occ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Dr. Susan Wheeler",
               "gender": 0,
               "credit_id": "52fe44149251416c75028269",
               "name": "Geneviève Bujold",
               "profile_path": "/qqtni1dpO3b7nDeG9NOxKAPk7yM.jpg",
               "id": 35341,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Dr. Mark Bellows",
               "gender": 2,
               "credit_id": "52fe44149251416c7502826d",
               "name": "Michael Douglas",
               "profile_path": "/nmlitv4g2jXO3sJrnA9g980j2uc.jpg",
               "id": 3392,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Mrs. Emerson",
               "gender": 1,
               "credit_id": "52fe44149251416c75028271",
               "name": "Elizabeth Ashley",
               "profile_path": "/zN6fHWl2NHiMHY741YIxbtRRFoj.jpg",
               "id": 44845,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Dr. Harris",
               "gender": 2,
               "credit_id": "52fe44149251416c75028279",
               "name": "Richard Widmark",
               "profile_path": "/whrZ2aEg3FghVaDJf0JRrEhFLWl.jpg",
               "id": 12149,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Dr. George",
               "gender": 2,
               "credit_id": "52fe44149251416c75028275",
               "name": "Rip Torn",
               "profile_path": "/rzGaoGikjMuLDruABKdLcQLtkZk.jpg",
               "id": 9626,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Nancy Greenly",
               "gender": 1,
               "credit_id": "52fe44149251416c75028281",
               "name": "Lois Chiles",
               "profile_path": "/wJ6qXkZjqJybgVz83RluAx6Fzn7.jpg",
               "id": 10475,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Dr. Morelind",
               "gender": 2,
               "credit_id": "52fe44149251416c75028285",
               "name": "Hari Rhodes",
               "profile_path": "/j3oQPReGHOU4kS1oc0cwGGoK4pK.jpg",
               "id": 98797,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Computer Technician",
               "gender": 2,
               "credit_id": "52fe44149251416c75028289",
               "name": "Gary Barton",
               "profile_path": null,
               "id": 161821,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Kelly",
               "gender": 0,
               "credit_id": "52fe44149251416c7502828d",
               "name": "Frank Downing",
               "profile_path": null,
               "id": 160119,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Dr. Marcus",
               "gender": 2,
               "credit_id": "52fe44149251416c75028291",
               "name": "Alan Haufrect",
               "profile_path": null,
               "id": 152897,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Vince",
               "gender": 2,
               "credit_id": "52fe44149251416c75028295",
               "name": "Lance LeGault",
               "profile_path": "/dQOCLWXsB1VKFtg4TZqC9QCxpLJ.jpg",
               "id": 119776,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Chief Resident",
               "gender": 2,
               "credit_id": "52fe44149251416c75028299",
               "name": "Michael MacRae",
               "profile_path": null,
               "id": 116046,
               "order": 11
            },
            {
               "cast_id": 22,
               "character": "Nurse",
               "gender": 1,
               "credit_id": "52fe44149251416c7502829d",
               "name": "Betty McGuire",
               "profile_path": null,
               "id": 133291,
               "order": 12
            },
            {
               "cast_id": 13,
               "character": "Sean Murphy",
               "gender": 2,
               "credit_id": "52fe44149251416c7502827d",
               "name": "Tom Selleck",
               "profile_path": "/jCnmP0qYpCwWdVlZM4j9VNugmTj.jpg",
               "id": 15112,
               "order": 13
            },
            {
               "cast_id": 23,
               "character": "Diane",
               "gender": 1,
               "credit_id": "52fe44149251416c750282a1",
               "name": "Joanna Kerns",
               "profile_path": "/xscaJnPuLzBx6XkryBWrxHarDR0.jpg",
               "id": 87038,
               "order": 14
            },
            {
               "cast_id": 24,
               "character": "Pathology Resident #2",
               "gender": 2,
               "credit_id": "52fe44149251416c750282a5",
               "name": "Ed Harris",
               "profile_path": "/atzm7ZGRFSWJHQT6qKmzjmNQ9GA.jpg",
               "id": 228,
               "order": 15
            },
            {
               "cast_id": 25,
               "character": "Jim",
               "gender": 2,
               "credit_id": "52fe44149251416c750282a9",
               "name": "Richard Doyle",
               "profile_path": null,
               "id": 29443,
               "order": 16
            },
            {
               "cast_id": 26,
               "character": "Mr. Schwartz",
               "gender": 2,
               "credit_id": "52fe44149251416c750282ad",
               "name": "Benny Rubin",
               "profile_path": "/iWjnIur6En50YRvC1zkPPGoP5By.jpg",
               "id": 117029,
               "order": 17
            },
            {
               "cast_id": 27,
               "character": "Dr. Goodman",
               "gender": 2,
               "credit_id": "58d38741c3a368126f00fa5b",
               "name": "Charles Siebert",
               "profile_path": "/ytJcfd3ciuoyxOtK4uQWfGydAhV.jpg",
               "id": 104058,
               "order": 18
            },
            {
               "cast_id": 28,
               "character": "Surgical Resident",
               "gender": 2,
               "credit_id": "58d3876dc3a368124f01048d",
               "name": "Martin Speer",
               "profile_path": null,
               "id": 73781,
               "order": 19
            },
            {
               "cast_id": 29,
               "character": "Patterson Institute Chief of Security (uncredited)",
               "gender": 2,
               "credit_id": "58d3878fc3a368126700f228",
               "name": "Nicholas Worth",
               "profile_path": "/ohKOmHwBEyIrAUYSNQY2uNbSznN.jpg",
               "id": 100461,
               "order": 20
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44149251416c75028241",
               "name": "Michael Crichton",
               "profile_path": "/lAQ6LYkhdVxa2tDSCOGxQZ3t0wO.jpg",
               "id": 4782,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44149251416c75028247",
               "name": "Michael Crichton",
               "profile_path": "/lAQ6LYkhdVxa2tDSCOGxQZ3t0wO.jpg",
               "id": 4782,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44149251416c7502824d",
               "name": "Robin Cook",
               "profile_path": "/2XUzXT849U2sEboeWhZDduXHmA8.jpg",
               "id": 68651,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe44149251416c75028253",
               "name": "Martin Erlichman",
               "profile_path": null,
               "id": 15209,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44149251416c75028259",
               "name": "Jerry Goldsmith",
               "profile_path": "/e6sd10VuwFXkgRFrCTCygbhMq2q.jpg",
               "id": 1760,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44149251416c7502825f",
               "name": "Victor J. Kemper",
               "profile_path": null,
               "id": 14536,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44149251416c75028265",
               "name": "David Bretherton",
               "profile_path": null,
               "id": 3898,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 6.856278,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11223,
      "vote_count": 112,
      "budget": 0,
      "overview": "A young woman doctor discovers something sinister going on in her hospital. Relatively healthy patients are having 'complications' during simple operations and ending up in comas. The patients are then shipped off to an institute that looks after them. The young doctor suspects there is more to this than meets the eye.",
      "similar": [
         4771,
         949,
         189,
         261023,
         336843,
         11336,
         654,
         1939,
         8834,
         168098,
         10285,
         72784,
         9272,
         1923,
         2163,
         9411,
         1645,
         5236,
         1427,
         2502
      ],
      "original_title": "Coma",
      "runtime": 113,
      "poster_path": "/wXhYCwf7yhnvlJxhl8nIcSWb4Aw.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1978-01-06",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "Imagine your life hangs by a thread. Imagine your body hangs by a wire. Imagine you're not imagining.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Michael Crichton"],
      "runtime": 113,
      "synopsis": null,
      "writers": [
         "Michael Crichton",
         "Robin Cook"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0077355/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY0NjYwMzEzNl5BMl5BanBnXkFtZTcwMTk5MTYyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Michael Douglas, Rip Torn, Geneviève Bujold | See full cast and crew »"],
      "reviews": [
         "COMA: An extremely impressionistic medical thriller, which has since, set standards for many other thrillers of the type. The concept was novel, and surreal. Dr. Susan Wheeler, (Genevieve Bujold) is a successful, beautiful, and intelligent woman, at Boston Memorial Hospital. She has a love/hate relationship with fellow doctor Mark Bellows (Michael Douglas). She has no reason to suspect any sort of foul play at work, until she looses her best friend to an accident during surgery. A deep investigation leads on to the awful truth, that her friends death was no accident, and other deaths weren't either. Much more suspense and intrigue await at the Jefferson Institute, were the shocking truth is revealed. Michael Crichton is just as good a director as he is a writer. The two leads play great off each other, and Jerry Goldsmiths score will send eerie vibes through you goosebumped skin! The first, and best medical thriller, COMA has everything a proper, intellectual movie needs. Terrific introductions, affective development, twisted characters, and mystery for the bold, and brave. A classic to be known, and enjoyed over and over again.",
         "Patients check into the (fictitous) Boston Memorial Hospital for routine operations and, inexplicably, go into irreversible comas. Dr. Susan Wheeler (Genevieve Bujold) wants to know why much to the disappointment of her doctor boyfriend (Michael Douglas). When she tries to find answers, she finds herself marked for death. Michael Crichton directed from Robin Cook's great novel. There are huge gaps in logic, but the film is so exciting and entertaining those can be forgiven. It's fairly well-directed and well-done overall. There are many great sequences--Bujold being stalked by a killer in the hospital late at night; a visit to the creepy Jefferson Institute; some lovely views of Cape Cod MA; Bujold, and then Douglas, tracking a suspicious oxygen line and the \"accidental\" death of a janitor. Also there's Jerry Goldsmith's loud, pounding score moving the picture along and, best of all, this was shot on location in Boston. The acting is so-so. Douglas and Bujold are OK as the leads. Richard Widmark is having the time of his life playing a hospital administrator. Rip Torn and Elizabeth Ashley also turn in good performances. Also look for Tom Selleck, Ed Harris (with hair!) and Joanna Kerns in bit parts. A very good movie. However you do have to deal with some very dated dialogue of Bujold trying to make it in a \"man's\" world. Also be aware that this is pretty extreme for a PG rated movie--there are fairly clear shots of Bujold's body during a shower scene and plenty of nude, dead bodies in a freezer sequence and some really gruesome scenes throughout the hospital. This film has disappeared for some reason. It caused a lot of excitement around here when it was filmed in 1977 and was a big hit in 1978. Then it just disappeared. That's surprising considering how the careers of Cook, Crichton and Douglas have taken off. It deserves rediscovery.",
         "Not for those who fear the medical profession, this creepy thriller takes it's time getting started, but then kicks into high gear. It creates a mood and builds suspense to an almost unbearable degree. Elfin Bujold (sporting a truly unappealing hairstyle) is Dr. Susan Wheeler, a principled, dedicated intern at a major hospital. She begins to notice a disturbing trend...that folks with purportedly minor surgeries are not coming out of their operations conscious. From this point on, it is virtually Bujold against the world as a gallery of sexist, condescending doctors (including her own lover Douglas) tries to poo-poo her findings or encourage her to lay off. Naturally, she can't leave well enough alone and is soon up to her ears in intrigue and violence. The film has a blatantly frank point of view. People eat sandwiches while they are examining cadavers. Brains are sliced like deli meat. It's all very clinical and unsettling to non-medical viewers. There are several highly-charged moments including a duct hole exploration and a chase through a seemingly abandoned hospital. Jerry Goldsmith's clanking score doesn't take center stage until late in the film, but is wonderfully nerve-wracking when it needs to be. Bujold and the Chief of Staff Widmark make wonderful counterparts as they come from different generations and different eras of medicine. Best of all is the brief, but unforgettable, appearance of Ashley as the world's most intimidating nurse. In her opening scene she blinks exactly once! Her voice is a monotone terror and her stare is up there with Medusa's. The section that contains her is surreal, but arresting and very campy! Adding to the fun is a series of small appearances by people like Torn, Chiles, Selleck and Harris. This is a frightening film with some memorable imagery and a startling amount of skin for a PG film.",
         "In COMA, petite heroine Genevieve Bujold shows you don't have to be an amazon like Sigourney Weaver or Lucy Lawless to get physical with the bad guys. Set against a hospital backdrop ranking in verisimilitude with that of THE HOSPITAL (the only other accurate medical drama of the 1970's), this is a gripping thriller even on repeat viewing over twenty years later. Bujold's acting has been mentioned by other reviewers, but I would award special accolades to Richard Widmark, whose character's unctuous avuncularity is executed with superb subtlety. Plus, he even comports himself just like a real physician of seniority. I do have a few complaints, not least of which is the gratuitous and grossly inaccurate portrayal of clinical lab personnel and the laboratory environment. Shame on Crichton, who must have missed out on visiting the lab through his entire tenure as a medical student. The laserdisc transfer is technically one of the worst I have in my collection. The monaural soundtrack is overdriven and distorted; the colors are washed out; and careless unmasking of the print (COMA is not letterboxed) results in visible boom mikes in several shots. Still, this is a classic film, and anyone who wants to get up to speed on medical movies wouldn't want to exclude COMA.",
         "Man, I had no idea what a good time I was in for with this one. Chrichton, a young Douglas, Tom Selleck in a minor (but important!) role, and I believe that's a very young Ed Harris playing a morgue attendant/medical examiner. His line about his wife is one of the funniest in the film. But seriously, this is very good and very overlooked. Tight construction, buildup, excellent characterization, swift and unpredicatble plot turns and visually striking scenes. I don't know how they created the \"Institute's\" main \"storage facility\". If you think about the actors involved in that one, you have to be impressed. And as another comment points out, the chase scene that ends in the freezer room is excellent; creepy and visceral. The killer , who is really just a hit man for whoever is behind 'the conspiracy' is suitably athletic, anonymous, and menacing. His sole line : \"They told me to make it look like an accident\" is extremely scary and effective - when coupled with his actions during the maintenance man scene. Good writing, Michael. Ane the suspense during the finale, well they just don't make'em like this anymore. Very enjoyable.",
         "I just revisited this movie after 25 years and was surprised how well it held up, even given the rather absurd plot and advances in medical technology in the interim. Genevieve Bujold has forever been underused and underrated, and she is simply superb here. And while I wouldn't tarnish Hitchock's reputation by comparing Coma too closely to any of his work, Crichton does a good job of maintaining suspense. I love the scene where Richard Widmark explains the crazy rationale behind it all, and we see it through Bujold's drug-addled eyes, which somehow makes it more palatable than if we were watching it straight. And I love all the cameos -- Lois Chiles! Tom Selleck! Ed Harris! Many other recognizable faces. Elizabeth Ashley is so over-the-top she's camp. All in all, a fun movie.",
         "I decided to pick up this film originally because it was an early Michael Douglas movie, and Michael Crighton wrote and directed this screenplay. By the cover it had all the elements for a great movie, and the movie brought no disappointment. It was absolutely intriguing and brilliantly filmed. The background of the cold sterile hospital was haunting and perfect. Each actor whether big or small brought a twist to the story. The main character who played Dr. Susan Wheeler was perfect as the stern, and cold Doctor who's best friend goes in for a routine operation and then is rendered into a mysterious brain dead Coma. Dr. Wheeler begins to notice strange \"coincidences\" around the hospital and starts to investigate other \"Coma\" cases. What she unravels is a top secret plot that goes right to the very top. The story unravels perfectly and the tension and clues are superb. You can't get a much better 2 hour movie. It's definately a movie that you might be tempted to pass by but it's worth renting. Michael Douglas is even great, although only in it as a supporting character, as Dr. Wheeler's Doctor boyfriend who she tries to convince something terrible is going on within the hospital. You never know who might be involved in this plot and you're waiting for it all to unravel. The only negative aspect of this movie was the ending happens very very quickly, kind of leaves you feeling a little hurried but still an first class movie. Also look for Tom Selleck portraying a patient/dead body. You can't go wrong with this movie. 8/10",
         "Coma was a really fun film. I liked it to pieces. It opens with a really intriguing shot of a gorgeous Genevieve Bujold driving to her work as a Dr. Wheeler, and listening to the radio on a beautiful crisp Boston morning. A film like this has the audience attention from that grab. Exposition ensues and so does a bit of crazy character development. Then, something else happens, ,a major death takes place and a real intrigue seeks in. Then, the revelation is that a crisis is concerning certain patients. Not for those who are queasy in hospitals. This film, about patients slipping one by one into a coma for no apparent reason still has enough affect to chill every one of it's audience members to the bone! All the stars are at their best with a script that-while has some of its unoticable flaws- keeps the audience in the roots of fear as they root for the lead female. Great Jerry Goldsmith score as well. Great photography and direction from Crighton. a cool film!",
         "A forgotten classic from the late 70s? Yes, I just discovered the picture and enjoyed my 2 hours in company of Geneviève Bujold. The film is set in a Hospital which feels and looks just like the real one, what verisimilitude! There's something strange going on, but is she just imagining it or is there a real conspiracy? There are some stunning examples of locations, the Jefferson institute is amazing, I felt so freaked out by it. Geneviève Bujold gives an excellent performance, really liked her, she had a lot of warmth, really felt for her and she kept her feminity throughout. Michael Douglas is good, but not great. I think the director could've added much more to his character. The direction is pretty suspenseful, very slick and framed very well. The screenplay isn't bad at all, any problems should've been rectified on set. The film was framed at 1.66:1 A nice suspenseful picture, deserves more recognition.",
         "In Coma young idealistic doctor Genevieve Bujold comes upon a practice that she finds too horrifying to contemplate. Patients are deliberately put into comas and then sent to an institute where they are kept mechanically alive so their body parts can be sold to the highest bidder. She tries to tell her boyfriend fellow physician Michael Douglas about what's happening, but he's not buying it. He's very much attuned to hospital politics and there's as much of that in the medical field as any other. Michael Crichton's novel is turned into one creepy movie that gets creepier by the minute as Bujold uncovers more and more of the story. In her performance Bujold manages to hit the notes of idealism, vulnerability, and toughness at the same time, not easy to do. Bujold for instance, scared as she is, proves quite the match for Lance LeGault who's trying to kill her. Some others in the cast are Richard Widmark, head of the hospital medical staff where she works in Boston, Rip Torn the very well connected head of anesthesiology which seems to be where the problem lies and Lois Chiles whose case sparks Bujold's interest. Making early film bit appearances are Ed Harris and Tom Selleck. But the performance that will totally creep you out is Elizabeth Ashley, head of the institute where all the coma patients are warehoused. She makes Nurse Ratched from One Flew Over the Cuckoo's Nest like Mary Poppins. Coma is a fine thriller of a film and those last few minutes with Bujold quite vulnerable will have you on the edge of your seat."
      ],
      "genres": [
         "Drama",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": [
         "A young woman doctor discovers something sinister going on in her hospital. Relatively healthy patients are having 'complications' during simple operations and ending up in comas. The patients are then shipped off to an institute that looks after them. The young doctor suspects there is more to this than meets the eye.",
         "Dr Susan Wheeler is devastated when her best friend is pronounced brain dead after minor surgery at her hospital. Looking at the records, Susan finds that over the previous year a number of other fit young people have ended up the same way. She comes across two similarities to the cases - they all took place in the same operating theatre, and all the comatose bodies were moved to somewhere called the Jefferson Institute. She continues to investigate increasingly alone, starting to wonder if she can trust even her own boyfriend.",
         "Dr. Susan Wheeler smells trouble when a patient of hers goes into an irreversible coma after routine surgery. On further investigation she finds out that several young, otherwise healthy patients are entering irreversible comas after routine surgeries. These comatose patients are then \"shipped\" off to a mysterious institute. When Susan tells her physician boyfriend about what she's discovered, he's reluctant to believe her.",
         "When a young female doctor notices an unnatural amount of comas occurring in her hospital she uncovers a horrible conspiracy."
      ],
      "budget": 0
   },
   "movielensId": 3015,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1978-01-06",
      "dvdReleaseDate": "1999-10-26",
      "directors": ["Michael Crichton"],
      "runtime": 113,
      "movieId": 3015,
      "title": "Coma",
      "mpaa": "PG",
      "actors": [
         "Geneviève Bujold",
         "Michael Douglas",
         "Elizabeth Ashley",
         "Richard Widmark",
         "Rip Torn",
         "Lois Chiles",
         "Hari Rhodes",
         "Gary Barton",
         "Frank Downing",
         "Alan Haufrect",
         "Lance LeGault",
         "Michael MacRae",
         "Betty McGuire",
         "Tom Selleck",
         "Joanna Kerns",
         "Ed Harris",
         "Richard Doyle",
         "Benny Rubin",
         "Charles Siebert",
         "Martin Speer",
         "Nicholas Worth"
      ],
      "imdbMovieId": "0077355",
      "originalTitle": "Coma",
      "genres": [
         "Thriller",
         "Mystery",
         "Drama"
      ],
      "youtubeTrailerIds": ["Xkh6I-XKLUg"],
      "plotSummary": "A young woman doctor discovers something sinister going on in her hospital. Relatively healthy patients are having 'complications' during simple operations and ending up in comas. The patients are then shipped off to an institute that looks after them. The young doctor suspects there is more to this than meets the eye.",
      "tmdbMovieId": 11223,
      "avgRating": 3.32252,
      "releaseYear": "1978",
      "numRatings": 1110,
      "posterPath": "/wXhYCwf7yhnvlJxhl8nIcSWb4Aw.jpg"
   }
}