{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "mask",
            "id": 2546
         },
         {
            "name": "carnival",
            "id": 3473
         },
         {
            "name": "violence",
            "id": 14819
         },
         {
            "name": "funhouse",
            "id": 171376
         }
      ],
      "imdb_id": "tt0082427",
      "video": false,
      "title": "The Funhouse",
      "recommendations": [
         27346,
         18256,
         40229,
         36599,
         40969,
         30924,
         16180,
         14240,
         14029,
         30062,
         13570,
         24124,
         28377,
         24274,
         40037,
         27475,
         22172,
         24341,
         8973,
         28260
      ],
      "backdrop_path": "/bmblIu9Mz8DNIHG3vF8SFnsy5Q8.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Amy Harper",
               "gender": 1,
               "credit_id": "52fe457a9251416c75057e95",
               "name": "Elizabeth Berridge",
               "profile_path": "/7OnGoQgrwBPiRq68rsE8AdAuJkq.jpg",
               "id": 4000,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Joey Harper",
               "gender": 2,
               "credit_id": "52fe457a9251416c75057e99",
               "name": "Shawn Carson",
               "profile_path": "/9MOWOau8qQhC7gzOAZK4YnSlqgv.jpg",
               "id": 74642,
               "order": 1
            },
            {
               "cast_id": 15,
               "character": "Mrs. Harper",
               "gender": 1,
               "credit_id": "52fe457a9251416c75057ec9",
               "name": "Jeanne Austin",
               "profile_path": null,
               "id": 1012479,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Mr. Harper",
               "gender": 2,
               "credit_id": "52fe457a9251416c75057e91",
               "name": "Jack McDermott",
               "profile_path": "/qlTiH37JHJ9aNK7a6f91gsn0N4G.jpg",
               "id": 74641,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Barker",
               "gender": 2,
               "credit_id": "52fe457a9251416c75057e9d",
               "name": "Kevin Conway",
               "profile_path": "/803hyktASensafHsdvDCnlzWK8k.jpg",
               "id": 27116,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Marco the Magnificent",
               "gender": 2,
               "credit_id": "52fe457a9251416c75057ea1",
               "name": "William Finley",
               "profile_path": "/eeJvY0Mz9TK97aZVF1HeOOX8yRh.jpg",
               "id": 97561,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Buzz Dawson",
               "gender": 2,
               "credit_id": "52fe457a9251416c75057ea5",
               "name": "Cooper Huckabee",
               "profile_path": "/239xShwtPIzL0u3s6B2sTFoeCCI.jpg",
               "id": 156653,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Liz",
               "gender": 1,
               "credit_id": "52fe457a9251416c75057ec1",
               "name": "Largo Woodruff",
               "profile_path": null,
               "id": 127993,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Richie",
               "gender": 2,
               "credit_id": "52fe457a9251416c75057ec5",
               "name": "Miles Chapin",
               "profile_path": "/5XPfiknhd6rXRIppSDmN0P4dndC.jpg",
               "id": 104418,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Geek (as D. Lee Carson)",
               "gender": 2,
               "credit_id": "52fe457a9251416c75057ecd",
               "name": "David Carson",
               "profile_path": "/bErwoKKZwUuYz77micPIwjhHFyx.jpg",
               "id": 2380,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Bag Lady",
               "gender": 0,
               "credit_id": "52fe457a9251416c75057ed1",
               "name": "Sonia Zomina",
               "profile_path": null,
               "id": 1081819,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Truck Driver",
               "gender": 0,
               "credit_id": "52fe457a9251416c75057ed5",
               "name": "Ralph Morino",
               "profile_path": null,
               "id": 1081820,
               "order": 11
            },
            {
               "cast_id": 19,
               "character": "Carnival Manager",
               "gender": 2,
               "credit_id": "52fe457a9251416c75057ed9",
               "name": "Herb Robins",
               "profile_path": null,
               "id": 44656,
               "order": 12
            },
            {
               "cast_id": 20,
               "character": "Strip Show Dancer",
               "gender": 0,
               "credit_id": "52fe457a9251416c75057edd",
               "name": "Mona Agar",
               "profile_path": null,
               "id": 1081821,
               "order": 13
            },
            {
               "cast_id": 21,
               "character": "The Monster",
               "gender": 0,
               "credit_id": "52fe457a9251416c75057ee1",
               "name": "Wayne Doba",
               "profile_path": null,
               "id": 1081822,
               "order": 14
            },
            {
               "cast_id": 22,
               "character": "Carmella",
               "gender": 0,
               "credit_id": "52fe457a9251416c75057ee5",
               "name": "Susie Malnik",
               "profile_path": null,
               "id": 1081823,
               "order": 15
            },
            {
               "cast_id": 23,
               "character": "Madame Zena",
               "gender": 1,
               "credit_id": "52fe457a9251416c75057ee9",
               "name": "Sylvia Miles",
               "profile_path": "/osHOZQ4Mu9xyNDT79fgeSgJeLlH.jpg",
               "id": 19335,
               "order": 16
            },
            {
               "cast_id": 24,
               "character": "Strip Show MC",
               "gender": 2,
               "credit_id": "52fe457a9251416c75057eed",
               "name": "Sid Raymond",
               "profile_path": null,
               "id": 1048530,
               "order": 17
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe457a9251416c75057e87",
               "name": "Tobe Hooper",
               "profile_path": "/rE5TqnAvgaKjWwWZ9AsoU9KcUGU.jpg",
               "id": 10051,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe457a9251416c75057e8d",
               "name": "Lawrence Block",
               "profile_path": "/7jpB0Cze9j1TZiEsM6gkSRiXAtB.jpg",
               "id": 45817,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe457a9251416c75057eab",
               "name": "Steven Bernhardt",
               "profile_path": null,
               "id": 948275,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe457a9251416c75057eb1",
               "name": "John Beal",
               "profile_path": null,
               "id": 1081818,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe457a9251416c75057eb7",
               "name": "Andrew Laszlo",
               "profile_path": null,
               "id": 2082,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe457a9251416c75057ebd",
               "name": "Jack Hofstra",
               "profile_path": null,
               "id": 21811,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 9.988904,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 13555,
      "vote_count": 88,
      "budget": 0,
      "overview": "Rebellious teen Amy defies her parents by going to a trashy carnival that has pulled into town. In tow are her boyfriend, Buzz, and their friends Liz  and Richie. Thinking it would be fun to spend the night in the campy \"Funhouse\" horror ride, the teens witness a murder by a deformed worker wearing a mask. Locked in, Amy and her friends must evade the murderous carnival workers and escape before it leaves town the next day.",
      "similar": [
         10781,
         74997,
         588,
         9373,
         73861,
         238636,
         434873,
         341006,
         27328,
         12662,
         310137,
         357096,
         16764,
         1696,
         14459,
         15069,
         278632,
         10285,
         948,
         381288
      ],
      "original_title": "The Funhouse",
      "runtime": 96,
      "poster_path": "/gW7v4mdFbAbjWlnO0SmZaJ1d6zT.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Mace Neufeld Productions",
         "id": 2767,
         "origin_country": ""
      }],
      "release_date": "1981-03-13",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "Pay to get in. PRAY to get out.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Tobe Hooper"],
      "runtime": 96,
      "synopsis": "Against her stern father's orders, teenager Amy Harper visits a sleazy traveling fun fair with her new boyfriend Buzz, her best friend Liz, and Liz's irresponsible boyfriend, Richie. At the carnival, the four teens smoke marijuana, peep into a 21-and-over strip show, heckle fortune teller Madame Zena, visit the freaks-of-nature exhibit, and view a seedy magic show. Amy's 10-year-old brother, Joey, sneaks out of the house to go to the carnival as well. Richie dares the group to spend the night in \"The Funhouse\" - actually a dark ride. After the park closes, the teenagers sneak back into the fairgrounds settle down inside the ride, at which point they witness the ride assistant (a man in a Frankenstein suit who never speaks) engage Madame Zena as a prostitute. He experiences premature ejaculation, but despite nothing physical having happened, Zena won't return her $100 fee. He strangles her to death in a violent rage. The teenagers try to leave, but find themselves locked inside the ride. As they attempt to escape, Richie secretly steals the money from the strongbox from which \"Frankenstein's monster\" took Zena's fee. The fun fair's barker, Conrad Straker, then discovers what \"Frankenstein's monster\" (his adopted son Gunther) has done to Zena. Conrad also promptly realizes that all the money from the strongbox is missing. Thinking Gunther took it, he attacks his son, at which point Gunther's mask is removed, revealing a gruesomely deformed face with sharp protruding teeth and ruby-red eyes. When Richie's lighter falls from the teens' vantage point, Conrad realizes someone is watching. At this point, Conrad and his \"monster\" son Gunther then stalks through the ride to eliminate any witnesses after also heckling the reluctant Gunther into a murderous rage. Throughout the ride, various props readily double as murder weapons. Meanwhile outside the funhouse, Joey hangs around the dark carnival after it closes for he witnessed Amy and her friends enter the funhouse but did not come out. While searching for a way in, Joey is suprised by the appearance of the unmasked Gunther/Monster at an air vent and attempts to flee only to be found by the other carnival workers who call his parents to pick him up. Mr. and Mrs. Harper soon arrive to pick up the clearly traumatized Joey to take him home (with the implication they will beat him as punishment for sneaking out to go to the carnival). Joey is unable to speak and thus explain to his stern and abusive parents that Amy and her friends are still inside the funhouse. Trapped in the funhouse, the teens quickly die one at a time by the hands of Conrad and Gunther. Richie is first when Gunther throws a noose around his neck and he is strangled to death. Liz is next when she falls through a trapdoor in the floor to a hidden air vent where Gunther approaches. She attempts to sexualy intice the sex-starved monster who lets his guard down for a mintue and Liz stabbs him with a dagger. Wounded but angry, Gunther snatches the dagger away and viciously stabbs Liz to death. Meanwhile, Amy and Buzz attempt to break out of the funhouse through one of the exit ride doors only to be confronted by a gun-toting Conrad. The barker tells them that he is only protecting his son from the authorties and implies that Gunther had previously killed two teenage girls a few months earlier whom inticed him. Just then, Buzz lunges at Conrad to wrestle the gun away from him and manages to impail the barker against a prop sword. Just then Gunther the monster arrives and seeing his father dead, attacks Buzz who attemps to shoot him. Amy is forced to run only to find Buzz's dead body a minute later after Gunther apparently wrestled the pistol away from Buzz and shot him with it. With only Amy remaining, she is terrorized by the funhouse props and dummys which leads her to flee to funhouse maintenance area underneath the building where Gunther follows her to kill her as well leading to the suspenseful, climactic showdown. Amy defends herself with a crowbar against Gunther the monster who grabs the crowbar away from her only to get electrocuted on a nearby fuse box when he swings the crowbar to strike Amy where he is then caugh on a track chain that controls the moving cars through the funhouse. But Gunther revives and grabs Amy only to get crushed to death when the track chain drags him through two spinning gears as Amy screams. As dawn breaks, an exhausted and shaken Amy emerges from the funhouse through the broken down doors while the animatronic fat lady perched atop the ride laughs. Amy then slowly walks out of the deserted carnival, passing a few carnival workers taking down the rides and tents as she heads for home.",
      "writers": ["Lawrence Block"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0082427/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ3MjQxODY4NV5BMl5BanBnXkFtZTcwNTM4OTUyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Elizabeth Berridge, Shawn Carson, Jeanne Austin | See full cast and crew »"],
      "reviews": [
         "Tobe Hooper's straight slasher flick deserves a chance. We admire this genius for \"Poltergeist\" and especially \"Texas Chainsaw Massacre\" but it's fair to recognize the good job he did with \"The Funhouse\". The movie is creepy itself because of it's colorful but creepy setting and atmosphere. I mean, how could something go wrong in the fun house? Well, when there's a freak wearing a Frankenstein mask killing other weird people you can imagine that things could get nasty. The premise is well known. Two couples go to the amusement park at night and soon after they arrive they enter the fun house and witness how a freak kills a woman. That's when the typical killing starts as the freak and his father chase the teens in order to \"hide\" the murder. Overall there are some very creepy moments like when the freak takes off his mask revealing his disfigured head, when this freak slaughters a girl with his claws, the crazy witch, the puppets, and the death scenes. Hooper's direction is top class as always. He put a lot of effort in a low budget slasher flick and that's why he deserves some credit. I'm not saying that he wasted his talent on a movie that doesn't asks much for it; I think that this is one of the best looking and directed slasher flicks of all time. There are some camera angles that looked very innovative for it's time (example, Richie's dead body in the moving wagon). The acting is quite good for a movie like this. I felt sorry for the kids when murdered. Also, the cinematography is quite impressive. The movie is from 1981 and looks very good. The correct use of light in dark settings helped a lot and gave a creepy look to the fun house. The F/X is also good. The freak looks gruesome and horrible in a positive way. The gore is okay. \"The Funhouse\" is definitely a must see for fans of the genre. I can say that this is one of the best slasher flicks out there. The movie is not only about a demented killer chasing teens but it has some truly suspense moments and the effective jump-out of your seat scenes. Recommended for horror fans in general; this is another Tobe Hooper classic that shouldn't be missed. I wonder if this movie inspired Hooper to make \"The Texas Chainsaw Massacre 2\". There are some similarities between the two movies; for example, the freak trying to abuse on a girl, the setting, the \"child\" abuse (uh, the freak is often beaten and yelled by his father), some death scenes, the ending, etc.",
         "From director Toby Hooper (The Texas Chainsaw Massacre-1974) comes this above average slasher-thriller film, that's certainly one of the best of the '80's! Teenagers go to the county fair on a double date. Once there, they decide to spend the night hiding out in the fun house, unknowing that the consequences will be horrific. The Funhouse is a great, suspense-filled horror film that's far more intelligent than most of its type, especially compared to most of the \"splatter\" films of the era. The story is a gripping one, which builds tremendous tension right up to its claustrophobic climax. Hooper gives us an atmosphere of dread, much like he did with the original Texas Chainsaw'. The carnival becomes an underworld of fear and darkness in the skilled hands of Hooper with some colorful set pieces. The music score is wonderfully moody and dramatic. The cast is great as well. The beautiful Elizabeth Berridge makes a great screen debut. Cooper Huckabee is good as Berridge's beefy date. Kevin Conway is the best of the cast though, in his sinister performance as he plays a trio of carnie barkers. Kudos also go to makeup artist Rick Baker for one memorable creation! For those looking for above-average suspense and horror, it will be hard to do better than this entertaining gem! **** out of ****",
         "Fast-paced and atmospheric thriller set in and around the carnival midway. Two couples visiting the local traveling carnival decide to spend the night in The Funhouse and fool around as a lark. After witnessing a murder, they become the targets of a deformed maniac and his barker dad who are determined they will not leave to report it to the police. I read the Owen West (aka Dean Koontz) novelization back in the day, which was infinitely more padded with back story, abortion issues, religious fanaticism, and a rather Byzantine attempt to link the heroine and her younger brother to the killers before they ever set foot on the midway. Mercifully, the film abandons all of the excess baggage and strips the story done to the bare essentials. I enjoy Tobe Hooper's direction here much more so than that shown in the original Texas Chainsaw Massacre as it seems we are seeing a much more polished effort. He nicely establishes the atmosphere of the midway, which by turns is colorful and sordid. The central characters are nicely delineated (although due to the abandoning of the subplots from the novelization, Shawn Carson's younger brother seems like a fifth wheel rather than integral to the story) and well played by an appealing cast. They seem like credible and overwhelmed young people rather than fodder for the axing. Lead Elizabeth Berridge, in particular, has a nice girl next door quality and radiates a resourcefulness through her terror without ever seeming like either Superwoman or a victim. The make-up for the primary killer is particularly effective and novel. The film builds up a substantial head of steam before going for broke in a wild Grand Guignol climax. The score is also worth mentioning as it provides a very effective counterpoint to the action. Ironically, this film is rarely mentioned by horror fans, having been buried amid the morass of Friday the 13th clones that proliferated in this period, but it is definitely one that should be rediscovered.",
         "Up until THE FUNHOUSE, Tobe Hooper had only come pretty close to recapturing the relentless and ruthlessly nightmarish feel of the classic that catapulted him to fame, THE Texas CHAINSAW MASSACRE. TCM 2 came closer than most of his films, but it traded in psychological terror for buckets of blood 'n' guts, where the first TCM had very little. THE FUNHOUSE goes back to Hooper's roots, trading in the gore for playing with your nerves like Jimmy Page playing guitar. Traveling carnivals have always had a sinister, menacing undertone to them - that's part of what makes them so attractive - and Hooper, with a smart assist from Larry Block's script, takes that queasy unease and turns it up to '11', so that when the true horror is revealed, it's intensified that much more. Four friends on a double date (Elizabeth Berridge, Miles Chapin, Cooper Huckabee and Largo Woodruff) decide to hole up in the Funhouse of a traveling carnival just outside of town way past closing time, just for kicks. It's a weird place that gives off a freaky vibe, but they don't come to realize just how freaky, until they see something that puts all of their lives in danger, and realize to their horror that not all the freaks in the show are fake...or at all \"fun\". I don't want to spoil the surprises, but as is his habit, Hooper front-loads the movie with some acting vets, including genre favorites William Finley and Sylvia Miles. Plus the great Kevin Conway plays a pivotal role in bringing about the terror and death that the seemingly endless night holds for the trapped teens. Anyone expecting Hooper and company to just pour on the gore is bound to be disappointed. THE FUNHOUSE is more about empathy and atmosphere...I mean, who HASN'T been through a funhouse like this at some time in their lives? The more you can put yourself in the place of the main characters, the spookier the film will be for you - especially in the third act. Kudos to everybody for putting in some damn good performances, but especially to Berridge and to Wayne Doba who gives us a monster that is by turns pathetic, disgusting, pitiful and horrifying. And for John Beal, who created a score that plays with your nerves just as powerfully as the visuals do. This is one of those best viewed alone, with the sound up and all the lights out...And don't worry - if you screech like a little schoolgirl at some parts, it'll be our secret, I promise...(hehheh)",
         "The teenager Amy Harper (Elizabeth Berridge) dates Buzz Dawson (Cooper Huckabee) for the first time and they go to the carnival with their friends Richie (Miles Chapin) and Liz (Largo Woodruff). They smoke grass and have good-time visiting the attractions including a side show with freak animals. The silly Richie suggests the group to spend the night in the Funhouse for fun. During the night, they witness the murder of the fortune teller Madame Zena (Sylvia Miles) by a man wearing a mask of Frankenstein from an opening in the ceiling of a room. They decide to leave the fun house but they find all the exits locked. Meanwhile Richie sneaks in the room and steals the money of the manager of the place. The masked man returns with his father and owner of the fun house to show the corpse of Madame Zena; when the man realizes that he had been robbed, he presses his son that removes the mask and shows his horrible face. Richie startles and drops his lighter in the room. The owner asks his freak son to chase the thieves and eyewitnesses in a night of terror for the teenagers. \"Funhouse\" is a good low-budget slash movie and as usual based on the stupidity of a group of teenagers, especially Richie that is an irritating character. The cast is formed by unknown actors and actresses and Miles Chapin seems to be repeating his performance in \"Hair\" with another imbecile character. Tobe Hooper uses the entertainments in the fun house to keep a creepy atmosphere, but the movie could be shorter. My vote is seven. Title (Brazil): \"Pague para Entrar, Reze para Sair\" (\"Pay to Get In, Pray to Get Out\")",
         "Along with every other horror fan out there, I have been puzzling about Tobe Hooper. Texas Chainsaw features highly in my list of favorite films. At least two of his other films are really worthwhile, one of them right here. But, it all quickly unraveled for him and by the time he had moved on to Cannon in the mid-80's, he was pretty much over as a filmmaker. I think the crux of the problem is that he was not Hollywood material. He seems to have been a shy and almost asocial presence on his own sets, a kind of droopy, charmless guy, bullied off The Dark by the crass Kinski, sidestepped in Poltergeist by the more agile Spielberg, which can be viewed in Europe as the kind of quality that signifies an artist, but the Hollywood environment requires someone to direct the crowded set and costly , complicated production, and that means energetic decision-makers of some persuasive wit and strong character. You see, he did not come up through the Hollywood system at all. He was a documentary cameraman in the 60's and you can see that in his best work. He did Chainsaw in a close circle of friends, away from Hollywood fanfare. It just didn't seem like he could muster the ego for necessary friction to see that vision through (the drug problems were probably ways to cope with that). His own fault was that he couldn't find it in him to cut out on his own. At any rate, I consider Hooper our loss. The guy had a genuine vision and that vision is prized by me, even snippets of it like we have here. Here's an easy riddle: the film is typical in the slasher vein about a group of teens stranded after-hours in a funhouse. Its singular call to fame now is that it was once part of that notorious list of Nasties. Now that list is dumb and arbitrary in a number of ways, but why this nearly bloodless film? Why not Friday the 13th? But of course for the same reason that Texas Chainsaw got an R rating. The very fabric and walls of the thing are violence. Oh, a lot of what's inside including the storyline and bad guys is silly or simply mediocre, and mainly put together from bankable horror elements, from jump-scares to ruby-red color filters, which is after all the gist of a funhouse: the horror house is fun because you anticipate the elements and staging, and look forward to this being controlled around you. The opening that slyly takes us from a re-enactment of famous scenes in Halloween and Psycho through a Frankenstein poster on the wall to Bride of Frankenstein playing on TV, is Hooper's way of commenting on the redressing of spare parts he's going to use. That's fun and really a lot of the film is, but not genuine vision. Hooper's vision is something more powerful than either Carpenter or Argento, both effective in other respects, were doing on this level, and that is the place itself is causing evil. It was dumbed-down by Spielberg in Poltergeist - written by him but a Hooper-originated project - as an actual force in the walls, and all sorts of gizmos and movie effects were brought around to clarify. But it was something altogether different to a 'haunted house' effect in its original conception. Chainsaw is the most pure in this regard. But, it's a recurring feature in Eaten Alive, Salem's Lot, Poltergeist, and this. Hooper explained it as a 'physical sensation' he was after. I think it's something more he achieved. There is violent energy in the gears and walls of the world, and it's the turning of those gears much more than storybased character decisions that control and manifest the energy as a kind of semiconscious , animal evil in the narrative of the film. You can observe that the 'Funhouse' extends and anticipates the actual physical place (opening scene - dog - shotgun guy). It's something mischievous in the air. In our film, all of it is centered on a imaginative kid on his way to the scary place. That kid is scared out of consciousness. Shots of the unconscious kid are intercut with shots of the terrified teenagers trapped inside the maze. And there is the enigmatic shot of the boy saying nothing about that to the parents. This is brilliant. The boy pulled a prank and expects one back from his sister, the cosmic prank that shatters lives is the universe conspires to stage the real thing. Nothing of this registers directly, because we are distracted by the much more ordinary monster in the narrative (initially Frankenstein). The entire last 20 minutes are a zap of cinematic energy from these cosmic gears that create and destroy the monster that is the prank that throws the world helter skelter (the finale takes place in a staging area full of gears). Why? Because the god of the machine is watching (as the old crone cackles about) and wants to be amused. Make no mistake, this is the sister film to Texas Chainsaw.",
         "The production of this film included the use of a real vintage carnival from the 40s/50s. For anyone interested in the appeal of a traveling carnival, this film has some great sets. \"The Funhouse\" also features some great Rick Baker/Craig Reardon effects in the form of the movie's \"villain\", a deformed albino with fangs and claws. But the rest of the production is sorely lacking. Tobe Hooper does his best with the material, but he's not too good at smoothing over the obvious lack of logic inherent in the film. For instance, the plot concerns a small group of four teenagers who decide on a lark to \"spend the night in the funhouse\" of the traveling carnival they're visiting...the same carnival that was around \"when those two girls were found dead in the woods some time ago\". Now, why on Earth would anybody in their right minds find the idea of staying in a carnival funhouse overnight exciting? Where will they sleep? What will they do the next day? Won't they get hungry? Thirsty? Have to brush their teeth? Use the bathroom? Not only that, but the attractions in this carnival are most definitely not of the transportable variety. The titular dark ride seems so immense that our teen protagonists find it impossible to navigate their way out of the funhouse when danger rears its ugly head. Here's an idea: maybe follow the metal tracks in the floor until you are standing at the exit? In fact, the funhouse is built like a permanent fixture, with at least two floors and what appears to be a sub-basement! How would the carnies ever be able to dismantle this thing and move it in one day? This flick also suffers another blow by giving us nobody to root for. The teenage \"protagonists\" are wholly unlikeable. They smoke pot like they're sipping soda out of a can, they steal money from strangers, they are stupid enough to want to spend the night in a carnival attraction, and they commit the unpardonable horror movie sin of fornication--all except for the female lead, of course, although she isn't even interesting enough to be engaging. The dialogue in the film is flat, and it has no success in establishing any characterizations on behalf of the would-be victims. I wasn't even paying attention to most of the film's first reel. \"The Funhouse\" is also one of those movies where the villains seem to know exactly where their victims will be standing, like directly on top of a trap door that is conveniently deployed right on cue. The machinery of the funhouse also knows exactly how to deposit dead bodies so that they will stop exactly in front of our screaming victims. Suspension of disbelief aside, \"The Funhouse\" stirs up some uncomfortable feelings when the filmmakers use their \"monster\" to get scares out of the audience, then tell us he's simply deformed. In reality, he is one of the only sympathetic characters in the movie, and the film's climax is the only portion that packs a wallop: the script pits the only two characters in the film worth caring about against one another. Hooper throws in some sly references to \"Texas Chain Saw Massacre\", even if it does involve the gratuitous and illogical use of swinging hooks (haw haw), but by the time the movie delivers any real shudders, it's too late. Ironically, Dean Koontz was hired to write a movie tie-in novel for \"The Funhouse\", which was published under the psuedonym Owen West. Koontz fleshed out the story considerably, adding some great touches that the filmmakers would have been wise to exploit in their own movie. Too bad, because Koontz's treatment may have given Hooper a bigger, sharper hook on which to hang this film.",
         "Inexplicablilty added to the infamous \"videos nasties\" banned list in the UK during the 1980's Funhouse ranks as possibly the most boring horror movie of all time. Tobe Hooper dined out for years on the over-hyped Texas Chainsaw Massacre churning out derivative horror garbage like Funhouse during the subsequent years. For a movie with a running time of one hour 35 minutes its about 44 minutes before anything remotely interesting happens. The walking talking clichés who enter the carnival do the attractions and then the viewer is taken round some of the attractions again. Yawn. In the meantime the kid brother of one of the main players, having sneaked out of the house and made his way to the carnival wanders around the funfair trying to find his older siblings. This is also really boring. Hooper has mastered the art of stringing out tedium to the point of infinity with a script that could be summarised on the back of a postage stamp. Even factoring in the age of the film, Funhouse is a cliché ridden, poorly acted borefest with a lamentable rubber faced monster. And some people rate this as a masterpiece. Nurse!.",
         "In all of my travels and travails, the most-remarkable experiences I have ever-had were in the long-lost carnivals and freak shows of the 1970s. They are gone, they are gone. The freak show was the best-part of any carnival, as any carny-goer will attest, and a great-time for scaring-the-ladies. One would be-regaled by the carnie-barkers as to the mysteries-within: the two-headed cows, the mutant-babies and the stillborn-infants, the cock with four-legs, the bearded-ladies, the rubber-faced freaks, the geeks, and the mummified-mermaids and Old west-yeggs. All this got swept-away by the scions of \"political-correctness\" of all-political-persuasions. And where did that leave the freaks? Homeless. If the freak show gave the public anything-at-all, it was the sureness that there were indeed others worse-off than ourselves, and we supported-them. The good-news is, people like Jim Rose have resurrected this era, and here's to more! The film is possibly the finest \"stalk-and-slash\" of the era it was made-in, and the opening-scene is a very-funny homage to the shower-scene in Hitchcock's \"Psycho\". The majority-of the action takes-place at the carnival, and the funhouse, but there are some great expositions of the entire-carnival (Hooper even inserts a man covered-in-blood into a crowd-shot to see if we're paying-attention). We see a striptease-tent, the freak show, and even some of the lives of the carnies, and it's definitely well-researched. The colors and the grotesqueness of ALL carnivals is here, on-display, and there are some interesting aside-comments on why we go to them. Often, it is mystery and curiosity, and that is the heart of the film--discovery-as-horror-reveal. And so, the kids go to the carnival, and stay-the-night in the funhouse on-a-dare, voyeuristically-invading the lives of the carnies. Before-long, they have witnessed-a-murder by the carny in the Frankenstein-mask...who might-not be-human. But, Hooper has forewarned-us of everything, including the mutant-killer in the earlier freak show scenes (the bifurcated-head of the cow, the mutant-fetus, and other-shots). It just builds-and-builds to the hysterical-ending, growing more-and-more ominous. There are many-many-scenes that are simply atmospheric--crucial to any effective-horror. As-usual, any great horror-film has its stand-out actor, and in-this-case, it is Kevin Conway. His triple-roles as the funhouse-barker, the strip-tent barker, and the freak show barker are simply-classic. Without-him, \"The Funhouse\" would not be nearly-so-good. Like many of Tobe Hooper's horror-films, this story concerns a family, or multiple-ones under-attack. There are a few-moments where it is truly-difficult not to feel-pity for the deformed-killer, as it is obvious his life has been miserable and abusive. If you don't have some empathy for the monster in a horror-film, you don't have a very-good story. There is an incredible-scene--possibly the best in the film--in-which the main female-protagonist lands in the machine-room of the funhouse. It is highly-orchestrated, and expresses a fear of the mechanical, with steam-blasting pumps, pulleys, gears, and timed-noise. It is probably Hooper's best-constructed scene in any of his films for sheer hysteria and tension--excepting the \"dinner-party\" in \"Texas Chainsaw Massacre\", because the hysteria was real. Also-noteworthy, is the score by John Beal. It has the Bernard Hermann-style of descending-scales, and a skill for-creating atmosphere. The Universal-DVD is perfect, with superior image and audio-quality. This film will be-remembered, later-on, as one of Tobe Hooper's best.",
         "This was better than it should have been, considering most of the actors are unknowns and the film has a Grade B feel to it throughout. It gets good points for two things: the story moved fast and the cinematography was good. I like stylish-looking visuals, which is what you get here. Teenage punks usually turn me off but these guys - with one exception - were tolerable. The language was bad, but much of it came in bunches by just two of the guys. Overall, a surprisingly--decent horror film which is colorful and has its atmospheric merits. Is is super scary? No, but it's a fun-house and fun to watch."
      ],
      "genres": ["Horror"],
      "productionCompanies": [
         "Universal Pictures",
         "Mace Neufeld Productions"
      ],
      "summaries": [
         "Two young couples on a double date go to a mysterious carnival. As a prank they decide to spend the night in the funhouse. When they witness a brutal murder, they suddenly find themselves in horrific danger.",
         "Four teenagers, Amy Harper, Buzz Klemmet, Richie Atterbury and Liz Duncan, travel to the carnival which has just come to town, for some fun. As the night begins to come to an end, Liz suggests they stay the night in the fun house. They all agree and decide to take the last ride before the attraction shuts down. As they stay in the fun house, the four witness and horrific murder against a psychic reader by a very big man in a Frankenstein mask, also Richie takes some of the money earned by the man who runs the fun house. The owner is furious about the missing money and sends his son, Gunther, who killed the reader, to take care of the thieves. Now the four are locked in the fun house, being stalked and killed one by one.",
         "Four teenage friends spend the night in a carnival funhouse and are stalked by a deformed man in a Frankenstein mask."
      ],
      "budget": 0
   },
   "movielensId": 3021,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1981-03-13",
      "dvdReleaseDate": "2004-09-07",
      "directors": ["Tobe Hooper"],
      "runtime": 96,
      "movieId": 3021,
      "title": "The Funhouse",
      "mpaa": "R",
      "actors": [
         "Elizabeth Berridge",
         "Shawn Carson",
         "Jeanne Austin",
         "Jack McDermott",
         "Kevin Conway",
         "William Finley",
         "Cooper Huckabee",
         "Largo Woodruff",
         "Miles Chapin",
         "David Carson",
         "Sonia Zomina",
         "Ralph Morino",
         "Herb Robins",
         "Mona Agar",
         "Wayne Doba",
         "Susie Malnik",
         "Sylvia Miles",
         "Sid Raymond"
      ],
      "imdbMovieId": "0082427",
      "originalTitle": "The Funhouse",
      "genres": ["Horror"],
      "youtubeTrailerIds": ["BMoQQ7OsX5M"],
      "plotSummary": "Rebellious teen Amy (Elizabeth Berridge) defies her parents by going to a trashy carnival that has pulled into town. In tow are her boyfriend, Buzz (Cooper Huckabee), and their friends Liz (Largo Woodruff) and Richie (Miles Chapin). Thinking it would be fun to spend the night in the campy \"Funhouse\" horror ride, the teens witness a murder by a deformed worker wearing a mask. Locked in, Amy and her friends must evade the murderous carnival workers and escape before it leaves town the next day.",
      "tmdbMovieId": 13555,
      "avgRating": 2.6259,
      "releaseYear": "1981",
      "numRatings": 278,
      "posterPath": "/gW7v4mdFbAbjWlnO0SmZaJ1d6zT.jpg"
   }
}