{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "widow",
            "id": 4129
         },
         {
            "name": "police corruption",
            "id": 11734
         }
      ],
      "imdb_id": "tt0062218",
      "video": false,
      "title": "Rough Night in Jericho",
      "recommendations": [
         64071,
         70259,
         55863,
         200670,
         112687,
         449751,
         14685,
         36588,
         127475,
         226363,
         84209,
         39293,
         65799,
         89148,
         141824,
         385371,
         53102,
         91618,
         347850,
         43788
      ],
      "backdrop_path": "/Ad51vNDwxfPUIWlLa9pvFxsonuz.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Alex Flood",
               "gender": 2,
               "credit_id": "52fe46f5c3a368484e0ad519",
               "name": "Dean Martin",
               "profile_path": "/jSKT0dtqCaCFccga7bweuwYXQI8.jpg",
               "id": 4299,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Dolan",
               "gender": 2,
               "credit_id": "52fe46f5c3a368484e0ad51d",
               "name": "George Peppard",
               "profile_path": "/4a0pbvG693RXAzuMgPGLOH0ZqbD.jpg",
               "id": 1933,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Molly Lang",
               "gender": 1,
               "credit_id": "52fe46f5c3a368484e0ad521",
               "name": "Jean Simmons",
               "profile_path": "/lVE40Hx4s2VI2nPxkNaF0hBjPw9.jpg",
               "id": 14500,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Ben Hickman",
               "gender": 2,
               "credit_id": "553d94ca925141125600cb7a",
               "name": "John McIntire",
               "profile_path": "/mqg5Cs6d6FCXlkR0ntUZfmR4As6.jpg",
               "id": 53010,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Yarbrough",
               "gender": 2,
               "credit_id": "553d94d3c3a36820ec004747",
               "name": "Slim Pickens",
               "profile_path": "/pNIO3A9WmjyjVSIJ7jALoXGzpQJ.jpg",
               "id": 14253,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Jace",
               "gender": 2,
               "credit_id": "570b138a92514111f2001110",
               "name": "Don Galloway",
               "profile_path": "/1qqTty1gAzbmLQFIIawEsaPayfD.jpg",
               "id": 28167,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Gus Torrey",
               "gender": 2,
               "credit_id": "570b13ad9251412c74000a37",
               "name": "Brad Weston",
               "profile_path": null,
               "id": 15756,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Frank Ryan",
               "gender": 2,
               "credit_id": "570b13cac3a3680fc2005c8b",
               "name": "Richard O'Brien",
               "profile_path": "/qcqGtwFB0why84io8GTClOidH28.jpg",
               "id": 118484,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Claire",
               "gender": 0,
               "credit_id": "570b13de9251412c74000a43",
               "name": "Carol Andreson",
               "profile_path": null,
               "id": 1198576,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Simms",
               "gender": 2,
               "credit_id": "570b13f0c3a3680ee100185a",
               "name": "Steve Sandor",
               "profile_path": "/7va3upylQNcIQ6NQYjZSmVEPkHB.jpg",
               "id": 15999,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Burnett",
               "gender": 2,
               "credit_id": "570b1406c3a3687570005cf2",
               "name": "Dean Paul Martin",
               "profile_path": "/j328R35ou9goIbUKb7Y8PXhPvTv.jpg",
               "id": 1242472,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Charlie McGivern",
               "gender": 0,
               "credit_id": "570b141ac3a368356a0017e4",
               "name": "John Napier",
               "profile_path": null,
               "id": 137312,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46f5c3a368484e0ad4fd",
               "name": "Arnold Laven",
               "profile_path": "/lvKXxRX8PVyxRWFVsraflnaNYxi.jpg",
               "id": 55692,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46f5c3a368484e0ad503",
               "name": "Marvin H. Albert",
               "profile_path": null,
               "id": 16889,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe46f5c3a368484e0ad509",
               "name": "Sydney Boehm",
               "profile_path": null,
               "id": 82862,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe46f5c3a368484e0ad50f",
               "name": "Don Costa",
               "profile_path": null,
               "id": 40167,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46f5c3a368484e0ad515",
               "name": "Russell Metty",
               "profile_path": null,
               "id": 13809,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5996a3a1c3a3685abb00792e",
               "name": "Ted J. Kent",
               "profile_path": null,
               "id": 2920,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5996a3bbc3a36806ee00c544",
               "name": "Waldon O. Watson",
               "profile_path": null,
               "id": 7310,
               "department": "Sound",
               "job": "Sound"
            },
            {
               "gender": 0,
               "credit_id": "5996a3cd925141239000ba45",
               "name": "Frank H. Wilkinson",
               "profile_path": null,
               "id": 1633138,
               "department": "Sound",
               "job": "Sound"
            },
            {
               "gender": 0,
               "credit_id": "5996a3e1c3a36806ee00c571",
               "name": "Frank Arrigo",
               "profile_path": null,
               "id": 161975,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "5996a3e792514162a8007b45",
               "name": "Alexander Golitzen",
               "profile_path": null,
               "id": 12346,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "5996a3f8925141239000ba74",
               "name": "James Redd",
               "profile_path": null,
               "id": 1027531,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "5996a40d925141239000ba86",
               "name": "John McCarthy Jr.",
               "profile_path": null,
               "id": 1010740,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "5996a424c3a368068500c9f6",
               "name": "Hal W. Polaire",
               "profile_path": null,
               "id": 18379,
               "department": "Production",
               "job": "Unit Production Manager"
            },
            {
               "gender": 2,
               "credit_id": "5996a435c3a368644a00748f",
               "name": "Martin Rackin",
               "profile_path": null,
               "id": 50270,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5996a443c3a368172b005055",
               "name": "Alvin G. Manuel",
               "profile_path": null,
               "id": 1871961,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "5996a463c3a368068500ca2f",
               "name": "Larry Germain",
               "profile_path": null,
               "id": 14495,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "5996a46b925141239000bae4",
               "name": "Bud Westmore",
               "profile_path": null,
               "id": 14498,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            }
         ]
      },
      "genres": [{
         "name": "Western",
         "id": 37
      }],
      "popularity": 1.101835,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 64963,
      "vote_count": 6,
      "budget": 0,
      "overview": "The only business in the Wild West town of Jericho that corrupt sheriff Alex Flood doesn't control behind the scenes is the stagecoach owned by tough-willed widow Molly Lang and her right-hand man, Hickman. Former marshal Dolan, recently hired by Lang and Hickman as a driver, wants to stay out of the mess, but when he sees Flood's henchman Yarbrough assault Lang, he steps up to fight the corruption.",
      "similar": [
         2034,
         26390,
         11699,
         5503,
         4982,
         866,
         1587,
         35056,
         39939,
         9737,
         8923,
         101,
         278,
         281,
         1368,
         13885,
         407448,
         359940,
         277216,
         31598
      ],
      "original_title": "Rough Night in Jericho",
      "runtime": 104,
      "poster_path": "/fXesd6LXcjHYRDgCyh7eKtisSew.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
         "name": "Universal Pictures",
         "id": 33,
         "origin_country": "US"
      }],
      "release_date": "1967-01-01",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "A former deputy and a strong-willed widow determine to stop a ruthless town boss.",
      "adult": false,
      "homepage": null,
      "status": "Rumored"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Arnold Laven"],
      "runtime": 104,
      "synopsis": null,
      "writers": [
         "Marvin H. Albert",
         "Sydney Boehm"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0062218/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ2OTk4OTIzMF5BMl5BanBnXkFtZTcwNTA3MTQyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Dean Martin, Jean Simmons, George Peppard | See full cast and crew »"],
      "reviews": [
         "Dean Martin for the first and only time in his career played a villain, a town boss named Alex Flood who still hasn't gotten control of the stagecoach line Jean Simmons runs. She's sold it to George Peppard and John McIntire. McIntire is wounded on the way into town and he and Peppard are put up by Simmons. This doesn't sit well with Dino, he and Simmons have had their moments in the past. It's a good adult western with lots of action to satisfy everyone. One of the most brutal fight scenes in cinema history takes place between Peppard and Slim Pickens who's Martin's chief henchman. More brutal than the one between Humphrey Bogart and Tim Holt against Barton MacLane in Treasure of the Sierra Made. More brutal because Pickens meets his demise. The rest of the film is Peppard rallying forces to take the town away from Martin's control. Of course having Jean Simmons to come home to is enough to inspire anyone. Simmons is no longer playing the young girls she played in the 1950s, but she gives a good account of herself as the stageline widow. She's always good, one of the most under-appreciated actresses in movie history. Good adult western, worth a view. And if you want to see a modern remake, catch the Patrick Swayze film Road House.",
         "Dean Martin plays the villain for the first time, but doesn't add any dimension to his role. George Peppard steals the movie as a gambler who doesn't want any trouble until situation becomes impossible. Jean Simmons is adorable as usual. The plots are quite routine, the action scenes passable. It's a bit unreasonable that Simmons would let Peppard, a stranger who rides to town on her stagecoach, stay in her house. Although such arrangement is made by the writers, it's a shame that their relationship is not fully developed. Fortunately we see some familiar supporting actors, including Don Galloway (of TV series IRONSIDE), John McIntire (of WAGON TRAIN), and it's interesting to watch comic actor Slim Pickens as mean, sadistic character again after his wonderful performance in ONE-EYED JACKS (1961).",
         "Dean Martin plays the corrupt sheriff, who has controlling interest in virtually every enterprise in the small town of Jericho. Virtually every enterprise except the stagecoach service owned by Jean Simmons. Martin wants to control ALL of Simmons' property. In rides George Peppard, a former \"town tamer\" and his partner, John McIntire, a former lawman. Peppard had planned to be a driver for Simmons, but wants no part of taking on Martin and his men, including Slim Pickens. When Pickens arrives at Simmons ranch to damage her stagecoach, Simmons resists him, and is struck by Pickens. What follows is one of the most violent fights in the history of the western. Peppard finally shows the townspeople how to defeat Martin and his men. Martin beats Simmons savagely, and Peppard pursues Martin to the final showdown. Unlike most westerns the showdown takes place in the woods, and it is not altogether clear that either man survives. Martin makes a charming, if vicious, villain. Peppard brings more emotion than one usually expects to his western hero. Simmons, as always, is radiant. There are worse ways to spend 90 minutes.",
         "Compelling tale of an ex-deputy and his nemesis who is hired by a widow to protect her from revenge-seeking outlaws . In the Old west there are always the men who live breathe violence and the women who hold their breath . A ¨town tamer¨ , ex-sheriff and now professional gambler named Dolan (George Peppard) along with his old pal (John McIntire) come hired by Molly Lang (Jean Simmons) who owns the stagecoach line to rid the baron land named Alex Flood (Dean Martin)and his hoodlums (Slim Pickens , Steve Sandor) . Dolan as ex-lawman brings peace for the townspeople , meanwhile Alex takes the justice on his own hands , hanging enemies and appointing marshals and orders warnings , as wearing of guns or other weapons in town is banned . Flood is a whole villain determined to kill Dolan , he owns the Palace Casino, Saloon , General Store and lands . But the town council afraid the raw methods carried out by Flood and reunite , when Alex aware he orders to burn the place . At the end the kingpin landowner appears and attempts to murder Dolan with his own means . This is a tremendously exciting story of an ex-deputy-for-hire who had only one more killing to go. It begins as a sluggish , slow-moving Western but follows to surprise us with dark , rudimentary characters and solid plot . The tale is almost grim though full of clichés, a pacifier and his old partner come to a town just in time to make sure its citizenry but later the events get worse . The action is brutishly cruel as when Dean Martin slaps and hits Jean Simmons. The highlights of the film are the facing off between Peppard and Slim Pickens and the climatic showdown on the ending at the saloon and the town. Phenomenal and great role for Dean Martin as bad guy , he's the whole show. Vivid and lively musical score by Don Costa and atmospheric cinematography by Russell Metty. Watchable results for this offbeat Western. The motion picture is professionally directed by Arnold Laven . Laven formed a production company along with Jules Levy and Arthur Gardner. The first Levy-Gardner-Laven movie was 1952's \"Without Warning\"'; in the decades since, they have produced and directed dozens of additional features . He's an expert on Western genre as cinema as television as he produced and directed several TV series including \"The Rifleman,\" \"Law of the Plainsman,\" , \"The Big Valley\" . And directed acceptable Western films as ¨The glory guys¨, ¨Geronimo¨and ¨Sam Whiskey¨.",
         "It's a bit unusual seeing Dean Martin play the part of a villain, especially having been a regular viewer of his variety show back in the 1960's. I couldn't help thinking that any minute he would enter the Ace Deuce, hop up on a piano and start belting out 'That's Amore'. There was at least one similarity to Martin's weekly show with the presence of a gorgeous blonde babe hanging around. No, not Jean Simmons, but that saloon girl Claire (Carol Andreson), who if I had to bet, would probably have shown up on one of his shows as well. Actually, Martin handled the role of a heavy pretty well, but I kept wondering if the movie might have been better served with Dino and George Peppard switching roles. The casting of Slim Pickens as Alex Flood's (Martin) top henchman also seemed to go against the grain. I mean, can you picture Andy Devine as a bad guy, or Smiley Burnette, or Chill Wills, or ..., well you get the idea. But at least Pickens took the role and ran with it, nasty bull whip and all. As for Peppard, he becomes the reluctant hero after Flood pushes all the right buttons, and especially when he makes the move on Molly Lang's (Simmons) stagecoach business. Martin's character makes it a point to own fifty one percent of every enterprise in Jericho, but you know, I kept wondering why he allowed the 4 Aces Saloon to operate in town; it didn't seem like Jericho was all that big. Hey, can you beat those medical fees back in the 1800's? For fixing up a gunshot wound in old Ben Hickman (John McIntire) the Doc charges just a dollar! Kind of makes you wonder how much it cost to go to med school. Too bad Hickman didn't make it to the end of the picture, I kind of liked his deliberate, methodical style. Of course the ending is never in question, the fun is in watching how the good guy plan separates Flood's gang of outlaws so they can narrow the odds. The one thing I would have allowed for earlier in the story would be showing Peppard's character and his prowess with a knife. As it is, the way Dolan took out Flood made me sit up and ask, 'where did that come from'?",
         "Off beat casting of Dean Martin as the town tyrant who, among other things wants the stagecoach line that his former lover, Jean Simmons, currently owns. In steps George Peppard, playing a former deputy, who comes to town and eventually gets caught up in things when his better sense tells him that he shouldn't stay. Simmons plays a hand in this. Slim Pickens, who usually played good guys, played one of Matin's henchmen. The film gets rather violent--especially the fight scene between Peppard and Pickens-which begins with Pickens using a whip. Acting was quite good. I liked Don Galloway and John McIntyre in supporting roles. It was a bit of a stretch to believe Martin as a total villain--but he pulled it off quite well",
         "5 USA showed \"Rough night in Jericho\"yesterday evening in pan and scan that is generally the kiss of death to any movie and certainly the big fight between Mr Peppard and Mr Pickens loses much of its impact,but generally the whole piece held up reasonably well. Good old pros in front of and behind the camera do their stuff very professionally and Mr McIntyre is particularly good as a retired sheriff turned stage driver. Mr D.Martin plays Flood as \"Dude\" in \"Rio Bravo\" might have turned out if MrJ.Wayne had ridden away and left him after the closing titles. He has the veneer of charm and bonhomie but it is stretched pretty thin by Mr G Peppard as a former deputy who involves himself in what Flood considers to be his town and with Miss J.Simmons who he considers to be his woman. \"Rough night in Jericho\" would have been a very good TV Western but doesn't quite reach the heights on the big screen. Nonetheless it is pleasing enough and well cast enough to be worth your time.",
         "George Peppard is very wonderful in this movie. His acting is very well done. His character in this movie reminds me of the character he will later play on the A-Team. (Plot Spoilers) His character rides into town and saves the day. He even sets up a trap to catch the bad guys like he did at the end of every episode of the A-Team. (Plot Spoilers)Dean Martin plays a very good villain in this movie. Dean Martin plays a bad guy that is almost nice until you get on his bad side. Sim Pickens who played bad guys before in movies like Blazing Saddles, One Eyed Jacks, and a few others. Top all other bad guys he played before in this movie. John McIntire was a lovable, kindhearted and tough lawman.Jean Simmons plays a head strong woman that has a independent spirit. This has got to be one of my favorite George Peppard movies.",
         "Normally I love westerns, and I am willing to accept some flaws in them, but I found this particular western a chore to sit through. The lead performances, for one thing, hurt the movie. Now, I am not saying that Peppard and Martin were miscast, but they were not directed well here. Peppard seems out of place, while Martin does not come across as ruthless enough to be believable as a villain. But what really hurts the movie is the script. The mix between comic sequences and brutal action do not fit together very well. Also, the first half of the movie is almost all talk talk talk, and not very interesting talk. And Peppard's character doesn't do anything in that first half to try and change the desperate situation. Things do pick up somewhat in the last part of the second half, but it's too little too late. By the way, Leonard Maltin's video guide branded this movie as \"gory\", but by today's standards it's not very bloody."
      ],
      "genres": [
         "Romance",
         "Western"
      ],
      "productionCompanies": ["Universal Pictures"],
      "summaries": [
         "Playing against type, Dean Martin is an ex-lawman who has decided to illegally profit from his abilities. He now owns most of the town of Jericho, and has hired a band of gunmen to enforce his edicts. Outside of town, Martin ambushes a stagecoach that is carrying a passenger, ex-marshal George Peppard. From a hidden spot in the brush, Martin shoots up the coach and rides away. Arriving in town, Peppard meets Jean Simmons who has refused Martin's attempts to take over operation of her stage line. After a few days, Peppard becomes attracted to Simmons, but he sees that the odds against them are too great, and is on the verge of leaving town. But, after Martin physically roughs up Simmons, Peppard organizes the few men in town who are willing to put up a fight, and attacks enterprises that are owned by Martin. Finally, in a showdown, Martin and Peppard battle it out, ironically in the same spot that Martin originally ambushed the stagecoach.",
         "A former deputy and a strong-willed widow determine to stop a ruthless town boss."
      ],
      "budget": 0
   },
   "movielensId": 3025,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1967-01-01",
      "dvdReleaseDate": "1999-10-26",
      "directors": ["Arnold Laven"],
      "runtime": 104,
      "movieId": 3025,
      "title": "Rough Night in Jericho",
      "mpaa": "",
      "actors": [
         "Dean Martin",
         "George Peppard",
         "Jean Simmons",
         "John McIntire",
         "Slim Pickens",
         "Don Galloway",
         "Brad Weston",
         "Richard O'Brien",
         "Carol Andreson",
         "Steve Sandor",
         "Dean Paul Martin",
         "John Napier"
      ],
      "imdbMovieId": "0062218",
      "originalTitle": "Rough Night in Jericho",
      "genres": ["Western"],
      "youtubeTrailerIds": ["sasVCtrFU8c"],
      "plotSummary": "The only business in the Wild West town of Jericho that corrupt sheriff Alex Flood doesn't control behind the scenes is the stagecoach owned by tough-willed widow Molly Lang and her right-hand man, Hickman. Former marshal Dolan, recently hired by Lang and Hickman as a driver, wants to stay out of the mess, but when he sees Flood's henchman Yarbrough assault Lang, he steps up to fight the corruption.",
      "tmdbMovieId": 64963,
      "avgRating": 2.86508,
      "releaseYear": "1967",
      "numRatings": 63,
      "posterPath": "/fXesd6LXcjHYRDgCyh7eKtisSew.jpg"
   }
}