{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0082817",
      "video": false,
      "title": "Nighthawks",
      "recommendations": [
         2099,
         12764,
         10396,
         28932,
         9874,
         10859,
         20721,
         9972,
         10724,
         11707,
         23599,
         27352,
         6472,
         9604,
         15983,
         2320,
         9941,
         15379,
         9013,
         11856
      ],
      "backdrop_path": "/cGRZ8FvljWlwxtaxTrakx2OmhOA.jpg",
      "revenue": 19905359,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Det. Sgt. Deke DaSilva",
               "gender": 2,
               "credit_id": "52fe4421c3a368484e01108b",
               "name": "Sylvester Stallone",
               "profile_path": "/gnmwOa46C2TP35N7ARSzboTdx2u.jpg",
               "id": 16483,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Wulfgar",
               "gender": 2,
               "credit_id": "52fe4421c3a368484e01108f",
               "name": "Rutger Hauer",
               "profile_path": "/2x1S2VAUvZXZuDjZ4E9iEKINvNu.jpg",
               "id": 585,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Det. Sgt. Matthew Fox",
               "gender": 2,
               "credit_id": "52fe4421c3a368484e01109f",
               "name": "Billy Dee Williams",
               "profile_path": "/sDuo82Mb5o3ZGt4SuV9dR0lAh8P.jpg",
               "id": 3799,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Irene",
               "gender": 1,
               "credit_id": "52fe4421c3a368484e0110a3",
               "name": "Lindsay Wagner",
               "profile_path": "/n26onWq0lM5BusHY7KLRMOAnB1i.jpg",
               "id": 57905,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Shakka Holland",
               "gender": 1,
               "credit_id": "52fe4421c3a368484e0110a7",
               "name": "Persis Khambatta",
               "profile_path": "/fpXboRL524smwVeEtOBSKx62Gz3.jpg",
               "id": 1757,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Peter Hartman",
               "gender": 2,
               "credit_id": "52fe4421c3a368484e0110ab",
               "name": "Nigel Davenport",
               "profile_path": "/1TwrQGpgtjejHHA2U3qfoNBX0io.jpg",
               "id": 13327,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Pam",
               "gender": 0,
               "credit_id": "52fe4421c3a368484e0110af",
               "name": "Hilary Thompson",
               "profile_path": null,
               "id": 70117,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Lt. Munafo",
               "gender": 2,
               "credit_id": "52fe4421c3a368484e0110b3",
               "name": "Joe Spinell",
               "profile_path": "/wzZZO8xXn9OgljCmrGGR4L6wBdg.jpg",
               "id": 16525,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Commissioner",
               "gender": 2,
               "credit_id": "52fe4421c3a368484e0110b7",
               "name": "Walter Mathews",
               "profile_path": null,
               "id": 112962,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Sergeant",
               "gender": 0,
               "credit_id": "52fe4421c3a368484e0110bb",
               "name": "E. Brian Dean",
               "profile_path": null,
               "id": 112963,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Girl at Party - London",
               "gender": 0,
               "credit_id": "583691e5c3a36836a900b0c7",
               "name": "Sue Vanner",
               "profile_path": "/tb2zqhKus34iIb6EgkNVVQM5C5J.jpg",
               "id": 104279,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Detective Mooney (uncredited)",
               "gender": 2,
               "credit_id": "5a53aa47c3a3687534034439",
               "name": "Gerard Murphy",
               "profile_path": null,
               "id": 1956265,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4421c3a368484e011095",
               "name": "Bruce Malmuth",
               "profile_path": null,
               "id": 58040,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "580d056dc3a368249d00e5fe",
               "name": "David Shaber",
               "profile_path": null,
               "id": 69567,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 8.783368,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 21610,
      "vote_count": 106,
      "budget": 5000000,
      "overview": "An international terrorist has New York in a grip of panic and it's up to Det. Sgt. Deke DaSilva to take him down.",
      "similar": [],
      "original_title": "Nighthawks",
      "runtime": 99,
      "poster_path": "/sjmTgH0Ye1cbBoaLCKJNt3LmasJ.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Martin Poll Productions",
            "id": 3986,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "The Production Company",
            "id": 3987,
            "origin_country": ""
         },
         {
            "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
            "name": "Universal Pictures",
            "id": 33,
            "origin_country": "US"
         }
      ],
      "release_date": "1981-03-17",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "A terrorist holds New York in a grip of fear - and only Stallone can take him on.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": [
         "Bruce Malmuth",
         "Gary Nelson"
      ],
      "runtime": 99,
      "synopsis": "The story revolves around the lives of two NYPD police detectives, Det. Sgt. Deke DaSilva (Sylvester Stallone) and Det. Sgt. Matthew Fox (Billy Dee Williams) who work undercover, and a terrorist Heymar Reinhardt, alias Wulfgar (Rutger Hauer). In the prologue, set in the late night to early morning hours on New Year's Eve 1979, three armed assailants attempt a mugging on a supposedly unsuspecting woman, who turns out to be DaSilva in drag for a carefully planned sting operation to catch these muggers who rob elderly people. Fox immobilizes two of the suspects as Deke chases the third upstairs to the 174th Street (IRT White Plains Road Line) Subway Station platform and dares the man to cut him. Deke then incapacitates him places him under arrest. The next scene takes place in London on the same day (five hours ahead because of the time zone difference), where Wulfgar (Rutger Hauer) bombs a department store after flirting with a young cosmetic salesgirl (Catherine Mary Stewart), instilling the will of fear in the surrounding society. January 4, 1980. In New York City, DaSilva and Fox serve a high risk warrant in the Bronx. They raid a known drug distribution spot. The obvious corruption in the police department is exposed in the suspect's dialogue as a minor subplot. January 6. In London, Wulfgar converses with his contact at a party, Kenneth, who tells Wulfgar that Mercer, who we never see but come to know as the financier of Wulfgar's operations, is withholding money owed to Wulfgar because several children were killed in Wulfgar's latest bombing at the department store. Wulfgar quickly discovers that Kenneth had been held at Heathrow Airport in police custody, and has inadvertently led police to Wulfgar's location. Wulfgar then proceeds to murder Kenneth and the policemen who had converged on the location. Wulfgar flees to Paris where he meets his associate, Shakka Holland (Persis Khambatta) at La Sainte-Chapelle. Shakka remarks that La Sainte-Chapelle is a bad meeting place because it's next to (in real life too), the Palais de Justice, a courthouse in Paris. She informs Wulfgar that Kenneth's death was a rash decision, for the police found a passport that he'd brought to Wulfgar on his person. Wulfgar also realizes he has killed one of his own, and is now facing alienation from his allies. With his identity revealed to all European authorities, Wulfgar and Shakka visit a plastic surgeon, whom changes Wulgar's appearance. After the process, the surgeon becomes a liability, and is murdered by Wulfgar, who then flees to New York City. The next day in New York, after having their undercover detail compromised by two uniformed officers, DaSilva and Fox are informed that they have been transferred from the Street Crime Unit and into a special Federal-State Unit. After a touchy moment with their ill-tempered superior, Lieutenant Munafo (Joe Spinell), they discover that their transfer orders came from the police commissioner, whom had received the orders from Washington D.C.. The fact that the two detectives served in Vietnam also play into this, making them two of the highest recommended candidates for the special unit. Anti-Terrorist Action Command (A.T.A.C.) is assembled by INTERPOL British Counter-terrorist specialist Peter Hartman (Nigel Davenport). Hartman believes Wulfgar will come to the U.S. next primarily for the press coverage. Hartman schools DaSilva, Fox and a specially selected team of New York police on Wulfgar, Shakka, and terrorism in general. But the 'shoot-to-kill' policy that Hartman encourages doesn't go down well with DeSilva who didn't join the force to kill anyone. Hartman also makes a personal comment regarding DaSilva's ex-wife (Lindsay Wagner), which causes him to leave, but opening him up to the connections of the underground New York City According to Hartman, Wulfgar wastes no time in becoming familiar with new surroundings. After completing the latter, Hartman states that Wulfgar, an aficionado for the vivid nightclub scene, will try to find safe housing for his arsenal. Sure enough, Wulfgar meets Pam (Hilary Thompson), a flight attendant, in a nightclub and moves in with her. Surprisingly enough, when she asks him what he does for a living, he tells her the complete and total truth: \"I'm an international terrorist wanted on three continents.\" She takes it as humor. That night, Wulfgar then announces his presence in New York by bombing several locations in the Wall Street area. Alone in her apartment while Wulfgar (known as 'Eric' to Pam), is away, Pam discovers his arsenal. Wulfgar kills Pam, and her death is the first break Hartman, DaSilva, and Fox get. Wulfgar has left behind a map of the Wall Street area. According to Lt. Munafo and the forencic investigators, the location that had been bombed was marked. DaSilva and Fox investigate Pam's favorite nightspots and hope to find Wulfgar at one of them. They do. But, unsure of what he looks like since the plastic surgery, they hesitate. When DaSilva calls out Wulfgar's name, a shooting spree at the disco opens, with the two cops chasing Wulfgar through the club, and to the back streets and to a local subway station on the 6th Avenue Line, where Wulfgar takes an elderly woman on the platform hostage as a human shield. DaSilva again hesitates to shoot at Wulfgar (on the risking of hitting the woman hostage) and allows Wulfgar to board the train. Neverless, DaSilva and Fox climb aboard the rear of the train and chase Wulfgar through the cars until the train stops and he jumps off. Fox catches up to him, but Wulfgar slashes Fox's face with a knife, and gets away by jumping on anther passing train as DaSilva yells and curses at him Wulfgar takes refuge in the basement apartment of a little grocery store, where it is revealed that Shakka is now in the United States to inform him that the NYPD and the United Nations delegation members have a description of him. Wulfgar tells Shakka that he is determined to find and kill the two police officers who chased him and begins to look over the files of all the A.T.A.C. police officers that the store owner brings to him. January 17. The members of A.T.A.C. is protecting a United Nations function at the Metropolitan Museum of Art that has the earmarks of a potential terrorist target. Shakka infiltrates the party in disguise. She corners Hartman on an escalator and murders him. Later that same day, Wulfgar and Shakka then hijack a Roosevelt Island Tram car carrying U.N. representatives. Fox, Munafo, and other officers hear about the hostage situation and take positions at both tram stations, while DaSilva takes off in a police helicopter to confront the stranded tram car over the East River. Wulfgar executes the wife of the French ambassador while DaSilva is watching from a hovering police helicopter as a penalty for the nightclub and subway chase. Wulfgar decides to release an infant onboard the car, and demands that DaSilva personally board the tramway to rescue it. DaSilva is winched up to the aerial tram and confronts Wulfgar face-to-face. DaSilva demands to know why Wulfgar killed the woman. \"I wanted to\", the sadist replies. However, he decides to spare his nemesis for the moment. DaSilva and the baby are lowered back down to a waiting barge. Wulfgar then makes a series of demands for the release of various terrorists in various countries as well as a bus to take him and the hostages to JFK airport where a jet will be waiting to take them out of the country, and he also asks that DaSilva drive the bus (implying that Wulfgar intends to kill DaSilva once they reach their destination). The police agree to Wulfgar's demands for a bus to escort him and the hostages to the airport. That evening at nightfall, Wulfgar and Shakka bring the tram car down to Roosevelt Island and hide among the crowd of hostages from the tram. DaSilva waits until they try to board the parked bus before making his move. He plays back a recording of Hartman's lecture in which the terrorist expert denounces Shakka. In a rage, Shakka breaks from the hostages and is gunned down by Fox and various sharpshooters. Wulfgar returns fire on the police. He escapes, driving the bus off a ramp into the East River. A search of the wreckage shows no sign of Wulfgar. Lt. Munafo leads the team where they find the store where Wulfgar has been staying and DaSilva finds that Wulfgar has gathered information on all participating members of A.T.A.C., including Fox, Hartman, and DaSilva. An address of his ex-wife, Irene is found on one of the printouts. Wulfgar makes his way to Irene's house, hides outside, and sees Irene walk up to the house and go in. He breaks in, finds her washing dishes and sneaks up behind her brandishing a knife. But DaSilva has made it to Irene's first; he turns around, wearing his ex-wife's housecoat and a blonde wig, brandishing a gun. With nowhere to go, Wulfgar lunges at DaSilva who fires his revolver twice into the terrorist, blowing him into the street. Wulfgar lays dead on the stoops of Irene's rowhouse while DaSilva sits nearby looking on as it begins to lightly snow.",
      "writers": [
         "David Shaber",
         "David Shaber"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0082817/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcyMTcwMjQ3M15BMl5BanBnXkFtZTcwMjMxMTUyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Sylvester Stallone, Rutger Hauer, Billy Dee Williams | See full cast and crew »"],
      "reviews": [
         "This Sylvester Stallone movie may be his best because, unlike most of his more famous roles over the years, this is very believable. He isn't Rambo or Rocky...just a tough New York City cop. Stallone and partner Billy Dee Williams team up in an attempt to stop a terrifying international terrorist (Rutger Hauer) before he kills more people. All three of those actors are riveting in this rough, gritty film. I thought so much of this movie that I bought it twice. The first DVD that came out was fullscreen, no stereo and grainy. Later, they issued a better widescreen print and it was worth upgrading. The movie is a top-notch thriller start-to-finish and Hauer makes an outstanding villain. It might be a cliché but this film always \"kept m on the edge of my seat. \"",
         "It was 1981 and the world had just gone through a decade of terrorism. Casting Rutger Hauer and Persis Khambatta (she was the bald woman in the original Star Trek movie) as heartlessly cold terrorists was great casting! Billy Dee Williams and Stallone as street cops suddenly transferred to a terrorist unit do a good job. Stallone had not become a parody of himself yet and his diction is better here than it had ever been up to then. The movie's pace is unrelenting. This is a movie that I almost always have to stop and watch, easily getting swiped up into the story again and again, when I see it on television. Excellent twist ending and monorail scene. Recommended highly.",
         "Remember a day when Rutger Hauer starred in good movies that actually saw wide theatrical release? No. Hmmmm. Hauer is one of my favorite actors and stars in two of my top ten favorite movies (Blade Runner and The Osterman Weekend), so it's hard not to already be slightly biased about the movie. I remember first hearing about Nighthawks on the Headliners and Legends biography of Stallone and how it was not as well received as his Rocky and First Blood movies. For shame, because Nighthawks does manage to be a top notch thriller most of the time. I could go into the plot, but I believe in telling people what I liked and disliked instead of parroting the plot details like almost every other review. (See, a movie to me is more fun when I only know a little about the story, instead of the first hour or so, because someone felt that they had to readers digest the entire film.) Anyway, now that I've ranted, I have to admit that I enjoyed it for the most part, with the exception of the initial pacing. It continues to drag in places towards the middle, and takes a little over an hour to set up the crucial players backgrounds. The only real problem is that every time the film stops to focus on DeSilva (Stallone) and Fox (Williams), it spends twice as much time focusing on Wulfgar. Wulfgar is certainly a well crafted maniac, but when the movie is over we know almost nothing about Fox and only a little about Dee DeSilva. Still, the movie does succeed in making you care about our two main characters, by thrusting them into danger and having them do what is morally right (i.e. Towards the beginning of the film the two are in a drug raid, and refuse to take bribes from the perps who had apparently already paid off the cops from the first raid on their operation. They're good cops, and it's their good guy image that endears them). I guess it would have been nice also to see a little more of Stallones relation to what's her name. (sorry, I haven't seen this in a about a month now.) I was interested in the prospect of a hero who was torn between the relation with his ex (who he was trying to re-ignite the flame with), and his duty. But, alas, she was just a narrative device who the writers have decided is only important in the last 15 minutes or so. With all these cons, why did I still like it? Sudden scenes of high impact, good cast and acting all around, a villain who wasn't just a cardboard cutout, and Stallone's bitchin' beard, and a wholly convincing scenario. The bottom line: This film is more akin to The French Connection than it is to Rocky. Methodical and often stylish, NightHawks deserves to at least be rented and watched with an open mind. 8 Stars out of 10",
         "Wulfgar (Rutger Hauer) is an international terrorist not to be taken lightly\u0085 He is wanted by half the countries in Europe\u0085 He is currently financed by no one... He becomes trapped as 'Persona Non Grata'\u0085 Wulfgar manages to succeed where others have failed\u0085 His pattern is the instilling of fear\u0085 He makes female contacts to establish safe housing for his armory\u0085 He always covers a woman who is clean... He loses one, he finds another... He has a liking for fancy food, expensive clothes and the most varied nightlife\u0085 Wulfgar doesn't think like a criminal\u0085 He wants to be a hero\u0085 Since the London incidents, he wants to prove himself as invincible as he ever was\u0085 So he decides to change his look, and strikes without warning... Wulfgar's associate is Shakka Holland (Persis Khambatta), a pretty cool woman, with no maternal instincts, who murders without apparent provocation\u0085 DaSilva (Sylvester Stallone) wants to treat Wulfgar like 'some mugger' on the streets\u0085 He makes a mistake when he finds himself unexpectedly facing the malevolent killer... He refuses to act in the same ruthlessness Wulfgar does, and to use deadly force in defense of the lives of innocent hostages\u0085 He hesitates to shoot and kill\u0085 DaSilva rejected to pay attention to the impact of the terrorist's actions on his thinking and beliefs\u0085 This mistake enables the best policeman to meet the dangerous terrorist on equal terms\u0085 'Nighthawks' turns out to be surprisingly interesting\u0085 Rutger Hauer easily holds our attention throughout the film\u0085 He is a disciplined terrorist indifferent to his victims, cold and calculating\u0085 His mission to harm the enemy transcends any concern about his victims\u0085 For Wulfgar, the end justifies the means... Stallone and Billy Dee Williams make good partners\u0085 Stallone doesn't play his usual character, the ruthless policeman who combats violence with greater violence\u0085 He seems to be more human desperately trying to do the right thing at the right time\u0085",
         "This is one of the best action movies out there, even to this day. It's a must see especially for Stallone fans. If he chose more of this type of movie, he would be much more respected in Hollywood. Rutger Hauer is awesome as Wulfgar, the international terrorist. All performances are notable, Billy Dee Williams/Sylvester Stallone pairing works well. Stallone really is a great actor, given the right material, and this one certainly provides it. It's a shame he sold out with the \"Rocky\" sequels.",
         "I was happy to see Premiere magazine remember this flick when they ranked the 100 Best Thrillers of All Time, and after reading today that its director has passed on, I can only hope more people will give it a first or second look. Time has of course given it extra relevance, but there are three reasons for checking this one out: 1. As hinted above, in the post-9/11 world, its theme of terrorists plotting an attack in New York City seems eerily prophetic. 2. Sylvester Stallone gives an uncharacteristically muted performance that comes off as extremely effective. 3. That ending? They got me. They totally got me. Director Bruce Malmuth's work here was competent enough to make one wonder just a little if he didn't deserve better projects than he got after this.",
         "Long before terrorism was on the minds of most Americans, NIGHTHAWKS tackled the thorny topic. Sylvester Stallone and Billy Dee Williams are decoy cops -- that is, they venture into rough neighborhoods to bait muggers and other forms of scum -- assigned to track down the cold and calculating Rutger Hauer. It seems the devious mastermind has landed in the media capital of the world, New York City, to try and regain his place among the terrorist elite. Although it's a fairly decent action/suspense effort, NIGHTHAWKS is difficult to recommend unconditionally. The performances are certainly solid; in fact, it's hard to remember Stallone, here sporting a thin beard, being so effective outside of boxing trunks. The action is crisp and exhilarating, with one pursuit through subterranean New York deserving of a place in the Chase Hall of Fame. The story is original and much of the plot intriguing. And Hauer, in his American film debut, is a suitably hateful villain, with his motives all to familiar to contemporary audiences. Yet NIGHTHAWKS is not quite as good as the sum of its parts. Even though the film starts out with a bang -- literally -- there's somehow too much build-up and not enough execution. The movie has not aged particularly well, and despite its 1981 release date has the feel of a '70s period piece. And as good as Hauer is, his character is a little too incredible to believe as he pulls off massive acts of terror with little or no sponsorship; what should take a team of experts is accomplished by one man wanted by countless law enforcement agencies. In the end, NIGHTHAWKS is a movie you're bound to like -- either a little bit or a lot. Considering the high ratio of garbage that has and will continue to spew out of Hollywood, I guess that's not such a bad thing.",
         "One of the most underrated movies of the eighties. I couldn't figure out why this was so dissed by the critics and the public in the early eighties. Was it because people were not ready to embrace the thought of international terrorism in their front yard? I think so. This is one of Sylvester Stallone's forgotten movies where he reminds you of Al Pacino as Serpico at times with his benevolent nature and the facial hair. He doesn't slur his monosyllabic sentences, or act as if he has lost more IQ points. Until this film came out, I didn't think there was much more to Stallone. Sadly, I was too young to see this all by myself in the theatres and saw it a year later on cable. And when I saw Rutger Hauer, I was amazed at how creepy the man was! He was born for the role, but unfortunately, Hauer doesn't seem to play good guys as well. Whenever I see him, this is the first film I think of. \"Blade Runner\"'s the second. Billy Dee Williams's character was bland that I didn't find myself rooting for nor hating him. Lindsay Wagner is expendable and I wish the late Persis Khambatta was able to stretch her role a little more. She was Hauer's perfect, plausible counterpart (and spoke some wicked French and German). Nigel Davenport is the typical foreign expert on the subject that gives the film an interesting transatlantic angle. I found myself bored by the end of the first forty-five minutes, until the montage of Stallone and Williams looking for clues to the dead flight attendant at the various discoteques. And then when this movie came on TV, they changed the two songs in the disco: \"Brown Sugar\" from the Stones and \"I'm a Man\" from Keith Emerson to seventies stock tunes. Must of been a lawsuit pending. Suffice the music, there is a brutal, ten-minute-long chase through subway tunnels, a station, and then on the train itself. Afterwards, there's some downtime, but Wulfgar (Hauer) is at the point of no return now that the po-po has a physical description of him. So much for the plastic surgery. You can now sense the desperation he has, and he already knows he's not going to get a happy ending so that's why he decides to air-out Stallone's ex-wife (played by Wagner in two or three brief snippets). So you know that he's gonna lose, it's just HOW he is going to lose makes you watch the rest of it. You can also see that Stallone's character struggles with himself on how he'd rather bring Wulfgar in than kill the terrorist (he's got those law-enforcing ideology and beliefs going on overtime). But the problem about this film is that it is so dated and by-the-numbers judging from today's standards, that it's almost a flat-out documentary. The formula is typical seventies where the exposition is gradually set up until the middle of the film- and by then the viewer is bored- but the action and suspense takes place throughout the rest (you'll notice from the \"Dirty Harry\", \"Rocky\", and \"Star Wars\" movies, the later \"Indiana Jones\" flicks, along with \"Serpico\", \"The French Connection\", etc). However, \"Nighthawks\" was clearly ahead of its time, and I could see a remake or something like this being done down the road from now. See, NOW it might sell because we've seen it in our own front yard. Get Vin Diesel to play Stallone's role; Tyrese Gibson to play Billy Dee Williams; Lindsay Wagner's character's axed; Cillian Murphy will be Rutger Hauer; Clive Owen can play Nigel Davenport's role; Milla Jovovich can be Shakka, and Michael Clarke Duncan will play their Lieutenant. But leave in the \"I do not enjoy killing, but it's my job\"-line. Still good for its time !",
         "Finally, Sly Stallone stars in a film that he really deserves to appear in! He and Billy Dee Williams make a great team as two no-nonsense New York cops who chase Rutger Hauer, who has a great role as a remorseless terrorist (then again, no terrorist has a heart of gold!) Though he's totally unrecognizable with a long beard, Stallone does an exceptionally good performance because unlike his other cop roles, such as Ray Tango from \"Tango and Cash\", Sly doesn't portray a cocky character, which makes it very realistic. However, our hero doesn't show his muscles in this flick, but, it proves that you don't have to be brawny to be a tough guy. Hauer is also perfect, playing what he does best, an oily villian. He might look very suave at first in this film, but when he shows his true colors, you better watch out. Last but not least is Billy Dee Williams, who does a cool Roger Murtaughesque cop who relies on his partner Sly to do the job. If you're in the mood for suspense and good chase scenes, \"Nighthawks\" is your gameplan. Look out for the great conclusion. It might cause you a great deal of shock!",
         "The movie starts well and promising. Initionally the movie seems like a cool, simple, typical '80's action flick, with some well known actors in it. However as the movie progresses the pace is gone and the movie gets filled with underdeveloped plot lines and characters. Luckily the movie re-finds its pace toward the ending, which helps to make this movie still a watchable and good one, for the genre-fans. I think that the main problem with this movie is that its too short. Because of this nothing in the movie really fully gets developed, such as Sylvester Stallone's character's relationship with his ex-wife or who exactly was Peter Hartman, who seemed like a good and interesting enough character but unfortunately was highly underused and developed in the movie. He walked around without a real purpose despite the fact that he could had been a so much more relevant and interesting character for the movie and its story. Also they could had made the whole hunt of DaSilva (Sylvester Stallone) on Wulfgar (Rutger Hauer) so much more exciting, tense and spectacular. An hunter who hunts a hunter. Instead now their hate toward each other feels unfounded and perhaps even silly and unlikely at certain moments. Yet the tree main characters of the movie are still quite good. The two cops played by Sylvester Stallone and Billy Dee Williams form a nice and credible duo and Rutger Hauer perfectly plays a villainous cold-hearted terrorist. Hollywood needs more villain actors like him, it would make so many movies so much better. Its definitely true that the presence of this tree fine actors uplift the movie and help to make this a still slightly above average one. The whole plot line of a ruthless, professional terrorist causing mayhem in New York is quite original (at least for its period) and works refreshing and help to make this movie quite an original action-flick, although his motivations still remain a bit in the dark and shaky to find it all credible enough. But of course the movie works well enough as mindless entertainment, though it perhaps could had used some more and bigger action sequences. The movie has '80's written all over it. Movies from the '80's don't have the greatest visual style and also mostly always have some horrible '80's music. This movie is unfortunately no exception on this all. All in all its not a bad action flick and it will most likely please the genre-fans, also thanks to the presence of '80's action icon Sylverst Stallone and villain expert actor Rutger Hauer. 6/10 http://bobafett1138.blogspot.com/"
      ],
      "genres": [
         "Action",
         "Crime",
         "Thriller"
      ],
      "productionCompanies": [
         "Universal Pictures",
         "Herb Nanas Productions",
         "Layton Productions"
      ],
      "summaries": [
         "Deke DaSilva and Matthew Fox are two New York cops who get transferred to an elite anti-terrorism squad. About this same time, an infamous international terrorist shows up in New York looking to cause some chaos. It's up to DaSilva and Fox to stop him, but will they be in time...?",
         "New York cop Deke DaSilva loves his job on the decoy squad so much he has several times forgone promotion. So when he and his partner are assigned to a new anti-terrorist unit he is pretty hostile to the idea. The unit is run by a British expert who suspects a major terrorist is in town. His message is shoot to kill, which makes DaSilva even unhappier. But when bombs start going off he thinks again.",
         "Wulfgar a terrorist, who has been plaguing Europe, is now in the U.S. A British counter terrorism expert arrives in New York to help and he chooses Detectives from the NYPD to train on how to deal with Wulfgar. Among the ones he chooses is Deke De Silva, a veteran cop, who doesn't he think he is suited for the job. But tries to do the best he can. Eventually he comes face to face with Wulfgar and hesitates shooting him despite being told that he should shoot him if he has the chance, which not only allows him to escape but to injure his partner. Wulfgar now has his sights set on him as well as his other targets. DeSilva can now only wait for Wulfgar to make his next move.",
         "Conservative street cop DaSilva reluctantly agrees to terminate an international terrorist who has demanded media attention. But DaSilva's \"at-home\" tactics are very much put to the challenge."
      ],
      "budget": 5000000
   },
   "movielensId": 3029,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1981-03-17",
      "dvdReleaseDate": "1999-10-19",
      "directors": ["Bruce Malmuth"],
      "runtime": 99,
      "movieId": 3029,
      "title": "Nighthawks",
      "mpaa": "",
      "actors": [
         "Sylvester Stallone",
         "Rutger Hauer",
         "Billy Dee Williams",
         "Lindsay Wagner",
         "Persis Khambatta",
         "Nigel Davenport",
         "Hilary Thompson",
         "Joe Spinell",
         "Walter Mathews",
         "E. Brian Dean",
         "Sue Vanner",
         "Gerard Murphy"
      ],
      "imdbMovieId": "0082817",
      "originalTitle": "Nighthawks",
      "genres": [
         "Action",
         "Crime",
         "Thriller"
      ],
      "youtubeTrailerIds": ["cnvbtAoucPU"],
      "plotSummary": "An international terrorist has New York in a grip of panic and it's up to Det. Sgt. Deke DaSilva to take him down.",
      "tmdbMovieId": 21610,
      "avgRating": 3.07242,
      "releaseYear": "1981",
      "numRatings": 863,
      "posterPath": "/sjmTgH0Ye1cbBoaLCKJNt3LmasJ.jpg"
   }
}