{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "gunslinger",
            "id": 75
         },
         {
            "name": "revenge",
            "id": 9748
         },
         {
            "name": "prairie",
            "id": 9930
         },
         {
            "name": "shootout",
            "id": 10950
         },
         {
            "name": "pistol",
            "id": 13132
         }
      ],
      "imdb_id": "tt0114214",
      "video": false,
      "title": "The Quick and the Dead",
      "recommendations": [
         9359,
         2142,
         11967,
         9208,
         11969,
         4824,
         3595,
         10003,
         10303,
         9386,
         12160,
         9869,
         11412,
         9691,
         9319,
         2112,
         9604,
         8688,
         9292,
         11808
      ],
      "backdrop_path": "/e4GosmnUbvEGVINl3BC5vc7fIhU.jpg",
      "revenue": 18552460,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 11,
               "character": "Ellen \"The Lady“",
               "gender": 1,
               "credit_id": "52fe44b69251416c7503e59b",
               "name": "Sharon Stone",
               "profile_path": "/n28skoawvqAymYr6gRSm2pfro0i.jpg",
               "id": 4430,
               "order": 0
            },
            {
               "cast_id": 12,
               "character": "John Herod",
               "gender": 2,
               "credit_id": "52fe44b69251416c7503e59f",
               "name": "Gene Hackman",
               "profile_path": "/qEKcmwc1XstymEniGuCs3KIsGfP.jpg",
               "id": 193,
               "order": 1
            },
            {
               "cast_id": 13,
               "character": "Cort",
               "gender": 2,
               "credit_id": "52fe44b69251416c7503e5a3",
               "name": "Russell Crowe",
               "profile_path": "/ktuOAyUHM2u2YPPChH8gAArxJ7b.jpg",
               "id": 934,
               "order": 2
            },
            {
               "cast_id": 14,
               "character": "Fee Herod \"The Kid“",
               "gender": 2,
               "credit_id": "52fe44b69251416c7503e5a7",
               "name": "Leonardo DiCaprio",
               "profile_path": "/A85WIRIKVsD2DeUSc8wQ4fOKc4e.jpg",
               "id": 6193,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Dog Kelly",
               "gender": 2,
               "credit_id": "52fe44b69251416c7503e5ab",
               "name": "Tobin Bell",
               "profile_path": "/vbu4iHKY46zJ6K8B5jGJxB1ffp4.jpg",
               "id": 2144,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Doc Wallace",
               "gender": 2,
               "credit_id": "52fe44b69251416c7503e5af",
               "name": "Roberts Blossom",
               "profile_path": "/iNW74OJWcF9LRbeRlsOPZBddVeE.jpg",
               "id": 66288,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Eugene Dred",
               "gender": 2,
               "credit_id": "52fe44b69251416c7503e5b3",
               "name": "Kevin Conway",
               "profile_path": "/803hyktASensafHsdvDCnlzWK8k.jpg",
               "id": 27116,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Sgt. Cantrell",
               "gender": 2,
               "credit_id": "52fe44b69251416c7503e5b7",
               "name": "Keith David",
               "profile_path": "/nwAC9TgwRkj0Ritq93O8GeublyL.jpg",
               "id": 65827,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Ace Hanlon",
               "gender": 2,
               "credit_id": "52fe44b69251416c7503e5bb",
               "name": "Lance Henriksen",
               "profile_path": "/wf4Pr9RxsHGd0O9fLPiB3Al8IVC.jpg",
               "id": 2714,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Horace",
               "gender": 2,
               "credit_id": "52fe44b69251416c7503e5bf",
               "name": "Pat Hingle",
               "profile_path": "/bW8alHCKEK0UOJjoZwjwwH7T0ga.jpg",
               "id": 3798,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "Marshall",
               "gender": 2,
               "credit_id": "52fe44b69251416c7503e5c3",
               "name": "Gary Sinise",
               "profile_path": "/n5AbjoNfONICaggp2f1QhYAjAoZ.jpg",
               "id": 33,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "Scars",
               "gender": 2,
               "credit_id": "52fe44b69251416c7503e5c7",
               "name": "Mark Boone Junior",
               "profile_path": "/riibKDljUzdSfIZygymhKx9yNPx.jpg",
               "id": 534,
               "order": 11
            },
            {
               "cast_id": 23,
               "character": "Katie",
               "gender": 1,
               "credit_id": "52fe44b69251416c7503e5cb",
               "name": "Olivia Burnette",
               "profile_path": "/cn8n42CWGUSBI1NNiarVIP9Lyr6.jpg",
               "id": 27261,
               "order": 12
            },
            {
               "cast_id": 24,
               "character": "Mattie Silk",
               "gender": 1,
               "credit_id": "52fe44b69251416c7503e5cf",
               "name": "Fay Masterson",
               "profile_path": "/rjNb7ZDq00KqhFHwuinSge5Iv8i.jpg",
               "id": 65409,
               "order": 13
            },
            {
               "cast_id": 25,
               "character": "Ratsy",
               "gender": 2,
               "credit_id": "52fe44b69251416c7503e5d3",
               "name": "Raynor Scheine",
               "profile_path": "/o5jW5NDeFPIyETEVJQItQEqmJcx.jpg",
               "id": 21082,
               "order": 14
            },
            {
               "cast_id": 26,
               "character": "Charlie Moonlight",
               "gender": 2,
               "credit_id": "5510d7bbc3a36802c3000927",
               "name": "Woody Strode",
               "profile_path": "/hL6mQBnCxBxhUeG5rjx9SfO7AXM.jpg",
               "id": 4963,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44b69251416c7503e561",
               "name": "Sam Raimi",
               "profile_path": "/uEAaCUJzyMI8N5mOVyLtaOPKoEf.jpg",
               "id": 7623,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44b69251416c7503e567",
               "name": "Simon Moore",
               "profile_path": null,
               "id": 21705,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44b69251416c7503e56d",
               "name": "Joshua Donen",
               "profile_path": null,
               "id": 71262,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44b69251416c7503e573",
               "name": "Toby Jaffe",
               "profile_path": null,
               "id": 59920,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44b69251416c7503e579",
               "name": "Patrick Markey",
               "profile_path": null,
               "id": 4146,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44b69251416c7503e57f",
               "name": "Allen Shapiro",
               "profile_path": null,
               "id": 57439,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44b69251416c7503e585",
               "name": "Robert Tapert",
               "profile_path": "/vFKPuVMuMykvXJTd5zT3RfG46CX.jpg",
               "id": 11359,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44b69251416c7503e58b",
               "name": "Alan Silvestri",
               "profile_path": "/chEsfnDEtRmv1bfOaNAoVEzhCc6.jpg",
               "id": 37,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe44b69251416c7503e591",
               "name": "Dante Spinotti",
               "profile_path": "/vIb3GU52BvSIQh1MXZRFDVRnqsm.jpg",
               "id": 11099,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44b69251416c7503e597",
               "name": "Pietro Scalia",
               "profile_path": "/kcQTeWNVqDg0h1jzthF21TxRB9U.jpg",
               "id": 950,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Western",
            "id": 37
         }
      ],
      "popularity": 10.701436,
      "production_countries": [
         {
            "iso_3166_1": "JP",
            "name": "Japan"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 12106,
      "vote_count": 539,
      "budget": 32000000,
      "overview": "A mysterious woman comes to compete in a quick-draw elimination tournament, in a town taken over by a notorious gunman.",
      "similar": [
         281957,
         27576,
         8068,
         8456,
         562,
         156022,
         395834,
         445954,
         26789,
         6312,
         9739,
         1266,
         8292,
         23587,
         40805,
         223485,
         3134,
         979,
         281,
         238636
      ],
      "original_title": "The Quick and the Dead",
      "runtime": 107,
      "poster_path": "/50ZzhAMO6nunlCp7FrGj7VoLxJV.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/rzgMLzPgJ2ZBYnlVwNi8ZDfOMwo.png",
         "name": "TriStar Pictures",
         "id": 559,
         "origin_country": ""
      }],
      "release_date": "1995-02-09",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "Think you are quick enough?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Sam Raimi"],
      "runtime": 107,
      "synopsis": null,
      "writers": ["Simon Moore"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0114214/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcxNTA4MjQ4NF5BMl5BanBnXkFtZTcwMzM2OTkxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Sharon Stone, Gene Hackman, Russell Crowe | See full cast and crew »"],
      "reviews": [
         "In the Western town of Redemption John Herrod runs everything, they say he gets half of every dollar spent or earned. In order to face his enemies face on he runs an annual quick draw contest where fights battle each other until only one remains. The winner takes home a small fortune \u0096 the losers leave wounded if they are lucky. Into this contest comes a group of hopefuls including a woman who has personal reasons for signing up. Looking at the list of names it is evident that the casting director is very good at his/her job as they managed to catch several big names, get several stars who were a few years away from hitting big and also get veteran faces as well. The ensemble of well known faces suits this film as the focus is very much on style and appearance than it is on substance. As a plot it takes the well known genre of the revenge western and makes a sort of pastiche of it. Thus we have the OTT and hyper direction of Rami and gun fights that are delivered with energy and shots that have no bearing to reality. When I think about the actual plot, it really should bother me more than it does. The plot is pretty thin and contains nothing that you can't see coming from about the first 20 minutes of the film \u0096 certainly the woman's `secret' will be no mystery to anyone who has seen `Once Upon A Time In The West' which it clearly apes in this regard. What exists in the place of a wider plot is characters and style. The style is fun and energetic and will appeal to fans of Evil Dead etc. The characters themselves are also pretty good, each has a little back story which helps to fill out the running time without getting too serious. Stone does surprisingly well in the lead, she's no Clint Eastwood but she leads the cast well \u0096 which is no mean feat when you look at the credits. Hackman is a gleefully good villain \u0096 even more mean and unrepentant that his character in Unforgiven. Crowe and DiCaprio were both a few years from the levels of stardom they now hold, but both are engaging and enjoyable. The support cast is also full of names and faces you'll recognise \u0096 either as solid support actors of recent films or older faces. For example \u0096 Henriksen, David, Sinise, Hingle, Bell and Blossom. Overall this film might infuriate you if you are looking for a film that has more substance than style, as this is the other way round. However fans of Rami's style and/or revenge westerns will find much to enjoy here. Every time I see it I always find it hard not to get caught up in the atmosphere it creates.",
         "This movie uses lot's of ingredients used in classic westerns. It does it in a fun way but it doesn't spoof the classic westerns in any way and it never becomes humorous or a parody that makes fun of the genre. Who would have known, Sharon Stone is a believable cowgirl. I think it's fair for me to say that she's the best I have seen in a western. The movie also features both Russell Crow and Leonardo DiCaprio before their days of fame and big Dollars. It's always fun and great to have Gene Hackman in a villain role and he makes this movie an even more pleasant watch. The movie features lot's of other fun and stereotype western characters. The settings and costumes are great and real western like and help to create the right atmosphere for the movie. The great western score is by Alan Silvestri and fits the movie well, even though the score goes a bit too much \"Back to the Future\" like at times. The movie is filled with some unusual but great Sam Raimi like cinematography and tricks. Just enjoy and don't pay attention to the story. It is just simple entertainment! 8/10 http://bobafett1138.blogspot.com/",
         "Like all of Sam Raimi's movies, this flick was a cartoon. That's not an insult- his works with the Coen brothers on movies like The Hudsucker Proxy are some of my favorites, with their insanely \"zoomed-in\" quality. This movie was a spaghetti western, it was ABOUT spaghetti westerns, and it was also a weird, wonderful nightmare where your options are limited, you're a superhero, and your enemy is all-powerful. That's adolescent, silly, and totally compelling. Raimi has always done brilliant visuals; I don't know his history, but I suspect he read a lot of pulp comics as a kid. The early scene where Stone gets up (after playing dead) and you see her shadow putting her hat back on, with the obvious bullet hole in the brim, is sheer visual brilliance. Gene Hackman is, of course, great (MST3K line: \"He's good in everything!\"). Sharon Stone has gotten a lot of static for doing what Clint Eastwood built a legend on: bad acting, done intensely. (And in Stone's case in this flick, I think, purposefully.) Leonardo D. is well-cast as a cocky, yet needy, \"bad-a** in his own mind\" type. Russell Crowe (who nobody knew at the time, especially me) is great in his role as a survivor of a 12-step program to help fight a dependence on violence, complete with backsliding moments. Do not look to this movie expecting anything like realism, believability, or moderation. This is pulp fiction, eye candy, nightmare surrealism, wanton entertainment. It's trash culture saluting trash culture, and if you can appreciate that, it's a hell of a great ride.",
         "Sharon Stone is another gun in the old West town\u0085 It seems that she is here to pay off an old score that has haunted her since she was a child\u0085 She becomes swept up in a deadly quick-draw contest where anybody can challenge anybody in the windy dusty streets\u0085 The fighters must not draw until the clock makes the first chime of the hour\u0085 Whoever is standing after the draw is the winner\u0085 The prize is $123,000\u0085 The lawless town of Redemption is ruled by a despicable ironfisted gunman called John Herod who takes a lot to scare him\u0085 Hackman plays pretty well the kind people hate\u0085 He is, here, a fearless, sadistic, cold-blooded killer in charge of everything, who decides who lives or who dies\u0085 Herod wants a preacher in the tournament \u0096 even if he has to beat, kick, and knock him to the ground to force him back into it\u0085 Cort\u0097 humiliated and chained out by the fountain\u0097used to be pretty fast, faster than Herod\u0085 But now he wouldn't hurt a fly\u0085 He is a man of peace who has renounced violence\u0085 Years ago he was an outlaw\u0085 In fact, he was only a kid when he hitched up with Herod\u0085 He singled him out because he was a little smarter, a little faster than most\u0085 Now, he must revert to his former believes to survive\u0085 As Cort, Russell Crowe is saintly when compared to the movie's real villain\u0085 Cort tries to redeem himself, but gets enticed into the killing by Herod who is trying to prove that he's a fraud... Several other men were just running a little errand for Herod\u0085 But Herod made an example of them all: the buffoon card shark (Lance Henriksen); the hired gun moseying into town to kill (Keith David); the teenager gunslinger who thinks he is on a different level (Leonardo DiCaprio). Raimi succeeds through his shots of each gunfighter to show the worried and scared faces of each gunfighter, the clock counting away the time, and Herod's magnified evil smile\u0085",
         "With The Quick and the Dead, Sam Raimi approaches the old west with a very new/contemporary style. With its brisk energy and competitive characters, the story often feels like a sports movie with lots of photography tricks. If you want a top western, this might not be your film, but if what you seek you is good old pistol-whippin' American fun, this might do the trick. Thanks to James Cameron, since T2, there has been nothing sexier than a woman with a gun. Sharon Stone actually brings a fairly macho 'Sarah Conner' quality to her character. She plays Ellen, a young cowgirl who rides into a mysterious town for a very special event, a gunslinging competition. The mayor of the town is a dangerous fella and one of the most feared gunslingers around. It is this man who Ellen is after. The question is, why? In order to fight him, she must beat everyone else in the competition. There will be blood, for sure. In order to make up for his superficial plot, Sam Raimi has a lot of tricks up his sleeve. One of his most recognizable through his career is going over the top in an amusing way, which he does here too, mostly at the climax. He doesn't make great movies, but he makes clever and entertaining ones, which this is.",
         "\"The Quick and the Dead\" is a \"splatter Western,\" directed by horror vet Sam Raimi (whose latest, as of this writing, is \"Spider-Man,\" but who cut his teeth on the \"Evil Dead\" trilogy). It's set in the oh-so-ironically named lawless town of Redemption, a haven of grotesques that gives us an idea what the wild West would've looked like if had been painted, not by Frederic Remington, but by Heironymus Bosch. In a surfeit of Biblical nomenclature, the town's mayor/owner/capo is named Herod (Gene Hackman at his oiliest, complete with bad hair). Into town there rides a mysterious stranger, not Clint Eastwood this time but Sharon Stone. I'm not the world's biggest Stone fan, but this movie and \"Total Recall\" indicate that she has her uses in kick-butt action roles that make no demands on her limited thespianic skills. As gunslinger Ellen, she's doubly armed--with a six-shooter, and with an axe to grind; even her \"inner child\" packs a gun. She enters Herod's to-the-death fast-draw tournament, a no-win, no-exit, potentially no-survivors affair, with an agenda on her mind other than just winning the prize money. This is an overripe, over-wrought movie, but it mostly works. Raimi all but erases the slim wall between the horror and Western genres: Redemption is another Transylvanian village of simple peasants lorded over by by an evil baron, and the atmosphere--palpably oppressive and claustrophobic--could be cut with a knife. Leonardo di Caprio and veteran character actors Lance Henriksen and Roberts Blossom effectively round out the cast, and the action scenes--exaggerated, mythic, often darkly humorous--deliver. If you're more of a horror fan than a Western fan, this may be the Western for you.",
         "The first thing to say about this film is that the cast is an all-star one: Sharon Stone, Gene Hackman, Russell Crowe, Leonardo DiCaprio, and Gary Sinise in a bit part. Each of the characters, even Hackman's villain Herod, is so likeable and charismatic that you can't help but feeling sad that a good portion of them will be killed. There is some spectacular cinematography and creatively conceived shots from director Sam Raimi and his team. A particularly memorable shot is the one of the sunlight shining through the bullet hole of the victim's head. In my opinion the two drawbacks of The Quick and the Dead are the thin plot and the relative scarcity of dialogue. With a cast like this it's a bit of a shame that it is underutilized. Still this film provides a solid hour and a half or so of entertainment, 7.5/10.",
         "Take a typical western motif and mix it with a huge cast of recognizable faces and you have this genre throwback. Including Sharon Stone doing her take on 'the lady with no name'. With a dark past, she comes into a town gone straight to hell that's run by a nasty outlaw played by Hackman who usurps his power over the townsfolk that equally hate and fear him. It's here where these characters meet for the town's last man standing duel. Where the prize is to die for and of course many will before it's all over. I really gotta talk about the cast compliment. It's the meal ticket. Sharon Stone and Gene Hackman I've already mentioned, but also Russell Crowe and Leonard Dicaprio (both before stardom), Lance Henriksen, Pat Hingle, Gary Sinise, Keith David and a bunch of other bit players you'll probably recognize too. Stone's got her role down pat. Gene Hackman does justice to his mean embittered role almost relishing it. Russell Crowe shows a glimmer of what's to come from him although his character isn't that deep. Lance Henriksen as the slick gunfighter Ace Hanlon is a treat while Dicaprio is given a pretty straight laced role while not restricting doesn't allow him much place to go. I don't think its unfair to say the story is rather predictable, but it's still worth tuning in for. For no other reason - let's be honest - the gun battles. The showdowns. Yes characters and a story go along way, but you want to see people get kablamed too. On that angle this movie performs nicely with fine camera work and direction by Sam Raimi of all people. Using a large town clock with a big 'ol wooden pair of hands that creak when they move was a masterful touch. It's first and foremost action that wins out, but contains enough goings on in the thinking department to be satisfactory. With subplots ranging from hidden agendas, broken pasts and character morality. Some are there to win the trunk load of money, others are there cause they've got nothing to lose. Some are there to prove themselves. May it be to others or to themselves. Gritty, yet slick, satisfying to a classic western fan, 'The Quick and the Dead' is a modern slice of spaghetti bravado.",
         "This film is hilarious. If you found it unintentionally funny, you probably haven't seen enough westerns. Spaghetti westerns were all about modern parallels. They were \"post-modern\". Raimi has gone one better and made a satirical pastiche of every western there ever was. Sharon Stone as the 90's feminist gunslinger was an hysterical joke that seemed to go over everyone's head. All of the performances in the film are highly referential and brilliantly pulled off, especially Gene Hackman. Leonardo DiCaprio sticks out as undisciplined. If the film has a fault it's that it's too smart. It's a testament to miss Stone's legendary I.Q. I guess, as she is one of the producers as well. Even if it's too \"wierd\" for some commercial-minded viewers, there's no denying that the film is beautifully shot and fun to watch. 10 out of 10.",
         "Like the western \"Wild Bill\" that also came out around this time, this is a pretty wild, almost cartoon-like western. It has many pluses and minuses. GOOD - Great sound, interesting camera angles and very stylishly shot. The visuals and audio make it interesting alone. Add a simple but interesting story filled with wild cartoon-like characters and you have a fun, fast-moving film. Western purists will hate the movie because it's filled with over-the-top characters. The most interesting, I thought, was Gene Hackman as the villain and Russell Crowe as the good-guy \"preacher\" named \"Cort.\" Sharon Stone's character, \"Ellen,\" is very reminiscent of the one she played in \"The Specialist,\" a movie which came out the previous year in which - as in this movie - revenge is her main motive. BAD - This is only bad if you are religiously-inclined. The \"preacher\" in here is questionable as such. No real preacher uses the Lord's name in vain which Crowe did twice here. His theology also is not Biblically, more like clueless Hollywood stereotypes. Also, there was a bit too much of the feminist slant in here. Then again, since Stone co-produced the film, it's not surprising. Actually, her character - especially when she begins to soften a bit - is interesting, too. OVERALL - Despite the usual bias, the movie is fun to watch and entertaining."
      ],
      "genres": [
         "Action",
         "Thriller",
         "Western"
      ],
      "productionCompanies": [
         "TriStar Pictures",
         "Japan Satellite Broadcasting (JBS)",
         "IndieProd Company Productions"
      ],
      "summaries": [
         "Ellen, an unknown female gunslinger rides into a small, dingy and depressing prairie town with a secret as to her reason for showing up. Shortly after her arrival, a local preacher, Cort, is thrown through the saloon doors while townfolk are signing up for a gun competition. The pot is a huge sum of money and the only rule: that you follow the rules of the man that set up the contest, Herod. Herod is also the owner, leader, and \"ruler\" of the town. Seems he's arranged this little gun-show-off so that the preacher (who use to be an outlaw and rode with Herod) will have to fight again. Cort refuses to ever use a gun to kill again and Herod, acknowledging Cort as one of the best, is determined to alter this line of thinking ... even if it gets someone killed ...",
         "The blonde stranger riding into town isn't Clint, it's Stone. She's tough (can fist fight with the best of them), and an accurate and fast gun. There's a gunfighting competition in town. The quick and the brave sign up. The prize is a huge pot of money, but not everyone is in it for the riches, some seek revenge, others respect, but only one can win. Oh, did I mention the local bad guy who runs the town as well as the competition.",
         "The story focuses on 'The Lady', a gunfighter visiting the town of her father's killer, John Herod. At the time of her visit, a contest is being held. A contest of dueling. She joins, thinking it will help her get vengeance, and meets former henchman for Herod, Cort, and Herod's son, 'The Kid'.",
         "Lady avenger returns to western town owned by a ruthless gunslinger hosting an elimination tournament."
      ],
      "budget": 32000000
   },
   "movielensId": 303,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-02-09",
      "dvdReleaseDate": "1998-09-29",
      "directors": ["Sam Raimi"],
      "runtime": 107,
      "movieId": 303,
      "title": "The Quick and the Dead",
      "mpaa": "R",
      "actors": [
         "Sharon Stone",
         "Gene Hackman",
         "Russell Crowe",
         "Leonardo DiCaprio",
         "Tobin Bell",
         "Roberts Blossom",
         "Kevin Conway",
         "Keith David",
         "Lance Henriksen",
         "Pat Hingle",
         "Gary Sinise",
         "Mark Boone Junior",
         "Olivia Burnette",
         "Fay Masterson",
         "Raynor Scheine",
         "Woody Strode"
      ],
      "imdbMovieId": "0114214",
      "originalTitle": "The Quick and the Dead",
      "genres": [
         "Action",
         "Western"
      ],
      "youtubeTrailerIds": ["NfRrEUz62Lw"],
      "plotSummary": "A mysterious woman comes to compete in a quick-draw elimination tournament, in a town taken over by a notorious gunman.",
      "tmdbMovieId": 12106,
      "avgRating": 3.04079,
      "releaseYear": "1995",
      "numRatings": 7870,
      "posterPath": "/50ZzhAMO6nunlCp7FrGj7VoLxJV.jpg"
   }
}