{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "exorcism",
            "id": 2626
         },
         {
            "name": "rock",
            "id": 5288
         },
         {
            "name": "live-reportage",
            "id": 8001
         },
         {
            "name": "spoof",
            "id": 11931
         },
         {
            "name": "devil",
            "id": 14999
         }
      ],
      "imdb_id": "tt0100475",
      "video": false,
      "title": "Repossessed",
      "recommendations": [
         41759,
         73218,
         57597,
         34379,
         12521,
         2199,
         26179,
         41828,
         11342,
         40236,
         87699,
         71456,
         10824,
         27770,
         152907,
         11415,
         25751,
         21362,
         80346,
         26261
      ],
      "backdrop_path": "/rCn2hHiNpMe6KuPMGeM6HD3YlED.jpg",
      "revenue": 1382462,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Nancy Aglet",
               "gender": 1,
               "credit_id": "52fe444f9251416c75030249",
               "name": "Linda Blair",
               "profile_path": "/tIoU3CSpjnLi79UfBgNjXNQM1GN.jpg",
               "id": 37366,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Ernest Weller",
               "gender": 2,
               "credit_id": "52fe444f9251416c7503024d",
               "name": "Ned Beatty",
               "profile_path": "/aO5MtnqcZHpsVYz1nINdjqgEJUl.jpg",
               "id": 13726,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Father Jebedaiah Mayii",
               "gender": 2,
               "credit_id": "52fe444f9251416c75030251",
               "name": "Leslie Nielsen",
               "profile_path": "/cZpuTfE1j63tCEXoSL2A7KZjk5d.jpg",
               "id": 7633,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Father Luke Brophy",
               "gender": 2,
               "credit_id": "52fe444f9251416c75030255",
               "name": "Anthony Starke",
               "profile_path": "/qBFnwUROHkoSTqOTsZZBF4lcjtM.jpg",
               "id": 10682,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Braydon Aglet",
               "gender": 2,
               "credit_id": "52fe444f9251416c7503027d",
               "name": "Thom Sharp",
               "profile_path": "/xa7PqiMgrNQdu14Z1CYIjCys4B5.jpg",
               "id": 102928,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Fanny Ray Weller",
               "gender": 1,
               "credit_id": "52fe444f9251416c75030281",
               "name": "Lana Schwab",
               "profile_path": null,
               "id": 102929,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Bimbo Student",
               "gender": 1,
               "credit_id": "52fe444f9251416c75030285",
               "name": "Melissa Moore",
               "profile_path": "/vSaCQt6RePbjFCV4MHGAQUlIOBp.jpg",
               "id": 99067,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Man in Car",
               "gender": 2,
               "credit_id": "52fe444f9251416c75030289",
               "name": "The Unknown Comic",
               "profile_path": null,
               "id": 102930,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Woman in Elevator",
               "gender": 1,
               "credit_id": "52fe444f9251416c7503028d",
               "name": "Barbara Alyn Woods",
               "profile_path": "/5vj7zNu93sgshvy8iLK0V1SR32r.jpg",
               "id": 44033,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe444f9251416c75030291",
               "name": "Jake Steinfeld",
               "profile_path": "/o8H8WJ7eXh1dr063mSO8HTCFAui.jpg",
               "id": 21199,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Incredible Girl",
               "gender": 0,
               "credit_id": "52fe444f9251416c75030295",
               "name": "Charlotte J. Helmkamp",
               "profile_path": null,
               "id": 102931,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe444f9251416c75030299",
               "name": "Army Archerd",
               "profile_path": null,
               "id": 102932,
               "order": 11
            },
            {
               "cast_id": 19,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe444f9251416c7503029d",
               "name": "Jack LaLanne",
               "profile_path": null,
               "id": 102933,
               "order": 12
            },
            {
               "cast_id": 20,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe444f9251416c750302a1",
               "name": "Wally George",
               "profile_path": null,
               "id": 102934,
               "order": 13
            },
            {
               "cast_id": 21,
               "character": "Man on Studio Tour",
               "gender": 2,
               "credit_id": "52fe444f9251416c750302a5",
               "name": "Bob Zany",
               "profile_path": null,
               "id": 102936,
               "order": 14
            },
            {
               "cast_id": 22,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe444f9251416c750302a9",
               "name": "Jesse Ventura",
               "profile_path": "/25AzScRxybPMRxEfv9iB116jj7a.jpg",
               "id": 1104,
               "order": 15
            },
            {
               "cast_id": 23,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe444f9251416c750302ad",
               "name": "Gene Okerlund",
               "profile_path": "/q5mDmxKaHpb99xuQ5I3iID7pBw1.jpg",
               "id": 102937,
               "order": 16
            },
            {
               "cast_id": 24,
               "character": "Aerobics / Locker Room Girl",
               "gender": 1,
               "credit_id": "52fe444f9251416c750302b1",
               "name": "Julie Strain",
               "profile_path": "/9uk7Z97iYo8y5nAQbOmL3uDN2Tr.jpg",
               "id": 80116,
               "order": 17
            },
            {
               "cast_id": 25,
               "character": "Aerobics / Locker Room Girl",
               "gender": 1,
               "credit_id": "52fe444f9251416c750302b5",
               "name": "Donna Spangler",
               "profile_path": "/jgJhWORLlmKh2we5cKGvFjyPdh5.jpg",
               "id": 102938,
               "order": 18
            },
            {
               "cast_id": 26,
               "character": "Ice Tea Waiter",
               "gender": 2,
               "credit_id": "52fe444f9251416c750302b9",
               "name": "Ian Abercrombie",
               "profile_path": "/uywWX3MCmr9N2WFBcsInPzGFV4X.jpg",
               "id": 11764,
               "order": 19
            },
            {
               "cast_id": 27,
               "character": "Gym Receptionist",
               "gender": 1,
               "credit_id": "52fe444f9251416c750302bd",
               "name": "Belle Avery",
               "profile_path": null,
               "id": 53471,
               "order": 20
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe444f9251416c7503025b",
               "name": "Bob Logan",
               "profile_path": null,
               "id": 69667,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe444f9251416c75030261",
               "name": "Bob Logan",
               "profile_path": null,
               "id": 69667,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe444f9251416c75030267",
               "name": "Steve Wizan",
               "profile_path": null,
               "id": 69668,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe444f9251416c7503026d",
               "name": "Charles Fox",
               "profile_path": null,
               "id": 50239,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe444f9251416c75030273",
               "name": "Michael D. Margulies",
               "profile_path": null,
               "id": 57360,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe444f9251416c75030279",
               "name": "Jeff Freeman",
               "profile_path": null,
               "id": 11876,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Horror",
            "id": 27
         }
      ],
      "popularity": 4.611404,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11510,
      "vote_count": 53,
      "budget": 0,
      "overview": "It's been some time since Father Jebedaiah Mayii exorcised the Devil from little Nancy Aglet, who is now grown up with a husband and two children of her own. But the prince of darkness wants to go a second round and has returned to repossess her! With Father Mayii unwilling to help, Father Luke Brophy tries his best to help Nancy, even when TV's Ernest Weller plans to air the exorcism live on TV.",
      "similar": [
         525,
         9552,
         48171,
         6575,
         6477,
         786,
         241258,
         334536,
         11586,
         4011,
         10112,
         813,
         1584,
         4248,
         18947,
         109414,
         91586,
         254470,
         561,
         620
      ],
      "original_title": "Repossessed",
      "runtime": 80,
      "poster_path": "/xBqAXQVws3gvzjk2S6vD7i3Ok8f.jpg",
      "spoken_languages": [
         {
            "name": "Český",
            "iso_639_1": "cs"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Magyar",
            "iso_639_1": "hu"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Carolco Pictures",
            "id": 14723,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Seven Arts Productions",
            "id": 516,
            "origin_country": ""
         }
      ],
      "release_date": "1990-09-14",
      "vote_average": 4.5,
      "belongs_to_collection": null,
      "tagline": "The Devil's back. But he's never dealt with an exorcist like this!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Bob Logan"],
      "runtime": 80,
      "synopsis": null,
      "writers": ["Bob Logan"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0100475/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUwNDg1MTI5M15BMl5BanBnXkFtZTcwMzE0NjY0MQ@@._V1_SY317_CR11,0,214,317_AL_.jpg",
      "actors": ["Stars: Leslie Nielsen, Linda Blair, Ned Beatty | See full cast and crew »"],
      "reviews": [
         "Leslie Neilsen is always his best with spoofs. This is silly but funny too. I especially liked that Linda Blair played the possessed woman. This movie has so many sight gags you almost need to see it twice to catch them all.",
         "Leslie Nielsen was always at his best when he could hook up with the \"Airplane\"/\"Naked Gun\"-team, which consisted of gifted writers like Pat Proft, Jim Abrahams and the Zucker brothers. \"Repossessed\" is written and directed by the guy who made \"Meatballs 4\". That should probably give you a fair idea of what this movie is like, though it does feature less Corey Feldman water-skiing than expected. Somewhat surprisingly there are some jokes in here that work (the bible vending machine ruled), but overall this just really feels like everyone's trying way, way too hard. Especially the visual gags have that bothersome \"laugh, damn it!\" feel to them, they're so close to \"Naked Gun\" but just not quite. Same goes for the obligatory breakings of the fourth wall, not bad but not really focused enough to generate big laughs. Nielsen's talents are rather wasted here, though I must say he is about the only element that made me keep watching. It's also a very nice touch that Linda Blair agreed to do this movie, even though I have absolutely no idea why she did. Not because of the solid screenplay, I'm pretty sure of that. This is in all ways a sub-par spoof, but I reckon it's still watchable for avid Nielsen fans.",
         "This is one major disappointing and occasionally even downright insufferable horror-parody. Ironically enough, the funniest aspects about \"Repossessed\" are the trivia details behind it. Apparently the initial screening tests didn't fail just once, but twice! At first the script contained almost exclusively jokes and typical situations referring to the 1973 horror landmark \"The Exorcist\" but, being released no less than 17 years overdue, a large part of the target audience was too young to already have seen that film and hence didn't comprehend the humor. Subsequently, entire parts of the script got replaced with more general and contemporary 80's comedy (for example: an extended sequence set inside a fitness center with guru Jake Steinfeld) in order to appeal more to younger viewers, but it still failed because \u0085 well, the movie simply isn't funny! Writer/director Bob Logan's only remotely praiseworthy accomplishment was that he (or at least his producers) managed to trap Linda Blair into playing a mocking version of the one role that made her world famous. But even that you have to put into perspective, as Blair was probably so tired of getting typecast that she considered a comical part her last resort to get rid of her 'that-Exorcist-girl' reputation. Leslie Nielsen, with his almost naturally comical charisma, narrates the events of \"Repossessed\" in front of a class of college students. The films opens with a flashback of Nancy's first exorcism in 1973, but then jumps forward 17 years in time, when she's a married woman with two annoying brat-children. Via the TV-set, the devil takes possession of her body and yet again she spurts gooey green stuff all over her beloved ones. Father Mayii is reluctant to perform another exorcism because of his heart condition, so Nancy relies on the inexperienced young priest Father Brophy and a couple of power-hungry Televangelists that don't even believe in demonic possession. There aren't any truly laugh-out-loud moments in \"Repossessed\" at all. If you're lucky, you might briefly chuckle once or twice but the majority of jokes are just plain embarrassing. There are numerous lame literal jokes and uninspired puns that'll make you roll your eyes in disbelief. For example, one character says: \"The word on the street says that your career is history\u0085\" and at the same moment the camera actually shows a piece of street with the words \"your career is history\" painted on it. Lame! The finale is pitiable and seems to go on forever, especially when the entire cast starts imitating the greatest rock stars of the eighties. Remember the intro of \"Scary Movie 2\" (which simultaneously is the only worthwhile sequence in the whole film) where James Woods does a wacky 10 minutes re-enactment of \"The Exorcist\"? Well, it might be crude and vulgar, but that scene is much funnier and more effective as this dud.",
         "Repossessed (1990) * 1/2 (out of 4) Seventeen years after having the Devil removed from her soul, adult Nancy Aglet (Linda Blair) finds herself possessed yet again so she brings back Father Mayii (Leslie Nelson) but this time a fake preacher (Ned Beatty) wants to put it on live television to make some money. A spoof of THE EXORCIST with Linda Blair returning and Nelson coming off THE NAKED GUN should have meant a sure-fire hit but sadly this is a rather boring, unfunny and at times painfully bad movie that probably had more cash in its eye than anything else. There's so much that could have been done with the material but this is a perfect example of why certain films work and why others don't. Stuff like AIRPLANE, HOT SHOTS and THE NAKED GUN work because of the talented screenwriters who make the jokes work. Writer-director Bob Logan simply doesn't get the material to work for a number of reasons but the biggest is that the jokes are all rather lame and just seem forced. One such example of Blair fixing her kids pea soup. Another has a priest saying something about \"head\" and it of course being taken the wrong way. The stuff with the preacher and his wife is so forced and annoying that it just never gets any laughs. Even worse is how the story structure is because for the most part we see Nelson teaching in front of a class and then we see the \"other\" story dealing with Blair. We go back and forth between the two and usually we get Nelson making a few comments but those two are unfunny. Nelson seems bored in his part and Beatty simply overplays his. Blair doesn't give a very good performance but I'm not going to blame her since the material just wasn't right and she appears to really be forcing herself to try and get laughs. REPOSSESSED should have worked and probably could have worked in better hands but as it is the movie is just cheap and weak.",
         "Okay, so this isn't the best of spoof comedies. But I did enjoy it! It seems that Leslie Nielsen was born to make a fool of himself in movies like this. And Linda Blair can poke fun at the role that put her into the spotlight. There are better comedies, but this one is still good for a few laughs.",
         "Like Spaceballs, Repossessed was released too long after the film it is spoofing. 17 years is a long time, especially for us in the UK, where The Exorcist has only recently (1999) been released on video for the first time since pre-video censorship (c. 1984). Aside from that, too many jokes miss their targets, and too many subjects are lampooned. Some sequences are genuinely funny, such as Ernest & Fanny's TV Show (a brilliant spoof of hypocritical TV evangelists). Most, however, are not - the hospital scene is just not funny. Nielsen, Blair and Beatty give it their best, whilst Anthony Starke spends the whole film looking like he's just trodden in something unsavoury. Watch it if you will, B for effort, C- for results.",
         "Nancy Aglet (Linda Blair) is a lovely woman, who lives the decent middle-class life in the suburbs with his husband Braydon (Thom Sharp) and their two children (Benj Thall and Dove Dellos). But a long time ago, Nancy was possessed by the devil and she was exorcised by a kind priest Father Jebedaiah Mayii (Leslie Nielsen). Now after all these years, when Nancy lived the good life... then suddenly she's repossessed again after 17 years ago, when she's watching TV with her family. Now the possessed Nancy wants Father Mayii to battle with him again and to see, if Father Mayii still got what it takes to remove the demon out of her. Since Father Mayii is too old to fight this demon again, he's getting help from a young inexperience priest Father Luke Brophy (Anthony Starke). But when Father Brophy tells the Church there's a possessed woman, the Church thinks it would be best if it's televised with the association of a sleazy televangelist (Ned Beatty) and his wife (Lana Schwab) hoping to get millions from the ratings and of course... donations to the Chruch and stealing money from the donations by the televangelist by making himself richer. But the situation goes way out of control on live TV and the possessed demon is hoping to get people possessed by other demons for those who watched the TV special. Now Father Mayii and Father Brophy are forced to fight with this demon, before it's gets away by controlling the world. Written and Directed by Bob Logan (Meatballs 4, Up Your Alley) made an not so successful spoof to the classic horror movies of all time \"The Exorcist\" with Blair making fun of her own Oscar-Nominated role. The problem with the film, while it is watchable. While the directing and the script by the director isn't always successful. There's some terrible acting at times and some unsuccessful gags are supposed to hit the mark. Which Logan is certainly not the right writer or director to make this kind of spoof. But Logan does tries hard for it and he goes some points for it. But it's Blair, Nielsen and Starke makes its somewhat enjoyable if forgettable movie fun to watch and they give their 110 %. Blair still certainly looks great with that demonic possession look and it looks almost as good but different than the original Make-Up look that it was design by Oscar-Winner:Dick Smith. \"Repossessed\" is certainly a curiosity movie, nothing more with good comedic performances by the leads, some good visual gags and amusing cameos. If you want to see Blair having a blast with this role, it is worth a look at least once. (** ½/*****).",
         "For many horror fans, nothing is more sacred than William Friedkin's \"The Exorcist.\" For better or for worse, though, someone else thought differently, and in 1990, a spoof-flick was made in it's honor. Perhaps being delivered 17 years too late, \"Repossessed\" earns its credibility in the casting of Linda Blair (of \"The Exorcist\" and its sequel) and the reliable Leslie Nielsen. Unfortunately, the humor -- which is not surprisingly derivative of \"Airplane!\" and \"The Naked Gun\" -- falls flat with many dated jokes peppered amongst cornball sight-gags and tired slapstick humor. Granted, if that's your sort of thing, you'll have a good time, especially if you're familiar with the source material. Ned Beatty (who also had a role in \"The Exorcist II\") has perhaps the most entertaining part as a straight-up send-up of televangelist Jim Bakker. Just one of the many jokes within, though, that you won't understand if you don't remember it. As a movie that doesn't require too much mental investment, it's a pretty painless experience (minus the grating pop/theme song) if you can forgive its flaws and lack of gigantic laughs. At the very least, it's a must-see for the horror fan with a sense of humor and begs to be a cult classic. Who knows, it could be yours?",
         "I always have love parodies. \"Airplane!\", \"The Naked Gun\" (And its sequels), \"Pandemonium\" and \"Scary Movie\" are my favorites. Make good parodies is very difficult. Bob Logan's \"Repossessed\" is a great example of a good parody. Much people don't give it a chance, but i really think that this is a great comedy, of course with some flaws but and outstanding Linda Blair, and a funny Leslie Nielsen, \"Repossessed\" becomes to be one of my favorite comedies and parodies. \"Repossessed\" is the funny satire to the original and terrible but excellent \"The Exorcist\" (1973), which have too Linda Blair in the same character. But, is necessary that you understand what i try to say first with the plot of the original parodied film. William Peter Blatty's \"The Exorcist\" is about a little girl who is possessed by the devil, and how a poor mother and the faith of a young priest its debated in his own believes. The film was one of the most shocking dramatic horror and at the same time spiritual since then. But much of the cast and crew suffer a lot, and Linda Blair, with only 12 years, was one of the most affected. Linda Blair was the famous possessed girl. As i seen in an \"A& E\" biography, Linda don't have a calm adolescence. Since then was like a curse for her. \"Repossessed\" was like a real salvation, a real exorcism for that course, for that demon who pursuit her since the original film. She want laugh of that suffer, she want laugh of the devil, so she do \"Repossessed\". Bob Logan's \"Repossessed\" is perfect. Makes laugh with ironical situations, besides of awesome performances (I love the performance of Anthony Starke). I think that \"Repossesed\" is not so simple as much of us think. Of course is silly, but far of that has a lot messages: The media and how have control of the audience (Like \"Network\" for example), how maybe the believes and religion are not so different, and how we can laugh of the devil and the suffering in this way. \"Repossessed\" is silly, of course. But this foolishness had a great meaning. *Sorry for the mistakes... well, if there any.",
         "Father Mayii exorcised a possessed child named Nancy 17 year's ago- but now she is repossessed while watching the TV. So Father Brophy tries to get Father Mayii out of retirement to help him perform Nancy's exorcism and also it's going to be played on live TV to boost ratings for some has-beens. This a reasonably okay spoof on 'The Exorcist' that has it fair share of hits and misses, led by Leslie Nielsen as the head priest and the one who is telling the story about the repossession to a class of students. The film itself isn't great as a whole, as you got a couple good scenes and one-liners that standout from the rest- but you got a couple scenes and lines that are incredibly in bad taste or just lame. One thing I noticed that some gag's were borrowed in the opening sequence of the awfully bad Scary Movie 2, with the 'The Exorcist' part being the only amusing thing about that movie. The story itself is weak and really of no importance, as it's the gags that are the main attraction, with one gag or joke after another- though some of the gags start getting really tiresome and repetitive halfway through the film. So because of the one-idea film, it drags towards the end, making it feel longer than its 80mins-running time. The performances are nothing special, Leslie Nielsen has most of the funny parts as the retired Father Jebedaiah Mayii who makes a comeback to face his old demons (in many amusing ways) and also Ned Betty as Ernest Weller has his comical moments as the TV host. Linda Blair reprises her role that made her big- but this time mocking her performance in 'The Exorcist', as the possessed women named Nancy Aglet, while she was quite funny at first especially with the hilarious scenes involving her family- but after a while it got kind of stale and Anthony Starke plays the young unexperienced Father Luke Brophy, who is basically wooden and is pretty light of the laughs. This is worth a look if you want to see a stupid mockery of a classic film- but still it's quite forgettable and if you want a good comedy in the same vein with Leslie Nielsen watch the Naked Gun films instead. 2/5"
      ],
      "genres": [
         "Comedy",
         "Horror"
      ],
      "productionCompanies": ["Carolco Pictures"],
      "summaries": [
         "It's been some time since Father Jebedaiah Mayii exorcised the devil from little Nancy Aglet, but now Nancy has grown up and has a family, the demon returns and repossesses Nancy. With Father Mayii unwilling to help, Father Luke Brophy tries his best to help Nancy, even when TV's Ernest Weller plans to air the exorcism live on TV.",
         "A parody of \"The Exorcist\", the famous horror. The main female character plays a mother in a family now. She watch the TV all day, and the devil possesses her certainly. The modern devil chaser is Leslie Nielsen, who fights with the devil in a TV show."
      ],
      "budget": 0
   },
   "movielensId": 3031,
   "movielens": {
      "languages": [
         "Český",
         "English",
         "Magyar"
      ],
      "releaseDate": "1990-09-14",
      "dvdReleaseDate": "2003-08-19",
      "directors": ["Bob Logan"],
      "runtime": 80,
      "movieId": 3031,
      "title": "Repossessed",
      "mpaa": "",
      "actors": [
         "Linda Blair",
         "Ned Beatty",
         "Leslie Nielsen",
         "Anthony Starke",
         "Thom Sharp",
         "Lana Schwab",
         "Melissa Moore",
         "The Unknown Comic",
         "Barbara Alyn Woods",
         "Jake Steinfeld",
         "Charlotte J. Helmkamp",
         "Army Archerd",
         "Jack LaLanne",
         "Wally George",
         "Bob Zany",
         "Jesse Ventura",
         "Gene Okerlund",
         "Julie Strain",
         "Donna Spangler",
         "Ian Abercrombie",
         "Belle Avery"
      ],
      "imdbMovieId": "0100475",
      "originalTitle": "Repossessed",
      "genres": [
         "Comedy",
         "Horror"
      ],
      "youtubeTrailerIds": ["XIejyo2gOOY"],
      "plotSummary": "It's been some time since Father Jebedaiah Mayii exorcised the Devil from little Nancy Aglet, who is now grown up with a husband and two children of her own. But the prince of darkness wants to go a second round and has returned to repossess her! With Father Mayii unwilling to help, Father Luke Brophy tries his best to help Nancy, even when TV's Ernest Weller plans to air the exorcism live on TV.",
      "tmdbMovieId": 11510,
      "avgRating": 2.28278,
      "releaseYear": "1990",
      "numRatings": 389,
      "posterPath": "/xBqAXQVws3gvzjk2S6vD7i3Ok8f.jpg"
   }
}