{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "post-apocalyptic",
            "id": 4458
         },
         {
            "name": "dystopia",
            "id": 4565
         },
         {
            "name": "survivalist",
            "id": 10833
         },
         {
            "name": "dystopic future",
            "id": 162988
         },
         {
            "name": "last man on earth",
            "id": 169570
         },
         {
            "name": "plague",
            "id": 188959
         }
      ],
      "imdb_id": "tt0067525",
      "video": false,
      "title": "The Omega Man",
      "recommendations": [
         10803,
         10514,
         12101,
         10540,
         11935,
         2362,
         811,
         11954,
         14372,
         11850,
         11591,
         12535,
         4923,
         2134,
         10631,
         830,
         11718,
         9749,
         828,
         11864
      ],
      "backdrop_path": "/dtPe0y1F4XtpEEOwTpaZXXxXfNU.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Robert Neville",
               "gender": 2,
               "credit_id": "52fe44169251416c75028741",
               "name": "Charlton Heston",
               "profile_path": "/pXwJV9JlOCKOHSfEJdt2q61SZVq.jpg",
               "id": 10017,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Matthias",
               "gender": 2,
               "credit_id": "52fe44169251416c75028745",
               "name": "Anthony Zerbe",
               "profile_path": "/ekhT4eIQP3XloHFTRr0THiVP9ve.jpg",
               "id": 2516,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Lisa",
               "gender": 1,
               "credit_id": "52fe44169251416c75028749",
               "name": "Rosalind Cash",
               "profile_path": "/lOtmD9UaEb6eJOwyLdT0dwCT3vZ.jpg",
               "id": 43976,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Dutch",
               "gender": 2,
               "credit_id": "52fe44169251416c7502874d",
               "name": "Paul Koslo",
               "profile_path": "/wfsoFFFG5vrK5F2xUfHJur7Z5LJ.jpg",
               "id": 68681,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Zach",
               "gender": 2,
               "credit_id": "52fe44179251416c75028781",
               "name": "Lincoln Kilpatrick",
               "profile_path": "/7gND70KieLAwBN3SVSjUOTXtklz.jpg",
               "id": 104907,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Tommy",
               "gender": 2,
               "credit_id": "52fe44179251416c75028785",
               "name": "Brian Tochi",
               "profile_path": "/2nAC2ssCFu74zkhg1722WQhArGO.jpg",
               "id": 16060,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Richie",
               "gender": 2,
               "credit_id": "55c7f97b92514105c8002fb5",
               "name": "Eric Laneuville",
               "profile_path": "/eIN9ieuStP78hnbBleinfneY4Bq.jpg",
               "id": 47020,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Little Girl",
               "gender": 0,
               "credit_id": "55c7f98fc3a3687ed1002a1f",
               "name": "Jill Giraldi",
               "profile_path": null,
               "id": 1495416,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Woman in Cemetery Crypt",
               "gender": 1,
               "credit_id": "55c7f9a2c3a3687ed1002a29",
               "name": "Anna Aries",
               "profile_path": null,
               "id": 96914,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Family Member",
               "gender": 2,
               "credit_id": "55c7f9cac3a3687f8e0014b6",
               "name": "DeVeren Bookwalter",
               "profile_path": "/unSXH56aSTj7gAEjYgHJEJhHfMV.jpg",
               "id": 548085,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Family Member",
               "gender": 2,
               "credit_id": "55c7f9d592514105d8002e00",
               "name": "John Dierkes",
               "profile_path": "/enFa8jeKSkySro8wto7PPcJ3bZ4.jpg",
               "id": 29645,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Family Member",
               "gender": 1,
               "credit_id": "55c7f9e092514105cf002eeb",
               "name": "Monika Henreid",
               "profile_path": null,
               "id": 88907,
               "order": 11
            },
            {
               "cast_id": 21,
               "character": "Family Member",
               "gender": 0,
               "credit_id": "55c7fa1c92514105d5002e35",
               "name": "Linda Redfearn",
               "profile_path": null,
               "id": 161149,
               "order": 12
            },
            {
               "cast_id": 22,
               "character": "Family Member",
               "gender": 0,
               "credit_id": "55c7fa38c3a3687dce000c00",
               "name": "Forrest Wood",
               "profile_path": null,
               "id": 1495418,
               "order": 13
            },
            {
               "cast_id": 23,
               "character": "Last Boy",
               "gender": 0,
               "credit_id": "55c7fa5dc3a368248500302b",
               "name": "Steve Goldstein",
               "profile_path": null,
               "id": 1495419,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44169251416c75028753",
               "name": "Boris Sagal",
               "profile_path": null,
               "id": 68682,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44169251416c75028759",
               "name": "John William Corrington",
               "profile_path": null,
               "id": 68683,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44169251416c7502875f",
               "name": "Joyce Hooper Corrington",
               "profile_path": null,
               "id": 68684,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44169251416c75028765",
               "name": "Walter Seltzer",
               "profile_path": null,
               "id": 18591,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44179251416c7502876b",
               "name": "Ron Grainer",
               "profile_path": null,
               "id": 68685,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44179251416c75028771",
               "name": "Russell Metty",
               "profile_path": null,
               "id": 13809,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44179251416c75028777",
               "name": "William H. Ziegler",
               "profile_path": null,
               "id": 2773,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44179251416c7502877d",
               "name": "Richard Matheson",
               "profile_path": "/qpcAG1Rpic5EWY8LMPN3e1R6TKs.jpg",
               "id": 12415,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "56e03207c3a36874860040e0",
               "name": "Art Loel",
               "profile_path": null,
               "id": 1461988,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "56e032189251414abc000021",
               "name": "Walter M. Simonds",
               "profile_path": null,
               "id": 29279,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "56e032289251414abc000026",
               "name": "William L. Kuehl",
               "profile_path": null,
               "id": 1198731,
               "department": "Art",
               "job": "Set Decoration"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 6.222492,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11234,
      "vote_count": 177,
      "budget": 0,
      "overview": "Robert Neville, a doctor, due to an experimental vaccine, is the only survivor of an apocalyptic war waged with biological weapons. The plague caused by the war has killed everyone else except for a few hundred deformed, nocturnal people calling themselves \"The Family\". The plague has caused them to become sensitive to light, as well as homicidally psychotic.",
      "similar": [
         11633,
         87101,
         198663,
         119450,
         5548,
         97020,
         76341,
         157350,
         263115,
         315837,
         534,
         281,
         604,
         605,
         335984,
         280,
         185063,
         9323,
         9482,
         5550
      ],
      "original_title": "The Omega Man",
      "runtime": 98,
      "poster_path": "/kHd0BZtBfOTph7YUggtDF6EoQ9W.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Walter Seltzer Productions",
         "id": 19972,
         "origin_country": ""
      }],
      "release_date": "1971-08-01",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "The World Is Dead. One Survivor. Then The Others. Crawling In Darkness. The Strangest Sect Of All. *Hunting The Last Man On Earth.*",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Boris Sagal"],
      "runtime": 98,
      "synopsis": "A science fiction thriller based on the 1954 novel \"I am Legend\" by Richard Matheson. Set in 1977, two years after biological warfare wiped out the entire world population, except for Robert Neville (Charlton Heston) and a few that have been mutated into light-sensitive flesh-eating psychopathic zombies who are partially blind. Convinced by their fanatic leader, former news broadcaster Matthias (Anthony Zerbe), that Neville personifies the twin evils of science and militarism. Neville remains safely barricaded in his elegant, downtown penthouse apartment, where he has hoarded food, liquor and fuel normalcy in spite of the catastrophe around him, Neville patrols the city by day, carrying a machine gun and recording any sign of the mutants' activity in hopes of finding and destroying them. After another evening of fighting off attacks led by Matthias and his cohort Zachary, Neville searches downtown in hope of tracking them down. Attempting to suppress his constant anxiety, Neville \"shops\" in a clothing store and is startled when he sees a young black woman attempting to blend in with the store mannequins. Neville chases the woman, but she escapes by running into a park. Exhausted, Neville trudges into a bar and hearing a noise, descends into the darkened wine cellar where he is attacked by a group of mutants who take him to Matthias. Matthias condemns Neville for not being one of his \"family\" because he is not infected and declares him \"obsolete\". Neville maintains that the mutants should organize and attempt to find a cure, but Matthias and the others declare Neville guilty and carry him outside to a cart where he is driven to an area just outside of the stadium. Lashing Neville to a tree, Matthias exhorts his followers to burn the scientist as the bodies of the the dead were burned after initial contamination. Suddenly the stadium lights come one, forcing the mutants to collapse in an effort to cover their sensitive eyes and skin. An unmutated young man appears and cuts Neville free, then guides him away to the tunnels under the stadium where they are joined by the young woman Neville saw in the store. The woman forces Neville at gunpoint to drive her on a motorbike through the stadium and away from the recovering mutants. At dawn, the couple arrives at a house at the base of the mountains where Neville is stunned to meet a few healthy children. The young man joins the group and introduces himself as Dutch and the woman as Lisa. Dutch tells Neville that he is familiar with his work, as he was a graduate student in biochemistry before the disaster. Dutch explains that neither he nor Lisa and the children understand why they have not been afflicted with the plague, but admits that most of them have a mild sensitivity to light. Lisa and Dutch then tell Neville that they have brought him to examine one of the young people, Richie, who has shown signs of plague. After examining the boy, Neville shocks Lisa and Dutch when he reveals that he is immune to the plague due to a vaccination he developed and took just as the war reached its peak. Heartened when Neville suggests that his blood could be used to make a serum, Dutch and Lisa agrees to let Neville take Richie back to town where Neville has access to laboratories. At Neville's penthouse, he administers the last remaining vaccination to Richie. That evening, Neville treats Lisa to Dinner, but they are interrupted by a power outage caused Neville's failure to refuel the generators. While Neville goes to the basement to restore power, Zachary scales the building to the penthouse balcony. Neville restores the lights and returns in time to kill Zachary just as he is about to attack Lisa. Neville and Lisa spend the night together and the next morning, Neville notes that Richie's condition is much improved. Taking Lisa to a laboratory, Neville draws his own blood and sets about making a serum he hopes will work. Pleased, Lisa offers to spend the afternoon gathering supplies for them and Neville returns to his penthouse to find a nearly-recovered Richie. When Neville tells Richie about the serum, the boy expresses happiness that everyone will soon \"return to normal\". Neville explains that the mutants may be too far along in the illness to be saved and should be left dying. Dismayed, Richie criticizes the scientist for his hypocrisy and abruptly reveals that mutants hideout is the city civic center. Later, Neville goes to the mountains to report Richie's recovery and the serum development to Dutch, who agrees to join Neville and Lisa the following day. Upon returning to town, Neville finds a note from Richie declaring he has gone to confront the mutants to find out if they are as cynical as Neville. The scientist hurries to the civic center where he finds Richie brutally murdered. At dusk, as Lisa returns to the penthouse she runs into a torchlight parade by the mutants and, showing signs of the illness, joins them and lets them in at Neville apartment. Back at the penthouse, Neville is confronted by Matthias, a dazed Lisa and several mutants who destroy his belongings. Neville succeeds in breaking free and, using a large knife, threatens Matthias. Grabbing Lisa, Neville flees outside, but when Matthias calls to Lisa from the balcony, she is confused and breaks away from Neville. As Neville's machine gun jams, Matthias sees the spear dropped by Zachary and hurls it at Neville, impaling in him in the chest. The following morning, Dutch arrives with the children and is horrified to find Neville bleeding to death. Before dying, Neville gives Dutch the serum bottle and urges him to take the collapsed Lisa and the children away to start anew.",
      "writers": [
         "John William Corrington",
         "Joyce Hooper Corrington"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0067525/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ5OTE3MjMzNV5BMl5BanBnXkFtZTcwMzI5MTYxMQ@@._V1_SY317_CR7,0,214,317_AL_.jpg",
      "actors": ["Stars: Charlton Heston, Anthony Zerbe, Rosalind Cash | See full cast and crew »"],
      "reviews": [
         "People knock this film. Yes it has many flaws but some slack should be cut. It was 1971, Hollywood was in a desperate time of recession and change. 'Easy Rider' had blown a hole in the side of the school of thought that the studios had subscribed to. Suddenly, story material that would never have been tackled by the major studios prior to this time was emerging. 'The Omega Man' was of course an adaptation of Matheson's novel and is a second film version of it. But the technical challenges were vast. Find a time of day when L.A.'s deserted? Do me a favor! It's a miracle they got anything decent on film. Yes there are distant cars in the back of that zoom out at the top of the film but these guys didn't have computers did they? Anyway, Heston looks amusingly dated in the role of Neville wearing his safari jacket and skintight tracksuit while he prowls the 'deserted' streets. The thing about Chuck is he just LOOKS like a film star. Just driving a car he grabs your attention. The supporting cast here are less engaging. An afro and 'Hey man' too many perhaps. The writers seemed desperate to tap into 70s pop culture. A sure-fire way to date your film. The camera crew on this film must have gone straight onto 'Quincy' after they'd finished this. It's bizarre. There are dolly moves for no reason whatsoever (when Heston first enters his apartment and later before he discovers the sardine tin), zooms that hit the end stop so hard they almost bounce back and roving pans where you actually feel for the operator while he tries to find where the hell Chuck's car's gone. But this is one of the things that makes 70s cinema so great. The raw elements of film-making are on display. Ron Grainer's score is genius in places and god awful in others. It goes from the brilliant main title theme to the woeful chase music when Heston pursues the leading lady. There's also the typically almost pink-tinted blood. Why couldn't they get blood right back then? 'The Omega Man' is an engaging, thought-provoking but very dated piece of cinema. The last image of Heston is immortal even if the film's hair-dos are not. Watch it, enjoy it and cut it some slack.",
         "A film that can't help but aim too high, \"The Omega Man\" suffers from the very thing that makes it great. Set in a post-apocalyptic future (for the audience of 1971) the film attempts to show a world populated by a single solitary man. Well, a man and a cult of malcontented zombie/mutant/vampire beings. Robert Neville (Heston) is the lone survivor of a germ war that turned the population of the world into freaks. Based on the amazingly brilliant book \"I Am Legend\" by Richard Matheson, the film shares most of the qualities of the book, yet excludes the portions that make \"Legend\" fantastic. The idea of being the last man is intriguing. I used to fantasize about being Neville as a child (probably not the healthiest thing for a kid). Neville has paradise, but with the highest price possible. He can have anything he wants, but no one to share it with. And come night time, he must hide in his fortress away from the angry mob of mutants. The apocalyptic world that makes the first half so captivating is destroyed by the second half's plot device. I won't go into details for those who haven't seen it. However, I will say the film starts to slide downhill from the mid-way point. But the lesser parts can be enjoyed as early 70's camp. Even with its faults, \"The Omega Man\" is a great Sci-fi movie. It also gives Heston a chance to play his quintessential role of a man at the end of civilization. The film's weaknesses don't ruin the experience entirely. It is a film that myself and my friends talk about to this day despite the fact that most of my friends only saw it once or twice (when forced by me). Related note: I Am Legend was also made into the film \"The Last Man on Earth\" starring Vincent Price. \"Omega Man\" is discussed in the first scene of indie-film classic \"Slacker.\"",
         "This action packed and thought-provoking sci-fi drama has been one of my personal favorites for over 30 years. Charlton Heston found his definitive role here, as the last man on earth, a scientist fighting a single handed battle against hundreds of mutant creatures of the night. On the basic level, this movie has some of the most explosive action I have ever seen. Heston is at his best as a bloodless technocrat, a stone killer, \"exterminating\" mutants with machine guns, pistols, grenades, and his bare hands, all the time giving off an icy air of detachment. Put Chuck up against Clint Eastwood or Charles Bronson and he definitely holds his own purely as a Seventies action hero. On the other hand, this is also Chuck's best performance as an actor. The fact that he literally has the screen to himself for the first half hour allows him to do things he never did in his \"epic star\" mode. Watch him buy that used car, making small talk with a rotted corpse. Chuck puts across so much loneliness and yet entirely avoids self-pity, as in \"thanks a lot, you cheating bastard.\" It's a scream to watch the bigger than life Moses dealing with life's everyday hassles, not in reality but in wistful fantasy. Then watch the WOODSTOCK scene in the movie theater. Here's right wing idealist Charlton Heston watching left-wing hippies dance and frolic. Here's the last man on earth watching huge mobs of people crowd up the world that is now empty. The ironies are razor sharp, and Heston just lies back and lets the dialog work for him. \"Just to see, just to really realize, that if you have to be afraid to smile at someone, if you have to be afraid to walk down the street, what kind of world is that? Right?\" Note well the master's restraint. He doesn't sneer, he puts much more sadness into the lip-reading bit, with a little self-loathing on the side. The dialog and situation are tailor-made for Heston's cold decisive vocal style. It's not hammy stuff, it's Heston giving you the same kind of chill Deniro achieved in TAXI DRIVER. It's the paranoid loner as tragic hero. This cold withdrawn stuff is right down his power alley, and Chuck sends this scene into the upper decks. Once the movie gets started, Heston gets superb assistance from Anthony Zerbe as the religious fanatic Brother Matthias. Zerbe is superb and the commentary on religious fanaticism is even more relevant today than it was thirty years ago. Then there's the sizzling racial subplot, the kill-whitey fanaticism of Brother Zachary striking far too close to home in 1973 but remaining as provocative as ever today. It's disturbing indeed to note the subliminal message of the inter-racial love affair -- the nice white man is happy to take care of the black woman and her children, but only after the assertive black man is dead. A movie that provokes, entertains, and combines scorching social issues with rip-roaring adventure, THE OMEGA MAN is Heston's best. \"Nope -- they sure don't make pictures like that any more.\"",
         "One of these days soon we will see another remake of Richard Matheson's seminal Horror novella. If we do, I hope the marquee will read: \"I Am Legend.\" This should be done for no other reason than to make it easier for Sci-Fi nerds to argue and champion their personal favorite. But I have this feeling the producers will take the easy way out. Boris Sagal, the veteran television director, who died under the most grisly of circumstances--he walked into a helicopter blade--helms a brilliant adaptation of the book. Sure, they changed the vampires into psychotic albinos. And they also injected a heavy dose of the Seventies counter-culture. But the essential themes resist the tampering by the new screenwriters and remain solid story chestnuts. No one handles a weapon with such verve as Mr. Heston. He fires at random and generally hits something. Always a good approach in this type of movie. I enjoy his conversations with Caesar's bust in his \"Honky paradise\". The sculptures and paintings on the walls are actual reproductions of the immortals they represent. Also, check out the art work on the back of \"Dutch's\" jacket. It packs a wallop. Ron Grainer's score is legendary and has a elegiac feel punctuated by strange sounds from obscure instruments. The action scenes rival the best. Catch Heston's despair and loneliness when he jogs by a large office building along side a reflecting pool. Every scene is chock full of memorable lines and quirky bits of business. The bodies of the dead pop up randomly with a wild note on the soundtrack. There is a brief nude scene that for once fits into the plot. A standing ovation is in order for anyone left alive.",
         "This is personally my favorite film. However, I can understand why this one-time sci-fi/horror flick views more like a comedy today. The film has dated more than other films from '71/72, and with the special effects bar haven risen astronomically since that time there is little hope for the film to grow even older gracefully. And a shirtless, oily, middle-aged, often over-acting Charlton Heston doesn't exactly shout hero or Academy Award. But THE OMEGA MAN has its moments, in particular its unexpected, and unexpectedly touching, finale. Add to that worthwhile ending a legendary Ron Grainer (Dr. Who, The Prisoner) soundtrack and some very quotable dialogue (\"Thanks alot, you cheating bastard\") and THE OMEGA MAN rounds itself out into a very memorable movie. Unfortunately, Warner Bros. has continually delayed the release of OMEGA MAN on DVD - 4 years now counting. Maybe during the wait someone there will realize the potential this movie has a video game. Our heroic player must track The Family down by day and fend them off by night in a bunkered-up penthouse. Like the DVD, it's wishful thinking.",
         "Omega is the last letter of the Greek alphabet, so the \"Omega\" Man is a round-a-bout way of saying The \"Last\" Man. Indeed, this violent science fiction actioner is a remake of a 1964 movie called The Last Man On Earth; in this version Charlton Heston assumes the role played by Vincent Price in the earlier film. It is a depressing - and in many ways thought-provoking - story set in a future where the human population has been wiped out. Robert Neville (Heston) is the only remaining survivor of a worldwide plague, other than a race of vampiric mutants who come out at night. When the plague was first reaching epidemic proportions, numerous scientists were given serums to try - Neville was the one who got the correct serum, but he never managed to get back to HQ in time to report the good news. Most of the world's people went on to be killed by the plague, but those who survived have evolved into light-sensitive mutants. Every day, Neville drives around the empty streets of LA scavenging for food, fuel and useful objects; every night he returns to his ultra high-security house from which he fends off the creepy minions who come out to taunt him and, perhaps, one day kill him. The mutants are led by Matthias (Anthony Zerbe), formerly a TV newsreader, now an anti-technology crusader who encourages his followers to destroy the scientific and technological items they find, as he blames meddling scientists for ultimately decimating the world's population. What's so chilling about The Omega Man is that Neville is gradually shown to be the real \"mutant\". He is the only man left from the world as it WAS; Zerbe and his mutant hordes are the evolutionary creatures of the world as it IS. Distressing as it is, The Omega Man is saying that in the event of a worldwide catastrophe human life would find a way to prevail, but the remnants of previous human life might need eradicating first. From the sensational opening - in which Heston screeches his car to a halt on an empty street and starts shooting at an unseen being in a skyscraper - to the climax (which is simultaneously happy AND sad), The Omega Man constantly raises questions and manipulates our fears. It has weaknesses - sometimes the metaphors and morals are too heavy-handed; parts of the film are slow-going, with an excess of talk which merely goes over plot details already mentioned; there are dated elements (music, decor, costumes, vehicles, slang speech) which deny the film its topicality over 30 years on. But, in spite of all that, The Omega Man remains a worthwhile sci-fi actioner and another cult flick in the Charlton Heston \"shock sci-fi\" canon (see also Planet of the Apes '68 and Soylent Green '73).",
         "This movie rocks, right from the opening scene where our hero leaps from his car and sprays mutants with a machine gun, to the final frame where... but enough of that. A great flick, one in a line of Charlton Heston post-apocalyptic movies. If you like this you'll love Soylent Green and, of course, the first two Apes films. Heston's like John Wayne in space. Nobody does it better. In this one disease-ravaged mutants stand in for the hippies- that fixes up society's problem with the riff raff, and Charlton has an inter-racial relationship. So there are mixed messages. Charlton Heston chews the scenery in every frame. Oh well, damn you all to hell.",
         "In 1977, the American scientist and colonel Dr. Robert Neville (Charlton Heston) is the last man on Earth. All the human race died or became mutants due to the use of biological weapons in a war. During the war, Dr. Neville was researching an experimental vaccine, and in a flight to a hospital to use his latest experiment, the pilot of his helicopter died and the helicopter crashed. Dr. Neville used the vaccine on himself and it worked, making him the last survivor of human race. The race of mutants self-calls 'The Family' and is leaded by the fanatic Matthias (Anthony Zerbe) in the middle-ages standards, without the use of any facility of the Twentieth Century. Dr. Neville finds some other survivors and intends to use the anti-corpus of his blood to prepare vaccines for them. The apocalyptic story has a tragic open end. Yesterday I saw this movie maybe for the tenth time. In my opinion, it is one of the best Apocalyptic Sci-Fi movies of the 70's (together with 'Soylent Green'), when the world had the cold war to threaten and the population had a great fear of a biological weapons. In Brazil, 'The Omega Man' has not been released on VHS or DVD, and I have a VHS, recorded from the open Brazilian TV in the 80's, dubbed in Portuguese, with a terrible image, but what else can I do to see this movie if the distributors and the cable TV do not show interest to release it in my country? For persons of other native languages like me, I would like to explain the original title of the movie. In accordance with 'The Heritage Illustrated Dictionary', omega is not only the 24th and final letter in the Greek alphabet, but also means the ending, the last of anything. I hope that Tom Cruise does not spoil this magnificent story, since I heard he had the intention of preparing (or spoiling) a remake. Remake of good movies should be forbidden! My vote is nine. Today (06 September 2006) I have watched \"The Omega Man\" again, now in the original language. Title (Brazil): 'A Última Esperança da Terra' ('The Last Hope of the Earth')",
         "In typical rock-em, sock-em Heston style, he battles the bad guys in a not to shabby, but now somewhat dated sci-fi adventure. Still, an excellent movie with a terrific premise, and great plot, as mankind is nearly destroyed by nuclear/biological warfare, and Heston struggles to survive as the last sane man in a diseased and dying world. Flashbacks of events leading to this disaster really make this movie come alive. A little melodrama, however is apparent in the scenes of \"the family\", and the movie does show its age with the language and color of the 70's culture. I'm not sure how some people may take the ending of this movie. I don't remember any big fuss about it in 1971, so I guess it won't be an issue now. A good movie, with a sad, yet hope-filled happy ending, this film is yet another feather-in-the-cap for Charlton Heston when he was in his sci-fi movie making period (Planet of the Apes, Soylent Green) in his great career, and this particular \"social statement\" movie of the 70's remains relevant to this day.",
         "This is one of my favourite sci-fi movies with Charlton Heston making credible the whole story for me. Anthony Zerbe is tremendous as the family leader as is the now deceased Lincoln Kilpatrick as Zerbes sidekick. Heston as seemingly the last man on earth brings feeling to the film in some cleverly scripted conversations with himself! In fact the script is punctuated by some great one liners! Quick-paced & tense with good supporting performances from Paul Koslo as \"Dutch\" & Rosalind Cash as \"Lisa\" Dated now it is, but still stands the test of time as a truly great 70's sci-fi & if you haven't seen it, then you are in for a treat. Great music too from Ron Grainer! Do not miss this one! A full 10 out of 10!"
      ],
      "genres": [
         "Action",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": ["Walter Seltzer Productions"],
      "summaries": [
         "Due to an experimental vaccine, Dr. Robert Neville is the only survivor of an apocalyptic war waged with biological weapons. The plague caused by the war has killed everyone else except for a few hundred deformed, nocturnal people calling themselves \"The Family\". The plague has caused them to become sensitive to light, as well as homicidally psychotic. They believe science and technology to be the cause of the war and their punishment, and Neville, as the last symbol of science, the old world, and a \"user of the wheel\", must die. Neville, using electricity, machinery, and science attempts to hold them at bay.",
         "In 1977, two years after Russia and China had engaged in germ warfare and destroying most of mankind, U. S. Army scientist Robert Neville, who had immunized himself, is practically alone in the city of Los Angeles, except for a group of albino-like survivors, led by a former newscaster, now calling himself Matthias, who had predicted the destruction, His group , sensitive to light and heat, are bent upon smashing all remnants of the prior civilization, especially Neville.",
         "Two years after much of humankind was destroyed in a global war with biological weapons, Dr. Robert Neville leads a solitary existence in Los Angeles. Those humans that do remain are pigment-less albino creatures that roam the night destroying what remnants that may exist of the previous civilization. Neville, who had worked on an antidote to the virus, is one of their main targets. By day, he searches for their nests while they sleep. He comes across a small band of survivors, mostly children, but which includes two adults. Having injected himself with his experimental serum several years before, Neville in fact may carry the immunities needed to reverse the creatures' condition. The only question is whether he can survive their constant attacks long enough to prove it.",
         "Army doctor Robert Neville struggles to create a cure for the plague that wiped out most of the human race."
      ],
      "budget": 0
   },
   "movielensId": 3032,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1971-08-01",
      "dvdReleaseDate": "2000-03-06",
      "directors": ["Boris Sagal"],
      "runtime": 98,
      "movieId": 3032,
      "title": "The Omega Man",
      "mpaa": "PG",
      "actors": [
         "Charlton Heston",
         "Anthony Zerbe",
         "Rosalind Cash",
         "Paul Koslo",
         "Lincoln Kilpatrick",
         "Brian Tochi",
         "Eric Laneuville",
         "Jill Giraldi",
         "Anna Aries",
         "DeVeren Bookwalter",
         "John Dierkes",
         "Monika Henreid",
         "Linda Redfearn",
         "Forrest Wood",
         "Steve Goldstein"
      ],
      "imdbMovieId": "0067525",
      "originalTitle": "The Omega Man",
      "genres": [
         "Action",
         "Science Fiction",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "KfxxSeURcKI",
         "O4Z8IYhmU74",
         "bWB6Ufh4O98"
      ],
      "plotSummary": "Robert Neville, a doctor, due to an experimental vaccine, is the only survivor of an apocalyptic war waged with biological weapons. The plague caused by the war has killed everyone else except for a few hundred deformed, nocturnal people calling themselves \"The Family\". The plague has caused them to become sensitive to light, as well as homicidally psychotic.",
      "tmdbMovieId": 11234,
      "avgRating": 3.42699,
      "releaseYear": "1971",
      "numRatings": 1808,
      "posterPath": "/kHd0BZtBfOTph7YUggtDF6EoQ9W.jpg"
   }
}