{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "world war ii",
            "id": 1956
         },
         {
            "name": "navy",
            "id": 3588
         }
      ],
      "imdb_id": "tt0048380",
      "video": false,
      "title": "Mister Roberts",
      "recommendations": [
         41521,
         30892,
         3087,
         16515,
         94623,
         10178,
         143770,
         212185,
         162853,
         231375,
         195092,
         230961,
         195960,
         144421,
         190574,
         231423,
         41954,
         109632,
         178998,
         148791
      ],
      "backdrop_path": "/bknIwMnGn0BvBBX1TIY125ekBOC.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Mister Roberts",
               "gender": 2,
               "credit_id": "52fe46769251416c910553d9",
               "name": "Henry Fonda",
               "profile_path": "/jNLuMWW7SpSeGMUP5qxOAtg0Ryr.jpg",
               "id": 4958,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Capt. Morton",
               "gender": 2,
               "credit_id": "52fe46769251416c910553e9",
               "name": "James Cagney",
               "profile_path": "/ltNtoIKkh6zjjLxPTkw8EKYiQPi.jpg",
               "id": 5788,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Lt. 'Doc'",
               "gender": 2,
               "credit_id": "52fe46769251416c910553ed",
               "name": "William Powell",
               "profile_path": "/p9RKEHo2m3VPoYPejwFkI7PwqZY.jpg",
               "id": 32428,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Ens. Frank Thurlowe Pulver",
               "gender": 2,
               "credit_id": "52fe46769251416c910553f1",
               "name": "Jack Lemmon",
               "profile_path": "/chZmNRYMtqkiDlatprGDH4BzGqG.jpg",
               "id": 3151,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Lt. Ann Girard",
               "gender": 1,
               "credit_id": "52fe46769251416c910553f5",
               "name": "Betsy Palmer",
               "profile_path": "/lXeseQAJQeKBTlldXGV022wbWbR.jpg",
               "id": 37469,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Chief Petty Officer Dowdy",
               "gender": 2,
               "credit_id": "52fe46769251416c910553f9",
               "name": "Ward Bond",
               "profile_path": "/y7WrIGuVPHlMaakPHRYNldxvZRf.jpg",
               "id": 4303,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Mannion",
               "gender": 2,
               "credit_id": "52fe46769251416c910553fd",
               "name": "Philip Carey",
               "profile_path": "/yl8Tr3k6OL1NE2DIjdJ73FcO1pP.jpg",
               "id": 45291,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Reber",
               "gender": 2,
               "credit_id": "52fe46769251416c91055419",
               "name": "Nick Adams",
               "profile_path": "/wtA4pLwHxAROYry4MPq0eLWZ9Cd.jpg",
               "id": 2787,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Rodrigues",
               "gender": 2,
               "credit_id": "52fe46769251416c9105541d",
               "name": "Perry Lopez",
               "profile_path": "/bpw3oCVkAasOd8A2uwy60pnSXoD.jpg",
               "id": 12295,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Yeoman 3rd Class Dolan",
               "gender": 2,
               "credit_id": "52fe46769251416c91055421",
               "name": "Ken Curtis",
               "profile_path": "/kHEdY7rK6nNkWj278e65iqCrXjO.jpg",
               "id": 30554,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Insigna",
               "gender": 0,
               "credit_id": "52fe46769251416c91055425",
               "name": "Robert Roark",
               "profile_path": null,
               "id": 118302,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Stefanowski",
               "gender": 2,
               "credit_id": "52fe46769251416c91055429",
               "name": "Harry Carey, Jr.",
               "profile_path": "/p0olWUm87R6CPsL5M9FnxNSFszF.jpg",
               "id": 4316,
               "order": 11
            },
            {
               "cast_id": 19,
               "character": "Bookser",
               "gender": 2,
               "credit_id": "52fe46769251416c9105542d",
               "name": "Patrick Wayne",
               "profile_path": "/plZJV39nkOfo9kGEzmkvZKz19rU.jpg",
               "id": 30560,
               "order": 12
            },
            {
               "cast_id": 20,
               "character": "Gerhart",
               "gender": 2,
               "credit_id": "52fe46769251416c91055431",
               "name": "Frank Aletter",
               "profile_path": "/wlUBPFVPbVyb7tMUN6DeLk1h6Wz.jpg",
               "id": 123380,
               "order": 13
            },
            {
               "cast_id": 21,
               "character": "Wiley",
               "gender": 2,
               "credit_id": "52fe46769251416c91055435",
               "name": "Tige Andrews",
               "profile_path": "/mLTZf7ESyJqNDuvfFtMQfrPeyTP.jpg",
               "id": 118508,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46769251416c910553df",
               "name": "John Ford",
               "profile_path": "/dEOu7wZjE9BH4kdADWh9eTM10U.jpg",
               "id": 8500,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46769251416c910553e5",
               "name": "Mervyn LeRoy",
               "profile_path": "/bbzImfUjJ7v9U86WCpXMjAF4Nap.jpg",
               "id": 9054,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46769251416c91055403",
               "name": "Frank S. Nugent",
               "profile_path": null,
               "id": 30491,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe46769251416c91055409",
               "name": "Joshua Logan",
               "profile_path": "/2ywCSjYwYhpojIwKXZcSCXVxzKa.jpg",
               "id": 86051,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe46769251416c9105540f",
               "name": "Thomas Heggen",
               "profile_path": null,
               "id": 149014,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 2,
               "credit_id": "52fe46769251416c91055415",
               "name": "Joshua Logan",
               "profile_path": "/2ywCSjYwYhpojIwKXZcSCXVxzKa.jpg",
               "id": 86051,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 2,
               "credit_id": "52fe46769251416c9105543b",
               "name": "Leland Hayward",
               "profile_path": null,
               "id": 69028,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46769251416c91055441",
               "name": "Franz Waxman",
               "profile_path": null,
               "id": 8619,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46769251416c9105544d",
               "name": "Joshua Logan",
               "profile_path": "/2ywCSjYwYhpojIwKXZcSCXVxzKa.jpg",
               "id": 86051,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46769251416c91055453",
               "name": "Thomas Heggen",
               "profile_path": null,
               "id": 149014,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "55365f5092514166aa0035d6",
               "name": "Winton C. Hoch",
               "profile_path": null,
               "id": 22085,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5818ced4c3a368316e00005c",
               "name": "Jack Murray",
               "profile_path": null,
               "id": 30494,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5818ced9c3a368318b00005b",
               "name": "Art Loel",
               "profile_path": null,
               "id": 1461988,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "5818cee3c3a368318b000065",
               "name": "William L. Kuehl",
               "profile_path": null,
               "id": 1198731,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "5818ceeac3a368318700007a",
               "name": "Moss Mabry",
               "profile_path": null,
               "id": 14727,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "War",
            "id": 10752
         }
      ],
      "popularity": 3.87707,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 37853,
      "vote_count": 50,
      "budget": 0,
      "overview": "A hilarious and heartfelt military comedy-drama co-directed by John Ford and Mervyn LeRoy, Mister Roberts stars Henry Fonda as an officer who's yearning for battle but is stuck in the backwaters of World War II on a noncommissioned Navy ship run by the bullying Capt. Morton (James Cagney). Jack Lemmon enjoys a star-making turn as the freewheeling Ensign Pulver, and William Powell stars as the ship's doctor in his last screen role.  Based on the 1946 novel with the same name, by Thomas Heggen, and the 1948 Broadway play, written by Thomas Heggen and Joshua Logan. Henry Fonda also starred in the original Broadway production. Warner Bros. didn't want Fonda to star in the film, as they thought he was too old, and had been a stage player for so long (8 years), that he no longer was box office material. However, John Ford insisted on Fonda and the company eventually agreed.",
      "similar": [
         423,
         424,
         5925,
         637,
         14574,
         228150,
         369885,
         21876,
         399790,
         1771,
         289222,
         16869,
         2253,
         613,
         409,
         857,
         11202,
         227306,
         1251,
         8056
      ],
      "original_title": "Mister Roberts",
      "runtime": 123,
      "poster_path": "/dCjrSQwzvCndC68Cb3r87aElSxI.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
         "name": "Warner Bros. Pictures",
         "id": 174,
         "origin_country": "US"
      }],
      "release_date": "1955-07-13",
      "vote_average": 7.2,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Mister Roberts Collection",
         "id": 398740,
         "poster_path": null
      },
      "tagline": "All The Uproarious Fun Of the Smash Broadway Play!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "John Ford",
         "Mervyn LeRoy"
      ],
      "runtime": 107,
      "synopsis": "In the waning days of World War II, in the South Pacific, the men of the Navy cargo ship USS Reluctant are hard at work moving supplies and resupplying other ships of the US Navy. The men are led by Lieutenant Doug Roberts, who is well-liked by the entire crew and acts as a liaison between them and their captain, Morton, who is a mean-spirited, exacting and tyrannical officer. Recently the Reluctant was recognized for moving the most cargo of any resupply ship in the fleet. The reward for their efforts is a single palm tree, which was really given to Capt. Morton. The tree is displayed proudly on the foredeck by Morton. The result of the recognition is that the Captain has become more tyrannical than ever. He stolidly refuses to let the crew have a standard liberty and micromanages Roberts' duty to keep them engaged while they complete their missions. Roberts himself feels that, knowing the Pacific war is winding down, he'll never have the chance to serve in naval combat. He's also become quite fed up with the Captain's oppressive attitude and has written a number of letters to the Captain requesting transfer to a combat vessel -- his requests have gone unfulfilled by the Captain. Doug's closest friends on the ship are Ensign Frank Pulver and the ship's doctor, known as Lt. \"Doc\". Though he likes Pulver immensely, Roberts is quick to point out that Pulver isn't a very effective leader and is a disorganized person in general. Pulver despises the Captain as much as the rest of the crew and talks often about schemes to annoy the Captain but never follows through on them. When he meets the Captain face-to-face one day he cowers before him. The ship is due to make port at a small Pacific Island, one where there is a full hospital. Pulver sees his chance to find a pretty nurse and possibly woo her. He invites her to tour the ship, however she brings her assistant nurses with her, ruining any chance Pulver has at romance. Roberts goes over the Captain's head and requests liberty for the crew. The Captain allows the ship to make port at Elysium, an island tropical paradise but announces that the liberty has been cancelled. Infuriated, Roberts storms into the Captain's quarters and demands to know why liberty was cancelled. Morton tells Roberts a bit of his own history: he was a busboy for several years and received poor treatment from his customers. He sees Roberts, a college graduate, as representative of those who treated him badly as a youth and now seeks to pay them back. Before he grants the crew liberty, the Captain demands that Roberts quit his efforts to obtain transfer and that he become a model officer, essentially becoming a more by-the-book leader and work the crew to their limits. Roberts reluctantly agrees and the Captain allows the crew to go on liberty. That night the crew become highly drunk, raucous and destructive on the island. Many of them are arrested and brought back to the ship by Army MPs (in some cases, Roberts lets them go right back out again). The men break into the home of the French Colonial governor and wreak havoc there. A small detachment of Army MPs show up and form a cordon around the ship, preventing any other men from leaving. The commanding officer has requested that Morton see the Rear Admiral stationed on the island in the morning. Morton returns from his meeting furious -- he and the crew have been ordered to leave port immediately. He commands Roberts to make good on his promise of becoming a stricter officer, which Roberts does. When one of the crew, Dolan, approaches Roberts with what may be good news -- that officers that have a requisite number of months experience may apply for transfer -- he viciously puts Dolan on report. Upset that he'd had to enforce discipline when a crew member didn't deserve it, Roberts talks to Doc. The Doc tries to reason with Roberts, who stops short of revealing the deal he'd made with the Captain. Just then, Pulver bursts in with the news that Germany has surrendered in Europe. Roberts is overjoyed about the news and Pulver tells him he'll celebrate by putting a powerful firecracker under the Captain's bunk. However, while he gathers his explosives, they go off in the bowels of the ship, causing the laundry to become flooded with soap suds. Roberts is still overjoyed, thinking that Pulver can make another firecracker, however, all of Pulver's supplies were destroyed in the accident. Roberts is very forgiving of Pulver and goes out to be alone on the deck. On the deck, Roberts listens to the radio broadcast of the victory celebration coming in from New York City. The broadcast then changes to a man giving an inspirational speech about how the war isn't over until it's won in the Pacific. Roberts is moved by the speech and marches up to the Captain's palm tree, salutes it and throws it overboard. When the Captain finds out, he sounds the ship's general alarm which musters the crew to their battle stations. When they've all assembled, he demands to know who destroyed his palm tree. After having his adjutant read the muster list, he determines that Roberts is the culprit. Roberts is called to the Captain's room, but before the Captain can even charge him with the crime, the Captain is overcome with nausea. Roberts calls in Doc to help the Captain, who vomits into his own wastebasket. Doc puts the Captain in his bunk to relax. As Roberts walks down to the deck, the crew, knowing that he'd destroyed the palm tree, all salute him and politely bid him goodnight. A few days later Mister Roberts is packing his things. The Captain has approved a transfer for him and he'll be going to the front line in the Pacific. Before he leaves, Dolan informs him that the Captain has replaced the palm tree and has put a 24 hour guard on it. As he gets ready to meet the transfer vessel, a few of the crew give Roberts a medal they'd made: it is a gaudy brass palm tree with a ribbon. Roberts is overcome with gratitude, pins it to his blouse and walks with dignity out to the boat that will take him off the ship. He salutes the entire crew and leaves. Several weeks later, Pulver has taken up Roberts' duties as deck officer, managing the moving of cargo. A few of the crew approach him and tell him that the Captain has cancelled the movie that was to be shown that night. Pulver reluctantly tells them he'll do what he can. The ship's mail arrives and Pulver receives two letters. The first he reads is from Roberts, who seems happy that he's finally in the war and that his unit has been involved in a number of air raids. The second letter is from a friend of Pulver's who is serving on the same ship as Roberts and has become friendly with him. Pulver's friend writes that their ship suffered a surprise attack and that Roberts was killed while eating a meal. Pulver is overcome with grief and plans to announce the news to the crew. Doc stops the communications officer and tells him to read the letter that Roberts wrote, saying \"it belongs to them\". Pulver suddenly becomes enraged and marches up to the palm tree, grabbing it and throwing it overboard. He continues to the Captain's quarters, banging on the door until he's told to enter. Angrily confronting the Captain, he tells him that he'd thrown the palm tree off the ship and demands to know why the movie has been canceled for the evening. The Captain groans knowing that he'll have the same trouble with Pulver that he did with Roberts.",
      "writers": [
         "Frank S. Nugent",
         "Joshua Logan"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0048380/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM5NTc0OTYxMl5BMl5BanBnXkFtZTYwNjY0Nzk4._V1_SX214_AL_.jpg",
      "actors": ["Stars: Henry Fonda, James Cagney, William Powell | See full cast and crew »"],
      "reviews": [
         "Take a run down cargo ship with a motley crew, throw in a pacific island paradise and sign on board four of the biggest Hollywood heavyweights ever, then you are bound to have winning motion picture which stands the test of time. Henry Fonda re-creates his Broadway role as Lt.Douglas Roberts a navy cargo officer, desperately aching to be transfered from what is nothing more than a floating warehouse, to a destroyer and a chance to get into the fighting. James Cagney in what is arguably the best of his later roles, plays the selfish and ambitious Captain, who knows that Roberts' work is the key to his own success. With this motive in mind he blocks all of Roberts' requests and makes his life as miserable as possible into the bargain. It is this story line that provides most of the drama albeit played with a touch of comic frivolity. The true comedy however is provided by Jack Lemmon as the good natured but lazy Ensign, Frank Thurlough Pulver. Lemmon was a relative newcomer to the movies but none of that seemed evident in his performance. He held his own against three of the best in the business and was awarded an Oscar for his efforts. However, the highlight of this film for me is the great William Powell as the aging and quick witted Doc.. His comic timing and sophisticated presence was an invaluable asset to any film he made and Mister Roberts is no exception. Whether he is wise cracking with the crew at sick call or making illegal scotch with his shipmates, Powell steals every scene in which he appears. My personal favourite is when he is called to the captains cabin....ON THE DOUBLE, and he is seen casually strolling slowly and carefree smoking a cigarette, almost as if he was on the Park Avenue of the 1930's where he had made his name. Cagney's scenes with Lemmon are hilarious. He was a considerate actor and at times you can almost feel the space that he gave Lemmon in order for him to shine. Also the scene in which Fonda confronts Cagney, to ensure the crews liberty, is expertly acted. A must see on the newly released DVD (with commentary by Jack Lemmon himself) is a clip from a 1955 Ed Sullivan show where Fonda and Cagney re-create the scene live and the acting cannot be faulted. In more than just plot, this film has high points and low points. The high point was the welcome celluloid return of Henry Fonda after an absence of eight years whilst he played Mister Roberts on the New York stage. The low point being, that this was to be William Powell's final movie venture. He had retired in 1953 after How to Marry a Millionaire, but was lured back for \"Roberts\" by an overwhelming script. But this was to be a final return and I think as swan songs go William Powell indeed had the best. It was also a troubled production with two directors and constant fall outs with Fonda over the adaptation. To Fonda, Mister Roberts was a work of art he didn't want to see defaced, and he argued bitterly over changes from the original format. Yet the theatre going public and the cinema going public were two different species and the changes were needed. They must have found the right balance however because we are presented with a flawless motion picture with equal amounts of drama and humour, happiness and sadness and anger and goodwill. This film has the ability to touch everyone on at least one level. A must-see film with unequaled performances. Recommended.",
         "This film is a Classic, with a capital C! You have a great story, a great cast, laughs, tears and a dose of reality. How can you go wrong with Henry Fonda, James Cagney, William Powell and Jack Lemmon? What always struck me about this film was its realism. I spent some time on an auxiliary ship in the navy, and it's not glamorous. This film perfectly captures the life aboard non-combatant ships. They provide a vital service, but rarely get recognized for it. It also demonstrates what real leadership is. The main duty of an officer is to provide leadership and to see to the welfare of his troops. Mr Roberts is a shining example of a great officer. The film also shows that the enemy isn't always on the other ship. I have seen captains like Cagney's, and you often spent more time defending your crew from those skippers, than you did from the opposing force. As Mr Roberts said, \"....I know in wartime they scrape the bottom of the barrel...\", well, they sometimes scrape that barrel in peacetime. There's a great blend of comedy and drama throughout; but, just when you are feeling good, it delivers a punch to the gut. This is life as it is, not an idealized world. Sign on board for a tour of duty with this film. You'll be glad you did.",
         "Mister Roberts is a very personal film for me. This is the first i vividly remember watching with my father. Lt Douglas Roberts is a cargo officer on a cargo ship dubbed \"The Bucket\". Mister Roberts feels that war in the Pacific is passing him by. An all-star cast and crew adopt this novel and play. Henry Fonda (Grapes of Wrath, On Golden Pond) reprises his role from the play as Roberts. Henry Fonda must clash heads with the captain played by the great James Cagney (Angles with Dirty Faces, Yankee Doodle Dandy). They are joined by William Powell (My Man Godfrey), Betsy Palmer, Ward Bond (It's a Wonderful Life, My Darling Clementine) and Jack Lemmon (Odd Couple, Some Like it Hot). This is Jack Lemmon's first academy award winning performance. This is a movie is filled with humor and drama. This is movie is a great enjoyment. Naturally some things are different from the play and book. This is a great movie to add to your collection.",
         "'Mister Roberts' is one of two movies that I sometimes name as my all-time favorite movies. The other is 'The Adventures of Robin Hood' with Errol Flynn. I definitely believe that this is one of Henry Fonda's finest roles. When my now nineteen year old nephew was younger, he would ask to watch my copy of 'Mister Roberts' on VHS just for the hilarious scene where Pulver blows up the laundry and the ship starts to fill up with soap suds. I have a copy of the play which includes pictures from when Fonda played the role of Doug Roberts on stage, and there are some differences from the play, but those differences certainly work in this movie. I can't imagine better casting for any of these parts-- Henry Fonda as Doug Roberts Jack Lemmon as Ensign Pulver Ward Bond as Dowdy William Powell as Doc This is an excellent story of a man who yearns to serve in a war, but yet not to be a hero. He just wants to do his part, and he thinks that in order for his part to be important he has to be in combat. It takes him a while, and a few lectures from Doc, to realize that what he and the crew on the 'bucket' on which they serve do a necessary and important job even as they sail from boredom to tedium and back again, as Roberts says in his letter to Pulver in one of the movie's last scenes. The men are bored, and they can't stand their captain; and during the scene where the captain calls them to their battle stations after finding his special palm tree missing most of them aren't even sure where their battle stations are! The character of Doc has never even seen a battleship and he's in the navy. The entire movie is worth just the scenes of the crew returning from liberty, the making of the scotch, and the soap suds incident. For a while when I was up at Northern Arizona University I had these lines from the opening scene as part of my answering machine message: \"Now here this. Now here this. Revelry. I repeat...revelry! Attention all hands...\" I recommend this movie very highly and rate it nine out of ten stars!",
         "Mister Roberts (1955) - CO-Directors: John Ford & Mervyn LeRoy Enough time had passed that Americans were able to laugh at some of the kookier aspects about military life and Hollywood provided just the right amount of seriousness and irreverence with this 1955 hit. Henry Fonda gave one of his career making performances in this film as a lieutenant in the Navy who feels that the action of the war is passing him by. Instead of fighting the enemy, he's engaged in a battle of wills with off kilter superior officer James Cagney, who also turns in one of his mythic-making performances. The great William Powell is on board in one of his last roles as the friendly on board doctor. The late Jack Lemmon won an Academy Award for his supporting role of Ensign Pulver, a man who finally straightens his spine and takes macho Cagney on mano-a-mano. (Color)",
         "Somewhere between tedium and apathy the U.S.S. Reluctant sails to this day with it's crew of U.S. navy swabs who have to deliver cargoes of supplies to our men fighting the enemy (Japan) in World War II. The war is long over, but the spirit of men rotting under a vicious squirt of a Captain, with only an intelligent cargo officer (Lt. Doug Roberts) protecting them, remains an image that people retain sixty years after Japan surrendered. In another review, I mentioned that (ironically) the American naval mutiny everyone recalls is that on board the U.S.S.Caine in the Herman Wouk novel and the film made as a result. That like \"Mr. Roberts\" was fictional, but the two stories have taken on a life of their own. The stories transcended the events that were the backgrounds for them. Oddly enough, both stories eventually center upon the events of the closing part of the Pacific War: THE CAINE MUTINY going up to the typhoon before the battle of Okinawa in January 1945 (Roberts sees part of the fleet headed for Okinawa early in MR. ROBERTS), and Roberts getting transferred to the battle zone where he dies after Germany's surrender in May 1945. Despite problems between John Ford and star Henry Fonda, that led to Ford's removal as director, the film actually is one of those movies where several hands were involved and the results were good (like GONE WITH THE WIND). Fonda had been in the Broadway production and worked on it with Leland Heyward and Joshua Logan, so he knew precisely what was necessary for the film. Ford, before he was fired, set up the film perfectly - he was an old \"navy\" man himself, so he brought a sense of reality to the project that (mercifully) was not damaged. One thing that Ford did which was worthwhile was casting Jack Lemmon (then at the start of his film career) as Ensign Frank Thurlow Pulver, would-be sex object and would-be pain-in-the-ass to the Captain. Lemmon had somehow caught Ford's eye, and had actually done a test for a current project that Ford was planning, THE LONG GREY LINE. Lemmon told an interviewer on AMC years ago that Ford gave him the test for the role that went to Tyrone Power, and Lemmon was delivering a speech as an old Irish-American man, complete with a brogue. Ford later told Lemmon he was dreadful for the role in THE LONG GREY LINE, but he wanted him for Pulver. It was a great opportunity, as it netted Lemmon the first of his two Oscars (here for best supporting actor). He would have some great moments here, singing \"If I can be with you\" several times in the film, watching Fonda and William Powell turn a bottle of Coca Cola into Scotch, explaining to an amazed Jimmy Cagney that he has been the laundry officer on the boat for over a year but has managed never to see Cagney, causing a massive explosion in the ship's laundry on May 8, 1945, and finally pulling his guts together and taking up where Fonda left off as the movie ends. Fonda, Cagney, Powell, and Ward Bond were all old hands in film. For William Powell, \"Doc\" would be his last movie role - but a good one as it showed his humanity and wryness so well. Towards the end, he shows Ward Bond that his wife selected a new wall paper for home, and sent him a sample (I keep imagining the wife, of course, is Myrna Loy, but that is besides the point). Cagney had a number of films left in the next five years (and two follow movies in the 1980s), and Fonda would have movies and stage work (and a final Oscar for his last film, ON GOLDEN POND) in 1982. But the scenes between Cagney and Fonda were wonderful, with the latter (even when explaining what caused his miserable personality) failing to win audience sympathy. Fonda does knuckle under to help the crew, but his act of defiance (throwing the palm tree off the boat) ends his deference to this tyrant. It is typical of Cagney's acting gifts that he balances the comic and ruthless aspects of his villains. When he finds the palm tree destroyed he starts screaming the line in the \"Summary\" Line above. As for Bond, besides giving his role as Robert's cargo assistant good mileage, he also makes the word \"coffee\" have a disgusting and ironic connotation at the film's end. It was a terrific cast in a great film.",
         "The cast and story of \"Mister Roberts\" are both of high quality, and they fit together well to produce one of the best war movies to be set in the Second World War. It effectively and thoughtfully presents many facets of military life - from boredom to conflict, from slapstick to sadness - without resorting to any labored or overblown material. The cast is excellent in its own right, and the main characters are ideally matched with their roles. Henry Fonda could be no better in portraying Roberts in all his interactions with the other characters, Jack Lemmon is always entertaining as Pulver, and in Doc, William Powell gets the kind of role he played better than anyone. James Cagney is flawless as the sometimes small-minded captain, bringing out his shortcomings, yet also allowing you to understand why the character is like that. Most of the settings work well, and they help to create a believable atmosphere of navy life. The running confrontations with the palm tree and the letters are well-conceived, and they are also used effectively, getting a lot of material out of them without stretching things too far. \"Mr. Roberts\" communicates some worthwhile ideas while remaining enjoyable, and provides good entertainment and comedy without avoiding the realities in the characters' lives.",
         "This is one of the Best films I have ever seen..I was in the Navy and there was a lot of realism to the movie. Not to mention the wonderful performances by a 1st class Cast.. To put James Cagney, Henry Fonda, Jack Lemmon, Ward Bond, and the great William Powell all in one Movie, you couldn't miss having a Classic Film..A suberb Film and Terrific cast and writing, make this my all time Favorite..",
         "Through the collaborative efforts of John Ford, Mervyn LeRoy, Joshua Logan and Henry Fonda the film version of Mister Roberts finally got made. As in Spartacus a lot of creative differences were aired and there was animosity, but the thing got made and got made well. The film Mister Roberts is the screen adaption of a play that ran on Broadway from 1948 to 1951 for 1157 performances. It was based on the novel written by Thomas Heggen and was directed by Joshua Logan. It marked a return to the stage for Henry Fonda who for the rest of his life shuttled back and forth between Broadway and Hollywood. Mister Roberts became his career signature part. According to the book In the Company of Heroes by Harry Carey, Jr., Henry Fonda because this was his signature part, the part that won him a Tony Award on Broadway, he had a certain proprietary interest in seeing a faithful adaption was done for the screen. John Ford however wanted to put his own individual stamp on the picture as he always does. Fonda and Ford had done six films together before 1948 and Fonda was a willing pupil. But after the acclaim he got for this play Fonda was no longer willing to respond to Ford's direction dutifully. This led to an ugly clash on set and Ford leaving the picture. The direction was taken over by Mervyn LeRoy officially, but Joshua Logan came over from Broadway and in the background Henry Fonda himself directed some of it. There are certainly enough Ford touches to recognize the film as a Ford product. But Fonda kept the essence of Doug Roberts as the average man doing a disagreeable task, serving as a buffer between the crew and the tyrannical captain. He makes life somewhat bearable for the crew of the cargo ship he's the executive officer. And like James Stewart in It's A Wonderful Life, Fonda also has to be shown just how important his contribution to the morale of that ship is. And what a boss they have. The role of the Captain is a very difficult part. Though there are certainly elements of comedy with the captain, James Cagney never allows the captain to become a figure of burlesque. It's a very difficult tightrope to walk, but Mr. Cagney brought over 30 years of professionalism to that part. During the scene of the cabin confrontation with Fonda, Cagney does go into his background, going to sea as a kid, doing a lot of menial jobs and rising through his own efforts in the Merchant Marine. We get to understand Cagney, but we never sympathize with him. Even though Mister Roberts is a military setting, the themes are universal and that is why I think it got the popular acclaim it did. I think most of us in our lives as workers have occasionally had to work in settings where the boss was a tin pot dictator, using and abusing his position of authority. And maybe we've also had immediate supervisors who did buffer between the employer and the workers. I'm sure that applied to just about anyone who ever had any kind of work history. What allows Cagney to become the little martinet that he's become is the fact that the cargo ship is in the backwater of the war. You do kind of wonder what might happen if the ship was ever a target of some Japanese submarines or airplanes. He and the man are bored, but he's in the position of authority. Mister Roberts is the only film I know that ever made boredom a component of a successful production. William Powell who was a player for over 40 years on stage and screen put a cap to his career as Doc, the ship's medical officer and confidante of Fonda. John Ford never met a doctor he didn't like and I'm sure that part might have attracted him to the play. From Arrowsmith to Stagecoach to Seven Women, Ford's doctors are all kinds of characters, but they are all wise and offer good counsel on all subjects, not necessarily medical. And the collaborative efforts of the creators netted for Jack Lemmon his first Oscar as the Best Supporting Actor of 1955. Lemmon is a nice man of admittedly limited character as Ensign Pulver. But his stay on the ship shows a dramatic growth in character as we see in the finale. The crew is populated by a mostly Ford stock company characters. In fact the only other player besides Fonda from the original Broadway production to repeat his part is Tige Andrews as one of the crew. It's with them that we see the real Ford touches. Note that horse whinny that Ward Bond uses when the visiting nurses led by Betsy Palmer come to the ship at \"Captain\" Lemmon's request. Bond did the same thing in My Darling Clementine to a passing Linda Darnell. Despite a difficult birthing, Mister Roberts has become an American classic and will be so as long as we have a planet.",
         "Watching this again many years after I first saw it, I expected to be disappointed. After all, the great films of our youth sometimes turn out to be something less than we had imagined. But Mister Roberts does not disappoint. This is one of the gems of the American cinema, a poignant comedy featuring a multitudinously clever and delightful script by Frank Nugent and Joshua Logan from a novel by Thomas Heggen made into a play by Logan and Heggen that ran for many years on Broadway. The movie features sterling performances from Henry Fonda, James Cagney, William Powell and Jack Lemmon. Fonda is particularly brilliant in the kind of role from which legends are made. (He also played the part on Broadway.) You can take all your John Wayne classics and toss them overboard with the Captain's palm tree. Henry Fonda as Lt (j.g.) Doug Roberts, cargo officer of the USS Reluctant, shines forth as the noblest hero of them all. He is a quiet, strong, fair, courageous man in a story sure to mist up your eyes even if you're watching it for the twentieth time. Jack Lemmon won a supporting Oscar for his performance as Ensign Pulver, a kind of lazy, but slyly resourceful Walter Mitty type who talks a great game but never follows through... James Cagney is the Captain, a sour, resentful man who mercilessly badgers Mister Roberts and grossly neglects the morale of his crew. He is just perfect. The way he bellows \"Mister Roberts!\" or way he trembles out the line, \"Mister...Mister...this time you've gone too far\" delights the audience. William Powell, in his last film, plays the ship's wise and ever diplomatic doc with graceful precision. Marty (1955) starring Ernest Borgnine, a kind of politically correct (for its time) love story about ordinary folk, won the Academy's honor for best picture in 1956, the year Mister Roberts was nominated. Henry Fonda, in perhaps his most beloved and certainly one of his finest performances, was not even nominated. Incidentally, Hollywood legend John Ford directed, but fell ill and Mervyn LeRoy--no slouch himself (e.g., The Bad Seed, 1956; No Time for Sergeants, 1958, etc.)--finished up. There are a number of memorable scenes in the film, the kind recalled with delight. My favorite involves the crew, their binoculars and the nurses. I also loved the careful concocting of the \"scotch whiskey\" by Doc. The weekly letters requesting a transfer, the Hoot Gibson films we (thankfully) never see, the ever worshipful palm tree, Pulver's marbles in a tobacco tin that he shakes in Roberts's face, vowing to prove his manhood by putting them in the captain's overbin, his \"firecracker,\" his \"If I could be with you/One hour tonight/To do the things I might/I'm telling you true/I'd be anything but blue,\" the giddy nurses, and the infamous liberty are other unforgettable bits. But more than anything, what makes this a great movie, are the indelible characters so very true to our experience, and how nicely they meld and contrast. This is, along with From Here to Eternity, Das Boot, The Bridge on the River Kwai, The Caine Mutiny, Stalag 17, and Twelve O'Clock High, among my favorite movies to come out of World War II. What sets Mister Roberts apart is the humor born of the boredom, frustration, and tedium that most truly characterizes life in the service. In this regard I recall a saying that goes something like this: \"War is filled with long stretches of boredom punctuated by moments of absolute terror.\" The crew of the Reluctant got only the boredom. (Note: Over 500 of my movie reviews are now available in my book \"Cut to the Chaise Lounge or I Can't Believe I Swallowed the Remote!\" Get it at Amazon!)"
      ],
      "genres": [
         "Comedy",
         "Drama",
         "War"
      ],
      "productionCompanies": [
         "Warner Bros.",
         "Orange"
      ],
      "summaries": [
         "Mister Roberts is aboard a US cargo ship, working in the Pacific during the Second World War. He'd do anything to leave the quiet of the ship to join in the \"action\". Trouble is, the captain of the ship, is a bit of a tyrant, and isn't willing to sign Roberts' transfer requests. Also on board is Ensign Pulver, who avoids work as best he can, whilst living off the riches of his buying and selling. Roberts and the crew are in constant battle, even over the smallest of disagreements.",
         "Lt. (j.g.) Doug Roberts is the cargo officer aboard the USS Reluctant, a re-supply ship serving in the South Pacific. World War II is coming to an end. The Germans have surrendered and the war in Europe is over and while there is no end in sight for the war in the Pacific, Roberts is beginning to feel that it will all pass him by and he'll never see any action. He has repeatedly requested a transfer to a combat ship but his Captain, Lt. Cmdr. Morton, knows a good thing when he has it and in Roberts, he has one of the best cargo officers available. Roberts cares about his zany crew and is often the buffer between them and the Captain who is a strict disciplinarian and who has not allowed the crew ashore now for almost a year. In return for the Captain granting the crew shore leave, Roberts agrees to follow his orders without comment or objection. The men think he's let them down but when they learn that it was Roberts who got them their shore leave, they return the favor in their own fashion.",
         "Comedy-drama about life on a not particularly important ship of the US Navy during WW2."
      ],
      "budget": 0
   },
   "movielensId": 3035,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1955-07-13",
      "dvdReleaseDate": "1998-12-02",
      "directors": [
         "John Ford",
         "Mervyn LeRoy",
         "Joshua Logan"
      ],
      "runtime": 123,
      "movieId": 3035,
      "title": "Mister Roberts",
      "mpaa": "",
      "actors": [
         "Henry Fonda",
         "James Cagney",
         "William Powell",
         "Jack Lemmon",
         "Betsy Palmer",
         "Ward Bond",
         "Philip Carey",
         "Nick Adams",
         "Perry Lopez",
         "Ken Curtis",
         "Robert Roark",
         "Harry Carey",
         " Jr.",
         "Patrick Wayne",
         "Frank Aletter",
         "Tige Andrews"
      ],
      "imdbMovieId": "0048380",
      "originalTitle": "Mister Roberts",
      "genres": [
         "Comedy",
         "Drama",
         "Family",
         "War"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A hilarious and heartfelt military comedy-drama co-directed by John Ford and Mervyn LeRoy, Mister Roberts stars Henry Fonda as an officer who's yearning for battle but is stuck in the backwaters of World War II on a noncommissioned Navy ship run by the bullying Capt. Morton (James Cagney). Jack Lemmon enjoys a star-making turn as the freewheeling Ensign Pulver, and William Powell stars as the ship's doctor in his last screen role.  Based on the 1946 novel with the same name, by Thomas Heggen, and the 1948 Broadway play, written by Thomas Heggen and Joshua Logan. Henry Fonda also starred in the original Broadway production. Warner Bros. didn't want Fonda to star in the film, as they thought he was too old, and had been a stage player for so long (8 years), that he no longer was box office material. However, John Ford insisted on Fonda and the company eventually agreed.",
      "tmdbMovieId": 37853,
      "avgRating": 4.04281,
      "releaseYear": "1955",
      "numRatings": 2686,
      "posterPath": "/dCjrSQwzvCndC68Cb3r87aElSxI.jpg"
   }
}