{
   "tmdb": {
      "original_language": "xx",
      "keywords": [
         {
            "name": "stone age",
            "id": 4428
         },
         {
            "name": "cavemen",
            "id": 159955
         },
         {
            "name": "prehistoric adventure",
            "id": 178645
         },
         {
            "name": "prehistoric times",
            "id": 183414
         },
         {
            "name": "prehistoric man",
            "id": 192918
         }
      ],
      "imdb_id": "tt0082484",
      "video": false,
      "title": "Quest for Fire",
      "recommendations": [
         28501,
         11542,
         16241,
         15895,
         81463,
         207249,
         264239,
         91756,
         45838,
         39309,
         267186,
         88186,
         31344,
         11541,
         5919,
         24231,
         14670,
         33516,
         18331,
         16129
      ],
      "backdrop_path": "/gpI5ll8eKo9vx4hwnziOr5VeEhK.jpg",
      "revenue": 55260558,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Naoh",
               "gender": 2,
               "credit_id": "52fe4675c3a368484e091d0d",
               "name": "Everett McGill",
               "profile_path": "/qeNdO3yN3cWVWgKQqQOKU812iiR.jpg",
               "id": 5616,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Amoukar",
               "gender": 2,
               "credit_id": "52fe4675c3a368484e091ce9",
               "name": "Ron Perlman",
               "profile_path": "/xZyrXT2iEmSOokQRc1hedmxrbTi.jpg",
               "id": 2372,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Gaw",
               "gender": 2,
               "credit_id": "52fe4675c3a368484e091ced",
               "name": "Nicholas Kadi",
               "profile_path": "/nbhn9osX5TMWjU6zfmxQzkrXEJd.jpg",
               "id": 152970,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Ika",
               "gender": 1,
               "credit_id": "52fe4675c3a368484e091cf1",
               "name": "Rae Dawn Chong",
               "profile_path": "/6mk5lSTIUav9T1M0VAdUP46FTSH.jpg",
               "id": 13312,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Rouka - tribu Ulam",
               "gender": 2,
               "credit_id": "53b1ad5c0e0a2659790086c0",
               "name": "Gary Schwartz",
               "profile_path": "/gNB9tZ7UDLWJFHWHLSqx8hPS9h3.jpg",
               "id": 184330,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Nam - tribu Ulam",
               "gender": 0,
               "credit_id": "53b1ad810e0a26598c0089f6",
               "name": "Naseer El-Kadi",
               "profile_path": null,
               "id": 1336078,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Aghoo - tribu Ulam",
               "gender": 0,
               "credit_id": "53b1adbb0e0a265986008617",
               "name": "Franck-Olivier Bonnet",
               "profile_path": "/tTde15cf9juKuNipuatllecWI0V.jpg",
               "id": 578093,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Lakar - tribu Ulam",
               "gender": 0,
               "credit_id": "53b1ade30e0a2659790086ca",
               "name": "Jean-Michel Kindt",
               "profile_path": null,
               "id": 1336080,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Faum - tribu Ulam",
               "gender": 0,
               "credit_id": "53b1ae210e0a265980008669",
               "name": "Kurt Schiegl",
               "profile_path": null,
               "id": 1195963,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Modoc - tribu Ulam",
               "gender": 0,
               "credit_id": "53b1ae4b0e0a26598300870b",
               "name": "Brian Gillin",
               "profile_path": null,
               "id": 1282685,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Hourk - tribu Ulam",
               "gender": 0,
               "credit_id": "53b1ae760e0a265983008712",
               "name": "Terry Fitt",
               "profile_path": null,
               "id": 1336082,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Gammla - tribu Ulam",
               "gender": 0,
               "credit_id": "53b1aeaa0e0a2659790086e7",
               "name": "Bibi Caspari",
               "profile_path": null,
               "id": 1336083,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Mikr - tribu Ulam",
               "gender": 0,
               "credit_id": "53b1aeef0e0a26598c008a1c",
               "name": "Peter Elliott",
               "profile_path": null,
               "id": 1336084,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "Matr - tribu Ulam",
               "gender": 0,
               "credit_id": "53b1af130e0a26598c008a22",
               "name": "Michelle Leduc",
               "profile_path": null,
               "id": 1336085,
               "order": 13
            },
            {
               "cast_id": 20,
               "character": "Tsor - tribu Ulam",
               "gender": 0,
               "credit_id": "53b1afb40e0a26597d00880b",
               "name": "Robert Lavoie",
               "profile_path": null,
               "id": 1336086,
               "order": 14
            },
            {
               "cast_id": 22,
               "character": "Umbre - tribu Ulam",
               "gender": 0,
               "credit_id": "53b1b0480e0a26598900876a",
               "name": "Christian Benard",
               "profile_path": null,
               "id": 1336088,
               "order": 16
            },
            {
               "cast_id": 23,
               "character": "Tavawa - tribu Ivaka",
               "gender": 0,
               "credit_id": "53b1b0a10e0a265979008730",
               "name": "Tarlok Sing Seva",
               "profile_path": null,
               "id": 1336089,
               "order": 17
            },
            {
               "cast_id": 24,
               "character": "La faiseur de feu - tribu Ivaka",
               "gender": 0,
               "credit_id": "53b1b0de0e0a265989008783",
               "name": "Lolamal Kapisisi",
               "profile_path": null,
               "id": 1336092,
               "order": 18
            },
            {
               "cast_id": 25,
               "character": "Morah - tribu Ulam",
               "gender": 2,
               "credit_id": "549ec2209251411d5300289b",
               "name": "Matt Birman",
               "profile_path": "/mUff9ZYWDo4e9AkojnRXq9l15RT.jpg",
               "id": 72117,
               "order": 19
            },
            {
               "cast_id": 29,
               "character": "Ulam Tribe Member",
               "gender": 1,
               "credit_id": "59e79ce2c3a36824de0016b9",
               "name": "Joy Boushel",
               "profile_path": null,
               "id": 57626,
               "order": 20
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4675c3a368484e091cf7",
               "name": "Jean-Jacques Annaud",
               "profile_path": "/sxNr4V5xESbnn6To1etsLoPj5SC.jpg",
               "id": 2352,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4675c3a368484e091cfd",
               "name": "Gérard Brach",
               "profile_path": null,
               "id": 2356,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4675c3a368484e091d03",
               "name": "Yves Langlois",
               "profile_path": null,
               "id": 52093,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4675c3a368484e091d09",
               "name": "John Hay",
               "profile_path": null,
               "id": 10423,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "58df51839251415e3c005316",
               "name": "Philippe Sarde",
               "profile_path": null,
               "id": 20075,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "58df51909251415e40004e10",
               "name": "Claude Agostini",
               "profile_path": null,
               "id": 66271,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 1,
               "credit_id": "58df51b59251415e5f0051a4",
               "name": "Penny Rose",
               "profile_path": null,
               "id": 4034,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 8.078559,
      "production_countries": [
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 62204,
      "vote_count": 157,
      "budget": 12000000,
      "overview": "A colossal adventure odyssey that turns back the hands of time to the very beginning of man's existence. 80,000 years ago, when man roamed the earth, he was exposed to the many harsh elements of nature. Against the perilous atmosphere of rugged terrain, rival tribes and savage beasts, Quest for Fire examines a peaceful tribe's search for that all important element fire, and the knowledge to create it. Focusing on human dream as well as realistic insights into pre-historic man, the constant struggle for survival is vividly recreated in this sensational production.",
      "similar": [
         425,
         35002,
         3591,
         58691,
         17610,
         18905,
         30505,
         10567,
         18890,
         49519,
         88751,
         278154,
         13853,
         7840,
         351286,
         10406,
         387893,
         13363,
         8967,
         950
      ],
      "original_title": "La Guerre du feu",
      "runtime": 100,
      "poster_path": "/p81jT5YVj0zNZiQoDe9eBZvw5Rc.jpg",
      "spoken_languages": [{
         "name": "No Language",
         "iso_639_1": "xx"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Belstar Productions",
            "id": 999,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Stéphan Films",
            "id": 2359,
            "origin_country": ""
         }
      ],
      "release_date": "1981-12-15",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Jean-Jacques Annaud"],
      "runtime": 100,
      "synopsis": "Eighty thousand years ago, a brutal Wagabou attack on a sleepy Ulam cave dwelling causes much death and injury. Naoh distinguishes himself in the attack, killing a couple of the gorilla-like Wagabou. Nevertheless, the attack, followed by wolf depredations, leads to the extinguishing of the Ulams' fire. Even the flame kept in a small bone and hide receptacle and guarded by a special fire-keeper, who flounders while slogging through a lake, is lost. The ragged survivors, in miserable conditions, send forth Naoh, Amoukar, and Gaw to find \"atra\"--fire. A rival faction of the clan seeks to claim the receptacle and the quest for themselves, but an elder chief-figure restores it to Naoh. Crossing a savannah landscape, the three are treed by a pair of sabre-tooth cats. Trapped for some time, the men eat all the leaves of the perilously small tree before the cats leave. Continuing on, they hunger for meat, and Amoukar and Gaw quarrel. They see smoke in a distant forest, but arrive too late to capture the fire. Pawing through the ashes of the campfire, they find bones to gnaw, but stop in disgust as they uncover a humanoid skull. Stalking the cannibalistic Kzamma by the light of their campfire, they see two captive women (one is Ika, who we are soon to meet) hanging captive from a tree. While Amoukar and Gaw run a diversion, Naoh tries to steal fire, but ends up in a fight. He seriously injures two Kzamma, but not before being bitten in the groin. In the end, Naoh absconds with two fire sticks and rejoins his mates. They are soon approached by Ika. The men try to drive her off, but she follows, and eventually wins over Naoh by applying a vegetable poultice to his injured gonads while Amoukar and Gaw are off gathering gourds. The Kzamma have pursued, however, and are poised to attack in superior numbers when miraculously a herd of Wooly Mammoth enter the scene. Naoh wins the day when he approaches the head Mammoth and, supplicant, offers a handful of grass. The animal accepts the offering, and the herd drives off the Kzamma. That evening around the fire, the sexual tension is think. Amoukar makes a try for Ika, but she appeals to Naoh, who warns off Amoukar and--a fast healer--promptly mounts her himself, despite her screams and struggles, though the brief interlude seems to conclude in mutual satisfaction. The following day, Ika attempts to divert the men toward another route, but they ignore her. Later, Naoh seems on the verge of a discovering the stone age breakthrough of flint-knapping when a stone dislodged by Gaw hits Amoukar in the head; Ika's laughter is foreign and somewhat alarming to the men, who, we realize have not yet learned the art and luxury of laughter. The following morning, Ika runs off, and, later that day and to the disgust of his fellows, Naoh leads them in pursuit. They let him go on alone and, nearing Ikas village of mud and reed huts, Naoh bogs down in quicksand and is taken prisoner by her people, the Ivaka. Ika's more advanced people feed Naoh and watch laughing as he has sex with four of the plumper village girls. The following day, Naoh is moved to tears as he watches a demonstration of the wooden drill the villagers use to make fire. Meanwhile, Amoukar and Gaw, having gone in search of Naoh, are found in the quicksand. That night, Amoukar and Gaw escape with an armload of atlatls (another new technology) and with Naoh, whom they must club unconscious in order to bring along. Ika follows. Later, with loving looks, Naoh and Ika decorate one another with mud. Up a tree, Amoukar drops a rock onto Gaw's head, and all have a good laugh. Still later, Naoh mounts Ika but she soon turns onto her back and teaches him another position, to his delight. As this continues, Amoukar makes overtures to Gaw, but Gaw makes clear his refusal. Soon after, the four encounter their old Ulam rivals who challenged them at the outset of their quest. While Naoh and Amoukar reconnoiter, Gaw and Ika hang back at a cave; suddenly, a massive brown bear comes out of the darkness of the cave and mauls Gaw. As the others carry Gaw toward home and safety, the rival clansmen attack, demanding the fire the travelers carry with them. With their new stone-tipped spears and atlatls, they make short work of the Ulam ingrates, and even Ika getting in on the atlatl action. Returning to the main Ulam group, the people are overjoyed to see the travelers returning with fire. During the celebration, which takes place in the shallows of a lake, the original fire-keeper again falls with the receptacle into the water, extinguishing the flame. Naoh makes an oratory to a skeptical Ulam audience before sitting down with the drill to make fire. He soon becomes frustrated and Ika takes over, starting the fire and winning over the Ulam people in the process. That evening, as Amoukar regales his audience with tales of their epic quest and the injured Gaw enjoys the ministrations of a clanwoman around the roaring campfire, Naoh and Ikah sit side by side in the moonlight admiring her swelling tummy.",
      "writers": [
         "Gérard Brach",
         "J.H. Rosny Sr."
      ],
      "originalLanguage": null,
      "imdbLink": "http://www.imdb.com/title/tt0082484/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BOTMzODMxOTA2Nl5BMl5BanBnXkFtZTcwNDA2NzUxMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Everett McGill, Ron Perlman, Nicholas Kadi | See full cast and crew »"],
      "reviews": [
         "Ignore the idiotic negative comments of the naysayers. This is a great film. It boldly creates a world unlike any we've seen before, with dedicated actors going well beyond the call of duty in portraying a life and death struggle for survival under the most harrowing conditions imaginable. Featuring Claude Agostini's splendid wide-screen cinematography of remote, rainswept landscapes and a rich score by Phillipe Sarde, this movie will take you on a compelling journey that, if nothing else, will clarify the routine creature comforts of our civilized world in a manner more direct than anything you might have previously experienced in a theater. Jean-Jacques Annaud and collaborators tell their tale with dramatic simplicity and virtually no dialogue, but the points made are powerful. Humanity survives, and will prevail despite our weaknesses and faults. Overall, a remarkable, life-affirming work.",
         "A peaceful tribe of prehistoric humans, unable to create fire, loose their only source of flame due to another tribe's attack. Three of the tribe leave their home to search for a new source of fire to bring back to their people before the cold climate can take its toll. Their journey brings them not only into contact with other tribes of prehistoric humans at different stages of evolution but also advances their own humanity, as well as teaching them to be \"prometheuses\" in their own right. An absolutely fascinating film. Those who are partial to history and anthropology will especially enjoy this. An honest, un-PC look at the origins of the species and the development of humanity through loss, tragedy, hardship, hostile elements and the beginnings of laughter, morality, community service, leadership, friendship and of course, love. A wondrous feat of body language performances as there is no truly discernible language/dialogue spoken. This is a well done, well made film all around. For those into scenery gazing the beauty of the locations (Canada, Iceland, Kenya, Scotland) alone are worth a rental fee. Ron Perlman is one of the three male leads/would be prometheuses. Watch the body language! Someone did research! A difficult and impressive (first movie) performance. Definitely worth a buy (the DVD has two commentaries, one with the director Jean-Jacques Annaud, one with producer Michael Gruskoff, Rae Dawn Chong and Ron Perlman).",
         "Many of my friends laugh at me when I mention this movie. I don't know what makes so many of them hate it so.. Perhaps the lack of understandable dialogue? Too much like thinking to understand what is going on? Whatever it is, I am one of the few I know who feel this is a very underrated movie.. I know it is not accurate from a scientific perspective... The time line is all messed up.. but so what? I sat there in the theater just thinking.. \"suppose live in our distant past WAS something like this movie. Fire=Life=Fire. Along comes a superior tribe and I realize that I could summon the flames at MY WILL. How powerful I would feel.. Almost G-d like! The photography is lush and there is a tinge of humor when the backward tribe learns to laugh. I enjoyed the story and the acting... everything. Rent it! See it twice if you must. Just maybe... we ARE looking back at ourselves.",
         "Jean Jacques Annaud's \"Quest for Fire\" caught me by surprise. I have always been enthralled by movies that take place in prehistoric times, but I never expected this movie to be filmed with such consistency. This film captures an innocent adventure, in which three men (Naoh, Amoukar,& Gaw) are selected by the tribe to recapture their snuffed out fire. The journey brings them into many trials of existence, which we modern beings very seldom come in contact with. At points, there scenes that capture a sense of humor that is so basic to our modern way of thinking, but for these characters they are just discovering such things like the concept of laugher. At other points of the film, these brave men encounter situations that show the true brutal world of the survival of the fittest. The manner in which these characters search for fire gives the viewer a true love for the characters courage and heroic nature. For if they do not succeed, it is surely the end of their tribe and for them. The fire holds the key to survival with its warmth, cooking function, and most of all its ability to ward off stalking predators. Fire is power for beings at this point in time. Just as knowledge is for modern human beings. This film succeeds in it's proportions,direction, settings, music, great special effects,and acting. The acting especially is something to take notice of, since there is no recognizable language spoken. The preparation for such a role as this these is amazing in its own right. \"Quest for Fire\" will lead you into the reality of what once was and capture the essence of the human spirit.",
         "I saw this film (on VHS rental) so long ago I might have been in it. My (ex) wife & friends thought it was stupid - \"What's going on? Nobody's saying anything\". I found it mesmerising and have been looking for it ever since (car boot sales, Ebay etc). OK, if you've two adjacent brain cells, you'll spot the anachronisms and the cheap effects, but credit where it's due for originality and balls - to the director and the backers. If you're sick of hype and tripe, find it. If you're hooked intravenously to Hollywood pap (as 99.999% of the world's population seem to be) then give it a miss. Just my 2p.",
         "This is an extremely overlooked film many people should learn about. First, it tells you a very complex story without a single line of dialog successfully. Second, the story is universal: Every civilization on earth can pick up this film and understand it, because it goes to the most basic, primitive issues of a species (mainly, survival). Third, it makes the beginning of man interesting. Fourth, it reminds us we were once as savage as any other animal on earth. Fifth, it's like no other movie you've seen before. That one I can guarantee you.",
         "I recall when this film was released. If memory serves, the hype concerned the efforts to turn an elephant into a mastodon using make-up and an actress running around nude. In other words, the film in my mind fell into the 'One Million Year BC' category and I ignored it. Later, I learned who Annaud was and admired 'The Name of the Rose' for its direction, its translation of a difficult book and its effort at realism. Finally, I rented 'Quest for Fire' on DVD and saw it on the big home screen. (In fact, I watched it several months ago and I'm commenting now because it remains in my mind.) Experts can quibble about the realism. But for me, this film makes an intelligent and credible effort to present a world of 80,000 years ago. In this, it raises good questions about who we are as a species. Human genetic code has not changed in that time and any one of the beings portrayed would be perfectly capable of using a computer as I'm doing now. Nonetheless, they lived in a world without numbers, without prices, without trade, without written language and without means to create fire. Everyone alive today had an ancestor who survived those conditions. 'Quest for Fire' is a must-see for anyone curious about the human condition.",
         "Okay, there haven't been many cave man flicks and they were all bad except for Quest For Fire. Yes, the mammoths looked a bit like Mr. Snuffolopogus and some of the makeup jobs could've been done better but it's still a great movie. The story line was captivating and the characters were well-developed. Even though there were no subtitles, I could still understand everything that was being said because of the way the movie was put together. This flick has it all: Action, adventure, comedy, and romance. I loved it.",
         "One of the elements of this film I liked the most was the realistic depiction of the diversity of anthropoid types that existed in those times. This was executed beautifully and skillfully in the depiction of several diverse tribal groups, explaining the well deserved Oscar for makeup. When Naoh finds the love of his life in one of these other tribes, it is because there is an element of compatibility both between the cultures and the two individuals supporting the attraction they share. Some of the other groups depicted don't do as well in the tribal intercourse and cultural sharing department, as they tend to eat the individuals from other tribes that they encounter. Another elements of realism that scores big with me was that there are attacks by wild animals as well as by anthropoids. I also liked the language used by the main tribe, there was a suggestion that the language was evolving right before us as the travelers, having been sent on a quest for fire, returned with quite a bit more to talk about. This is one of my favorite movies, possibly the most favorite.",
         "Raw and at times brutal, this story follows three primitive warriors who make a cross-country journey in search of that most precious of natural elements ... fire. In prehistoric times, having fire meant survival from the cold and protection from predators. In this film, facial gestures, hand movements, general body language and mannerisms of the characters are all consistent with conclusions about early man, as a result of thorough anthropological research. In lieu of modern language the film's dialogue consists of some 350 invented words and sounds, also based on research. In addition, an important part of the film is attention to detail in costumes and makeup, for which the film won several awards. All of these technical cinematic elements combine to create a reasonably accurate visual and audio impression of mankind as it existed some 80,000 years ago. As you would expect, the film is shot entirely in rugged, remote locations, resulting in landscapes that are stunningly beautiful. Background music is generally low-key and ethereal, like what you might hear in a sci-fi film. There's lots of flute sounds, which reinforce the simplicity of the time period. For all its technical achievements, this film's main weakness may be the screenplay. When you take away the artifacts of modern life, you're very limited in the kind of story you can tell. And that clearly is the case here, with a plot that drones on with a monotony and repetition that can be tedious, and at times difficult for some viewers. Although the story's entertainment value may be marginal, \"Quest For Fire\", with its low tech cinematic style, is interesting not only for its technical elements but also for its over arching theme of modern human's continuity with prehistoric man, based on the element of fire."
      ],
      "genres": [
         "Adventure",
         "Drama",
         "History"
      ],
      "productionCompanies": [
         "International Cinema Corporation (ICC)",
         "Ciné Trail",
         "Belstar Productions"
      ],
      "summaries": [
         "Anthony Burgess created the primitive language for the early humans in this prehistoric adventure about a trio of warriors who travel the savanna, encountering sabre-toothed tigers, mammoths and cannibalistic tribes in search of a flame that would replace the fire their tribe has lost.",
         "80,000 years ago, fire meant power. When a tribe is attacked by another aggressive tribe and their source of fire is stolen, three tribesmen travels in a quest for fire. They retrieve the source of fire from a primitive group of cannibals and a female prisoner escapes death. She follows the trio.",
         "This story takes place in prehistoric time when three prehistoric tribesmen search for a new fire source."
      ],
      "budget": 12500000
   },
   "movielensId": 3036,
   "movielens": {
      "languages": ["No Language"],
      "releaseDate": "1981-12-15",
      "dvdReleaseDate": "2003-03-04",
      "directors": ["Jean-Jacques Annaud"],
      "runtime": 100,
      "movieId": 3036,
      "title": "Quest for Fire",
      "mpaa": "",
      "actors": [
         "Everett McGill",
         "Ron Perlman",
         "Nicholas Kadi",
         "Rae Dawn Chong",
         "Gary Schwartz",
         "Naseer El-Kadi",
         "Franck-Olivier Bonnet",
         "Jean-Michel Kindt",
         "Kurt Schiegl",
         "Brian Gillin",
         "Terry Fitt",
         "Bibi Caspari",
         "Peter Elliott",
         "Michelle Leduc",
         "Robert Lavoie",
         "Christian Benard",
         "Tarlok Sing Seva",
         "Lolamal Kapisisi",
         "Matt Birman",
         "Joy Boushel"
      ],
      "imdbMovieId": "0082484",
      "originalTitle": "La Guerre du feu",
      "genres": [
         "Adventure",
         "Drama"
      ],
      "youtubeTrailerIds": [
         "2pcGGKtPpSE",
         "nciH9Neesmg"
      ],
      "plotSummary": "A colossal adventure odyssey that turns back the hands of time to the very beginning of man's existence. 80,000 years ago, when man roamed the earth, he was exposed to the many harsh elements of nature. Against the perilous atmosphere of rugged terrain, rival tribes and savage beasts, Quest for Fire examines a peaceful tribe's search for that all important element fire, and the knowledge to create it. Focusing on human dream as well as realistic insights into pre-historic man, the constant struggle for survival is vividly recreated in this sensational production.",
      "tmdbMovieId": 62204,
      "avgRating": 3.28698,
      "releaseYear": "1981",
      "numRatings": 1244,
      "posterPath": "/p81jT5YVj0zNZiQoDe9eBZvw5Rc.jpg"
   }
}