{
   "tmdb": {
      "original_language": "sv",
      "keywords": [
         {
            "name": "grandparent grandchild relationship",
            "id": 1158
         },
         {
            "name": "roommate",
            "id": 1253
         },
         {
            "name": "birthday",
            "id": 1421
         },
         {
            "name": "funeral",
            "id": 3739
         },
         {
            "name": "vegetarian",
            "id": 4459
         },
         {
            "name": "orphan",
            "id": 13014
         },
         {
            "name": "deathbed",
            "id": 190012
         }
      ],
      "imdb_id": "tt0114296",
      "video": false,
      "title": "Roommates",
      "recommendations": [
         46924,
         201938,
         33657,
         106143,
         74101,
         36790,
         36859,
         27993,
         80346,
         20551,
         76297,
         25697,
         61418,
         88448,
         17207,
         40688,
         26393,
         22792,
         17770,
         39128
      ],
      "backdrop_path": "/soQfVdEGVku07Cq3YGPiIOGpSoS.jpg",
      "revenue": 12400000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Rocky Holzeck",
               "gender": 2,
               "credit_id": "5420cb13c3a36818cf000381",
               "name": "Peter Falk",
               "profile_path": "/mjgykviG6rY2WlF14aeDRsvVA6x.jpg",
               "id": 2314,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Michael Holzeck",
               "gender": 2,
               "credit_id": "5420cb2cc3a36818cf000386",
               "name": "D. B. Sweeney",
               "profile_path": "/2qkjuNojR8ilj2xDrd48xxkSwiM.jpg",
               "id": 61962,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Beth Holzeck",
               "gender": 1,
               "credit_id": "5420cb3dc3a36818ca00035b",
               "name": "Julianne Moore",
               "profile_path": "/v2FcWGiiuvl6P7NV0966jNL09uh.jpg",
               "id": 1231,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Judith",
               "gender": 1,
               "credit_id": "5420cb470e0a265d2200036c",
               "name": "Ellen Burstyn",
               "profile_path": "/kxWFljG3JjJMbOMCLm0SkrPQjhf.jpg",
               "id": 9560,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Bolek Krupa",
               "gender": 2,
               "credit_id": "5420cb56c3a36818c600033f",
               "name": "Jan Rubeš",
               "profile_path": "/hrzcIOLEMhcnYiRbNYoqGJD1AwK.jpg",
               "id": 37422,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Stash",
               "gender": 2,
               "credit_id": "5420cb65c3a36818d900036f",
               "name": "Ernie Sabella",
               "profile_path": "/nwdAp8FacfZ1eRU7gNkOwWvDqnc.jpg",
               "id": 69415,
               "order": 6
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "5420cabcc3a36818c3000390",
            "name": "Peter Yates",
            "profile_path": "/skBRJxvtvkylZXk6zjNPvwytr5S.jpg",
            "id": 12804,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 3.465117,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 161495,
      "vote_count": 9,
      "budget": 22000000,
      "overview": "An elderly, yet young-at-heart man, moves in with his grandson, and both their lives turn upside-down.",
      "similar": [
         2882,
         352490,
         37665,
         283725,
         47508,
         283550,
         283715,
         283547,
         283683,
         283714,
         283565,
         283709,
         283705,
         283702,
         283553,
         11151,
         283502
      ],
      "original_title": "Roommates",
      "runtime": 108,
      "poster_path": "/hvHNlMvWS2GBt7RR971bJ3k4bJc.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/xXojkyRWFZ0JTJyjiu13ThKeFbz.png",
            "name": "Hollywood Pictures",
            "id": 915,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Interscope Communications",
            "id": 10201,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Nomura Babcock & Brown",
            "id": 12883,
            "origin_country": ""
         }
      ],
      "release_date": "1995-03-01",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Peter Yates"],
      "runtime": 108,
      "synopsis": null,
      "writers": [
         "Max Apple",
         "Max Apple"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0114296/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQyNjMzMTkzN15BMl5BanBnXkFtZTcwOTY4NzkyMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Peter Falk, D.B. Sweeney, Julianne Moore | See full cast and crew »"],
      "reviews": [
         "I must put in a word of defense for this excellent movie, which was sadly underrated by both critics and audiences. The true story - of a Polish baker in Pittsburgh who raised his orphaned grandson at the age of 70+ and put him through medical school - sounds like a formula for sentimentality and cliches. However, the movie transcends that to become a moving story of the strength of family, with many wonderful touches of humor. Peter Falk's portrayal of the irascible, curmudgeonly, and indomitable Rocky Holzcek dominates the movie. We are made to care about all the people portrayed. I don't understand the criticism about the movie \"not having a story\" to tie it together. The changing relationship of Rocky and his family as the years go by has plenty of elements of drama. This movie touched me deeply. It's a real sleeper.",
         "I personally found this to be a heartwarming and entertaining tale about a grandson and the grandfather who raised him spanning the course of 30 years. The two men love each other deep down, but clash often. Outside of their relationship other stuff happens. The grandson becomes a heart surgeon and has a family of his own while the grandfather meets various new friends and finds employment in a bakery at an old age, until illness forces him to retire. The roles of the two reverse and the grandson now finds himself caring for the grandfather who once cared for him when he was an orphaned boy. Definitely check this movie out and read the book but be warned it's a tear jerker that will tug at your heart strings.",
         "I am not much of a sappy movie kind of guy, but I for one LOVED this film. Peter Faulk performs splendidly. Although slow in a few parts, the storyline more than makes up for it as it shows the trials and tribulations of family separated and joined together by generational gaps. Julian Moore give a great performance and looks absolutely beautiful in this film, even though her character is not as in depth as the main characters. And DB Sweeny shows that he can have a softer side, as well as a wise cracking smooth talking side. It was a little bit of a stretch from what he is normally known for doing, but he pulled it off very well. Roommates is definitely going into my collection. I give this one 8/10. Bravo guys.",
         "Roommates is one of my favorite movies. I have no idea why it was largely ignored by critics and the general public as well. The remarkable chemistry between Rocky and his grandson is just incredible. The story never fails to touch me - even after quite a few viewings!",
         "I think I was about 14 or 15 when I saw this movie for the first time. I also think this was the last movie that actually brought me to tears. The story of Rocky and his grandson was just so touching. It struck a chord and reminded me of my relationship with my own grandfather. You can't help but love the old fart. By the time the movie was over I had felt as if these characters had really come to life, especially Rocky. I think that is what is so great about this movie. This crusty old man really grows on you and it's hard to let him go at the end. This movie is definitely worth renting if you get the chance. A great family movie as well.",
         "This movie is all about Peter Falk, and what he's capable of when released from his Columbo role. Not that I have anything against Columbo -- it's one of the all-time great cop characters, along with Sgt. Friday and Sipowicz -- but in a police procedural we're mainly interested in what happens next, and any good director keeps that in mind. Here Falk gets to display the breadth and depth of his powers, and keeps us enthralled from the first scene to the last. He was \"only\" 68 when this film was released, but is convincingly aged during its course from something like 60 up to 107 (yes, really), which is a tribute not only to him but to the formidable makeup department (IMDb lists nine makeup credits). And just because grandfather is such an overpowering character, we shouldn't ignore the fine performances by D.B. Sweeney as his physician-grandson and Julianne Moore as the young social worker. In all, this is a moving story, well made and superbly acted. If you haven't seen it, do.",
         "If you think about a \"buddy\" movie, it can take many forms. Women may see Bette Midler in \"Beaches\" comforting her friends or Susan Sarandon in \"Thelma and Louise\" shooting up the Southwest. On the other hand men have the \"Lethal Weapon\", \"Beverly Hills Cop\" series where dim witted detectives team up with fast thinking/street smart partners. The formulas are typical and boring. This movie sets the stage for a different type of \"buddy\" movie. The premise is set right away with Michael Holzcek being orphaned(mother died previously with an illness) when his father dies in Vietnam and no one will raise him except his grandfather Rocky played by Peter Falk who becomes his lifelong buddy/mentor. Rocky is a Polish American in Pittsburg and at the time well past 65 but still working hard as a baker while his contemporaries are retired or dead. He is told that he is too old to raise a kid but \"whoa\" this senior is on a mission and not done yet! Rocky has his own stubborn ways and the \"my way or the highway\" philosophy of life. The story unfolds with Rocky teaching Michael the values of family and life. Unfortunately, Michael picks up alot of Rocky's \"say it like it is\" habits. Along the way, Michael sets out to get his college degree and head off to medical school eventually interning in Columbus, Ohio. Of course, Rocky has to join him in a home shared with Chinese medical students. This part of the movie lends itself to many funny episodes with Rocky trying to \"fit in\" with the students. Michael's life seems to be in a rut-just work and of course no sleep because Rocky is a horrific snorer. Life stinks until he meets his future wife to be Beth. However, no one is good enough for Michael according to Rocky but eventually Rocky learns to \"live and let live\" and accept Beth. The marriage develops a number of new situations and it is Beth that teaches Michael the true key to becoming a good doctor,humanity and compassion. I really enjoyed the movie but it was Peter Falk that made the movie. He has an extensive movie history and although known for the extremely successful \"Columbo\" TV series,he has received many awards and got his first real recognition for the true life based movie \"Murder Inc\". \"Roomates\" has a good story line but there are several \"goofs\" that prevent it from getting a top rating. Here are my observations. Although it is an ethnic movie and he was Polish American, there was no hints of Polish culture like food, dance etc. It was like the story was a composite of traits of many ethnic groups and the writers just chose \"Polish American\" as a label. D.B. Sweeney was not a good choice as Michael, his boyish looks are hard to make him look older as the years advance in the movie. He is also ethnic looking alright-like right out of an Irish movie with his reddish hair. However, a real big \"booboo\" was when Rocky was doing the laundry at Michael's house,(at this point Michael was married with children and had completed his doctor residency of 8 years)and had to have been 35. Rocky at that point would have been 98 or 100. He was moving around quicker than most 25 year old guys in a boxing match. Also he was a baker all of his life-a grueling, on your feet, all day occupation yet no physical ailments or complaints in the storyline. Falk also had a plastic cap over his head to make him look bald and old but it looked so bad that it reminded you of a game show host from the 70's with a lousy hairpiece(\"rug\"). I recommend this movie and had some of the details been attended to, it would have been outstanding. Perhaps this is the reason that this entertaining film was probably not released in theaters.",
         "Spoilers herein. Peter Yates is a competent director, very serious about delivering on the theatrical values. He only does well when the script is precise. And what we have here is a lesson in precision. This could only have been written by someone who teaches writing for a living; it relies on so many tricks of the popular pen that like Waller (`Bridges of Madison County') and Sparks (`Message in a Bottle') that you feel dirty and guilty afterward for having actually enjoyed that hot dog. Grandpa here is not the main character, instead the center is a big hole left by people who have died: first Dad, then Mom, then Wife. Swirling around that hole are vignettes whose only purpose is to sharpen the focus on its emptiness. The thing that works here is the amazing Julianne Moore, who enters and carries herself in a manner calculated to exit memorably. The previous year she reinvented layered acting with `Vanya' and then dove into five films in a year. These five are all over the place, each one a perfect sonnet of acting; all are trivial projects. All are raised by what she does. The only string this film doesn't pull is the dog. There isn't one. Ted's Evaluation -- 2 of 3: Has some interesting elements.",
         "I thought that this was a decent movie, although the title was a bit misleading. I thought the movie was going to be about college roommates or those that met shortly after. I did notice that after seeing the movie that there were many similarities between how family members and standard roommates get along. I noted the trivial entourage of characters. I somewhat disagree with the above users outlook on Julian Moore. In comparison to other films, I found her performance to be somewhat lacking. I did however believe that the storyline was quite interesting. I have watched this movie and find it analogous to my roommates online network experience. I mean, did you know that there were places to find people like this. Not to knock these services and believe me, I had a genuinely good experience at www.roommatesonline.net. But I did notice that other places where you could find this type of roommate were lacking in selectivity. They always say that you can pick and choose your friends/acquaintances, but getting a roommate is often just the same as in this move - you can't quite pick them. And although you might not like them, it seems that the interesting ones keep coming back. I give this movie a 7/10 for effort and a decent storyline.",
         "I find it hard to believe that there are only 16 reviews of this film & that of those 16 all but one is positive, yet this film has such a low rating. I like a lot of Peter Falk's work. I truly LOVE Columbo. It was a great show that is still watchable due to the acting of Falk & the stories. I think the reason I love this film so much is that the character of Rocky somehow reminds me of my own father (who is old enough to be my grandfather) Like Rocky, my father is gruff, stubborn, snores incessantly, & loves his family albeit rarely says it. He shows his love with his actions not his words. Now that I have a son of my own & have my father living with me I hope that one day my son will be able to appreciate this film as I do."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Hollywood Pictures",
         "Interscope Communications",
         "Nomura Babcock & Brown"
      ],
      "summaries": [
         "Michael Holeczak has a most unusual roommate, his grandfather, Rocky. Now Rocky's a bit strange but loves Michael and only has his best interest. Michael would live with Rocky after his parents died. Michael would grow up go to school, become a doctor, Rocky would live alone abut when Rocky's about to be thrown out and placed in a retirement home, he refuses. Michael then takes him in. They would stay together even when Michael got married and had a family. And Rocky would always be there for Michael and Michael for him.",
         "An elderly yet young-at-heart man moves in with his grandson, and both their lives turn upside-down."
      ],
      "budget": 22000000
   },
   "movielensId": 304,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-03-01",
      "dvdReleaseDate": "2003-05-06",
      "directors": ["Peter Yates"],
      "runtime": 108,
      "movieId": 304,
      "title": "Roommates",
      "mpaa": "PG",
      "actors": [
         "Peter Falk",
         "D. B. Sweeney",
         "Julianne Moore",
         "Ellen Burstyn",
         "Jan Rubeš",
         "Ernie Sabella"
      ],
      "imdbMovieId": "0114296",
      "originalTitle": "Roommates",
      "genres": [
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": ["JNNloERKTrI"],
      "plotSummary": "An elderly, yet young-at-heart man, moves in with his grandson, and both their lives turn upside-down.",
      "tmdbMovieId": 161495,
      "avgRating": 3.18583,
      "releaseYear": "1995",
      "numRatings": 748,
      "posterPath": "/hvHNlMvWS2GBt7RR971bJ3k4bJc.jpg"
   }
}