{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "summer camp",
            "id": 5767
         },
         {
            "name": "underwear on flagpole",
            "id": 161132
         },
         {
            "name": "famous speech",
            "id": 161133
         },
         {
            "name": "burp",
            "id": 161135
         },
         {
            "name": "french fries",
            "id": 161136
         },
         {
            "name": "toothpick",
            "id": 161137
         },
         {
            "name": "girl in swimwear",
            "id": 161143
         },
         {
            "name": "ketchup",
            "id": 161145
         },
         {
            "name": "panty raid",
            "id": 161147
         }
      ],
      "imdb_id": "tt0079540",
      "video": false,
      "title": "Meatballs",
      "recommendations": [
         40771,
         9749,
         14628,
         10890,
         19507,
         14170,
         14742,
         2620,
         11718,
         11950,
         11418,
         13105,
         15596,
         14577,
         11591,
         19357,
         21629,
         1775,
         12705,
         9409
      ],
      "backdrop_path": "/2whAe8FQiUZdeS7W78vcvhzO4eF.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Triipper Harrison",
               "gender": 2,
               "credit_id": "52fe45c59251416c75061f87",
               "name": "Bill Murray",
               "profile_path": "/7BOoOAIA1CnSzFSVSJP7saniQaB.jpg",
               "id": 1532,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Morty",
               "gender": 2,
               "credit_id": "52fe45c59251416c75061f8b",
               "name": "Harvey Atkin",
               "profile_path": "/nH8qRU3GHTsTzOZnokPDpY5ko2B.jpg",
               "id": 108890,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Roxanne",
               "gender": 1,
               "credit_id": "52fe45c59251416c75061f8f",
               "name": "Kate Lynch",
               "profile_path": "/zipgROcXvHzSE37NGx79f1xde8A.jpg",
               "id": 102760,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Crockett",
               "gender": 0,
               "credit_id": "52fe45c59251416c75061f93",
               "name": "Russ Banham",
               "profile_path": "/2QKxNvUcLYj8tPwNF7FWBQBY64d.jpg",
               "id": 119775,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "A.L.",
               "gender": 1,
               "credit_id": "52fe45c69251416c75061f97",
               "name": "Kristine DeBell",
               "profile_path": "/d8PsqRm6JqXVS15CKl41ctI3iSN.jpg",
               "id": 40621,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Candace",
               "gender": 0,
               "credit_id": "58633eecc3a3680ab6002b3f",
               "name": "Sarah Torgov",
               "profile_path": "/9rsSsA39eDag7d3tND1vu8RCNu7.jpg",
               "id": 230946,
               "order": 5
            },
            {
               "cast_id": 20,
               "character": "Spaz",
               "gender": 2,
               "credit_id": "588bdbaa925141439f000309",
               "name": "Jack Blum",
               "profile_path": null,
               "id": 123323,
               "order": 6
            },
            {
               "cast_id": 21,
               "character": "Fink",
               "gender": 2,
               "credit_id": "588bdbb592514143950002c6",
               "name": "Keith Knight",
               "profile_path": null,
               "id": 133799,
               "order": 7
            },
            {
               "cast_id": 22,
               "character": "Wendy",
               "gender": 1,
               "credit_id": "588bdbbf92514143950002cb",
               "name": "Cindy Girling",
               "profile_path": null,
               "id": 27140,
               "order": 8
            },
            {
               "cast_id": 23,
               "character": "Wheels",
               "gender": 2,
               "credit_id": "588bdbc8925141438e000322",
               "name": "Todd Hoffman",
               "profile_path": "/aOUMAJMDOejtbjPo02rlSV4CK3P.jpg",
               "id": 1646679,
               "order": 9
            },
            {
               "cast_id": 24,
               "character": "Jackie",
               "gender": 1,
               "credit_id": "588bdbd4c3a36878390002c1",
               "name": "Margot Pinvidic",
               "profile_path": null,
               "id": 100877,
               "order": 10
            },
            {
               "cast_id": 25,
               "character": "Hardware",
               "gender": 2,
               "credit_id": "588bdbe0c3a36878360002ef",
               "name": "Matt Craven",
               "profile_path": "/atUkssC0DowpBbFvsnRf92cEf9y.jpg",
               "id": 13525,
               "order": 11
            },
            {
               "cast_id": 26,
               "character": "Brenda",
               "gender": 1,
               "credit_id": "588bdbecc3a368784c0002c5",
               "name": "Norma Dell'Agnese",
               "profile_path": null,
               "id": 271933,
               "order": 12
            },
            {
               "cast_id": 9,
               "character": "Rudy",
               "gender": 2,
               "credit_id": "52fe45c69251416c75061fad",
               "name": "Chris Makepeace",
               "profile_path": "/rioxJkVwTB9keMmv6VgY7sCy3xw.jpg",
               "id": 112158,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45c69251416c75061f9d",
               "name": "Ivan Reitman",
               "profile_path": "/vYT8xpWCzKZc9F02Oqihxx1GFyg.jpg",
               "id": 8858,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c69251416c75061fa3",
               "name": "Len Blum",
               "profile_path": null,
               "id": 52871,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c69251416c75061fa9",
               "name": "Daniel Goldberg",
               "profile_path": null,
               "id": 57132,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5870784f925141356c003696",
               "name": "Elmer Bernstein",
               "profile_path": "/3H3AqKesJnkwJzWFJY9hyFwci5m.jpg",
               "id": 7182,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "588bdadfc3a368784c000222",
               "name": "Tatiana Mihailoff",
               "profile_path": null,
               "id": 1746297,
               "department": "Directing",
               "job": "Continuity"
            },
            {
               "gender": 0,
               "credit_id": "588bdafd92514143a2000251",
               "name": "Janis Allen",
               "profile_path": null,
               "id": 1381346,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "588bdb06c3a3687831000241",
               "name": "Harold Ramis",
               "profile_path": "/dFERLL9HGBw9xGMwDQRuhUgAneI.jpg",
               "id": 1524,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "588bdb1c925141439b00026d",
               "name": "Daniel Goldberg",
               "profile_path": null,
               "id": 57132,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "588bdb2d925141438e0002af",
               "name": "Donald Wilder",
               "profile_path": null,
               "id": 1162976,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "588bdb37c3a3687839000254",
               "name": "Debra Karen",
               "profile_path": null,
               "id": 31182,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "588bdb40c3a3687846000236",
               "name": "David Orin Charles",
               "profile_path": null,
               "id": 1413886,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "588bdb5f925141439500027b",
               "name": "Carol Davidson",
               "profile_path": null,
               "id": 1746316,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 6.693623,
      "production_countries": [{
         "iso_3166_1": "CA",
         "name": "Canada"
      }],
      "id": 14035,
      "vote_count": 98,
      "budget": 0,
      "overview": "Tripper is the head counselor at a budget summer camp called Camp Northstar. In truth, he's young at heart and only marginally more mature than the campers themselves. Tripper befriends Rudy, a loner camper who has trouble fitting in. As Tripper inspires his young charges to defeat rival Camp Mohawk in the annual Olympiad competition, Rudy plays matchmaker between Tripper and Roxanne, a female counselor at Northstar.",
      "similar": [
         293970,
         47957,
         85176,
         447471,
         447473,
         447448
      ],
      "original_title": "Meatballs",
      "runtime": 92,
      "poster_path": "/o0NmLgnCVph7I07OP0yKGPFoLrO.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Canadian Film Development Corporation (CFDC)",
            "id": 4952,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Famous Players",
            "id": 36555,
            "origin_country": ""
         }
      ],
      "release_date": "1979-06-28",
      "vote_average": 5.9,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Meatballs Collection",
         "id": 48037,
         "poster_path": "/jofx9VG0EqStZhdA8hXerNDn5bq.jpg"
      },
      "tagline": "When this lot go back to nature, nature runs for it's life.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": "CAD ",
      "directors": ["Ivan Reitman"],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "Len Blum",
         "Daniel Goldberg"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0079540/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAyNTM0ODMzMl5BMl5BanBnXkFtZTcwMTU1NDY0MQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Bill Murray, Harvey Atkin, Kate Lynch | See full cast and crew »"],
      "reviews": [
         "I can hardly call this a great film but it is entertaining. In my case I, at the time this film was released, was the same age as some of the junior campers in the film. For me watching this film brings back the memories of my camp years. While some of the pranks that takes place in this movie, like carrying the camp director out in his bed and leaving him on the side of a road, strung up in the trees or out on a lake, are a bit over the top some of the other pranks are not. When I went to camp the campers and counselors pulled similar stunts such as running underwear up the flag pole, canoe battles and boys raiding the girls cabin. As I grew older I realized these night raids to the girls cabin that I participated in were carefully orchestrated by the counselors so that we wouldn't find the girls in embarrassing situations but at the time I thought it was real and it was fun. That's what MEATBALLS (MB) is. MB captures not only the scenic beauty of camp surroundings but the beauty of being young and carefree. MB give a great example of pre-teens, teens and young adults living their summer with no concerns other than guys hooking up with girls and girls hooking up with guys and booth having as much fun as they can before they head back to junior high & high school and college. The opening title song that goes \"Are you ready for the summer?...no more homework no more books, no more teachers dirty looks...\" describes exactly how summer is viewed by school kids. I personally enjoyed the two campers Spaz and Fink. What boy, nerd or jock, didn't spend all camp trying to cozy up to some pretty girl camper? What guy didn't want to be accepted by the other campers and counselors? While these two characters are somewhat over the top I bet everybody who watches the film can't help but to like these two guys. These two characters are a mix of Charlie Brown from PEANUTS and Jack Tripper & Larry Dallas from THREE'S COMPANY. I would bet that most viewers even cheer for Spaz in the egg carrying competition and for Fink as he attempts to \"beat the stomach\" in the hot dog eating contest. Lastly, this movie had normal looking kids and counselors. No super models for counselors or campers that wore trendy clothing. It is fun to just kick back and watch this film and remember when life was as fun as this movie.",
         "'Meatballs' is a nice and surprisingly, bittersweet film. It remains every bit as fresh, funny and entertaining as the day it was first released. Forget the sleazy in-name only \"sequels\". This is the one-and-only, the original. It is a very good-natured and uplifting film. It makes and leaves you feeling good, but a little bit sad when it is over. It perfectly captures the experiences of being a kid, summer camp, camping and growing-up. It also captures just as well the memories made by making friends and having a good time and the pain of having to say goodbye. There are many memorably funny moments and even some touching ones, as well. It is unthinkable how anyone could not like this film or give it bad reviews. Having grown-up in the late 1970's, it is a nice trip to the past and fond memories of summers gone-by. I highly recommend this warm, charming and upbeat film. Don't miss it!",
         "\"Meatballs\" is an ode to summer camp. Those of us who got to go to camp will see many of the scenes as we remember or wish they could have been. Bill Murray plays senior boys counselor Tripper Harrison, who really runs the camp. He reminds us of the funny cool staff member who everyone loves. Young campers gravitate toward him and if he speaks to you, you feel like you are family. This is one of Murray's best roles. He drives the film with his one liners and ad-libs. Chris Makepeace plays Rudy, the loner camper who is taken under Tripper's wing and breaks out of his shell. The rest of the campers and staff in the film were excellent as well. The overall theme of the movie is the underdog overcoming obstacles to finally win. From Rudy to Spaz to the Camp and even to Tripper himself, the underdogs of the film are the stars. The movie has heart. The film is fun and funny without being cruel or oversexed as some teen movies are today. The cast look and act like real people. The comedy and heart draw you in to the point that at the end, just like at camp, you are sad to leave. In my summer camp experience we had underwear run up flag poles, mystery meat, trying to sneak a peek into the girls cabin, the lunatic-with-the hook stories around the camp fire, and moving sleeping people out of their cabins and putting them elsewhere. But we also had a dedicated camp staff guiding us to be the best we could be. My favorite scene is the CIT overnight when they are canoeing across the lake singing a goofy song. The one line that cracks me up every time is when Tripper is announcing light outs the evening before Parent's Day and he ends \"Tomorrow is parents day, and you must look rested or Morty will be sent to the state penitentiary.\"",
         "Meatballs has been a main staple in my family for over 26 years! We saw this movie when it first came out and have seen it dozens of times since. Bill Murray is at his best and is most touching in the scenes where he reaches out to a lonely pre-teen boy and befriends him, while leading his CIT's into once mischievous scheme after another! The cast of characters are fun and zany and you really come to care about them and the relationships they have with each other. This is not another sleazy, dumb, teen sex-fest. It is funny and sweet and just all-around fun. Anyone who sees this will enjoy themselves. It is a must-see. Watch out for Spaz - he is by far the best character! (Especially during the camp social - while Bill Murray hams it up for the camera - just watch Spaz behind him dancing with the poor girl he picks to dance with!) By far, one of my very favorite comedies of all time!",
         "No, it's not Citizen Kane. But would you expect it to be with a name like \"Meatballs\"? It's the best damn summer camp movie of all the summer camp movies. Does anyone quote \"Little Darlings\" line by line? Or \"Whitewater Summer\"? This is just one of those movies that got into my brain when I was in junior high, and stayed with me all these years. Every time I feel geeky, I mumble \"Spaz. Spaz. Spaz. Spaz.\" Or when we're hiking in the brush in the forest, I tell my husband, \"I'm Wudy da Wabbit.\" (He doesn't get it). \"It just doesn't matter. It just doesn't matter.\" I mean, this stuff is classic! Disappointed with the DVD, though. Wish there were special features, maybe a commentary or a making-of. But the movie itself is a perfect snapshot of life as an adolescent in the late '70s. Maybe not MY life... You can't help but want to run around out in the woods in shorty shorts and knee-high socks and feathered hair every time you see this movie.",
         "I caught this on television one day when I was young and loved it. In the 1970's, there were a bunch of lame comedies that tried too hard to be be funny so it this was a nice surprise. It's one of the best comedies of the 1970's and the definitive summer camp comedy thanks to Murrary's excellent comedic performance, which still stands as one of his greatest. This is the film that really got Ivan Reitman noticed as a director. Reitman proves with this movie that he is one of the most talented comedy directors of all time. While this film is hilarious and MEATBALLS 2 is so bad that it's fun, MEATBALLS 3 and MEATBALLS 4 are absolutely dreadful. Recommended for those who enjoyed STRIPES and GHOSTBUSTERS.",
         "Seeing this movie always reminds me of what I remember summer being like, God! such a long time ago. The entire scene involving the \"overnight\", from the canoe procession to the end of the trip, is precious, and Tripper's story about the homicidal maniac is urban legend right out of my youth. A highly entertaining movie, made many times better by the awful sequels that followed.",
         "This is easily the best of the summer camp movies. In fact, few of the others are even fair, let alone anywhere near as entertaining as this one is. The film is just simply out to have some good, clean, fun. Many people who went to summer camp as kids will see that it is presented here faithfully to the way it usually was, but with slapstick comedy mixed in. Bill Murray, as the chief counselor of the camp, Tripper, leads a fine ensemble cast, and is usually at the center of the riotous nonsense. Tripper has great one-liners throughout, usually broadcasting his jokes as pseudo-announcements over the camp's public-address system. Several great supporting actors played the campers and counselors to build a myriad of fun and interesting subplots, all the while sprinkled amongst the many incidents of camp hi-jinx. Spaz (Jack Blum) and Fink (Keith Knight) were two characters particularly well done. The adventures (and misadventures) of these two are hilarious. Each has classic lines, and they are characters you like and root for. Look for Spaz in the scene of disco dance pandemonium. The girls in the story are realistic characters, too. They're not dumb, naive, freakish, oversexed, nervy, or any of the other overused, abominable teen character stereotypes. Kristine DeBell, Kate Lynch, Cindy Girling, and others make these characters believable. The requisite pranks abound, usually at the expense of camp director Morty (Harvey Atkin). The nature of these pranks start at outrageous and progress from there. However, with all the silliness going on, Tripper and the others have their serious sides. For example, Tripper befriends a shy, lonely kid, Rudy(Chris Makepeace), and takes him under his wing. The story culminates with a sports competition against a rival camp. It's a great \"root for the underdogs\" finale. When the chips are down, Tripper's motivational \"It just doesn't matter\" spiel is inspired, and one of the best moments in the movie. And get ready to root: \"Spaz. Spaz! Spaz!!!\"\"",
         "Camp North Star and it's Camp counselor extraordinaire, Tripper Harrison(Bill Murray)sure would like to end a decades long losing streak to rival Camp Mohawk, an ivy league type place where only the wealthy kids can attend. Meanwhile, we watch as Tripper tries his hand at love when he flirts aimlessly with fellow female counselor Roxanne(Kate Lynch)as other teen counselors pair up and also fall head-over-heels. The film comes to head at the Camp Olympiad as the rivals square off in competitive athletic contests with Tripper almost realizing their doomed to fail yet another year. The film also shows the growing bond between Tripper and a quietly lonely, puppy-dog eyed Rudy(Chris Makepeace of \"Vamp\" fame), whose dad is often away all the time. Rudy doesn't seem to fit in with the other kids his age and he seems to spend most of his time either jogging in the mornings with Tripper or taking his peanuts at Blackjack. The film mostly contains hi-jinx of fellow teen camp counselors cutting up and goofing around. You have hottie counselors, total nerd Spaz(Jack Blum)with his taped glasses and bad acne, beak-nosed \"Hardware\"(Matt Craven)who likes to blow things up, fat kid Fink(Keith Knight) who is often stuffing his face, amongst others in the film. There's a basketball game where poor Spaz can barely bounce the ball against rival Camp Mohawk much less shoot an accurate shot with poor Fink tossing underhanded, between-his-knees fly-balls that sail over the back-board. There's camp fire coupling(with a spirited scary tale by Tripper about a hook-handed killer)and boys drooling over the lovely ladies. Yes, I know it's desperate at times trying to squeeze out every laugh it can and occasionally indulges in lapses of sentimentality(such as the scenes with a sad Makepeace and Murray), but just as much as this recent viewing, I found myself giggling away. I'm licked and just can't help loving this. It's a summer camp movie through and through which simply wants to entertain you. I can't explain, or reinforce enough, the overwhelming joy that floods forth when I see a sleepy Murray's hand reach from the covers for the alarm clock that's piercing loudly pronouncing a summer camp movie is about to begin. His intercom jokes are especially amusing. But, the flick is, let's be honest, a series of comic vignettes with Murray dead-panning endlessly..not that there's anything wrong with that. The film, though, couldn't quite survive without him, could it? Hard to even think of this movie without Murray in the lead. It's a happier time and I think nostalgia of that summer camp experience plays quite a hand in why we grown-ups still connect with \"Meatballs\" warmly. And, poor Morty(Harvey Atkin), the camp head who so badly wants things to run smooth, and to beat Camp Mohawk for a change, is the constant source of Tripper and gang's amusement as they often play gags on him..especially when he's sleeping on his bed! Great enthusiastic cast who seem to be having as much as us.",
         "Yes, it feels, and for the most part plays like an \"after school special\", for a slightly more adult audience, alright maybe a teen audience. But add in Bill Murray (already showing some dramatic as well as his usual comedic talent), a nice supporting cast, and an unexpected sweetness about growing up, and remembering those great, or not so great days at summer camp, and you get a heartwarming, funny, sleeper hit. It does get a little too smarmy for its own good, but that is also one of its charms. When you hear the title \"Meatballs\", and see the poster, you expect a teenage sex romp, but what you get is a sentamental, yet sometimes sexy look back at those formative years at summer camp. The sentamentality, and the remberances of simpler times reminds me of \"A Christmas Story\", which I also love. The rememberances of summer camp were never so well stated. The only movie I've seen that comes close, is \"Indian Summer\", which I like almost as much as \"Meatballs\", and also stars Matt Craven. Let's hope he completes the trilogy. Maybe he could come back for \"Return of the Meatballs\", and bring some dignity back to the franchise (Meatballs 2 through 4 bare no resemblence to the original classic). \"Meatballs\" is easily on my Top 10 Guilty Pleasures of all time (not really guilty either). It's a wonderful little film, that always makes me smile."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Canadian Film Development Corporation (CFDC)",
         "Famous Players",
         "Haliburton Films"
      ],
      "summaries": [
         "Summer Camp highjinks centered around a camp counselor with a wacky sense of humor. He tries to help the campers have a good time. One camper named Rudy poses a particular challenge as he has a self-esteem problem",
         "Mr. Depressingly Unpopular Rudy goes to summer camp full of rowdy teenagers. The head counselor is Tripper Harrison, the prank pulling, girl seducing, fun lover, teasing both his boss and the counselors at the nearby rich kids camp. He and everyone else are sick and tired of always losing the Camp Olympics every year, Tripper must encourage all campers to try their hardest, and even convince young Rudy that this may be his chance to feel better about himself.",
         "Wacky hijinks of counselors and campers at a less-than-average summer camp."
      ],
      "budget": 1600000
   },
   "movielensId": 3040,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1979-06-28",
      "dvdReleaseDate": "1999-11-23",
      "directors": ["Ivan Reitman"],
      "runtime": 92,
      "movieId": 3040,
      "title": "Meatballs",
      "mpaa": "PG",
      "actors": [
         "Bill Murray",
         "Harvey Atkin",
         "Kate Lynch",
         "Russ Banham",
         "Kristine DeBell",
         "Sarah Torgov",
         "Jack Blum",
         "Keith Knight",
         "Cindy Girling",
         "Todd Hoffman",
         "Margot Pinvidic",
         "Matt Craven",
         "Norma Dell'Agnese",
         "Chris Makepeace"
      ],
      "imdbMovieId": "0079540",
      "originalTitle": "Meatballs",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["vZRcvSfMgj4"],
      "plotSummary": "Tripper is the head counselor at a budget summer camp called Camp Northstar. In truth, he's young at heart and only marginally more mature than the campers themselves. Tripper befriends Rudy, a loner camper who has trouble fitting in. As Tripper inspires his young charges to defeat rival Camp Mohawk in the annual Olympiad competition, Rudy plays matchmaker between Tripper and Roxanne, a female counselor at Northstar.",
      "tmdbMovieId": 14035,
      "avgRating": 3.17344,
      "releaseYear": "1979",
      "numRatings": 2191,
      "posterPath": "/o0NmLgnCVph7I07OP0yKGPFoLrO.jpg"
   }
}