{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0087700",
      "video": false,
      "title": "Meatballs Part II",
      "recommendations": [
         40773,
         40772,
         18543,
         24826,
         14035,
         27397,
         16889
      ],
      "backdrop_path": "/25wRCuui803bnBsLhVh7UoAoct1.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Coach Giddy",
               "gender": 2,
               "credit_id": "557ff2f19251412f200014b6",
               "name": "Richard Mulligan",
               "profile_path": "/8WhTCXvnAZgfOMQJEZK7DFJcJJI.jpg",
               "id": 58661,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Colonel Batjack Hershy",
               "gender": 2,
               "credit_id": "557ff3009251412f200014b8",
               "name": "Hamilton Camp",
               "profile_path": "/tB43NEMeqmQM4zQQc5zk0IIcqg3.jpg",
               "id": 101606,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Armand 'Flash' Carducci",
               "gender": 2,
               "credit_id": "557ff30e9251412f2300148a",
               "name": "John Mengatti",
               "profile_path": null,
               "id": 1217504,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Cheryl",
               "gender": 1,
               "credit_id": "557ff31cc3a36871ad0015e3",
               "name": "Kim Richards",
               "profile_path": "/jTO90DPcHXesL7cSudasucD9xGW.jpg",
               "id": 53261,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Jamie/Voice of Meathead",
               "gender": 2,
               "credit_id": "557ff329c3a36871b000148b",
               "name": "Archie Hahn",
               "profile_path": "/zoJxxnnIexRpLGDJ9NOxQeY0Tcz.jpg",
               "id": 93670,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Fanny",
               "gender": 0,
               "credit_id": "557ff335c3a36871b30013fd",
               "name": "Misty Rowe",
               "profile_path": "/y4suV8wyFrmZZ8VApvP5VuZZSlh.jpg",
               "id": 115488,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Lieutenant Felix Foxglove",
               "gender": 2,
               "credit_id": "557ff3419251412f100015b2",
               "name": "John Larroquette",
               "profile_path": "/2JCgM1nqdxZUQv1qsE3BJu4fnRr.jpg",
               "id": 14101,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Albert/Hara Krishna",
               "gender": 2,
               "credit_id": "557ff34d9251412f17001585",
               "name": "Paul Reubens",
               "profile_path": "/qiY2maQ1iFnoaUiGNGLTKnaj3Xu.jpg",
               "id": 5129,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Boomer",
               "gender": 2,
               "credit_id": "557ff3599251412f120014e9",
               "name": "Joe Nipote",
               "profile_path": null,
               "id": 159788,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Tommy",
               "gender": 2,
               "credit_id": "557ff3659251412f1700158a",
               "name": "Jason Hervey",
               "profile_path": "/5iPGOkmXarMbMLQfBPUNQRWVCqQ.jpg",
               "id": 94500,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Mother",
               "gender": 0,
               "credit_id": "557ff3749251412f2300149e",
               "name": "Elayne Boosler",
               "profile_path": null,
               "id": 132814,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Daughter",
               "gender": 0,
               "credit_id": "557ff382c3a36871ad0015f4",
               "name": "Nancy Glass",
               "profile_path": null,
               "id": 1222309,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Meathead",
               "gender": 2,
               "credit_id": "557ff38c9251412f0e0014e7",
               "name": "Felix Silla",
               "profile_path": "/zyJCqRsxZwnxhed758bnJUHhgeu.jpg",
               "id": 33853,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Chief Rawhide",
               "gender": 2,
               "credit_id": "557ff3a1c3a36871a9001572",
               "name": "Joaquin Martinez",
               "profile_path": "/uz2DcuAPULU77T2PZrqkR4TfG8m.jpg",
               "id": 84240,
               "order": 14
            },
            {
               "cast_id": 17,
               "character": "Sargeant Paladin",
               "gender": 2,
               "credit_id": "557ff3b1c3a36871bb00140b",
               "name": "Blackie Dammett",
               "profile_path": null,
               "id": 157467,
               "order": 15
            },
            {
               "cast_id": 18,
               "character": "Mad Dog",
               "gender": 2,
               "credit_id": "557ff3bc9251412f17001594",
               "name": "Donald Gibb",
               "profile_path": "/drLNhfpcY1A8WxTVUE05ja47K9q.jpg",
               "id": 70254,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe45a2c3a36847f80d2015",
               "name": "Ken Wiederhorn",
               "profile_path": null,
               "id": 92851,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "557ff3d1c3a36871a900157d",
               "name": "Martin Kitrosser",
               "profile_path": null,
               "id": 58809,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "557ff3dcc3a36871a9001580",
               "name": "Carol Watson",
               "profile_path": null,
               "id": 58810,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "557ff3ec9251412f0e0014f0",
               "name": "Bruce Franklin Singer",
               "profile_path": null,
               "id": 169939,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 1.463565,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 40771,
      "vote_count": 14,
      "budget": 0,
      "overview": "The second in-name-only sequel to the first Meatballs summer camp movie sets us at Camp Sasquash where the owner Giddy tries to keep his camp open after it's threatened with foreclosure after Hershey, the militant owner of Camp Patton located just across the lake, wants to buy the entire lake area to expand Camp Patton. Giddy suggests settling the issue with the traditional end-of-the-summer boxing match over rights to the lake. Meanwhile, a tough, inner city punk, nicknamed Flash, is at Camp Sasquash for community service as a counselor-in-training where he sets his sights on the naive and intellectual Cheryl, while Flash's young charges befriend an alien, whom they name Meathead, also staying at the camp for the summer.",
      "similar": [],
      "original_title": "Meatballs Part II",
      "runtime": 86,
      "poster_path": "/pggJQTmfAXaQEnyQbY1N7PLCpp2.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/rzgMLzPgJ2ZBYnlVwNi8ZDfOMwo.png",
            "name": "TriStar Pictures",
            "id": 559,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Space Productions",
            "id": 6262,
            "origin_country": ""
         }
      ],
      "release_date": "1984-07-27",
      "vote_average": 3.6,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Meatballs Collection",
         "id": 48037,
         "poster_path": "/jofx9VG0EqStZhdA8hXerNDn5bq.jpg"
      },
      "tagline": "The insanity continues...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ken Wiederhorn"],
      "runtime": 87,
      "synopsis": null,
      "writers": [
         "Martin Kitrosser",
         "Carol Watson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0087700/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BOTU1NDkwODAxMF5BMl5BanBnXkFtZTcwMzEyMzExNQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Richard Mulligan, Hamilton Camp, John Mengatti | See full cast and crew »"],
      "reviews": [
         "The first \"Meatballs\" had Bill Murray, Chris Makepeace, a lot of laughs and no alien subplot. \"Meatballs II\" has Richard Mulligan, Paul (Pee-Wee Herman) Ruebens, Hamilton Camp, Archie Hahn, John Larroquette, a few laughs and an alien subplot. By the time \"Meatballs II\" came out, there had already been so many ripoffs of \"Meatballs\" that this just paled liberally by comparison (TIDBIT - this in fact was a \"Meatballs\" ripoff originally, until the rights were grabbed up and it was released instead as \"Meatballs II\". Who says there aren't any new ideas in Hollywood?). In spite of the mountain of talent in \"Meatballs II\", there is little in the way of actual humor. Instead, you have a hyperventilating Richard Mulligan, an off-center Paul Reubens playing in Pee-Wee mode, a screaming Hamilton Camp, a horny Archie Hahn, a lisping John Laroquette, and your usual plethora of horny teens, junior class military cadets, brain-dead boxers, and pot-smoking aliens who ask why camp counselors are such dorks. There's the major laughs; do with them what you will. And whatever you do with these laughs, it's more than what \"Meatballs II\" could ever do with them. Two and a half stars. Maybe there's just something about Pee-Wee Herman. Or John Larroquette. Or Richard Mulligan....",
         "I was working at an actual summer camp the Summer this piece of crap was released. It was my sixth year at camp, as camper and counselor, and a big bunch of us (counselors) went on a day off to see it, with huge expectations. Needless to say, this 'film' has absolutely nothing to do with the mighty original. Rent the DVD of the original and watch the 'making of' part. It's a third as long and a hundred times better than this \"sequel\". I give it 2/10 only because there might be enough weed on Earth to make this vaguely amusing. Assuming you're watching it on a TV with only one channel. IMDb demands ten lines of text to post a comment, so I guess they are intimately involved with the cretins that thought this was a viable movie. Actually, I'm sure they made money on it due to a budget of twelve dollars. The film was shot with a MONO soundtrack? Yeah, that's the way to save a couple grand! If only it had gone straight to VHS - I'd have saved my $3.75 back in 1984.",
         "Meatballs Part II (1984) is a major step down from the first film. Once again, whenever a film is a major (or a minor) success they always made a sequel during the eighties. This one is a mediocre effort, not only from the director but the entire cast. Not an unwatchable film but if you're expecting something like the first film you'll be mightily disappointed. If you like weak teenage \"sex\" comedies this might tide you over. The film concerns the camp site from the first film. Their very existent is being threatened by a local junior boot camp. The two camps have an annual boxing match to settle their differences and in the spirit of competition. But this time the stakes are high, the commander of the camp has made a deal with the rightful owners of the land. This time the boxing match means much more than simple bragging rights. The usual suspects can be found in this film. Such eighties stars such as Kim Richards, Richard Mulligan, Paul Reubens, Jason Hervey and John Larroqutte. Be on the look out for a Jewish space alien! I wouldn't recommend this movie unless you're a huge fan of the Meatball film series.",
         "To call this movie a sequel to MEATBALLS is stretching the word \"sequel\" to a ridiculous degree. Other than the fact that both movies take place at summer camps (not even the same one), there is no connection between the two. It's the usual 80's cable TV time filler, with a dumb script, mechanical direction and mostly one-note performances. The only laughs are supplied by such great comic actors as Richard Mulligan, Paul Reubens (aka Pee-Wee Herman), John Larroquette and Hamilton Camp. A subplot which parodies E.T. also managed to make me chuckle a few times. The only other point of interest is seeing a twenty-year old Kim Richards in the lead female role. The little tomboy from ESCAPE TO WITCH MOUNTAIN and NO DEPOSIT, NO RETURN had grown into quite a hottie by 1984. Unfortunately, she leaves her clothes on. If this comes on TV, it's not worth switching the channel. You'll probably laugh a few times, plus you can get up and go to the bathroom and not miss anything. At any rate, it's better than MEATBALLS PART III or (gag) IV.",
         "Okay, so this movie isn't great but its a good way to waste a rainy summer day. That's how I ended up seeing it. To be truthful, I thought there would be a lot more nudity and sex. The box for the movie shows a shower scene that isn't in the movie. The box also features a picture of the busty Fanny, played by Misty Rowe. That was the most interesting story line: Two horny Councelors trying to get it on. It was only later on that I found out that Misty Rowe isn't nearly as top heavy as Fanny. Well, I'll always have Meatballs Part II to keep the dream alive. There was a lot of potential, but instead we had aliens and a stupid boxing match. Good lines, and okay women. It's worth a look.",
         "\"I have an idea\" someone said, \"lets make a sequel to Meatballs and have it be completely moronic and groan inducing!\". After the movie was made and released the person said \"dude, I was making a joke\". And so Meatballs 2 was made and while it is in fact about a summer camp and more of a sequel to the original than the third one is, I still think this one is the worst of the bunch. Granted a few jokes make me chuckle which is why I nicely gave this movie a three rather than a one or two. The plot? Why bother, it involves some dude who does not want to be a counselor, an alien, and a brawl for it all boxing match between two summer camps, one regular and a military type one. That is the gist of it, and if you are wondering, yes the alien is friendly and probably inserted thanks to the success of E.T. two years prior. Bill Murray is not in this movie and can you blame him, while they made this movie he was making Ghostbusters. Instead they got Richard Mulligan, who I like in some roles, not this one. They also begin easing this series of movies into more of a teen sex series, but only lightly in this one.",
         "Screeching noises! Did you know that the purpose of movies is solely to make money. Its sad. This movie was made for money's sake, how much money could that possibly be? I mean think about it, Meatballs 2, how can that be of value? Did people die to make this movie? If somebody did die making this movie, because it's this movie, doesn't that mean they died in vain? They made two other Meatballs movies after this one, what the hell!? Who are you that you even legitimately enjoy Summer Camp themed movies? How? If you want to see nudity they make porn, if you want to see a comedy they make actual comedies, you don't have to settle for this movie. I just thought someone should tell you.",
         "This movie is one I fondly remember viewing at a birthday party soon after it came out on VHS. I'm not going to call it good, because I know it wasn't. I do however remember a good racing scene between a bunch of teenagers in a trailer and a kid in a motorized (new at the time) wheelchair. I also seem to remember an alien being in this film, kind of like the alien in the TV show 'American Dad', but alas I can't remember quite what it looked like. I don't remember this film wining any awards, and I can't recall anyone in the cast. I can't recall the scene on the cover occurring in the film either, but I would be proud to hang a framed copy of that movie poster on my living room wall next to my collection of taxidermy.",
         "To be honest that's not really saying much, since this series really wasn't all that good to begin with & the fact that each film is an in name only sequel to the original BILL MURRY movie. This time, the producers either couldn't afford Murry, he didn't want to come back or they never asked him to come back to star in this one & judging by the films alternate title, it was probably released under the MEATBALLS name to catch hold of fans of the first movie & wasn't intended as a sequel at all. If any thing (& this is just my opinion) MEATBALLS 2, is a much better movie than the first & definitely not for kids, with the amount of language that takes place in the movie. Nonetheless the movie is quiet humorous, as we watch the usual summer camp hijinks occur between two rival summer camps who are at each others throats while a Jewish alien roams among them unnoticed as he tags along with a group of little kids (I'm not joking!) finally it's decided by both camps that a boxing match is to take place at the films climax to settle their differences, because that's how problems are solved in films like this. Nonetheless fans of this disconnected series should find plenty to like here, there's plenty of comedy & always something going on, plus the direction/acting & writing are better than usual. The sequels went down hill from here, becoming badly written, B movie sex comedies that just got worse & worse with each passing sequel. Followed by MEATBALLS 3. *** stars",
         "Possibly the only movie in history to feature an alien that goes to camp, MEATBALLS PART 2 once again proves that sequels are almost never as good as the original. That's not to say that MEATBALLS PART 2 isn't absolutely hilarious, it's just not as funny as the first one. The movie begins with a great scene featuring Paul Reubens (also known as Pee Wee Herman) as the bus driver unlucky enough to drive the misfit teenage campers to Camp Sasquatch. After that highly amusing opening sequence, the movie slows down for a while and the laugh quotient lowers until the arrival of the alien. The pace then picks up and the laugh quotient begins to rise again. Other than that slow pacing towards the beginning of the movie mentioned above, the only other notable flaw is how horribly cliched the story is. Granted basically all 80s comedies are as cliched as can be, but I was expecting a bit more originality. **1/2"
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Space Productions"],
      "summaries": [
         "The second in-name-only sequel to the first Meatballs summer camp movie sets us at Camp Sasquash where the owner Giddy tries to keep his camp open after it's threatened with foreclosure after Hershey, the militant owner of Camp Patton located just across the lake, wants to buy the entire lake area to expand Camp Patton. Giddy suggests settling the issue with the traditional end-of-the-summer boxing match over rights to the lake. Meanwhile, a tough, inner city punk, nicknamed Flash, is at Camp Sasquash for community service as a counselor-in-training where he sets his sights on the naive and intellectual Cheryl, while Flash's young charges befriend an alien, whom they name Meathead, also staying at the camp for the summer.",
         "Second in the series of Meatball movies. A group of kids attempt to save a summer camp that's a financial failure."
      ],
      "budget": 0
   },
   "movielensId": 3041,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1984-07-27",
      "dvdReleaseDate": null,
      "directors": ["Ken Wiederhorn"],
      "runtime": 86,
      "movieId": 3041,
      "title": "Meatballs Part II",
      "mpaa": "PG",
      "actors": [
         "Richard Mulligan",
         "Hamilton Camp",
         "John Mengatti",
         "Kim Richards",
         "Archie Hahn",
         "Misty Rowe",
         "John Larroquette",
         "Paul Reubens",
         "Joe Nipote",
         "Jason Hervey",
         "Elayne Boosler",
         "Nancy Glass",
         "Felix Silla",
         "Joaquin Martinez",
         "Blackie Dammett",
         "Donald Gibb"
      ],
      "imdbMovieId": "0087700",
      "originalTitle": "Meatballs Part II",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "The second in-name-only sequel to the first Meatballs summer camp movie sets us at Camp Sasquash where the owner Giddy tries to keep his camp open after it's threatened with foreclosure after Hershey, the militant owner of Camp Patton located just across the lake, wants to buy the entire lake area to expand Camp Patton. Giddy suggests settling the issue with the traditional end-of-the-summer boxing match over rights to the lake. Meanwhile, a tough, inner city punk, nicknamed Flash, is at Camp Sasquash for community service as a counselor-in-training where he sets his sights on the naive and intellectual Cheryl, while Flash's young charges befriend an alien, whom they name Meathead, also staying at the camp for the summer.",
      "tmdbMovieId": 40771,
      "avgRating": 1.80724,
      "releaseYear": "1984",
      "numRatings": 511,
      "posterPath": "/pggJQTmfAXaQEnyQbY1N7PLCpp2.jpg"
   }
}