{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "sport",
         "id": 6075
      }],
      "imdb_id": "tt0104837",
      "video": false,
      "title": "Meatballs 4",
      "recommendations": [],
      "backdrop_path": "/mrZgKhiv3p4FSKRrOA0weJ0fUQt.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Ricky Wade",
               "gender": 2,
               "credit_id": "52fe45a2c3a36847f80d2059",
               "name": "Corey Feldman",
               "profile_path": "/odE8az9kgHCkWMtWzfmcDBuZiww.jpg",
               "id": 3034,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Neil Peterson",
               "gender": 2,
               "credit_id": "52fe45a2c3a36847f80d205d",
               "name": "Jack Nance",
               "profile_path": "/fN9LyZnztco8Tk7NpV0JiGnFkIy.jpg",
               "id": 6718,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Monica Shavetts",
               "gender": 1,
               "credit_id": "52fe45a2c3a36847f80d2061",
               "name": "Sarah Douglas",
               "profile_path": "/t0FE7AH4c9O7ro4QK6wis3RfzEv.jpg",
               "id": 31364,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Howie Duncan",
               "gender": 2,
               "credit_id": "52fe45a2c3a36847f80d2065",
               "name": "J. Trevor Edmond",
               "profile_path": "/of86x65KvqZRjzD0ZK9MMPC8ITe.jpg",
               "id": 56439,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Neriah",
               "gender": 1,
               "credit_id": "557ff18fc3a36871ab00170e",
               "name": "Neriah Davis",
               "profile_path": "/kw8QnfRZu1nPIl52GelfSGdXHaZ.jpg",
               "id": 158105,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Kristi",
               "gender": 1,
               "credit_id": "557ff19f9251412f0e0014c2",
               "name": "Kristi Ducati",
               "profile_path": "/irgMR4lLdgphaFtqjglhkNVOUsU.jpg",
               "id": 101094,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Jennifer Lipton",
               "gender": 0,
               "credit_id": "557ff1b2c3a36871bb0013e2",
               "name": "Paige French",
               "profile_path": null,
               "id": 200880,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Lauren",
               "gender": 1,
               "credit_id": "557ff1bec3a36871ad0015b9",
               "name": "Lauren Hays",
               "profile_path": "/zs8JoclXAsfmwtjZ8nCwXhlscr1.jpg",
               "id": 1477801,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Miche",
               "gender": 0,
               "credit_id": "557ff1cb9251412f120014d4",
               "name": "Miche Straube",
               "profile_path": null,
               "id": 1477802,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Hillary",
               "gender": 0,
               "credit_id": "557ff1d7c3a36871b0001472",
               "name": "Cristy Thom",
               "profile_path": null,
               "id": 1477803,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Kelly Peterson",
               "gender": 0,
               "credit_id": "557ff1ed9251412f1000159b",
               "name": "Deborah Tucker",
               "profile_path": null,
               "id": 1228552,
               "order": 10
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe45a2c3a36847f80d2055",
            "name": "Bob Logan",
            "profile_path": null,
            "id": 69667,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 2.732806,
      "production_countries": [],
      "id": 40773,
      "vote_count": 6,
      "budget": 0,
      "overview": "Ricky is the hottest water-ski instructor around and he has just be rehired by his former employer/camp to whip up attendance. But the camp is in serious financial trouble and the owner of a rival, more popular, camp wants to buy them out. Therefore they will have to engage in a mean, winner-takes-all competition that will settle the row once and for all.",
      "similar": [
         10393,
         9655,
         9291,
         2300,
         4942,
         11287,
         22881,
         8923,
         10637,
         13416,
         323677,
         86130,
         37136,
         9614,
         9390,
         920,
         42888,
         9472,
         11770,
         17108
      ],
      "original_title": "Meatballs 4",
      "runtime": 84,
      "poster_path": "/2BdGVzFkZPQG9r1wOAq3Gkct3YM.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1992-03-06",
      "vote_average": 3.2,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Meatballs Collection",
         "id": 48037,
         "poster_path": "/jofx9VG0EqStZhdA8hXerNDn5bq.jpg"
      },
      "tagline": "There's only one thing wilder, crazier and sexier then last summer - this summer.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Bob Logan"],
      "runtime": 84,
      "synopsis": null,
      "writers": ["Bob Logan"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0104837/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc2MzMwNzczNl5BMl5BanBnXkFtZTcwMDkzOTM1MQ@@._V1_SY317_CR8,0,214,317_AL_.jpg",
      "actors": ["Stars: Corey Feldman, Jack Nance, Sarah Douglas | See full cast and crew »"],
      "reviews": [
         "How's that for an endorsement? This movie is just bad..Corey Feldman stars and tries to save a water ski camp (huh?) from being taken over by the evil competitor..the usual hi jinks ensue with the usual T & A not that T & A is bad ...there are some former playmates here but it is definitely not worth this drivel..on a scale of one to ten..0",
         "If you've seen this movie you might have realised it, but this wasn't even actually intended to be a \"Meatballs\"-sequel. They just put a \"Meatballs\"-sticker on some random summer camp movie and hoped that somehow would make it suck less. But anyway, a couple of playmates that do absolutely EVERYTHING topless, an annoying fat teenager who looks 42 and will definitely take a playmate home and Corey Feldman at the highlight of his career all take on an evil rich woman who wants to steal an old guy's (played by Jack Nance, WTF?) summer camp. The guy sees no other option than to sell the camp but Corey Feldman, who looks really bored throughout this movie, has an idea: beating evil woman's team at water-skiing. I don't know much about that constitution, but I'm pretty sure it doesn't say: The ownership of all properties will be settled by water-skiing contests. From what I know, it works with paying money and stuff like that. But anyway, you'll never guess how it ends. However, does anybody care about how boring, predictable and unfunny this movie is? I mean: it's T&A, there's T, there's A, no reason to complain. Stuffing plot holes with boobs is still as brilliant as it was when it was invented, may the tradition go on forever. But still, this is a way too light movie that you forget the instant it's over. What the heck am I commenting on again?",
         "Jack(eraser-head) Nance must have been in a bad place in life to accept this role. Feldman, what to say besides; Drug use. His solo dance sequence plays out like a vivid fever dream. Watch at the end of the film as Feldman is delivering a joke and his frigging' tooth falls out.The script is non-existent, I mean even in some of the worst T and A pictures of all time there are some chuckles to be had;not here. Most of the cast made me fighting mad with their hair do's (or don'ts as the case may be)and who in the fun*k is going to believe that people think Feldman is cool. He looks like a 12 year old who got into his mom's cross tops, he kind of reminds me of an old neighbor I hate, which makes me want to fight him even more. In the end, I can only wish bad things on the people that made this picture, I would have rather had them spend their money on hookers and hard drugs, at least then we know some professionals would have been involved.",
         "I can't say enough bad things about this heap of garbage. If a movie makes you roll your eyes and say things like, \"Ugh, how stupid\" every 5 minutes, then you know it's time to toss the bastard in the garbage. And that's what should have happened to this script. It's amazing to think that a studio actually granted this piece of crap. What makes 'Meatballs 4' really sickening is Corey Feldman's ego maniacal character. Talk about a guy who strokes his ego more than his carrot! Apparently, Ricky is infallible in damn near every water sport and revenge tactic. It never makes much sense, and it infuriates me that so much money was spent and wasted in making this heap of crap. I understand this was never intended to be part of the Meatballs series, but seriously, somebody should have sued. At least someone would have made some money from this movie! I recommend to stay away from this and rent 'Surf 2' instead. You'll get more laughs, and plus there's a plot to go with it.",
         "You know you're dealing with a bad movie when Corey Feldman is the best thing about it, and even he is at his worst in this one. The dialogue writing is atrocious, the story is worse than cliched, and the characters...well, there aren't any characters in this one. The only reason you'd ever want to waste time seeing this is to laugh at Corey Feldman's solo dance scene. I find it hard to believe that anyone connected to the movie thought that his dancing was \"cool\". I watched this on the local late night movie channel, and really wished I'd fallen asleep instead.",
         "I saw this movie and actually though it was pretty good. If you compare it to the other Meatballs movies. The writers seem to went back to what the original Meatballs movie had. Simple fun for adults...not kiddie camp stuff like 2 had. No Aliens, no dead sex star ghosts. Back to the original theme of male chauvinistic rivalry and competition between camps. But as Grum-3 says..yes the best thing about is Corey Feldman...but is obvious the script dialog was pretty poor but it still had me laughing and enjoying the fun of it. It wasn't ever meant to be a blockbuster, just simple fun.",
         "I think if anything, Meatballs 4 proves that there shouldn't have been three sequels. This rather limp summer camp comedy tries to coast by on Cory Feldman's deteriorating star power. It concerns Camp Lakeview's competition with a more successful affluent Camp Twin Oaks. Bug-eyed Jack Nance stars as Neil Peterson, Lakeview's owner who is facing a mortgage crisis, approached by Twin Oaks' Monica Shavetts(Sarah Douglas)to sell his camp so she can turn it into a golf course. He hires Ricky Wade(Feldman)to help turn things around as the annual water ski meet is on the horizon between Lakeview and Twin Oaks. This fourth film in the tired Meatballs series doesn't have an inspired joke in it's arsenal, and only has hot girls and naked breasts to atone for the lackluster material. Lots of water sports stunts, with Feldman pulling another Michael Jackson dance session that was as cumbersome as the dying summer camp comedy whose heyday had long passed after the 80's was over. The cast, to their credit, gives it their best shot, but the screenplay doesn't do them any favors. It is, after all, about the laughs and when I found myself dozing off periodically, having not even giggled out loud once, I knew that Meatballs 4 was officially the final nail in the coffin of a franchise that never should've existed to begin with. There is a clumsy large fellow whose size and easy-going nature is the butt of jokes,allowed to save the day for our heroes and gets the chick at the end, so maybe this tells you all you need to know about the movie. Of course, Shavetts is an underhanded wealthy woman determined to see she attains the rights to Lakeview(..and Ricky)so she'll use every sneaky technique possible, including her two hired goons who wreak havoc on the summer campers, in turn causing those perturbed to leave for home. Nance looks as if he'd been sniffing glue, during his many scenes with Feldman. Feldman is having relationship problems with Nance's granddaughter after leaving for a momentary stint to Twin Oaks. Feldman hopes to save the camp so that she can be in charge of it when Nance passes on. Feldman, of course, is a talented water skier who hopes to accomplish a historic triple flip in order to win the stunt competition. Thanks to Shavetts, they will have to overcome chicanery and cheating in order to do so.",
         "Teenage, Summer Camp, Tits n'Ass movies can almost justify a minor sub-genre of their own - I'll wager there is the odd student thesis floating around, discussing their effect on late 20th Century American history. 'Meatballs 4' is a sequel in name only (in the UK it was retitled 'Summer Vacation'), and is a dumb pointless release which will provide shallow laughs for the most undiscerning adolescent male. The story, for what its worth, involves the rivalry between two summer camps, one of which is trying to buy-out the other. Things stumble along until the watersports competition finale between the camps which will decide the fate of each. It's a complete waste of your reading time and my typing fingers to go into any more detail. The film is rubbish, but there is no point in criticising it for this - it doesn't fail to live up to expectations because it doesn't have any. You don't go to a burger bar for nouvelle cuisine and you don't put 'Meatballs 4' in your video hoping for 'Battleship Potemkin'. BEST SCENE - the film peaks early with a superb naked college girls shower scene.",
         "This is quite possibly the worst movie ever made. This movie was made in 1992, but it can still be seen occasionally on some of the less reputable cable TV channels in the middle of the night. If I had to choose between watching this movie again and death, I would choose death! I will not watch Corey Feldman dance like Michael Jackson again. He must grab his crotch about 50 times in 10 seconds of screen time. If I \"spoiled\" this movie for you, you should be thanking me. Trust me, do not waste a second of your life watching this movie. Any remaining VHS copies of this movie should be dropped on North Korea. I don't think they bothered producing any DVDs of this piece of trash.",
         "There are certain films that distinguish themselves for a multitude of significant reasons. This remarkably profound and provocative celluloid meditation on man's deep-seated need to party, have fun, and, most importantly, see beautiful young women naked rates highly as a true work of cinematic art. For starters, the almighty Corey Feldman hits it out of the ballpark with his exemplary performance as cocky and charismatic maverick water skier and recreation director Ricky Wade: Whether he's busting some flashy Michael Jackson-style moves on the dance floor or dropping an ingenious reference to \"The Goonies\" while looking directly at the camera (and staring straight into the viewer's very soul), The Feldog's magnetic presence positively galvanizes the screen. The brilliant acting by the rest of the cast likewise warrants major kudos: Jack Nance works twitchy magic as madcap camp owner Neil Peterson, Sarah Douglas bitches it up with divinely snarky aplomb as the evil Monica Shavetts, and Brad Grunberg delivers a heart-wrenching portrayal of hapless bumbling fat guy Victor Thigpen. The bevy of fine looking gals in juicy roles helps a lot: Paige French as the sexy'n'spunky Jennifer Lipton, ravishing redhead Deborah Tucker as the sweet and pretty Kelly Peterson, and, best of all, delectable Playboy Playmate Cristy Thom as the scrumptious Hillary (who bares her marvelous breasts at one crucial point simply because she can). Writer/director Brad Logan not only provides a wealth of hot babes in skimpy bikinis and loads of delicious copious gratuitous distaff nudity (yep, we even get a very tasty group shower sequence!), but also deftly milks the inspired and incisive giddy lowbrow humor for maximum hilarity. The water skiing set pieces are staged with utmost precision and dexterity. Vance Burberry's exquisite cinematography vividly captures the merry frolicking while the cool rocking score gives the picture an extra rousing kick. Masterful stuff."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Planet Productions"],
      "summaries": ["Ricky is the hottest water-ski instructor around and he has just be rehired by his former employer/camp to whip up attendance. But the camp is in serious financial trouble and the owner of a rival, more popular, camp wants to buy them out. Therefore they will have to engage in a mean, winner-takes-all competition that will settle the row once and for all."],
      "budget": 0
   },
   "movielensId": 3043,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1992-03-06",
      "dvdReleaseDate": "2007-08-28",
      "directors": ["Bob Logan"],
      "runtime": 84,
      "movieId": 3043,
      "title": "Meatballs 4",
      "mpaa": "R",
      "actors": [
         "Corey Feldman",
         "Jack Nance",
         "Sarah Douglas",
         "J. Trevor Edmond",
         "Neriah Davis",
         "Kristi Ducati",
         "Paige French",
         "Lauren Hays",
         "Miche Straube",
         "Cristy Thom",
         "Deborah Tucker"
      ],
      "imdbMovieId": "0104837",
      "originalTitle": "Meatballs 4",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["uibGzEYgwHE"],
      "plotSummary": "Ricky is the hottest water-ski instructor around and he has just be rehired by his former employer/camp to whip up attendance. But the camp is in serious financial trouble and the owner of a rival, more popular, camp wants to buy them out. Therefore they will have to engage in a mean, winner-takes-all competition that will settle the row once and for all.",
      "tmdbMovieId": 40773,
      "avgRating": 1.73265,
      "releaseYear": "1992",
      "numRatings": 245,
      "posterPath": "/2BdGVzFkZPQG9r1wOAq3Gkct3YM.jpg"
   }
}