{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "amnesia",
            "id": 1453
         },
         {
            "name": "nightmare",
            "id": 3030
         },
         {
            "name": "hypnosis",
            "id": 3363
         },
         {
            "name": "suspense",
            "id": 9937
         },
         {
            "name": "therapy",
            "id": 40952
         }
      ],
      "imdb_id": "tt0101669",
      "video": false,
      "title": "Dead Again",
      "recommendations": [
         2246,
         2071,
         10013,
         9491,
         8130,
         988,
         11896,
         12772,
         2107,
         25284,
         13776,
         25010,
         12710,
         31652,
         13346,
         11060,
         35151,
         3101,
         2990,
         10337
      ],
      "backdrop_path": "/tEcmclYXFNvFonqtPwG4aemiu3r.jpg",
      "revenue": 38016380,
      "reviews": [{
         "author": "talisencrw",
         "id": "577d5d779251415da4001cff",
         "content": "By far, my favourite film of Branagh's that he's directed. A solid mystery/thriller--the kind that's not done enough these days IMHO. Though he's certainly diversified his oeuvre recently, what with Disney remakes and even superhero films, I wish he had done a lot more like this one, rather than, high-quality as they are, a metric tonne of yet-more Shakespearean adaptations.",
         "url": "https://www.themoviedb.org/review/577d5d779251415da4001cff"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Roman Strauss / Mike Church",
               "gender": 2,
               "credit_id": "52fe444b9251416c7502fbc5",
               "name": "Kenneth Branagh",
               "profile_path": "/bmpGjbqvAVNOK3ggiuET2Jl96tZ.jpg",
               "id": 11181,
               "order": 0
            },
            {
               "cast_id": 13,
               "character": "Franklyn Madson",
               "gender": 2,
               "credit_id": "52fe444b9251416c7502fbff",
               "name": "Derek Jacobi",
               "profile_path": "/jJ4MkVS59gCfJhWMfLTbeHKjoyC.jpg",
               "id": 937,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Gray Baker",
               "gender": 2,
               "credit_id": "52fe444b9251416c7502fbcd",
               "name": "Andy García",
               "profile_path": "/zE3KYH6f6cxCehJJYKDTQa8sCaK.jpg",
               "id": 1271,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Doctor Cozy Carlisle",
               "gender": 2,
               "credit_id": "52fe444b9251416c7502fbf7",
               "name": "Robin Williams",
               "profile_path": "/5KebSMXT8uj2D0gkaMFJ8VEp53.jpg",
               "id": 2157,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Schwester Constance",
               "gender": 0,
               "credit_id": "52fe444b9251416c7502fbd5",
               "name": "Lois Hall",
               "profile_path": "/k6AR981Wne31IhGAGxrb7FSalV7.jpg",
               "id": 69642,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Margaret Strauss / Grace",
               "gender": 1,
               "credit_id": "52fe444b9251416c7502fbfb",
               "name": "Emma Thompson",
               "profile_path": "/cWTBHN8kLf6yapxiaQD9C6N1uMw.jpg",
               "id": 7056,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "'Piccolo' Pete Dugan",
               "gender": 2,
               "credit_id": "52fe444b9251416c7502fc03",
               "name": "Wayne Knight",
               "profile_path": "/oW9aeZwkz1S1IMjQGtd9mnvlEax.jpg",
               "id": 4201,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Inga",
               "gender": 1,
               "credit_id": "52fe444b9251416c7502fc07",
               "name": "Hanna Schygulla",
               "profile_path": "/rlM0TCA5NNLQ9SwP4Cn4PhmaGgy.jpg",
               "id": 3734,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Doug",
               "gender": 2,
               "credit_id": "52fe444b9251416c7502fc0b",
               "name": "Campbell Scott",
               "profile_path": "/LpYIN2jh58sHaUFM2r3G4G0iE6.jpg",
               "id": 55152,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Lydia Larsen",
               "gender": 1,
               "credit_id": "52fe444b9251416c7502fc0f",
               "name": "Christine Ebersole",
               "profile_path": "/dl8uNpIyYeGpjA90C0W1SGSsfla.jpg",
               "id": 4003,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Lady (uncredited)",
               "gender": 1,
               "credit_id": "530712a4c3a36854860002aa",
               "name": "Miriam Margolyes",
               "profile_path": "/7Fijg5sZ7gKbooq6tId3MUS5sDY.jpg",
               "id": 6199,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe444b9251416c7502fbdb",
               "name": "Scott Frank",
               "profile_path": "/hV0DEtOsiiQAMb7Oqo2VEII8o2l.jpg",
               "id": 2199,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe444b9251416c7502fbe1",
               "name": "Kenneth Branagh",
               "profile_path": "/bmpGjbqvAVNOK3ggiuET2Jl96tZ.jpg",
               "id": 11181,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe444b9251416c7502fbe7",
               "name": "Patrick Doyle",
               "profile_path": "/mo87kZiHO5gsoax80Us0S2CPmS.jpg",
               "id": 9152,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe444b9251416c7502fbed",
               "name": "Sydney Pollack",
               "profile_path": "/zxkoU2diKtvarV1Qk4z9He2lJj9.jpg",
               "id": 2226,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe444b9251416c7502fbf3",
               "name": "Matthew F. Leonetti",
               "profile_path": null,
               "id": 2507,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Thriller",
         "id": 53
      }],
      "popularity": 6.090392,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11498,
      "vote_count": 103,
      "budget": 0,
      "overview": "In 1949 composer Roman Strauss is executed for the vicious murder of his wife Margaret with a pair of scissors. In 1990s Los Angeles a mute amnesiac woman shows up at an orphanage and private eye Mike Church is called in to investigate. Under hypnosis both the woman and Church seem to have a strange link back to the Strauss murder.",
      "similar": [
         1903,
         11284,
         638,
         396940,
         2502,
         1018,
         949,
         1586,
         189,
         77,
         281,
         207932,
         346685,
         336843,
         10072,
         8834,
         11601,
         11588,
         38,
         10285
      ],
      "original_title": "Dead Again",
      "runtime": 107,
      "poster_path": "/4bF41yspvDDtzlDLXsgwtKzEgwS.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1991-08-23",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "A Mystery About True Love...And Certain Death.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Kenneth Branagh"],
      "runtime": 107,
      "synopsis": "1990s LA police detective Mike Church took the case of amnesia-suffering mute client' Grace; she was having nightmares about the murder of a pianist named Margaret Strauss by her world-famous composer/conductor husband Roman Strauss in the late 1940s; Margaret had been suspicious that Roman's housekeeper Inga and her disturbed, stammering son Frankie were stealing her husband things; Roman was falsely put to death by electric chair for the murder of his wife Margaret, who was actually stabbed and murdered with a pair of scissors by Frankie, because his mother was in love with Roman; in the present day story, Mike came into contact with hypnotist/antique dealer Franklyn Madson who believed that Grace had suffered trauma in her past life; under regressive hypnosis, it was revealed that there were remarkable similarities and parallels between the stories of Roman and Margaret in the past, and Mike and Grace in the present; it was discovered that Mike was the reincarnation of murdered pianist wife, Margaret; and amnesia-suffering Grace was the reincarnation of executed composer Roman Strauss; the hypnotist (the murderer from the 40s) died when impaled on a large scissor sculpture made by 'Grace' and Mike held his partner 'Grace'.",
      "writers": ["Scott Frank"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0101669/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ2OTY5OTkyNV5BMl5BanBnXkFtZTYwNTIzNDE5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Kenneth Branagh, Emma Thompson, Andy Garcia | See full cast and crew »"],
      "reviews": [
         "Although he received tremendous praise for his memorable film production of Shakespeare's HENRY V, DEAD AGAIN was the film that really introduced actor/director Kenneth Branagh to mainstream American film, and for a time he and then-wife Emma Thompson were the most celebrated acting couple since Olivier and Leigh. The marriage did not last, but fortunately this film did--and I say fortunately, for although it is somewhat forgotten today, DEAD AGAIN is an overlooked jewel of a film: classy, noir-ish, stylish, and very memorable indeed. The story is fanciful. In the late 1940s noted composer Roman Strauss was convicted of murdering his noted pianist wife Margaret, and was sentenced to death. Some forty years later, a young woman suffering from amnesia falls into the hands of a no-nonsense Los Angeles private eye--and under hypnosis she recalls not her immediate past, but the lives of Roman and Margaret. Is this reincarnation? Is she Margaret Strauss? Is the private eye to whom she is attracted but of whom she is also strangely fearful the reincarnation of Roman Strauss, Margaret's killer? Is history repeating itself? Scott Frank's clever script makes for a fast-paced, twisting, and fascinating plot-driven film--and it is flawlessly played by Branagh and Thompson, who assume dual roles as the 1940s Roman and Margaret Strauss and the 1980s Mike Church and Grace. The supporting cast is also excellent, with memorable performances by Andy Garcia and Derek Jacobi--and a truly exceptional cameo by Robin Williams, who here for the first time demonstrated that his talents went far beyond comedy. The shifts between past and present, nightmare and reality are exceedingly well done, and although the plot becomes more and more fantastic the entire film is so perfectly executed that one buys into it every step of the way. If DEAD AGAIN has a flaw, it is that some of the twists and turns are predictable--but in the film's favor I must admit that it sweeps you along so quickly that you seldom have time to analyze that failing while you actually watch the film. It is also to a certain extent a \"one trick pony\" film; the film is at its most powerful upon a first viewing, when one is oblivious to what is coming. But even so, it is tremendously effective and it holds up as well today as when it first appeared on the big screen. The current DVD includes little in the way of extras beyond commentary tracks by producer Lindsay Doran, writer Scott Frank, and director-star Kenneth Branagh--and these are as hit-and-miss as commentary tracks usually are, but they hit more often than miss. The picture and sound quality is overall very good. Recommended! Gary F. Taylor, aka GFT, Amazon Reviewer",
         "Trying to work à la Hitchcock is a very perilous task:Kenneth Branagh walks out with honors.The numerous influences and nods are interesting:\"Notorious\" \"Rebecca\" \"Spellbound\" \"Vertigo\"\"dial M for murder\" come to mind but there are certainly more...Brannagh is a pupil who assimilates things easily.He's helped by a stellar cast:his then-wife Emma Thompson,really beautiful,Hanna Shygulla ,in an underwritten part ,Robin Williams,Campbell Scott,Andy Garcia -You want to stop smoking?Have a look at his last scene!-.... The marvelously far-fetched plot grabs the audience till the very end as the two stories meet.Brannagh and Thompson succeeded in creating two characters each .The director cleverly uses in turn color (present) and black and white (past).The finale in the flat where the amnesic girl keeps her surrealist works (a la Dali,like in \"spellbound\" ) is grand guignol at its best.That's entertainment!",
         "Dead Again is categorized as Mystery / Romance / Thriller and it does very well in all three categories. It begins as a mystery, develops into a romance and ends up very thrilling. It is also Gothic, film noir, sometimes melodramatic and often humorous: an unusual mix that really works. The opening credits show 1948 news stories about symphony conductor, Roman Strauss (Kenneth Branagh), who was executed for murdering his wife, Margaret (Emma Thompson). The film was in Black and White. Then the film switches to the present and to colour and we find Emma Thompson in a Catholics boys' home, mute and suffering from nightmares and amnesia. The priest in charge elicits free help from Mike Church (Kenneth Branagh), a private detective who specializes in missing persons and was brought up in that home. \"Grace\" (a name that she and Mike use because she does not know her real name) ends up staying with Mike while he tries to sort things out. An advertisement brings Franklyn Madson (Derek Jacobi), who offers to discover her past through hypnotic regression. He ends up regressing her into a past life. At this point, if one does not believe in reincarnation, as Mike Church did not, then one can add Fantasy to the list of the film's categories; it does very well in that category also. As fate would have it, Mike and Grace grow closer and fall in love, an event that is undoubtedly made more convincing by the fact that Branagh and Watson were happily married at the time that the film was made. The style of the modern romance contrasts with the melodrama of the 1940's marriage, in which Roman gives Margaret an anklet and says, \"The man I bought it from explained to me that when a husband gives this to his wife, they become two halves of the same person. Nothing can separate them, not even death.\" That idea helped to clarify the most surprising plot twist of all, one that is disclosed visually. The plot is one of the cleverest mystery plots that I have witnessed. One is never sure of what to think. Did Roman kill Margaret? If not then who did? Many look suspicious. What is the relationship between the past lovers, Roman and Margaret, and the present lovers, Mike and Grace? The plot has many twists and turns, all of which appear to be realistic. Clues drop like rain. There are many strong roles and the acting is excellent throughout. Many actors have roles in both stories.",
         "Dead Again is an absolutely amazing film! To call it anything less would be a complete insult.The film is so multi layered in charachter development, story growth and my god those fantastic twists and some truly winning and believable performances. Where have thrillers and films like this gone. They kept you up at night and got your adrenaline going. You didn't know what was happeneing until exactly the end and the tension building up was gratifying without the brilliant and dead on conclusion. where have they gone? Emma Thompson stars as a beautiful amnesia victim whom awakes in catholic shelter suffering from violent nightmares. Kenneth Brannagh stars as Mike Church a detective who becomes smitten with her and decides to help to find her identity. He enlists the help of a psychic and through those sessions they discover her past life and how she was murdered and how it's now relaying to her recent one. Now it's up to them to discover the facts before history tries to repeat itself.",
         "This movie is one of the unappreciated jewels of the 1990's, a film done so well that virtually every aspect, from script to direction to performances to music to editing, sweeps you away. Kenneth Branagh and Emma Thompson (who were then married)each played two roles, one in the past, one in the present, with different clothes, hairstyles and accents, as part of a couple destined to be together forever. Branagh, coming off his rookie directing debut in HENRY V, did a simply beautiful job here, using the same creative team as HV (Patrick Doyle deserves especial kudos for his astounding musical score). Playing both a cynical private eye (\"I'm not looking for Miss Right; I'm looking for Miss Right Now\") and a jealous German composer from the 1940's, he turns in two complete portraits of unusual men, while directing as well. The film didn't stay in theaters long (most likely due to studio politics), but has apparently found a new audience on video. I've loved it since the first time I saw it, in its first run (I admit to seeing it five times in the theater and buying it on video the day it came out) -- so I may be slightly prejudiced -- but from every angle -- thriller, love story, character study -- it's a winner. See it on DVD and hear Branagh's comments on various aspects of the film -- that adds another dimension right there. In fact, see it any way you can. It's just marvelous.",
         "***SPOILERS*** Modern Film-Noir murder mystery that covers 42 years,1948-1990, and two lifetimes. Grace, Emma Thompson,has been in this Catholic sanitarium, Saint Audrey's, since she was found wandering aimlessly on the streets of L.A. With the church not being able to keep or care for her any longer due to her deteriorating mental condition the church's administrator Father Thimothy, Richard Easton,calls a former parishioner Private eye Mike Church, Kenneth Branagh. Church is to find out just who this Grace, a name given to her by the church, really is. Putting an ad in the local L.A newspapers Church is immediately contacted by antique dealer Franklin Madson, Derek Jacobi. Madson dabbles in the occult and is experienced in the science of past-life regression; regressing persons back to their past lives through hypnosis. Madson puts Grace into a trance and regresses her back in time. It's then that Grace claims that in her previous existence she was a woman named Margrate Struss back in 1949. It was back then in 1949 that she was murdered by her husband Roman. Roman was a failing Hollywood musical composer and with his money, that he inherited from his first wife back in Germany, gone he was just about to have a nervous breakdown. Romans also suspected that Margaret was cheating on him by having an affair with newspaper reporter Gray Baker, Andy Garcia. One evening Roman just lost it and took out a pair of scissors brutally murdering Margaret. This amazing revelation, by Grace, is later confirmed through old newspapers clippings that also brought out that not only was there a Margaret and Roman Struss, back in L.A in 1948-49, but that she was also brutally murdered by her husband Roman. Mike and his assistant Pete(Wayne Knight), who later in the film makes one of the most jolting as well as unsuspecting guest appearances in motion picture history, get in touch with former psychiatrist and now grocery store owner Cozy Carlisle, Robin Williams, an expert in past-life regression. Cralisle, who was drummed out of his profession for having sex with one of his patients, tells them that past-life regressions do in fact have some truth to them and what Grace has been saying under hypnosis could very well have happened to her in a past life. The movie then takes on an almost supernatural angle to it and as its story slowly starts unfolding it becomes apparent to everyone that Grace is telling the truth but there's only one slight misrepresentation in her story! Grace wasn't Margrate Struss in her previous existence and the person who was wasn't murdered by Roman! There are surprises galore in this movie about murder madness and reincarnation and an ending that will surly blow you, like almost everyone else watching it, away. The movie is so well put together that your never allowed, by it's writer and director, to realize exactly what's going on until almost the very last five or so minutes. It's then where the truth about Grace/Margrate suddenly explodes right in your face leaving you, like it did both Grace & Mike Church, in a state of shock. Crossing different lives and time periods \"Dead Again\" in its concluding moments comes to a startling and paranormal rendezvous. It's at that point when the past suddenly catches up with the present and the mind boggling results of that time/space related conjunction become truly astonishing.",
         "So you know, I own this movie in both VHS and DVD format. I lend out my VHS to anyone I can get to watch this movie. I have seen many of Kenneth's movies, for me this is his best. Many others easily come to mind that are fantastic, but for me the two story lines and the mixing together of the two is incredible. It is different, I was spellbound from the suspense most of the movie. I wanted it to end so I could know if everything works out, but then wanted it to go on and on. If you like suspense, this movie is for you. The language is a little on the strong side at times, but not too much and appropriate to the characters and story.",
         "I caught this on HBO the other night. I have to go against the grain here and say that I found the movie good enough to keep me watching once I had invested some time in it, but barely. Of course it has a (now) star-studded cast, and that wasn't really its weakness. SPOILERS FOLLOW I found the plot to be all over the place. It severely tested my suspension of disbelief. Okay, the premise is one of past lives (in which two people are somehow reincarnated into spitting images of their former selves who both live in the same city along with their original antagonists) and hypnotic regression... I can live with that for the sake of the story. But from there the plot continues to test my credulity with increasingly ridiculous, and mostly pointless events and twists: - Why would Franklyn risk regressing Grace in Mike's presence, thinking that she is was his former victim (hence the whole reason he approached the two himself)? What if she immediately recalled the events as they actually happened? She might not finger his present self, but she would know the truth, the dots would be easy to connect, and the whole plot would be thrown off. - While there may have been subtle clues dropped as to the actual reincarnation identities beforehand, the whole switcheroo came off to me as a late-breaking addition, and regardless, it ultimately led nowhere. It did not impact the outcome at all and basically seemed to be an excuse to get Robin William's character in another scene. Whoever was who in the past, Franklyn was still the antagonist. And as for the memories, if Grace was actually Roman, then why was she having nightmares of being stabbed in the throat with scissors? Why was she unable to speak at the beginning of the movie, and petrified of letting people into her bedrooms when she slept? Not every dream sequence of hers fell into this category (e.g. only Roman could remember the walk to the electric chair); they're just jumbled up (why would Grace remember rebuking Inga?). To maintain suspension of belief, I need some semblance of internal consistency. - Speaking of Robin William's character, at first Dr. Carlisle implies that these sorts of past lives are rare, or at least, it is rare to uncover them in hypnosis (or was rare for him to anyway). Yet, later on, he seems to be an expert in the matter, explaining how gender swapping reincarnations happen all the time. - Mike brought Grace the anklet he recovered from Franklyn's store, and that became a symbol to her of the truth of their identities. But wouldn't the anklet have more of an emotional impact on Mike, seeing as how he was the one who was actually Margaret? Some lesser plot holes, which are common movie tropes, but (a) I expect better from a director of Branaugh's caliber (even in 1991), and (b) they reach a crescendo right at the climax, making it more of a farce to me than a drama: - How is it that Mike was shot, unconscious, non-responsive and near death one moment, and the next he is not only alert, but able to engage in hand-to-hand combat with Franklyn? - Why the hell was Newman delivering a pizza to Grace's apartment in the middle of the night, when earlier it was clear she wasn't expecting anyone? Maybe I missed something there, but that just seemed so random, I didn't know whether to laugh or shout at the screen (I did both). - The climactic, slow-motion, emotional showdown was just silly. All in all, I think if the movie were presented as a dramedy, it could have sold me. But it took itself far too seriously despite the numerous \"what the?!\" moments. Somebody should have switched gears in editing.",
         "I didn't catch this one until it hit a discount theatre in Miami Beach, but I'm glad I did. Whatever the status of Branagh and Thompson's relationship at the time, they project a fantastic chemistry as lovers karmically doomed to repeat the same mistakes over and over again, or so we are led to believe. Branagh has a fantastic directorial sense, honed in his years with Shakespearian theatre, and the intertwining of black-and white and colour footage to evoke different time periods works to great effect. Supporting players Derek Jacobi, Robin Williams, and Andy Garcia put in excellent performances, and the serviceable plot is made transcendant by this fine group of actors. Although some of the gore is a bit heavy, it doesn't overwhelm the story, something Branagh learned no doubt from the films of Alfred Hitchcock, and like the works of Hitchcock, even after the mystery is finally sorted out, the film continues to reward with repeat viewings. So, if the last copy of Blair Witch is out, and you're looking for a bit of suspense that isn't all blood and guts, give this one a try. You'll feel enlightened.",
         "I just finished watching \"Dead Again\" for the second time, and I really dig it. It's a well-made thriller, and Kenneth Branagh and Emma Thompson were always great together. It has an interesting story, a couple of good jump moments, and good supporting performances from Robin Williams and whatshisname who played Newman on \"Seinfeld\". The Hitchcock homage isn't overdone, and there are some nicely-placed visual clues (although one of them is far too obvious, the others are more subtle), as well as little references to other films the actors have been in before. Derek Jacobi is soooo good at being slimy, and the entire end sequence is tense and well-edited. That said, the big twist toward the end of the movie does poke a couple of plot holes, and causes some real loss of tension at the end of the movie- placing the big revelation much closer to the end might have made a big difference in the division of opinions about this movie. Either way, it's pretty enjoyable- well worth renting on a rainy night."
      ],
      "genres": [
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "Paramount Pictures",
         "Mirage Enterprises"
      ],
      "summaries": [
         "Mike Church is a Los Angeles private detective who specializes in finding missing persons. He takes on the case of a mystery woman who he calls Grace. She is suffering from amnesia and has no memories of her own. She keeps having nightmares involving the murder of a pianist, Margaret, by her husband Roman Strauss in the late 1940s. In an attempt to solve the mystery about these nightmares, Church seeks the help of Madson who is an antiques dealer with the gift of hypnosis. The hypnosis sessions will soon begin to reveal some surprises.",
         "In 1949, composer Roman Strauss is executed for the vicious murder of his wife Margaret with a pair of scissors. In 1990s Los Angeles a mute amnesiac woman shows up at an orphanage and private eye Mike Church is called in to investigate. Under hypnosis both the woman and Church seem to have a strange link back to the Strauss murder."
      ],
      "budget": 15000000
   },
   "movielensId": 3044,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1991-08-23",
      "dvdReleaseDate": "2000-06-27",
      "directors": ["Kenneth Branagh"],
      "runtime": 107,
      "movieId": 3044,
      "title": "Dead Again",
      "mpaa": "R",
      "actors": [
         "Kenneth Branagh",
         "Derek Jacobi",
         "Andy García",
         "Robin Williams",
         "Lois Hall",
         "Emma Thompson",
         "Wayne Knight",
         "Hanna Schygulla",
         "Campbell Scott",
         "Christine Ebersole",
         "Miriam Margolyes"
      ],
      "imdbMovieId": "0101669",
      "originalTitle": "Dead Again",
      "genres": ["Thriller"],
      "youtubeTrailerIds": ["vVt2h_UMnr0"],
      "plotSummary": "In 1949 composer Roman Strauss is executed for the vicious murder of his wife Margaret with a pair of scissors. In 1990s Los Angeles a mute amnesiac woman shows up at an orphanage and private eye Mike Church is called in to investigate. Under hypnosis both the woman and Church seem to have a strange link back to the Strauss murder.",
      "tmdbMovieId": 11498,
      "avgRating": 3.74288,
      "releaseYear": "1991",
      "numRatings": 4039,
      "posterPath": "/4bF41yspvDDtzlDLXsgwtKzEgwS.jpg"
   }
}