{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "england",
            "id": 392
         },
         {
            "name": "new year's eve",
            "id": 613
         },
         {
            "name": "secret",
            "id": 1328
         },
         {
            "name": "weekend",
            "id": 2677
         },
         {
            "name": "friends",
            "id": 9713
         }
      ],
      "imdb_id": "tt0105130",
      "video": false,
      "title": "Peter's Friends",
      "recommendations": [
         32636,
         106030,
         20024,
         57091,
         104474,
         51321,
         70971,
         43525,
         194066,
         210599,
         48689,
         12530,
         49462,
         42463,
         76772,
         24585,
         57726,
         18840,
         4173,
         37718
      ],
      "backdrop_path": "/jzKm77hlqTQeq7Dl3EgUer6NUet.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Andrew Benson",
               "gender": 2,
               "credit_id": "52fe44869251416c75037de3",
               "name": "Kenneth Branagh",
               "profile_path": "/bmpGjbqvAVNOK3ggiuET2Jl96tZ.jpg",
               "id": 11181,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Maggie Chester",
               "gender": 1,
               "credit_id": "52fe44869251416c75037def",
               "name": "Emma Thompson",
               "profile_path": "/cWTBHN8kLf6yapxiaQD9C6N1uMw.jpg",
               "id": 7056,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Peter Morton",
               "gender": 2,
               "credit_id": "52fe44869251416c75037de7",
               "name": "Stephen Fry",
               "profile_path": "/uaRoTAS2D15vdlpHm122UEUg5ck.jpg",
               "id": 11275,
               "order": 2
            },
            {
               "cast_id": 1,
               "character": "Roger Charleston",
               "gender": 2,
               "credit_id": "52fe44869251416c75037ddf",
               "name": "Hugh Laurie",
               "profile_path": "/3qCmEHtq5fBW8dbzsYDSy16Zqb0.jpg",
               "id": 41419,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Mary Charleston",
               "gender": 1,
               "credit_id": "52fe44869251416c75037df3",
               "name": "Imelda Staunton",
               "profile_path": "/mKlkh0AuYPD5HjmnlrW0uPm5QvJ.jpg",
               "id": 11356,
               "order": 4
            },
            {
               "cast_id": 4,
               "character": "Sarah Johnson",
               "gender": 0,
               "credit_id": "52fe44869251416c75037deb",
               "name": "Alphonsia Emmanuel",
               "profile_path": null,
               "id": 70507,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Carol Benson",
               "gender": 1,
               "credit_id": "533f2d41c3a36870580006c1",
               "name": "Rita Rudner",
               "profile_path": "/8BjphY6FjhdUafbRAWZwzWHDIPW.jpg",
               "id": 70508,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Vera",
               "gender": 1,
               "credit_id": "533f2d62c3a368705f000752",
               "name": "Phyllida Law",
               "profile_path": "/iL3UchWZqdk6RabqDZW9HBcJDwQ.jpg",
               "id": 17787,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Brian",
               "gender": 2,
               "credit_id": "533f2d4cc3a3687076000734",
               "name": "Tony Slattery",
               "profile_path": null,
               "id": 162398,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Paul (age 17)",
               "gender": 0,
               "credit_id": "533f2d70c3a36870670006ec",
               "name": "Alex Lowe",
               "profile_path": "/y9WSfz5ad7LyQWxcxARMPLnQKtp.jpg",
               "id": 1231909,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Lord Morton",
               "gender": 2,
               "credit_id": "57fafb7bc3a3683a3500383a",
               "name": "Richard Briers",
               "profile_path": "/cdOxeResI28YXe912GbQKKvbKv8.jpg",
               "id": 29859,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Paul (Aged 7)",
               "gender": 0,
               "credit_id": "5a4a740f9251415ca40131ea",
               "name": "Alex Scott",
               "profile_path": null,
               "id": 1951678,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "Mr. Gooch, Peter's Solicitor",
               "gender": 2,
               "credit_id": "5a4a742a9251415c91012d1a",
               "name": "Edward Jewesbury",
               "profile_path": null,
               "id": 1211850,
               "order": 12
            },
            {
               "cast_id": 21,
               "character": "Woman at Airport",
               "gender": 0,
               "credit_id": "5a4a743cc3a36805c50121b0",
               "name": "Hetta Charnley",
               "profile_path": null,
               "id": 237613,
               "order": 13
            },
            {
               "cast_id": 22,
               "character": "Brenda",
               "gender": 0,
               "credit_id": "5a4a7457c3a36805c8012328",
               "name": "Ann Davies",
               "profile_path": null,
               "id": 1231177,
               "order": 14
            },
            {
               "cast_id": 23,
               "character": "Old Lady",
               "gender": 0,
               "credit_id": "5a4a74819251415c9b013ae6",
               "name": "Magdalena Buznea",
               "profile_path": null,
               "id": 1951679,
               "order": 15
            },
            {
               "cast_id": 24,
               "character": "Brian's Wife",
               "gender": 0,
               "credit_id": "5a4a7490c3a36805cc014365",
               "name": "Nicola Wright",
               "profile_path": "/5FsJ2Oq0l6E8aB6n7PYl4zUyVT5.jpg",
               "id": 216988,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44869251416c75037df9",
               "name": "Kenneth Branagh",
               "profile_path": "/bmpGjbqvAVNOK3ggiuET2Jl96tZ.jpg",
               "id": 11181,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe44869251416c75037dff",
               "name": "Rita Rudner",
               "profile_path": "/8BjphY6FjhdUafbRAWZwzWHDIPW.jpg",
               "id": 70508,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44869251416c75037e05",
               "name": "Martin Bergmann",
               "profile_path": null,
               "id": 70509,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44869251416c75037e0b",
               "name": "Kenneth Branagh",
               "profile_path": "/bmpGjbqvAVNOK3ggiuET2Jl96tZ.jpg",
               "id": 11181,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44869251416c75037e11",
               "name": "Stephen Evans",
               "profile_path": null,
               "id": 39992,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44869251416c75037e17",
               "name": "Roger Lanser",
               "profile_path": null,
               "id": 48971,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44869251416c75037e1d",
               "name": "Andrew Marcus",
               "profile_path": null,
               "id": 4868,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 3.259091,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 11790,
      "vote_count": 56,
      "budget": 0,
      "overview": "It is New Year's weekend and the friends of Peter (Fry) gather at his newly inherited country house. Ten years ago, they all acted together in a Cambridge University student comedy troupe, but it's less clear how much they have in common now.Peter's friends are Andrew (Branagh), now a writer in Hollywood; married jingle writers Roger (Laurie) and Mary (Staunton); glamorous costume designer Sarah (Emmanuel); and eccentric Maggie (Thompson), who works in publishing. Cast in sharp relief to the university chums are Carol (Rudner), the American TV star wife of Andrew; and loutish Brian (Slattery), Sarah's very recently acquired lover. Law plays Peter's disapproving housekeeper, Vera; and Lowe, her son Paul. Briers appears in a cameo role as Peter's father.",
      "similar": [
         253,
         646,
         657,
         667,
         699,
         708,
         714,
         668,
         682,
         634,
         146216,
         691,
         1844,
         210479,
         6637,
         954,
         707,
         658,
         956,
         259693
      ],
      "original_title": "Peter's Friends",
      "runtime": 101,
      "poster_path": "/rmtLaQCQihbKIsuriek8qbjWbSu.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/16fY7pucCzn7WSOYxOGRHlAayL3.png",
            "name": "British Broadcasting Corporation (BBC)",
            "id": 3324,
            "origin_country": "GB"
         },
         {
            "logo_path": null,
            "name": "Channel Four Films",
            "id": 181,
            "origin_country": "GB"
         },
         {
            "logo_path": null,
            "name": "Renaissance Films",
            "id": 3102,
            "origin_country": ""
         }
      ],
      "release_date": "1992-09-18",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Kenneth Branagh"],
      "runtime": 101,
      "synopsis": null,
      "writers": [
         "Rita Rudner",
         "Martin Bergman"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0105130/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjIxODM3MTI4M15BMl5BanBnXkFtZTcwNTIzNzU2NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Hugh Laurie, Stephen Fry, Emma Thompson | See full cast and crew »"],
      "reviews": [
         "This movie has often been dubbed another rip off of The Big Chill. Except for the whole reunion bit, this movie bears little resemblance to the former. It is funnier, wittier and the characters are more clearly defined.The movie centers around Peter, whose father has just died and left him the house. He decides to have a big party and invite his friends from college that he hasn't seen in years.As it turns out, everyone has their problems. Roger and Mary have just lost a child,Maggie is trying to find a man and has her eye on Peter, who is definitely not interested,Sarah is involved with a married man and seems to have trouble getting involved with anyone who's available,Andrew and his Hollywood actress wife are having marriage problems.This movie is well acted, the script is well written,thanks to Rita Rudner and her husband Martin Bergman and the casting is excellent. Starring Stephen Fry as Peter,Kenneth Branagh as Andrew,Hugh Laurie as Roger,Emma Thompson as Maggie,Alphonsia Emmanuel as Sarah and Imelda Staunton as Mary.With Rita Rudner as Carol.",
         "Really, this is a great flick. Especially if you go for British comedy. Rita Rudner's writing is just fantastic. I caught this in the theatres by chance and loved it--and bought it as soon as it became available on video. Since this is just commentary, I'm not going to get into the plot any--I'll just toss in my 2 cents. In the Maltin Review, he mentions that many consider this a British \"Big Chill\". In a way, I can see that, but where the \"Big Chill\" focuses on how much the characters have changed since college, \"Peter's Friend's\" does a good job of showing how the characters really HAVEN'T changed since then. They have matured, but the root of who they are--their faults, strengths, and weaknesses--are still the same. The wit flows, the humor can be obvious as well as understated, the interplay between the actors is simply sublime, and the overall feel is fun and warm. I've seen many of these actors together in other films and they're all first rate. Just because Emma Thompson is the only one to win an Oscar doesn't mean the others are slackers!! The one thing I've had to accept, though, is that in 7 years, it has become dated--especially the reason why Peter decides to bring his old college buddies together. That last scene packed a much bigger punch in 1992 than it could in 1999. Not that the issues are any less significant now, just that, as a culture, we're more accustomed to the subject. (And I won't spoil it--if you want to know what the subject is, rent the movie! *grin*) Also, the soundtrack is fabulous! And I'd say it's worth the price of a rental for those who \"came of age\" in the 80's just to watch the opening montage: The highlights of the 80's set to \"Everybody Wants to Rule the World\". Fantastically done. Rent it and enjoy!!",
         "When I first watched Peter's Friends, I was seventeen years old, still young and unexperienced. I wouldn't say that the five years since then have made me some sort of oracle, but I have made a few mistakes and also a lot of good choices. And even more, I am able to relate to the story that Kenneth Branagh's wonderful alternative to It's A Wonderful Life as a holiday film. Today it makes me laugh. It makes me embarrassed. It evokes so many feelings that are pivotal for the human spirit, so many things that are universal. If you have friends, or if you've lost them, or if you've met any people at all in your life, you will be able to relate to the six friends in Peter's Friends. What the heck, you only have to be human to relate to it. No other movie speaks so truly about us as human beings and how we behave in small social groups. Food for thought, but also for heart.",
         "Film starts off on New Years Eve 1982 with a collegiate musical troupe giving their final bad performance. It cuts to 1992 where one of them named Peter (Stephen Fry) invites the whole group to his remote English castle for a New Years Eve party. We have the Andersons--Roger (Hugh Laurie) and Mary (Imelda Staunton). They've lost a child and she lives in fear that they'll lose the other. Then there's Maggie (Emma Thompson) who's madly in love with Peter. There's Sarah (Alphonsia Emmanuel) a sexually active woman who brings along her man of the moment (Tony Slattery). And there's Andrew (Kenneth Branagh) who's unhappily married to TV star Carol (Rita Rudner). This was called a rip off of \"The Big Chill\". It is, but it's well-made with a great cast, a wonderful script and is totally involving. This is one of the few movies that mixes drama and laughs and both work beautifully. It was also shot (I believe) on location in England and the setting itself is just incredible. All the acting is good across the board. Rudner is a delight (and has the best lines). Emmanuel sometimes overdoes her role but not enough to damage the film. Dramatic, witty, warm--basically a great comedy drama well worth catching. \"Did you ever see \"Upstairs Downstairs\"?\"",
         "I can watch Peter's Friends over and over without getting bored. The characters are about the same age I am, and my friends and I have shared many of the same experiences. The script is witty and clever, the characters are well-developed and the actors are superb. What more can I say besides \"I want the DVD!\"",
         "This film has one of the best 80's soundtracks. It is a feel good movie with a great cast. Some very amusing moments and some sad moments but all in all it features the kind of friends we'd all love to have.",
         "You won't find a laugh track. Or even any side-splitting laughs. Its not slapstick, indeed most of the humor is directed ironically at the character who's making the self-deprecating comment. Its not really tragic - its a situation comedy of the old school, with great actors, a reasonable framework for them to perform, and no artificial beginning or ending, just characterization. Like many movies of this kind, you have to bring your brain along and do some of the work yourself. It is, however, an effort that will be greatly rewarded, and highly rewarding. So find the movie, watch it, think about it, and enjoy it. You'll probably continue to do so through many viewings. And while its not out on DVD in the US, it available out on laserdisc (if anyone still has one - I did for many years). Not much, but its something.",
         "\"Peter's friends\" is a seemingly modest, delectable and almost quiet film about the people we become if we're lucky. It's one of those extremely rare reunion movies where very dissimilar characters are bound together by sincere friendship, not old resentments. As they're invited to a country manor by one of them to celebrate New Year's and enjoy each other's company for old times' sake, they're unfazed by the impression they may leave, but perhaps too eager to make it a fun time together. It's the people they bring along that start to complicate everything but also truly re-unite them. The cast is fantastic (mind the wonderful Phyllida Law, Thompson's mother, in the role of Vera) and the atmosphere brilliantly subdued. The upbeat late 80's music brings back memories, and it's a sorely needed uplifting element amidst the dreary British winter. Branagh's direction leaves some direction to be desired, but it's exactly that slightly amateurish feel to it that makes the film tick. When I watched \"Peter's friends\" for the first time more than ten years ago, it struck me as a slow-paced movie, quirky but fun. A decade later, it seems spirited, joyful and warm with lots of smirks, some laughs, and plenty of \"I know this awful embarrassing feeling\" moments. It's also become a great testimony to the late 80s, early 90s era, now trapped in time but well remembered for its excess in clothing, opulence in music, powerful political movements and, perhaps, youthful naivety. It's a movie I could watch each year anew.",
         "A lot of people seem to think the plot is particularly weak and that some of the character development is unrealistic, but I think it is quite effective. To fully appreciate why the characters behave the way they do (for instance, Mary saying goodbye to her baby son Ben, while husband Roger stands by) it is worth watching the film twice. Peter's character also unfolds in a logical way, and his actions become crystal clear as the film progresses. Carol - seemingly a B-list celebrity who thinks she's a legend - turns out to be a multi- layered character, and is certainly one of the most memorable. The only drawback to this rather character-driven film is that sometimes I watch it and think I have obviously missed a scene somewhere. Although I cannot identify with everything the characters have been through, they are all reasonably fleshed out. As the audience gets further into the film, the layers of show and pretence are peeled back like onion skins. The two \"extra\" characters are eliminated with reasonable explanations. I can see what makes all of the characters tick - except for Brian. Roger and Mary are a good couple, stressed and yet strengthened by the way they finally deal with their personal tragedy - in fact I feel like the holiday is quite cathartic for them. Carol and Andrew, although a bit \"showbiz\" for my liking are obviously moulded and shaped by their Hollywood surroundings - they are clearly used to fulfilling a role on and off camera and somehow I don't feel that the audience for this film sees the ultimate end of their relationship. Sarah, another thespian type (evidently with a colourful past) seems to do some serious thinking about her approach to relationships. Maggie - oh, I do like Maggie! - the rather bookish spinster undergoes a total change before balancing her old self with the new self she has tapped into. Peter, excellently played by Stephen Fry, makes a courteous host, friend and confidante to all, reluctant to burden his friends with a problem far more stunning than anything his friends have been faced with (perhaps Roger and Mary's is on a par?). But I have tried and tried, and watched this film over and over and I still feel as though I have somehow missed a key scene that would help me understand Brian. Where is it, I ask? I still don't get the Greta Garbo joke - I can only surmise that it is a story he finds humour in where nobody else ever could, because the punchline never made it to the final cut. A line from him after upsetting Mary states, \"It's not like me to put my foot in it\" - how ironic when he spends the rest of his time in the film spoiling the moment (particularly after the revue group's lovely song by the piano) and upsetting others. So where the others have a bit of backstory - we know who went out with (or slept with) who at university - and can be empathised with, Brian appears one-dimensional. His character as it stands is the only real flaw in the film, his only real purpose is to be cast off by Sarah when Andrew helps her see how wrongly she approaches her relationships. A notable mention also goes to the soundtrack. I only wanted to see this film initially because it featured Tears For Fears' 1985 single Everybody Wants To Rule The World, but this is in no way the only musical highlight. The opening sequence was one I enjoyed very much.",
         "Good, solid drama in the best British style, replete with witty dialogues, more or less a showcase for Kenneth Branagh to bestow upon us something that is not in the least Shakespearian. Nicely-paced development lets the principal characters ease their way into the proceedings in an orchestrated way, such that there is a fine balance in screen presence as well as in the interwoven combinations of the players from scene to scene, very much in the straight theatre tradition. Therein lies a possible weakness: the film has a straight-jacket feel to it, as though indeed it was too severely and strictly transposed from the stage to the screen. Very much in the vein of a `battle of the sexes', we have in `Peter's Friends' several couples meeting some years after graduating, supposedly to remember old times. I rather fancy that the ladies win this battle by a slight margin, as the performances by Imelda Staunton, Emma Thompson and Alphonsia Emmanuel manage to pull off a finely-tuned upper-hand over the gentlemen. This is about the third time I have seen this film - and will doubtlessly see it again. However, having recently seen `Gosford Park' a couple of times, I cannot help marrying up the two films - and thus falling into the trap of comparing them. `Gosford Park' comes out clearly the winner: Altman's masterpiece."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "British Broadcasting Corporation (BBC)",
         "Channel Four Films",
         "Renaissance Films"
      ],
      "summaries": [
         "Seven friends in an acting troupe graduate from Cambridge University in 1982 and go their separate ways. Ten years later, Peter inherits a large estate from his father, and invites the rest of the gang to spend New Year's holiday with him. Many changes have taken place in the lives of all the friends assembled, but Peter has a secret that will shock them all.",
         "Six former college friends, with two new friends, gather for a New Years Eve weekend reunion at a large English countryside manor after ten years to reminisce about the good times now long gone."
      ],
      "budget": 0
   },
   "movielensId": 3045,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1992-09-18",
      "dvdReleaseDate": "2008-02-12",
      "directors": ["Kenneth Branagh"],
      "runtime": 101,
      "movieId": 3045,
      "title": "Peter's Friends",
      "mpaa": "",
      "actors": [
         "Kenneth Branagh",
         "Emma Thompson",
         "Stephen Fry",
         "Hugh Laurie",
         "Imelda Staunton",
         "Alphonsia Emmanuel",
         "Rita Rudner",
         "Phyllida Law",
         "Tony Slattery",
         "Alex Lowe",
         "Richard Briers",
         "Alex Scott",
         "Edward Jewesbury",
         "Hetta Charnley",
         "Ann Davies",
         "Magdalena Buznea",
         "Nicola Wright"
      ],
      "imdbMovieId": "0105130",
      "originalTitle": "Peter's Friends",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["GhfHLuhYPok"],
      "plotSummary": "It is New Year's weekend and the friends of Peter (Fry) gather at his newly inherited country house. Ten years ago, they all acted together in a Cambridge University student comedy troupe, but it's less clear how much they have in common now.Peter's friends are Andrew (Branagh), now a writer in Hollywood; married jingle writers Roger (Laurie) and Mary (Staunton); glamorous costume designer Sarah (Emmanuel); and eccentric Maggie (Thompson), who works in publishing. Cast in sharp relief to the university chums are Carol (Rudner), the American TV star wife of Andrew; and loutish Brian (Slattery), Sarah's very recently acquired lover. Law plays Peter's disapproving housekeeper, Vera; and Lowe, her son Paul. Briers appears in a cameo role as Peter's father.",
      "tmdbMovieId": 11790,
      "avgRating": 3.23708,
      "releaseYear": "1992",
      "numRatings": 871,
      "posterPath": "/rmtLaQCQihbKIsuriek8qbjWbSu.jpg"
   }
}