{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "lesbian relationship",
            "id": 9833
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "lesbian interest",
            "id": 34215
         },
         {
            "name": "lgbt",
            "id": 158718
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0113416",
      "video": false,
      "title": "The Incredibly True Adventure of Two Girls In Love",
      "recommendations": [
         18212,
         42548,
         21060,
         125233,
         62986,
         20405,
         12793,
         118075,
         44991,
         116550,
         44305,
         10520,
         31421,
         15647,
         26491,
         33693,
         254936,
         56743,
         286817,
         12808
      ],
      "backdrop_path": "/ev26BzGjAtVJt2tA7MsClqw1yxh.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Randy Dean",
               "gender": 1,
               "credit_id": "52fe45dac3a368484e072aa5",
               "name": "Laurel Holloman",
               "profile_path": "/y9zcbdvU5iBAkEXxUF5SMTFUR3d.jpg",
               "id": 18657,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Wendy",
               "gender": 1,
               "credit_id": "52fe45dac3a368484e072aa9",
               "name": "Maggie Moore",
               "profile_path": null,
               "id": 82105,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Rebecca Dean",
               "gender": 0,
               "credit_id": "52fe45dac3a368484e072aad",
               "name": "Kate Stafford",
               "profile_path": null,
               "id": 103680,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Evie Roy",
               "gender": 1,
               "credit_id": "52fe45dac3a368484e072ab1",
               "name": "Nicole Ari Parker",
               "profile_path": "/vvEt8sXPKm9HxxDrHyg9aIxwvEM.jpg",
               "id": 74615,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Lena",
               "gender": 0,
               "credit_id": "54624d83c3a368082d0000c6",
               "name": "Toby Poser",
               "profile_path": null,
               "id": 1384575,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Frank",
               "gender": 0,
               "credit_id": "54624d9e0e0a267bf2000089",
               "name": "Nelson Edwin Rodríguez",
               "profile_path": null,
               "id": 1384576,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Regina",
               "gender": 1,
               "credit_id": "54624db8c3a36808200000bd",
               "name": "Dale Dickey",
               "profile_path": "/g74v4UBE0NIqvZ9XUFYSuLuYN0h.jpg",
               "id": 46814,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Hayjay",
               "gender": 0,
               "credit_id": "54624df1c3a368082d0000d4",
               "name": "Andrew Wright",
               "profile_path": null,
               "id": 1384577,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "girl 1",
               "gender": 0,
               "credit_id": "54624e09c3a368083e0000c1",
               "name": "Katlin Tyler",
               "profile_path": null,
               "id": 1384578,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "girl 2",
               "gender": 0,
               "credit_id": "54624e1dc3a3680818000092",
               "name": "Anna Padgett",
               "profile_path": null,
               "id": 1384579,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "girl 3",
               "gender": 0,
               "credit_id": "54624e330e0a267be90000b0",
               "name": "Chelsea Catthouse",
               "profile_path": null,
               "id": 1384580,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Evelyn Roy",
               "gender": 1,
               "credit_id": "54624e4c0e0a267be90000b5",
               "name": "Stephanie Berry",
               "profile_path": "/mzcU3ox6gWVbQKld66oRt1eboL5.jpg",
               "id": 10693,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "a waitress",
               "gender": 0,
               "credit_id": "54624e660e0a267bf80000aa",
               "name": "Babs Davy",
               "profile_path": null,
               "id": 1384582,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Ali, Wendy's husband",
               "gender": 2,
               "credit_id": "54624e850e0a267bf50000b8",
               "name": "John Elsen",
               "profile_path": null,
               "id": 122243,
               "order": 14
            },
            {
               "cast_id": 17,
               "character": "old lady 1 at the motel",
               "gender": 0,
               "credit_id": "54624eb80e0a267bec0000d4",
               "name": "Lillian Kiesler",
               "profile_path": null,
               "id": 1384585,
               "order": 15
            },
            {
               "cast_id": 18,
               "character": "",
               "gender": 0,
               "credit_id": "54624ec70e0a267bf50000bf",
               "name": "Maryette Charlton",
               "profile_path": null,
               "id": 1384587,
               "order": 16
            },
            {
               "cast_id": 19,
               "character": "old lady 2 at the motel",
               "gender": 0,
               "credit_id": "54624ed70e0a267be90000c1",
               "name": "Maryette Charlton",
               "profile_path": null,
               "id": 1384587,
               "order": 17
            }
         ],
         "crew": [{
            "gender": 1,
            "credit_id": "52fe45dac3a368484e072ab7",
            "name": "Maria Maggenti",
            "profile_path": "/3xTFdlQ4a7iblxtl8fAls0elnCM.jpg",
            "id": 86035,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.1676,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 29371,
      "vote_count": 21,
      "budget": 0,
      "overview": "An adventurous love story between two young women of different social and economic backgrounds who find themselves going through all the typical struggles of a new romance.",
      "similar": [
         370663,
         12793,
         449176,
         20770,
         258480,
         21060,
         126331,
         513,
         401898,
         376867,
         184352,
         26280,
         48650,
         10938,
         1213,
         1966,
         398818,
         244772,
         338189,
         11421
      ],
      "original_title": "The Incredibly True Adventure of Two Girls In Love",
      "runtime": 94,
      "poster_path": "/wp8rBsEXU0digNZNHYahGlagMtP.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1995-06-16",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Maria Maggenti"],
      "runtime": 94,
      "synopsis": null,
      "writers": ["Maria Maggenti"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113416/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgyODczMDQ5Nl5BMl5BanBnXkFtZTcwMzQwNzUyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Laurel Holloman, Nicole Ari Parker, Maggie Moore | See full cast and crew »"],
      "reviews": [
         "This is a movie that manages to please despite itself. A lot of the dialogue is flat, a lot of the direction is stilted, most of the supporting characters are inept, the plot goes nowhere as often as not, and the music is practically AWOL. But the sheer whimsy of the unusual tale of a pair of teenage girls falling in love and the sincere, skittish performances by the two young actresses playing them very nearly makes up for all of it. Evie is a wealthy, popular, intelligent girl pampered by her affectionate mother; Randy, a boyish, school-hating aspiring guitarist growing up in a all-lesbian household. Both will have to face certain aspects of themselves and others in their lives so that they may be together. It's very, very sweet, and I don't mean that in a bad sense. It glows with the innocence of first infatuation, and the awkward tenderness of nervous young lovers, only slightly tinted by the shadows of the \"real\" world. This movie was about two young lesbians, but it is really the universal story of anyone and everyone who sincerely fell in love at 17.",
         "This is one of those movies that if you catch on cable, you start watching and then are drawn into. I first caught it from the middle while flipping channels and then checked when it would be on again so I could see the whole thing. It is a very different movie. A tomboy named Randy, who lives with a lesbian mother and is taunted by everybody at school, also seems to be failing all her classes. One day a girl (Evie) from her school happens into her mother's gas station. On a whim, Randy decides to see what Evie needs. Apparently there is a problem with her tire. Randy is immediately attracted to Evie, who seems totally lost explaining her tire problem. Evie seems to notice how Randy is looking at her and after she leaves the station, they each start thinking about the other. Evie is the opposite of Randy. She is very attractive and hangs with the \"in\" crowd at school. Evie has an egotistical, pushy boyfriend and one day has a fight with him at school. She goes to the girls' room and happens upon Randy in the bathroom. She then pours her guts out to Randy who is totally sympathetic. Randy then starts telling her family clan that Evie is her girlfriend, though nothing has happened yet. Randy decides to get bold and writes Evie a note that she slips into Evie's locker at school. Evie finds the note and says nothing of it for several days, while thinking constantly about Randy. Evie is battling her feelings for Shawn, worried that her snobbish girlfriends would look down on her if she even associated with Randy. Evie can take it no longer and goes to the gas station where she first met Randy and strikes up a friendship. The friendship starts to slowly bloom over a period of time with the girls sharing caresses and kisses. When Evie's mother needs to go out of town for a weekend, the girls plan to take their relationship to the next step. I don't want to give the rest of the movie away but just to say that it is fun with a few laughs thrown in. The movie shows that just because someone is different, they can have the same feelings and desires as anyone else. This is well worth renting or setting your VCR, if it is again shown on cable.",
         "In terms of cuteness, this movie is equivivalent to a Tom Hanks/Meg Ryan romance, which isn't a bad thing at all. The two leads are sensitive and funny in their portrayals of Evie and Randy. Interesting that Laurel Holloman and Nicole Parker both wound up in the cast of Boogie Nights, no? I especially loved the character of Frank in this movie. A sweet date movie for couples of all orientations, in my opinion. :)",
         "This movie is one that I can watch over and over again. It is something fresh and new. The screenwriter/director does a great job of bringing many different aspects of young lesbian existence. For example, by bringing together people of different races, social economic status, and different family make-ups; it opens one's eyes to different possibilities. It is quite opposite of what is usually thought of when one thinks of a gay or lesbian film. This movie does not stay in a box; it busts the box instead. Every time I see this movie, I am able to pick up on something that I hadn't seen before. Although this is a movie where you don't really have to think much; I tend to analyze regardles. I found that it is not the what actually happens on the surface that really keeps me coming back for more. It is the intricate underlying messages that the screenwriter/director is trying to get across that engages me.",
         "The ultimate charm of this movie is that though it is a lesbian movie, it truly is about two teenagers from very different backgrounds falling in love. This is the what the movie is actually about and the lesbian aspect of it is actually almost secondary. Think about it ... replace the girl falling in love with girl concept and replace it with some other socially challenging category (perhaps a cross-culture or cross-religion love story), and it would still work. [In fact, ironically, the director/writer eventually married a guy, much to some people's chagrin! lol] The movie is rough as many an indie film is and the actors are young (this was Nicole Ari Parker's first film) or somewhat amateurish. Still, the basic relationships hold true. The girls and their mom/aunt, the other romances that don't quite work out, and their friends all are believable, though some match up better than others. How Randy and Evie connect through \"Leaves of Grass\" might be a bit trite, but I believed it -- imagine, a film that respected the power of poetry! And, I did accept them as a couple. Young love is pretty well portrayed, and in fact, how many films these days really portray it? Not too many really -- the films are often more concerned with stereotypical plot complications than the romance, and even those come far and long inbetween. This alone makes the film a pleasure, though the lesbian aspect supplies an additional layer. And as to that layer, this is probably one of the superior films of the genre. To compare, for instance, this is better than \"Better Than Chocolate.\" Again, it can very well be a matter of taste (lol). The ending is a bit silly though, but the scene before the final reel (the mom freaking out) is priceless. Still, the ending suggests that this is first love, not necessarily forever. A good thing too. -j PS It was suggested that this was eye candy for men or just for lesbians. I beg to differ in both respects. There is a quick love scene and mild kissing, but if men want to leer, there are better films in the genre than one that cares so much about character.",
         "A nice romantic movie. The two leads are both women so the audience for the film is smaller than a big budget heterosexual romance would be, but after seeing previews for this movie, I had to see it because it looked hilarious, but then you also get a movie where one girl knows who she is and what she wants. The object of her affection is confused at the beginning and a little scared of her growing attraction to A GIRL! Very well done movie, and the subject matter shouldn't be so offputting since it is a well crafted story.",
         "This is one of the few movies I have elected to see more than once. This coming-of-age story about two teen girls who discover their love for one another is both poignant and funny, yet always tasteful. The casting and direction gives us characters that look like ordinary people, as opposed to the usual pretty-boy/girl fare that prompts our eyes to love the characters even before we know what they're about. For instance, Randy has to grow on you during the movie--she is not a particularly adorable young lady in her actions and attitudes, neither does she have the looks of a classic beauty. The result is, when girlfriend Evie (Nicole Ari Parker) calls her \"beautiful\" when they are finally alone together, we know she means it on the deepest levels, we believe her immediately, and even see Randy through her eyes. This is a great movie for all ages. Personally, I will be watching for more of Nicole Ari Parker's work.",
         "Such a great humble little movie! I LOLD when I realized this was Laurel Holloman from \"The L Word\". So obvious, but so adorable. She was such a cute little dyke when she was young. Def not cutting edge, but the characters are realistic and cute, and it's good to see that same old story with a great gay-positive theme. The writers nailed character development. I don't know too many high school kids who are so confident in their self-identity, and this if nothing else, is extremely refreshing. I never thought Holloman was much of a great actor based on her appearance in The L Word, and in fact, the only thing I figured she did do well was have sex. Her dialogue has always been a bit empty and flat in my experience, and in this movie it's not much different, but at least she's consistent and while it's a little cheesy, it's tolerable. <3 LOGO, glad I got a chance to see this little gem. God Bless America.",
         "If you like romantic comedies, then you will love this one. It is a small budget indie, but don't let that keep you away. This is Laurel Holloman from \"The L Word\"'s debut film. She plays Randy Dean, a girl who lives on the wrong side of the tracks, and is not particularly pretty. She smokes weed, fails her classes, and likes loud rock music. She runs into Evie (Nicole Ari Parker in her debut performance) and they slowly fall in love. Now, Evie takes trips to Paris with her mother, listens to opera, and is well-read and well educated. Two more opposite girls you cannot imagine. Yes, it is romantic, but it becomes so funny at the end that you forget that while you are laughing yourself silly.",
         "There are few movies about lesbians. After seeing this movie and the dreadful 'Bar Girls' I am beginning to believe that there are even few good ones. 'The Incredibly True Adventures of 2 Girls in Love' enters into the lives of Randy and Evie two teenage girls on the edge of self-discovery still toying with the notion of what homosexuality is all about. Randy is an honor roll student, always clean and proper but not a snob. Evie is from the other side of the tracks and lives in a big house with her gay aunt and her aunt's lovers past and present. They come from different worlds which naturally means that they are perfect for one another. I know that when adolescents are attracted to one another it can take a long time for them to get together. When they are gay, even longer. But Randy and Evie take so long to get together that when they did, I didn't think the movie had any time to let them get to know one another. Another problem: half the time I couldn't hear what the characters were saying. This is especially illustrated in a scene in which Randy breaks the news to her friends at a fast food joint. They sit on the opposite side of the table from Randy and everyone mumbles in a monotone. The ending is all wrong, taking place at a motel with everyone running back and forth screaming and chattering like a bad Marx brothers routine. The only scene that does work: When Randy and Evie finally have sex, it is done in a wonderfully touching way. The director takes time to allow them to explore one another without the scene seeming like exploitation. I liked Evie and Randy, I just wished that the director had had sense enough to fine tune the film."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Fine Line Features",
         "Smash Pictures"
      ],
      "summaries": [
         "The story of two girls, Randy and Evie. Randy is a low economic class lesbian living with other lesbians including her aunt. Evie is a wealthy, popular girl with a boyfriend. When Evie befriends Randy, she begins to feel a passion for her she's never felt before. What follows is a sweet, tender romance between the two while Evie is cast away by her friends and Randy is chided by her family. The two don't care, though, because they are in love.",
         "An adventurous love story between two young women of different social and economic backgrounds who find themselves going through all the typical struggles of a new romance."
      ],
      "budget": 250000
   },
   "movielensId": 3046,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-06-16",
      "dvdReleaseDate": "2004-05-04",
      "directors": ["Maria Maggenti"],
      "runtime": 94,
      "movieId": 3046,
      "title": "The Incredibly True Adventure of Two Girls In Love",
      "mpaa": "",
      "actors": [
         "Laurel Holloman",
         "Maggie Moore",
         "Kate Stafford",
         "Nicole Ari Parker",
         "Toby Poser",
         "Nelson Edwin Rodríguez",
         "Dale Dickey",
         "Andrew Wright",
         "Katlin Tyler",
         "Anna Padgett",
         "Chelsea Catthouse",
         "Stephanie Berry",
         "Babs Davy",
         "John Elsen",
         "Lillian Kiesler",
         "Maryette Charlton",
         "Maryette Charlton"
      ],
      "imdbMovieId": "0113416",
      "originalTitle": "The Incredibly True Adventure of Two Girls In Love",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "An adventurous love story between two young women of different social and economic backgrounds who find themselves going through all the typical struggles of a new romance.",
      "tmdbMovieId": 29371,
      "avgRating": 3.41994,
      "releaseYear": "1995",
      "numRatings": 637,
      "posterPath": "/wp8rBsEXU0digNZNHYahGlagMtP.jpg"
   }
}