{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "hotel",
            "id": 612
         },
         {
            "name": "waitress",
            "id": 828
         },
         {
            "name": "mine",
            "id": 1960
         },
         {
            "name": "seaside town",
            "id": 187224
         },
         {
            "name": "introvert",
            "id": 215409
         }
      ],
      "imdb_id": "tt0083911",
      "video": false,
      "title": "Experience Preferred...But Not Essential",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 822,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Annie",
               "gender": 0,
               "credit_id": "55977fdf9251413d9c000c54",
               "name": "Elizabeth Edmonds",
               "profile_path": null,
               "id": 1229062,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Mavis",
               "gender": 1,
               "credit_id": "55977ff19251413d9f000bfa",
               "name": "Sue Wallace",
               "profile_path": "/y4SXg9ZIo5Kf0uOnjze8SiZowFr.jpg",
               "id": 1484404,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Doreen",
               "gender": 0,
               "credit_id": "559780069251413d91000d46",
               "name": "Geraldine Griffiths",
               "profile_path": null,
               "id": 1484405,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Paula",
               "gender": 0,
               "credit_id": "5597801a9251413d91000d4b",
               "name": "Karen Meagher",
               "profile_path": "/iIhQNJCYVsOmiMmP40FDub1CSBW.jpg",
               "id": 82414,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Arlene",
               "gender": 0,
               "credit_id": "559780329251413d93000c69",
               "name": "Maggie Wilkinson",
               "profile_path": null,
               "id": 1484406,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Mike",
               "gender": 0,
               "credit_id": "5597804dc3a36855e8000c4b",
               "name": "Ron Bain",
               "profile_path": null,
               "id": 1484407,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Ivan",
               "gender": 0,
               "credit_id": "55978071c3a36855e6000c43",
               "name": "Robert Blythe",
               "profile_path": "/7Mhfa9lauoGkBB1t4jTYIEUuyfJ.jpg",
               "id": 142744,
               "order": 8
            },
            {
               "cast_id": 9,
               "character": "Wally",
               "gender": 0,
               "credit_id": "55978085c3a36855db000cf1",
               "name": "Roy Heather",
               "profile_path": null,
               "id": 1212883,
               "order": 9
            },
            {
               "cast_id": 10,
               "character": "Dai",
               "gender": 0,
               "credit_id": "55978096c3a36855e3000ce7",
               "name": "Peter Doran",
               "profile_path": null,
               "id": 1484410,
               "order": 10
            },
            {
               "cast_id": 11,
               "character": "Helen",
               "gender": 0,
               "credit_id": "559780ab9251413d91000d61",
               "name": "Arwen Holm",
               "profile_path": null,
               "id": 1484412,
               "order": 11
            },
            {
               "cast_id": 12,
               "character": "Nin",
               "gender": 2,
               "credit_id": "559780bbc3a36855d4000d26",
               "name": "Sion Tudor Owen",
               "profile_path": "/frVnepWr4r328PXACayF7bhSinF.jpg",
               "id": 189433,
               "order": 12
            },
            {
               "cast_id": 13,
               "character": "Gareth",
               "gender": 2,
               "credit_id": "559780cd9251413da6000d6e",
               "name": "Robert Gwilym",
               "profile_path": "/5esPCkYI2276r5lbF581AKFVWMM.jpg",
               "id": 166221,
               "order": 13
            },
            {
               "cast_id": 14,
               "character": "Now",
               "gender": 0,
               "credit_id": "559780dd9251413da6000d72",
               "name": "Mostyn Evans",
               "profile_path": null,
               "id": 1403235,
               "order": 14
            },
            {
               "cast_id": 15,
               "character": "Mr. Howard",
               "gender": 0,
               "credit_id": "559780f09251413d91000d71",
               "name": "Paul Haley",
               "profile_path": null,
               "id": 1484416,
               "order": 15
            },
            {
               "cast_id": 16,
               "character": "Hywel",
               "gender": 2,
               "credit_id": "58ceeee49251415a450285cf",
               "name": "Alun Lewis",
               "profile_path": null,
               "id": 295849,
               "order": 16
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "55977fbd9251413da6000d4f",
            "name": "Peter Duffell",
            "profile_path": null,
            "id": 138167,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.30766,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 276635,
      "vote_count": 2,
      "budget": 0,
      "overview": "A shy, introverted young girl takes a summer job at a seaside resort in Wales, where she finds the staff, the owners and patrons unlike anyone she has ever met before.",
      "similar": [
         5,
         120467,
         132344,
         255,
         48650,
         7303,
         3021,
         11950,
         65496,
         6949,
         112,
         58631,
         34024,
         15788,
         293069,
         18467,
         42659,
         52229,
         188781,
         152234
      ],
      "original_title": "Experience Preferred...But Not Essential",
      "runtime": 80,
      "poster_path": "/OtgR6mCPIXJI9K73aeE2COfd4T.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Goldcrest Films International",
            "id": 500,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Channel Four Films",
            "id": 181,
            "origin_country": "GB"
         },
         {
            "logo_path": null,
            "name": "Enigma Productions",
            "id": 7049,
            "origin_country": ""
         }
      ],
      "release_date": "1982-12-22",
      "vote_average": 7.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Peter Duffell"],
      "runtime": 80,
      "synopsis": null,
      "writers": [
         "June Roberts",
         "Jack Rosenthal"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0083911/",
      "coverLink": null,
      "actors": ["Stars: Elizabeth Edmonds, Sue Wallace, Geraldine Griffiths | See full cast and crew »"],
      "reviews": [
         "I wish I could get my hands on a copy of this movie. I saw it as a callow 21-year-old and have been looking for it since. It's a sweet little coming-of-age, of sorts, with a female lead for a change. The setting of a resort hotel is the perfect background for a voyage of mini-discovery, with all its endearing characters. The Elvis wanna-be is one of those characters you come across once or twice in your life, and his unspooling is one of the highpoints of the movie. He's scary and funny at the same time. I give this movie a 9 on 10 for enjoyment.",
         "Annie is a student in the sixties. She has temporarily departed from academia to take a summer job at a seaside hotel in Wales. This movie follows Annie's relationships and interaction with the other members of staff and the outcome of their various dilemmas. That might sound a little heavy bearing in mind that this is a comedy, but it is witty, amusing and totally delightful. The staff at the hotel are made up of a chatty Scots chef, a brash waitress and her abusive Elvis lookalike boyfriend, the roommate who closes her ears to the noises taking place right next to her, another roommate that closes her eyes to the nightly view of the sleepwalking nudist, the receptionist who is on extremely good terms with the hotel manager and the waitress who ran away from home at the age of 36. Each of these characters and their life experiences make such an impression on the blank page that is Annie that when she leaves she is a different girl. A brief but enchanting gem of a movie.",
         "\"Experience Preferred but not Essential\" was, for me, one of those beautifully done esoteric films that deserves to be seen more than once to fully appreciate it humor, insights and writing. It is akin to another such movie, \"She'll be Wearing Pink Pajamas.\" I really appreciate writers, directors and actors who can delve into a humorous story, dig out the subtle humor and make it work on the big screen. These are two films I'd really like to get a hold of and to watch again and again. Both films contain the kind of encouragement that one can find one's identity and not be lost in a \"majority mentality.\"",
         "I had this film on VHS when I was a young girl,and I watched it until the tape broke! I would love to watch it again but I can't seem to find a copy anywhere. The characters are so varied and interesting that you find your self drawn into the world behind the running of a busy hotel and in the end your sad to leave all of the colourful characters behind. The storyline is so simple, but so cleverly written it only enhances the enjoyment of the film. What I loved the most about this film was the attention to detail, Annies attic room was a a wonderful piece of set design. I too would loved to have seen what happened to these people a few years on. It's such a shame this hasn't been released on DVD it's such a waste for for it not to be seen.",
         "The character of Annie is the central point of the story. Played by Elizabeth Edmonds, she is awkward, confident, shy, and easy to identify with. Edmonds, who you've probably never seen before, shows off a beautiful humanity in her character. And that is true for the rest of the cast. Each of them are given people with real personalities and eccentricities. Nobody is flat or dull to watch. This film is directed by Peter Duffell, a man who made little else of note during his career (unless you count \"The House That Dripped Blood\", and I don't). The style here is somewhat more the territory of producer David Puttnam, who worked on several such films. This is almost the prototype for Bill Forsyth's \"Local Hero\", which Puttnam produced the following year. I can't say what it is about \"Experience Preferred... But Not Essential\". It could be how it brilliantly pulls off an overlong title. Haha. Or the fact that it's so pure and down-to-earth. It's little-seen, that much is sure. So anyone coming across it is certainly free to consider it a personal discovery. Being only available on VHS makes that an ever-rarer possibility. I found it at a tiny store that carries this sort of thing. It's a fun, cheerful, mostly light film. You should enjoy it. I know I did.",
         "No matter how many times I watch this delightful coming-of-age movie, I discover something new about the characters. They almost seem to grow with you over the years, so familiar do they become to you, like old friends. These (well, most of these) are people I would want to know, women I would love to have as friends for life -- I DO have friends for life like them. I find myself wondering what their lives would be like now, 40+ years after the film is supposed to take place. That, to me, is the mark of a film extraordinarily well conceived, written, directed and acted. An absolutely dear, touching, funny film, very worth hunting down.",
         "I agree - this is a thoroughly delightful film! It puts a new, entirely believable twist on the usual \"coming of age\" saga, with nicely developed and interesting characters. There are some quirky moments, but they're endearing, not the least bit offensive. I have been looking for a copy of this movie for years, on line as well as at going-out-of-business video stores, to no avail. Every year I check to see if it has been released on DVD...I refuse to give up hope! This is one little film that those of us who already love it want to see again - and are eager to share with a whole new group of group of viewers who are sure to become fans!",
         "Every other reviewer here hit the nail on the head about this film-- \"enchanting\", \"sweet\", \"a gem\", \"beautiful\", \"charming\", all apply to this terrific sleeper of a film. I came across it very late one night on cable TV when I couldn't sleep and was doing some channel-surfing. I had never heard of this film, director Peter Duffell or pretty much anybody in it, so I figured I'd give it a shot, see how bad it was. I couldn't possibly have been more wrong. A lovely, warm, funny, beautifully directed, superbly acted slice of life that just charmed the pants off me. I haven't seen it since--this was in the mid-'80s--and I'd love to see it again. If you ever get the chance, do yourself a HUGE favor and check it out. You won't be disappointed."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Channel Four Film",
         "Enigma Productions",
         "Goldcrest Films International"
      ],
      "summaries": ["A shy, introverted young girl takes a summer job at a seaside resort in Wales. She finds the staff, the owners and patrons unlike anyone she has ever met before."],
      "budget": 0
   },
   "movielensId": 3047,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1982-12-22",
      "dvdReleaseDate": null,
      "directors": ["Peter Duffell"],
      "runtime": 80,
      "movieId": 3047,
      "title": "Experience Preferred...But Not Essential",
      "mpaa": null,
      "actors": [
         "Elizabeth Edmonds",
         "Sue Wallace",
         "Geraldine Griffiths",
         "Karen Meagher",
         "Maggie Wilkinson",
         "Ron Bain",
         "Robert Blythe",
         "Roy Heather",
         "Peter Doran",
         "Arwen Holm",
         "Sion Tudor Owen",
         "Robert Gwilym",
         "Mostyn Evans",
         "Paul Haley",
         "Alun Lewis"
      ],
      "imdbMovieId": "0083911",
      "originalTitle": "Experience Preferred...But Not Essential",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "A shy, introverted young girl takes a summer job at a seaside resort in Wales, where she finds the staff, the owners and patrons unlike anyone she has ever met before.",
      "tmdbMovieId": 276635,
      "avgRating": 3.56667,
      "releaseYear": "1982",
      "numRatings": 90,
      "posterPath": "/OtgR6mCPIXJI9K73aeE2COfd4T.jpg"
   }
}