{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0083254",
      "video": false,
      "title": "Under the Rainbow",
      "recommendations": [
         37200,
         36006,
         26319,
         20545,
         38914,
         47908,
         42264
      ],
      "backdrop_path": "/xHSOLh7E8YF8otfk3QokhHMfugk.jpg",
      "revenue": 2297493,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Bruce Thorpe",
               "gender": 2,
               "credit_id": "52fe474fc3a36847f812e941",
               "name": "Chevy Chase",
               "profile_path": "/svjpyYtPwtjvRxX9IZnOmOkhDOt.jpg",
               "id": 54812,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Annie Clark",
               "gender": 1,
               "credit_id": "52fe474fc3a36847f812e945",
               "name": "Carrie Fisher",
               "profile_path": "/oVYiGe4GzgQkoJfdHg8qKqEoWJz.jpg",
               "id": 4,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "The Duchess",
               "gender": 1,
               "credit_id": "52fe474fc3a36847f812e949",
               "name": "Eve Arden",
               "profile_path": "/48QTc9iIS3nuJOE8FiAV6qPFPuj.jpg",
               "id": 860,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "The Duke",
               "gender": 2,
               "credit_id": "52fe474fc3a36847f812e94d",
               "name": "Joseph Maher",
               "profile_path": "/hgq8vDtBsk0ovVxRJHkAyXzTVth.jpg",
               "id": 20626,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "The Assassin",
               "gender": 2,
               "credit_id": "52fe474fc3a36847f812e951",
               "name": "Robert Donner",
               "profile_path": "/6GXjsXEC5a0BoFwq1pad5OqJ5M9.jpg",
               "id": 13875,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Otto Kriegling",
               "gender": 2,
               "credit_id": "52fe474fc3a36847f812e955",
               "name": "Billy Barty",
               "profile_path": "/h6Xf5csmdoIOUIFi8iRjtQMygQT.jpg",
               "id": 12659,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Nakomuri",
               "gender": 2,
               "credit_id": "52fe474fc3a36847f812e959",
               "name": "Mako",
               "profile_path": "/gU3eoZP8OQZLFMPZ9MYWa6pajvT.jpg",
               "id": 10134,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Rollo Sweet",
               "gender": 2,
               "credit_id": "52fe474fc3a36847f812e95d",
               "name": "Cork Hubbert",
               "profile_path": null,
               "id": 83839,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Tiny",
               "gender": 2,
               "credit_id": "52fe474fc3a36847f812e961",
               "name": "Pat McCormick",
               "profile_path": null,
               "id": 45611,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Henry Hudson",
               "gender": 2,
               "credit_id": "52fe474fc3a36847f812e965",
               "name": "Adam Arkin",
               "profile_path": "/zCLaZZMQxBMZ4DtXOecy84xnO2g.jpg",
               "id": 55257,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Lester Hudson",
               "gender": 2,
               "credit_id": "52fe474fc3a36847f812e969",
               "name": "Richard Stahl",
               "profile_path": "/iX93hFXsRMOglVvjDI8Fve01TQX.jpg",
               "id": 95785,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Homer",
               "gender": 2,
               "credit_id": "52fe474fc3a36847f812e96d",
               "name": "Peter Isacksen",
               "profile_path": null,
               "id": 106250,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Louie",
               "gender": 2,
               "credit_id": "52fe474fc3a36847f812e971",
               "name": "Jack Kruschen",
               "profile_path": "/3QOPlFyLfFR8cLe0pseRjrm3lra.jpg",
               "id": 4094,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Akido",
               "gender": 2,
               "credit_id": "52fe474fc3a36847f812e975",
               "name": "Bennett Ohta",
               "profile_path": null,
               "id": 73583,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Hotel Rainbow Guest",
               "gender": 2,
               "credit_id": "594cd54e925141312702119f",
               "name": "Jerry Maren",
               "profile_path": "/erf62QnJh3PBBow8lzcAv5fadzT.jpg",
               "id": 127193,
               "order": 14
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe474fc3a36847f812e93d",
            "name": "Steve Rash",
            "profile_path": "/t7sZbMXWCHp80p5tPFTnsPY037h.jpg",
            "id": 54590,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 1.697266,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 47941,
      "vote_count": 9,
      "budget": 20000000,
      "overview": "In World War II era Los Angeles, the manager of the Culver Hotel leaves his nephew in charge for a weekend. The nephew changes the name to the Hotel Rainbow and overbooks with royalty, assassins, secret agents, Japanese tourists, and munchkins (from the cast of _Wizard of Oz, The (1939)_ ). Secret Service agent Bruce Thorpe and casting director Annie Clark find romance amidst the intrigue and confusion.",
      "similar": [],
      "original_title": "Under the Rainbow",
      "runtime": 98,
      "poster_path": "/mCdXzpghn4tPz6hbQcvS2UwOh1C.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1981-07-31",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "Who knew so many little people would throw such a huge party?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Steve Rash"],
      "runtime": 98,
      "synopsis": "It is 1938, and the USA is still gripped by the great economic depression. A corrugated iron barn surrounded by mud and puddles, in the middle of a fallow field somewhere in Kansas, is serving as a refuge and hostel for a community of the destitute, homeless and unemployed, as well as a post office and bus station. Diminutive Rollo Sweet (Cork Hubbert) enters the barn, goes to the post office grille and asks the Mail Clerk (Bill Lytle) whether anything came for him. Nothing. The man pours cold water on his hopes and dreams of an offer of a job from the Hollywood movie studios. He says if he doesn't get an offer with bus fare to California, he'll mail himself there if he has to. A crowd of other residents crowds around a skeletal wireless receiver, which has its metal chassis with the glowing vacuum tubes naked on the shelf where it sits. It needs a long wire strung all the way up onto the barn roof as an antenna if it is to receive the broadcast from the radio station. Just then, the announcer introduces a broadcast by the President, Franklin Delano Roosevelt, but suddenly the sound degrades into noise, and Rollo volunteers to go outside and fix the aerial which he says will have been knocked by the sign falling in the wind. Outside, the little man clambers up on a pile of rubbish to the porch and is stretching up to lash the aerial wire back onto the edge of the corrugated iron roof when the bus arrives and in his excitement he looks round, loses his footing, and tumbles down off the roof landing on the teetering pile of old furniture, motor tyres, and dusty junk. The voice on the radio, however, has been restored. It speaks of Hitler's invasion of Germany's neighbours and just then we are shown the Führer (Theodore Lehmann) who is instructing his diminutive but aggressive secret agent Otto Kriegling (Billy Barty, doing a theatrically strong German accent) on his latest mission. Otto is to go to California, to a certain hotel, to meet up with an agent of the Emperor from Tokyo, whom he will recognize because he will be Japanese and wearing a white suit. The latter will recognize Otto because of his height --- he is 3 feet 9 inches tall (1.14 metres). In addition, the Japanese agent will utter to Otto as a secret password the unusual statement \"The pearl is in the river\", which will prove he is the man to whom Otto must hand over a secret map of America's military defense system. Otto departs, confident that nothing can go wrong with these arrangements. The scene switches to the movie studios right across the street from that very hotel, where Annie Clark (Carrie Fisher) is being shown a matt painting of a huge mansion, a money saving photographic effect supposedly being used in Gone With The Wind which is close to completion, by her boss Louie (Jack Kruschen). Louie then tells her she has to look after 150 diminutive actors and extras who are about to arrive in town on Sunday from all over the world, to play the Munchkins in The Wizard of Oz, of which scenes involving them are about to start shooting the following day (the Monday). She is also instructed to make use of the services as her assistant of the boss's very tall nephew Homer (Peter Isacksen), an evidently slightly slow-witted young man who thereafter follows her about for a while. She must also find \"a funny dog\" (to play Dorothy's dog Toto) ... The scene changes again to the New York city quayside, where a passenger liner from Europe has just docked. Bruce Thorpe (Chevy Chase) is there to meet an Austrian royal duke (Joseph Maher) who has, since the ship sailed from England, enjoyed the protection of Inspector Collins (Anthony Gordon) of Scotland Yard. Thorpe is with the US government Secret Service and is to continue personal protection for the Duke and Duchess (Eve Arden). He shows his badge to the ship's officer on the gangplank and gets aboard to meet his charges. A sinister looking man following him is turned back. A considerable number of very small people are going ashore from the liner and heading for the same transcontinental railway station. Typical for an American, Thorpe has no idea of the correct form of address for European aristocracy, and ranges through a variety of forms without ever lighting upon \"Your Grace\", the correct way to address a Duke. He quickly discovers that the Duke lives in permanent dread of assassination, although Thorpe tries to assure him that the likelihood of this being attempted in America is slight. To forestall this, the Duke continually dons a series of childish disguises such as spectacles attached to a false nose and moustache. His other preoccupation in life is preserving his wife's companion, a dog which she calls Strudl. But Strudl is forever coming to grief in one way or another. Fortunately the Duchess has extremely poor eyesight, but refuses to wear her spectacles, so that she believes that almost any dog of roughly the right size and colouring is her beloved pet. The Duke tells Thorpe that a dozen of these animals have already died in one way or another without her noticing, the first by assassination: the Duke's father fell on the dog and killed it when he was assassinated. On the train across America, we catch sight of the sinister man, the Assassin (Robert Donner), but he never gets a shot at the Duke. However the dog Strudl is accidentally shot by the Duke when he shows Thorpe his own pistol, and Thorpe has to help the Duke find a replacement. They achieve this by bribing the conductor to leave them alone in the baggage car, where they find an unattended item of live canine cargo and rush back to the Duchess with the poor pooch, to assure her that her pet is still alive and well. As they leave the baggage car, Rollo cuts his way out of a mail bag with a pocket knife ready to escape from the train at its destination. All make it across the continent and duly alight in Los Angeles. Annie Clark is at the station to meet some of her diminutive charges as they get off the train. She bumps into Bruce Thorpe in the huge shady station building and her good looks get his attention --- for a moment. Rollo runs from the Los Angeles railway terminus with a ticket collector in pursuit, but hides himself among other small people, and gladly joins them when invited to get his first job in movies playing a Munchkin with them. Thorpe has booked the entire top floor of the Culver Hotel, which he thinks will be quiet and thus a safe retreat for his aristocratic charges. We are now taken inside the foyer of the Hotel, where the Telephone Operator Miss Enwright (Louisa Moritz) is taking a call from Homer across the street at the movie studios. Homer wants to book accommodation for 150 small people at the hotel. The girl writes this down, but then has her head turned by her boss, Lester Hudson (Richard Stahl), who invites her away for a trip with him to a hotel managers' convention (a likely story). This trip has the double effect first, of turning her head so much that she completely forgets to book the 150 small guests, and second, of leaving the hotel in the hands of the boss's nephew Henry Hudson (Adam Arkin) to whom he makes cleared he will be not only fired but disinherited if he screws up the job of minding the hotel while he is away. Henry, thinking he has an almost empty hotel to manage and that he must impress his uncle by filling it with guests, now has a banner strung across the front of the building renaming it The Hotel Rainbow. He has a very limited staff at his disposal: a very elderly man dressed as a bell boy, a lift operator called Otis (Freeman King), and a very tall house detective called Tiny (the 6ft 7in Pat McCormick) who has a brown bowler hat and a drink problem. Agent Bruce Thorpe arrives with the Duke and Duchess, and the dog, and they move into the top floor. Meanwhile an entire busload of Japanese gentlemen tourists arrive, all wearing white suits, and temporary manager Henry Hudson welcomes them to the hotel, still unaware of the imminent Munchkin contingent. (The bus has on its side the legend \"JAPS -- the Japanese Amateur Photography Society\".) Agent Otto Kriegling now arrives and strides into the hotel. He immediately realizes he has a problem: he is apalled to see twenty Japanese men in white suits, has no idea which of them is his oriental contact, and says at once, very loudly, \"The pearl is in the river\". However, after glancing round at him the tourists ignore this and return to taking photos of everything in sight in the hotel foyer, including the mail box and the postcards in the rack at the desk. At this moment the Munchkin contingent arrives outside, heads in through the doors, along with Annie Clark and Homer, so that it dawns on Henry that he doesn't have enough room for all these small people as well as for the two dozen Japanese men in white suits so long as the top floor is taken by just three people. Now Annie begs Bruce to let some of her little people use top floor rooms; but he declines, trying to be both suave and authoritative, chivalrous but firm, believing that the Duke's safety depends on isolation. Otto is quickly caught up among the little people in the hotel foyer. The real Japanese secret agent Nakomuri (Mako) now arrives and immediately realizes that he has a problem: he has no idea which of the many dozen little people in and around the hotel is his Nazi contact. Day moves to night, and the hotel restaurant is full of oriental men in white suits, and little people, all having dinner. One tourist who speaks English has made friends with Annie and borrowed a Wizard of Oz script, which is on his table in front of him to read while he has his dinner. At the next table sit the Duke and Duchess, and the dog Strudl, which is enjoying a plate of paté de foie gras -- in plain American, goose liver. The assassin lurks in a corner. Otto scans the room for a clue as to which Japanese is his contact. Something startles the Duchess and a large pearl comes loose from her antique necklace and, thrown through the air, lands in the dog's food. The helpful tourist looks up from Annie's script, notices the Duchess in distress at losing her pearl, and says loudly \"The pearl is in the liver\" ... except that, with the stereotypical Japanese phonetic error, he says not \"Liver\" but \"River\" and this is clearly heard not only by the Duchess (who retrieves her pearl) but by Otto who assumes he has found his contact and, going over to the tourist's table, slips the military map between the pages of the Wizard of Oz script, which is then given back to Annie. Upon this error hinges the rest of the plot! After dinner, all hell breaks loose for most of the rest of the picture. Still in the dining room, the assassin attempts to shoot the Duke but instead kills the tourist who read Annie's script. During the evening, a couple more of the Duchess's dogs are killed by one means or another and the Duke and Bruce Thorpe replace them at the local pet store. Bruce comments that the latest one had better not be killed because the store only has sheep left --- the Duchess's eyesight is evidently not quite that bad. The little people go off across the road to get Munchkin costumes and makeup done overnight, ready for an early start shooting Wizard of Oz scenes, but when they return all ready, of course they cannot go to bed in costume and makeup, so they stay up, get drunk, and then run riot in the hotel. There are many sight gags of what the little people are getting up to in the kitchens, in the hotel foyer, around its staircase, balcony, chandelier, and tormenting the already distraught Henry Hudson. Otto and Nakomuri meet, and realize the map is in unaware Annie's possession so they go after her. Then Homer sees Otto and carries him bodily off to the studio costume & makeup shop from where he returns dressed and bewigged like the other small people. He takes up his pursuit of Annie, searches her room without finding the map, then corners her in the hotel kitchens but is taken on by Rollo, all in his own Munchkin costume which just happens to be identical to Otto's. Annie gets shut in the walk-in freezer room. Bruce comes to rescue her but lets the door shut so they are both trapped, and they cuddle up to keep warm -- the beginning of romance. Bruce sees two dead Japanese in white suits hanging with the meat. Rollo lets Bruce and Annie out, and the fight goes on as Rollo rouses all the Minchkins to help pursue Otto. Finally Otto and Nakomuri corner Annie, Bruce, the Duke and the Duchess in a hotel room, but then the Assassin has also caught up with the Duke at last. He explains that his father tried to assassinate the Duke's father at the outbreak of the First World War, but that he missed the bus, so it has been his own life's destiny to avenge his father's failure and assassinate the present Duke instead. However, as he produces his gun, Nakomuri points his own special lethal camera at the Assassin and the two shoot each other dead. Otto is now alone. He throws the dog out as a distraction, and points his sword at Annie's throat demanding to have the map, whereupon Bruce tells Otto that the map is hidden in a locket on the Duchess's dog's collar. As day breaks, Otto runs out of the hotel front door after the dog, which runs across the sunny street onto the movie studio lot where it, Otto, and the pursuing crowd of Munchkin actors disrupt sound stages shooting scenes for a western, Gone With The Wind (Otto joins the dog under Scarlett's crinoline and an off-camera Clark Gable tells the director he should keep it in the picture), then Otto gets the locket and tries to get away in a vintage bus, and Rollo chases him with a horse-drawn carriage. It looks as though all will be well. Then Rollo wakes up. We get a proper look at the other people in the corrugated iron barn hostel in Kansas, and notice that among them are the faces of Bruce and Annie (who are engaged to be married), the Duke and Duchess, and the Assassin. We are led to realize that the whole story has been Rollo's dream, rather as the adventure of the Yellow Brick Road and Oz was Dorothy's dream, with its characters wearing the faces of people she knew. And it seems an offer of work in movies has finally arrived for Rollo, and all his friends at the hostel wish him well, as they put him on yet another bus that pulls up then and is headed west for Hollywood. It is full of little people and, when the door opens, a bald little man welcomes Rollo aboard and introduces himself as an actors' agent for little people who will look after him. Rollo recognizes his face; it's that of Otto Kriegling... but the voice is All American, not German.",
      "writers": [
         "Fred Bauer",
         "Pat Bradley"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0083254/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgyMDIyMzI2MV5BMl5BanBnXkFtZTYwNTgxMTk5._V1_.jpg",
      "actors": ["Stars: Chevy Chase, Carrie Fisher, Eve Arden | See full cast and crew »"],
      "reviews": [
         "It does amaze me at times to see what are considered camp classics and then see how so many people can miss an obvious one. This is one film that truly has it all...drunken midgets, nazi spies, princess leia, and a host of off-colour jokes sure to offend ALL. Seriously, if your a member of the PC thought police this film will give you reason to write your congressman (or is it congressperson?) but if you are intelligent enough to realize that when everyone is being poked fun at no one is stigmatized then you might just enjoy this comedic spoof which is as frantic and disjointed as the plot. One last point regarding the \"munchkins\": although it might be easy to see this film as taking liberty with the rumors (and some were true) that the midgets who acted in the Wizard of Oz were wild drinking partiers, it should be noted that this notion goes just as far to show how normal this population is; just as interested in getting drunk, laid, and having a good time as the rest of society. A very human face which has not always been offered to actors who are seen primarily in fantasy films (Oz, Willy Wonka, Time Bandits, and even Tiny Town). I do know that the actors on this film were paid better than those on Oz and certainly had no problem with the script in giving their enjoyable performances. A fun ride",
         "With a bit of dark humor thrown in. This is one of my top favorite movies. Mistaken identities and foiled evil plots abound. Those concerned with its lack of \"political correctness\" should relax and not be so serious. One reviewer said that, if there was anyone they missed making fun of, it must have been only because they ran out of film stock. Exactly! This film has equal opportunity humor. A Japanese friend of mine, personally not known for his tremendous sense of humor, thought the film was hilarious, and has watched it several times, laughing hardest at the Japanese caricatures. I highly recommend this overlooked gem. Get it, watch it, loosen up and laugh.",
         "That's right...this movie is as campy and goofy as you can get and one almost wonders why the stars that were in it (at the time) decided that THIS was a film that they wanted to be in...but...to watch it again...it's almost like a precursor to a Seinfeld episode whereas the many plots all come together at the end to make a very funny and often overlooked film...come on...if Rocky Horror is regarded as a classic, why can't this film?...it has a plethora of midgets, Japanese tourists and spies...Chevy Chase in his prime...and is a takeoff of the Wizard of Oz?...how much more odd can you get...a definite rental that grows on you!",
         "Chevy Chase, Carrie Fisher, Pat McCormack, Billy Barty, Eve Arden, Joseph Maher, Adam Arkin, Cork Hubbard, Robert Donner \u0096 how could it not be good. The temporary manager (Arkin) of the Culver Hotel, across from MGM in 1939, changes its name to Hotel Rainbow to take advantage of the publicity surrounding the soon-to-be shot Wizard of Oz. It works as the studio's talent agent (Fisher) books rooms for all of their wouldbe munchkins. So, we start with hundreds of partying little people who make a Shriners convention look like a religious retreat. Throw in an FBI agent (Chase) protecting a traveling Duke (Maher) and Duchess (Arden) from a crazed assassin (Donner), and then a couple of dozen photo- snapping Japanese tourists whose bus breaks down in front of the hotel. Finally, sift in a Japanese agent (Mako) and a dwarf Nazi spy (Barty) who are looking for each other in a hotel full of Japanese and dwarfs. The plot is decent without getting in the way of the comedy, the acting is great, and the dialogue is often superb (What floor do you want? Ballroom. Oh' I'm sorry, I didn't know I was crowding you.) All in all, it's a great way to spend an afternoon.",
         "What a great underrated movie. Everywhere I look it gets awful reviews, but they don't seem to take into account the campiness of the movie. It doesn't make fun on little people, or at least it doesn't poke more fun at them than anyone else! It makes fun of everyone! If you can find it, at least rent it and give it a try. If you watch it, you'll want to buy it... I did. My whole family enjoyed the movie, and I believe yours will to... Wholesome fun for anyone who enjoys spoofs of spy movies or comedies in general. Chevy Chase is at his prime and best in this movie, sure the script isn't great, but what movie in this genre is? The slap-stick of the movie is incredible and the acting is above most in the category! I have several friends that happen to be little people, and they all enjoyed the movie, and didn't find it offensive in the least. The writers make fun of everyone, while not belittling anyone (except Nazi war criminals, give it a chance!)...",
         "I remember this film film as among my favorites growing up. Forget the fact that it is absolutely politically incorrect. Of all my friends growing up (Japanese, African-American, and yes event a \"little person\") we all have found it hysterical over the years. The movie excited my imagination beyond most other films. While no jewel of the cinema, it will always hold a spot in my psychological toy chest, with Fletch, Foul Play, Time Bandits, and other movies too busy entertaining than to think about oversensativities.",
         "But it was supposed to be a spoof. I could not stop laughing as the movie was so much of a farce I found it to keep me laughing all the time. I would not recommend it for theater view but if you have never seen the movie I would say its worth watching as a rental as the cost of it is so little now. You could rent something much more costly and worse like Dead Calm. I found that all the dumb things that happened such as trying to keep the suicidal dog in the picture just more then my sides could take at times. When that dog jumped out of the window for the ball I lost it. How could you not think something as this movie which I assume was to be as \"B\" a movie as anyone could possibly make not be funny? I found it much better then the Vacation movies by far. I would say that this review has a spoiler but this movie cant be spoiled as there is no real plot.",
         "This is a great movie that satirizes Hollywood stereotypes in a fun filled slapstick romp. Sadly, many people miss the point of satire, and will only see the stereotypes. They will not enjoy the movie, but then why do people with no sense of humor even pick up a comedy?? The main character is led through an unbelievable sequence of events while staying at a hotel awaiting a tryout for \"The Wizard of Oz\". The hotel is filled with hopefuls for the Munchkin parts, and has been chosen as a supposedly quiet meeting place for a Japanese and German spy to exchange info. The German is a midget, and the addition of a Japanese tour bus stopping at the hotel makes the meeting of these two spies quite a mess. toss in lots of slapstick, satire, and chase fun, and you have a comedy romp that the whole family can belly laugh to.",
         "I know I will be in the minority but I love this film! ( you are probably even more confused by that statement if you see the films I like most in my review postings.) I found the film fun and light hearted. Chevy Chase is at his best,Carrie Fisher is amusing, gutsy and quite fetching. Joseph Maher and eve Arden almost steal the film as the Duke and Dutchess and A pre-Chicago Hope Adam ARKIN shines as the hotel manager. Yes, I give you the fact that some of the jokes may seem very un-p.c. today but they are not malicous,its all in fun. (OH, and did I mention that this film gave the great Billy Barty his best role in years? )",
         "This movie is a farce. It's big, broad humor... or little broad humor, to be accurate because most of the actors are little people. The Culver Hotel played host to all of the actors who played munchkins during the filming of The Wizard of Oz. Apparently, it was a debacle. The actors partied, drank, and wreaked havoc on the hotel during a stay that has become legendary in Los Angeles. While the specific events of this film are fictional, most of the movie is indeed based on a true event. Now, of course a great story doesn't always make for a good movie. This is indeed a broad, goofy, slapstick comedy. Whatever your level of offense at ethnic and physical stereotypes, some of the humor is groan-worthy."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Innovisions",
         "ECA",
         "Orion Pictures"
      ],
      "summaries": [
         "In 1938 Los Angeles, the manager of the Culver Hotel leaves his nephew in charge for a weekend. The nephew changes the name to the Hotel Rainbow and overbooks with royalty, assassins, secret agents, Japanese tourists, and munchkins (from the cast of _Wizard of Oz, The (1939)_). Secret Service agent Bruce Thorpe and casting director Annie Clark find romance amidst the intrigue and confusion.",
         "A visiting dignitary, a CIA agent, a Nazi spy, Japanese tourists, an assassin and a group of \"midget\" actors from Der Zauberer von Oz (1939) check into a Los Angeles hotel."
      ],
      "budget": 20000000
   },
   "movielensId": 3048,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1981-07-31",
      "dvdReleaseDate": null,
      "directors": ["Steve Rash"],
      "runtime": 98,
      "movieId": 3048,
      "title": "Under the Rainbow",
      "mpaa": "PG",
      "actors": [
         "Chevy Chase",
         "Carrie Fisher",
         "Eve Arden",
         "Joseph Maher",
         "Robert Donner",
         "Billy Barty",
         "Mako",
         "Cork Hubbert",
         "Pat McCormick",
         "Adam Arkin",
         "Richard Stahl",
         "Peter Isacksen",
         "Jack Kruschen",
         "Bennett Ohta",
         "Jerry Maren"
      ],
      "imdbMovieId": "0083254",
      "originalTitle": "Under the Rainbow",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "In World War II era Los Angeles, the manager of the Culver Hotel leaves his nephew in charge for a weekend. The nephew changes the name to the Hotel Rainbow and overbooks with royalty, assassins, secret agents, Japanese tourists, and munchkins (from the cast of _Wizard of Oz, The (1939)_ ). Secret Service agent Bruce Thorpe and casting director Annie Clark find romance amidst the intrigue and confusion.",
      "tmdbMovieId": 47941,
      "avgRating": 2.51852,
      "releaseYear": "1981",
      "numRatings": 351,
      "posterPath": "/mCdXzpghn4tPz6hbQcvS2UwOh1C.jpg"
   }
}