{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0061789",
      "video": false,
      "title": "How I Won the War",
      "recommendations": [
         106828,
         49298,
         163041,
         18953,
         104144,
         86379,
         75184,
         86482,
         93520,
         26831,
         27196,
         127103,
         50550,
         82545,
         123772,
         57300,
         61445,
         26176,
         44568,
         83587
      ],
      "backdrop_path": "/plS5HG8v8YTp8Vchx0sDho7zSqT.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Goodbody",
               "gender": 2,
               "credit_id": "52fe45c3c3a368484e06d85f",
               "name": "Michael Crawford",
               "profile_path": "/mjHIQxrulLGCoqn6JrvCdPn7Apa.jpg",
               "id": 19610,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Gripweed",
               "gender": 2,
               "credit_id": "52fe45c3c3a368484e06d85b",
               "name": "John Lennon",
               "profile_path": "/oVQZxiY6RTuICdkVN6nF8XJYJVe.jpg",
               "id": 10592,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Clapper",
               "gender": 2,
               "credit_id": "52fe45c3c3a368484e06d863",
               "name": "Roy Kinnear",
               "profile_path": "/vPG07Lh06DuUlpcd8evvJjAGq8k.jpg",
               "id": 3463,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Transom",
               "gender": 2,
               "credit_id": "52fe45c3c3a368484e06d867",
               "name": "Lee Montague",
               "profile_path": "/fIgb4hTX4XAc19kOM92H7Kifopg.jpg",
               "id": 24699,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Juniper",
               "gender": 2,
               "credit_id": "592c4ac09251413b4507984a",
               "name": "Jack MacGowran",
               "profile_path": "/vXcFq34SsCNmFLbUIGhziTiTLit.jpg",
               "id": 14016,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Grapple",
               "gender": 2,
               "credit_id": "592c4acf9251413b41076ffc",
               "name": "Michael Hordern",
               "profile_path": "/jvy4gJc9cS1MJPgHJXefRUYGUYJ.jpg",
               "id": 39741,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Melancholy Musketeer",
               "gender": 2,
               "credit_id": "5a2e009b0e0a264cbe15693e",
               "name": "Jack Hedley",
               "profile_path": "/nHNv9DqFM8VWFxBrK88nwYqCG0j.jpg",
               "id": 10507,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Spool",
               "gender": 2,
               "credit_id": "5a2e00a50e0a264cbe156945",
               "name": "Ronald Lacey",
               "profile_path": "/nQTtqJP7Go9cnvq9252IXqY9dMM.jpg",
               "id": 653,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Drogue",
               "gender": 2,
               "credit_id": "5a2e00adc3a3680b9a16c879",
               "name": "James Cossins",
               "profile_path": "/2kjM9bIz7h66ysu6AcMAsyj93bv.jpg",
               "id": 33109,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Dooley",
               "gender": 0,
               "credit_id": "5a2e00b5c3a3680b9a16c880",
               "name": "Ewan Hooper",
               "profile_path": "/oW8HsIDBxOzrKX8B3wUfCGIPTli.jpg",
               "id": 80418,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Odlebog",
               "gender": 2,
               "credit_id": "5a2e00c20e0a264ccd15e274",
               "name": "Karl Michael Vogler",
               "profile_path": "/k1hTwobC6OromK5fxq7A8YDcmGh.jpg",
               "id": 32021,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "American General",
               "gender": 2,
               "credit_id": "5a2e00d6c3a3680b8f1594d8",
               "name": "Alexander Knox",
               "profile_path": "/gWwgGHhIGHw9T7vZE4eyo9JFb4g.jpg",
               "id": 40529,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "British General",
               "gender": 2,
               "credit_id": "5a2e00e5925141032c15cd96",
               "name": "Robert Hardy",
               "profile_path": "/y6NTr4kw3mNQnPmvhs4XMiFT8v5.jpg",
               "id": 23076,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Mrs. Clapper's Friend",
               "gender": 1,
               "credit_id": "5a2e00f6c3a3680b8815eaaa",
               "name": "Sheila Hancock",
               "profile_path": "/ex0nkKMoIFq1nsVHZsNmSGWafkt.jpg",
               "id": 93839,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe45c3c3a368484e06d857",
               "name": "Richard Lester",
               "profile_path": "/2H4PFCd4G8BLHK34lTsUs3cn2tM.jpg",
               "id": 10586,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "59187adb92514105da03d6e9",
               "name": "Charles Wood",
               "profile_path": null,
               "id": 444552,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "592c4b35c3a36877ee079825",
               "name": "David Watkin",
               "profile_path": null,
               "id": 10639,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "592c4b49c3a368783e077fad",
               "name": "John Victor-Smith",
               "profile_path": null,
               "id": 29538,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "War",
            "id": 10752
         }
      ],
      "popularity": 2.10336,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 29048,
      "vote_count": 12,
      "budget": 0,
      "overview": "An inept British WWII commander leads his troops to a series of misadventures in North Africa and Europe.",
      "similar": [],
      "original_title": "How I Won the War",
      "runtime": 109,
      "poster_path": "/whI4pAKrLeZjOC5qYnO6QJbEi2x.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [],
      "release_date": "1967-10-23",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "\"There's been some marvelous advances in surgery, thanks to war!\"",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Richard Lester"],
      "runtime": 109,
      "synopsis": "This film contains the memoirs of one Lt. Earnest Goodbody (Michael Crawford) of 3rd troop, 4th Musketeers--albeit presented to us via 2 perspectives. Early on in the film, the lieutenant is captured while attempting to cross the Rhine river and secure the last intact bridge for the Allies (having boarded an inflated raft by himself and been abandoned by his men). He intermittently recounts his story to a German officer (Karl Michael Vogler) while we, the viewing audience, are also treated to what really happened (seeing as he sugar-coats his version of the story). His earliest recollections are of his officer training under Lt. Colonel Grapple (Michael Hordern), who is shown to be as oblivious to the suffering of his charges as Goodbody proves to be. During the introduction of the story (and shortly thereafter), we meet the men under Goodbody's command: Transom--the unit's suffering second-in-command, who proves to be the only true, hard-working soldier in the group. He is reluctant to take charge of the situations they find themselves in but often does. He encourages the others to kill the Lieutenant and resists the temptation several times. Portrayed by Lee Montague. Dooley--the unit's third-in-command. While he and Transom start at the same rank in the beginning (Corporal), he seems more than willing to place most of the rank-induced responsibilities in the other man's hands. In fact, he acts more like a lackey to Transom than an equal. Portrayed by Ewan Hooper. Gripweed--the Lieutenant's batman (appointed personal assistant, as was common at the time in the British Army). He is a compulsive thief and admits to having been a former member of the British Fascist Party. He seems to show some naivete regarding the true nature of war and the incapabilities of his unit and often is found both chiding and being sycophantic towards Goodbody. Portrayed by then-Beatle John Lennon. Juniper--serves as both the unit's crusty old veteran and the would-be comic relief man. He appears more than willing to spur the rest of the group on to do things but is unwilling to do any real fighting. Throughout the film we see him appear in various comedic guises (such as a ventriloquist with a dummy and a clown). He is perceived by the others to be going insane and as the film progresses; he 'promotes' himself both in rank and as a master strategist (using medals taken from dead soldiers). Portrayed by Jack MacGowran. Clapper--the realist of the group. He is constantly harboring the belief that his wife is cheating on him back home (we find out, mere moments before his death, that she was merely making up stories based on the affairs a neighbor of theirs was having). While, like the rest of the unit, he has little respect for Goodbody, he goes to him for advice numerous times. He also endures the most criticism from Transom regarding his general appearance as a soldier (being told he's improperly dressed for merely having his shirt not buttoned right--although Juniper, standing next to him in the particular shot, is dressed as a clown). Portrayed by Roy Kinnear. Drogue--resigned to dying in North Africa (as he points out repeatedly), he is constantly willing off his possessions to other members of the unit. While he's one of the few to show some level of bravery in the film, he is also shown not to be too careful. Portrayed by James Cossins. Spool--the wireless radio operator for the unit (who never gets to do so). The only major fault that can be attributed to him is that he's probably the clumsiest member of the group (he immediately gets a splinter while holding a fake rifle during training and later sets Goodbody up for landing headfirst in a sand pit merely by knocking into him with a ladder). Portrayed by Ronald Lacey. The Melancholy Musketeer (real name not known, even to himself)--the resident coward of the group, who seems to be completely unaware of what he's fighting for, and why he signed up in the first place. He flees for cover in the middle of battle and at one point even abandons the group (only to be picked up later in the film having hidden in a German truck and claiming to have been captured). Portrayed by Jack Hedley. The unit's first assignment is to land behind enemy lines and set up an advance cricket pitch at an oasis. The purpose of the mission: to give Allied soldiers something to look forward to when they take that particular region. Any other unit would have felt disgraced to accept such a mission but Lt. Goodbody takes it with pride (fearing his men will die of boredom otherwise). The mission immediately is bungled when Goodbody accidentally orders signal rockets fired (giving away their position to a nearby German defense post). In the hustle to avoid being cratered, the unit loses half of their vehicles and Dooley is killed. In a twist of surrealism, each soldier that dies under the Lieutenant's command returns immediately after, replaced by a soldier painted to resemble a plastic army man. From Goodbody's perspective, that man is still alive. Footage shown during the death scenes of these characters is tinted a certain color for each incident (green, then pink, then red, then blue), and the dead soldier 'returns' in that color. With half of their vehicles gone and little fuel remaining, Goodbody decides to raid a German fuel dump on their way to the oasis. In spite of mounting excitement from some of the men (Transom and Goodbody, specifically, with Juniper doing a brief standup routine--during which the two others debate whether or not the man has lost his mind), the raid on the fuel dump ends predictably in failure, seeing as only 3 of the men are willing to advance on the outpost once it's realized that the Germans have heavy machine guns. Drogue is killed (foolishly walking out into the line of fire), and Goodbody is nearly killed in a one-on-one fight with an enemy soldier who is promptly killed by Transom with a bayonet. After the retreat, a light plane spots them and attacks. Goodbody ignores the hail of bullets flying around him to point out how to signal an oncoming plane (having mistaken the attacker for an Allied plane) and goes into a minor tantrum upon discovery that their roller full of water is missing. He spots a group of off-duty Italian soldiers playing soccer nearby (who, it should be pointed out, were on the Allies' side by this point) and immediately spouts racial slurs against them and accuses them of stealing their roller. While this is going on, Transom grabs a submachine gun and shoots down the plane--marking their 'first real victory' (as Goodbody puts it). In the ensuing explosion of the plane's wreckage, the Melancholy Musketeer panics and attempts to flee in one of their trucks. Juniper destroys it, leaving the Musketeer to flee with his pants on fire. The rest of the group carries on towards the oasis (eventually having to go on foot, with the dead versions of Drogue and Dooley carrying the water roller). The men stop near the edge of a cliff, only to find themselves in the middle of a minefield. Spool, going mad with dehydration and heat stress, runs to the roller for a drink and begins to throw a fit after the discovery that Gripweed had let the water out to make the roller easy to move. Goodbody ends up being the last one to find out about the mines (having started doing exercises near the edge of the cliff and discovered that the oasis is nearby). In the ensuing chaos, the film breaks the fourth wall and two ladies (played by the actresses who waved to the Beatles early in the film 'Help!') discuss a similar fit suffered by a son of one of the ladies (\"He's not dead, they didn't get him. Missing. Turn up he will, missing he is...\"). Colonel Grapple arrives moments later (using a jeep he had 'appropriated' from the unit earlier in the film) and gives them some water, and spurs them to carry on and take the oasis. In a lengthy 'death scene' (in which a man in plain clothes delivers a long-winded recount of a joke he gave to his men during the war), the men take the oasis seemingly without a real fight and while rounding up prisoners (the men whistling the theme to \"Bridge on the River Kwai\" all the while), a rifle lands butt-first on the ground, firing off a live round that strikes Spool in the head. While the men are setting up the cricket pitch (the ground is awfully uneven, forcing some of the men to use dynamite to blast open areas), the Melancholy Musketeer turns up having been hiding in an enemy truck at the oasis. Juniper berates him for cowardice, and in his 'rage,' he strikes the Musketeer, as well as Goodbody and Colonel Grapple. He is put on an immediate court martial (with the Musketeer as his appointed attorney) while the other men in the unit attempt to play cricket with the German captives looking on. Eventually, the General who gave them the assignment arrives with another high-ranking officer, who merely points out that the men are 'rotten bowlers.' Juniper hitches a ride with the officers as they leave (we last see him near the end of the film in a straightjacket with his stolen medals pinned on). During the intermissions of these scenes and the ones to come, Goodbody and Odlebog, the German officer, discuss their views on how the war should be fought and Odlebog is appalled to discover that Goodbody is a fascist at heart. The two men seem to have plenty in common (Odlebog seems to be somewhat negligent of his men, as well) in spite of their current circumstances. The flashbacks then take us to the Allied advance towards the Rhine river. Goodbody's men are among those tasked with making a foothold along the river. Goodbody accidentally shoots the Melancholy Musketeer in the foot, cutting his unit short by yet another man. While passing through a village, Gripweed steals a milk bottle while laughing hysterically, accidentally giving their position away to the nearby German forces. The remaining troops hole up in and around a German farmhouse but are forced to retreat as a tank approaches with infantry as support. Clapper is cornered by two enemy soldiers and stabbed with a bayonet (a bit of irony seeing as how Clapper had not taken a demonstration of bayonet use seriously earlier in the film). Gripweed discovers another British soldier holed up in a shelled out barn, looting a corpse. Gripweed derides the man and dismisses him as an amateur thief, but unfortunately is forced to run when German mortars start raining on the barn. As he crosses an open field, a mortar lands right in front of him, perforating him with shrapnel. He solemnly looks at the camera and says \"I knew this would happen. You knew it would happen, didn't you?\" As Goodbody and Transom retreat, a German flamethrower operator nearly corners them. They kill the man and Transom flees as the enemy tank approaches. Goodbody yells for him to come back to their cover, and Transom is mowed down by a tank-mounted machine gun in the confusion (spouting regrets of not having killed the Lieutenant earlier in his last breaths). As we return to the present, Odlebog realizes that in spite of his orders to destroy the bridge, he feels it would be much better if he let Goodbody 'have' it as it would end the war and bring his retirement sooner. In what appears to be a slant against capitalism, the two negotiate a price and Goodbody writes him a check for it. Meanwhile, Grapple leads the push to the bridge in a tank and is the first to cross. He runs over Odlebog in the process, leaving Goodbody with a small piece of the cold, hard reality of war that he had missed all those times before (he then shows relief at not having to deal with a bad check as though he hadn't just lost a friend). He then addresses his 'men' (who are now merely just the replacmenets of the dead soldiers from before) with optimism over the inevitable end of World War II. The film ends with a post-war 'reunion' orchestrated by Goodbody, with the Melancholy Musketeer obviously being the only one who shows up. The Musketeer says there was a good reason for fighting, but Goodbody points out that HE had won the war.",
      "writers": [
         "Patrick Ryan",
         "Charles Wood"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0061789/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM5NjQ0NDk0OV5BMl5BanBnXkFtZTcwODg1NTYyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Michael Crawford, John Lennon, Roy Kinnear | See full cast and crew »"],
      "reviews": [
         "How I Won the War was a critical and commerical faliure upon it's initial release. The film was attacked for mocking the Vietnam conflict and dismissed by Beatle fans looking for another slapstick romp in vein of Lesters previous efforts A Hard Day's Night and Help. While both of those films are excellent in their own right, How I Won the War is far more ambitious and even funnier. Richard Lester had a knack for comic timing and staging slapstick, and it works beautifully in this film. It also bears the usual trademark Lester visuals, with some really surreal set pieces and strange imagery. British veterans Michael Crawford, the late Roy Kinnear, Michael Horden and the late Jack Macgowran give hilarious performances, although it is John Lennon as the glib and sarcastic Gripweed who steals the movie. Lester would go on to make Petulia with Julie Christie, George C. Scott and Richard Chamberlain a year later, his masterpiece and like this film sadly forgotten.",
         "Although (unfairly) ravaged by critics at the time and so generally dismissed ever since, HOW I WON THE WAR is both a brilliant anti-war film and anti war film film (much more so than the usually heralded M*A*S*H). Filled with biting satire and brilliant performances from Michael Crawford, John Lennon, Roy Kinnear, Ronald Lacey, Michael Hordern and, well, the entire cast, HIWTW was perhaps a bit too odd for 1967 audiences who expected perhaps a more madcap adventure, but today it deserves not only a rethink - but a reissue on DVD. (Why this wonderful movie is not available on DVD (at least in the US) is yet another slap in its face.) Richard Lester and writer Charles Wood (who also wrote HELP! for the Beatles) have crafted a brilliant black comedy that easily stands with Dr Strangelove. It won't be everyone's cup of tea, granted, but if you forget your preconceptions and let it wash over you, you will be richly rewarded. RELEASE IT ON DVD!",
         "The first time I watched this film, it was because I was a big Beatles fan and wanted to see John Lennon's performance. I was in my teens and didn't understand much of what went on, but at least I made a valiant effort. The second time I watched this film -- about a decade later -- it was because I was now a big Richard Lester fan and wanted to see if I understood a little more of what was going on; I did. A decade spent honing my sense of irony and a crash course in classic British comedy helped out there. This film is right up there with \"Dr. Strangelove\" as far as black comedies about the insanity of war go. And any film where John Lennon gets to say, \"Can I rub your ball, sir? It gives me great pleasure.\" is okay in my book.",
         "Wow, it is not everyday that one comes across a right-wing essay on the IMDB as one of the posters did in regards t this film. First of all, I am delighted to have finally seen this. Aside from \"The Royal Flash\" and \"Cuba,\" I believe I have seen most of Richard Lester's films which are of significance. I think too look at this film from a mere political pov is a mistake. It is a good statement first of all about how utterly ridicilous the war process is. Sure, there are awful people like Hitler and Mullah Omar, out there who threaten the world at large but by and large, the war process rarely leads to any resounding political solutions and long-term peace and understanding. I think even people who generally support their government's wars would agree to this sentiment. Lester does a brilliant job of poiting this out through the course of this film, and he is helped by some great acting- including a surprisingly brilliant John Lenon to achieve this great satire. Lester, who was actually born in Philadelphia, has a great sense of man's moral faults and he reflects that in this film, as well as in \"Petulia\"- which is considered to be his best film. I think Lester's genius can even be seen in his two most blatant commerical ventures, \"Suprman II\" and \"Butch and Sundance: The Early Years\" as well as the Beatles movies. He deserves more respect, and I think one day he just might get it.",
         "'How I Won the War' has to be one of the most original, bizarre and imaginative war films ever made. I first saw it late one night as an impressionable kid and immediately was drawn by its unusual style and narrative. To have the film tinted in several different colours to show the stages of the war was both daring and cool. One gets the feeling of having witnessed something larger, more intimate and important than just a mere war movie. There are no real heros in this film, certainly Michael Crawford and his troop are pretty cowardly and inept, whereas the Germans are depicted, in the raid on the fuel dump scene, as being content with religious service and a bit of soccer. It is true that history is written by the victors and Michael Crawford's character, Goodbody, is one of only two survivers from his regiment. He proudly states at the very end of the film that he \"won the war\". Maybe he did, but his actions and his balmy enthusiasm show us just how idiotic war can be. My favourite scene was the one with Goodbody and the German officer who befriends Goodbody for much of the film. Together, they talk about how cruel both the British and Germans are, and how the German officer has killed many Jews. Goodbody then talks about how he got his commission and why he is fighting. It ends with the German officer telling Goodbody that he (Goodbody) is a fascist. \"Am I?\", replies Goodbody, \"but I don't particularly dislike Jews.\" When the very affable German officer, who is attempting to surrender, is blindly run over by an advancing British tank, we know that in this war the good, the bad and the ugly become mixed up and inseperable. I currently own a very worn out video of the film and am hoping it will be released soon on DVD here in Australia.",
         "An anti-war film in disguise... As a \"fan\" of war films but also a \"peacenik\" I love this movie. Aside from the fact that i am an overtly biased Beatles' fan this film is an intellectual riot. John Lennon co-stars with the star of Hello Dolly as members of a British military unit saddled with the ridiculous duty of building a cricket pitch during the invasion of North Africa! Filled with ironic black war humor, it suffers a little from the predictable muddle of most 60's films. Something interesting to note is that John Lennon is first seen wearing his trademark round spectacles in this movie. Having been asked (for some reason) to wear the glasses for the film he continued to wear them for the rest of his life! This movie is a must for all Lennon fans.",
         "This challenging film is in a class all of its own. It's as if Samuel Beckett had written a screenplay filling it with low slapstick and very smart commentary. Lester's ultimate point seems to be that war is merely just an extension of class war. Michael Crawford is excellent as the clueless, Bertie Woosteresque squad commander; always trying to piece things together with a seemingly high class education that does him absolutely no good in the thick of war's irrationality. The fast-paced gags come in rapid succession, punctuating each working class soldier's senseless death with great comic absurdity. And yet, armed with his upper class and horribly thoughtless \"sacrifice for King and country\" paradigm, Lt. Goodbody forges ahead on a completely senseless mission inadvertently causing the deaths of all of his men. It's perfect that in the end the only person he can relate to is his German upper-class captor. His ultimate \"winning\" of the war by simply purchasing the only bridge left crossing the Rhein (with a bad check, no less) is the perfect metaphor for the film's main idea; that it's not even money that separates the classes - it's just the collective illusion of the classes that separates them. And it's this illusion for which the working class are forced to fight and die. A fantastic piece of anti-war theatre.",
         "Many people hate this movie because of how absurd and hard to follow it is. Really, IMO, it isn't as hard to follow as many people say. The characters are very well developed. Michael Crawford plays the inept Lt. Goodbody and Beatle John Lennon plays a fascist thief named Gripweed. The story, however absurd it may be, is actually pretty interesting. Goodbody's troop must set up a cricket pitch in the middle of nowhere. I think it's actually a very good movie. I bought it only because it has John Lennon but I love it now for so many more reasons.",
         "Sorry, Fab Listeners, but after almost 50 years of Beatlemania, it's time to get over the juvenile idea that absolutely everything done by, influenced by, or connected to one or more of The Beatles MUST be wonderful. Take John Lennon (whose role, BTW, is actually a minor one) out of this film, and you would remember it even less than the home movies your second cousin took of his daughter's 4th birthday party. In its favor, I will say that some of the battle scenes are rather effective. But aside from that, there is little worth watching here. The script is terrible, and the thick British accents and colloquialisms make half of the lines nearly incomprehensible to American audiences. Over and over, I found myself saying \"Huh? What was that? What did he say?\". The film's continual use of non sequiturs doesn't help matters, and after an hour or so, I was still trying to figure what exactly this movie was getting at. I was left to conclude that it was a rather feeble attempt to address the horrors of war in much the same comic way as M*A*S*H did, with far more brilliance and success, a couple of years later. No dice; this film simply does not cut it.",
         "Simply and absolutely one of the most boring and self-important films ever made. When it came out in 1967, director Richard Lester made no secret of his conviction that he'd produced the greatest antiwar statement since 1930's All Quiet on the Western Front. In reality, it's one of the worst films of any kind since 1930. Here's Lester's antiwar strategy. Take a small number of British soldiers in a wear against Hitler and Nazism and show them to be a bunch of fools, cowards, and lunatics. Show that their mission - to build a cricket-pitch in enemy territory - is absurd. Show John Lennon's idiot minor character bloodily killed. That's it. Doesn't it make you hate war? Doesn't it prove that soldiers are suckers? Doesn't it make you want to protest Vietnam? Well, maybe all Richard Lester really wanted to do was make an amusing service comedy. Maybe his self-promoting comments were just trying to cash in on the antiwar feelings of the day. In that case he still failed. There are more laughs in five minutes of \"Sgt. Bilko\" than in this entire movie. I remember vividly being unable to stay awake watching this turkey in the theater forty years ago. I walked out, even though I'd paid good money. (Only two other movies in my entire life have had such a sleep-inducing effect on me, and \"How I Won the War\" may well be the worst of three.) A few years back somebody gave me the video. With access to coffee I managed to stay awake a just little longer. When I snapped awake I shut the thing off. Way back in 1967 I actually read Patrick Ryan's comic novel that was the basis of this film. It was funny in an aimless kind of way. This movie is unfunny in each and every way."
      ],
      "genres": [
         "Comedy",
         "War"
      ],
      "productionCompanies": ["Petersham Pictures"],
      "summaries": [
         "This film features former Beatle John Lennon and Roy Kinnear as ill-fated enlisted men in under the inept command of Lieutenant Earnest Goodbody. The story unwinds mostly in flashbacks of Lieutenant Goodbody who has lower-class beginnings and education which make him a poor officer who commands one of the worst units of the army.",
         "It's the end of WWII. British Lt. Ernest Goodbody is relating the story of how he won the war to a German officer. His \"victory\" is despite the unfeeling power mongering of one of his superiors, Col. Grapple. As he tells the story of the primary mission he led of his Musketeers, the mission to construct a cricket field behind enemy lines in North Africa, his troop members - some no longer in the living - tell both of their own preoccupations with other things in life preventing them from being the best of soldiers, and of Goodbody's ineptitude. Some lament the fact that they didn't kill Goodbody when they had the chance. The actual telling of the story is due to Goodbody's troop being caught in a precarious situation in the Rhine Valley, from which Goodbody commandeers his way out of successfully. Are Goodbody's actions actually successful?",
         "An inept British WWII commander leads his troops to a series of misadventures in North Africa and Europe."
      ],
      "budget": 0
   },
   "movielensId": 3049,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1967-10-23",
      "dvdReleaseDate": "2001-04-10",
      "directors": ["Richard Lester"],
      "runtime": 109,
      "movieId": 3049,
      "title": "How I Won the War",
      "mpaa": "NR",
      "actors": [
         "Michael Crawford",
         "John Lennon",
         "Roy Kinnear",
         "Lee Montague",
         "Jack MacGowran",
         "Michael Hordern",
         "Jack Hedley",
         "Ronald Lacey",
         "James Cossins",
         "Ewan Hooper",
         "Karl Michael Vogler",
         "Alexander Knox",
         "Robert Hardy",
         "Sheila Hancock"
      ],
      "imdbMovieId": "0061789",
      "originalTitle": "How I Won the War",
      "genres": [
         "Comedy",
         "War"
      ],
      "youtubeTrailerIds": ["logjz5y2Ots"],
      "plotSummary": "An inept British WWII commander leads his troops to a series of misadventures in North Africa and Europe.",
      "tmdbMovieId": 29048,
      "avgRating": 3.09016,
      "releaseYear": "1967",
      "numRatings": 244,
      "posterPath": "/whI4pAKrLeZjOC5qYnO6QJbEi2x.jpg"
   }
}