{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0172726",
      "video": false,
      "title": "Light It Up",
      "recommendations": [
         18828,
         18475,
         26710,
         27360
      ],
      "backdrop_path": "/ztE9RrICRgqT7wUtoWBNm10WqN1.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Lester Dewitt",
               "gender": 0,
               "credit_id": "52fe47b59251416c750a2de3",
               "name": "Usher Raymond",
               "profile_path": "/s0frjwIXTy0AkgqhZEEPzW599TG.jpg",
               "id": 57108,
               "order": 0
            },
            {
               "cast_id": 13,
               "character": "Audrey McDonald",
               "gender": 1,
               "credit_id": "52fe47b59251416c750a2e0b",
               "name": "Vanessa Williams",
               "profile_path": "/25QMiae8zSvSYObHDbYn1mgbOrz.jpg",
               "id": 27011,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Officer Dante Jackson",
               "gender": 2,
               "credit_id": "52fe47b59251416c750a2de7",
               "name": "Forest Whitaker",
               "profile_path": "/4pMQkelS5lK661m9Kz3oIxLYiyS.jpg",
               "id": 2178,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Stephanie Williams",
               "gender": 1,
               "credit_id": "52fe47b59251416c750a2deb",
               "name": "Rosario Dawson",
               "profile_path": "/dEK1rMmSJAPGdc2t1XWdbqBmvEq.jpg",
               "id": 5916,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Zacharias 'Ziggy' Malone",
               "gender": 2,
               "credit_id": "52fe47b59251416c750a2def",
               "name": "Robert Ri'chard",
               "profile_path": "/rB75BONTtezBafFI4TzYzYYO8T3.jpg",
               "id": 52037,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Zacharias 'Ziggy' Malone",
               "gender": 2,
               "credit_id": "52fe47b59251416c750a2df3",
               "name": "Judd Nelson",
               "profile_path": "/9H1TSnBEDYl59tFC1EQHccrINsp.jpg",
               "id": 21624,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Rodney J. Templeton",
               "gender": 2,
               "credit_id": "52fe47b59251416c750a2df7",
               "name": "Fredro Starr",
               "profile_path": "/cyyOSNEgpfkGX2cSSB32EhsenRq.jpg",
               "id": 59568,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Lynn Sabatini",
               "gender": 1,
               "credit_id": "52fe47b59251416c750a2dfb",
               "name": "Sara Gilbert",
               "profile_path": "/pNimJ9cfqe9OeOLFl0k1pXkQ7SY.jpg",
               "id": 3282,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Robert 'Rivers' Tremont",
               "gender": 2,
               "credit_id": "52fe47b59251416c750a2dff",
               "name": "Clifton Collins Jr",
               "profile_path": "/31FbXPcEwKLE1eiQ8ceyQpsnheE.jpg",
               "id": 5365,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Principal Allan Armstrong",
               "gender": 2,
               "credit_id": "52fe47b59251416c750a2e03",
               "name": "Glynn Turman",
               "profile_path": "/yEW4JrFPyTTsoSeDQYwHxBihMuM.jpg",
               "id": 114674,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Capt. Monroe",
               "gender": 2,
               "credit_id": "52fe47b59251416c750a2e07",
               "name": "Vic Polizos",
               "profile_path": "/wDbsIdvxzEwenr0Z0AmstJyR5zl.jpg",
               "id": 149214,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47b59251416c750a2dd9",
               "name": "Craig Bolotin",
               "profile_path": null,
               "id": 34692,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47b59251416c750a2ddf",
               "name": "Craig Bolotin",
               "profile_path": null,
               "id": 34692,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 2.328119,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 19052,
      "vote_count": 8,
      "budget": 0,
      "overview": "On a winter day in a southside Queens high school, events collide and six students are suddenly in an armed standoff with the NYPD. At the school, classrooms freeze, teachers come and go, resources are scant.",
      "similar": [],
      "original_title": "Light It Up",
      "runtime": 99,
      "poster_path": "/sHbII8OHz2uoyOpPAVYe0LIJcdN.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1999-11-04",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Craig Bolotin"],
      "runtime": 99,
      "synopsis": null,
      "writers": ["Craig Bolotin"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0172726/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ3ODc3NTQxNl5BMl5BanBnXkFtZTcwMTc2NjcxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Usher Raymond, Forest Whitaker, Rosario Dawson | See full cast and crew »"],
      "reviews": [
         "Everyone seems to be putting this film down, but I honestly cannot get enough of it. Not only does this film have a strong message behind it, but it also strips away every defense that people can possibly have for inner-city life (some city areas, not all), and shows the unbearably real lives of teenagers today. The characters are real. Usher Raymond (Lester) gives a believable performance of a young adult, simply doing whatever it takes for Ziggy (Robert Ri'chard), a perfectly portrayed teen, escaping from his father and himself through his talents. Forest Whitaker (Officer Dante Jackson) seems to have captured the confusing officer, who was only out for himself at first. Sara Gilbert (Lynn) is without a doubt perfect in her role as an outcast teen who only wants to be wanted, and silently begs for understanding. Stephanie and Rivers (Rosio Dawson and Clifton Collins, Jr.) are well played and well rounded characters. Stephanie, counting the days until graduation and Rivers, who's motto is \"the rules are meant to be broken\". The only character flaw in my opinion was Rodney (Fredro Starr), a painful stereotype. As the movie goes on and the plot becomes more intense, we are slowly exposed to the raw lives of the teens. Ziggy (Ri'chard) is severely abused by his father and has taken refuge in the attic of the school. Lynn (Gilbert) only wanted a kiss from the jerk who got her pregnant. He never kissed her or talked to her after. Lester (Raymond) witnessed police officers shoot his innocent father to death. And Officer Jackson (Whitaker) lost his wife and son. The messages in this movie are clear. Stand up for what you believe in. Give everyone a fighting chance despite their age or race. The darkest people have the darkest secrets. These are messages our country desperately needs to hear, especially now.",
         "\"Light It Up\" is smart, heart pounding and filled with suspense that will keep everyone on the edge of their seat. This is a truly smart thriller drama that takes a look at one of the biggest problems facing America. Everything about \"Light It Up\" worked from the performances from relative newcomers such as Usher Raymond and Robert Ri'chard to veterans like Forest Whitaker and Vanessa L. Williams. One thing I must say about the cast of \"Light It Up\" they took the script and performed with the heart and intent of making this film a success. The best thing about this movie was not the action but the message that it was trying to send the message that everyone deserves to be treated equally and with the same amount of respect. Also, the characters were richly developed with honesty and integrity that seems to be missing from films I have been watching recently. I'm glad I got the opportunity to watch \"Light It Up\" because it taught me not to make judgements based upon first impressions. Whether you like \"Light It Up\" or not it will touch you and move you to action. This truly is a movie that has spirit and deserves to be watched.",
         "This is a really great movie, because sometimes we all just want to take a stand, no matter what we have to do,legal or illegal. It even blends a little bit of comedy with the drama. It is definitely worth watching. ***1/2 out of ***** stars",
         "Well this movie is better than what it seems Yes it seems like a joke but if you watch it car fully you will see the good in it all the teens wanted was to be heard. Yes the characters seemed like they where made up by a bunch of 7th graders but here is the turning point they seem like real life people now i wouldn't go to the level that they went to to be heard but still they did a very good job. Ziggy was my favorite of them all he was the realest you could feel the pain in him the way he acted made you want to cry because he had so much energy that would grab on to you. What i think on this movie is that it was a very powerful movie it shows how life really is its is kind like the movie about the kids that had to write in that note book sorry i forgot the name but still this movie was as interesting.",
         "After a high school teacher (Nelson) is fired on the spot during class, the students of this beat up run down H S take matters into their own hands after one of them (Ziggy) has an altercation with a police officer (Whitaker). Things quickly spiral out of control and the lives and futures of a half dozen students end up in the palm of one young student, Lester (Raymond) as they hold the police officer hostage in the school they have grown to despise. Not bad outing for many of the young actors and although everything plays out like a bad TV movie, the moral of the movie is sent clear and simple. It tends to be a little too melodramatic (very much like AMERICAN HISTORY X with the sappy loud music at the end.) and instead of ending it, it gets worse and worse gradually. But what teen would notice, especially seeing likeable characters such as Lester and Rivers? A good teen movie overall, but anyone older will roll their eyes.",
         "i judge a movie by how i feel when it's over, to be a good movie it has to make me think when it's done. this movie makes you wana go out and do something for the world. ziggy's speech at the end of the movie just makes me wana go out and make a difference. i love this movie, it's going in my top 5",
         "I don't normally go into a movie and get surprised because, usually, I'm pretty good at judging the plot of the movie by the trailors. But, \"Light It Up\" surprised me. I was expecting a home-boy driven, ghetto school, non-stop cursing, lunitical rampage by a bunch of pissed of kids. What I got was a movie filled with smart kids, except for Rodney, looking for a way to get their voices heard, but soon falling into a downward spiral after it all goes wrong. My favorite character of the movie was Ziggy. Robert Ri'chard was great as Ziggy, and I felt that, even though he wasn't as visible, you could feel more connected to him than to the rest. Forest Whitaker was great as Officer Jackson, the real reason behind the school hostage situation. Usher was pretty good as Lester, and I have to say, Lester's destiny in the movie really surprised me. I did not expect the final outcome to end as it did. Fredro Starr played the thug, Rodney. He's normally pretty good at these roles, and this movie was no exception. I really hope anyone that sees this will get past the school violence B.S. and concentrate on the message. The schools are the kid's. They have a right to be heard too. If you see the movie with that type of mentality then you won't come away dissappointed.",
         "I just saw this movie tonight. The incident that leads to the seige of the school was such a small thing that at first I didn't think it was possible for so much to come out of so little. But, after thinking a tad longer I realized that it is so easy for things to be blown out of proportion because of what someone says or an accidental occurrence. I thought the storyline was a good one. The movie was entertaining due to the quite frequent jokes and the tension/affiliation between the characters. Part of the reason, however, that the whole thing seemed a bit implausible was because it wasn't revealed until the situation escalated why the characters did what they did. I guess that happens a lot in movies...but it took too long to happen here and holding it off so long didn't really add suspense, increasing interest or anything like that. It made me confused and a little peeved. On the whole though I liked this movie a lot but it would have made a better TV-movie. I am seriously feeling the soundtrack though...especially Ja-Rule's \"How Many Wanna Die,\" which pulls you in being played during the trailer.",
         "I thought that the film had a lot of strong, positive messages. I thought that the story-line was unique. The acting was phenomenal from everyone in the cast, although my favorite characters were Rivers and Lynn. I thought they were hilarious. Overall, I really enjoyed the movie and I think that most that see this film will enjoy it.",
         "How many schools have lighting that inadequate for students during that time period? When did this movie take place? 1952? Why did Rosario Dawson's character get caught up with those rebels if she is so intelligent. I believe there are principals as rude and disrespectful as principal Armstrong. But where were the assistant principals? Why did a school with over 2500 students have just one security guard? Why didn't Robert Richard's character report being abused by his father to a social worker instead of shooting the security guard? Why was Sarah Gilbert's character caught up with that crowd if she was pregnant? Why did Usher's character take out his anger from his father being killed on the security guard? Why did the fired teacher come back to help? What was the point of Fredro Starr's character? In real life, this hostage situation would have been resolved much sooner and all students that were involved would have been charged as adults."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Edmonds Entertainment Group (EEG)",
         "Fox 2000 Pictures"
      ],
      "summaries": [
         "On a winter day in a southside Queens high school, events collide and six students are suddenly in an armed standoff with the NYPD. At the school, classrooms freeze, teachers come and go, resources are scant. When a popular teacher is suspended, a few students protest. Jackson, a new security guard, gets tough. In a scuffle, Jackson's wounded with his own gun and a student takes him hostage. A few kids join in, for various reasons. An ineffective policewoman tries to mediate as the police plan an assault, the kids demand improvements to the school, the media pick up the story, and Jackson turns sympathetic. But are too many forces in motion for the students to stay in control?",
         "A group of teens is bent on improving the run-down conditions of their high-school."
      ],
      "budget": 13000000
   },
   "movielensId": 3050,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-11-04",
      "dvdReleaseDate": "2000-06-13",
      "directors": ["Craig Bolotin"],
      "runtime": 99,
      "movieId": 3050,
      "title": "Light It Up",
      "mpaa": "",
      "actors": [
         "Usher Raymond",
         "Vanessa Williams",
         "Forest Whitaker",
         "Rosario Dawson",
         "Robert Ri'chard",
         "Judd Nelson",
         "Fredro Starr",
         "Sara Gilbert",
         "Clifton Collins Jr",
         "Glynn Turman",
         "Vic Polizos"
      ],
      "imdbMovieId": "0172726",
      "originalTitle": "Light It Up",
      "genres": [
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "On a winter day in a southside Queens high school, events collide and six students are suddenly in an armed standoff with the NYPD. At the school, classrooms freeze, teachers come and go, resources are scant.",
      "tmdbMovieId": 19052,
      "avgRating": 2.66912,
      "releaseYear": "1999",
      "numRatings": 136,
      "posterPath": "/sHbII8OHz2uoyOpPAVYe0LIJcdN.jpg"
   }
}