{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "dream",
         "id": 1566
      }],
      "imdb_id": "tt0149691",
      "video": false,
      "title": "Anywhere But Here",
      "recommendations": [
         10564,
         35645,
         114931,
         9583,
         50035,
         43079,
         2621,
         17127,
         2610,
         17474,
         41240,
         30500,
         48862,
         75531,
         40562,
         14882,
         23570,
         12257,
         149553,
         38509
      ],
      "backdrop_path": "/8kG1a0dmJRTVwyoVHYdATuP0gOq.jpg",
      "revenue": 18653615,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Adele August",
               "gender": 1,
               "credit_id": "52fe4415c3a368484e00e7e7",
               "name": "Susan Sarandon",
               "profile_path": "/sT6zE3Bpa2HR5lAS44tB6rWDEtP.jpg",
               "id": 4038,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Ann August",
               "gender": 1,
               "credit_id": "52fe4415c3a368484e00e7eb",
               "name": "Natalie Portman",
               "profile_path": "/rtLTG4yrEcROXhTBGXMrbyiUEC5.jpg",
               "id": 524,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Josh Spritzer",
               "gender": 2,
               "credit_id": "52fe4415c3a368484e00e7f5",
               "name": "Hart Bochner",
               "profile_path": "/2gCrMv3yJlFQxloacxjTAcXGEAz.jpg",
               "id": 7678,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Lillian",
               "gender": 1,
               "credit_id": "52fe4415c3a368484e00e7f9",
               "name": "Eileen Ryan",
               "profile_path": "/ypA36mXS3CcyvtKCdBMhI3gn4Vs.jpg",
               "id": 12543,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Ted",
               "gender": 2,
               "credit_id": "52fe4415c3a368484e00e7fd",
               "name": "Ray Baker",
               "profile_path": "/cDmi2buNK0WR5OdqAJDk6OcvC2N.jpg",
               "id": 12889,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Jimmy",
               "gender": 2,
               "credit_id": "52fe4415c3a368484e00e801",
               "name": "John Diehl",
               "profile_path": "/hDUvgqpIv753skoeRGjVw6gYp7A.jpg",
               "id": 4942,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Benny",
               "gender": 2,
               "credit_id": "52fe4415c3a368484e00e805",
               "name": "Shawn Hatosy",
               "profile_path": "/deVcvUyZEybTQuyBYiioVJ4Lyst.jpg",
               "id": 52647,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Carol",
               "gender": 1,
               "credit_id": "52fe4415c3a368484e00e809",
               "name": "Bonnie Bedelia",
               "profile_path": "/10JhoIaKHQGG0DNbQECTI4gHNn9.jpg",
               "id": 7673,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Hisham Badir",
               "gender": 2,
               "credit_id": "52fe4415c3a368484e00e80d",
               "name": "Faran Tahir",
               "profile_path": "/zEcur3BBkXD0gosZQ1nAZRyQZUq.jpg",
               "id": 57452,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Hisham Badir (voice)",
               "gender": 2,
               "credit_id": "52fe4415c3a368484e00e811",
               "name": "Shishir Kurup",
               "profile_path": "/nTlsmxRBLTduIvbCj9l5jvq2gXh.jpg",
               "id": 111454,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Rachel",
               "gender": 1,
               "credit_id": "571d1ab19251415fd0000fe0",
               "name": "Elisabeth Moss",
               "profile_path": "/iSp2t9GYUUgyqTpz25J6hOHH2An.jpg",
               "id": 32798,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Jack Irwin",
               "gender": 2,
               "credit_id": "571d33fbc3a36836f800043f",
               "name": "John Carroll Lynch",
               "profile_path": "/5eEGOANKnCCj7FLa3oV28gGYWkW.jpg",
               "id": 3911,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Gail Letterfine",
               "gender": 1,
               "credit_id": "59010a0f92514155d6001ef0",
               "name": "Caroline Aaron",
               "profile_path": "/9v9h9bR4CX6MrpZFgEktTHFIlgT.jpg",
               "id": 1910,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "George Franklin",
               "gender": 2,
               "credit_id": "5a9b66e70e0a2605f2028e62",
               "name": "Paul Guilfoyle",
               "profile_path": "/vQRNg8D5jeUHGKeFzMuwFaAFnzZ.jpg",
               "id": 925,
               "order": 13
            },
            {
               "cast_id": 20,
               "character": "Mary",
               "gender": 1,
               "credit_id": "5a9b67120e0a2605d502a9aa",
               "name": "Thora Birch",
               "profile_path": "/jxtp9prkQgFmj0ZRvi1kcnnqaWb.jpg",
               "id": 2155,
               "order": 14
            },
            {
               "cast_id": 21,
               "character": "Woman buying car",
               "gender": 1,
               "credit_id": "5a9b67810e0a2605f2028ee1",
               "name": "Megan Mullally",
               "profile_path": "/2KEpCVRVafx9tLho5iMyR9WWt3k.jpg",
               "id": 52119,
               "order": 15
            },
            {
               "cast_id": 22,
               "character": "Homeowner",
               "gender": 0,
               "credit_id": "5a9b67da925141286d028854",
               "name": "Mary Ellen Trainor",
               "profile_path": "/w5QWW4oyQWNX51hMcnaCUTPToYX.jpg",
               "id": 23967,
               "order": 16
            },
            {
               "cast_id": 23,
               "character": "Sarah",
               "gender": 1,
               "credit_id": "5a9b6820c3a3680c08028ab7",
               "name": "Ashley Johnson",
               "profile_path": "/2zIDMXy9680S7ioPo9jpZUq5qG1.jpg",
               "id": 34486,
               "order": 17
            },
            {
               "cast_id": 24,
               "character": "Peter",
               "gender": 2,
               "credit_id": "5a9b68a5c3a3680b7d02b347",
               "name": "Corbin Allred",
               "profile_path": "/1REAXIdyWFaSkrSvX6pLHymgIwI.jpg",
               "id": 63492,
               "order": 18
            },
            {
               "cast_id": 25,
               "character": "Girl on T.V.",
               "gender": 1,
               "credit_id": "5a9b692492514127ea028c2f",
               "name": "Eva Amurri Martino",
               "profile_path": "/aQCpBb5FZ6HLy5PKvqMmvCpsrbS.jpg",
               "id": 56757,
               "order": 19
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4415c3a368484e00e7f1",
               "name": "Wayne Wang",
               "profile_path": "/wtw5Cg8dWy9N7Fvn9SWvboibWek.jpg",
               "id": 39819,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4415c3a368484e00e817",
               "name": "Mona Simpson",
               "profile_path": null,
               "id": 1192747,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4415c3a368484e00e81d",
               "name": "Alvin Sargent",
               "profile_path": "/oTZ7SFxTtnokAe5518kNb3aGczD.jpg",
               "id": 7630,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4415c3a368484e00e823",
               "name": "Roger Deakins",
               "profile_path": "/pSCN7CfILlfQrxX43Kgqrx5mBYQ.jpg",
               "id": 151,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4415c3a368484e00e829",
               "name": "Donald Graham Burt",
               "profile_path": null,
               "id": 20209,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 8.177781,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 21349,
      "vote_count": 85,
      "budget": 23000000,
      "overview": "In this adaptation of the Mona Simpson novel, single mother Adele August is bad with money, and even worse when it comes to making decisions. Her straight-laced daughter, Ann, is a successful high school student with Ivy League aspirations. When Adele decides to pack up and move the two of them from the Midwest to Beverly Hills, Calif., to pursue her dreams of Hollywood success, Ann grows frustrated with her mother's irresponsible and impulsive ways.",
      "similar": [
         1903,
         638,
         4593,
         300,
         392432,
         258230,
         301804,
         81188,
         11360,
         614,
         626,
         1429,
         9377,
         492,
         38,
         68,
         150540,
         281,
         1018,
         242224
      ],
      "original_title": "Anywhere But Here",
      "runtime": 114,
      "poster_path": "/j7XtUGwJizEn6SYppWYiNU3oRMB.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Fox 2000 Pictures",
            "id": 711,
            "origin_country": ""
         },
         {
            "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
            "name": "20th Century Fox",
            "id": 25,
            "origin_country": "US"
         }
      ],
      "release_date": "1999-11-12",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "A story of a mother who knows best... and a daughter who knows better.",
      "adult": false,
      "homepage": "http://www.foxmovies.com/anywherebuthere/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Wayne Wang"],
      "runtime": 114,
      "synopsis": null,
      "writers": [
         "Mona Simpson",
         "Alvin Sargent"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0149691/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE3NDY0OTIwNl5BMl5BanBnXkFtZTcwMTY4MTU1MQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Susan Sarandon, Natalie Portman, Hart Bochner | See full cast and crew »"],
      "reviews": [
         "Anywhere But Here The mother-daughter genre of film is one that is usually laced with caustic wit (POSTCARDS FROM THE EDGE) or draining melodrama (TERMS OF ENDEARMENT). ANYWHERE BUT HERE is the latest entry into this undernourished genre. Falling somewhere in between the two examples above, ANYWHERE is a passable, but strangely distant film. One that for every unsuitable move it makes, it has Natalie Portman and Susan Sarandon to make the wrongs seem so very right. Abruptly leaving her husband and family behind in Wisconsin, Adele August (Sarandon) takes her teenage daughter Ann (Portman) across the country to live the good and free life in Los Angeles. Having freshly minted a tumultuous relationship with this sudden move, the two find themselves in the strange position of having to rely on themselves and each other in the big bad city. Adele is flighty, irresponsible, and refuses to settle into her role as the parent. Ann is lonesome, homesick, and not sure about the love she has within for her mother. Over the years we watch as struggle after struggle continually opposes the family, with each battle reinforcing the love the two share. Told from Ann's perspective, ANYWHERE is essentially a film about trying to understand the people related to us. The bonds we share with our parents, and how those bonds always seem to work against us. Based on a novel by Mona Simpson and a screenplay by crisis legend Alvin Sargent (ORDINARY PEOPLE), ANYWHERE is the kind of tragic-comic filmmaking that I usually crave. Unfortunately, ANYWHERE is far from touching. Directed by Wayne Wang, the film isn't nearly as resonate as Wang's earlier multigenerational epic THE JOY LUCK CLUB. Watching Adele and Ann struggle with their growing relationship is more tiring than emotionally satisfying. The flow of the drama fluctuates so much, by the end you're just glad the filmmakers didn't throw in one last argument for good measure. At 120 minutes, ANYWHERE is about six crisis over the limit. It's the acting in ANYWHERE that takes the film to another level. We all know Susan Sarandon can spin gold with her acting, yet each new film she's been involved with recently (save the September vanity project ILLUMINATA) has shown more and more how commanding an actress she truly is. In ANYWHERE, only Sarandon could give Adele the most annoying characteristics yet ground the performance in love and warmth. Adele really does care for her daughter, she just desperately wants to maintain her own identity for once in her life. Bursting out onto the screen like some kind of Southern California Pokemon, her performance is grand and inviting. But where does that leave Natalie Portman? After shimmying up into films with should-be-legend performances in THE PROFESSIONAL and the locally shot BEAUTIFUL GIRLS, Portman is like no other teenage actress working today. It's a testament to her sensibilities that we haven't seen her in the latest SCREAM variation or this next wave of AMERICAN PIE type comedies. Portman carries ANYWHERE with grace and dignity. Director Wang should be given the Oscar alone for his choice to just linger on Portman's face for extended times. As expressive as her acting can be, Portman can live a million lives in one glance. With Sarandon, the two create a complex and agreeable mother-daughter relationship for their characters. They share overwhelming chemistry and I hope this won't be the last time the two decide to work together. Shot with a sparkling color palette by Roger Deakins, Wang captures both the frail beauty of Los Angeles and it's hard realities. I also give Wang credit for properly using dim-bulb actor Shawn Hatosy(OUTSIDE PROVIDENCE). In a small role as Ann's beloved cousin, Hatosy finally shows some talent and charisma. Unfortunately, the film is scored on autopilot by the self-looting Danny Elfman and features the second most aggressive soundtrack push of the year. The songs rarely fit in with the drama and scream \"Buy me on sale at Sam Goody!\" too blatantly. Just like the characters in the film, it's hard to hate ANYWHERE BUT HERE as much as it is hard to love. Had Wang left open the emotion door a little more the film might have made a lasting impact. Too many scenes do not pay off the way they should and not enough texture is given to the characters. I would recommend ANYWHERE BUT HERE, only for the opportunity to bask in the glow of two actresses on the top of their game. -----7/10",
         "Wayne Wang's direction may be the ingredient which made this film much more impressive to me than \"Slums of Beverly Hills\", which covers remarkably similar ground. The interplay between Susan Sarandon and Natalie Portman is riveting. Real chemistry there. This film succeeded in bringing me inside the dysfunctional life of these two women without dragging me down into depressed frustration. Susan Sarandon's character hammers at all the nerves which a narcissistic parent is capable of touching in an insecure adolescent. She amazingly manages to do this without coming across as floridly insane or intentionally sadistic. And, Natalie Portman deflects each attack on her character's ego with the resigned grace of an intelligent codependent child, untainted by the smug cynicism of the Natasha Lyonne character in \"Slums of Beverly Hills\". Portman's character is an adolescent with dignity under stress, an unusual creature in modern films. The film reaches a very satisfying resolution without trying too hard. I highly recommend this film to the viewer who wants to be challenged and entertained.",
         "\"Anywhere But Here\" is the story of a mother who is a bit flighty and adventurous, and her daughter who is more down to earth and practical. First off, I'd like to say that Natalie Portman gets better and better every movie I see her in. She is an enormous talent, and continues to get better as the years go on. She really held her own and managed to shine brightly, even against a talent as large as Susan Sarandon. Ms. Sarandon is still no slouch either. She portrays Adelle August, a mother who desires more for her daughter than small town life in Wisconsin. She suddenly packs up one day and leaves it all behind, dragging her unwilling daughter (Ann) with her to Beverly Hills. She plays this role with a pure passion, making you believe that she is indeed, in spite of all her flaws and errors in judgement (the electric is repeatedly turned off due to forgotten bills) that she really is trying the best she can for her daughter. Natalie Portman, as I stated earlier, is phenomenal. Her character of Ann is believable, even though we first meet her at 14 (Ms. Portman is 17) She plays the uprooted, resentful, but loving and loyal child to the fullest extent, without ever feeling forced. While there is a good supporting cast, they are overshadowed by the presence of Susan and Natalie, and while they are all good, well crafted characters, the focus is clearly on the two stars. Notice a role put in by Ashley Johnson, as Ann's friend in California. Those of you who remember the show \"Growing Pains\" will remember her as the youngest Seaver child before that show was (mercifully) cancelled. If I have to have one complaint about this movie, it's that it was a bit too long. At 113 minutes, it tends to drag a bit and has a couple scenes that are either overlong or could have been edited out. But those really are few and far between. \"Anywhere But Here\" is a very strong, believable look at mothers and daughters, as well as the complexity of all family relationships. It is a skillful and subtile tearjerker (as evidenced by my friend and an entire theater full of teen girls and adult women crying during two pivital scenes). It avoids the trap of coming off heavy handed. To loosly quote the old saying, you will laugh, you will cry. Often in the same scene. 4 out of 5",
         "This movie wasn't anything extraordinarily special. Although it was something to warm people's hearts. The story starts off with Susan Sarandon (Adele August), the kooky mom, and Natalie Portman (Ann August) getting away from their old life in their old town in Boringsville, USA. When you see the expression on Natalie's face when the camera just goes on her, you know that for the rest of the movie you will not be disappointed at any time with her performance. You can see everything in her eyes. As for Susan, she's amazing as well, with so much experience inside herself, she embodies wisdom, and never forgets to have fun with her character. Anyway, they're driving off to start a new life. That's from when they start the story. It's a story of ups and downs between a smart girl and her... well, mom that is a bit... crazy. Mothers and daughters everywhere should see this movie together. I think the best thing in this picture is the acting, but when you walk out of that theatre after the movie, you will get that Sunday afternoon good feel of cinematic warmness.",
         "(Note: Over 500 of my movie reviews are now available in my book \"Cut to the Chaise Lounge or I Can't Believe I Swallowed the Remote!\" Get it at Amazon.) The mother-daughter bond, especially with an only child, is one of the strongest human bonds there is. Some say it's stronger than husband and wife. It tends to be intense and it almost always develops into a situation where neither side has the clear upper hand because both are vulnerable. And they fight. Tooth and nail. And they love each other intensely. For the mother it is scary because everything is in the daughter and for the daughter, especially when the mother is divorced or single, as is the case here. For the daughter it can be a nightmare because the mother is the adult and has the power and is a total embarrassment. This is especially true when the mother is delusional or dysfunctional as is Adele August (Susan Sarandon). The story from Mona Simpson's novel is familiar in plot and theme although the details here are unique and especially well done. Adele's judgment is more than suspect and she's careless with other people's feelings, and she's shallow and dresses funny. And she isn't completely aware of, nor has she sufficient respect for the needs and wants of her daughter, Ann (Natalie Portman). She, the mother, wants to leave behind the small town, Midwestern existence and embrace Hollywood and all things glamorous. Ann would rather stay in Bay City, Wisconsin with her friends and family. Mom buys a Mercedes and forces Ann to go with her to make a new life in Beverly Hills. I thought Wayne Wang's direction was excellent. He used visual clues to introduce the scenes: shots of an still apartment, shots of part of a person, shots of the beach or the highway, etc., and then a focus on--almost always--Sarandon or Portman. And then at sometime, the camera backs away and we see the larger scene: the desert sand and scrub, the ocean and the sunrise, the other diners at the restaurant, the mourners at the funeral, the crossway over the freeway, and so on. The scene in which Adele is hiding under the covers from heartbreak, and Ann pulls them off, is shot from above because such an angle so beautifully reveals Adele's limbs pulled in close to her body as though in catatonia or in a return to the safety of the womb. Sometimes the sounds precede the shot as when Adele is in Bay City trying desperately to get in touch with the dentist in California who doesn't want her, and we hear her desperation before we see it in her face. I also liked the way the film was cut. As soon as the point of the scene was made, we moved on to another scene, which is again introduced visually with just the right kind of lighting, giving us a moment or two to imagine what transpired in-between. However the real strength of the film is in the brilliant work by Sarandon and Portman. Sarandon is deliberately annoying, flighty, self-delusive, and deeply vulnerable while Portman is powerful, sensitive, and one step ahead of us. Indeed Natalie Portman is one of the most gifted young talents in all of cinema. She absolutely commands the camera, and, as it stays on her face, she reveals to us a full set of emotions and responses, layered like things very deep. If she wants to she can become one of the great stars of the screen. She has the talent. I understand however that she is pursuing a career as a doctor. Whatever she does, one has the sense that she will do it very well. A couple of irreverent questions for director Wayne Wang: How did Ann's audition go? Did her projection of her mother's personality win her the part? And, what is it that the man does in bed only with a woman he feels special about? Inquiring minds want to know (rather than make stupid guesses). Anywhere But Here can be compared with some other dysfunctional mom and wise-beyond-her-years daughter films, for example, Mermaids (1990) with Cher and Winona Ryder, Postcards from the Edge (1990) with Shirley MacLaine and Meryl Streep, Mommie Dearest (1981) with Fay Dunaway and Diana Scarwid, Terms of Endearment (1983) with Shirley MacLaine and Debra Winger, and some others I have forgotten. For the record I would rate these in this order: Terms of Endearment, Postcards from the Edge, Anywhere But Here, Mermaids, Mommie Dearest Here at IMDb they are rated in the same order but with Anywhere But Here at the bottom. Too bad, but that allows me to say that this is very much an underrated film. See it for both Susan Sarandon, who is as good or even better than she ever was--and that is very good indeed--and for Natalie Portman, who is stunning, and as an actress, mature beyond her years.",
         "This film was a new direction for Natalie Portman. A much more adult role, though she comes to it from the traces of a child in the movie itself. Ann,(Portman) and Susan Sarandon, who plays her newly divorced mother, Adele, travel from a small town in the middle of nowhere to Beverly Hills. There these tortured souls try to come to terms with their new life and their new relationship as Portman's character grows up. Unknowingly at first to Adele, she grows up and becomes a better mother for it. Ann sees her mother telling her she wants to be an actress, or so she thinks. Adele uses that crutch every time there are problems in their lives. We see their struggle as mother and daughter come to terms between themselves and with being alone, having left their old lives behind. The acting is top notch from both of them. They seemingly become mother and daughter before your eyes. You can almost feel there is a bond there beyond the actual movie. Though this movie really doesn't take us to any new ground in these types of films, the fact that the acting is well done, and the story isn't too flawed, let's me recommend it. I will say however, it will probably go away soon, I don't believe it can have the staying power needed for a huge Christmas season of movies starting in a week or so. See it now before this happens if you like either of these actresses.",
         "Being a freshman in college, this movie reminded me of my relationship with my mom. Of course, my situation doesn't parrallel with Natalie Portman and Surandon's situation; but my mom and I have grown up with the typical mother and daughter fights. There is always the mother telling you what to do, or not being the kind of mother you want to be. I was balling my eyes at the end of this movie. Surandon's reaction of her daughter going to the East coast, miles away, after all they've been through reminded me of how I felt, being from a small city in the West coast, going to New York. The movie is meant for women who have children that are now all grown up. It is very touching, I was moved by the movie. Every feeling out of the characters in this movie was utterly real, you didn't get any phony sentimentality. I was sitting through the credits at the screening of this movie, alone, wishing my mother was sitting next to me so I could hug her and thank her for everything. This movie is a bit corny of course, but everything is trully momentous. Its all about what a mom can learn from her child; and what a child learns from her mother. 8/10",
         "Natile Portman and Susan Sarandon play off of each other like a symphony in this coming of age story about a young girl, who is sentenced to life as the daughter of one of the nuttest women you will ever encounter. Sarandon has this ability, call it talent if you will, to play some of the most off-beat characters and bring their humanity to forefront of any film she makes. As the mother of this obviously brilliant and muture beyond her years young girl, Sarandon alternates between being the mom and being the child with the ease of a ballet dancer. More importantly she does it with strength and flare without stomping all over Portman's portrayal of the daughter. The question is always asked when we deconstruct the film plot, who changes? This film is certainly about the daughter, but if you look close at the dreams and sacrifices that Mom makes you come to understand that she changes in step with her daughter. I am willing to bet this makes all of us in the audience change also. The hallmark of fine drama",
         "I picked this movie up because I was curious to see Natalie Portman in something that was pre Star Wars. I liked this movie. Natalie and Susan were wonderful as mother and daughter. Susan Sarandon is such an outstanding actor. Better and better with every movie she does.",
         "Susan Sarandon has amply shown that she is capable of turning her hand to most kinds of rôles and is especially adept at teaming up with youngsters. This is no less so in this film with the prodigious Natalie Portman: the two keep the film interesting when almost everything else is a rather blasé prêt-a-porté production, mostly due to Wayne Wang's rather uninspired directing, as well as a music score that has very little to do with the proceedings and did nothing to fill in any stop-gaps. The film is saved precisely by the Sarandon-Portman tandem providing an energetic display of a mother, divorced, skidding along frenetically almost hysterically, and her adolescent daughter trying to keep her young head on her shoulders and pointing in the right direction. The result is an interesting clash of personalities, veering from the dramatic to the humorous in a style which is not far from being a `road-movie'. Indeed, frequently, reminiscences of `Thelma and Louis' come to mind as the film unfurls, though `Anywhere but Here' is several rungs lower down on the ladder. Even so, my vote is slightly higher than the IMDb average. Hopefully we shall be able to enjoy a true drama with these two ladies in the future, but with a more exiguous director \u0096 Stephen Daldry, perhaps?"
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Fox 2000 Pictures",
         "Twentieth Century Fox Film Corporation"
      ],
      "summaries": [
         "Fed up with her small-town Bay City existence, Adele August leaves her family and second husband and heads for Beverley Hills with her daughter. The teenager resents the move and her mother's always flamboyant behaviour and in turns plans to get away to university on the east coast. Mum's plans are different - she wants a movie star for a daughter.",
         "A mother and daughter search for success in Beverly Hills."
      ],
      "budget": 23000000
   },
   "movielensId": 3051,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-11-12",
      "dvdReleaseDate": "2000-05-02",
      "directors": ["Wayne Wang"],
      "runtime": 114,
      "movieId": 3051,
      "title": "Anywhere But Here",
      "mpaa": "PG-13",
      "actors": [
         "Susan Sarandon",
         "Natalie Portman",
         "Hart Bochner",
         "Eileen Ryan",
         "Ray Baker",
         "John Diehl",
         "Shawn Hatosy",
         "Bonnie Bedelia",
         "Faran Tahir",
         "Shishir Kurup",
         "Elisabeth Moss",
         "John Carroll Lynch",
         "Caroline Aaron"
      ],
      "imdbMovieId": "0149691",
      "originalTitle": "Anywhere But Here",
      "genres": [
         "Drama",
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["lv0i_9eoUoI"],
      "plotSummary": "In this adaptation of the Mona Simpson novel, single mother Adele August is bad with money, and even worse when it comes to making decisions. Her straight-laced daughter, Ann, is a successful high school student with Ivy League aspirations. When Adele decides to pack up and move the two of them from the Midwest to Beverly Hills, Calif., to pursue her dreams of Hollywood success, Ann grows frustrated with her mother's irresponsible and impulsive ways.",
      "tmdbMovieId": 21349,
      "avgRating": 3.02744,
      "releaseYear": "1999",
      "numRatings": 1330,
      "posterPath": "/j7XtUGwJizEn6SYppWYiNU3oRMB.jpg"
   }
}