{
   "tmdb": {
      "original_language": "es",
      "keywords": [{
         "name": "hollywood",
         "id": 12396
      }],
      "imdb_id": "tt0118150",
      "video": false,
      "title": "Where's Marlowe?",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Joe Boone",
               "gender": 2,
               "credit_id": "52fe4b489251416c750fdf33",
               "name": "Miguel Ferrer",
               "profile_path": "/fvRncqShcaV8R45IJGYZ7IAvrsO.jpg",
               "id": 15860,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "A.J. Edison",
               "gender": 2,
               "credit_id": "52fe4b489251416c750fdf37",
               "name": "John Livingston",
               "profile_path": "/fL1PDI4pmabN2MQbtJgcFCbiM5d.jpg",
               "id": 77331,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Wilt Crawley",
               "gender": 2,
               "credit_id": "52fe4b489251416c750fdf3b",
               "name": "Yasiin Bey",
               "profile_path": "/x51WKi3gxwobt9Sov5HeS5kKHUe.jpg",
               "id": 4239,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Kevin Murphy",
               "gender": 2,
               "credit_id": "52fe4b489251416c750fdf3f",
               "name": "John Slattery",
               "profile_path": "/53hxIYkC93E1FEkqOvAHRgRIxXX.jpg",
               "id": 21134,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Angela",
               "gender": 0,
               "credit_id": "52fe4b489251416c750fdf43",
               "name": "Allison Dean",
               "profile_path": "/esPk5E8Thfujus2XZ7kyLhVryfa.jpg",
               "id": 167736,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Sonny 'Beep' Collins",
               "gender": 2,
               "credit_id": "52fe4b489251416c750fdf47",
               "name": "Clayton Rohner",
               "profile_path": "/uVLfEz3oE6VF2VG8YpcjjP4wa5M.jpg",
               "id": 91725,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Monica Collins",
               "gender": 1,
               "credit_id": "52fe4b489251416c750fdf4b",
               "name": "Elizabeth Schofield",
               "profile_path": null,
               "id": 942283,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Emma Huffington",
               "gender": 1,
               "credit_id": "52fe4b489251416c750fdf4f",
               "name": "Barbara Howard",
               "profile_path": null,
               "id": 58814,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Film clerk",
               "gender": 2,
               "credit_id": "5a64c217c3a3687f75029d69",
               "name": "John Hawkes",
               "profile_path": "/bz4usMR7NWEgVgWTxVBLEjCo3Dv.jpg",
               "id": 16861,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 2,
               "credit_id": "5a64c25c9251410b2a025afd",
               "name": "Kirk Baltz",
               "profile_path": "/zCuugN0Lgsi5IKRq9OyYl3vh9pU.jpg",
               "id": 3206,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "",
               "gender": 2,
               "credit_id": "5a64c2649251410b2a025b08",
               "name": "Miguel Sandoval",
               "profile_path": "/x0mn76606kpJtzzl0B2nfJlZXkE.jpg",
               "id": 30488,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "",
               "gender": 1,
               "credit_id": "5a64c26b0e0a2619f2026ab2",
               "name": "Lisa Jane Persky",
               "profile_path": "/9H3tSghbilxzikD3Ob59zt15Vp.jpg",
               "id": 9259,
               "order": 11
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4b489251416c750fdf2f",
            "name": "Daniel Pyne",
            "profile_path": null,
            "id": 29378,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 0.100932,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 144953,
      "vote_count": 2,
      "budget": 0,
      "overview": "After making a 3-hour fiasco about New York City's water supply, a two-man film crew decides to take it up a notch by documenting life in the private investigator offices of \"Boone and Murphy\". Cheating husbands and missing dogs fail to bring in the big bucks however, and after sleeping with the wife of one of their clients Murphy leaves. To stop Boone from having to close down the business the two film-makers must resort to a hands-on approach in the investigations to ensure the completion of their movie.",
      "similar": [
         188222,
         10218,
         74643,
         8012,
         599,
         11176,
         294016,
         7446,
         59436,
         856,
         2118,
         509,
         371638,
         313369,
         277547,
         270487,
         17057,
         427900,
         11596,
         1826
      ],
      "original_title": "Where's Marlowe?",
      "runtime": 101,
      "poster_path": "/l4jVox6cJmcD5AbTAjZljyq8ZlS.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1998-01-01",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "A comedy about passion, murder and things that can only happen in the movies.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Daniel Pyne"],
      "runtime": 95,
      "synopsis": null,
      "writers": [
         "John Mankiewicz",
         "Daniel Pyne"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118150/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI1MTYxMTY0MV5BMl5BanBnXkFtZTcwNjQ3MDAyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Miguel Ferrer, John Livingston, Mos Def | See full cast and crew »"],
      "reviews": [
         "This practically undistributed movie deconstructs the deeply hilarious American Private Dude archetype MUCH more sagely/gently/smartly/straightly than the also amusing, if brazenly campy/overcooked/dumbed-down, \"The Big Lebowski\". Commercial media wizards reject complexity, especially comic complexity (anything not BROADLY slapstick/satiric?) BEFORE it can come to market? Apparently. Wonderful stuff. Rent/buy it if you can find it. You might be charmed. You might even wonder WHY our professional masters consider us so uniform? Or plumb stupid? If we want ONLY movies that wash over us sensationally, WAVES of light/sound, we don't need ANY movies that ask for our attention, our thoughtful participation. Of course. If, on the other hand...",
         "To say this is a noir curiosity is to say The Bible has some colorful characters and quaint storytelling. Takes a good half hour to get going, but for those who keep faith, some serious plot twists and rather impressive surprises are in store, including one which takes the basic brilliant twist of CHINATOWN and goes it one better. It's very difficult to discuss this movie without spoiling things, however, so suffice to say there is more going on than meets the eye (frankly too much), and the filmmakers set out a challenging premise and very nearly pull off the impossible resolution. That they finally don't quite do it is almost more of a relief than a surprise, because given the dollar fifty budget and clear guerilla student filmmaking style which permeates this apparent vanity project for Ferrer, it would have been embarrassing had they actually hit a home run for about 1/10,000th of the cost of a typical low budget studio noir. However, this is enough of a near-miss that anyone who is interested in noir (especially the iconic detective stuff personified by Mitchum and Bogart and Powell and Montgomery) would probably benefit from a look. The tone uneasily shifts between mockumentary and b-movie gumshoe melodrama, but occasionally succeeds at both just enough that the excursion is worth it for fans. Those who aren't patient will probably just scratch their head, but I'd guess if you've read this far, you are one of those who would enjoy it. Ferrer makes the most of his ample screentime. The rest of the cast are unknown to me; the black cameraman cum private eye has a few amusing moments, including the mugging of a few rather familiar lines of dialogue. 7.5 / 10",
         "I love this flick. I went to a test screening in L.A. a year or two (?) before its release, had the opportunity to make comments about the film, etc. Was looking forward to it coming out... and then never heard of it again until it came out two years or whatever later on. I must have been the only person in the screening who liked it. Took the wife to it when it came out in theaters, and it still made an impression on me the second time. Sure, it's a bit uneven and takes a while to figure out where it's going, but it's a fun movie with some neat twists and more originality than many other films out there these days.",
         "As Hollywood continues to dumb down in its relentless pursuit of the lowest common denominator, a film as funny and smart as \"Where's Marlowe\" is just too good to be true. I was lucky enough to catch it at the First Annual Worldfest-Flagstaff film festival, where it was a huge hit. Unfortunately, the film is such a clever 'reveal' that to describe it at all would be to take away from the pleasure of being caught in its web. So all I can suggest is that you do whatever you can to get this film seen. Bug the distributors! Demand it at festivals! You'll be glad you did.",
         "Channel surfing one night, saw Miguel Ferrer, stopped flicking and I'm so glad I did. How do movies like this not make more impact at the box office? Probably because there are no explosions or chase scenes and the audience was forced to think. Ahh, the horrors of having to think. Bullets don't fly around, but boy does the plot ever! I found myself thoroughly entertained throughout and even a bit confused sometimes, but I think that was the idea. Solid performances from everyone, including the script and direction. The camera work was excellent. Miguel Ferrer is a wonderful actor and more surprising than the standard top ten Hollywood throws at us nonstop. Miguel, this piece of work is rock solid. Keep it up.",
         "I rented this movie last night without any idea of what it was, but even though it might have been rated as a one star movie, strangely I enjoyed it. It really flip-flopped around a lot and it was hard to keep track of the characters at times, but it was really pretty funny as a satire of P.I. movies. I got to rent it for a dollar, and it was surely worth that price. Miguel Ferrer was great as always. Even if a movie is so so, his acting is always first class. If you are at the video store, and nothing else looks good, try this one.",
         "I definitely agree with previous comments. The movie is delightful! Although this is not the first or best mockumentary around (i.e. not ground breaking), it is a very funny satire without being overly tongue-in-cheek. It took a while to get here (Vancouver, Canada) and probably won't stick around too long (there are 5 people in the Sun matinee screening I attended). That's really sad...it is 10 times more entertaining than most of the mainstream movies playing in the multiplexes.",
         "It's an \"8\" for what it is, earning an extra point for being too original at the time. It's a mockumentary ala \"Spinal Tap\" and \"Best in Show\" which, frankly, are better, but this stands on its own. Following a second-rate private dick in LA, it jumps the \"fourth wall\", and incorporates the film crew, adding to the fun. One of the best things about it is its layers of droll that I suspect will not unfold until I see it again. Having been weaned on Cristopher Guest's best (Tap, Waiting, Best, et al), and the TV hit \"The Office\", one thing this mockumentary has that it probably shouldn't have had... was a soundtrack. But, it was an ABC pilot order, and without any backup like a borrowed British TV success (The Office), that was unavoidable at the time. The soundtrack's not bad, but it does detract. It's a fun attack on that line that separates Reality and the silly joke called life.",
         "I was near to enter to the realm of Morpheus, when I got this flick on the cable. At first, I don't want to see this movie because in the guide was advertised like a documentary. Wrong! It is a movie who pretends to be a documentary, but who cares! Because once I started seeing this film, I found it thought provoking, interesting, and overall hilarious. There is a `killer' scene near the end that made me laugh so strong that hurts. Nice acting by one of my favorite actor from TV and movies, great job Miguel!",
         "Small nice film indeed with a lot of funny stuff and good meanings to be said. You'd feel sometimes that it was made by some people whom lived all their life in love with (Humphrey Bogart)'s old movies as the sarcastic dusty typical detective of the 1940s and now they saw themselves as a too much of a viewer ! too naive to be (Bogart) in real life, so they brought that sense of lost idealism, wished for heroism, and that desire to be movie makers (or even a movie's lead !) all on screen to answer the tricky question.. Where is Marlowe ?! There are some interesting and amusing points in that indie movie : The deep and uncomplicated scrip, the unique cinematography by video which's done by successful realistic taste being like true events, the idea of the blind seller as all the personalities are blinded in a way but who actually can see that about himself first to admit it and then fix it, the idea of their first documentary about \"Water\"; it's everyone's experiment ! As those 2 well-meaning artists are still so childish and without experience yet !, and also in the purity of that distilled water, in fact they needed all the time to distil something out of their life which was simply empty, and also not to distil something out of other's (detective Joe Boone) without being in his shoes or having his own tribulations ! (Boone) was right when he told them about how lousy and boring their first movie was. Because there is no actual thing was happening, it's tasteless as water ! Yet when they were right in the middle of a hot one; that was moving indeed. So he told them clearly the advise of : \"don't be behind that camera too long or most of the time\". Because afterwards it becomes such a barrier to feel things, to live the fact, and to make your own point of view, your own original copy of the truth ! I also loved the acting which was very simple to a truthful extent with couple of naive blinded kids and one clever unassuming private \"eye\", who discovered after all that they're in want of each others to learn more about life and how to look at it to find what they really want. So, before you show it you must live it first ! And maybe it's some kind of message that aims for any young artist out there, or anyone thinking that they had all the facts from their only conceited perspective. Hence \"Where is Marlowe ?!\" well.. He's not in movies only but he is here and there. He is in our own selves, but who can be wide-open eyes to see him, having that great lively well to bring him out perfectly ! As (Sam Spade), (Philip Marlowe), or any other fantastic idealistic hero is possible, coming first from the factual life and from one hell of a struggling human practice."
      ],
      "genres": [
         "Comedy",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "Sandblast",
         "Weiten"
      ],
      "summaries": ["After making a 3-hour fiasco about New York City's water supply, a two-man film crew decides to take it up a notch by documenting life in the private investigator offices of \"Boone and Murphy\". Cheating husbands and missing dogs fail to bring in the big bucks however, and after sleeping with the wife of one of their clients Murphy leaves. To stop Boone from having to close down the business the two film-makers must resort to a hands-on approach in the investigations to ensure the completion of their movie."],
      "budget": 3500000
   },
   "movielensId": 3057,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-01-01",
      "dvdReleaseDate": "2000-07-18",
      "directors": ["Daniel Pyne"],
      "runtime": 101,
      "movieId": 3057,
      "title": "Where's Marlowe?",
      "mpaa": "",
      "actors": [
         "Miguel Ferrer",
         "John Livingston",
         "Yasiin Bey",
         "John Slattery",
         "Allison Dean",
         "Clayton Rohner",
         "Elizabeth Schofield",
         "Barbara Howard",
         "John Hawkes",
         "Kirk Baltz",
         "Miguel Sandoval",
         "Lisa Jane Persky"
      ],
      "imdbMovieId": "0118150",
      "originalTitle": "Where's Marlowe?",
      "genres": [
         "Comedy",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": ["8ZWx6Ypopwk"],
      "plotSummary": "After making a 3-hour fiasco about New York City's water supply, a two-man film crew decides to take it up a notch by documenting life in the private investigator offices of \"Boone and Murphy\". Cheating husbands and missing dogs fail to bring in the big bucks however, and after sleeping with the wife of one of their clients Murphy leaves. To stop Boone from having to close down the business the two film-makers must resort to a hands-on approach in the investigations to ensure the completion of their movie.",
      "tmdbMovieId": 144953,
      "avgRating": 2.9569,
      "releaseYear": "1998",
      "numRatings": 58,
      "posterPath": "/l4jVox6cJmcD5AbTAjZljyq8ZlS.jpg"
   }
}