{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "manipulation",
            "id": 2887
         },
         {
            "name": "romance",
            "id": 9840
         },
         {
            "name": "family",
            "id": 18035
         },
         {
            "name": "erotic movie",
            "id": 190370
         }
      ],
      "imdb_id": "tt0119908",
      "video": false,
      "title": "Poison Ivy: The New Seduction",
      "recommendations": [
         18220,
         70364,
         61238,
         141127,
         28135,
         52736,
         221121,
         35118,
         403100,
         28147,
         122544,
         49332,
         157771,
         47817,
         61807,
         51363,
         92968,
         68174,
         363805,
         68519
      ],
      "backdrop_path": "/aMp1bua1N9IawxGEFYzOnuh4D4d.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Violet",
               "gender": 1,
               "credit_id": "52fe476b9251416c75098907",
               "name": "Jaime Pressly",
               "profile_path": "/h7DHo00GToC95eh5k1WXb7RhKc7.jpg",
               "id": 56824,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Joy Greer",
               "gender": 1,
               "credit_id": "52fe476b9251416c75098929",
               "name": "Megan Edwards",
               "profile_path": "/aeoc2G4PW2nxU2ObFeJEqOmvXMk.jpg",
               "id": 73733,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Ivan Greer",
               "gender": 2,
               "credit_id": "52fe476b9251416c7509892d",
               "name": "Michael Des Barres",
               "profile_path": "/kKXCivEKwYYVirhyIVsqxTlGi5.jpg",
               "id": 65334,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Michael",
               "gender": 2,
               "credit_id": "52fe476b9251416c75098931",
               "name": "Greg Vaughan",
               "profile_path": "/qhTCuqFmGu34HKwk941UgZvl0f5.jpg",
               "id": 102729,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Mrs. B",
               "gender": 1,
               "credit_id": "52fe476b9251416c75098935",
               "name": "Susan Tyrrell",
               "profile_path": "/2cQnK1bJxp9PldCeA05kohavPs8.jpg",
               "id": 59369,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Violet - Age 8",
               "gender": 0,
               "credit_id": "52fe476b9251416c75098939",
               "name": "Tenaya Erich",
               "profile_path": null,
               "id": 553982,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Joy - Age 9",
               "gender": 0,
               "credit_id": "52fe476b9251416c7509893d",
               "name": "Trishalee Hardy",
               "profile_path": null,
               "id": 553983,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Ivy - Age 9",
               "gender": 0,
               "credit_id": "52fe476b9251416c75098941",
               "name": "Sabrinah Christie",
               "profile_path": null,
               "id": 553984,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Catherine Greer",
               "gender": 1,
               "credit_id": "52fe476b9251416c75098945",
               "name": "Merete Van Kamp",
               "profile_path": "/xUCLPkIRj1vIYQgGrXFoOTRkTM0.jpg",
               "id": 160423,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Alvaro",
               "gender": 0,
               "credit_id": "52fe476b9251416c75098949",
               "name": "Gregory Vignolle",
               "profile_path": null,
               "id": 176978,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Rebecca",
               "gender": 1,
               "credit_id": "52fe476b9251416c7509894d",
               "name": "Athena Massey",
               "profile_path": "/jgQBiApA51pDnUbJAa3gpKsg2dG.jpg",
               "id": 42687,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Jaimie",
               "gender": 1,
               "credit_id": "52fe476b9251416c75098951",
               "name": "Shanna Moakler",
               "profile_path": "/bnwl4snot1JUFsfyxXG8QbroP2J.jpg",
               "id": 175604,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Ethan",
               "gender": 2,
               "credit_id": "52fe476b9251416c75098955",
               "name": "Terence Paul Winter",
               "profile_path": null,
               "id": 553985,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "Sandy, Girl at Party",
               "gender": 1,
               "credit_id": "52fe476b9251416c75098959",
               "name": "Susan Ward",
               "profile_path": "/sqYO5l0yvabe8REyqAsXcU0oRuO.jpg",
               "id": 65239,
               "order": 13
            },
            {
               "cast_id": 20,
               "character": "Scott, Boy at Party",
               "gender": 2,
               "credit_id": "52fe476b9251416c7509895d",
               "name": "Michael McLafferty",
               "profile_path": "/cLQJRvVfk3ZWVZNIASQKvKZT9nG.jpg",
               "id": 146837,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe476b9251416c7509890d",
               "name": "Kurt Voss",
               "profile_path": null,
               "id": 21404,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe476b9251416c75098913",
               "name": "Karen Kelly",
               "profile_path": null,
               "id": 553980,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe476b9251416c75098919",
               "name": "Reg Powell",
               "profile_path": null,
               "id": 100544,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe476b9251416c7509891f",
               "name": "Feliks Parnell",
               "profile_path": null,
               "id": 553981,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "52fe476b9251416c75098925",
               "name": "John Rosenberg",
               "profile_path": null,
               "id": 21854,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 4.863694,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 18222,
      "vote_count": 33,
      "budget": 0,
      "overview": "A sinister seductress vows to destroy a suburban family.",
      "similar": [
         86331,
         796,
         812,
         979,
         11224,
         80752,
         28468,
         329865,
         341174,
         277547,
         1643,
         50124,
         226,
         134764,
         9836,
         67308,
         24420,
         27066,
         72207,
         19053
      ],
      "original_title": "Poison Ivy: The New Seduction",
      "runtime": 93,
      "poster_path": "/zoJYW6qDORHWctx6vC4HgyRKBOk.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/iaYpEp3LQmb8AfAtmTvpqd4149c.png",
            "name": "New Line Cinema",
            "id": 12,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "CineTel Pictures",
            "id": 17067,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "MG Entertainment",
            "id": 17068,
            "origin_country": ""
         }
      ],
      "release_date": "1997-05-20",
      "vote_average": 4.2,
      "belongs_to_collection": {
         "backdrop_path": "/hFktEH1hJsf4kzTnYjJB8rMiJpl.jpg",
         "name": "Poison Ivy Collection",
         "id": 48188,
         "poster_path": "/wKFflwLibrLXg7U8hcXnzGyziXz.jpg"
      },
      "tagline": "All the rules are about to be broken.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Kurt Voss"],
      "runtime": 95,
      "synopsis": "In 1987, Ivan and Catherine Greer (Michael Des Barres and Merete Van Kamp) live with their 9-year-old daughter Joy, their housekeeper Rebecca (Athena Massey), and her two daughters, Ivy, age 9, and Violet, age 8. The three young girls live as sisters, but the more rambunctious Ivy is bored by their childish games of tea parties and rejoices at Ivan's unexpected early day return from the office, saying, \"There's going to be fireworks.\" Ivy's prediction soon comes true. Ivan catches Rebecca in bed, having sex with the handsome pool boy, and the two men scuffle. As Ivan tends to his wounds, he and Rebecca begin a loud argument about her adulterous affair and why Rebecca cheated on him. The shouting brings Catherine's attention from the garden. Upon learning of the affair, she immediately evicts Rebecca and her children. Rebecca retaliates that Catherine cannot fulfill Ivan's sexual desires like she could. As Rebecca and her daughters leave the Greer mansion, Joy is heartbroken to lose her only known siblings. Ten years later. Violet (Jaime Pressly as a teenager) returns to the Greer home and is reunited with Joy (Megan Edwards as a teenager) for the first time in ten years. Violet states that she is looking for a summer time residence while working as a waitress at Denny's Restaurants and planning to attend the local Junior College. Joy suggests that she reside with them and stay in the late Catherine's room. Joy tells Violet that her mother died a few years ago from cancer, and Violet relates to that explaining that her own mother, Rebecca, also died from cancer and her sister, Ivy, also is dead which Violet refuses to talk about. Joy is an amateur tennis star and engaged to her Princeton boyfriend, Michael (Greg Vaughan), who will be working as an intern for Mr. Greer's bank. During a late night party, Violet feels isolated and ridiculed by Joy's Ivy League friends, and excuses herself for late shift work. Afterward, Michael takes Joy to her room and initiates foreplay, only to be rejected. He accuses Joy of being sexually frigid, and insultingly says he understands her father's infidelity. As Michael is on his way out, he runs into Violet returning, who is dressed in a black-leather sadomasochistic costume, which causes him to question her employment at Denny's. Violet states that the two have gotten off on the wrong foot, and proceeds to perform oral sex on him. Over the next few days, Violet's obsession with Joy motivates her to destroy all of her other relationships so she can have Joy as her one and only friend. When her tennis partner Jaimie (Shanna Moakler) comes over to practice with Joy, Violet spikes their drinks with alcohol causing both Joy and Jaimie to pass out on the tennis court. Violet drags Joy to her bed, and drags Jaimie to her bed where she undresses her, and then undresses herself into her bra and panties and lays in bed with the unconscious and handcuffed Jaimie, convincing her that they have just engaged in a sexual threesome. A horrified, half clothed, and handcuffed Jaimie flees the Greer house, thus never to return. Michael is Violet's next target. While by the Greer pool, she convinces him Joy has been unfaithful and seduces him into sex, while she provides him with cocaine to reignite his former addiction. Michael is not appreciative of her vices and vows never to see her again, thereby confirming Violet prejudiced belief that all men are uncaring and deceitful (in which Violet's unstable and nymphomaniac mother, Rebecca, apparently rasied her to belive). Ivan is the next to be seduced as Violet sabotages his date when she swims topless in his pool, and dresses in his late wife's clothing. The two wish to rekindle the passion that existed during Ivan's affair with Rebecca. The Greers' housekeeper, Mrs. B (Susan Tyrrell) (whom always suspected from the very start that Violet is not who she claims to be), quickly catches on to the recent events, and makes enemies with Violet in her attempts to thwart her schemes. One day, Michael confronts Violet while she is \"street walking\". He then reveals to her that he has lost his internship at the bank because of drugs and that he knows of her schemes, including working as a sadomasochistic prostitute, her false employment at Denny's, and her dark family history including the death of Ivy (alluding to the original film). He threatens that she must leave the Greers' before he tells Joy the truth. When Michael arrives at the Greers' later that day, Violet attacks him and murders him with a drug overdose. Later that day, Joy returns from a failed tennis match, distraught at the recent drama of events, only to learn of Michael's death and walk in on her father and Violet in sadomasochism. As a traumatized Joy flees the house, Ivan tells Violet she must leave, to which she accuses him of repeating the abandonment of her mother. She hides the drugs for Ivan's heart condition and places him in the garage fatally poisoning him with carbon monoxide by leaving a car engine running. After a drive, Joy returns that same night, to now discover Mrs. B is also murdered. Violet induces Joy to dress up and play tea like they did when they were children, where they will commit suicide together by drinking poison. Joy violently resists by splashing the poison on Violet's face, and the two wrestle around the room. Violet attempts to stab Joy with a pair of scissors, but Joy is able to knock her back before she strikes. Joy races out of the room to the stairway, where she leans on the banister and cries out for help. Violet regains her senses and goes to resume her attack. Violet is spun around by Joy and begins to lose her balance at the top of the stairs. Joy grasps the end of Violet's pearl necklace to keep her from falling. Still holding on to the pearl necklace, Joy pleads with Violet to reach out and save herself. Instead Violet leans her head back and raises her arms in the air... clearing wanting to fall. In doing so, the necklace shatters and Violet's feet slip, causing her to fall backwards down the stairs. Violet lies motionless at the bottom of the stairs... dead from a broken neck. Joy calmly exits the mansion and walks down the driveway to the street and walks away into the night. The loss of her entire family is clearly saddening to Joy, but it may provide her with the opportunity to begin anew, and leave behind the darkness of her family past.",
      "writers": ["Karen Kelly"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119908/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY4NTMzNjU2OF5BMl5BanBnXkFtZTcwODYyNjYxMQ@@._V1_SY317_CR9,0,214,317_AL_.jpg",
      "actors": ["Stars: Jaime Pressly, Megan Edwards, Michael Des Barres | See full cast and crew »"],
      "reviews": [
         "There may be more beautiful actresses out there, and there are certainly more talented ones, but few can match Jaime Pressly for sheer sex appeal! From the moment she turns up -- the camera panning up her legs in the first of a series of trashy, figure hugging outfits -- you're hooked on everything this avenging blonde bombshell does! (If another actress has ever looked hotter in a clingy white t-shirt with no bra, I must have missed it!) How come the pouting, plastic, silicone enhanced Denise Richards lands big movies like WILD THINGS and James Bond, while Jaime, who can play scheming bitches better, and has a sexual presence that burns up the screen (and a killer bod that's 100% natural!) is still stuck in StV flicks, or crap like NOT ANOTHER TEEN MOVIE?? If Jaime had been set loose in WILD THINGS or CRUEL INTENTIONS she'd have been a superstar overnight! As she goes about wrecking havoc and revenge on the family who wronged her, highlights here include: Jaime's topless swim/backstroke (in glorious slo-mo); handcuffing a drunk chick to her bed post (don't ask!); pouring champaign down her front to get a guys full attention (it works); dressing in dominatrix outfits; and effortlessly seducing a handsome rich kid, who she knows hasn't been getting any from his frigid fiancee (\"Hmmm, I see we have a little unfinished business,\" she announces, before sticking her hand down his pants and purring, \"Stock market's up.........and I see you're a major stock holder.\") Pressly's breathy delivery when in seduction mode, and ultra-blunt abrasiveness the rest of the time is amusingly effective, hitting just the right note. There is barely a moment here when she doesn't totally command the screen. Please someone (Paul Verhoeven, John McNaughton) give this babe some quality trash that people will actually see! It's a crime to see her wasting away in vehicles for the likes of Steven Seagal and Jerry friggin' Springer!",
         "Yes this isn't high art, great writing, or anything else that you would expect from a movie. But nobody ever said it was supposed to be that. If you are looking for fine film or Oscar caliber performance look elsewhere. If your looking for one freakin erotic movie, sit down, your ship has come in. Jaime Pressly is ridiculously goddess-like hot and meant for worship in this standard erotic thriller. This is supposed to be a feel good movie, it gets it's job done and how!!!!!!!!!! I give it an 8 out of 10 based on the fact that it serves it's purpose and does what it's supposed to do. Winning Oscars ain't it. But neither are movies like Death Race 2000 or Enter The Dragon but they still rule!!!!!!!!!!!!!!!",
         "Jaime Pressly a beautful talented actress portrays an awful character for the first time, she plays it good, but i rather her as the good girl. Decent sex scenes, Beautiful surroundings and young talented actors is the ingredients this film needed to survive, the plot stunk and so did the ending. So in closing the only thing stopping this film from a total flop was Jaime Pressly.",
         "The third film in the series of awful Poison Ivy films doesn't add anything new to the established formula. Sexy girl who does bad things moves in with straight-laced family and quickly starts turning things upside down and sleeping with every male in the cast. Everything about this movie is awful......well, make that almost everything. The film is a showcase for the awesome physical \"assets\" of then new-comer Jamie Marie Pressly. Out of the three movies she is easily my favorite. Awesome eyes, perky breasts, sumptuous lips, long lean legs and one of the best butts to ever grace an actress is what she brings to this movie. She can't act, but who cares. As long as she's naked it doesn't matter. A terrible movie that is only worth watching for Ms. Pressly's nude scenes. Rating: the movie: 2 Jamie Pressley: 9.5",
         "Well I watched and reviewed the first two films in this series, so I figured what the hell, I'll just finish the trilogy up. Jaime Pressly stars as Violent, a teenage vixen who feeling betrayed that her mother (who was also this family's maid) was fired for having an affair with the father , a decade or so later decides to move in with the family who 'wronged' her mom and proceeds to use her best asset, her body, to get revenge. Is this film good in a conventional sense? Nope. Artistically? Haha not at all. In fact the only true reason to see this is Jaime Pressley herself, who ups the T7A quotient exponentially. Eye Candy: Athena Massey gets topless once; Jaime Pressly shows hers multiple times and her ass once. My Grade: C Where i saw it: Thriller Max",
         "Wow! Violet's mom (Athena Massey) and the pool boy don't waste any time in getting down to business, and we aren't 10 minutes into the movie when a grown up Violet (Jaime Pressly) is showing us everything she has in the bathtub. This is a good start. Soon she is servicing Joy's (Megan Edwards) fiancée Michael (Greg Vaughan), and getting daddy (Michael Des Barres) all excited swimming topless. It is so fun to see what Violet's devious mind will come up with next. I enjoyed seeing Susan Tyrrell (Buddy Boy) again. This is definitely Jaime Pressly's most skintastic performance and one you will never see again now that she has hit the big time.",
         "This installment of \"Poison Ivy\" is far more seductive and sexual hardcore than the one with Drew Barrymore. Violet(Jaime Pressly) is the sister of Ivy. Like who needs the diary of Ivy, this hottie is one fast learner. Her body is absolutely smoking! SHE GOT IT ALL! Swimming in the nude, seducing everyone she encounters. Most of all Violet is a heavy sex goddess while Ivy is nothing more than a nymph. Joy Greer(Megan Edwards) lost her mom and the return of Violet would make her happy again. So why isn't everyone happy? Because the maid has high suspicions about Violet's motives. And was she right. Too bad it cost her life. Michael(Greg Vaughn) Joy's fiancé has his instincts as well as the maid, though it's a shame that Violet gave him that lethal overdose. Joy was a fighter at the end, and she really vindicates herself from Violet lethal games. Just like tennis, she scores, only her game was much better if she wasn't so preoccupied by problems. This movie showed a lot more skin than usual, and the plot gets thicker and thicker by the minute. A bigger keeper than the first, and it could pass as porn. If only if Joy could keep her emotions in check, everyone would live. And should have been wary of Violet in the first place of her return. RATING 4 OUT OF 5 STARS.",
         "Poison Ivy: The New Seduction is set in Los Angeles & starts as a powerful banker named named Ivan Greer (Michael Des Barres) arrives home at his palatial mansion, looking for his wife Catherine (Marete Van Kamp) he finds his young & beautiful housekeeper Rebecca (Athena Massey) having passionate sex with the pool guy. Having an affair with Rebecca himself Ivan is not pleased to find out that she is the local bike & every bloke in the neighbourhood has had a ride, Catherine finds out about the affair & throws Rebecca & her young daughters Violet & Ivy out. Jump forward eleven years & Catherine is dead, Ivan is a single man living with his daughter Joy (Megan Edwards) when a grown up Violet (Jaime Pressly) comes calling looking for her childhood best friend Joy. Admitting she has nowhere else to go Violet is invited to stay at the Greer residence by Joy who is happy to see her again after over a decade but Violet has sinister motives for her sudden reappearance & has revenge on her mind... Directed by Kurt Voss this is the third entry in the Poison Ivy series of films that began with the dull & uneventful erotic thriller Poison Ivy (1992) where a young Drew Barrymore played the manipulative Ivy who is implied to be the sister of Violet although never really mentioned in any significant sense, that was followed by the truly terrible Poison Ivy II (1996) which was more of a moralistic bore than a steamy thriller with the central female character portrayed more as the victim than the evil aggressor & then we come to this, Poison Ivy: The New Seduction which the makers didn't even bother to number & is in fact easily the best of the series to this point by far. Having recently watched the first two I am surprised at how closely this follows the original Poison Ivy plot with some vampish young woman preying upon a rich family, manipulating the weak daughter & seducing the rich father while playing on the death of the mother right down to sleeping in her bed & wearing her clothes. In fact this could be mistaken for a remake rather than sequel that rectifies many of the negatives from the original Poison Ivy like giving it's female villain a motive, like giving the script a little bit of humour & pace, like giving Violet some deliciously deviant, sexy & downright evil sequences unlike the tepid & bland original. From some amusing moments like Violet convincing Joy's best friend they just all had a threesome together which makes her run a mile to Joy walking in on her father Ivan & Violet in the middle of a bondage session with her father handcuffed to the bed & Violet dressed in a hot leather dominatrix outfit. There's some pace about this one as the script keeps moving, the character's are decent with Violet in particular much more of a presence than Ivy was in the original. On the negative side the rushed beginning feels like an afterthought, it's hard to believe that Joy would invite Violet to stay in her house & just suddenly pick up being best friends after eleven years & it's never really made clear why Violet wants to ruin Joy's life so much despite her main gripe being with her father Ivan who she has revenge on anyway although it's not entirely clear what happens to him as he is merely seen sat in a car supposedly having been suffocated by exhaust fumes which is hard to believe & never confirmed one way or the other. Quite well filmed the one aspect of Poison Ivy: The new Seduction that stands out as another huge improvement over the original Poison Ivy is the casting of the lovely Jaime Pressly, man she is really sexy & just plain hot looking in this as opposed to Drew Barrymore who didn't fit the part of manipulative teen temptress that well at all. Her Jaime Pressly radiates sexiness, whatever she wears in any scene she is hot, from the leather dominatrix outfit she wears to the elegant red evening dress to her tight jeans & t-shirt girl next door look whatever she's in Pressly looks fantastic & is gorgeous. An added bonus is that there's lots more nudity than the previous two entries, again Pressly is just hot whether she's wearing something or not, her body is just great & is a real asset to the film as she has several nude scenes to show it off. I wouldn't say Poison Ivy: The New Seduction or Jaime Pressly are particularly erotic in a sensual way but they are hot in a sexy slutty top shelf magazine sort of way that is great to look at & admire if you know what I mean. Although the acting is alright it's the super sexy & hot Jaime Pressly who steals every scene she's in, sh seems to be having great fun playing the lying manipulative best friend home wrecker out for revenge & Pressly just look plain gorgeous in every scene she's in. Acting pro Susan Tyrrell has a small role role as a suspicious housekeeper & has some amusing moments facing off with Pressly as they trade insults & derogatory looks. Poison Ivy: The New Seduction is a massive improvement on the previous two forgettable & bland entries even if it follows the original in plot quite closely, it adds a little motivation & a dark humorous edge as well as the lovely Jaime Pressly who is super hot as Violet. I am not sure there are many more floral female names like Ivy, Lily & Violet with the next & so far final entry Poison Ivy: The Secret Society (2008) using the name Daisy, are there anymore?",
         "*SPOILER ALERT* *SPOILER ALERT* The most important thing to know about \"Poison Ivy: The New Seduction\" is that Jaime Pressly does get naked. I bought the unrated version of this movie with that hope in mind. My prayers were answered. Jaime Pressly is a nuclear sex bomb. That voice. That body. That face. Seeing her leap out of a pool naked in slow motion... Sorry, my mind wandered. I'm back now. Suffice to say, she is raging hot in this movie. No man could resist her nakedness. I can't say I blame them. So Jaime moves into her friend's house and wants to take over. Seduction, nakedness, sex and scheming go on. Jaime won't rest until she gets her way and moves in permanently. It was an OK sex thriller. If you like Jaime Pressly, you should definitely check it out. One last thing, I also want to praise her friend Joy, (Megan Edwards). The good girls don't get enough attention. She was hot in her own spunky, straight A student kind of way.",
         "Thank you Cinemax for airing these kind of movies at midnight. \"Poison Ivy 3\" is a steamy sequel that no one can dislike. It offers you the best about the B-movie industry: great sex scenes, an easy plot that many people would like to experience, and the best of all, beautiful (I mean, BEAUTIFUL!) women. The plot is similar to \"Friend of the Family II\" and \"The Hand That Rocks the Craddle\". This time the sexy nanny is the hot Jaime Pressly. The innocent victim is the also hot Megan Edwards. I always try to be objective in my movie reviews but this time I can't. This movie shouldn't be commented for it's plot, score, direction, etc. No. This movie is all about Jaime. People can't ignore the fact that she has a DELICIOUS body to die for. I can't even describe how hot she is. Her face is very sexy but menacing at the same time (which helps a lot for her character). Her performance is great mainly because male viewers fantasize about her. Her sex scenes are great! Could've used more explicitly (even the uncut version) but still deliver. Also, Megan Edwards is extremely sexy! Her beautiful and innocent face makes her more desirable because she has a spectacular hot body. Those legs, those eyes, that hips. MMMMH. I loved every scene where she walked in her mansion wearing that sexy mini skirt. Thank you Megan! What else can I say?! Poison Ivy 3 is entertaining and steamy. One of those movies that you can't say that you love because it wouldn't be moral correctly. I don't care. I love the movie for it's hot women and sex scenes. Deserves a watch."
      ],
      "genres": [
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "New Line Cinema",
         "CineTel Pictures",
         "MG Entertainment"
      ],
      "summaries": [
         "Ivy's sister, Violet, comes to visit the Greer residence in this third installment of the franchise. It does not take long for the family to be turned upside down as Violet uses her body and skills of manipulation to throw the household into a state of panic and deceit.",
         "A sinister seductress vows to destroy a suburban family."
      ],
      "budget": 0
   },
   "movielensId": 3064,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-05-20",
      "dvdReleaseDate": "1999-11-02",
      "directors": ["Kurt Voss"],
      "runtime": 93,
      "movieId": 3064,
      "title": "Poison Ivy: The New Seduction",
      "mpaa": "R",
      "actors": [
         "Jaime Pressly",
         "Megan Edwards",
         "Michael Des Barres",
         "Greg Vaughan",
         "Susan Tyrrell",
         "Tenaya Erich",
         "Trishalee Hardy",
         "Sabrinah Christie",
         "Merete Van Kamp",
         "Gregory Vignolle",
         "Athena Massey",
         "Shanna Moakler",
         "Terence Paul Winter",
         "Susan Ward",
         "Michael McLafferty"
      ],
      "imdbMovieId": "0119908",
      "originalTitle": "Poison Ivy: The New Seduction",
      "genres": [
         "Thriller",
         "Romance"
      ],
      "youtubeTrailerIds": ["4sOzklTLL98"],
      "plotSummary": "A sinister seductress vows to destroy a suburban family.",
      "tmdbMovieId": 18222,
      "avgRating": 2.19959,
      "releaseYear": "1997",
      "numRatings": 491,
      "posterPath": "/zoJYW6qDORHWctx6vC4HgyRKBOk.jpg"
   }
}