{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0114008",
      "video": false,
      "title": "Ten Benny",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 2,
            "character": "Ray Diglovanni",
            "gender": 2,
            "credit_id": "52fe4ab6c3a368484e16305f",
            "name": "Adrien Brody",
            "profile_path": "/zvMslH1C8xmEBpGgDsdzL797Rv.jpg",
            "id": 3490,
            "order": 0
         }],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4ab6c3a368484e16305b",
            "name": "Eric Bross",
            "profile_path": null,
            "id": 60045,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Action",
            "id": 28
         }
      ],
      "popularity": 0.462623,
      "production_countries": [],
      "id": 124853,
      "vote_count": 1,
      "budget": 0,
      "overview": "The story of a young shoe salesman whose overestimation of his own sharpness leads to gambling debts, pissed-off loan sharks, and overall misery.",
      "similar": [],
      "original_title": "Ten Benny",
      "runtime": 108,
      "poster_path": "/8clglzeK8gi2qBU1CwL8loLPL6Y.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1995-04-09",
      "vote_average": 10,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Eric Bross"],
      "runtime": 108,
      "synopsis": "Ray and his good friends grew up in their working class neighbourhood. Ray is a salesman but dreams of something more: he wants his own business, and wants to marry his childhood sweetheart Jo. In order to fulfill his dreams, Ray takes out a loan which is well beyond the re-payments he can make on his meagre income. His friends get dragged into the fall-out when he can't keep up with payments, but will they stand by him or has he pushed them too far this time?",
      "writers": [
         "Eric Bross",
         "Tom Cudworth"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0114008/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzQ1MjY1MTcwN15BMl5BanBnXkFtZTcwMjkzMjM0MQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Adrien Brody, Michael Gallagher, Sybil Temchen | See full cast and crew »"],
      "reviews": [
         "Brilliant acting by Adrien Brody as Ray illuminates this gritty look at lower-income blue collar life. Written & directed by New Jersey native Eric Bross, Ten Benny sheds light on the inner wheels of a man pinwheeling unintentionally into self-destruction. Ray is trapped in his father's failed past, determined to somehow assuage the mistakes his father made. Driven to find love, acceptance, and redemption, Ray ironically falls prey to his father's mistakes. As he stumbles downward to a disillusioned ecstasy, his closest friends begin to question his moral fiber..... Brody portrays Ray with humility and grace, conveying with his expressive facial features all the torment, desolation, vulnerability, childishness, fear, and loneliness that run wildly through Ray's soul. With each unique gesture and nuance, Brody breathes life into Ray's psyche. Complimenting Brody's acting include James E. Moriarty (straight-edged loan shark), Tony Gillan (tough-guy best friend), Frank Vincent (Ray Sr, who tries to raise Ray the best he can), Michael Gallagher (sensitive best friend), and the lesser-known Sybil Temchen, who portrays Joanne, Ray's girlfriend. Temchen empowers Joanne with tenacity and strength, providing a formidable, believable match to Brody's insecure Ray.",
         "This kitchen sink drama directed and co-written by Eric Bross of RESTAURANT fame follows a group of boyhood pals from suburban New Jersey -- chiefly charismatic Adrien Brody as Ray, a young shoe salesman (the original title, TEN BENNY, is shoe store slang for size 10B, supposedly the size one time customer Paul Newman wears) whose overestimation of his own sharpness leads to gambling debts, p***ed-off loan sharks, and overall misery. The film is as realistic as it is glum and predictable. I felt like I was watching a documentary about younger contemporary versions of my gambler/bookie dad and his goombah pals. I knew the film was striking a chord when, despite Brody's cocky charm and good looks therein, I spent much of the film smirking, shaking my head, and muttering, `Dumbass!' every time Ray made another bad judgment call or generally acted like a jerk. Still, despite its better moments, this story is nothing that folks like Martin Scorsese haven't done earlier and more powerfully. NOTHING TO LOSE (not to be confused with the 1997 Tim Robbins/Martin Lawrence flick) is worth a look primarily if you're a Brody fan and/or an aficionado of Italian-American angst, and you happen to stumble across this one on cable. (I find it interesting, though, that writer/director Bross went on to direct ON THE LINE with those two N'Sync guys.)",
         "Would that this film had wider distribution. Those of us who have see it, are indeed fortunate. A Jersey Gem.",
         "This film features a very young Adrien Brody. Though it isn't the most 'polished' film in the world and obviously had a fairly small-budget, that doesn't detract from the plot. Adrien plays a very convincing part as 'Ray', and the other actors are also totally convincing. I picked this DVD up just thinking it would pass on two hours of my life, but I was immediately drawn in to the action. It's not the most fast-paced film in the world, but anyone who likes human stories will enjoy this film. The conflict between Ray and his father reminded me of so many father-son relationships, and it was great to see that portrayed so clearly. I'm sure everyone will relate to part of the story - even if it's just in Ray's hopes and dreams of bettering himself.This film is well worth watching if you get the opportunity.",
         "Having titled this comment as I did, I have to say that I liked this flick even if I've seen it many, many times before. I'm not crazy about it, just happy it didn't stink. First films should be supported to encourage new talent and Adrien Brody turned in a good -- but not brilliant -- performance. This film -- about a bunch of guys growing up in a small town -- has been done much, much better by Fellini and Levinson to name two. Even so, it seems new directors feel the need to plumb this material again and again. As a result, not a lot can really be expected. \"Judy Berlin,\" another indie film, is also in this genre. \"Ten Benny\" or \"Nothing to Lose\" plows already overturned ground but makes a credible case for itself. That's about -- if you can excuse the pun -- the size of it. William www.williamahearn.com",
         "This movie is a must see for the riveting performance of ADRIEN BRODY. Though the writing and directing may be average, keep in mind it was the first film for writer/director, ERIC BROSS. Bross does get better with age and experience. I enjoyed the performances of all the cast, however, I wish the character Mrs. Deturo, played by actress ANNA MANFREDI, would have had a more significant part. Whenever she appeared in a scene she lit up the room - She is talented, has star quality, is interesting, and I would like to see more of her in future films. Mr. Bross would have been wise to utilize Ms. Manfredi in the party scene -developing her character and defining her as Joanne's mother - he neglected to develop a relationship between mother and daughter. (When you are wandering all around looking for your boyfriend, it is a knee jerk reaction to ask your mom if she has seen him when you walk right past her. Joanne never once talks to her mother or acknowledges her as her mother. This made the entire scene lacking in content. Bross has the party scene so cluttered with people that it is distracting from the events taking place, as if the party takes place in Grand Central rather than Mrs. Deturo's (Joanne's mother) home with a gathering of relatives. One should never under-estimate the importance of a \"mother\" in developing a character. You learn early on that Ray, played by Brody, grew up without his mother who left when he was a child. This helps explain why Ray was so messed up. We completely lose all empathy for Joanne, played by Sybil Temchen, during this scene, as she is cold and menacing as she totally ignores her mother, played by Ms. Manfredi, as if the character is just a stranger amongst a bunch of strangers. So to sum it all up - - ADRIEN BRODY IS FANTASTIC and LET'S SEE MORE OF ANNA MANFREDI IN UPCOMING FILMS!!!",
         "\"Ten Benny\" is a slice of life flick about some young working class Italian-American men in New Jersey who are desperately trying to merge life styles with dreams. Brody, who went on to better forums for his talent, is at the center of this less than engaging and somewhat clumsy melding of melodrama and reality from first time director Bross and a small army of producers. An okay C- small screen watch for those with a taste for guy dramas though don't expect much action, sex, nudity or common sense.",
         "This film is another boring, so-called coming-of-age story. If I have seen these characters once, I have see them 100 times. This film and those like it have little relevance or appeal to anyone who recognizes ethnic stereotypes and unoriginal writing. Sybil Temchen is the only bright spot. Sadly, she'll probably end up in the same club as Adrienne Shelly (good actress performs well in indies, goes on to perform well in a few bad mainstream films and then disappears into films no one who is asleep at 3 a.m. ever sees). Maybe Temchen will get lucky with a good cable-TV series (that's what rescued Edie Falco from Shelly's fate). Cross your fingers (and your toes) for her.",
         "This was the first movie that I saw Adrien Brody with a major role. He gave an excellent performance. The movie is above average but Adrien stands out above everyone else and makes the movie better than it should be. Very few actors have made such an impression with me. Robert DeNiro, Betty Davis and Montgomery Clift are the others. The thing that impressed me most about Brody was that he was so damn convincing as someone with a serious gambling problem. His interrelationship with his girlfriend and drinking buddies was fascinating to watch. This movie is in a class with \"Diner\" and \"Mean Streets\"",
         "This movie is a must see for the riveting performance of ADRIEN BRODY. Though the writing and directing may be average, keep in mind it was the first film for writer/director, ERIC BROSS. Bross does get better with age and experience. I enjoyed the performances of all the cast, however, I wish the character Mrs. Deturo, played by actress ANNA MANFREDI, would have had a more significant part. Whenever she appeared in a scene she lit up the room - She is talented, has star quality, is interesting, and I would like to see more of her in future films. So to sum it all up - - ADRIEN BRODY IS FANTASTIC and LET'S SEE MORE OF ANNA MANFREDI IN UPCOMING FILMS!!! Mr. Bross would have been wise to utilize Ms. Manfredi in the party scene -developing her character and defining her as Joanne's mother - he neglected to develop a relationship between mother and daughter. (When you are wandering all around looking for your boyfriend, it is a knee jerk reaction to ask your mom if she has seen him when you walk right past her. Joanne never once talks to her mother or acknowledges her as her mother. This made the entire scene lacking in content. Bross has the party scene so cluttered with people that it is distracting from the events taking place, as if the party takes place in Grand Central rather than Mrs. Deturo's (Joanne's mother) home with a gathering of relatives. One should never under-estimate the importance of a \"mother\" in developing a character. You learn early on that Ray, played by Brody, grew up without his mother who left when he was a child. This helps explain why Ray was so messed up. We completely lose all empathy for Joanne, played by Sybil Temchen, during this scene, as she is cold and menacing as she totally ignores her mother, played by Ms. Manfredi, as if the character is just a stranger amongst a bunch of strangers."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "BMG Independents",
         "Nothing To Lose Productions",
         "Palisades Pictures"
      ],
      "summaries": [],
      "budget": 200000
   },
   "movielensId": 3065,
   "movielens": {
      "languages": [""],
      "releaseDate": "1995-04-09",
      "dvdReleaseDate": "1999-11-02",
      "directors": ["Eric Bross"],
      "runtime": 108,
      "movieId": 3065,
      "title": "Ten Benny",
      "mpaa": "",
      "actors": ["Adrien Brody"],
      "imdbMovieId": "0114008",
      "originalTitle": "Ten Benny",
      "genres": [
         "Drama",
         "Action"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The story of a young shoe salesman whose overestimation of his own sharpness leads to gambling debts, pissed-off loan sharks, and overall misery.",
      "tmdbMovieId": 124853,
      "avgRating": 3.18293,
      "releaseYear": "1995",
      "numRatings": 41,
      "posterPath": "/8clglzeK8gi2qBU1CwL8loLPL6Y.jpg"
   }
}