{
   "tmdb": {
      "original_language": "es",
      "keywords": [
         {
            "name": "madrid",
            "id": 744
         },
         {
            "name": "airport",
            "id": 822
         },
         {
            "name": "terrorist",
            "id": 949
         },
         {
            "name": "suicide attempt",
            "id": 1252
         },
         {
            "name": "pregnancy",
            "id": 13149
         },
         {
            "name": "relationship",
            "id": 14534
         },
         {
            "name": "ex-wife",
            "id": 155816
         },
         {
            "name": "spectacle",
            "id": 184989
         },
         {
            "name": "sleeping pill",
            "id": 188342
         }
      ],
      "imdb_id": "tt0095675",
      "video": false,
      "title": "Women on the Verge of a Nervous Breakdown",
      "recommendations": [
         8223,
         2469,
         267,
         99,
         8088,
         8222,
         64,
         4307,
         8047,
         8221,
         219,
         8219,
         4043,
         140,
         4499,
         102492,
         4507,
         11382,
         649,
         5143
      ],
      "backdrop_path": "/vPyEOIzbwQWTm5VN9gI1so7iKvB.jpg",
      "revenue": 7179298,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Pepa",
               "gender": 1,
               "credit_id": "52fe43b2c3a36847f8068787",
               "name": "Carmen Maura",
               "profile_path": "/6YU3CAWmlSy13aRUG2QWRZlJab5.jpg",
               "id": 2744,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Carlos",
               "gender": 2,
               "credit_id": "52fe43b2c3a36847f806878b",
               "name": "Antonio Banderas",
               "profile_path": "/85197jARsr06xQ84NhP9YoBL3sR.jpg",
               "id": 3131,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Lucía",
               "gender": 1,
               "credit_id": "52fe43b2c3a36847f806878f",
               "name": "Julieta Serrano",
               "profile_path": "/f7Ouw5eRVaYDm6e4vSqF8XwVqSI.jpg",
               "id": 25257,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Candela",
               "gender": 1,
               "credit_id": "52fe43b2c3a36847f8068793",
               "name": "María Barranco",
               "profile_path": "/h01wRNz8Jmx1sZOg6AEIuvMG1pt.jpg",
               "id": 25025,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Marisa",
               "gender": 1,
               "credit_id": "52fe43b2c3a36847f8068797",
               "name": "Rossy de Palma",
               "profile_path": "/3IH9ZBUcFNwBr8IcS1RZhMKTpeg.jpg",
               "id": 25258,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Paulina Morales",
               "gender": 1,
               "credit_id": "52fe43b2c3a36847f806879b",
               "name": "Kiti Mánver",
               "profile_path": "/3xChWWE9LTCspCqWbxZrZmixXRY.jpg",
               "id": 16975,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Taxista",
               "gender": 2,
               "credit_id": "52fe43b2c3a36847f806879f",
               "name": "Guillermo Montesinos",
               "profile_path": "/7iwsYhQ8EWJbwHDU2xaukGLIxJK.jpg",
               "id": 35351,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Secretaria",
               "gender": 1,
               "credit_id": "52fe43b2c3a36847f80687a3",
               "name": "Loles León",
               "profile_path": "/vWIi59UIkvwTsl2uAKjWfWVJJM2.jpg",
               "id": 6536,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Empleado Inmobiliaria",
               "gender": 2,
               "credit_id": "52fe43b2c3a36847f80687a7",
               "name": "Agustín Almodóvar",
               "profile_path": "/4IaZOzYR2gVFpYdmV8rRrNGLT5J.jpg",
               "id": 952,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Ana",
               "gender": 0,
               "credit_id": "52fe43b2c3a36847f80687ab",
               "name": "Ana Leza",
               "profile_path": null,
               "id": 35352,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Iván",
               "gender": 2,
               "credit_id": "52fe43b2c3a36847f80687af",
               "name": "Fernando Guillén",
               "profile_path": "/Aj2Hnc0C7bpJz4McYE0327ZDfls.jpg",
               "id": 3651,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Policía",
               "gender": 2,
               "credit_id": "52fe43b2c3a36847f80687b3",
               "name": "Ángel de Andrés López",
               "profile_path": "/vA58dSAjruKMH64dVSUDCDrkPkP.jpg",
               "id": 35353,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Policía II",
               "gender": 0,
               "credit_id": "52fe43b2c3a36847f80687b7",
               "name": "José Antonio Navarro",
               "profile_path": null,
               "id": 35354,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Germán",
               "gender": 0,
               "credit_id": "52fe43b2c3a36847f80687bb",
               "name": "Juan Lombardero",
               "profile_path": null,
               "id": 35355,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Portera Testiga de Jehová",
               "gender": 1,
               "credit_id": "52fe43b2c3a36847f80687bf",
               "name": "Chus Lampreave",
               "profile_path": "/dwoyRWC5Nyo2UgE7M6AjqJWSAAD.jpg",
               "id": 3482,
               "order": 14
            },
            {
               "cast_id": 18,
               "character": "Madre de Lucía",
               "gender": 0,
               "credit_id": "52fe43b2c3a36847f80687c3",
               "name": "Mary González",
               "profile_path": null,
               "id": 35356,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43b2c3a36847f806877d",
               "name": "Pedro Almodóvar",
               "profile_path": "/9dc8NqjMnOcZ8EiUvaAQiMiT4Tz.jpg",
               "id": 309,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43b2c3a36847f8068783",
               "name": "Pedro Almodóvar",
               "profile_path": "/9dc8NqjMnOcZ8EiUvaAQiMiT4Tz.jpg",
               "id": 309,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43b2c3a36847f80687c9",
               "name": "Pedro Almodóvar",
               "profile_path": "/9dc8NqjMnOcZ8EiUvaAQiMiT4Tz.jpg",
               "id": 309,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43b2c3a36847f80687cf",
               "name": "Agustín Almodóvar",
               "profile_path": "/4IaZOzYR2gVFpYdmV8rRrNGLT5J.jpg",
               "id": 952,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43b2c3a36847f80687d5",
               "name": "Antonio Llorens",
               "profile_path": null,
               "id": 35357,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43b2c3a36847f80687db",
               "name": "Bernardo Bonezzi",
               "profile_path": null,
               "id": 27045,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43b2c3a36847f80687e1",
               "name": "José Luis Alcaine",
               "profile_path": null,
               "id": 4376,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe43b2c3a36847f80687e7",
               "name": "Félix Murcia",
               "profile_path": null,
               "id": 35358,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "52fe43b2c3a36847f80687ed",
               "name": "José María De Cossío",
               "profile_path": null,
               "id": 3824,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 7.586558,
      "production_countries": [{
         "iso_3166_1": "ES",
         "name": "Spain"
      }],
      "id": 4203,
      "vote_count": 200,
      "budget": 700000,
      "overview": "Pepa resolves to kill herself with a batch of sleeping-pill-laced gazpacho after her lover leaves her. Fortunately, she is interrupted by a deliciously chaotic series of events.",
      "similar": [
         169813,
         1364,
         290762,
         49022,
         422,
         842,
         9466,
         2004,
         20067,
         333344,
         258,
         4307,
         292431,
         75190,
         432887,
         4279,
         444951,
         111708,
         73498,
         202612
      ],
      "original_title": "Mujeres al Borde de un Ataque de Nervios",
      "runtime": 88,
      "poster_path": "/lOehCiqghODNrNBpI1JS76zl6Lx.jpg",
      "spoken_languages": [{
         "name": "Español",
         "iso_639_1": "es"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "El Deseo",
         "id": 49,
         "origin_country": ""
      }],
      "release_date": "1988-03-14",
      "vote_average": 7.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Spain",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Pedro Almodóvar"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Pedro Almodóvar",
         "Pedro Almodóvar"
      ],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt0095675/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BOTI3NTU1OTk0MF5BMl5BanBnXkFtZTcwNzg0NDgxMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Carmen Maura, Antonio Banderas, Julieta Serrano | See full cast and crew »"],
      "reviews": [
         "There are some movies that, no matter how good the translation, are just impossible for a particular audience to get. This is why I think most of the American audience wasn't be able to get into WOMEN ON THE VERGE OF A NERVOUS BREAKDOWN. After directing the rather weak and disappointing drama/thriller LAW OF DESIRE, Spanish director Pedro Almodovar returned to screens in his full glory with this wonderful Academy Award-nominated screwball comedy. Pepa (Almodovar regular Carmen Maura) works as an actress for TV commercials and dubbing of foreign films. Her lover Ivan (Fernando Guillen), who shares the same job, decides to leave her one day for unknown reasons, leading Pepa to assume he left with his wife Lucia (Julieta Serrano), who was recently released from the mental hospital. But after a while, Pepa realizes Lucia thinks the exact opposite, and that Ivan left for an unknown third woman. While on her quest to find this third woman, Pepa has to deal with her nervous friend Candela (Maria Barranco) who recently found out her boyfriend is a wanted terrorist and Carlos, (Antonio Banderas) Ivan's son whose annoying fiancé ends up getting accidentally knocked off by a rather lethal gazpacho. Going any further with this film's plot would be unfair since most of the humor is delivered from it's many twists and turns. Almodovar was able to write a script so sharp with so many colorful characters and situations that the entire thing goes down with pure laughter. But is everyone laughing? That brings me to the answer as to why many people didn't find this funny at all. If you don't speak or understand Spanish, (or some other language that comes from Latin) you won't be able to get this film as much as others. There is a reason why so many American comedians are never able to make it overseas: Humor is simply not international. The rumored but thankfully never completed American remake of this would have never worked. The performances for example: To people who understand the language, you can tell when the characters are being ironic, sarcastic, goofy, or serious. I don't think you can do that very well when English is your first language. So the users that have been complaining about \"flat\" performances might be already explained. Almodovar has been accused of being a feminist, and this movie might be the main reason. I don't quite agree with that because WOMEN doesn't really leave strong message. If it does, I know few people who would actually care for it because this movie is hilarious. Every single character in these 90 minutes of absurdity gets well-balanced and get enough amount of time to shine: The MAMBO TAXI driver for example, turns out to be one of the funniest elements. The scenes all by themselves are already OK, but the frequency that they happen make them somehow even funnier. And the first-rate acting gets a big plus in my book. Everyone here is perfect (including a very scary way Almodovar coaches a good performance out of Antonio Banderas) with the true stand-out being Carmen Maura as over-the-top neurotic Pepa. It is a shame this was Maura's last collaboration with Almodovar. But WOMAN's style is also not to be ignored: Most of the movie is set inside Pepa's apartment, which is put to good use. It is an amazing then-futuristic-looking retro set that with it's sitcom-like camp and artificial looking painted backgrounds becomes almost a character itself. Cinematographer Jose Luis Alcaine's camera is always up to interesting moves: There is the tracking shot of Pepa's feet as she walks in circles waiting for her call, or the reflection take from the answering machine. The work with colors is equally stunning, with the main colors being yellow and blue, and Pepa's red dress \"over coloring\" the environments around her for most of the time. You could freeze frame almost every interior shot of WOMEN... and stare at it for a while. I can't really recommend this movie enough, as much as hard it is to review comedies. Reviewing a comedy is a tough call since it depends on weather you found the material funny or not. I have seen this over ten times and I always laugh at certain moments which I don't want to spoil. Let's just say the Jehovah's testimony and the TV commercial are the parts that always get me. I certainly did enjoy WOMEN... more than any other comedy I have ever seen. (5/5)",
         "I have seen several Almodovar films and this is far and away my favorite. The acting is marvelous in the original Spanish, especially Maria Barranco as Candela, and a young Antonio Banderas in his pre-US fame days. However, if you obtain the DVD version of this movie, resist the temptation to use the English-dubbed soundtrack. Sadly, the English version is just not funny. The readings are flat and uninspired, and the translation is not always accurate; too literal in some cases, just missing the point in others. It appears that the English dialog was written more for a close match with the lip movements than for precise translation. Instead, use the Castilian Spanish audio track and savor the beautiful performances. If you don't understand the language, read the English subtitles, which are more appropriately translated, and still enjoy the original.",
         "Funny, outrageous, ridiculous, colorful and fascinating film by Almodovar--his most popular film in America (so far). The story defies description but, basically, it's about three women (an actress, a psychopath and one on the run from the law) who are all affected by one man. THe story starts slow, picks up speed and is barreling out of control by the end. Well-acted, beautiful to look at and never a dull moment. Just see it! You won't be disappointed. Love the cabdriver and his cab!",
         "Wickedly funny movie of actress who gets dumped by her lover, and how she responds. Full of zany characters and richly applied satire, and some great plot twists. Very offbeat and comical, your time will be well rewarded. This is an excellent movie for Americans to get acquainted, if you're not familiar already, with foreign films or directors. Directed by Pedro Almodovar. Highly recommended.",
         "MUJERES AL BORDE DE UN ATAQUE DE NERVIOS is, from its classic opening title sequence in which Lola Beltran belts out her powerhouse ranchera ballad \"Soy infeliz\" to a montage of pictures taken from women's fashion catalogues to its appropriate closing with La Lupe (a gay icon herself in Latin America) singing her diatribe, \"Puro Teatro\", a perfect parenthesis that encapsulates a gay man's wet dream: the assortment of strong femininity, filmed to the beat of a potboiler, seen through the eyes of Douglas Sirk, and the heart and essence of farce taken to its limits. Seeing Almodovar's comedic masterpiece is not enough: it has to be savored like the fine wine it's become as it approaches its twentieth year from when it first exploded into theatres and rocked Spanish cinema to its core. Quite frankly, this is the greatest screwball comedy ever filmed, and for a genre created in the United States, this one trumps even Preston Sturges in sheer craziness that just builds upon momentum until it veers out of control. As a matter of fact, television audiences who follow the satirical \"Desperate Housewives\" should make an effort to see Almodovar's WOMEN ON THE VERGE OF A NERVOUS BREAKDOWN and appreciate the genius run amok during the approximate 90 minutes it takes to tell its frantic story. It's the only real way to appreciate what goes on ABC's hit show. From the moment our heroine, Pepa (Carmen Maura, in a role that has defined her career) awakens from her slumber and frantically runs to the phone to get that hungrily awaited phone call from Ivan (Fernando Guillen) who has abandoned her and faints in the middle of dubbing Joan Crawford as Vienna in JOHNNY GUITAR, as she crosses paths with the scared Candela (Maria Barranco), the lunatic Lucia (Julietta Serrano), anal Marisa (Rossy de Palma), and feminist Paulina (Kiti Manver) during the course of two days, we're in the same league as the five women of \"Housewives.\" They might even serve as parenthetical bookmarks due to the twin nature of women in the throes of despair pushed to the extreme. This is, as a matter of fact, what THE WOMEN would have looked like had it been filmed fifty years later. Less stagy than Cukor's film but no less effective even when it pokes good fun at artifice, camp, and itself, WOMEN ON THE VERGE OF A NERVOUS BREAKDOWN is smart, witty, ferociously funny and oddly touching -- a tough thing to do in comedies. It marked the movie which brought Pedro Almodovar to international fame, such that MATADOR was re-released in order to bring its equally bizarre story to the public who had discovered a wunderkind in the avant-garde director. For years, plans for an American remake floated about and actresses names were on a continuous shuffle. Thankfully, the idea has not come through and audiences can enjoy this very Spanish, very quirky movie in its original form and see why the term \"Almodovarian\" exists in cinema today. This is what started it all, proper.",
         "Truly wonderful and insightful romp which alternates between tragedy and farce seamlessly without ever missing a beat. Excellent performances by the entire cast contribute mightily as does a first-class camp score. This was the first Almodovar film I ever saw, and it made it a requisite for me to see each new one as it comes out. The man is a genius!",
         "This is in my opinion the greatest Almodovar film ever! Its funny and serious, but mainly farscical, but its brilliant. Carmen Maura steals the show as a woman close to the edge, but her performance is fully backed up by all the rest of the cast. Antonio Banderas performance is excellent as a geeky young man, with his girlfriend and mother also shining. It combines all the elements of American comedy of the sixties but brings it back at us with a touch of latin spirit. This film in my opinion is a gem, for anyone who wants to laugh!",
         "\"Women on the Verge of a Nervous Breakdown\" is the first in hopefully what will be a long line of Almodovar films, I just watched it today at a free film screening when I was supposed to be seeing Fellini's 8 1/2 until the tape messed up. This was a very fine substitute. The film contains all the elements of an absurdist play by the likes of Beckett, Stoppard or Ionesco. From its bizarre and essentially alienating dialogue, to its disjointed plot brought somewhat together by the end, it is an absolute delight to see such films around today. All the characters are wonderfully developed and, like in a play, the narrative is light in plot but heavy in characters. It makes you think, not about the story it is telling since the story itself is ludicrous, and not about what is said for the same reason, but just about the way the characters interact with each other and how this can be applied to everyday life. There are also some wonderful performances contained within. Each of the actors and actresses are so gutsy and alive inside this strange para-universe that Almodovar has created. It really is a treat to watch, with the persistently wry and often wildly ironic humour extracted to its full potential by the deadpan mock seriousness plastered across each character's face. It gives us a good laugh, not just at the film itself but at ourselves and the elements of us we can see in it. Plus the mambo cab is a dead-set winner. After seeing this film, I am currently desperate to see another Almodovar. From this one piece I can see he is definitely a director worth celebrating and admiring and I will try to encourage many others to discover him for themselves. ****1/2 / *****",
         "\"Mujeres al borde de un ataque de nervios,\" or \"Women On The Verge Of A Nervous Breakdown\" is one of Pedro Almodovar's funniest films in which a young woman's world is falling apart at the seams. Pepa Marco (Carmen Maura)discovers that her lover Ivan (Fernando Guillen) has left her (Leaving a message on her answering machine). She also finds out that she's pregnant. It seems that things can't possibly get any worse. But of course, she's wrong. Trying to figure out why her lover left her, she contacts his ex-wife Lucia (Julieta Serrano), who is a bit unbalanced herself. She also finds out that Ivan and Lucia had a son name Carlos (Antonio Banderas)who, along with his fiancé Marissa (Rossy de Palma)visit Pepa to sublease her apartment. Then there is her friend Candela (Marisa Barranco), who is on the run when she finds out her lover is a terrorist who is planning to hijack a plane bound for Stockholm, and that she fears that the police will be after her. Soon, Pepa has some serious problems. Lucia is convinced that Ivan is still involved with her, and the police show up at her door. The only thing she can do is offer her guests a nice cup of gazpacho. Trouble is, she had spiked the spicy concoction with sleeping pills (Which had already put Marissa to sleep). To make matters worse, Lucia takes off after Ivan after learning that he is at the airport with his new love, about to take off to Stockholm! Will Pepa get to her former love in time to stop Lucia from killing him? Great entry in Almodovar's filmography and its as spicy as the drugged gazpacho!",
         "What I like most about this movie is the economy of it's writing and directing. There really isn't a wasted moment, nothing extraneous and that is what keeps the pace crackling and makes the movie watchable in every moment. It also has one of the GREAT ensembles ever. Carmen Maura as Pepa keeps herself on that verge for an hour and a half without ever really falling off the edge, it is a beautifully modulated performance. Maria Barranco as Candela is another performance that teeters on the edge of falling off into an emotional rubble but somehow manages to keep it together. Those two are delightful in every moment they are on screen. We can't forget Julieta Serrano as Lucia, the one truly crazy, post-breakdown woman in the story who brings a quality of self-awareness to her role that makes it a bit heartbreaking. She knows she is nuts and can't do a damn thing about it. And then there is VERY strangely attractive Rossy de Palma as Marisa, a virgin who needs nothing so much as she just needs to get laid to mellow her out. These women are all superlative, but Guillermo Montesinos as the Taxi Driver nearly steals the movie out from everyone and gives certainly the best male performance in the film. You have to see him to believe him."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "El Deseo",
         "Laurenfilm"
      ],
      "summaries": ["A woman's lover leaves her, and she tries to contact him to find out why he's left. She confronts his wife and son, who are as clueless as she. Meanwhile her girlfriend is afraid the police are looking for her because of her boyfriend's criminal activities. They talk to a female lawyer, who turns out to be the lover's new lover, and everyone's path keeps crossing each other's in a very complicated and confusing manner."],
      "budget": 700000
   },
   "movielensId": 3067,
   "movielens": {
      "languages": ["Español"],
      "releaseDate": "1988-03-14",
      "dvdReleaseDate": "2001-04-10",
      "directors": ["Pedro Almodóvar"],
      "runtime": 88,
      "movieId": 3067,
      "title": "Women on the Verge of a Nervous Breakdown",
      "mpaa": "",
      "actors": [
         "Carmen Maura",
         "Antonio Banderas",
         "Julieta Serrano",
         "María Barranco",
         "Rossy de Palma",
         "Kiti Mánver",
         "Guillermo Montesinos",
         "Loles León",
         "Agustín Almodóvar",
         "Ana Leza",
         "Fernando Guillén",
         "Ángel de Andrés López",
         "José Antonio Navarro",
         "Juan Lombardero",
         "Chus Lampreave",
         "Mary González"
      ],
      "imdbMovieId": "0095675",
      "originalTitle": "Mujeres al Borde de un Ataque de Nervios",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Pepa resolves to kill herself with a batch of sleeping-pill-laced gazpacho after her lover leaves her. Fortunately, she is interrupted by a deliciously chaotic series of events.",
      "tmdbMovieId": 4203,
      "avgRating": 3.8926,
      "releaseYear": "1988",
      "numRatings": 3110,
      "posterPath": "/lOehCiqghODNrNBpI1JS76zl6Lx.jpg"
   }
}