{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "literary adaptation",
         "id": 186849
      }],
      "imdb_id": "tt0068528",
      "video": false,
      "title": "The Effect of Gamma Rays on Man-in-the-Moon Marigolds",
      "recommendations": [
         44102,
         285697,
         47430,
         46210,
         70090,
         24588,
         67535,
         129339,
         59231,
         101330,
         121461,
         107035,
         110771,
         102514,
         42144,
         117478,
         198835,
         117239,
         67378,
         69040
      ],
      "backdrop_path": "/WoOVR5NrRSJIeKXZHcXx2TzbPF.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Beatrice",
               "gender": 1,
               "credit_id": "52fe4a069251416c910c0bdd",
               "name": "Joanne Woodward",
               "profile_path": "/8a500O203jN1IHFZVAPwVUyAHUZ.jpg",
               "id": 109410,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Ruth",
               "gender": 1,
               "credit_id": "52fe4a069251416c910c0be1",
               "name": "Roberta Wallach",
               "profile_path": null,
               "id": 171271,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Nanny",
               "gender": 1,
               "credit_id": "52fe4a069251416c910c0be5",
               "name": "Judith Lowry",
               "profile_path": "/24dWU0fhmCadhqm8OIYyjeAHBA1.jpg",
               "id": 193808,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Matilda",
               "gender": 1,
               "credit_id": "52fe4a069251416c910c0bf5",
               "name": "Nell Potts",
               "profile_path": null,
               "id": 942574,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Mr. Goodman",
               "gender": 2,
               "credit_id": "53367115c3a3680e69000b0a",
               "name": "David Spielberg",
               "profile_path": "/hCyjIbgqyjpCyUnUJeqbYtShBon.jpg",
               "id": 54127,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Floyd",
               "gender": 0,
               "credit_id": "5336711cc3a3680e8f000b32",
               "name": "Richard Venture",
               "profile_path": "/7tBLMgqrvoT1yC4OFEzGH6gCMVT.jpg",
               "id": 88748,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Mrs. McKay",
               "gender": 1,
               "credit_id": "53367124c3a3680e9f000a23",
               "name": "Carolyn Coates",
               "profile_path": "/ODBhizybK1q9kIzbI3kgYR9AuG.jpg",
               "id": 175066,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Junk Man",
               "gender": 2,
               "credit_id": "5336712cc3a3680e7f000a88",
               "name": "Will Hare",
               "profile_path": "/ucBDiQeJBnrwPvTCYiH194lRru5.jpg",
               "id": 97718,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Caroline",
               "gender": 1,
               "credit_id": "53367139c3a3680e96000a85",
               "name": "Estelle Omens",
               "profile_path": null,
               "id": 14551,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4a069251416c910c0bd9",
               "name": "Paul Newman",
               "profile_path": "/my0Blo9IBy1WZ0QKbuxUzS0QwV5.jpg",
               "id": 3636,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a069251416c910c0beb",
               "name": "Paul Zindel",
               "profile_path": null,
               "id": 1026321,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a069251416c910c0bf1",
               "name": "Alvin Sargent",
               "profile_path": "/oTZ7SFxTtnokAe5518kNb3aGczD.jpg",
               "id": 7630,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5a6d1048c3a368554d010d13",
               "name": "Evan A. Lottman",
               "profile_path": null,
               "id": 57925,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.81373,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 88875,
      "vote_count": 15,
      "budget": 0,
      "overview": "Middle-aged widow Beatrice Hunsdorfer (Joanne Woodward) and her daughters Ruth (Roberta Wallach) and Matilda (Nell Potts) are struggling to survive in a society they barely understand. Beatrice dreams of opening an elegant tea room but does not have the wherewithal to achieve her lofty goal. Epileptic Ruth is a rebellious adolescent, while shy but highly intelligent and idealistic Matilda seeks solace in her pets and school projects, including one designed to show how small amounts of radium affect marigolds.",
      "similar": [
         102651,
         43125,
         147009,
         124391,
         404541,
         219739,
         316339,
         65456,
         334860,
         257648,
         235056,
         66550,
         399180,
         418470,
         261032,
         119831,
         504100,
         327947,
         261971,
         259086
      ],
      "original_title": "The Effect of Gamma Rays on Man-in-the-Moon Marigolds",
      "runtime": 100,
      "poster_path": "/5gqLkK7sm2KhdxNSZv0Oz71Qhml.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Newman-Foreman Company",
            "id": 12443,
            "origin_country": ""
         },
         {
            "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
            "name": "20th Century Fox",
            "id": 25,
            "origin_country": "US"
         }
      ],
      "release_date": "1972-12-20",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Paul Newman"],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "Paul Zindel",
         "Alvin Sargent"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0068528/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzkxMDQ4MTQxMl5BMl5BanBnXkFtZTgwMDY0MTM0MDE@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Joanne Woodward, Nell Potts, Roberta Wallach | See full cast and crew »"],
      "reviews": [
         "Joanne Woodward starred as Beatrice Hunsdorfer (\"Betty the Loon\"), a loud, vulgar, gum-chewing, beer-drinking, unattractive middle-aged woman\u0085 Living in a dilapidated house in a rundown town, abandoned by her husband, unable to face the responsibility of raising her two teenaged daughters' she is disgusted with life\u0085 She covers her despair with sarcasm, outrageous jokes and a tough, insensitive treatment of the girls\u0085 But she's also pathetic, as she checks the classified ads for business opportunities, and dreams of opening dignified teashops, even though her house is filled with garbage and she's a frightful mess\u0085 The film focuses on the way Beatrice's savage, cynical, often self-deprecating humor and her embittered outlook have affected her daughters. Ruth, the older girl, is a typical adolescent boy-chaser and baton-twirler, who, like Beatrice, employs a tough, sarcastic manner to hide her fears and frustration\u0085 Shattered by nightmares and epileptic fits, she sinks hopelessly into defeat\u0085 Matilda is shy, sensitive and introverted\u0085 Although it seems that she should succumb, she overcomes her environment and emerges strongest\u0085 An extremely intelligent science student, Matilda wins a prize for her experiment on mutated flowers that gives the drama its symbolic title; and she becomes a mutant herself\u0097a delicate flower growing out of arid waste\u0085 The play is transformed from a lyrical mood-piece into a naturalistic slice-of-life in the tradition of the fifties television drama Newman admires\u0085 This makes the symbolism somewhat obtrusive, and the emphasis on external squalor\u0097the filthy house, for example\u0097is overdone and superficial\u0085 Newman's attempts to open up the play are largely successful\u0097scenes of Matilda's science teacher explaining the mysteries of the universe, Ruth's accurate imitation of Beatrice in a school skit, and a teenaged mad scientist explaining with sadistic relish how she skinned a cat, are especially memorable\u0085 As in \"Sometimes a Great Notion,\" there's a real feeling for family life, although the emphasis is reversed: here it's a world of women in which men play a marginal role\u0085 Newman expertly handles the shifts from vigorous burlesque to black humor to terror to pathos\u0085 And as before, he uses the camera functionally, bringing it close to his actresses to achieve intimacy and character revelation\u0085 Woodward again displays remarkable range\u0085 As the shrewish, noisy woman, she's at once horrifying and humorous, but her suggestion of underlying vulnerability arouses our compassion\u0085 There's even the familiar inner radiance, indicating a beautiful woman beneath the flamboyance\u0085 As Ruth, Roberta Wallach is a perfect amalgam of the tough, shallow teenager and the pathetic, defenseless baby\u0085 The standout performance is by Nell Potts, the Newmans' thirteen-year-old, who played Rachel as a child, and here plays a Rachel-like character\u0085 As Matilda, she's a model of understatement, with her soft, fragile voice, subtle expressions of nervousness, and luminous blue eyes that, like her father's, seem to be quietly assimilating everything\u0097sometimes disapproving but more often understanding\u0085 The film did reconfirm Newman's stature as a director\u0085 In his three features he has shown an ability to work with a wide range of material, and if he lacks an original style, he does have a feeling for constructing powerful images and scenes\u0085 Above all, he was one of today's finest directors of performers, which has become almost a lost art\u0085",
         "\"This is an adaptation of Paul Zindel's wonderful but tormented play. This play itself is compelling and has a kind of Tennessee Williams flavor; especially \"The Glass Menagerie\" and \"A Streetcar Named Desire\". The adaptation is very successful as the production designer (Gene Callahan) manages to transfer the book's psychologically oppressive ambiance to film; \"shame hangs in the air of this house\" like a cloud of poison gas. Director Paul Newman gets performances from his cast that pull together parallel stories of how a \"strong, strange, and beautiful\" flower can unexpectedly spring from an environmental wasteland. His most difficult task is restraining or masking Joanne Woodward's earthy likability so that we waste little sympathy on her character. But using Woodward as the mother allowed him to get a once-in-a-lifetime performance from their daughter (Nell Potts as Matilda-Tillie in the play). Potts abandoned acting after this movie but her ethereal take on Matilda is right on the money and a big reason why the film works so well. This is really just a story about Matilda's science fair project in which marigold seeds are subjected to varying amounts of gamma ray radiation (the independent variable in her experiment). Those flowers receiving a moderate amount of radiation bloom in amazing and wonderful ways. However, those flowers subjected to additional radiation either have their growth stunted or whither and die. Meanwhile Tillie and her older sister Ruth are living an analogous story with their mother Beatrice in an extremely emotionally abusive household. In the play it is stated that Beatrice is insane but not how or why she became this way. In the movie the viewer soon reaches this same conclusion. Older daughter Ruth (an amazing performance by Eli Wallach's daughter Roberta) maintains a fairly normal lifestyle at school, she is a majorette and popular but is very selfish and demanding of attention. Notably she is also an epileptic, which is subtly significant because it is analogous to receiving an excessive amount of radiation. Tillie is very different (analogous to receiving a moderate amount of radiation), seemingly shy and withdrawn, she is actually very independent and has found an outlet from the family in her science projects. This outlet serves as a protective niche in which she can bloom. A truly great scene is Matilda's acceptance speech at the science fair. She explains the results of her project and really lays out the main theme of the story for the viewer. Watch as she mentions how excessive radiation causes dwarf plants, at that point they cut to a closeup of Ruth in the audience. Both the experiment and the family illustrate that while a reasonable degree of adversity can actually be beneficial, too much of the same adversity will poison life. While this would be a good film if focused solely on Matilda, it is elevated to extraordinary because Newman chooses to also make Ruth a central part of the story. The conventional \"movie-way\" to tell this story would be to make it an inspirational tale of triumphing over adversity; of free-will overcoming destiny. But fortunately Newman elects to show both sides of the story, in Ruth he shows someone who never has a chance, who cannot recognize her destiny or ever hope to overcome it. Then again, what do I know? I'm only a child.",
         "I have only seen this film once, at the Tyneside Cinema, an early arts house independent cinema in the UK. I saw the film in the year of its release. I still treasure memories of Joanne Woodward's performance as the tragi-comic loudmouth of a mother, who is desperate to do things right, but also has little time for the opinions of others. I would dearly love to see it again, but on the few occasions that I have enquired, I have been greeted by bewildered expressions from folk who plainly think that I am having them on when I mention the title. Perhaps this is an apt result, given the way that the star of the film played such an alienated role that fans of the film should now find themselves being looked at in a somewhat dubious way! To those who have not seen it, grab this powerful performance with both hands. It truly is a gem, with a fine range of emotions, and a cast that works fully together. Thank you for giving me the chance to write this.",
         "This film has the same wonderfully subtle direction as \"The Heart Is A Lonely Hunter,\" \"Diary Of A Mad Housewife\" and \"Goodbye Columbus.\" The lost 60s/70s style for dialogue films with immediately profound social messages is probably best exampled in \"EGROMMM\" -- Newman's daughter (Nell Potts) plays the stoic, life-dampened child who refuses to let her drunken slob of a mother destroy her brilliance.. at least for now. We're just slightly distant observers in this style of filmmaking. You won't get under anyone's skin or into anyone's head. But you may have grown up in similar circumstances, god forbid. An excellent film about the subtleties of abuse without coming across preachy in the slightest. Deeply moving.",
         "The old saw \"there are no guarantees in life\" is given a sad example in this film, wherein we find Joanne Woodward, widowed mother of two, slipping through the cracks of her own life with her daughters in tow. Through a bleary haze of booze-soaked self-defeat, she commands change in her life but is unwilling(and/or possibly unable)to grab the reins. Woodward's performance is sterling...unrestrained, though not at all hammy. Her character is initially entirely unlikable, though in the end, she has found a place in the pity-corner of our hearts...she is a fragile and vulnerable soul who has tragically broken into many virulent and dejected pieces. For people who enjoy strong character studies, THE EFFECT OF GAMMA RAYS is a dexterously directed must-see mini-classic. Understand, though, that it is quite emotionally daunting, and may touch a bit too close to home for certain viewers...a stark and brutally honest portraiture of human wreckage and its many damaging effects. Beneath the downcast surface, however, lies a glint of optimism in the form of the younger daughter's quiet perseverance...although she suffers, she has a strong constitution and will likely overcome her emotionally malnourished upbringing. Stellar cinema. 8.5/10",
         "It's tempting to revist a \"favorite\" film from one's teenage years. It's fascinating and more than a little intimidating to see how much of it you do or don't relate to as an adult. This was the defining movie of the \"in\" crowd of which I was a member. We were so full of angst (and ourselves) that we were just insufferable. Having said that, I can now look back and say that although the story did not meet our life's expectations or our predict how our lives would turn out, it was very accurate about how we felt and was able to portray all those awful teenage emotions we were feeling. It's all about perceptions. I would suggest that any parent of a teenager, especially a girl, watch this and then read the novel. As an adult, you might think it melodramatic and extreme, but I promise you, I remember how it felt, and Paul Newman poignantly and heartbreakingly captures every single tear shed by these two sisters and their mother. An under-rated gem and a teenage must-see film.",
         "Paul Newman again surprises (along with \"Rachel, Rachel\") as Joanne Woodward is presented in the unglamorous role of Beatrice Hunsdorfer, a bitter widow living on the fringe in an anonymous Connecticut suburb. Nell Potts and Roberta Wallach in diametrically opposed roles, Ruth, the epileptic popular daughter, and Mathilda, the science-project sensitive daughter who relates to her pet rabbit. While some is a bit overdone it is no stretch to imagine a bored housewife trying to make ends meet; Woodward is sympathetic and annoying at the same time. A brilliant performance. This film was made in 1972 and it would truly amazing to see real character portrayals in film again. Today we have to visit the theater for such affecting performances. Well worth more than one viewing. 9/10.",
         "Number one on my list of favorites. An exceptional drama, based on the metaphor of society's role on human condition and the effect of radiation on life. Joanne Woodward plays an unemployed eccentric divorcee Beatrice Hunsdorfer, who is raising two young daughters. For income, she takes in boarders (in this case, a neglected elderly women). One daughter Ruth, a rebellious adolescence, and an epileptic, is heading into the same footsteps as her mother (a downward spiral into society's misfits). She mocks her mother after she overhears some teachers discussing her mother's past zany antics. Matilda, the younger daughter is an introvert, smart and a loner. She seeks refuge in her school work, mainly her science projects. Matilda for the most part is the only character in the film who has any redeeming social graces. I've looked for this video to purchase, but its out of print. If anyone happens to know when or where I can get one, please email me the details. I have a copy that I recorded many years ago when it played one night on a late movie show, so I have that to fall back on. But I would really like to get this movie on DVD.",
         "This film captures with unflinching accuracy the anguish caused to a family by a parent with a severe alcohol problem. However alcohol abuse is just one symptom displayed by this particular family unit which is struggling to survive economically disastrous times, from a severely disadvantaged position. The daughter's school science project \"The Effect Of Gamma Rays On Man-in-the-Moon Marigolds\" mirrors the ongoing American social experiment of economic rationalism. Joanne Woodward's character Beatrice is not evil, though she does some of the most cruel and demeaning things imaginable to her children. I believe that it's a great credit to both the playwright and director that we are able to develop empathy for her in spite of these actions. Much of what has happened to Beatrice in life has been out of her control, and yet she struggles to support her family and she holds desperately to hope of a highly unlikely avenue of economic escape (an as yet unformulated cheesecake recipe). This is one of the most demanding, highly impacting and yet compulsive films I've seen. It's a window to the interpersonal relationships of good people who are struggling to respond with vigour to a system that delineates winners and losers.",
         "Released by 20th Century Fox in December of 1972, Paul Newman's sensitive screen version of Paul Zindel's Pulitzer-Prize winning play has been unjustly forgotten. A showcase for wife Joanne Woodward who gives a bravura performance as Beatrice aka \"Betty the Loon\". In addition to Woodward, there are excellent performances from 2 second generation actors: Nell Potts and Robert Wallach as her daughters Matilda and Ruth, and Judith Lowry as \"Nanny\" who manages to create a character without uttering a single word. Newman, the 4 actresses, and a well-chosen supporting cast succeed in making the crux of the film funny, touching and believable. This film, and Rachel,Rachel(68)are tributes to director Newman. Marigolds is not available on VHS or DVD. I saw it at the Brooklyn Academy of Music(BAM) as part of a retrospective tribute to Paul Newman the actor and director."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Twentieth Century Fox Film Corporation"],
      "summaries": [
         "From the Pullizer Prize winning play by Paul Zindel, this is the story of Beatrice Hunsdorfer and her daughters, Ruth and Matilda. A middle-aged widowed eccentric, Beatrice is looking for her life in the classified ads while all about her is the rubble of an unkempt house. All she needs is the right opportunity, she says puffing on a cigarette. Poorly equipped to survive the vagaries of modern life, she has nonetheless always managed to muddle through. Ruth, epileptic and making her way through the rebellious phase of adolescence, seems doomed to make the same mistakes as her mother. Quiet Matilda, on the other hand, seeks refuge in her animals and her schoolwork. \"Jesus, don't you hate the world, Matilda?\" Beatrice asks her youngest daughter. The title of the film is also the subject of Matilda's science project at school and serves as a metaphor for the way life affects each of us differently -- how some are able to find opportunity in adversity and thrive and how some succumb when the burden becomes too heavy. This is the story of slowly drowning and grasping desperately for a lifeline only to find that there's none there and you must save yourself. \"No, Mama,\" Matilda says, \"I don't hate the world.\" (Nell Potts, who stars as Matilda, is the stage name of Eleanor Newman -- Joanne Woodward's real-life daughter. She also appeared as the young Rachel in *Rachel, Rachel*.)",
         "Widowed Beatrice Hunsdorfer is miserable in her life, and in turn she has contempt for everyone around her. She blames everyone except herself for her problems, but most specifically her now deceased husband George who left her before he died. People who know her believe she's crazy. She dreams of a better life - mostly by wanting to open a tea room where she would sell what she believes would be her world famous cheesecake - while realistically not being able to achieve that dream as she lounges around her run down and unkempt house smoking, drinking, reading the personal ads in the newspaper, and somewhat taking care of her elderly boarder, which is how she makes ends meet. Her eldest daughter, Ruth Hunsdorfer, knows the reputation her mother has around town. Although she displays some teen-aged bravada, Ruth seems destined to be just like her mother. Beatrice's younger daughter, Matilda 'Tillie' Hunsdorfer, is the quiet, shy but intelligent offspring. Tillie is supported by her teacher, Mr. Goodman, in achieving academic excellence. The dysfunctional family dynamic is placed to the test in the lead up to the school's science fair awards ceremony, where Tillie's project on the effect of gamma rays on man-in-the-moon marigold seeds is one of five shortlisted for the grand prize, the resulting seedlings which seem to mirror the Hunsdorfer family itself."
      ],
      "budget": 0
   },
   "movielensId": 3069,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1972-12-20",
      "dvdReleaseDate": null,
      "directors": ["Paul Newman"],
      "runtime": 100,
      "movieId": 3069,
      "title": "The Effect of Gamma Rays on Man-in-the-Moon Marigolds",
      "mpaa": "PG",
      "actors": [
         "Joanne Woodward",
         "Roberta Wallach",
         "Judith Lowry",
         "Nell Potts",
         "David Spielberg",
         "Richard Venture",
         "Carolyn Coates",
         "Will Hare",
         "Estelle Omens"
      ],
      "imdbMovieId": "0068528",
      "originalTitle": "The Effect of Gamma Rays on Man-in-the-Moon Marigolds",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Middle-aged widow Beatrice Hunsdorfer (Joanne Woodward) and her daughters Ruth (Roberta Wallach) and Matilda (Nell Potts) are struggling to survive in a society they barely understand. Beatrice dreams of opening an elegant tea room but does not have the wherewithal to achieve her lofty goal. Epileptic Ruth is a rebellious adolescent, while shy but highly intelligent and idealistic Matilda seeks solace in her pets and school projects, including one designed to show how small amounts of radium affect marigolds.",
      "tmdbMovieId": 88875,
      "avgRating": 3.65415,
      "releaseYear": "1972",
      "numRatings": 253,
      "posterPath": "/5gqLkK7sm2KhdxNSZv0Oz71Qhml.jpg"
   }
}