{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "paris",
            "id": 90
         },
         {
            "name": "loss of loved one",
            "id": 697
         },
         {
            "name": "composer",
            "id": 1233
         },
         {
            "name": "pain",
            "id": 4424
         },
         {
            "name": "to compose",
            "id": 5257
         }
      ],
      "imdb_id": "tt0108394",
      "video": false,
      "title": "Three Colors: Blue",
      "recommendations": [
         109,
         110,
         1600,
         843,
         614,
         797,
         144,
         3782,
         113,
         2013,
         31056,
         11104,
         147,
         1092,
         1480,
         405,
         11902,
         910,
         10217,
         2000
      ],
      "backdrop_path": "/dIXPijiNZ9JsMaFWD67bFwUtZdo.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "Julie Vignon",
               "gender": 1,
               "credit_id": "52fe4219c3a36847f8003c99",
               "name": "Juliette Binoche",
               "profile_path": "/rkW6eE75Tt1i3J1s2fsIDZBW0kd.jpg",
               "id": 1137,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "Olivier",
               "gender": 0,
               "credit_id": "52fe4219c3a36847f8003c9d",
               "name": "Benoît Régent",
               "profile_path": "/ldEf9BnuCYBdIaH4epXtLeGPT2M.jpg",
               "id": 1138,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Sandrine",
               "gender": 1,
               "credit_id": "52fe4219c3a36847f8003ca1",
               "name": "Florence Pernel",
               "profile_path": "/wfDRJJvOpuCoTzbwsKTtSqiIEfB.jpg",
               "id": 1139,
               "order": 2
            },
            {
               "cast_id": 18,
               "character": "Lucille",
               "gender": 0,
               "credit_id": "52fe4219c3a36847f8003cb1",
               "name": "Charlotte Véry",
               "profile_path": null,
               "id": 1140,
               "order": 3
            },
            {
               "cast_id": 19,
               "character": "La journaliste",
               "gender": 1,
               "credit_id": "52fe4219c3a36847f8003cb5",
               "name": "Hélène Vincent",
               "profile_path": "/rhb3AMUOgv8BcXmzpK16QQOlpFG.jpg",
               "id": 1141,
               "order": 4
            },
            {
               "cast_id": 20,
               "character": "L'agent immobilier",
               "gender": 2,
               "credit_id": "52fe4219c3a36847f8003cb9",
               "name": "Philippe Volter",
               "profile_path": "/v5s5uo82mkTGkgkwfguCjmokLzg.jpg",
               "id": 1142,
               "order": 5
            },
            {
               "cast_id": 21,
               "character": "Le médecin",
               "gender": 0,
               "credit_id": "52fe4219c3a36847f8003cbd",
               "name": "Claude Duneton",
               "profile_path": null,
               "id": 17894,
               "order": 6
            },
            {
               "cast_id": 22,
               "character": "Patrice",
               "gender": 0,
               "credit_id": "52fe4219c3a36847f8003cc1",
               "name": "Hugues Quester",
               "profile_path": null,
               "id": 38170,
               "order": 7
            },
            {
               "cast_id": 23,
               "character": "La mère",
               "gender": 1,
               "credit_id": "52fe4219c3a36847f8003cc5",
               "name": "Emmanuelle Riva",
               "profile_path": "/q4oje5UzP79ZPTwywVtLj0hvEJd.jpg",
               "id": 267962,
               "order": 8
            },
            {
               "cast_id": 24,
               "character": "Dominique",
               "gender": 1,
               "credit_id": "52fe4219c3a36847f8003cc9",
               "name": "Julie Delpy",
               "profile_path": "/rd40f4QpAUUne3hMaUhHrZtcK2c.jpg",
               "id": 1146,
               "order": 9
            },
            {
               "cast_id": 25,
               "character": "Karol Karol",
               "gender": 2,
               "credit_id": "52fe4219c3a36847f8003ccd",
               "name": "Zbigniew Zamachowski",
               "profile_path": "/rfE2QqqCSRU3EY8cDdQBpULu6os.jpg",
               "id": 1145,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4219c3a36847f8003c65",
               "name": "Slawomir Idziak",
               "profile_path": "/vA9WrEK35MyUx6Sb4NtZiouotsg.jpg",
               "id": 1129,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe4219c3a36847f8003c6b",
               "name": "Agnieszka Holland",
               "profile_path": "/t7OOYOMIre88LLiWYepg8XnF9FD.jpg",
               "id": 1128,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe4219c3a36847f8003c71",
               "name": "Slawomir Idziak",
               "profile_path": "/vA9WrEK35MyUx6Sb4NtZiouotsg.jpg",
               "id": 1129,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe4219c3a36847f8003c77",
               "name": "Krzysztof Kieślowski",
               "profile_path": "/aNvobc9gzJWIiHLNHx08tpmb5n1.jpg",
               "id": 1126,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe4219c3a36847f8003c7d",
               "name": "Krzysztof Piesiewicz",
               "profile_path": "/pq57vilI1WSLBwQmizVFo3MmFQq.jpg",
               "id": 1132,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe4219c3a36847f8003c89",
               "name": "Marin Karmitz",
               "profile_path": "/t9KgqeBerwxwnSkvkvlapJ8gcSS.jpg",
               "id": 1134,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4219c3a36847f8003c8f",
               "name": "Zbigniew Preisner",
               "profile_path": "/bBebcS5dznOr7l9lBZqzISgeYYC.jpg",
               "id": 1135,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4219c3a36847f8003c95",
               "name": "Jacques Witta",
               "profile_path": null,
               "id": 1136,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4219c3a36847f8003ca7",
               "name": "Krzysztof Kieślowski",
               "profile_path": "/aNvobc9gzJWIiHLNHx08tpmb5n1.jpg",
               "id": 1126,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4219c3a36847f8003cad",
               "name": "Krzysztof Kieślowski",
               "profile_path": "/aNvobc9gzJWIiHLNHx08tpmb5n1.jpg",
               "id": 1126,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "55a3cc6a925141297d005937",
               "name": "Edward Zebrowski",
               "profile_path": "/gskFRX1pmhGIj5v0roXtWHwpa1C.jpg",
               "id": 1287141,
               "department": "Writing",
               "job": "Author"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 8.652693,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "PL",
            "name": "Poland"
         }
      ],
      "id": 108,
      "vote_count": 410,
      "budget": 0,
      "overview": "A woman struggles to find a way to live her life after the death of her husband and child.",
      "similar": [
         3989,
         334,
         337,
         283227,
         269,
         95,
         425,
         858,
         1374,
         637,
         675,
         745,
         2288,
         6637,
         322,
         112160,
         255,
         1562,
         335,
         707
      ],
      "original_title": "Trois couleurs : Bleu",
      "runtime": 98,
      "poster_path": "/ztIqf7yGmb4JRFiv2i62K6PhTQR.jpg",
      "spoken_languages": [
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Polski",
            "iso_639_1": "pl"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "France 3 Cinéma",
            "id": 591,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "CED Productions",
            "id": 1610,
            "origin_country": ""
         }
      ],
      "release_date": "1993-01-10",
      "vote_average": 7.7,
      "belongs_to_collection": {
         "backdrop_path": "/AeHExfHIl70SZCea907KfEoSkfJ.jpg",
         "name": "Three Colors Collection",
         "id": 131,
         "poster_path": "/rVdd23QuT5rHX7lZvuAkRRUkeCZ.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Krzysztof Kieslowski"],
      "runtime": 98,
      "synopsis": "Julie, wife of the famous composer Patrice de Courcy, must cope with the sudden death of her husband and daughter in an automobile accident she herself survives. While recovering in the hospital, Julie attempts suicide by overdose, but cannot swallow the pills. After being released from the hospital, Julie closes up the house she lived in with her family and takes an apartment in Paris without telling anyone, or keeping any clothing or objects from her old life, except for a chandelier of blue beads that presumably belonged to her daughter. For the remainder of the film, Julie disassociates herself from all past memories and distances herself from former friendships, as can be derived from a conversation she has with her mother who suffers from Alzheimer's disease and believes Julie is her own sister Marie-France. She also destroys the score for her late husband's last commissioned, though unfinished, work: a piece celebrating European unity, following the end of the cold war. Snatches of the music haunt her throughout the film. Julie reluctantly befriends Lucille, an exotic dancer who is having an affair with one of the neighbors and helps her when she needs moral support when the tennants in their apartment building want to evit her . Despite her desire to live anonymously and alone, life in Paris forces Julie to confront elements of her past that she would rather not face, including Olivier, a friend of the couple, also a composer and former assistant of Patrice's at the conservatory, who is in love with her, and the fact that she is suspected to be the true author of her late husband's music. Olivier appears in a TV interview announcing that he shall try to complete Patrice's commission, and Julie also discovers that her late husband was having an affair with a younger woman. While both trying to stop Olivier from completing the score and finding out who her husband's mistress was, Julie becomes more engaged despite her own efforts not to be. She tracks down Sandrine, Patrice's mistress, and finds out that she is carrying his child. Julie arranges for her to have her husband's house and recognition of his paternity for the child. This provokes her to begin a relationship with Olivier, and to resurrect her late husband's last composition, which has been changing according to her notes on Olivier's work. Olivier decides not to incorporate the changes suggested by Julie, stating that this piece is now his music and has ceased to be Patrice's. He says that she must either accept his composition with all its roughness or she must allow people to know the truth about her composition. She agrees on the grounds that the truth about her husband's music would not be revealed as her own work. In the final sequence, Julie and Olivier are having sex while the Unity of Europe piece is played (which features chorus and a solo soprano singing Saint Paul's 1 Corinthians 13 epistole in Greek), and images are seen of all the people Julie has affected by her actions as she faintly smiles through her tears.",
      "writers": [
         "Krzysztof Kieslowski",
         "Krzysztof Piesiewicz"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0108394/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjExNzQ5NTA1OV5BMl5BanBnXkFtZTcwMDkxMjcyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Juliette Binoche, Zbigniew Zamachowski, Julie Delpy | See full cast and crew »"],
      "reviews": [
         "For a film about mourning, there are two moments in Krsyztoff Kielslowski's THREE COLORS: BLUE that seem divorced of anything that is happening at first glance. Both are seen through the impersonal medium of a television. The first occurs early in the film: as she recovers from an automobile accident which claimed the life of her husband, composer Patrice de Courcy, and her daughter Anna, Julie is given access to witness their funeral, but as she turns the channel, there is an image of a man bungee jumping. It will be seen again when Julie visits her mother (played by Emmanuelle Riva) who lives in a home, disconnected from the outside, watching television. This image of a person seen in free-fall against a pale blue sky (blue is indeed prominent in this film) seems to mirror Julie quite well: her loss has given her an empty outlook on life. She wishes to do 'nothing', to just exist, divorced from human contact. However, that same cord which is a life-preserver will eventually pull her back. It's the slow but sure pull of the cord that Kieszlowski wants to tell in this beautiful but tragic story. In Juliette Binoche he has found his muse. With that face that expresses a complex set of emotions and her internalized body language that at times threatens to break through outbursts (as when she plays a piece of the concerto for the unification of Europe her husband was creating and suddenly slams the piano, or when she leaves her house carrying only a box and almost mauls her first against a stone wall). She cannot feel and is trying to make herself do so, but realizes it is better to just be, without ties, love, meaning. BLUE is filled, almost drenched, in subtle meaning which grows stronger at every frame. Kieslowszki's bungee cord begins to make its presence at every subsequent scene. The box Julie is seen carrying contains a mobile which formed a blue sphere -- her only link to her daughter. The musical score, which in one scene she had ordered destroyed, makes its appearance in none other than the streets of Paris under the sad flute of a deadbeat who says, \"We all must hold onto something.\" People inevitably come into her life -- for what reason we aren't told up front, but there is the feeling of matters left unresolved and new elements which will force Julie to come full circle and finally open herself to herself. There are three sequences in which Julie immerses herself in water. Water allows herself to go under, to dive into what she has been avoiding for some time now. In one scene, she is seen in a fetal position as if this is a return to her primal state of floating -- free-fall -- and is \"safe\". However, the next-to-last time she swims she is confronted by her new friend and neighbor Lucille (Charlotte Very) who is an exotic dancer working in the red-light district in Paris (note the implicit link to RED) and then she, and we, hear the noise of little children who all jump into the pool dressed in reds and whites which make her instinctively recoil and maybe cry. After all, this is an oblique reference to Anna and she may not be ready for this kind of information. The memories come back (even when we do not see them) and even correlate to a decision to have a neighbor's cat kill a litter or mice in her apartment because she needs complete aloneness. But this will not happen: there are still serious matters which she is about to discover and Lucille, the least involved person in Julie's tragedy but whose progressive insinuation into Julie's life, similar to Valentine's reaching out to the old judge in RED, will be the link to facing them. Music is also an important part of BLUE, and whenever Julie is about to make a decision that will take the story to the next level we hear the haunting Preisner score which permeates the entire movie as its soul. American films don't seem to give music such a prominent position in a film, quite possibly because there is always the element of consumerism that is at the heart of every movie -- even serious films. European films, I've noticed, have a different approach to storytelling. BLUE is a very oblique mystery contained within itself from WHITE and RED, but one that demands listening to as well as subsequent views: it opens and reveals its petals very slowly and contains a surprise at the center of its bud, one that again, American film-makers would not have known how to resolve unless there was some form of catharsis and maybe even violence. Not here: for a movie that gives music and its relation to a truly spellbinding mystery, BLUE and its score are stunning, particularly at its climactic sequence where all of the people Julie has crossed paths with are seen in one last, flowing shot -- Emmanuelle Riva's being the most emotional, seen reflected twice in what can only be a haunting death scene, or is it? -- and returns, full circle, to another reflection of Julie, and Julie herself, open, and weeping in an enigmatic, Mona Lisa smile, free at last.",
         "Often times when viewing an intelligent film like this I have to really contemplate what the implications the film maker making mean to me. This film was no exception. Kieslowski, with his background in non-fiction film making, is applying the french political value of liberty to a personal situation. He is, in essence, studying the human condition through fiction. The meaning of \"liberty\" takes on a very different meaning for Julie in this film. She tries to gain liberty from her memories and her emotions only to find that it is an impossible task. This is not a film to casually throw on after supper. This film requires a commitment by the audience to really consider Kieslowski's implications, for he is telling us (throughout this trilogy) what he thinks makes a \"good\" person. The score is beautiful and has a character of its own in the plot. A must see for true film lovers but perhaps a little too much for someone expecting a casual encounter.",
         "The subject(mourn,lost)is so interesting and profound that this film is a real treasure. It is very difficult to write about 'Bleu' because this film has so many intense scenes,with many details.Juliette Binoche's vulnerability is in every scene, every gesture, every moment. She plays an enigmatic woman,'Julie,' we're witness to her terrible loss(her husband who was a famous composer and her daughter died in a car crash)She is the survivor,not only of the accident,but of herself too.The film doesn't show us how her life was before the tragedy,but' Bleu' focuses on her personal journey to healing. Julie seems stoic,she did not criy hysterically or stay in bed totally depressed,her grief is intimate and touching.In one scene when Julie is near the blue crystal mobile(which belonged to her daughter) just notice her reaction.Another poignant scene is when Julie is in that swimming pool,suddenly,she stops and she can hear her husband's symphony(all in her head). Bleu also approaches a philosophical question-when you lose everything can you start all over again?,life is a series of events and choices,Julie moves to another place from the country to a city.She did not want to see her friends,she wants to be alone but is this possible?,her past will haunt her. Another interesting aspect of this film is the use of music instead of dialogue,her silence is a reference of her terrible loss and pain,she is not depressed but sad. Also the meaning of the unfinished symphony of her husband is very profound (is connected with her grief and healing) The photography of the film and the beautiful and delicate face of Binoche contribute to the impact of BLEU. Kieslowski was one of the most talented directors, I really admired his 'Trois couleurs' trilogy but I think,'Bleu' was his most powerful film. 10/10",
         "Krzysztof Kieslowski is, unquestionably, the master of the visual narrative. More-so than even La Double Vie de Veronique (which is much more poetic than linear in it's structure), Trois Couleurs: Bleu is a marvel of visual exposition. Due to the nature of the film, exposition in this case is not necessarily related to plot, but rather to the understanding of a human being. Kieslowski delves so deeply into the true nature of Julie (Juliette Binoche) and in such a remarkable way that by the end of the film we understand her utterly. Free from the clutter of dialogue and, for the most part, interaction with other characters we see Julie alone and in her most natural state. Kieslowski takes his documentary background and conveys his character in an almost voyeuristic manner. Showing Julie in anything but a state of solitude would be false; due to human nature Julie with Oliver would not be Julie, but rather a reflection of her true self which, although certainly interesting, pales in comparison to observing her silently struggle with the death of her husband and daughter alone. Kieslowski played with applying the documentary techniques, which he perfected in his early work, to the narrative form in The Dekalog with tremendous, although at times visually mundane, results. The Dekalog looks like a documentary. Here, he turns over much visual control to his Director of Photographer, Slawomir Idziak, with tremendously cinematic results. Idziak's use of color and light, combined with his groundbreaking filter work, serve to further explore Julie's character. Blue feels like a documentary and looks like a dismal Rembrandt. While Kieslowski concentrates on showing the true nature of Julie through action, Idziak contributes by showing her through light and color. Trois Couleurs: Blue is an almost unmatched achievement in the history of cinema. Never before has a character been conveyed so splendidly and in such a visually stunning manner.",
         "BLEU (TROIS COLEURS) / France/Poland 1993 (4 STARS) 23 January 2004: The thing that stands out most about Blue is the expression (or lack there of) of grief. How does a woman, seemingly fulfilled by happiness, react when that happiness is yanked away in one telling moment, in a car accident in which both her husband and her daughter pass away? That is the central understudy - a strong woman's attempts at finding purpose in the seeming absence of meaning. � Mise-en-scene: I watched an interview with Juliette Binoche, where she mentions that Kieslowski refused to make the film unless it had her in it. It's easy to see why. I can't imagine Bleu without Juliette � its not just that she lends her personality to the film�Bleu IS Binoche. � I was thrown off by the sub-plots of the character's relationships with her mother and the striptease dancer, as I was about the seeming resolution at the end of the film. There were perhaps references that I missed but the �almost happy' ending left me feeling un-relinquished. Given that I had shared such an intense journey with Julie, it seemed almost improper to accept that she would settle in to a normal relationship again. � Cinematography: The 1st shot of the film - that of a car tire racing - shot from the bottom of the moving car establishes this as �not your typical movie'. The sequence-of-shots that follow eerily draw one into the compelling story-telling style of Krzysztof Kieslowski, minimalist in its approach, with a world communicated without dialogue in the first five minutes of the film. � Blue is not your typical art-house film. Its production values are up there with the best, and the cinematography by Slavomir Idziak (who's craft was recognized by Hollywood in Black Hawk Down), is nothing short of stunning. � The lighting is low key and soft, and wraps around the characters to create a mood of subtlety. A distinguishing feature is the detail in the shadows. None of the close-ups fully illuminate the protagonist, almost hinting at her vulnerability at facing the light, though the delicate use of eye-lights does well to bring alive her emotions. � The camera, an intelligently used narrative element, interacts with Julie and partakes in her emotions, respecting them and yet accentuating their intensity as she plods on in an alien world of deep personal purposelessness. The tight close-ups penetrate her soul and force us to delve into Julie's mind and share in her agony. � Editing: deftly uses match on action to create irony while forwarding the narrative. � Sound: The pace is hauntingly slow and silence has been used compellingly. It screams with meaning as it is becomes one of the more important elements as the narrative progresses. Bleu is not a film you can watch, consume and move on. Either you'll feel that you've totally wasted your time and will probably not be able to sit through (the pivotal occurrence is over within the first five minutes of the film without a single world being spoken, and the rest of the film is essentially the protagonist's psychologically subjective journey) or you'll realize by the time you've reached the end that you'll revisit this film at various points in time, explore and read about it, discuss it with people you respect, and try to get closer to the essence of Kieslowski. For there are two now well-accepted truths about the folklore surrounding Kieslowski, whose reputation continues to mount posthumously�1. that Kieslowski carefully interwove elements that were rich with meaning and social irony, and 2. that figuring those elements out and appreciating their implications is probably a lifelong learning process.",
         "Krzysztof Kieslowski's \"Blue\" is a film that appears, at first glance, to have a very simple story and almost no plot. The film is about Julie (Juliette Binoche), who after losing her husband and daughter to a car accident must learn to cope with their deaths. But the real story revolves around the process of liberation from her past. Kieslowski illustrates this process with complex visuals, implementing an interesting use of light and shadow, as well as colors, to create an atmosphere that reflects the feeling of this piece perfectly. There is a certain degree of multiple meaning in the use of colors in Kieslowski's \"Three Colours\" trilogy, aside from creating an appropriate mood for each part of the trilogy; the colors also represent the blue, white, and red of the French flag. The three colors stand for liberty (blue), equality (white), and fraternity (red). Liberty, or freedom from the past, is a major theme in \"Blue\", the first part of the trilogy. The Juliette Binoche character, Julie, goes through a personal journey, as she must cope with her husband and daughter's deaths. She must go on with life even though the worst has happened, and she chooses to be free, to become liberated. The color blue is used regularly from beginning to end. The film starts with a shot of a candy-wrapper moving in the wind; it is colored blue on one side. The street, the car, and even the air seem to be tinted in a hue of blue. The last shot before the final montage is of the sparkling blue crystal lamp hanging above Julie's flat. Throughout the film blue is used extensively, there is a trace of it in practically every shot of the film, everything from people's clothes, the color of ink, the paint on walls and arches, the tint of the street and the water, etc. The blue is used \"to create moods of melancholy and coldness, and to draw attention to the resonant emotional associations conjured up by objects and places in Julie's mind.\" (Andrew, p. 25) The coloring perfectly reflects the mood of the film; it presents a very dismal and hopeless atmosphere full of solitude and melancholy, giving the viewer a visual insight into Julie's mind. The several scenes in the swimming-pool are some of the most powerful moments in the film, \"there's aching dimension in the bluish swimming-pool water she regularly immerses herself in\" (Howe), and it is especially evident in the shot following Julie's recollection of her husband's last words. In this scene Kieslowski implements an interesting use of light and shadow. The shot begins in the water, Julie's entire body is submerged, and the only color visible in the frame is blue: the water is blue, her body is blue, the surrounding walls are blue, and even the shower door is blue. The camera pans as she moves from one side of the pool to the other. Then, as Julie lifts herself out of the water, a reddish ray of light covers the upper half of her body, while everything else seems to be hidden behind a blue-tinted shadow; it is as if the essence of life itself is shining its hopeful light on her. But she can not handle it; she is not yet ready for liberty. Slowly she lowers her body back into the water, returning once again into the atmosphere of the oppressive blue until she is completely submerged in the pool, her grief now as clear as the bluish water surrounding her. Another fascinating element about Kieslowski's films is the attention that is paid to details, especially when it comes to expressing one of the most difficult elements to capture on camera: human emotion. Every glance, every reaction is rich with meaning, there is no close-up throughout the film that is unnecessary. Kieslowski works very well with the actors, especially Juliette Binoche, who gives one of the most impressive performances of her career in \"Blue\". One can see the grief on her face, but it is a very cold grief, more than in any of her other films Binoche gives the impression that her character in \"Blue\" is undergoing a complex state of thought. There are a few shots in the film that seem to be unrelated to the story. This is yet another technique often used by Kieslowski to heighten the intellectual capacity of his films. Whenever creating any series of films, Kieslowski liked to link each respective part of the series with certain characters or actions, and this is true on several levels of the \"Three Colours\" trilogy. Beside the fact that the court scene of \"White\" is actually a short part of \"Blue\", and the fact that the characters from all three films appear at the end of \"Red\", there is a very interesting shot of an old woman that is presented in the same way in every part of the trilogy. It's a very simple shot, but it says a lot. An old woman, so old that she can barely walk, walks slowly towards a recycling container. She reaches up so high that she can barely reach to throw a bottle into the container, and then once again she takes her bag and slowly walks away. It is as if Kieslowski wanted to represent life's struggle, and indeed the different struggles of the characters of his trilogy, with this little old woman's struggle with the recycling container. Also seemingly unrelated were several shots of people bungee jumping juxtaposed with a dialogue between Julie and her mother. \"Before I was happy. I loved them. They loved me, too.\" says Julie, just as a shot of a man jumping from a helicopter begins. The fall seems to symbolize her desperation perfectly, yet it is also a symbol for the film's theme of liberation, for although the shots of the bungee jumpers all end just before it, the entire point of the bungee cord is to stop the fall and to pull the jumper back up, perhaps not to the same height, but up again never-the-less. It is like Julie's plunge into the bluish darkness of hopelessness after her tragedy, yet there exists the opportunity for liberation, for her to be pulled back up and to put the past behind her. Music is a large part not only of the story of \"Blue\", but Kieslowski actually worked with composer Zbigniew Preisner to make it a part of the film. There are more than a few parts in the film where music is essential in creating the effect of the scene. \"Kieslowski suggests the music's almost supernatural provenance by showing Julie first dozing in a chair with an unexplained blue light playing over her face, then, having been woken by the music, looking started and mystified toward the camera (which not only draws back from her and then returns, but bathes the scene in a blue wash), as if the music itself were a (blue?) physical presence.\" (Andrew) When Julie first starts remembering the tune to the music to the \"Song For The Unification Of Europe\" the music plays in several brief flashes, and each time it plays Kieslowski creates a visual lens flare effect, which is of course colored blue. In the scene where Olivier shows Julie his version of the music the audio and video simultaneously lose clarity: each time Julie makes a change to the manuscript, removing instruments from the composition one by one, the camera goes out of focus until only the string instruments are left and the camera is completely unfocused. The ending sequence is another example, for the first time in the film the audience hears the complete chorus and as the tension builds and we finally hear the choir portion the camera tilts up to Julie's glittering blue crystal lamp, a shot which is followed by the powerful chorus and complete darkness. This effect of juxtaposing darkness with music is something that occurs several times throughout the film, Kieslowski uses this technique to represent the intensity of emotion running through Julie's head. When the character Antoine asks Julie if she wants to know what he saw at the time of the accident, she answers simply \"no\", then the screen blacks out and music begins, a few seconds later the black ends and we are returned once again to Julie and Antoine's conversation. It's a shame that more directors do not undertake more ambitious efforts such as the work of Krzysztof Kieslowski. His films often do not rely on conventional plot elements, in fact, often times there is no real plot at all, yet somehow he was able to make his films both intellectually stimulating and interesting to watch. In \"Blue\", Juliette Binoche's character, Julia, must learn to cope with her family's death. She wants to put her past behind her, yet she is drawn into the past because of her husband's unfinished composition. Does she even want the composition finished? Was the music originally her husband's, or was she the real composer? Kieslowski was not interested in answering these questions, he preferred to leave them uncertain. The film is, instead, about the process of Julie's liberation from her memories. \"For Kieslowski, subtlety is a religion. He hints or implies -- anything to keep from laying his cards on the table. With \"Blue,\" you never feel he's shown his whole hand; not even after the game is over\" (Hinson). There is no happy ending here, and there is no real solution to the puzzle; the final shot is of Julie's tear-stained face, as it slowly loses opacity to an image of something blue on the frame behind it. She makes the decision to be liberated from her past; hence it's a hopeful ending, yet the tear represents a struggle that is never really over.",
         "This movie is one of my favorites. The disturbing topic of a woman who can't deal with the loss of her husband and child transforms into an essay on the impossibility of isolation. It is a quiet, personal movie that spends most of it's time with the main character played excellently by Juliette Binoche. The color blue is very evident in the film,and a fade to a simple blue screen is used to show times of deep emotion. Although the characters are set in a specific time and place ( France just before the formation of the EU ) the focus on the personal journey of grief transcends the setting. I like the way this film changes from a story about a death to an affirmation to life. I like the way that little things like mice in the apartment loom large in the thought of our main character, where as what others consider important such as finishing her husband's symphony seem very minor . It feels like diving deep through cold dark water to finally swim toward the light. One passes through emotional turmoil to come out the other side. I found it a very satisfying.",
         "\"Three Colors Blue\" is the first part of Polish director Krzysztof Kieslowski's Three Colors trilogy� \"Blue\" is set in France, \"White\" in Poland and \"Red\" in Switzerland, but all production was based in France� Not only are the colors of the trilogy those of the French national flag; the original intention was meditation on the ideals of the French Revolution: freedom, equality and fraternity� This suggests a political dimension to the work� But though like most Polish filmmakers Kieslowski had his difficulties with the Polish Communist system, its collapse by the early 1990s meant that he was not only free to work where he pleased, but liberated from the necessity for his films to engage directly in the political process� In \"Three Colors Blue\" Juliette Binoche plays a woman whose husband and daughter are killed in a car crash� Overcome by melancholy, she progressively withdraws from life, depriving herself of possessions and refusing relationships, a state of mind conveyed in part by the director's subtle use of color blue� But eventually she is able to accept the attentions of a lover and even to offer friendship to another woman who is pregnant with her husband's child� Finally, she completes the piece of music which her husband has been commissioned to write� The result is a work that has less in common with the Polish 'Cinema of moral concern' of the late 1970s than with the tradition of the mainstream European art cinema, in its concerns with alienation and the loss of feeling, countered by the transcendent power of love�",
         "Something of a model of directorial focus and control, 'Bleu' seems to be an attempt to answer several related questions: How can a filmmaker express the feelings for someone who won't, or can't, express them herself? Can the director make the viewer understand her, like her, share her feelings? Krzysztof Kieslowski comes very close, finding ingenious, even brilliant ways to get inside the head of his deliberately impenetrable Julie. The frequent 'blackouts,' coupled with the throbbing, somber score (inspired, it seems, at least in part, by Mozart's 'Requiem'), gives us a window into the character's inner life, lets us hear, rather than see, the humanity behind her aloof façade. We understand her--but do we like her? How easy it would be for Julie to become totally unlikable--the way Juliette Binoche plays her, she is blank to the point of coldness, sometimes in ways reminiscent of Catherine Deneuve's Carole in \"Repulsion,\" only with a taut intelligence that character certainly lacks. Somehow, she never does; but, for all the actress's control, the characterization is ultimately Kieslowski's creation, not hers. It's the directorial techniques, and not the acting, that allow us to care about Julie. So, do we ever share her feelings? No, despite all Kieslowski's tricks, we really can't. So often, Americans wrongly write off European films as 'cold,' and that's why it's surprising that this movie, which directly tackles the question of emotional frigidity, and which has such a passionate following among cinephiles, should turn out never to make us feel really anything. Oh, the film has an undeniable emotionalism, a potency, just beneath the surface, yes. But it's never willing to go the extra step and manipulate the viewer in an outright way. It's too respectful of its audience, too intelligent, too careful, for that. And this studied, uncompromising unsentimentality in itself is an achievement Kieslowski should be commended for, but some may find it makes 'Bleu' into a portrait of grief to be admired, rather than loved. 7 out of 10.",
         "TROIS COLOURES: BLEU is a rich, dark film with all the Kieslowski marks: death, silence, depression, and the inner torment of outwardly attractive women. After seeing the whole trilogy and the DEKALOG, I'm convinced at Kieslowski's great talent, and his very early death was a true blow to world cinema. Much like Kubrick but with a less ironic nature, Kieslowski loves to make his characters and stories both humanely distant, realistic, and, at the same time, philosophically idealist and dense. I enjoyed BLEU more than BLANC (which was an odd machismic entry in a trilogy mainly focusing on women) but not as much as ROUGE, which I feel is one of the finest, most beautiful, most well-done films I've ever seen. More specifically, BLEU's focus seems to be on the relationship of a woman's loss of the tactile manifestation of her husband's existance with the ligering notions of his life - especially his music, which pervades the entire film, interrupting at key moments with a blackout and short blast of the overture. To watch Julie struggle with her husband's abandoned secrets (including a mistress Julie befriends) is shattering, frustrating, and perplexing. Unfortunately, life must move, and, due to that, I can't watch BLEU over and over. However, I did glean from one viewing the complexity of this picture, and recognize its need to be watched over and over, until Kieslowski's last gasps can be properly understood, which is all we can hope to return to a man whose genius was tragically cut short, but still stands as a giant in my view of cinema."
      ],
      "genres": [
         "Drama",
         "Music",
         "Mystery",
         "Romance"
      ],
      "productionCompanies": [
         "MK2 Productions",
         "CED Productions",
         "France 3 Cinéma"
      ],
      "summaries": [
         "The first part of Kieslowski's trilogy on France's national motto: Liberty, Equality, and Fraternity. 'Blue' is the story of Julie who loses her husband, an acclaimed composer and her young daughter in a car accident. The film's theme of liberty is manifested in Julie's attempt to start life anew, free of personal commitments, belongings, grief or love. She intends to numb herself by withdrawing from the world and living completely independently, anonymously and in solitude in the Parisian metropolis. Despite her intentions, people from her former and present life intrude with their own needs. However, the reality created by the people who need and care about her, a surprising discovery and the music around which the film revolves heal Julie and draws her back to the land of the living.",
         "A woman struggles to find a way to live her life after the death of her husband and child."
      ],
      "budget": 0
   },
   "movielensId": 307,
   "movielens": {
      "languages": [
         "Français",
         "Polski"
      ],
      "releaseDate": "1993-01-10",
      "dvdReleaseDate": "2003-03-04",
      "directors": ["Krzysztof Kieślowski"],
      "runtime": 98,
      "movieId": 307,
      "title": "Three Colors: Blue",
      "mpaa": "R",
      "actors": [
         "Juliette Binoche",
         "Benoît Régent",
         "Florence Pernel",
         "Charlotte Véry",
         "Hélène Vincent",
         "Philippe Volter",
         "Claude Duneton",
         "Hugues Quester",
         "Emmanuelle Riva",
         "Julie Delpy",
         "Zbigniew Zamachowski"
      ],
      "imdbMovieId": "0108394",
      "originalTitle": "Trois couleurs : Bleu",
      "genres": [
         "Drama",
         "Music",
         "Mystery"
      ],
      "youtubeTrailerIds": [
         "9wjcbC-xn9g",
         "cVaqLZmMf-k",
         "Hxu6my_t4pM"
      ],
      "plotSummary": "A woman struggles to find a way to live her life after the death of her husband and child.",
      "tmdbMovieId": 108,
      "avgRating": 3.97208,
      "releaseYear": "1993",
      "numRatings": 7898,
      "posterPath": "/ztIqf7yGmb4JRFiv2i62K6PhTQR.jpg"
   }
}