{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "education",
            "id": 2470
         },
         {
            "name": "mathematics",
            "id": 6009
         },
         {
            "name": "drop-out",
            "id": 7617
         },
         {
            "name": "based on true story",
            "id": 9672
         },
         {
            "name": "teacher",
            "id": 10508
         },
         {
            "name": "high school teacher",
            "id": 41525
         },
         {
            "name": "mexican american",
            "id": 164253
         }
      ],
      "imdb_id": "tt0094027",
      "video": false,
      "title": "Stand and Deliver",
      "recommendations": [
         38772,
         14441,
         31944,
         38982,
         41925,
         25010,
         13554,
         94655,
         415018,
         32044,
         14621,
         10608,
         72899,
         17126,
         16814,
         16148,
         292,
         32075,
         15503,
         19382
      ],
      "backdrop_path": "/80OViQlYBHfXUoUuub51O9hRANz.jpg",
      "revenue": 13994920,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Jaime A. Escalante",
               "gender": 2,
               "credit_id": "52fe45ccc3a368484e06f725",
               "name": "Edward James Olmos",
               "profile_path": "/i7zKqsFqL5L1HPmAMeSA1xZzlD5.jpg",
               "id": 587,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Angel Guzman",
               "gender": 2,
               "credit_id": "52fe45ccc3a368484e06f729",
               "name": "Lou Diamond Phillips",
               "profile_path": "/afXcQRss7rZ6Ocx7PUQFbz7tPOm.jpg",
               "id": 38560,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Fabiola Escalante",
               "gender": 1,
               "credit_id": "52fe45ccc3a368484e06f72d",
               "name": "Rosanna DeSoto",
               "profile_path": "/ppAz1PLGnuxTgXYDVWblLgXKkqp.jpg",
               "id": 2111,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Dr. Ramirez",
               "gender": 2,
               "credit_id": "52fe45ccc3a368484e06f731",
               "name": "Andy García",
               "profile_path": "/zE3KYH6f6cxCehJJYKDTQa8sCaK.jpg",
               "id": 1271,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Secretary",
               "gender": 1,
               "credit_id": "5a290106925141033310c9f4",
               "name": "Estelle Harris",
               "profile_path": "/equDBtZgBkO7e8QKpNokDz9EbY9.jpg",
               "id": 61964,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Cop",
               "gender": 2,
               "credit_id": "5a29011e925141032c112bca",
               "name": "Mark Phelan",
               "profile_path": "/rEscpvLeZyvfb5X9SvM8eKccy7M.jpg",
               "id": 149466,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Raquel Ortega",
               "gender": 0,
               "credit_id": "5a2901300e0a264cbe10d8cb",
               "name": "Virginia Paris",
               "profile_path": null,
               "id": 1903765,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Tito (as Mark Eliot)",
               "gender": 0,
               "credit_id": "5a290143c3a3680b9a11e925",
               "name": "Eliot",
               "profile_path": null,
               "id": 1859858,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Sexy Girl",
               "gender": 0,
               "credit_id": "5a2901580e0a264cd0111201",
               "name": "Adelaida Alvarez",
               "profile_path": null,
               "id": 1936568,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Molina",
               "gender": 2,
               "credit_id": "5a290186c3a3680b9d10399d",
               "name": "Carmen Argenziano",
               "profile_path": "/8fi4xfPwYVHulKvmTTlwBx2nvLo.jpg",
               "id": 28413,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Fabiola Escalante (as Rosana De Soto)",
               "gender": 1,
               "credit_id": "5a29019e0e0a264cbe10d933",
               "name": "Rosanna DeSoto",
               "profile_path": "/ppAz1PLGnuxTgXYDVWblLgXKkqp.jpg",
               "id": 2111,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Fernando Escalante",
               "gender": 2,
               "credit_id": "5a2901b40e0a264cd0111260",
               "name": "Bodie Olmos",
               "profile_path": "/hxsUoNWzkZLCH2EQjjFCE2vUrS6.jpg",
               "id": 936227,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Ana Delgado",
               "gender": 1,
               "credit_id": "5a2901d2c3a3680b88114759",
               "name": "Vanessa Marquez",
               "profile_path": null,
               "id": 165285,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Chuco",
               "gender": 0,
               "credit_id": "5a2901e4c3a3680b8d10fc7a",
               "name": "Daniel Villarreal",
               "profile_path": null,
               "id": 1192358,
               "order": 13
            },
            {
               "cast_id": 19,
               "character": "Craig",
               "gender": 0,
               "credit_id": "5a2901f6c3a3680b9d103a11",
               "name": "Graham Galloway",
               "profile_path": null,
               "id": 93351,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45ccc3a368484e06f71b",
               "name": "Ramón Menéndez",
               "profile_path": "/pKPvD6TpDkHgQMgaYPFnFcUNtN7.jpg",
               "id": 104879,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45ccc3a368484e06f721",
               "name": "Tom Musca",
               "profile_path": null,
               "id": 72562,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45ccc3a368484e06f737",
               "name": "Ramón Menéndez",
               "profile_path": "/pKPvD6TpDkHgQMgaYPFnFcUNtN7.jpg",
               "id": 104879,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 4.056947,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 29154,
      "vote_count": 70,
      "budget": 0,
      "overview": "Jaime Escalante is a mathematics teacher in a school in a hispanic neighbourhood. Convinced that his students have potential, he adopts unconventional teaching methods to try and turn gang members and no-hopers into some of the country's top algebra and calculus students.",
      "similar": [
         8841,
         400928,
         52449,
         2034,
         233063,
         437670,
         1807,
         103663,
         22302,
         25934,
         7340,
         9276,
         47559,
         14069,
         35052,
         8457,
         10092,
         1259,
         13466,
         9702
      ],
      "original_title": "Stand and Deliver",
      "runtime": 103,
      "poster_path": "/rGG02Q77dDqm0nOKQfn2c49hZAK.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Magyar",
            "iso_639_1": "hu"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [{
         "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
         "name": "Warner Bros. Pictures",
         "id": 174,
         "origin_country": "US"
      }],
      "release_date": "1988-03-11",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "At a tough school, someone had to take a stand...and someone did. Together, one teacher and one class proved to America they could...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ramón Menéndez"],
      "runtime": 103,
      "synopsis": "Based on a true story, this low budget theatrical masterpiece opens with the background of Eastern LA. In an environment that values a quick fix over education and learning, Jaime A. Escalante is a new teacher at James A. Garfield High School determined to change the system and challenge the students to a higher level of excellence. Leaving a steady job for a lowly position as a math teacher in a school where rebellion runs high and teachers are more focused on discipline than academics, Escalante is at first not well liked by students, receiving numerous taunts and threats. As the year progresses, he is able to win over the attention of the students by implementing innovative teaching techniques, using props and humor to illustrate abstract concepts of math and convey the necessity of math in everyday lives. We all use math every day, a value that Escalante successfully instills. He is able to transform even the most troublesome teens to dedicated students, ready to learn. While Escalante teachs math 1A, basic math, he soon realizes that his students are capable of more than the expectations set forth by the school board. Despite concerns and skepticism of other teachers, who feel that \"you can't teach logarithms to illiterates\", Escalante nonetheless develops a program in which the his students can rise to take AP Calculus by their senior year. This intense math program requires that students take summer classes, including Saturdays, from 7 to 12, tasking for even the most devoted and committed students. While other students spent their summers \"barefoot and pregnant\", these math enthusiasts were learning complex theorems and formulas. The vast contrast between home life and school life, however, begins to show as these teens struggle to find the balance between what other adults expect of them and the goals and ambitions they hold for themselves. With Escalante to help them, they soon find the courage to separate from society's expectations for failure and rise to the standard to which Escalante holds them to, a standard of success. Taking the AP Calculus exam in the spring of their senior year, these students are relieved and overjoyed to be finished with a strenuous year. After receiving their scores, they are overwhelmed with emotion to find that they have all passed, a feat done by few in the state. Later that summer, a shocking accusation is made. The Educational Testing Service calls into question the validity of their scores when it is discovered that similarities between errors is too high for pure chance. Outraged by the implications of cheating, Escalante feels that the racial and economic status of the students has caused the ETS to doubt their intelligence. In order to prove their mathematical abilities and worth to the school, to the ETS, and to the nation, the students agree to retake the test at the end of the summer, months after their last class. With only a day to prepare, there is high stress to show that they have what it takes to make something of themselves. After the retake, these students truly stand and deliver when they all pass the exam again, showing they deserve all they have achieved. -The Numerators.",
      "writers": [
         "Ramón Menéndez",
         "Tom Musca"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0094027/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ2MjA4MTcwOF5BMl5BanBnXkFtZTgwNTI4OTI1MDE@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Edward James Olmos, Estelle Harris, Mark Phelan | See full cast and crew »"],
      "reviews": [
         "Why is this movie depressing? It's a true story about a high school teacher who managed to motivate a group of struggling students to attempt one of the greatest academic challenges a high school student can undertake. It's the true story of the underdogs sticking it to the system. It's the true story of a teacher fighting the system and winning... Or did he? Despite the success portrayed in the movie, 1987 was the high water mark for the Garfield High School AP Calculus program. In 1987, the principal who had supported Escalante with his AP program went on sabbatical and was replaced by an administrator with a different academic focus. The teachers' union complained about Escalante's class sizes and teaching assignments, and petty rivalries and jealousies abounded, eventually forcing Escalante and his partner teacher out of the school. Unable to find support for his unorthodox methods, in 2001, Escalante moved back to his native Bolivia, where he teaches calculus at a local university. As much as I love this movie, every time I watch it, I become depressed all over again. It's been over 25 years since Escalante began the AP Calculus program at Garfield High, and one would think that the educational system would learn from him--not only from his example as a teacher, but also the factors that forced him to leave the school, but ultimately the country. It's not just Garfield High School, and it's not just advanced mathematics. I hear the same words that the naysayer teachers and administrators spoke in the movie spoken on a daily and weekly basis on the public high school campus where I teach. I see the same objections and doubts and obstacles thrown up by the administration and teachers' union in the movie thrown up by administrations and unions today. I work every day with the same underprivileged yet eager to be educated students as Escalante had, students who just need someone to challenge them and believe in them. And I see my students battle against the same low expectations and prejudices as the students in the movie faced. Which leaves me with the question--what has really changed in 25 years? If this is such an outstanding, motivational movie, why has it not produced a systemic change? Why are underprivileged yet bright students routinely passed over and allowed to fail? Why are creative, energetic, passionate teachers forced out of their schools and even their professions by school systems unwilling to embrace unorthodox methods, even if those methods are proved to promote student success? Escalante poured everything he had into his job. Teaching was his life, his passion--not only a vocation, but an avocation. He was willing to sacrifice his personal relationships and his own health for the sake of the students in which he believed... For what? Nothing has changed. 25+ years later, nothing has changed. Yes, he made a difference in the lives of those students, and of students for more years than just those portrayed in the movie, but once he left, the program essentially left with him. Despite all of his passion and sacrifice, he effected no systemic change. And it's that knowledge that, to me, makes this such a depressing film.",
         "There are many films about teachers breaking through to tough students. Many are trite, sappy and formula-written. This is one of the few truly powerful films in this genre. Every member of the cast gives an incredible performance. This is particularly true of the students. Adult writers in this genre usually fail to write convincing adolescent dialogue, but the students in this film talked and acted quite convincingly. The role of the teacher was not glorified, but treated as a regular human being who was doing his best to do something good, sometimes in the right way and sometimes in the wrong way. The race subplot was powerful, but not too preachy. In short, this was an excellent and inspiring story of teachers and students overcoming their shortcomings and being the best that they could be. A stunning and vastly underrated film.",
         "Stand and Deliver has several messages and Edward James Olmos delivers an outstanding performance. Every time I watch it, it leaves me with a good feeling of achievement. I think Mr. Jaime Escalante deserves all the recognition for proving that all kids will rise to whatever level of expectation they are put on. If we lower the levels to the least common denominator, that's as far as they will get. But if we raise it, they can accomplish anything. All they need is GANAS or desire to succeed and a good teacher to motivate them. This should be required material for every school teacher. We need more constructive movies like this instead of the trash that Hollywood is producing lately",
         "I really enjoyed this movie. I was watching it on PBS one late night. I am really glad that PBS endorses this film. It is such an influence for kids to do well in school. I hope that it influences teachers to be more supportive and teach better, although I don't have much faith anymore in our broken school systems nowadays. But I still believe in HOPE! I, personally, am not a minority, but you just really hoped the best for the kids in this film. Watching this film, you really get on their side and you really want them to do well. They all have their ups and downs and their home lives are not perfect. The role of Edward James Olmos as Kimo is simply unforgettable. You really admire how Kimo sticks by his kids 100 percent. Teachers like that are so rare. I hope there are teachers like that to pass the torch down to other teachers in the next generation. I look forward to seeing this movie again!",
         "This film is excellent. It details the struggles of inner city Latinos and their pursuit of excellence. The movie is based on a true story and is about a teacher, Jaime Escalante, and his class of high school math students in a predominantly Latino area of Los Angeles. I am a Latino from New York City and can relate to the struggles of these students. \"Stand and Deliver \" inspired me when I was struggling through college and continues to inspire me now.",
         "\"Stand and Deliver\" is a strong film which is based on a true story. Edward James Olmos received an Oscar nomination as Jaime Escalante, a man who has decided to teach in a Los Angeles school after quitting a high-paying technological job. Escalante is a man who could be described as a \"Patton of the classroom\". He will do anything and everything to teach his Hispanic students the complicated mathematics of Calculus so they can pass a test which will give them college credit. This is Olmos' show all the way. He proved to be a dominant actor here and it is he who makes the film believable and overall exceptional. The supporting cast is good, led by a young Lou Diamond Phillips. A solid screenplay and smart direction make \"Stand and Deliver\" a forgotten winner from the 1980s. 4 stars out of 5.",
         "Stand And Deliver deals with a lot of inner city kids who have grown up in a bad neighborhood and who all have dismal outlooks for the future. Edward James Olmos delivers the performance of his career as Jaime Esclante, the math teacher who comes to this school determined to teach these kids calculus and have them succeed in school to inspire them to improve the rest of their lives. The rest of the staff at Garfield High School has just as little faith in him and his efforts as they do in the rest of the school, and the film is also able to remain even more interesting because it deals with the lives of the kids outside of the school as well as in the classroom. Because the film presents such a realistic image of inner city life, we are completely engrossed with the atmosphere and the efforts of Mr. Escalante to teach these kids advanced mathematics, when many times they don't even want to put forth the effort themselves. There have been many films made about students with little to no potential showing that they are capable of being educated, and Stand and Deliver ran a huge risk of being repetitive when it was released, but it manages to cover new ground because it deals with so many different levels of the lives of the kids and the efforts of the teacher to teach them. The film is able to revolve not just around the kids trying to learn or the teacher trying to teach them, but around both of these things as well as around the daily lives of the students and the teacher and even the health and relationship of Mr. Escalante with his wife. We are introduced to a variety of fascinating and memorable characters in this film, particularly in Mr. Escalante, played brilliantly by Edward James Olmos, and especially Angel, played by Lou Diamond Phillips (who, by the way, can be seen at his desk on the cover of the movie, but can't be seen on the IMDb's top billed list of cast on the Stand and Deliver page). The movie has the perfect amount of comic relief that is genuinely amusing but that doesn't take away from the overall appeal and seriousness of the movie. I can't say that there were no scenes within the film that were dramatized for effect, thereby illustrating the influences of Hollywood on the film, but even these scenes did not take away enough from the total value of the movie and the story that it presents to tarnish the real life accomplishments of Jaime Escalante, his calculus class, and the many students thereafter at Garfield High School that managed to pass the same test that we saw in this movie. This is wonderful entertainment for the entire family, don't miss it!",
         "Back when I was the age of these kids that Jaime Escalante taught I wish I had a math teacher who could have made it as interesting and challenging as he did for the barrio kids he taught in East Los Angeles's Garfield High School. Stand and Deliver is one of the best films of the Eighties and one of the most inspiring I've ever seen. Anyone who could get kids fired up about algebra and calculus as Edward James Olmos as Jaime Escalante did has my undying respect. Olmos is one of those rare teachers whose very presence in the lives of his students makes them change. So many I had back in the day were just time serving bureaucrats, little better than clerks who took attendance. Of course I had some good ones too, but not in mathematics, I was kind of hopeless in that subject. But something that I didn't realize about math then, but that Olmos says and Stand and Deliver emphasizes is that math is the great equalizer. There's no cultural bias in math, no interpretative spins on it, you either know it and do it or you don't. It does help to develop the gray cells, no doubt about it. The Mexican-American kids he teaches in Garfield High School have it in their minds they'll be filling station attendants, fast food cooks, or day laborers, striving for better is not something they think about. More than teaching them math skills, we are shown how Olmos makes them believe in themselves and their potential. It's certainly a better life lesson than anything else. I doubt any of Escalante's kids at parties do quadratic equations for entertainment. Lou Diamond Phillips has a supporting role in this film which was made earlier than his breakout role in La Bamba, but released later. Of course his billing was adjusted as befit his new star status. He's very good as the kid who makes a deal with Olmos for three textbooks, one for home, one for class, and one for his locker just so his image among his home boys is kept secure. After all as Olmos says, we wouldn't want anyone to get the idea you're really smart. Rosanna DeSoto who was LDP's mother in La Bamba is Olmos's wife in Stand and Deliver, loyal and supportive. Other good performances are from Carmen Argenziano as Olmos's supportive school principal and of the kids besides Phillips, you will love young Vanessa Marquez. Andy Garcia and Rif Hutton play a couple of educators from the Educational Testing Service, read Standardized Aptitude Test (SAT) who can't quite believe what Olmos has accomplished with these barrio kids. Has to be something wrong here. You have to see the film to see what comes out of their questioning Olmos's competence and integrity. Edward James Olmos was nominated for Best Actor in 1988. Unfortunately he was up against a singularly unique performance by Dustin Hoffman in Rain Man. The real Jaime Escalante no longer teaches in the USA. A few years ago Escalante went back to Bolivia to give back a little to the people from where he came. That's entirely in keeping with the character of this man that Stand and Deliver tells the story of. One of the most inspirational films ever made, don't ever miss it when broadcast.",
         "One of my favorite films of all time ... a worthwhile story with many outstanding performances. The journey these kids and their teacher takes is extraordinary and inspiring. It is also thrilling to see a rare film that treats Hispanic-Americans with respect and dignity while examining serious topics. A must see!",
         "I know, there are a million movies made like this. The story about a teacher handling tough students has been told quite some times. \"Dangerous Minds\", To Sir, With Love\", \"The Substitute\"-movies, \"The Principal\",... The stories often look a lot like each other and \"Stand and Deliver\" isn't any different, but that doesn't bother. This is a fine movie! I don't know if Edward James Olmos' Academy Award nomination was a big surprise at the Oscars or if his performance was indeed one of the 5 best performances of 1988, but I can only confirm that he gave a great performance. Funny, smart and touching as well. I think all the students were great as well, even so I didn't knew any of them, except from Lou Diamond Philips of course. \"Stand and Deliver\" might not be the most original movie ever made, but that doesn't change the fact that it's highly enjoyable to watch. The story is good and the performances are great. Nor melodramatic, neither comic, just excellent Saturday night entertainment without being cheap. Worth watching! 8/10"
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "American Playhouse",
         "Olmos Productions",
         "Warner Bros."
      ],
      "summaries": [
         "Jaime Escalante is a mathematics teacher in a school in a Hispanic neighbourhood. Convinced that his students have potential, he adopts unconventional teaching methods help gang members and no-hopers pass the rigorous Advanced Placement exam in calculus.",
         "Biopic of high school teacher Jaime Escalante whose approach to teaching inspired his students and colleagues. He gave up a job as an engineer to take a job at Garfield High School in East Los Angeles. The school is on the verge of being decertified by the school district due to poor academic results and Escalante's philosophy is that students will respond to expectations and those at the school are so low that they perform poorly. After several years of success he decides he wants to teach them calculus, driving his students as hard as he can. He also drives himself into having a mild heart attack. Working with the students and also their parents, many of whom think schooling is a waste of time, 18 of them eventually pass the Advanced Placement calculus exam, giving them college credit. The Educational Testing Service finds a number of anomalies in the scores and suspect they have cheated, leading to a crisis. When the students re-write the exam and pass - again with high marks - they and Escalante are exonerated of any wrongdoing and their marks are re-instated.",
         "The story of Jaime Escalante, a high school teacher who successfully inspired his dropout prone students to learn calculus."
      ],
      "budget": 0
   },
   "movielensId": 3071,
   "movielens": {
      "languages": [
         "English",
         "Magyar",
         "Español"
      ],
      "releaseDate": "1988-03-11",
      "dvdReleaseDate": "1998-11-10",
      "directors": ["Ramón Menéndez"],
      "runtime": 103,
      "movieId": 3071,
      "title": "Stand and Deliver",
      "mpaa": "PG",
      "actors": [
         "Edward James Olmos",
         "Lou Diamond Phillips",
         "Rosanna DeSoto",
         "Andy García",
         "Estelle Harris",
         "Mark Phelan",
         "Virginia Paris",
         "Eliot",
         "Adelaida Alvarez",
         "Carmen Argenziano",
         "Rosanna DeSoto",
         "Bodie Olmos",
         "Vanessa Marquez",
         "Daniel Villarreal",
         "Graham Galloway"
      ],
      "imdbMovieId": "0094027",
      "originalTitle": "Stand and Deliver",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["PxkN_X4VUV4"],
      "plotSummary": "Jaime Escalante is a mathematics teacher in a school in a hispanic neighbourhood. Convinced that his students have potential, he adopts unconventional teaching methods to try and turn gang members and no-hopers into some of the country's top algebra and calculus students.",
      "tmdbMovieId": 29154,
      "avgRating": 3.73789,
      "releaseYear": "1988",
      "numRatings": 2787,
      "posterPath": "/rGG02Q77dDqm0nOKQfn2c49hZAK.jpg"
   }
}