{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "deer",
            "id": 7946
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "school",
            "id": 10873
         },
         {
            "name": "unwed mother",
            "id": 209090
         },
         {
            "name": "big sur",
            "id": 209091
         }
      ],
      "imdb_id": "tt0059674",
      "video": false,
      "title": "The Sandpiper",
      "recommendations": [
         103886,
         116314,
         368432,
         117897,
         170578,
         215401,
         103869,
         97318,
         168502,
         170623,
         107673,
         103130,
         79359,
         449065,
         143529,
         116696,
         132994,
         115360,
         252536,
         215902
      ],
      "backdrop_path": "/tuWl5cUQogiSFNhp4Nfe18TzXFs.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Laura Reynolds",
               "gender": 1,
               "credit_id": "52fe4982c3a368484e12f323",
               "name": "Elizabeth Taylor",
               "profile_path": "/kLSHCsowVnTvIbDD5Virb0yfLCW.jpg",
               "id": 3635,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Edward Hewitt",
               "gender": 2,
               "credit_id": "52fe4982c3a368484e12f327",
               "name": "Richard Burton",
               "profile_path": "/fRoBAQQP9sfnIYuqw546yFs3qKn.jpg",
               "id": 5341,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Claire Hewitt",
               "gender": 1,
               "credit_id": "52fe4982c3a368484e12f32b",
               "name": "Eva Marie Saint",
               "profile_path": "/9DpClOXbxSAsZiwsCnwIPA212pQ.jpg",
               "id": 2639,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Cos Erickson",
               "gender": 2,
               "credit_id": "52fe4982c3a368484e12f32f",
               "name": "Charles Bronson",
               "profile_path": "/hxZR2w0LXX47VKtxibDyZDsTAkH.jpg",
               "id": 4960,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Ward Hendricks",
               "gender": 2,
               "credit_id": "52fe4982c3a368484e12f333",
               "name": "Robert Webber",
               "profile_path": "/mg6SHDi5bi9C7pUwH14ZXxTnR7M.jpg",
               "id": 5255,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Danny Reynolds",
               "gender": 0,
               "credit_id": "52fe4982c3a368484e12f337",
               "name": "Morgan Mason",
               "profile_path": null,
               "id": 274912,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Walter Robinson",
               "gender": 2,
               "credit_id": "52fe4982c3a368484e12f33b",
               "name": "Tom Drake",
               "profile_path": "/26fzpI2BNUg2zxjmHuFmkyTdU31.jpg",
               "id": 13995,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Larry Brant",
               "gender": 2,
               "credit_id": "52fe4982c3a368484e12f33f",
               "name": "James Edwards",
               "profile_path": "/57hJbLy1mYXMcwYl3n13Tdpv0TW.jpg",
               "id": 3342,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "le juge Thompson",
               "gender": 2,
               "credit_id": "52fe4982c3a368484e12f343",
               "name": "Torin Thatcher",
               "profile_path": "/vO8Dw33jVxVU3gR1FWbgomrEmRB.jpg",
               "id": 10925,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Phil Sutcliff",
               "gender": 2,
               "credit_id": "52fe4982c3a368484e12f347",
               "name": "Douglas Henderson",
               "profile_path": null,
               "id": 14735,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "l'architecte",
               "gender": 2,
               "credit_id": "52fe4982c3a368484e12f34b",
               "name": "Paul Genge",
               "profile_path": "/h7Wei8sJnoRhT5QxwS3WCAMbRvr.jpg",
               "id": 153486,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4982c3a368484e12f31f",
               "name": "Vincente Minnelli",
               "profile_path": "/qUV0pO7Q1Vs9Jcvq0LWcqOERQ2H.jpg",
               "id": 13980,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5481ee1e9251414d21006590",
               "name": "Dalton Trumbo",
               "profile_path": "/2Ii27zuIjlzkqgs6dFS4SgsuNKH.jpg",
               "id": 11993,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5481ee2d9251414efa006bf9",
               "name": "Michael Wilson",
               "profile_path": "/bvIoOE2bASGvE2g7IlLUYP28QuU.jpg",
               "id": 13267,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.437804,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 77915,
      "vote_count": 19,
      "budget": 0,
      "overview": "A free-spirited artist (Elizabeth Taylor), who lives near California's Big Sur, meets the administrator (Richard Burton) of the parochial school that her young son attends and lures the cleric away from his wife (Eva Marie Saint).",
      "similar": [
         1259,
         24420,
         1024,
         276,
         1643,
         13523,
         226,
         44564,
         103663,
         17612,
         1903,
         68718,
         50544,
         50546,
         46705,
         13,
         38,
         86331,
         28178,
         19913
      ],
      "original_title": "The Sandpiper",
      "runtime": 117,
      "poster_path": "/wniIEcRiqsB18uPEF1zVwFc44Jy.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Venice Productions",
            "id": 32951,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Filmways Pictures",
            "id": 1138,
            "origin_country": ""
         },
         {
            "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
            "name": "Metro-Goldwyn-Mayer",
            "id": 21,
            "origin_country": "US"
         }
      ],
      "release_date": "1965-06-23",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "It was the right thing. It was the wrong thing. It was the only thing their hearts would allow.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Vincente Minnelli"],
      "runtime": 117,
      "synopsis": "Laura Reynolds (Elizabeth Taylor) is a free-spirited, unwed single mother living with her young son Danny (Morgan Mason) in an isolated California beach house near Big Sur. She makes a modest living as an artist and home-schools her son out of concern that he will be compelled to follow detrimental conventional social norms in a regular public school. Danny has gotten into some trouble with the law through two minor incidents (including shooting a deer), in her eyes innocent expressions of his natural curiosity and conscience rather than delinquency. Now with a third incident a judge orders her to send the boy to an Episcopal boarding school where Dr. Edward Hewitt (Richard Burton) is headmaster, and his wife Claire (Eva Marie Saint) teaches. At an initial interview, there is a momentary immediate attraction between Laura and Edward, but this quickly turns into tension brought on by their greatly differing world views and Laura's dislike of religion. Finally she storms out. She attempts to flee the area with her son but they are quickly picked up by police who take Danny to the school. He initially has trouble fitting in because his mother's home schooling has left him far in advance of boys his age in several subjects; the standard course of instruction at Edward's school leaves him restless and bored. At Claire's suggestion, Edward visits Laura to learn more about Danny and his upbringing. Laura's unconventional morals initially disturb Edward (such as modeling topless for an artist friend), as they conflict with his religious training. After visiting her several more times he finds that he wants her very much and cannot get her out of his mind. The two begin a torrid extramarital affair. Edward struggles with the guilt this produces while Laura encourages him to accept their love as right. Meanwhile, Danny flourishes after Edward relaxes school rules and allows the boy to choose more advanced classes. But one evening, the secret love affair is eventually exposed by a remark made to Edward in the presence of Claire by a jealous former lover of Laura's, and Edward is forced to confess all to his wife. At first Claire is distraught, but later they quietly discuss it in the light of how their lives have diverged from the idealistic religious fervor of the first years of their marriage. He says that he still loves her and that he will end the affair. They decide to separate for a while. When Edward tells Laura that he told his wife about their affair, she too gets angry over being the second woman in his life and tells them that their relationship is over too. A few days later, with the school year over, Laura tells Danny that they can move away for she has made enough money from her painting sales for them to leave. But Danny refuses for he has put down roots at the school and wants to stay there. She has a moment of pain but realizes her son's need to be free and agrees to stay where they are for now. Laura attends the school's year-end celibration where Edward announces that he has decided to resign his position at the school and decides to travel to find himself. In the final scene, on Edward's way out of town, he stops at her place for a silent farewell; Laura and her son down on the beach, Edward high up on the bluff above looking down at them. He waves goodbye and drives away, with a saddened Laura looking on.",
      "writers": [
         "Martin Ransohoff",
         "Irene Kamp"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0059674/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA0MzE0NzM1MF5BMl5BanBnXkFtZTcwMjA0MjAwMQ@@._V1_SY287_CR1,0,214,287_AL_.jpg",
      "actors": ["Stars: Elizabeth Taylor, Richard Burton, Eva Marie Saint | See full cast and crew »"],
      "reviews": [
         "Not only in \"Cleopatra\" but in her next two films as well, \"The V.I.P.s,\" and \"The Sandpiper,\" Taylor was more the world-famous celebrity and less the conscientious actress than at any other time in her career\u0085 The three movies exploit the public's fantasy of what the lovers must be like: tempestuous, as in \"Cleopatra;\" quarreling, on the verge of separation, as in \"The V.I.P.s;\" illicit lovers, defying the moral norms, as in \"The Sandpiper.\" As the ancient Queen of the Nile, as modern day grande dame, or as a hippie artist, Taylor is Taylor, hemmed in by her spectacular fame\u0085 The international celebrity, the world's most famous lover, takes over from the burgeoning actress of the Fifties, and Taylor walks through the movies as the fabled beauty she'd become rather than the high-strung Southern belle she had been before Rome\u0085 Playing an unmarried woman who lives with her son exactly the way she wants to live, in harmony with the California coast, Liz Taylor, for once, gets to talk about ideas: her character proclaims the joys of independence and self-expression\u0085 Taylor is no Jane Fonda, alight with radical fervor, but the role does express something of herself; it lets us see a side of her that differs from the standard screen Taylor\u0085 Here she's a 'new' woman, free and wise, who teaches a thing or two to a rigid churchman\u0085 The film's symbol is the sandpiper with a broken wing which she offers as proof that every creature should be allowed to fly free\u0085 We know too much about her to believe her as a hedonistic artist who would dress so fashionably in such an impossibly expansive beach house... The character's broad humanistic philosophy\u0097her objections to organized religion and to formal schooling, her advocacy of free love and her celebration of the naturalness of physical love\u0097are, oddly enough, at the film's center\u0085 The story that interrupts the characters ongoing declarations about life is the old number of a minister tempted by a beautiful woman\u0085 Bombarded by the artist's charms, the man succumbs, only to depart at the end, weighed down by, guilt and vowing to seek the way of repentance and purification\u0085The movie's morality is thus a mingling of the old and the new\u0085 The movie plays it both ways, admiring the woman's freedom and righteous self-justification, but making the clergyman pay dearly for his indulgence in forbidden fruit\u0085 It's an old Hollywood romance trying to masquerade as a love story in the modern manner\u0085 Burton's prude is impossible and he plays him in a harsh oratorical manner, as if he's deadening himself to the pain of it all, but Taylor's character almost approaches being a real rebel with ideas\u0085 The movie exploits the public image of her as a challenger of conventions, but the role also gives her a chance to sound reasonably articulate about matters other than love\u0085 Under Vincente Minnelli's graceful guidance, Liz is sweet if not entirely convincing\u0085",
         "I liked the movie. Sorry, but the dialogue and themes are not shallow; they are profound. It is just that we like to avoid facing such deep concepts. This is a movie that dares put forth the idea of atheism, and so therefore it is much deeper that most other movies. How can most of the fluff that comes out today be compared to The Sandpiper. Furthermore, the dialogue concerning personal feelings is also profound and touches upon feelings the vast vast majority of movies never approach. Good movie, but be prepared for deliberately provocative themes.",
         "Taylor's physical allure is best captured by the wooden sculpture done by Kara for the film. Burton reprises a similar role to his magnificent one of a defrocked priest in \"Night of Iguana\"--only here he is not eventually defrocked. Burton is superb at showing internal turmoil and it is a shame that so many good performances, many of which were nominated for an Oscar (7 in all), were all bypassed by the Academy. Minnelli must have cast Burton for the role after Huston's success with Burton in \"Iguana\". Taylor's agnostic rebellious life and Burton's religious moral life explode on contact and tower over all the other actors in this movie. Though Minnelli is respected for his direction, this effort of his will not be considered a major work. Eva Marie Saint's role is elegant but not developed beyond the obvious--where are her sons mentioned in the dialogues? What's her relationship with them? Minnelli obviously took interest in the main plot, not the subplots--which is strange for an accomplished director. The screenplay at times is very strong, e.g., with Burton's clever intonations of his repartees quoting the \"Book of Proverbs\" and the young child innocently reciting Chaucer in \"Olde English\". In retrospect the film had good tools: a good script and a good cast. But the tools in the hands of Minnelli did not sculpt a great Kara statue.",
         "\"The Sandpiper\" is not a great movie but it has a certain appeal and is graced by some beautiful seascapes along the rugged Big Sur coastline. The opening sequence, a montage of steep emerald hills and deep blue sea shot from a helicopter, is particularly well done, featuring a deer dashing up one of the oak-covered slopes, building swells breaking on the rocky shore, and one or two fiery red sunsets. Similar scenes continue to bolster the sense of setting throughout the movie. The storyline, although interesting, can't quite live up to the dramatic natural location. The love affair between Richard Burton, a jaded Episcopalian priest and headmaster at a boys school in San Simeon, and Elizabeth Taylor, an alienated artist seeking peace and solitude at an isolated beach house, is reasonably convincing. Yet the priest already has a comely wife in the form of Eva Marie Saint and his motivation for stepping outside their marriage isn't well explained, except that he wants to recapture the idealism of his youth. When a local judge orders that Taylor's troubled son must attend Burton's school, he is almost instantly attracted to her and apparently there is nothing to be done about it. Set in the mid-sixties, when sexual morays were loosening but we were still in the grip of a churchy moralism, this had to be a controversial film, and I vaguely recall that it was. You can visit the locations used in the movie because some are easily recognizable, such as the store/club/restaurant in Big Sur known as \"Nepenthe.\" And of course, there are the famous stone bridges on Highway One spanning two or three of the rugged chasms. Coursing through the movie, especially during the several seascapes, is the theme \"The Shadow of Your Smile.\" It's a nice movie, if not a great one, and worth seeing more than once.",
         "\"The Sandpiper\" was the second in a number of films (\"The VIPs\" was the first) made together by Richard Burton and Elizabeth Taylor. Their romance, which had begun on the set of \"Cleopatra\", had both enthralled and scandalised the public, and the studios wanted to make the most of their notoriety. The public perception of Dick and Liz as a glamorous but scandalous couple can only have been increased by the subject-matter of \"The Sandpiper\". At one time a film about a clergyman engaged in an adulterous affair would have been an unthinkable violation of the Production Code. By 1965, however, the Code, although not quite dead, was no longer in robust health, and a film on this subject, although still highly controversial, was no longer impossible. Taylor's character, Laura Reynolds, is an unmarried mother who works as an artist and lives with her nine-year-old son Danny in an isolated California beach house. (The film's title derives from an injured sandpiper which she rescues and nurses back to health thereafter and becomes a symbol of freedom). Danny's behaviour, however, has got him into trouble with the law, and a judge orders her to send the boy to a local boarding school. Laura is reluctant to do this; she is a free spirit who distrusts any form of institutionalised education. To make matters worse from her point of view, the school is run by the Episcopalian Church, and she is an atheist whose attitude to religion is one of positive hostility rather than mere indifference. Nevertheless, she realises that she must comply with the judge's order or risk losing custody of her boy. Burton plays Dr. Edward Hewitt, an Episcopalian priest and headmaster of the school. Although his values are very different from Laura's, Edward is something of an idealist and is becoming disillusioned with his life at the school, feeling that he is neither a priest nor an educator but merely a fund-raiser. (The school is currently engaged in a major fund-raising drive to build a new chapel, something Edward feels is unnecessary). Edward takes a great interest in Danny's progress and finds himself increasingly drawn towards Laura, possibly because she is so different both from him and from his wife Claire. Claire is attractive and supportive of her husband but rather staid and conventional compared to the bohemian Laura. Eventually Edward and Laura begin an affair, even though he is a married man. (This plot line reminded me of Iris Murdoch's novel \"The Sandcastle\", published a few years before \"The Sandpiper\", which also dealt with an adulterous affair between a married older schoolmaster at a boarding school and a young female artist). Danny himself does not play a major role, being more of a plot device than a character in his own right. I felt that this was a weakness, given that one of the themes of the film is two different philosophies of education. Laura's view is that all formal educational establishments, particularly conservative boarding schools like Dr Hewitt's, are undesirable because they exist in order to turn children into conventional conformists. Her own solution, however, home-schooling Danny in a remote part of the world away from any other children and without a father-figure in his life, struck me as being likely to turn him into a self-centred loner, although the film rather shies away from criticising Laura on this point. The opening scenes in which Danny shoots a deer strike a particularly jarring note. It seemed to me highly improbable that a woman like Laura, whose whole philosophy seems to be one of living in harmony with nature, would allow her young son to have a rifle and then, when he uses it to kill an animal out of wanton curiosity, shrug the whole thing off as a harmless youthful escapade. Elizabeth Taylor looks stunning, but neither she nor Burton are really at their best here. Burton is certainly not as good as he was as the world-weary spy in \"The Spy Who Came in from the Cold\", also made in 1965. The relationship between Edward and Laura is not based simply upon sexual attraction, but upon a growing realisation that despite their differences they are kindred spirits. The unbeliever Laura, paradoxically, has more in common with Edward's Christian idealism than does the conventionally pious Claire. The trouble is that one never really senses in Burton's performance the idealistic religious believer hiding behind the mask of the formal and pedantic schoolmaster. Taylor always comes across as slightly too glamorous to be altogether convincing as a proto-hippie. The film contains some attractive photography of the Californian coastal scenery (although the colours in the indoor scenes are often rather dull) and there is a notable musical score, including the song \"The Shadow of Your Smile\". As a psychological and emotional drama it has its points of interest, but overall it is a rather dated sixties period-piece, most interesting as a record of that decade's official Golden Couple. 6/10",
         "Ok, I admit it. I have a guilty affection for this film. It's silly and shallow, but it's got a great performance by Richard Burton, and a pretty good one by Elizabeth Taylor. It's also gorgeously filmed in Big Sur country, and has an evocative soundtrack. \"The Sandpiper\" was filmed at the height of the Burton/Taylor mania. Richard plays a minister who runs an exclusive boys academy, and Liz plays the free-thinking artist mother who's son (Morgan Mason, James Mason's son) does some deer hunting out of season. The boy is sentenced to Burton's school to be saved from his mother's beatnik influence, and as the boy settles into life at the boarding school, Liz falls in love with the married minister Burton. They have a torrid affair, afternoons along the surf, etc., until a jealous colleague of Burton's blows the whistle on the pair. Corny, but I still love the movie.",
         "The story in this film is worth telling, but the script seems to take forever to tell it. Lots of explanatory dialogue bogs the film down, and there's really only enough story for maybe a one-hour television drama. One good aspect of it is it would be very easy to make this a one-sided film in which the Big Bad Headmaster (with a Soft Spot) takes away the child of sweet, free-spirited Elizabeth, but Taylor and Burton play their characters in ways that we could sympathize with either of them--or not. Unfortunately, \"or not\" is a very distinct possibility. First of all, the boy in question does not exude a persona that's engaging in any way. (And what he does in his first scene certainly does not endear him to the audience.) And secondly, there's nothing really compelling enough about any of the other characters either. (Eva Marie Saint's character would be a possible exception if she had more screen time.) They're just varying degrees of liberal and conservative clichés. While Vincente Minnelli was really incapable of making a truly awful film, given his talent--and the talent we would see in Taylor and Burton the following year in Who's Afraid of Virginia Woolf?--this can't be seen as anything but a disappointment. But it's not a total failure either. If you're initially interested, Maybe you'll stay with it. If not, you'll be totally bored. Note: This film gave us the Oscar-winning song, \"The Shadow of Your Smile.\" But none of the characters smile much, so it makes little to no sense when the Studio Singers perform it over the end credits. But it works as a score.",
         "For their third film together (and their first as a newly-married couple), the Burtons chose one of the most infamous bad movies of all-time, the hilariously misguided effort THE SANDPIPER (1965). The film had a great pedigree starting with director Vincent Minnelli (who helmed such classics as 1944's MEET ME IN ST. LOUIS, 1958's GIGI, and even 1970's criminally underrated ON A CLEAR DAY YOU CAN SEE FOREVER), and great supporting cast featuring Eva Marie Saint, Charles Bronson, Robert Webber, and James Edwards. Unfortunately, the film misses the mark on almost every occasion, undermining a potentially interesting love story with poorly-developed characters and cornball dialogue. I won't spend the time discussing the film's clumsy attempts as addressing such complex issues as theology, which are handled even worse than the central love triangle. In all fairness, Burton has the right degree of sullenness to play the conflicted reverend, but the script gives him little else to do other than appear solemn. Burton is unarguably one of the greatest acting talents of his time, but this character is so one-note that even he cannot save it. Unfortunately, Taylor fares even worse \u0096 although she does display a believable rebelliousness that is necessary for her role of the free-spirited, agnostic artist, she is simply out of her element amongst the mid-sixties beatnik scene. No matter how hard she tries, it simply impossible believe a glamour queen like Taylor as a shack-living, bra-burning hippie, and the characterization only becomes less convincing and more ridiculous as the movie goes on. In the supporting cast, only Robert Webber's villainous Ward makes much of an impression, as Eva Marie Saint is completely wasted as Burton's wronged wife and Charles Bronson is as miscast as Taylor as a sexually ambiguous sculptor. Even with its terrible dialogue, leaden plotting, and unconvincing performances, The Sandpiper is still certainly watchable. The location footage of the Big Sur is sometimes breathtaking and the Oscar-winning theme song \"The Shadow of Your Smile\" is memorable, but these attributes alone cannot lift the movie out the realm of being a \"bad movie classic.\" Despite it's dubious quality and unanimously bad reviews from critics (or maybe because of them), THE SANDPIPER was yet another significant hit at the box office for the Burtons.",
         "I absolutely adore this film and cannot wait to get it on DVD. I think that not only the scenery, plot, characters and music make it so lovely, but the strength of the relationship between Elizabeth Taylor and Richard Burton which is so obvious and was happening in real life at the same time. Roll on December, which is when I have been told it is going to be released on to DVD. One of my favourite films and really romantic! Richard Burton is brooding, moody and so strong, and Elizabeth Taylor is such an independent character and yet she loves to be loved too, as long as her wings are not clipped. She is like the sandpiper that she looks after then lets free. A free spirit, just like her son.",
         "Richard Burton dials down the angst quotient from his previous year's role as a defrocked priest in \"Night of the Iguana\", and Elizabeth Taylor begins warming up for her later role as Kate in \"Taming of the Shrew\". The music and the scenery make the film compelling enough to watch, but the psychological and theological ramblings are strictly for the soap lover. Eva Marie Saint, as the hurt wife, has a few good scenes but not nearly enough to salvage the drama. And it's fun to see a young Charles Bronson in a beatnik role. The whole effort ranks several notches above \"The VIP's\" and other Burton-Taylor vehicles but all in all, \"The Sandpiper\" is a long boring day at the beach."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Metro-Goldwyn-Mayer (MGM)",
         "Filmways Pictures",
         "Venice Productions"
      ],
      "summaries": [
         "Twenty-something Laura Reynolds is a free spirit who questions social conventions, laws and regulations. A struggling artist, she lives in a secluded beach-side cabin in Big Sur with her nine year old illegitimate son, Danny, on who she has instilled her values. Because of this questioning of convention, Laura has decided to home school Danny. Also because of this questioning of the law, Danny runs into some legal problems, and as such is court ordered to be sent to San Simeon, a Christian school in Monterey. This order is against Laura's wishes. The school's headmaster is Dr. Rev. Edward Hewitt, who tries to convince Laura that San Simeon is not the prison she probably believes it to be. Married for twenty-one years to his faithful wife Claire, Edward has become more a fund-raiser at all cost (for a new chapel) rather than an educator or priest. Despite their differences, Laura and Edward begin to fall for each other. Both but especially Edward have to reconcile their feelings for each other to their beliefs, which they learn are closer to each other than what may appear on the surface. Their feelings also bring to the forefront what each really wants in life beyond their current lot.",
         "Young Danny Reynolds and his mother Laura live an idyllic life near California's Big Sur. Laura teaches Danny at home. After Danny shoots a deer, authorities take the boy away to live and study in a parochial orphanage/school. The unwed mother is distraught. At first, the school administrator, Episcopalian Priest Dr. Hewitt, finds the free-spirited Laura to be morally bereft and without redeeming value. Eventually, Laura and Dr. Hewitt fall in love and begin an illicit affair.",
         "A free-spirited single mother forms a connection with the wed headmaster of an Episcopal boarding school in California."
      ],
      "budget": 5300000
   },
   "movielensId": 3073,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1965-06-23",
      "dvdReleaseDate": "2006-12-05",
      "directors": ["Vincente Minnelli"],
      "runtime": 117,
      "movieId": 3073,
      "title": "The Sandpiper",
      "mpaa": "",
      "actors": [
         "Elizabeth Taylor",
         "Richard Burton",
         "Eva Marie Saint",
         "Charles Bronson",
         "Robert Webber",
         "Morgan Mason",
         "Tom Drake",
         "James Edwards",
         "Torin Thatcher",
         "Douglas Henderson",
         "Paul Genge"
      ],
      "imdbMovieId": "0059674",
      "originalTitle": "The Sandpiper",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["gjYTocBozao"],
      "plotSummary": "A free-spirited artist (Elizabeth Taylor), who lives near California's Big Sur, meets the administrator (Richard Burton) of the parochial school that her young son attends and lures the cleric away from his wife (Eva Marie Saint).",
      "tmdbMovieId": 77915,
      "avgRating": 3.35989,
      "releaseYear": "1965",
      "numRatings": 182,
      "posterPath": "/wniIEcRiqsB18uPEF1zVwFc44Jy.jpg"
   }
}