{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "loss of loved one",
            "id": 697
         },
         {
            "name": "rocky mountains",
            "id": 2805
         },
         {
            "name": "cabin",
            "id": 3623
         },
         {
            "name": "survival",
            "id": 10349
         },
         {
            "name": "snow",
            "id": 10794
         },
         {
            "name": "mountain man",
            "id": 208692
         }
      ],
      "imdb_id": "tt0068762",
      "video": false,
      "title": "Jeremiah Johnson",
      "recommendations": [
         11509,
         8879,
         10747,
         14881,
         11901,
         12584,
         5916,
         11040,
         22383,
         10518,
         17689,
         26170,
         11577,
         5693,
         11942,
         9967,
         983,
         16121,
         576,
         11916
      ],
      "backdrop_path": "/1UuXXbXd5GvO1hQuMW3rEko1ymd.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "590d6c96c3a36864c600a883",
         "content": "The Rocky Mountains are the marrow of the World.\r\n\r\nJeremiah Johnson is directed by Sydney Pollack and is inspired by two books, Raymond Thorp and Robert Bunker's Crow Killer: The Saga of Liver-Eating Johnson and Vardis Fisher's Mountain Man. Script was written by John Millius and Edward Anhalt and cinematography is by Duke Callaghan. It stars Robert Redford, Will Geer, Stefan Gierasch, Delle Bolton and Josh Albee.\r\n\r\nHardened after the war with Mexico, and fed up with everyday life, American Jeremiah Johnson (Redford) leaves civilisation behind to live life as a mountain man. He intends to be self-sufficient as a trapper, but he finds that mother nature can be tough, and out here in the mountain wilderness he is not alone. There are others here, and Jeremiah must face many challenges if he is to truly survive.\r\n\r\nFilmed entirely on location in the vast wilderness beauty of Utah, Jeremiah Johnson is light on plot but all the better for it. Film basically constitutes Redford's mountain man learning to survive up in them thar mountains, and, earning the right to do so. A number of issues will arise to test his metal, giving him a number of hardships and adventures to define his transformation from average Joe to a fully fledged mythical man of the Earth. Redford is wonderfully at ease in the title role, and very quickly he gets the audience on side to share in his journey. But ultimately it's the landscapes that you take away from this movie. Not only gorgeous, but also the critical character that frames Johnson during his isolation and battle for survival. 8/10",
         "url": "https://www.themoviedb.org/review/590d6c96c3a36864c600a883"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jeremiah Johnson",
               "gender": 2,
               "credit_id": "52fe44a59251416c7503c1e7",
               "name": "Robert Redford",
               "profile_path": "/b4mJIBWvEyzB8yyZWbmvfzwrdtp.jpg",
               "id": 4135,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Bear Claw",
               "gender": 2,
               "credit_id": "52fe44a59251416c7503c1eb",
               "name": "Will Geer",
               "profile_path": "/nRUlnwLt5rNZLsb1u3ZLp0AiPU5.jpg",
               "id": 70990,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Swan",
               "gender": 0,
               "credit_id": "52fe44a59251416c7503c1ef",
               "name": "Delle Bolton",
               "profile_path": "/aoelNHkaitLYhGeHKmqsGdYN6yD.jpg",
               "id": 70991,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Caleb",
               "gender": 2,
               "credit_id": "52fe44a59251416c7503c1f3",
               "name": "Josh Albee",
               "profile_path": "/aXuUsVMhqvfWSGeTmRPFeNYUaCR.jpg",
               "id": 70992,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "Paints His Shirt Red",
               "gender": 2,
               "credit_id": "52fe44a59251416c7503c233",
               "name": "Joaquin Martinez",
               "profile_path": "/uz2DcuAPULU77T2PZrqkR4TfG8m.jpg",
               "id": 84240,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Crazy Woman",
               "gender": 1,
               "credit_id": "52fe44a59251416c7503c237",
               "name": "Allyn Ann McLerie",
               "profile_path": "/tVkJUSsKrPlAullwRfpit2RHfW4.jpg",
               "id": 76382,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Del Gue",
               "gender": 2,
               "credit_id": "52fe44a59251416c7503c23b",
               "name": "Stefan Gierasch",
               "profile_path": "/y4w2yNJYdAcaKddQyCYm4qtmLqO.jpg",
               "id": 52463,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Chief Two-Tongues Lebeaux",
               "gender": 2,
               "credit_id": "52fe44a59251416c7503c23f",
               "name": "Richard Angarola",
               "profile_path": "/VoyeQP3xKNuYnV7aaHxjBRwQ91.jpg",
               "id": 122007,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Reverend Lindquist",
               "gender": 2,
               "credit_id": "52fe44a59251416c7503c243",
               "name": "Paul Benedict",
               "profile_path": "/Al8zMhyw1EpWVySU0XONYGfXcvB.jpg",
               "id": 41243,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Robidoux",
               "gender": 2,
               "credit_id": "554372d7c3a3680ce3001b03",
               "name": "Charles Tyner",
               "profile_path": "/6OHlhUQcMXIMIkqIskBw4tK2Mp7.jpg",
               "id": 4974,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Lieutenant Mulvey",
               "gender": 2,
               "credit_id": "554372efc3a3680cdf001c7f",
               "name": "Jack Colvin",
               "profile_path": "/A2AJJXaJX64u1e7y60FzJWEzDcw.jpg",
               "id": 19139,
               "order": 10
            },
            {
               "cast_id": 23,
               "character": "Qualen",
               "gender": 2,
               "credit_id": "55437304c3a3680ce3001b08",
               "name": "Matt Clark",
               "profile_path": "/aG7tC3jOI42OgtCxGiejbhFj1DW.jpg",
               "id": 2454,
               "order": 11
            },
            {
               "cast_id": 24,
               "character": "Qualen's daughter",
               "gender": 0,
               "credit_id": "5543731d925141586d001c1b",
               "name": "Tanya Tucker",
               "profile_path": "/8HGFKNU3cxV0oH4wtgaWqPmYCm.jpg",
               "id": 193654,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe44a59251416c7503c1f9",
               "name": "Vardis Fisher",
               "profile_path": null,
               "id": 70994,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a59251416c7503c1ff",
               "name": "John Milius",
               "profile_path": "/Aj1eweha4qvMJ1aIuSa24shcvWc.jpg",
               "id": 8328,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a59251416c7503c205",
               "name": "Edward Anhalt",
               "profile_path": null,
               "id": 70997,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a59251416c7503c20b",
               "name": "David Rayfiel",
               "profile_path": null,
               "id": 11056,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a59251416c7503c211",
               "name": "Joe Wizan",
               "profile_path": null,
               "id": 21024,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44a59251416c7503c217",
               "name": "Tim McIntire",
               "profile_path": "/by3ZgApPcmHVuNur19K5Vw8Z33a.jpg",
               "id": 39998,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a59251416c7503c21d",
               "name": "John Rubinstein",
               "profile_path": "/jyHEmKDxlCCxWnsM8hPoCpj0Bn.jpg",
               "id": 44261,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a59251416c7503c223",
               "name": "Duke Callaghan",
               "profile_path": null,
               "id": 57550,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a59251416c7503c229",
               "name": "Thomas Stanford",
               "profile_path": null,
               "id": 37880,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a59251416c7503c22f",
               "name": "Sydney Pollack",
               "profile_path": "/zxkoU2diKtvarV1Qk4z9He2lJj9.jpg",
               "id": 2226,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Western",
            "id": 37
         }
      ],
      "popularity": 6.603987,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11943,
      "vote_count": 159,
      "budget": 0,
      "overview": "A mountain man who wishes to live the life of a hermit becomes the unwilling object of a long vendetta by Indians when he proves to be the match of their warriors in one-to-one combat on the early frontier.",
      "similar": [
         281957,
         290512,
         9350,
         44363,
         1562,
         372343,
         5176,
         335,
         425,
         253412,
         120,
         675,
         44115,
         10212,
         309050,
         1374,
         334,
         75174,
         275,
         637
      ],
      "original_title": "Jeremiah Johnson",
      "runtime": 108,
      "poster_path": "/i2wo9M885KcSljpbut24xZCx05r.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Sanford Productions (III)",
            "id": 12273,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1972-09-10",
      "vote_average": 7.5,
      "belongs_to_collection": null,
      "tagline": "His Mountain. His Peace. His Great Hunts. His Young Bride. With All That, It Should Have Been Different.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Sydney Pollack"],
      "runtime": 108,
      "synopsis": null,
      "writers": [
         "Vardis Fisher",
         "Raymond W. Thorp"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0068762/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc2NDQ5MTA1Nl5BMl5BanBnXkFtZTcwNDEzODQ2Mw@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Robert Redford, Will Geer, Delle Bolton | See full cast and crew »"],
      "reviews": [
         "Jeremiah Johnson is a starkly simple story well told. It is the journey of a man who seeks to re-make himself. Johnson becomes disillusioned, like Thoreau and even Ulysses S. Grant, by the Mexican War and deserts to become a mountain man. There he finds the Rockies starkly beautiful and completely without mercy for him or anyone else. Will Geer plays the older trapper who teaches the 'Pilgrim,' a very solid performance by Redford, how to survive. The film's treatments of Whites and Native Americans is profoundly even handed, and Milious's fingerprints are noteworthy in the robust and calculated course of the narrative.",
         "This is one of my all time favorite movies and evokes so much emotion from my childhood. My father and I have watched this movie at least 10 times together and it never gets boring. It reminds me of my days when we used to go on hikes in the woods and we would sing the theme song with me in my little coonskin (it's fake for all you animal lovers) cap. I just cannot get enough of this movie. It grows on my every time I watch it. It is one of if not the best Robert Redford movie ever. He does a fantastic job in this movie. The scenery is beautiful and makes me wish I was there in that unspoiled area. The dialogue, though there is very little compared to other movies, is brilliant. The old adage quality not quantity fits this movie to a tee. There are numerous one liners that have been incorporated into my everday vocabulary. \"You cook good rabbit pilgrim.\" \"....the Rocky Mountains are the marrow of the world...\" \"Watch your top notch.\" \"Watch Yur'n.\" I could go on and on. Each character is colorful in it's own distinct way, making even the most insignificant ones unforgettable. The theme music is both haunting and beautiful and I've been looking to buy or download the soundtrack so if anyone knows where I could send me an e-mail. Not only does this movie have great characters,acting, dialogue, music, and scenery, but it also is filled with action and has several interjections of humor. I feel as though this is one of the greatest movies of all time and the special moments you share with your family watching it, just make this movie even better. (A 9/10).",
         "A film which is glibly categorized as a `western' but goes somewhat deeper than that. The Pollack/Redford combination works well, and the photography of those magnificent mountains of Utah is spectacular. With all that beautiful scenery in Montana, Nevada, Colorado, Utah, I am surprised that the US government never does very much for saving it and cleaning up all that contamination \u0085\u0085.. Thirty years on and after several viewings, I find this story grows on you, like the aging of fine wine in oak casks, such that another recent viewing gave me as much \u0096 if not more \u0096 pleasure. Precisely because it is not the standard `western' formula. One gets a little tired of John Wayne getting saddle-sore, killing indians and wooing women; at times watching `Jeremiah Johnson' I cannot help comparing a little with `Dances with Wolves' (qv), not because of any story similarity but more from certain situations being played out. Robert Redford has given us numerous films in which his characterization is pretty good in general, but in this film I rather fancy he was inspired, even to the point of throwing off that silly category so beloved of those suffering Hollywooditis. Most notable in `The Sting' (qv), `All the President's Men', `Out of Africa', and `A River Runs Through it', without forgetting his excellent directing of `Ordinary People', one of the best true-life dramas I have seen. `Jeremiah Johnson' is now one of the classics of the genre and even of cinema as a whole: always worth another viewing.",
         "Filmed in the snow-covered vastness of the Utah Rocky Mountains, Robert Redford plays well a deserter from the Mexican War who wages a bitter struggle against the elements and Indians in order to lead a life of solitude\u0085 He heads into the mountains, only to find that there is the wind that never seems to stop\u0085 Sometimes he swears he is going insane while the storms that he has never seen screech booming with their thunder\u0085 Around him, snow squalls that kill everything that is unprepared\u0085 Jeremiah's first winter proves almost fatal because of his inexperience in coping with the harsh Rockies\u0085 Fortunately, he meets a real mountain man seasoned to the ways of the wild\u0085 Bear Claw takes Johnson in and shares his knowledge with him\u0085 Travelling the untamed wilderness, Jeremiah finds out that it is a land fit only for the savages, and he has seen what they are like\u0085 But he has seen worse when he happens upon an Indian massacre of a settler's family or upon a bald man buried to his neck in sand by Blackfeet Indians\u0085 And much worse after violating the Crow sacred burial ground while helping cavalry men find some lost settlers\u0085",
         "I have always considered this one of my favorite \"rainy Saturday afternoon\" movies. The scenery is wonderful, Redford does one of his best performances, the characters are colorful, and it is a wonderful story of the pioneer spirit. Then, a few years ago, a good friend told me he had the book about the real \"Liver Eatin' Johnson\", about whom this movie was made. He lent me the book to read - and I highly recommend it for anyone interested in a first- and second-hand story of the old west. The real story of Johnson is greatly removed from the movie, though there are many parts in common as well. Most notably absent is the fact that Johnson would remove and partially eat the liver (raw) of the Crow braves he would kill. This was done by Johnson to scare the Crow, who believed their soul would wander the earth forever if the body was not buried intact. Johnson was also known to have eaten meat from the leg of a Blackfoot indian, whose tribe had captured him to sell to the Crow. This incident, however, appears to have been more for survival, as Johnson had to travel for several days through snow on foot after escaping the Blackfoot. Johnson was a well traveled man, friend to more than the movie suggests, and finally died of old age in Los Angeles in 1899. His actual age is subject to dispute, but he was at least 75 yeard old. During his long life, he met up with many recognizable characters from the old west. I leave the names for you to discover in your reading - it is well worth the time!",
         "Sydney Pollack's return to the western four years after THE SCALPHUNTERS was to be a completely different experience. Following the trials and tribulations of a deserter of the Mexican War who disappears in the Rocky Mountains of Colorado to become a mountain man, JEREMIAH JOHNSON eschews the conventions of the western as a genre in such a way as was only made possible for American cinema in the tumultuous era of early 70's with such visceral movies of frontier survival as MAN IN THE WILDERNESS and A MAN CALLED HORSE paving the way. As Jeremiah Johnson (Robert Redford) wanders the mountains like a fugitive stricken by disaster, a solitary figure against awe-inspiring backdrops of massive rock formations, steep ravines and expansive mesas, you can tangibly feel the film, like the hero, transcending the specific time and place and breaching out vision to become an all-encompassing spiritual journey where the individual characters - fur trappers, bear hunters or Indians - are merely the unwitting parners in a dance of death. Some viewers may be put off by the lack of straight-forward plot, the episodic, repetitive nature of the movie or the long stretches of silence, but it's from those exact things the movie takes its power. JJ comes unto its own in those small moments of quietude, in Johnson's silent encounters with indians, in the barren, unforgiving wastes of the craggy mountains that reflect so well the psychology of characters wandering in their shadow, in the subtle, heartwarming interactions Johnson has with the Indian woman he's taken for a wife and the mute boy he's taken for a son. There's hardly a word uttered between this peculiar family the entire movie but the ways they learn to overcome the barriers that separate them is a touching sight to behold. There is some dated montage, a corny soundtrack; how much of this will affect your enjoyment will boil down to your affinity with how cinema was in the 70's. Still, what is left is this beautiful parable of broken humans learning to be whole again. Equal parts visceral, savage and heartwarming.",
         "There are many films which personify the era of the Mountain Man. This is perhaps one of the best. The reason why it is at the top of the list, is due in part to director Sydney Pollack's selection of natural wonders, majestic scenery and simplistic storyline. The movie tells the story of Jeremiah Johnson (Robert Redford) a veteran of the Mexican American war who decides to journey into the High Alpine Rockies to become a Mountain Man. Based very loosely on the novel by Vardis Fisher, the hero seeks the life of a trapper which offers Solace, wild adventure, aboriginal encounters and a chance for legendary exploits. During the first years of his experience, Johnson is befriended and threatened by both Native Americans and crazed mountain veterans who teach him and endanger him as well. Among the best is 'Bear Claw, Chris Lapp' (Will Geer), 'Paints His Shirt Red' (Joaquin Martinez) and Del Gue (Stefan Gierasch). (Delle Bolton) plays Swan and Josh Albee) is Caleb who become part of an instant family. The film is quite picturesque in its beautiful seasonal settings and entertaining to anyone seeking a chapter in the bygone era of a vanished breed. ****",
         "Jeremiah Johnson is made in the mold of what movies should be. In an era of blockbusters and CGI graphics it's nice to see a movie that gets back to basics. Jeremiah is an ex army man who moves to the Rockies to start over. He starts out as a novice in the ways of the woods. With the help of Will Geer (Grandpa Walton) Jeremiah forges himself a place in the wild. The ending is kind of sad but I won't go into any details. This movie doesn't go into great detail about his subsequent rampage on the local Indian population. But if I wanted a documentary then I would watch the history channel. Anyway Jeremiah Johnson is a great movie to watch on a cold night when the wind is blowing and it's good to be inside. For a good adventure Jeremiah Johnson is one to watch again and again.",
         "This extraordinary Western results to be a slice of life about a hermit man and a hostile environment .The picture narrates the odyssey of an adventurer that one time dreary of civilization goes to Rocky Mountains becoming into mountain man , a young who is part of the wildlife of the landscape.He early develops his senses from his first feeble and failed attempts at survival to an expert hunter who shoots efficiently his preys and turning into an exciting new myth , the great Jeremiah Johnson . When he trespasses holy land is continuously pursued by Indians and vice versa, because he seeks vengeance , going on a relentless chase. Meanwhile the Indians attack his farm. Crow Indians set out to track down the mountain man on savage raids until an inconclusive final . Solid western with interesting events , violent fights , emotions , thrills and spectacular outdoors . From the initiation until the final are proceeded continuous battles against nature and a survival fighting versus wintry wilderness , enemy trappers and savage Indians, among others . The story is a crossover of various films, the battle against nature of ¨Man of a wilderness land¨ and Indians as ¨ Man called horse ¨ and the obstinacy and stubbornness of relentless enemies who fight with no rest such as ¨The duelists¨. The magnificent cast is starred by an excellent Robert Redford , a simple man who has no taste for cities and becomes a tough and two fisted mountain man obsessed a bloody revenge . Supporting cast is featured by various actors in brief performances as Jack Colvin , Matt Clark , Charles Tyner and special mention to Will Geer as feisty old trapper . Splendid cinematography in Panavision and glimmer Technicolor by Duke Callagham as is reflected on spectacular outdoors filmed in sighting, rousing natural parks from Rocky Mountains. Lively and evocative musical score by usual secondary actor John Rubinstein and beautiful songs by also actor Tim McIntire . The motion picture is stunningly directed by the recently deceased Sidney Pollack (Yazuka, Three days of the condor, Way we were, Out of Africa). Rating : Better than average . This outstanding film will appeal to Robert Redford fans and landscape lovers .",
         "Jeremiah Johnson is unlike most films of its kind, which is a subgenre of the adventure film that follows a lone mountain man disillusioned by society who escapes to the frontier in order to become one with nature and reinvigorate himself. Strange how women never do this. Anyways, Robert Redford is surprisingly effective as the quiet, tough and determined title character who remains focused on his ultimate goal of remaining aloof and alone from all connections to anyone. Unfortunately, he is bamboozled into a most peculiar family situation involving a mute son of a crazy pioneer woman and the daughter of a French-speaking Native American chief. In the end, what director Sydney Pollack is all about is showcasing how nature can indeed salve some of our pain and make us feel more comfortable with our situations. Nevertheless, true relationships with people cannot be substituted. Beautiful photography, strong performances and a most intriguing storyline all help create a very interesting film that is worth multiple views and considerable think time."
      ],
      "genres": [
         "Adventure",
         "Drama",
         "Western"
      ],
      "productionCompanies": [
         "Sanford Productions (III)",
         "Warner Bros."
      ],
      "summaries": [
         "A mountain man who wishes to live the life of a hermit becomes the unwilling object of a long vendetta by Indians, and proves to be a match for their warriors in one-on-one combat on the early frontier.",
         "During the mid-nineteenth century, Jeremiah Johnson, after a stint in the US Army, decides that he would prefer a life of solitude and more importantly peace by living with nature in the mountains of the frontier of the American west. This plan entails finding a piece of land upon which to build a house. This quest ends up being not quite what he envisioned as he does require the assistance of others to find his footing, and in turn he amasses friends and acquaintances along the way, some who become more a part of his life than he would have imagined. Perhaps most importantly, some of those people provide him with the knowledge of how to co-exist with some of the many Indian tribes, most importantly the Crow, on whose land in Colorado Jeremiah ultimately decides to build his home. But an act by Jeremiah upon a request by the US Cavalry leads to a chain of events that may forever change the peaceful relationship he worked so hard to achieve with his neighbors and their land.",
         "An American soldier goes west to escape the Mexican War and becomes a mountain man. He is befriended by a wily old trapper who teaches him how to survive. After unavoidably violating an Indian burial ground, he loses his new Indian wife and their adopted child to the Indians' revenge, and a vendetta between him and the Crow tribe ruins his idyllic life as a fur trapper. Gorgeous scenery and a great role for Will Geer in a thoughtful meditation on the American West.",
         "This tale of isolation in the great rocky mountains, perhaps reflects America's mood as the Vietnam war was coming to a close as much as anything else. Johnson, seemingly war weary, yet with a sense of respect for indigenous cultures as if one informs the other. The only thing he seems to want is to share utopia with those who were there before him and perhaps leave his implied past behind. But even in the vacuum of an isolated life, Jeremiah Johnson seems doomed by threads to culture he cannot completely escape. As with \"Butch Cassidy and the Sundance Kid,\" one can't help but feel that along with Indians and animals with which he shares the land, \"A Brave New World will soon rush in and overrun them all."
      ],
      "budget": 0
   },
   "movielensId": 3074,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1972-09-10",
      "dvdReleaseDate": "1997-10-29",
      "directors": ["Sydney Pollack"],
      "runtime": 108,
      "movieId": 3074,
      "title": "Jeremiah Johnson",
      "mpaa": "PG",
      "actors": [
         "Robert Redford",
         "Will Geer",
         "Delle Bolton",
         "Josh Albee",
         "Joaquin Martinez",
         "Allyn Ann McLerie",
         "Stefan Gierasch",
         "Richard Angarola",
         "Paul Benedict",
         "Charles Tyner",
         "Jack Colvin",
         "Matt Clark",
         "Tanya Tucker"
      ],
      "imdbMovieId": "0068762",
      "originalTitle": "Jeremiah Johnson",
      "genres": [
         "Adventure",
         "Western"
      ],
      "youtubeTrailerIds": ["QFLwH-ZZ1MY"],
      "plotSummary": "A mountain man who wishes to live the life of a hermit becomes the unwilling object of a long vendetta by Indians when he proves to be the match of their warriors in one-to-one combat on the early frontier.",
      "tmdbMovieId": 11943,
      "avgRating": 3.767,
      "releaseYear": "1972",
      "numRatings": 1603,
      "posterPath": "/i2wo9M885KcSljpbut24xZCx05r.jpg"
   }
}