{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "paris",
            "id": 90
         },
         {
            "name": "prostitute",
            "id": 549
         },
         {
            "name": "pimp",
            "id": 1667
         },
         {
            "name": "love of one's life",
            "id": 2038
         },
         {
            "name": "red-light disctrict",
            "id": 4750
         },
         {
            "name": "pub",
            "id": 5319
         },
         {
            "name": "police",
            "id": 6149
         }
      ],
      "imdb_id": "tt0057187",
      "video": false,
      "title": "Irma la Douce",
      "recommendations": [
         987,
         77915,
         168502,
         898,
         11536,
         117897,
         116314,
         368432,
         79359,
         107673,
         115360,
         132994,
         103130,
         143529,
         116696,
         1888,
         216971,
         226343,
         184915,
         81789
      ],
      "backdrop_path": "/2IxyOwl23YMNajFbXDaqG9NowXf.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 13,
               "character": "Nestor Patou",
               "gender": 2,
               "credit_id": "52fe4365c3a36847f8051203",
               "name": "Jack Lemmon",
               "profile_path": "/chZmNRYMtqkiDlatprGDH4BzGqG.jpg",
               "id": 3151,
               "order": 0
            },
            {
               "cast_id": 14,
               "character": "Irma La Douce",
               "gender": 1,
               "credit_id": "52fe4365c3a36847f8051207",
               "name": "Shirley MacLaine",
               "profile_path": "/faG5S4EOVaGHNf1CwZryGcHCE4e.jpg",
               "id": 4090,
               "order": 1
            },
            {
               "cast_id": 15,
               "character": "Moustache",
               "gender": 2,
               "credit_id": "52fe4365c3a36847f805120b",
               "name": "Lou Jacobi",
               "profile_path": "/3mZd7AemcMf57gKeINMj0wPs6V5.jpg",
               "id": 23708,
               "order": 2
            },
            {
               "cast_id": 16,
               "character": "Police sergeant",
               "gender": 2,
               "credit_id": "52fe4365c3a36847f805120f",
               "name": "Cliff Osmond",
               "profile_path": "/tTxv0TKz8SDgKAhayx6LJsQOXU4.jpg",
               "id": 14834,
               "order": 3
            },
            {
               "cast_id": 17,
               "character": "Hippolyte",
               "gender": 2,
               "credit_id": "52fe4365c3a36847f8051213",
               "name": "Bruce Yarnell",
               "profile_path": null,
               "id": 27034,
               "order": 4
            },
            {
               "cast_id": 18,
               "character": "Lolita",
               "gender": 1,
               "credit_id": "52fe4365c3a36847f8051217",
               "name": "Hope Holiday",
               "profile_path": "/j4jpTC8PapBbWEn13b3N9yqPCxl.jpg",
               "id": 4097,
               "order": 5
            },
            {
               "cast_id": 19,
               "character": "Insp. Lefevre",
               "gender": 2,
               "credit_id": "52fe4365c3a36847f805121b",
               "name": "Herschel Bernardi",
               "profile_path": "/k386JDVsnHVTEc00Q7QZhHcJNPe.jpg",
               "id": 18860,
               "order": 6
            },
            {
               "cast_id": 20,
               "character": "Amazon Annie",
               "gender": 1,
               "credit_id": "52fe4365c3a36847f805121f",
               "name": "Joan Shawlee",
               "profile_path": null,
               "id": 3161,
               "order": 7
            },
            {
               "cast_id": 21,
               "character": "Andre",
               "gender": 2,
               "credit_id": "52fe4365c3a36847f8051223",
               "name": "Paul Dubov",
               "profile_path": "/vPslqnIMKpqRHHlIJTleLaia0Pr.jpg",
               "id": 27035,
               "order": 8
            },
            {
               "cast_id": 22,
               "character": "Concierge",
               "gender": 2,
               "credit_id": "52fe4365c3a36847f8051227",
               "name": "Howard McNear",
               "profile_path": "/pqe7uwiUrPXruIuYefjO5MOtEFI.jpg",
               "id": 19786,
               "order": 9
            },
            {
               "cast_id": 26,
               "character": "Suzette Wong",
               "gender": 1,
               "credit_id": "5aa5f6920e0a263dcd001f21",
               "name": "Tura Satana",
               "profile_path": "/f6zYcgErVgJ9a3UgkVlLPW37wy.jpg",
               "id": 4592,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4365c3a36847f80511bd",
               "name": "Billy Wilder",
               "profile_path": "/nWV9BDDCbRegP7etiPjl3vYnJEq.jpg",
               "id": 3146,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4365c3a36847f80511c3",
               "name": "Billy Wilder",
               "profile_path": "/nWV9BDDCbRegP7etiPjl3vYnJEq.jpg",
               "id": 3146,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4365c3a36847f80511c9",
               "name": "I. A. L. Diamond",
               "profile_path": "/lii36e0Ntvq7sL1rA0tVs4FePYT.jpg",
               "id": 3147,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4365c3a36847f80511cf",
               "name": "I. A. L. Diamond",
               "profile_path": "/lii36e0Ntvq7sL1rA0tVs4FePYT.jpg",
               "id": 3147,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4365c3a36847f80511d5",
               "name": "Billy Wilder",
               "profile_path": "/nWV9BDDCbRegP7etiPjl3vYnJEq.jpg",
               "id": 3146,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4365c3a36847f80511db",
               "name": "Edward L. Alperson",
               "profile_path": null,
               "id": 27033,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4365c3a36847f80511e1",
               "name": "Doane Harrison",
               "profile_path": null,
               "id": 3159,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4365c3a36847f80511e7",
               "name": "Alexandre Trauner",
               "profile_path": null,
               "id": 4103,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4365c3a36847f80511ed",
               "name": "André Previn",
               "profile_path": "/39fVW2HbF3p4Io1PprezmAsqLkq.jpg",
               "id": 5805,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4365c3a36847f80511f3",
               "name": "Joseph LaShelle",
               "profile_path": "/3j8m5eDzhinBJeUscfNZWhJn9ch.jpg",
               "id": 4101,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4365c3a36847f80511f9",
               "name": "Daniel Mandell",
               "profile_path": null,
               "id": 4102,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4365c3a36847f80511ff",
               "name": "Orry-Kelly",
               "profile_path": null,
               "id": 4127,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe4365c3a36847f805122d",
               "name": "Alexandre Breffort",
               "profile_path": null,
               "id": 1123345,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe4365c3a36847f8051233",
               "name": "Lynn Stalmaster",
               "profile_path": "/rhyzo2qgsGAXIpGTN5OabbZU95U.jpg",
               "id": 1263,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "52fe4365c3a36847f8051239",
               "name": "Alexandre Trauner",
               "profile_path": null,
               "id": 4103,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 7.243319,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 2690,
      "vote_count": 97,
      "budget": 0,
      "overview": "Nester Patou, a naive police officer, is transferred to the red light district in Paris and organizes a raid on a dodgy hotel running as a brothel - inadvertently disrupting the corrupt system of the police and the pimps union, and netting his station superior. Fired from his job, Nester goes to the local bar for a drink and befriends a pretty young lady named Irma la Douce. Upon realizing she is a prostitute, Nester invents a crazy scheme to keep her from seeing other men.",
      "similar": [
         96,
         193893,
         979,
         281,
         25376,
         429733,
         1427,
         4771,
         75780,
         261023,
         395834,
         357096,
         4638,
         80,
         4141,
         90,
         15762,
         22825,
         984,
         2142
      ],
      "original_title": "Irma la Douce",
      "runtime": 135,
      "poster_path": "/3RH81SQAINdo7Pmf6EFK3ToWpMK.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Phalanx Productions",
            "id": 1167,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "The Mirisch Corporation",
            "id": 219,
            "origin_country": ""
         }
      ],
      "release_date": "1963-06-04",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "A story of passion, bloodshed, desire and death... everything, in fact, that makes life worth living.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Billy Wilder"],
      "runtime": 147,
      "synopsis": null,
      "writers": [
         "Alexandre Breffort",
         "Billy Wilder"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0057187/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE0MTgxNTgwMV5BMl5BanBnXkFtZTcwNzE1OTMyMQ@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Jack Lemmon, Shirley MacLaine, Lou Jacobi | See full cast and crew »"],
      "reviews": [
         "Irma la Douce is a gem, one of Billy Wilders best films. Banned from TV for many years by network censors, it began as a Broadway play and ran from Sep 29, 1960 to Dec 31, 1961 playing at both the Plymouth Theatre and the Alvin Theatre in New York. It quickly won the attention of Hollywood and in 1963 debuted as a film starring Jack Lemmon and Shirley MacLaine. It is a love story, the story of a policeman turned reformer who falls madly in love with a beautiful young prostitute. The IBDB captures its essence best: \"Irma La Douce\" is not only French; it is intensely Parisian French. Set in an area tourists seek, but so seldom find, its musical idiom, its moral atmosphere, its plot and its argot are part of Paris not even all Parisians know; a part of Paris where the underworld is known as the \"milieu.\" A tart is a \"poule,\" a pimp is a \"mec\" and money is \"grisbi.\" If you remember Sam Seborn's affair with a prostitute in the first season of West Wing, you have the advantage. Mix with this belief in the underlying goodness of a person with the enchanting music and backdrop of Paris and you will find yourself pulling for Nester (Lemmon) in his quest to win Irma's hand. Marilyn Monroe was originally scheduled to play Irma but died before the film work began. As a credit to Wilder's casting, Shirley MacLaine's performance earned her an Oscar nomination for best actress. The film's cinematography received its own Oscar nomination and the music took Hollywood by storm. It's stunning Parisian melody, written by Marguerite Monnot and arranged for film by Andre Previn, won the Oscar for best music and remains one of the finest musical scores ever. And within the cheerful comedy of the plot, the story's philosopher shines bright as the mentor for Lester who struggles to overcome the muk of daily life. Being none other than the bar tender and owner of the Chez Moustache, the bar and stage center for much of the film, Moustache lends his shoulder to Lester and instructs him in the realities of life: life accepts no conscientious objector and must be approached as if it were a war where only the strong survive. In other words, face the world as it is, not as you were told it was. Watch this film on DVD and get the wide screen version if you can. If you find yourself critical of the film, remember that this is late 50's, early 60's America. It came out during the cold war, in a period where TV was still in its 'Andy of Mayberry' days. Movies were heavily censored and even the media was under intense scrutiny for what topics matters it discussed. Irma La Douce was buried from play and only lately rediscovered by VHS & DVD fans. Transport yourself back to the \"Milieu\" and enjoy, you may just learn something about life!",
         "Billy Wilder's Irma la Douce is an absolute gem. Coming after 'Some Like it Hot' and 'One, Two, Three' and before the similarly undervalued 'Kiss Me, Stupid' it is part of Wilder's most creative period. Shirley Maclaine is perfect as the hooker with the heart of gold and Lemmon is hilarious as the protective lover. Largely shot in studio, Wilder makes hay with the control that this gives him, with a fabulous market where Lemmon works to keep Irma off the streets. It is such a joy to see Lou Jacobi in the pivotal role of Moustache. His line delivery cannot be faulted and he is given many of the film's funniest moments. It is also a joy to watch a great wit like Wilder show us that prostitution is a way of earning a living, not a social problem. May you smile in Heaven, Billy!",
         "Billy Wilder is remembered for \"Some Like It Hot\" but not this great Jack Lemmon/Shirley MacLaine comedy of a Paris cop falling in love with a prostitute. In many ways, it's funnier, and certainly risque. But tasteful and delightful overall. Until recently, I had never seen this film in widescreen. But I loved this movie since I was 11 years old. It celebrates love and jealousy in ways that tickle. Moustache is the best reason to watch the film for his witty dialogue and comedic timing. Fans of cameos should spot Bill Bixby and Grace Lee Whitney (Yeoman Janice Rand of Star Trek: TOS). I remember a time when I could tell you other things about this film, but that's another story!",
         "Adapted from Alexandre Breffort's stage musical, Irma la Douce in film form turns into something of a roller-coaster ride. Even allowing for the absence of the songs {a major gripe with purists}, the film is far too bloated to really achieve the heights of being a great comedy classic. If it had been condensed to perhaps a 100 minute film then I think it could of achieved the splendour that some sequences hint at. As it is tho there is still much to enjoy, and nobody should be under the allusion that this film isn't funny, because it is, but just how long can you stretch the joke Mr Wilder?. I think the chief thing that sticks out is just how did Wilder get such an overtly sexual farce past the censors? He pushes the boundary more than usual with this one, and I honestly would be surprised if he himself wasn't surprised to get away with so much cheeky sexual shenanigans. The sets are fabulous from Alexandre Trauner, and Andre Previn's score is perfect and in tune with the Parisian heart of the film, but the lead actors here are oddly not firing on all cylinders. Jack Lemmon's hopeless romantic Nestor is the core humour character. A character who becomes jealous of himself! His transformation into an English fop is hilarious at first, but on, and on, and on it goes till the joke becomes a heavy weight on the film's shoulders. Lemmon is fine, he's just the victim of over ambition from Wilder. Shirley MacLaine is the title character and it doesn't quite come off, sure she gives it gusto and she looks fabulous {as always}, but the role cried out for a more cosmopolitan actress, and this again comes down to Wilder losing site of things with this particular project. It's a safe recommend for Lemmon fans, but for Wilder worshippers such as me the problems are evident in spite the film being his highest grossing film of the decade. A cautionary 7/10.",
         "When I first saw Irma La Douce as much as I liked it, I was puzzled by the fact that Billy Wilder had chosen to do this hit musical without any songs in it. Very much like Fanny from a few years ago which also had a French setting and came to the screen without its score. The Broadway cast album was a staple in my house and I certainly enjoyed the songs that Keith Mitchell and Elizabeth Seal and the rest of the cast did on Broadway. What made it more puzzling was the presence of Bruce Yarnell in the movie cast, the possessor of a really nice baritone voice, he played opposite Ethel Merman in the Lincoln Center revival of Annie Get Your Gun. That together with the fact Shirley MacLaine first made her mark in musical roles, in fact she had starred in the screen version of Can-Can the two years before. Well, according to the recent biography of Billy Wilder by Ed Sikov in fact this film started out as a musical. Somewhere there is some footage of MacLaine, Yarnell, possibly even Jack Lemmon and Lou Jacobi doing some musical numbers lying in a vault somewhere. Wilder said he thought the numbers slowed the pace of the story and midpoint in the film he just scrapped what he had shot and didn't bother with the rest. Personally I wish he had kept the numbers in, maybe it would have made Irma La Douce run too long. Who knows maybe we'll get to see them some day. Shirley MacLaine got an Oscar nomination for her performance in the title role. She's a good natured working girl who has the misfortune to get busted by the one cop in Paris who is not winking at prostitution on his first day on his new beat. That would be Jack Lemmon who for his honest law enforcement gets himself fired. That far from ends it as Lemmon falls for MacLaine and like he did in The Apartment sees himself as her savior. The rest of the film is the ridiculous lengths Lemmon goes to save MacLaine from her life of sin and debauchery. His one confidante is Lou Jacobi who plays Moustache the owner of a local bistro where the girls and their mecs(that's French for pimp) hang out. His role was originally intended for Charles Laughton. Billy Wilder has a well deserved reputation as a cynical observer of humankind and had some run ins with several Hollywood greats. But he became an unabashed admirer of Charles Laughton after working with him on Witness for the Prosecution. The tenderest part of that Wilder biography tells about how Wilder kept visiting Laughton up to the end discussing the part with both of them knowing it was never to be. Yet I wish Laughton had lived to do the part. It would really have been special. Bruce Yarnell's part is that of MacLaine's mec. His career too was tragically cut short by a plane crash that he was killed in later in the decade. Terrific voice, nice screen and stage presence, what a terrible thing to happen. Though I would have liked to have seen the musical, I can't fault Billy Wilder's production of Irma La Douce. The fact that this came to the screen at all was further demonstration of the Code finally being lifted from the backs of the creative. Maybe we will see a full blown musical adaptation of Irma La Douce some day. But that's another story.",
         "In Paris, after six months working with children, the decorated rookie policeman Nestor Patou (Jack Lemmon) is assigned to work in the red light district on the Casanova Street, a place crowded of streetwalkers, pimps and corrupt police officers. The honest Nestor, who is naive and strictly by the book, notes the movement of couples in the Casanova Hotel and befriends the prostitute Irma La Douce (Shirley MacLaine) believing that she is a lady. When he discovers that she is also a streetwalker, he calls the central station for a raid in the hotel. However, among the arrested costumers is the corrupt Chief of Police Lefevre (Herschel Bernardi) that has a scheme with the pimps union. Nestor is fired with a dirty record and has difficulties to find a new job; he goes to the bistro of the versatile and experienced Moustache (Lou Jacobi) to drink, and he starts a conversation with Irma La Douce. However, her bully pimp Hippolyte (Bruce Yarnell) fights against Nestor, but he beats him up. Irma brings Nestor home and he becomes Irma's pimp. However he falls in love for her and he is jealous when she meets a client. He decides to create the wealthy British Lord X to be the only regular client of Irma. But things go wrong when Nestor is jealous of Lord X and decides to end his character. \"Irma la Douce\" is a delightful fairytale of the fantastic Billy Wilder, certainly one of the five top-directors of Hollywood ever. Based on a play, this delicious romantic comedy has witty and cynical screenplay and dialogs, supported by the chemistry of the charming and gorgeous Shirley MacLaine and Jack Lemmon, who had worked together three years ago in the masterpiece \"The Apartment\". Lou Jacobi plays a skilled man in hilarious situations. The lines of Jack Lemmon playing a British lord are very funny. My vote is eight. Title (Brazil): \"Irma la Douce\"",
         "So it's not the greatest Billy Wilder/Jack Lemmon comedy ever, but it's definitely a very amusing film with witty performances from Jack Lemmon and Shirly McLaine who prove here once again what a believable, great screen couple they make. The scene stealer in this one, though, is Lou Jacobi as Moustache, the hilarious and \"wise\" bartender across the street. The film loses some of its humor at somes places, but it really takes off the moment Jack becomes Lord X. The music is a great asset, too.",
         "Lou Jacobi's performance is by far the best thing about this movie - but that's another story. The fact that this movie is based on a musical is fascinating. For some reason Wilder jettisoned the music but retained the \"flavor\" of the musical. The sets and the supporting characters seem exactly like they are in a musical - especially the brute who is MacLaine's first pimp, supplanted by Lemmon. He seems like a baritone about to break into song at any moment - especially when he bellows to Irma from the street. The scenes in the bar all seem like out-takes from Guys and Dolls! The ambiance of the film is very peculiar. For a Billy Wilder film, it seems very slow. Plenty of lines are thrown away and fail to hit their mark (such as MacLaine's line, \"Oh you won't get cold,\" when she takes Lemmon into her apartment for the first time, which is delivered flatly without any saucy double entendre.) At other times the dialog seems to kind of drag - very un-Wilder-like. To me the scene when Lemmon removes his clothes while MacLaine smokes in bed doesn't strike either a sexy or a poignant tone. MacLaine's hunched-over posture is NOT a sexy pose. And Lemmon's covering the windows with newspaper demonstrates his naiveté and bashfulness, but his preoccupation with it kind of robs the scene of poignancy. It just kind of plods, and there is very little dialog to help it move along. Wilder also seems to rely on much more slapstick (as opposed to just plain \"sight\" gags) in this movie. MacLaine is acting in a kind of light drama, while Lemmon is acting in a farce. To me the two never really mesh, so the movie never hits its intended mark. It is a pity that Marilyn Monroe, Wilder's first choice for Irma, was not available. She would have been a far better comic foil than MacLaine - just check out Some Like It Hot to bear me out. MacLaine has moments when she seems rather wistful. Otherwise, she seems pretty much like a weary (and world-weary) \"working girl.\" She doesn't deliver enough wistfulness to be charming, nor enough weariness to inspire pathos. I was left feeling pretty ambivalent about her character: she's neither comical nor sympathetic. Based on such an ambivalent central character the film, itself, never jells for me. It can't seem to decide whether it wants to be a comedy or a light, poignant drama. It doesn't balance the comic and the poignant elements very well. As an actor, Jack Lemmon is very hit-or-miss with me. He often seems more manic than comic. That is how he strikes me in Irma la Douce. His one note caricature of the British Lord wears pretty thin. In fact that is also the big plot hole in this film. He takes to pimping because he cannot find work. Once he starts working like a slave, there is no need for the Lord X ruse anymore. Of course that artifice is really the entire movie. So the whole contrivance seems like the emperor's new clothes to me. The \"assumed\" life Lemmon's Lord X constructs out of classic British literature is all good fun, but by maintaining the focus on Lemmon's delivery rather than have MacLaine react in some appreciable way for the camera, all of that shtick is pretty wasted to me. All the while Lemmon is rambling on about Gunga Din or whatever, MacLaine responds verbally but just keeps on playing solitaire. Wasted opportunity for some good comic reactions in both dialog and facial expressions! Because this film moves slowly and lacks snappy dialog delivery, it seems more contrived than comical. For a contrivance that works, watch \"Some Like It Hot\" or a great little gem like \"One, Two, Three.\"",
         "Although \"Irma la Douce\" can't quite compare to Wilder's greatest works, it's nonetheless an entertaining lightweight piece with ravishing photography, delightful performances, gorgeous set design, and a top-notch musical score. As a whole the film just isn't remarkable enough to reach the level of \"Some Like It Hot\" and \"The Apartment\", and it suffers from being needlessly drawn out. Lou Jacobi almost steals the show from Lemmon and MacLaine.",
         "This film is Billy Wilder's rewriting of Alexandre Breffort's French musical farce. In 1960, David Merrick brought an English version of the piece to the United States. This Brechtian play concerned penniless law student Nestor le Fripe and his jealous love for his prostitute girl friend, Irma. He disguises himself as Monsieur Oscar and becomes her only client. When he becomes jealous of Oscar, he pretends to murder the fake client. He is assisted in this scheme by Bob, a bartender who also serves as a narrator of sorts. Wilder keeps the basic idea of the play, but turns le Fripe, now Nestor Patou, into a policeman who falls for Irma. Bob becomes known as Moustache and Monnot's songs are used only for background music. In the leading roles, Jack Lemmon, Shirley MacLaine, Lou Jacobi, Hershel Bernardi and Bruce Yarnell are as French as French fries. Wilder injects the farce with his usual cynical romanticism. The shame is that all of the leading players had musical comedy backgrounds and could have put across the musical numbers with style. Wilder did not have to use all 14 musical numbers, but 2 or 3 would have made the point. There is no reason why Jacobi could not have opened the film with \"Valse Milieu\". The \"Dis-donc\" number is almost performed by Shirley MacLaine in the film; why wasn't it done? Jack Lemmon could have crooned \"Our Language of Love\" to Shirley in the early bedroom scene. Maybe Wilder felt that the music would take the bite out the his film. It would have, but it would have made the film warmer. Thank goodness Wilder decided to include some silly slapstick to lighten the piece a bit. When I first saw this film, I was disappointed in it, but after a few more viewings, it stands up well against Wilder's other cynical-romantic comedies of this era. And it is the only one in color!"
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Mirisch Corporation, The",
         "Phalanx Productions"
      ],
      "summaries": [
         "Naive, by the book French police officer Nester Patou, is transferred to the Red Light district. Upon witnessing what must be a brothel, he calls the station and organizes a raid, transporting all the 'ladies' to the jail. This unfortunately disrupts the well organized system of the police and the Pimps union. Not to mention inadvertently netting his station superior at the brothel. Fired, he goes to a bar to drink, is befriended by Irma, beats up her pimp, and finds he is now Irma's new pimp. Nester's doesn't like the thought of his girl seeing other men, so comes up with a plan.",
         "Comedy about a Parisian policeman who becomes the lover (and unwilling pimp) of a carefree street-walker. After falling in love with her, the officer conspires to limit her occupation by taking on an alter-ego, \"Lord X\", to serve as her sole client. Adapted from a successful musical.",
         "In Paris, after six months working with children, the decorated rookie policeman Nestor Patou is assigned to work in the red light district on the Casanova Street, a place crowded of streetwalkers, pimps and corrupt police officers. The honest Nestor, who is naive and strictly by the book, notes the movement of couples in the Casanova Hotel and befriends the prostitute Irma La Douce (believing that she is a lady. When he discovers that she is also a streetwalker, he calls the central station for a raid in the hotel. However, among the arrested costumers is the corrupt Chief of Police Lefevre that has a scheme with the pimps union. Nestor is fired with a dirty record and has difficulties to find a new job; he goes to the bistro of the versatile and experienced Moustache to drink, and he starts a conversation with Irma La Douce. However, her bully pimp Hippolyte fights against Nestor, but he beats him up. Irma brings Nestor home and he becomes Irma's pimp. However he falls in love for her and he is jealous when she meets a client. He decides to create the wealthy British Lord X to be the only regular client of Irma. But things go wrong when Nestor is jealous of Lord X and decides to end his character.",
         "In Paris, an ex-cop falls in love with a prostitute, and tries to get her out of that life by paying for all of her time. Not so easy..."
      ],
      "budget": 5000000
   },
   "movielensId": 3076,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1963-06-04",
      "dvdReleaseDate": "2001-09-18",
      "directors": ["Billy Wilder"],
      "runtime": 135,
      "movieId": 3076,
      "title": "Irma la Douce",
      "mpaa": "",
      "actors": [
         "Jack Lemmon",
         "Shirley MacLaine",
         "Lou Jacobi",
         "Cliff Osmond",
         "Bruce Yarnell",
         "Hope Holiday",
         "Herschel Bernardi",
         "Joan Shawlee",
         "Paul Dubov",
         "Howard McNear"
      ],
      "imdbMovieId": "0057187",
      "originalTitle": "Irma la Douce",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["AtuBtsEvYgw"],
      "plotSummary": "Nester Patou, a naive police officer, is transferred to the red light district in Paris and organizes a raid on a dodgy hotel running as a brothel - inadvertently disrupting the corrupt system of the police and the pimps union, and netting his station superior. Fired from his job, Nester goes to the local bar for a drink and befriends a pretty young lady named Irma la Douce. Upon realizing she is a prostitute, Nester invents a crazy scheme to keep her from seeing other men.",
      "tmdbMovieId": 2690,
      "avgRating": 3.57664,
      "releaseYear": "1963",
      "numRatings": 672,
      "posterPath": "/3RH81SQAINdo7Pmf6EFK3ToWpMK.jpg"
   }
}