{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "docudrama",
            "id": 15061
         },
         {
            "name": "east end",
            "id": 154863
         },
         {
            "name": "archival footage",
            "id": 154866
         }
      ],
      "imdb_id": "tt0164312",
      "video": false,
      "title": "42 Up",
      "recommendations": [
         13365,
         20562,
         20561,
         20553,
         116167,
         50754,
         51863,
         59266,
         42481,
         22319,
         72002,
         39293,
         64522,
         61824,
         90511,
         130750,
         49952,
         34389,
         45884,
         71592
      ],
      "backdrop_path": "/4KEmPZ4X1X1pDsdvwLEozABuD0R.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Himself (as Bruce)",
               "gender": 0,
               "credit_id": "52fe43edc3a368484e006703",
               "name": "Bruce Balden",
               "profile_path": null,
               "id": 556915,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Herself (as Jackie)",
               "gender": 0,
               "credit_id": "52fe43edc3a368484e006707",
               "name": "Jacqueline Bassett",
               "profile_path": null,
               "id": 556916,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Himself (as Symon)",
               "gender": 0,
               "credit_id": "52fe43edc3a368484e00670b",
               "name": "Symon Basterfield",
               "profile_path": null,
               "id": 556917,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Himself (as Andrew)",
               "gender": 0,
               "credit_id": "52fe43edc3a368484e00670f",
               "name": "Andrew Brackfield",
               "profile_path": null,
               "id": 556918,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Himself (archive footage) (as John)",
               "gender": 0,
               "credit_id": "52fe43edc3a368484e006713",
               "name": "John Brisby",
               "profile_path": null,
               "id": 560304,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Herself (as Suzy)",
               "gender": 0,
               "credit_id": "52fe43edc3a368484e006717",
               "name": "Suzanne Dewey",
               "profile_path": null,
               "id": 560305,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Himself (archive footage) (as Charles)",
               "gender": 0,
               "credit_id": "52fe43edc3a368484e00671b",
               "name": "Charles Furneaux",
               "profile_path": null,
               "id": 68540,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Himself (as Nick)",
               "gender": 0,
               "credit_id": "52fe43edc3a368484e00671f",
               "name": "Nicholas Hitchon",
               "profile_path": null,
               "id": 560306,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Himself (as Neil)",
               "gender": 0,
               "credit_id": "52fe43edc3a368484e006723",
               "name": "Neil Hughes",
               "profile_path": null,
               "id": 560307,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Herself (as Lynn)",
               "gender": 0,
               "credit_id": "52fe43edc3a368484e006727",
               "name": "Lynn Johnson",
               "profile_path": null,
               "id": 190212,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Himself (as Paul)",
               "gender": 0,
               "credit_id": "52fe43edc3a368484e00672b",
               "name": "Paul Kligerman",
               "profile_path": null,
               "id": 560308,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Himself (as Tony)",
               "gender": 0,
               "credit_id": "52fe43edc3a368484e00672f",
               "name": "Tony Walker",
               "profile_path": null,
               "id": 560309,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Herself (as Sue)",
               "gender": 1,
               "credit_id": "52fe43edc3a368484e006733",
               "name": "Susan Sullivan",
               "profile_path": "/pnhdm2VvkRaMEFDOjogvNCafUeq.jpg",
               "id": 543204,
               "order": 13
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe43edc3a368484e0066ff",
            "name": "Michael Apted",
            "profile_path": "/j5KoJlZUepN36ZD8VoDLuvV5BG5.jpg",
            "id": 10781,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 1.109535,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 20565,
      "vote_count": 16,
      "budget": 0,
      "overview": "Director Michael Apted revisits the same group of British-born adults after a 7 year wait. The subjects are interviewed as to the changes that have occurred in their lives during the last seven years.",
      "similar": [
         246400,
         157354,
         210024,
         20482,
         319067,
         26508,
         15660,
         8357,
         57978,
         13210,
         258967,
         224,
         1842,
         279840,
         390747,
         39562,
         35956,
         294167,
         309049,
         160859
      ],
      "original_title": "42 Up",
      "runtime": 139,
      "poster_path": "/aC1VEsiImpL1SwLnm7cKK6ro8qR.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1998-07-28",
      "vote_average": 6.9,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "The Up Series",
         "id": 95051,
         "poster_path": "/nLIBjyGeV2TMiv82MmKq5zX9DhG.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Michael Apted"],
      "runtime": 139,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0164312/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAwNjYxMzUwNF5BMl5BanBnXkFtZTcwMjI3OTgxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Bruce Balden, Jacqueline Bassett, Symon Basterfield | See full cast and crew »"],
      "reviews": [
         "I can't say enough about this series. I just watched 28 up, 35 up and 42 up all in about a week's time, so there are a lot of things to talk about within the entire series, rather than just in this one particular film. But I'll do my best to focus on 42, since that is the film I am commenting on. As a film on its' own, 42 up is probably the most interesting of the series as far as watching the people change physically over the years goes. Each subject filmed at the six different stages appears (except for those that had dropped out of the program) and you get to see how they have transformed over the years. 42 is also great because you also get to see how film techniques (& stock) have evolved over the years along with the people. In the present time, the film looks beautiful and rich in color while each successive film appears murkier and murkier over time until you get the original black and white of 1964. The problem with 42 Up, if you were going to watch just this one film, is that because there are so many flashbacks of people at various stages, this leaves little room for getting to know them better (during a 2 hour time frame). I have talked to people who say, \"I am just going to watch 42 up because they give you all the background stuff anyway..\" I say NO!..... For a richer experience, and this is what I did so you can take it for what it's worth, watch 28, 35, and 42 up at least so you can get to know these people fully at each stage. There are crucial things that happen to these people in 35 for instance which does not show up in 42.(Neil!!John!!) I cannot even view each film as seperate, because they all seem sewn together somehow. Taken as a whole, they are amazing to watch..and the suspense in wondering what happened to each over the next seven years is truly there if you start early in the series. So watch some of the others before you watch 42 to get the full effect. On to the characters..who are real people. Their stories are so beautiful to watch unfold over time it is truly amazing they were captured at each stage as they grew up. And you can even get the feeling by the end how large their lives really are and that they extend way beyond the borders of the film which the filmmakers obviously knew and luckily never once tried to pretend that they could completely capture the essence of a person on film. You just get tiny snippets of who these people are yet by the end you can't stop thinking about them, they become a part of you. I cannot think of any movie or series of movies where the characters were so richly drawn as these were, especially over the course of time. A beautiful, wonderful series that everybody should own. Questions (if anyone can answer them for me) 1) Whatever happened to John???? why don't they even mention him (like they do some of the others who dropped out) in 35 & 42? He disappears after 28! What happened to him??? 2) Are there any other projects going on like this in America or on a global scale? I think it would be a brilliant idea to do this similarly Globally to investigate and compare cultures all over the world! 3)Will there be a 49 Up or was that the end of the series?",
         "Fourteen English children from various parts of society, all born about 1957, have their lives looked at every seven years by Michael Apted and his TV camera. This episode brings us up to 1999 and 42 years old. All are still alive and eleven out of the original fourteen are still participating. (Ironically, one of the drop-outs is a prominent BBC TV producer.) The two continuing themes are 1) the Jesuit saying `give me the child before he is seven and I will give you the man' and 2) the power of the British class system to determine outcomes. Although the Jesuits suggest that by the age of seven it's too late, some of the kids from lower class backgrounds have done surprisingly well. Nicholas, a Yorkshire dales farmer's son has become a Professor of Physics. Tony, a cockney kid who wanted to be a jockey has finished up owning several cabs. Three working class girls have all finished up with better jobs than their parents though their marital relationships have been rocky. Even the shy son of a single mother has finished up happily married and employed. None of the better-off kids has failed either, though one or two went through rough patches in their early 20s. The three seven year old `upper class twits' (only one of whom still participates in the program) are all professionals and have all succeeded professionally - a QC, a solicitor and the aforesaid shy TV producer. Bruce, a kid with a flair for mathematics, after a varied career, has settled down as a fine teacher in a city high school. They only real stray has been Neil, the dreamy little kid from Liverpool, who after a lengthy period as a down-and-out has popped up as an elected official no less, a Liberal Democrat councillor in the London Borough of Hackney. All the subjects tell their stories fairly fluently to the camera, even Paul, a very shy kid who migrated to Australia as a teenager. Several have now lost one or both parents and there have been several failed marriages. Apted is a gentle interviewer but there has obviously been a lot of pain with the gain. This is a unique series and the group is not really a random sample (too many toffs and working class kids) but it can be said it shows the persistence of the class system: only one kid has really beaten it, the physicist, and he's left the country. There are no cockney accents in the courtroom except from the witness box. The standard of living in general has increased markedly since the 1960s and `trickle down' economics has ensured that the working class (what's left of them) is better off. Women have done better too, in terms of independence and money, but at a considerable emotional cost in some cases. For them the changes in the social landscape have made it harder than for the boys; the role of women in society has completely changed whereas men plod on much as before. The one good indicator of future employment success is education, which is notoriously class-based in England (Scotland is a little different). If the (shy) QC had gone to the local council school instead of Charterhouse it is not likely he would he exercising his tonsils today in the High Court. Tony, our successful cabbie might have become a solicitor if he had come from a different social class. Some of the subjects say that class isn't what it was, but it, and the educational system it operates through, are still pre-ordaining outcomes. Perhaps it's the same in most countries (Paul has noticed a class system in Australia); it's just that the British class system stands out a bit more.",
         "This film and its predecessors are the most fascinating documentaries released cinematically, not because of their breathtaking cinematography, whiz-bang special effects or even revelation of secret or unknown information. What it does offer is a look straight into the personal lives of a group of people with nothing much in common except this series of extraordinary films which every 7 years throw their experiences open to the world. For the most part they are ordinary lives but they are engrossing as only reality can be. There is no gloss applied, no smoothing over of rough edges. Apted has become a friend to many of his 'subjects' and the warmth of their relationship with him comes into the film. In this program, even the effect of the film series on the people in it is examined, so in some ways it is a film about itself. Like a classic serial cliffhanger, at the end one is impatient to see the next instalment, but it will be seven years in production...",
         "This film series takes the adage \"Give me a child until age 7, and I'll give you the man\" and blows it out of the water. I've been a fan of the \"Up Series\" since my first viewing of \"28 Up\". Watching these precocious 7-year-olds grow into adulthood right before my eyes has sparked some much needed self-examination of my own life. That may be the greatest value of the \"Up Series\", causing the viewer to project themselves into the film and see how their own lives have changed and developed. The movie ticket is certainly cheaper than a trip to the psychologist. Some highlights of this edition: -Tony, the would-be jockey and racetrack numbers runner who became a London cabbie. Despite his infidelities, Tony is still married to his forgiving wife and seems to take great pride in his children. Tony has now become more reflective about his life, taking a thoughtful stroll through the closed down racetrack where he once rode, and getting misty-eyed when discussing his late mother and father. Always frank and pragmatic, he says of his comfortable suburban home, \"I'm a cabbie. This is probably as far as I'm gonna get.\" -Bruce, the good-natured, relationship challenged school teacher who was teaching in Bangladesh, is back teaching in London and has finally found Mrs. Right. Among the interesting tidbits of information you learn from Apted's DVD commentary is that he broke his rule of only filming the subjects every 7 years so he could be present to film Bruce's wedding. -Nick, the physicist who moved to the US, returns home to his father's farm. We meet his brothers and are treated to some beautiful shots of the English contryside. In his commentary Apted discusses his regrets regarding the way he edited Nick's wife in previous episodes. She now refuses to do interviews for the films and also refuses to let their son participate. -Andrew, the only one of what Apted refers to as the \"Three Wise Men\", the upper class boys, who participated in 42 Up. Successful well-adjusted, happily married, we see Andrew and his family on a vacation to New York City (with several pre-9/11 shots of the WTC). Thanks to the DVD commentary, we learn that John doesn't particularly like Apted and only agreed to be interviewed for \"35 Up\" if his interview was conducted by Apted's assistant director. The other upper class boy, Charles, is ironically a documentary director for the BBC and has consistently refused to participate since \"21 Up\". -Neil, the bright, animated 7-year-old who ended up dropping out of college and living in a trailer. Neil has always been the most compelling character in the \"Up Series\". His obvious intelligence exists in sharp contrast with mental problems and bouts with depression. Every fan of the films would probably admit to worrying whether or not Neil would survive to the next episode. Happily, Neil is now involved in local politics. Despite his eccentric appearance and lack of a paying job (he makes no money from his job with the Liberal Democrats), Neil is no longer the rambling hermit of \"28 Up\". His turn around can partly be attributed to some assistance from fellow \"Up\" subject Bruce. Neil even participated in Bruce's wedding. Let's hope Apted comes up with a DVD compilation that includes footage from all the films. Instead of the brief 15 minute updates we get for each subject in \"42 Up\", it would be nice to see a half-hour or so on each, as well as footage of those who no longer participate (like Peter). Apted's DVD commentary is boring at times, but includes some fascinating behind-the-scenes information which devoted fans will enjoy. In conclusion, the \"Up Series\" stands as one of the most important and engrossing documentaries ever committed to celluloid.",
         "In the most sociologically fascinating and perceptive documentary series ever produced, Michael Apted has made this enormously thought provoking series a labour of love. He has taken eleven seven year olds in 1964, and has filmed them every seven years since then. The results have been breathtaking. In seeing footage from when these now grown adults were little, we see how the boy becomes a man and the girl becomes a woman. We see as each attempt to reach their hopes and dreams. There are successes and failures (including one heartbreaking one), but we get more than that. We get an overwhelming sense of the connection and delicate fabric of human life.",
         "I cannot say enough good things about this series. Each one seems to interest me more as I follow the lives of the kids I first saw in '7UP'. '42UP' continues to show us how they have evolved as people and how the British class system still has control over their lives. As an American I find it somewhat hard to understand that the class you are born into largely determines your educational choices and therefore part of the outcome of your life. I strongly suggest seeing as many of the series as you can, (7UP, 14UP, 21UP, 28UP, 35UP) before your see 42UP. But as a stand alone documentary it is still excellent.",
         "Yes, you CAN view 42Up without having seen 35Up, 28Up, etc. But it would be wrong. Because with each film, less of the past can be shown as each person's past increases -- thus you get only the highlights of each past: e.g., teenage Suzy's dad's death, which enormously affected her; the orphanage-reared Paul's move to Australia, and his marriage to an Oz woman with a big hearty family; Nick's move to the US -- with no class system surrounding him, he's been able to avoid what the rest are still struggling with, but is it worth the high cost of seeing his Yorkshire family no more than every other year? The participants were all born circa 1956, so age 49 will be around 2005. There are some pasts I hope we hear less of in 49Up: I don't want to hear any more about Tony's casual infidelities, thank you very much. His wife's reactions to his self-justifications (\"I'm not proud of it, but every man does it\"...that kind of lame excuse), and her silent yet profound unhappiness and betrayal, are excruciating. Besides, these days, infidelity is simply a welcome mat to self-transformation into a disease vector. But I would genuinely like to know how Neil descended into alarming solitariness and depression without getting therapy in what was then one of the world's largest venues for socialized medicine. (I hope by now he's been able to adjust his brain chemistry. Thank God for Bruce, another 'Up' man who befriended and helped Neil.) These people become so known to us that every seven years it's like renewing acquaintance. Such fame has not been entirely welcome, though Tony has been able to parlay it into parts as an actor. It must feel uncomfortable to have complete strangers know what you were like at 14...an age most of us feel sincerely relieved to have left behind. That the ones who continue to say yes to Michael Apted and his crew generally handle their filming with immense dignity and humor speaks volumes about their generosity -- and their curiosity. How are the others doing? How am I compared to seven years ago? What have I learned during those years? What can I learn from this episode? For the 'Up' people: thank you for your willingness to open your lives and homes, to answer intrusive questions, to demonstrate your values and what's brought you through, and to give us all a better understanding of what human growth is really about.",
         "I loved the Up series, despite having seen only 35up & 42up. For the uninitiated, this series was a pet \"anthropological\" cinematic project undertaken by director Michael Apted. In this series, he would revisit a group of British men and women and make a documentary film about their lives, every 7 years, starting from the age of 7. Of interesting note is the participant's differing social/ class divide; from the upper-middle class suburban homemakers to working class cabbies. (Note: 7up was originally only conceived as a television initiative if I'm not mistaken. But its underlying premise proved so intriguing, guess Apted just had to keep it going and see where it might end up. We are up to \"42\" now, nice....) My thoughts... These films might have shown mere glimpses of those ordinary lives, but I was still in awe of its premise no less. Like the flipping through of a moving photo album, we revisited the lives of these people. Within a two hour period, we saw these people grow up right before our eyes. We saw their physical and psychological transformation over the years. We saw how they charted their lives and lived it. We shared in their joys and tribulations. Of course, there were harmony, or discordance over those many long years. But this series was contented in just showing us simple truths. It captured vignettes of youth's idealistic beauty and inevitable follies. It revealed life's vaunted fulfillment and crushing regrets. Most importantly, it attempted to shed light on one's happiness barometer; how our pursuit of happiness and attaining contentment is directly corresponded with our expectations in the past, present, and probably beyond. We may not always tick like clockwork in this tragi-comedic mortal coil. But a rewind is often all it takes to get us back on track. This continuing Up series is thus IMO, a very worthy meditation on the meaning of our very own lives. I so wanna see what happens when those 7 year olds turn 49.",
         "One of the most important ongoing social and cultural projects of our time, this series of films has documented the lives of a number of people from the age of seven up. Currently the participants are in their mid-forties, now in a position to reflect on the past as well as to speculate about their future from a reasonably well-informed perspective. It is truly fascinating to get even this brief glimpse of how these people have progressed through their lives, from the fresh enthusiasm of early childhood through the angst and pain of the teen years, then coping with the various ups and downs of adulthood. Many have children of their own; some have lost parents along the way. Most have remained in their native England, where social class is more of an issue than here in the States. Class struggle is a topic of discussion in the film, though touched upon rather briefly. This reviewer has been watching Michael Apted's project for the past fourteen years and is approximately the same age as the participants, a fact which makes the film that much more involving. One feels a connection with these people. Reviewing these people's lives is much like looking back at one's own, which strengthens the feelings of warmth and familiarity that this film evokes. Mr. Apted has done an excellent job with these films and the reviewer wishes to express appreciation to him as well as to the interviewees.",
         "I just finished \"42 Up\" on 2/26/05 and have a few things to say about the film and the series. First, it's the only longitudinal study of human development we have, and for that reason, no matter how boring or trivial some people may find this series, I find it to be extremely valuable. Especially when considering how people develop by age, socioeconomic status, education, ethnicity, culture and gender. I am unaware of any other study that has covered as much ground as the Up series has. 14 children, all British, taken at age 7 and revisited every 7 years from 1964 to 1998 certainly makes for an interesting study. If there is no \"49 Up\", Michael Apted can at least rest on what this study already has accomplished. Second, it's amusing to me that at various stages the participants have no clue as to the importance of this study. Some of them decline to be a part of the project and others seems to really understand the value of participating in this study. If my wife and I had a 7 year old we would jump at the chance for him/her to be in this type of project. I fail to understand why some of the participants (Charles, John & Peter) continue to belittle, devalue and not take part in this study. Nick, Symon, Suzy and Andrew all participate, but with an air of sourness about what the study has done to their lives. As I stated, it's truly amazing how some of the participants have no concept of the psychological/sociological value of this study the participate in, they merely seem to be thinking only about themselves and how it affects their lives. Third, there are a few annoying pieces to this series. One is that Michael Apted fails to explain why Peter is not part of the program anymore after \"28 Up\". You have no idea why he isn't in \"35 and 42 Up\". Michael doesn't even add a 30 second explanation!!! At least Mr. Apted explains what's going on with John and Charles, and why they are not part of the program. He failed in \"35 Up\" to mention why Symon was not interviewed! Yet, Symon re-appears for \"42 Up\" and all is explained. Another thing about this series is that it greatly improves around 21 and 28 Up as Michael finally organizes the stories so you can keep track of each person, and the technology advances as well as all the participants begin to have something to say about the world they live in. Still, Michael Apted could stand to not engage in flashbacks as much as he does and spend more time on the present. If you watch each show in order like we did, you do not need the flashbacks because you already know what has happened. These films should be viewed in order. Just watching \"42 Up\" is a mistake and a disservice. You need to watch how these people grow in order to see the whole picture. My recommendation is, that if you are in the field of psychology, counseling, social work, teaching, etc. You should watch this series as mandatory to your education. If Mr. Apted continued with \"49 Up\" this year and then continues the series in the future, this project will be even more fruitful and valuable of just looking at how personalities are shaped and determine future choices and consequences."
      ],
      "genres": [
         "Documentary",
         "Biography"
      ],
      "productionCompanies": [
         "British Broadcasting Corporation (BBC)",
         "Granada Television"
      ],
      "summaries": [
         "In 1964, a film crew interviewed seven-year-old English kids: five or six from privilege, a Yorkshire farm lad, East-End girls, and boys from a children's home. Every seven years, Michael Apted re-interviews those willing (two declined this time). At 42, careers are stuck or flourishing; marriages are strong, shaky, or over (and Bruce recently married for the first time). They're dealing with parents' dying, and children coming-of-age. One is a single mom with young sons. One is remarried, but how are the five children from his first marriage? Lyn and Jackie face health problems with down-to-earth lucidity. Neil, on the margin at 28 and 35, has a glorious story of friendship at 42.",
         "Director Michael Apted revisits the same group of British-born adults after a 7 year wait. The subjects are interviewed as to the changes that have occurred in their lives during the last seven years."
      ],
      "budget": 0
   },
   "movielensId": 3077,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-07-28",
      "dvdReleaseDate": "2001-08-28",
      "directors": ["Michael Apted"],
      "runtime": 139,
      "movieId": 3077,
      "title": "42 Up",
      "mpaa": "",
      "actors": [
         "Bruce Balden",
         "Jacqueline Bassett",
         "Symon Basterfield",
         "Andrew Brackfield",
         "John Brisby",
         "Suzanne Dewey",
         "Charles Furneaux",
         "Nicholas Hitchon",
         "Neil Hughes",
         "Lynn Johnson",
         "Paul Kligerman",
         "Tony Walker",
         "Susan Sullivan"
      ],
      "imdbMovieId": "0164312",
      "originalTitle": "42 Up",
      "genres": [
         "Documentary",
         "Foreign"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Director Michael Apted revisits the same group of British-born adults after a 7 year wait. The subjects are interviewed as to the changes that have occurred in their lives during the last seven years.",
      "tmdbMovieId": 20565,
      "avgRating": 4.04722,
      "releaseYear": "1998",
      "numRatings": 1239,
      "posterPath": "/aC1VEsiImpL1SwLnm7cKK6ro8qR.jpg"
   }
}