{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "country estate",
            "id": 1610
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0178737",
      "video": false,
      "title": "Mansfield Park",
      "recommendations": [
         3573,
         18093,
         13949,
         17015,
         18089,
         11632,
         4584,
         9587,
         2977,
         24137,
         16236,
         12254,
         30072,
         47333,
         5951,
         4592,
         41044,
         6373,
         9454,
         18074
      ],
      "backdrop_path": "/wRZCI7HbecEcqPaU9OqURg7pmXQ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 20,
               "character": "Fanny Price",
               "gender": 1,
               "credit_id": "52fe43679251416c7500ef73",
               "name": "Frances O'Connor",
               "profile_path": "/tWGMS7DciV43tlxA6UEc2UqxrhL.jpg",
               "id": 1518,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Mrs. Price / Lady Bertram",
               "gender": 1,
               "credit_id": "52fe43679251416c7500ef2f",
               "name": "Lindsay Duncan",
               "profile_path": "/ddjjwMEHLBvzkZzZ5frEvJyWnZ6.jpg",
               "id": 30083,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Tom Bertram",
               "gender": 2,
               "credit_id": "52fe43679251416c7500ef33",
               "name": "James Purefoy",
               "profile_path": "/mi2jfhx57kJ7dDvhoCJyDaEkICR.jpg",
               "id": 17648,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Mrs. Norris",
               "gender": 1,
               "credit_id": "52fe43679251416c7500ef4f",
               "name": "Sheila Gish",
               "profile_path": null,
               "id": 53585,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Sir Thomas Bertram",
               "gender": 2,
               "credit_id": "52fe43679251416c7500ef53",
               "name": "Harold Pinter",
               "profile_path": "/zmnvgAEdRzgH1aQ3TwrfqHzy8Hb.jpg",
               "id": 26157,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Maria Bertram Rushworth",
               "gender": 1,
               "credit_id": "52fe43679251416c7500ef57",
               "name": "Victoria Hamilton",
               "profile_path": "/aA3wQdxKO8X7qSgRv2tnNYYqGNS.jpg",
               "id": 55645,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Mr. Rushworth",
               "gender": 2,
               "credit_id": "52fe43679251416c7500ef5b",
               "name": "Hugh Bonneville",
               "profile_path": "/vHxgbEvQfp30MiYxtH53hoCOMOg.jpg",
               "id": 19923,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Julia Bertram",
               "gender": 1,
               "credit_id": "52fe43679251416c7500ef5f",
               "name": "Justine Waddell",
               "profile_path": "/gVPTeUJW1Doq19LTPZfsfNqC06N.jpg",
               "id": 42705,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Mary Crawford",
               "gender": 1,
               "credit_id": "52fe43679251416c7500ef63",
               "name": "Embeth Davidtz",
               "profile_path": "/gmc4nZtGc6bge9DnriR57VYq0dA.jpg",
               "id": 6368,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Mr. Henry Crawford",
               "gender": 2,
               "credit_id": "52fe43679251416c7500ef67",
               "name": "Alessandro Nivola",
               "profile_path": "/lLlaotVNM6dhjXj7GWVLSedugct.jpg",
               "id": 4941,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Susan \"Susie\" Price",
               "gender": 1,
               "credit_id": "52fe43679251416c7500ef6b",
               "name": "Sophia Myles",
               "profile_path": "/eUZW5X1FJ5utHKSw0ZqmOPhuUI.jpg",
               "id": 3971,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Edmund Bertram",
               "gender": 2,
               "credit_id": "52fe43679251416c7500ef6f",
               "name": "Jonny Lee Miller",
               "profile_path": "/70oZd4dPWNAibagHJvRU1Tf9e6h.jpg",
               "id": 9012,
               "order": 11
            },
            {
               "cast_id": 23,
               "character": "Young Fanny",
               "gender": 1,
               "credit_id": "5739ff41c3a36806af0001cd",
               "name": "Hannah Taylor-Gordon",
               "profile_path": "/28TBbB0NpJMe20qPlJXdcyQldKt.jpg",
               "id": 23621,
               "order": 12
            },
            {
               "cast_id": 24,
               "character": "Young Susan",
               "gender": 0,
               "credit_id": "5739ff41c3a36806bc00017e",
               "name": "Talya Gordon",
               "profile_path": null,
               "id": 1621156,
               "order": 13
            },
            {
               "cast_id": 25,
               "character": "Carriage Driver",
               "gender": 0,
               "credit_id": "5739ff42925141557b000177",
               "name": "Bruce Byron",
               "profile_path": "/5TDTgFth7inBi9hSA544NAu4aa3.jpg",
               "id": 25675,
               "order": 14
            },
            {
               "cast_id": 26,
               "character": "Young Maria",
               "gender": 0,
               "credit_id": "5739ff42c3a36806a6000167",
               "name": "Elizabeth Eaton",
               "profile_path": null,
               "id": 1621157,
               "order": 15
            },
            {
               "cast_id": 27,
               "character": "Young Julia",
               "gender": 0,
               "credit_id": "5739ff429251415578000185",
               "name": "Elizabeth Earl",
               "profile_path": null,
               "id": 1214692,
               "order": 16
            },
            {
               "cast_id": 28,
               "character": "Young Edmond",
               "gender": 0,
               "credit_id": "5739ff42925141557b00017b",
               "name": "Philip Sarson",
               "profile_path": null,
               "id": 1621158,
               "order": 17
            },
            {
               "cast_id": 29,
               "character": "Teenage Fanny",
               "gender": 1,
               "credit_id": "5739ff43925141556c000147",
               "name": "Amelia Warner",
               "profile_path": "/yXhwlM0dnrvtdpGExCCtT5tfvoB.jpg",
               "id": 23496,
               "order": 18
            },
            {
               "cast_id": 30,
               "character": "Yates",
               "gender": 2,
               "credit_id": "5a39d5fa0e0a264cbc210cf8",
               "name": "Charles Edwards",
               "profile_path": "/qcAysQnmu7Pi96IV85u4YjgqzkQ.jpg",
               "id": 281527,
               "order": 19
            },
            {
               "cast_id": 31,
               "character": "Betsey",
               "gender": 1,
               "credit_id": "5a39d6090e0a264ccd20d0b3",
               "name": "Anna Popplewell",
               "profile_path": "/tlGWAZeDgqJtJ5cz57zS0BW5our.jpg",
               "id": 5529,
               "order": 20
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe43679251416c7500ef39",
               "name": "Patricia Rozema",
               "profile_path": "/s1lW8HDclRDEgOWrETAJ5eSGKda.jpg",
               "id": 55439,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe43679251416c7500ef3f",
               "name": "Jane Austen",
               "profile_path": null,
               "id": 32982,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe43679251416c7500ef45",
               "name": "Martin Walsh",
               "profile_path": "/eFdV5n5GV01fwNRzrJn299aFUsq.jpg",
               "id": 9154,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe43679251416c7500ef4b",
               "name": "Patricia Rozema",
               "profile_path": "/s1lW8HDclRDEgOWrETAJ5eSGKda.jpg",
               "id": 55439,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe43679251416c7500ef79",
               "name": "Sarah Curtis",
               "profile_path": null,
               "id": 53358,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "56958d759251413ae0000d99",
               "name": "Michael Coulter",
               "profile_path": null,
               "id": 7021,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5a884c740e0a264011064ebb",
               "name": "Harvey Weinstein",
               "profile_path": "/jonLOgQIZPBn650kLcsKOPois7U.jpg",
               "id": 59839,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 7.884991,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 10399,
      "vote_count": 112,
      "budget": 0,
      "overview": "This fun and sexy comedy tells a timelessly entertaining story where wealthy, secret passions and mischievous women put love to the test.. When a spirited young woman, Fanny Price, is sent away to live on the great country estate of her rich cousins, she's meant to learn the ways of proper society. But while Fanny learns \"their\" ways, she also enlightens them with a wit and sparkle all her own!",
      "similar": [
         258480,
         370663,
         401898,
         244772,
         12793,
         27586,
         858,
         112160,
         141,
         634,
         376867,
         242224,
         10818,
         11421,
         43923,
         340485,
         250124,
         513,
         11634,
         297762
      ],
      "original_title": "Mansfield Park",
      "runtime": 112,
      "poster_path": "/reh2SdnPDmFbjWWAEbTv9GgQbke.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "HAL Films",
            "id": 931,
            "origin_country": ""
         },
         {
            "logo_path": "/wdmwQuV4R1MIr8A78izZkC184uC.png",
            "name": "BBC Films",
            "id": 288,
            "origin_country": "GB"
         }
      ],
      "release_date": "1999-11-12",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Patricia Rozema"],
      "runtime": 112,
      "synopsis": null,
      "writers": [
         "Jane Austen",
         "Patricia Rozema"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0178737/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUwMDIwNDMyN15BMl5BanBnXkFtZTcwNTAyNTEzMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Frances O'Connor, Jonny Lee Miller, Alessandro Nivola | See full cast and crew »"],
      "reviews": [
         "Maybe it was a mistake to watch this adaption of Mansfield Park the day I finished reading the novel. This production is too modern. Now I understand that they probably wanted to make it \"more appealing\" to today's moviegoers, and I know that it's hard to fit all a book into a film - but why did they change the essence of who Fanny Price is? She is a highly moral, quiet, smart, very put-upon young lady. While Frances O'Connor is a wonderful actress, she played Fanny all wrong. She was smiling (constantly), having pillow fights, speaking her mind. There was no sense of period or restraint in her portrayal. I think the writer/director should have had more faith in the characters in the book. With so many storylines to choose from in the book, I wonder why new ones were added, such as the slave trade and opium use? It is a shame that Sir Thomas didn't have the character arc seen in the book, that has him appreciate Fanny more and show her greater kindness when he returns from Antigua. In the film he is just always a big, mean bully. Jonny Lee Miller's Edmund is not nearly pious and conflicted enough. He is meant to be joining the clergy. I am sure I would have thought it was an average film if I didn't know the original source, but it was a big disappointment.",
         "They say the great thing about Shakespeare's work is that it is so open to interpretation. Every director can bring his or her fresh eyes to a play and make it new. Even so, I think we are obliged to stay true to the basic tennents of the text. Are the works of Jane Austen as open to interpretation? Maybe, but I doubt it; Certainly not if MANSFIELD PARK is anything to go by. MANSFIELD was always my favourite of Austen's six novels. Many modern critics, while not denying its basic greatness, have problems with the book. Many find FANNY PRICE unlikeable, many find her judgemental, and feel that her Stoic, Augustan approach is hard to relate to. Stand-by, do nothing, and eventually he'll see the error of his ways and come to love you. Not very modern, is it? OK, so if you don't like the main character, if you don't like what she has to say, then what do you do? Look for other aspects of the story you can relate to. In recent years some critics have chosen to see MANSFIELD PARK in Post-Imperial terms, as a critique of Slavery. After all, the family's wealth is based on plantations in Antiga, which were run by slaves. Is that what the book's about? Is it? I don't know. I think the evidence is a little slim, but who am I to deny the possibility? Maybe it plays a part in the subtext of the novel. So, I'm a modern script-writer who doesn't like the novel, it's pre-occupations or even Fanny Price. What do I do? I completely re-write the story to take a possible minor sub-text (slavery) and turn it in to the driving narrative force. I then take smart as a whippet, stubborn yet passive Fanny and turn her into a ballsy version of Bridget Jones. With an attitude. I then string together a couple of scenes from the book with a few invented bridging scenes to advance the romance. Et Voila! I have a completely different story! I don't know what this film is, but it isn't Mansfield Park. Enjoy it on its own terms, but don't ever get the idea that your watching Austen on the screen. But, jeeze. I think that if you're going to adapt a novel for the screen, you ought to at least like the source material; Otherwise, what's the point? If you don't like the main character, you shouldn't be able to completely re-invent her. Or if you do, you should have the decency to be a little ashamed.",
         "This isn't an awful movie. It's quite watchable. Some of the acting, especially from Pinter is excellent. But the rest resembles those films made from classic novels in the 30s where no one concerned in making it had time to read the book. A quick treatment by a college student, a quick script conference, then off we go. Rozema has almost no idea of what the book is about but is entirely unembarrassed by her ignorance in her interview on the DVD. Austen fans don't have to wait long to discover just how far off the wavelength she is. The first contact between Sir Thomas and Fanny is a reproof for running through MP's corridors shrieking like a banshee. Lines are taken from Mary Crawford in the book and given to Fanny in the film. How's that for missing the point? One by one characters appear looking no more recognisable than if they were appearing in a literary celebrity edition of Scooby Doo. I agree with other reviewers that if the film was called something else and the characters had different names, it would be impossible to trace it's origins to Austen's book which is definitely not a conventional love story about bright young things getting together having overcome a few obstacles. There's very little to choose between the morals of Rozema's characters, so nothing of the catastrophic descent into the abyss is associated with the production of Lover's Vows, nor do we have any glimpse of Rushworth and Crawford vandalising Sotherton. Mrs Norris is one of the most deliciously evil creations in literature - Rozema reduces her part to a few lines. Thomas Betram is a \"modern\" artist - yikes! William Price, Fanny's brother and one of the key relationships in the book, is missing altogether. Susan, her sister, has been reading too many Style magazines. Mansfield Park might have been a bit like this had it been written by Georgette Heyer or even Jackie Collins. As an Austen adaptation it is execrable. But it's so far off the mark, that as something else entirely, it's not all that bad. Maybe they should just change the title.",
         "I have to wonder if the folks who are praising this film to the skies have ever read the book. I am not a Jane Austen purist - if I were, I could not say that the Root/Hinds version of Persuasion was my favorite Austen adaptation, which it is. This is Patricia Rozema's Mansfield Park, NOT Jane Austen's. First, Rozema gives us a feisty, spirited Fanny Price, who tells off Aunt Norris and Sir Thomas, who accepts Henry Crawford's proposal, and then rejects it the next day (a la JA herself with Harris Bigg-Wither). In this MP, Sir Thomas deserves to be \"told off.\" He is portrayed as a lecherous \"dirty old man,\" who leers at Fanny and Mary Crawford throughout the film. We have all heard about the additions Rozema made to the film. She deals with the slavery issue in a very heavy-handed way, beating us over the head with it whenever possible. Tom Bertram is not the empty-headed fop he is in JA's book; here he is just as much an abolitionist as Fanny, and it is his sketchbook filled with incriminating drawings of Sir Thomas abusing the slaves in Antigua that Fanny finds. In fact, Rozema's take on Tom is rather bizarre; in the book, his arguments with his father center around his irresponsibility and his profligacy. In the film, while Sir Thomas tries to scold his son for these faults, Tom takes him to task for his activities in Antigua. What I found odd was that, if Tom is such an abolitionist, why would he be so free and easy with money tainted by the slave trade? Rozema left out what I consider to be some very important people and scenes. William Price and the Grants are nowhere to be seen; as a result, there is no amber cross bought with prize money, no distress over which chain to wear to the ball, no one to accompany Fanny to Portsmouth. Fanny's dislike and distrust of Henry are never fully explained. We never get to see the outing to Sotherton and, while we do see Maria flirting relentlessly with Henry, we never see him playing one sister off against the other. Fanny's disapproval of the theatricals is never explained either. In Rozema's version, it seemed as if Fanny was simply not invited to be in the play, instead of being unalterably opposed to it. The scene with Fanny playing Anhalt to help Mary Crawford rehearse is also completely wrong. Mary starts caressing Fanny, while Edmund watches with his eyes almost popping out of his head. So, instead of Edmund giving in and joining the play in order to spare his family the embarrassment of publicity, we are left with the impression that he takes on the role of Anhalt just so that he can justify having Mary run her hands all over him. Next, we have the scenes at Portsmouth. Here, we have Henry sending Fanny a display of fireworks and doves, and then we see her accepting his proposal and sealing the bargain with some less-than-chaste kisses - in public, no less! The (in)famous sex scene between Maria and Henry takes place at Mansfield Park rather than in London and, because Rozema has played with JA's chronology of events, Fanny is already back from Portsmouth, and it is she who catches them in the act. Edmund is present for the aftermath, where Maria tries to defend her actions. Another thing that galled me no end is that Mary Crawford's defense of her brother's actions is done in person, at Mansfield Park. She is patronizing towards all concerned, including Sir Thomas, who has finally stopped leering by this point. The newspaper item announcing Maria and Henry's behavior to the world is read by Fanny, and the culprits' full names are used, which is also not the way it happened in the book. A couple of people walked out about 1/3 of the way through the screening I attended, and several others walked out just as the credits began. The Wishbone versions of Pride & Prejudice and Northanger Abbey resemble the source material more than this trash does. Shame on you Ms. Rozema, shame on you!",
         "As a romantic comedy, this is a good film. The acting is fairly good - particularly Johnny Lee Miller, who makes an excellent Edmund. But the story is not that of Jane Austen's wonderful novel. The Fanny Price of the novel is a delicate wallflower, intelligent and warm but extremely timid. In the film, she's feisty and strong-willed, independent and almost rebellious. Fanny Price is not confident and witty; she is shy and thoughtful. This \"new\" Fanny may fit modern sensibilities, but I was severely disappointed; by completely altering the main character, the whole story seems different. I should very much like to see an adaptation of the novel that remains as faithful to the book as the BBC's excellent mini-series version of Pride and Prejudice (the Colin Firth / Jennifer Ehle version) or Emma (with Kate Beckinsale, not the Gwynneth Paltrow version). If you want a romantic movie, go for it. But if you're an Austen fan, you might want to stay clear.",
         "Although I know better than to expect a \"pure\" adaptation of a novel when Hollywood gets hold of it, I was nevertheless unprepared for the horrible mangling this novel received at the hands of the screenwriter. Having immensely enjoyed recent renderings of \"Sense and Sensibility,\" \"Emma,\" and various versions of \"Pride and Prejudice,\" I expected to receive similar enjoyment from this film. I had not read any reviews or advance press before watching it. I had, unfortunately, just read the book itself this summer and it was fresh in my mind. In my opinion this is the WORST rendition of a Jane Austen work I have ever seen. Perhaps if I had never read the book, I might have enjoyed it somewhat more, but to me it was unbearable to see a book I thoroughly enjoyed so completely rewritten. I am astonished at the comments of some of the reviewers here opining that Jane Austen would have approved. Poppycock! I began to feel sick early on. To me, the character of Fanny Price and other major characters bore as much resemblance to Jane Austen's heroine as Danny Devito bore to Arnold Schwarzenegger in \"Twins.\" The entire invention of Fanny as a budding writer, the deletion of her younger brother who was so important in the plot concerning Henry Crawford, the image of Fanny as somewhat outspoken and rebellious, the depiction of Fanny's aunt as an opium addict and her uncle as a brutish, raping slaveowner.... The list goes on and on. Henry and Maria being caught by Fanny in the house, Fanny voluntarily kissing Henry and agreeing to marry him and then retracting. Ugh! I really detest writers who want to mold everything in the modern vein. Fanny Price was not a modern heroine, but she fit her time. There was far too much PC propaganda and feminist hogwash which you might expect in a movie about our society but is ridiculous set against Fanny's time. She was devout, loyal, quiet, humble, stubborn only in her keen perception of others' character as measured against her conviction of what was good and what was not, possessing an innate strength of character which did not rely on others' perception of her and which she refused to compromise. Jane Austen would not have approved of this new Fanny for precisely this reason: her Fanny did not care about the \"new\" conventions of moral thought and permissiveness in her own society. The movie downplayed the seriously flawed characters of Henry Crawford and his sister. It portrayed him far too sympathetically, made it appear that he truly and deeply loved Fanny and seemed to blame Fanny's (non-existent) double-mindedness for his downfall. All in all, this is an extremely disappointing film if one cares about what was really written in Mansfield Park. I think \"Clueless\" as a modern version of \"Emma\" (and which I also enjoyed) is more true to Austen than this let-down of a movie.",
         "Jane Austen's usual themes (love, snobbery, the place of women in society) are all addressed in this film of 'Mansfield Park', but fans of the book claim that the film is unfaithful to the original. Not having read it, I can't comment on that, but whereas I enjoyed Douglas McGrath's 'Emma' and Ang Lee's 'Sense and Sensibility' (both praised as faithful to their texts), 'Mansfield Park' is certainly less successful, losing coherence but gaining stridency compared to those works. In 'Emma', for example, the joy was in a precocious young heroine gradually learning that there were things she did not know; but haughty Fanny Price, the main character in this film, is always right, witty, invariably possessed of good judgment and anachronistic feminist attitudes - in other words, completely unbearable. Some of the dialogue seems similarly out of time, the young Fanny and her sister are inexplicably played by a couple of self-consciously adorable American kids, and audience is consistently encouraged to apply modern values to judge the characters. Other things also seem odd (Fanny has lived with the family for many years, but they continually treat her as if she had just arrived; the social placement of Fanny, her aunt and mother are never explained; and as Fanny and the leading male are mutually in love throughout the story, it's hard to see why it takes them a whole film to get together). If one scene serves as a good example of what's wrong with this film, it's when Fanny catches a suitor in flagrante with another woman. Jane Austen wrote highly subtle dissections of the social structures around her, disguised in the form of acceptable romances - that's the merit of her work. The beauty of the story lies in the form of its telling. The absence of explicit sex from (some) old books isn't necessarily a failing, just as you don't necessarily improve a classic thriller by remaking it with bigger guns and louder explosions. It's a small scene, but one senses that director Roezma doesn't really understand her own material. A disappointment.",
         "For half or two-thirds of its length, I thought this a fair enough movie. True, it's a poor telling of the novel, bits from which are stuck together without the structure of it being clearly conveyed or, apparently, recognized. Also true, it's filled with bad theatrical ideas, such as combining the heroine of the novel with Austen herself (and then casting the role with an actress who can play neither one). And also true, it's played less like an Austenian social comedy than like a half-baked version of Tom Jones. All these things notwithstanding, up to a point it's entertaining enough. (However, \"enough\" here means, as always in this usage, not quite enough. Halfway through the movie, not seeing much I recognized on screen, I turned to the novel, and found one paragraph of it more involving, amusing, and wise than everything in the movie rolled together. But let that pass.) Then came the Social Significance - as if Austen's novels were not full of social significance. Evidently the adapter disliked the nineteenth century, and Austen, and set out to show them up for what they were. I pretended to miss the insinuation of her father's having molested her and her sister--there being no other interpretation to be placed on the looks exchanged between the two of them and their mother when he gives Fanny a hug. But then Fanny turns up an album of atrocity pictures showing what her (almost) foster father, his son, and his crew were really getting up to with their slaves. This exceeds allowable bounds. Such a device might be imposed on Fielding, or on Dickens, without betraying the author's purpose too far; but not Austen. It obliterates the story, or what's left of it. In the face of rapes and beatings and tortures, who gives a fig whether Miss Price and her Reverend get together? Yet the comedy of manners continues galumphing along as if the scene had never happened. Having forced it in, the adapter makes no changes in the narrative to accommodate it. This is film-making for MTV watchers, i.e. patients with short-term memory loss. Ah - the adapter might counter - but that's just the point! The characters act as if these horrors didn't exist! To which I would reply: if she felt, reading the novel, that the squire was just the kind of man who would have done that sort of thing, white European male pig that he was, and that Austen (owing to her famous ignorance of human nature, which causes her books to continue to be read two centuries later) was too much of a booby to see it, whereas the adapter's own superior sensibility makes all things manifest, she might at least have done Fanny the justice of having her react to the discovery as she would have, given her character. The story turns on her absolute moral rectitude and her rejection of the amorality represented by the Dangerous Liaisons characters. In the face of the dark deeds of which she becomes aware, her denunciation of the others becomes itself amoral and hypocritical, for she has silently acquiesced in the viciousness of her class. This conclusion must be extrapolated, since it is nowhere stated in the film, the adapter not having troubled to stir in the muck she has tossed into the pot. But I can't help wondering, if her object was to discredit Fanny, as well as the monsters around her--if she had so little use for the character as that--why did she choose to do this book?",
         "Had Rozema given this story a new title, introduced the characters with original names, I don't believe that anyone would have suspected it had somehow originated from Jane Austen's appraised novel, Mansfield Park. It would have spared her the resentment I am sure that many others share with me towards her. I was perfectly disgusted by this rendition of Jane Austen's novel. I cannot believe that Patricia Rozema could have had any love for the book to create a story so blatantly ignorant of its origin. The characters, which were distorted beyond recognition, had no constancy as they were rapid-fired from scene to scene, without direction and without guide. Had Rozema at least had the decency to pace the story as it should have been, to select lines from the book which did serve as character-building stepping stones, and given Fanny the goodness, the gentility and submissiveness she carried through-out the novel, I could have looked less harshly on this film. I was also furious at Lady Bertram's opium addiction, at Mary Crawford's hints at lesbian tendencies, at Sir Thomas Bertram's motives and dealings in Antigua, and the complete unnecessary, though brief, nude scene with Maria Bertram and Henry Crawford. These were completely out of place and did not contribute to the story in the least. Altogether a great disappointment and a poor introduction for those who have never read Jane Austen's novels or seen the other (more faithful) theatrical adaptations to her stories.",
         "Director Rozema does for film what Austen does for the novel. In place of Austen's beautiful prose, Rozema's Mansfield Park delivers delicately crafted performances, heartbreakingly poetic cinematography, and a haunting score by Lesley Barber, but still manages to capture Austen's wit throughout. Frances O'Connor and Jonny Lee Miller (as Fanny Price and Edmund Bertram) carry the film with their subtlety and chemistry, and a few scenes between the two are enough to deem the film a masterpiece. But they are not the only merits: the supporting cast breathe dimensionality to their characters with interesting interpretations of Austen's work. Most notable are Lindsay Duncan in her dual roles as Mrs Price and Mrs Bertram, and Victoria Hamilton as an intensely human Maria. Sophia Myles and Justine Waddell display equal genius albeit within the limitations of somewhat small roles. It is more difficult to gauge the performances of Alessandro Nivola and Embeth Davidtz; their characters are too affected by choices made in the script (arguably, Henry Crawford for the better and Mary Crawford for the worse). One can be a fan of Jane Austen and still appreciate the film. Although it bears little resemblance to the novel itself, it embodies much of the spirit of Austen and draws from her other novels where Mansfield Park the novel might be, dare I say, lacking. I am an ardent supporter of Austen, but I must say that the film version makes a commendable choice in choosing a protagonist that shares more of Pride and Prejudice's Elizabeth Bennett's spirit than the subdued Fanny of Mansfield Park. The film does, of course, have its flaws. The slavery issue is treated in a manner too heavy-handed to blend with Austen's style, and the same can be said of the hints of lesbianism that are just painfully out of place. The sexual tension is often a touch too overbearing in the film, although I agree with Rozema in saying that the film does not create this sexuality anew but draws from the tension latent in the novel (with the exception of the above-mentioned lesbianism). Other disappointments include Sir Bertram and Tom Bertram, who are practically caricatures that mar the otherwise brilliant characterization in the film. Regardless, the film's high points far outweigh its imperfections -- all in all, highly recommended."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Arts Council of England",
         "British Broadcasting Corporation (BBC)",
         "HAL Films"
      ],
      "summaries": ["At 10, Fanny Price, a poor relation, goes to live at Mansfield Park, the estate of her aunt's husband, Sir Thomas. Clever, studious, and a writer with an ironic imagination and fine moral compass, she becomes especially close to Edmund, Thomas's younger son. Fanny is soon possessed of beauty as well as a keen mind and comes to the attention of a neighbor, Henry Crawford. Thomas promotes this match, but to his displeasure, Fanny has a mind of her own, asking Henry to prove himself worthy. As Edmund courts Henry's sister and as light shines on the link between Thomas's fortunes and New World slavery, Fanny must assess Henry's character and assert her heart as well as her wit."],
      "budget": 0
   },
   "movielensId": 3079,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-11-12",
      "dvdReleaseDate": "2000-07-11",
      "directors": ["Patricia Rozema"],
      "runtime": 112,
      "movieId": 3079,
      "title": "Mansfield Park",
      "mpaa": "PG-13",
      "actors": [
         "Frances O'Connor",
         "Lindsay Duncan",
         "James Purefoy",
         "Sheila Gish",
         "Harold Pinter",
         "Victoria Hamilton",
         "Hugh Bonneville",
         "Justine Waddell",
         "Embeth Davidtz",
         "Alessandro Nivola",
         "Sophia Myles",
         "Jonny Lee Miller",
         "Hannah Taylor-Gordon",
         "Talya Gordon",
         "Bruce Byron",
         "Elizabeth Eaton",
         "Elizabeth Earl",
         "Philip Sarson",
         "Amelia Warner",
         "Charles Edwards",
         "Anna Popplewell"
      ],
      "imdbMovieId": "0178737",
      "originalTitle": "Mansfield Park",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["tWbOcYHtP94"],
      "plotSummary": "This fun and sexy comedy tells a timelessly entertaining story where wealthy, secret passions and mischievous women put love to the test.. When a spirited young woman, Fanny Price, is sent away to live on the great country estate of her rich cousins, she's meant to learn the ways of proper society. But while Fanny learns \"their\" ways, she also enlightens them with a wit and sparkle all her own!",
      "tmdbMovieId": 10399,
      "avgRating": 3.76997,
      "releaseYear": "1999",
      "numRatings": 1552,
      "posterPath": "/reh2SdnPDmFbjWWAEbTv9GgQbke.jpg"
   }
}