{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "hairdresser",
            "id": 928
         },
         {
            "name": "sexual frustration",
            "id": 2039
         },
         {
            "name": "funeral",
            "id": 3739
         },
         {
            "name": "business man",
            "id": 4480
         },
         {
            "name": "poland",
            "id": 21747
         }
      ],
      "imdb_id": "tt0111507",
      "video": false,
      "title": "Three Colors: White",
      "recommendations": [
         110,
         108,
         1600,
         31056,
         797,
         144,
         843,
         614,
         3782,
         113,
         10217,
         405,
         10238,
         147,
         833,
         934,
         11506,
         2013,
         777,
         851
      ],
      "backdrop_path": "/vDjKiiCsJah9qVutwTY07D5GIK5.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Karol Karol",
               "gender": 2,
               "credit_id": "52fe4219c3a36847f8003d17",
               "name": "Zbigniew Zamachowski",
               "profile_path": "/rfE2QqqCSRU3EY8cDdQBpULu6os.jpg",
               "id": 1145,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Dominique",
               "gender": 1,
               "credit_id": "52fe4219c3a36847f8003d1b",
               "name": "Julie Delpy",
               "profile_path": "/rd40f4QpAUUne3hMaUhHrZtcK2c.jpg",
               "id": 1146,
               "order": 1
            },
            {
               "cast_id": 15,
               "character": "Mikolaj",
               "gender": 2,
               "credit_id": "52fe4219c3a36847f8003d37",
               "name": "Janusz Gajos",
               "profile_path": "/j8HQOPCGNXMfTPrk7fJ3wFEuCDP.jpg",
               "id": 1147,
               "order": 2
            },
            {
               "cast_id": 16,
               "character": "Jurek",
               "gender": 0,
               "credit_id": "52fe4219c3a36847f8003d3b",
               "name": "Jerzy Stuhr",
               "profile_path": "/2SqqKdL835Hg5aLCPKVOyZyggCN.jpg",
               "id": 1148,
               "order": 3
            },
            {
               "cast_id": 17,
               "character": "Le notaire",
               "gender": 2,
               "credit_id": "52fe4219c3a36847f8003d3f",
               "name": "Aleksander Bardini",
               "profile_path": "/eKA1CdsPcekZzlYB9vzZAxDgRPm.jpg",
               "id": 1149,
               "order": 4
            },
            {
               "cast_id": 18,
               "character": "L'elegant",
               "gender": 0,
               "credit_id": "52fe4219c3a36847f8003d43",
               "name": "Grzegorz Warchol",
               "profile_path": "/9QN0RgNOitBQMVKEfQjeMz9sXhr.jpg",
               "id": 1138501,
               "order": 5
            },
            {
               "cast_id": 19,
               "character": "L'inspecteur",
               "gender": 2,
               "credit_id": "52fe4219c3a36847f8003d47",
               "name": "Cezary Harasimowicz",
               "profile_path": "/1Tl4EO7Mwto3lJmLVMrjfeI0b2X.jpg",
               "id": 6415,
               "order": 6
            },
            {
               "cast_id": 20,
               "character": "La vieux payson",
               "gender": 2,
               "credit_id": "52fe4219c3a36847f8003d4b",
               "name": "Jerzy Nowak",
               "profile_path": "/b1td2cfJhlxEG7QEijf3c6e2mCi.jpg",
               "id": 7119,
               "order": 7
            },
            {
               "cast_id": 21,
               "character": "Le juge",
               "gender": 2,
               "credit_id": "52fe4219c3a36847f8003d4f",
               "name": "Philippe Morier-Genoud",
               "profile_path": null,
               "id": 19075,
               "order": 8
            },
            {
               "cast_id": 22,
               "character": "Julie Vignon",
               "gender": 1,
               "credit_id": "52fe4219c3a36847f8003d53",
               "name": "Juliette Binoche",
               "profile_path": "/rkW6eE75Tt1i3J1s2fsIDZBW0kd.jpg",
               "id": 1137,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4219c3a36847f8003d01",
               "name": "Marin Karmitz",
               "profile_path": "/t9KgqeBerwxwnSkvkvlapJ8gcSS.jpg",
               "id": 1134,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4219c3a36847f8003d07",
               "name": "Zbigniew Preisner",
               "profile_path": "/bBebcS5dznOr7l9lBZqzISgeYYC.jpg",
               "id": 1135,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4219c3a36847f8003d0d",
               "name": "Edward Klosinski",
               "profile_path": null,
               "id": 1143,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4219c3a36847f8003d13",
               "name": "Urszula Lesiak",
               "profile_path": null,
               "id": 1144,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4219c3a36847f8003d27",
               "name": "Krzysztof Kieślowski",
               "profile_path": "/aNvobc9gzJWIiHLNHx08tpmb5n1.jpg",
               "id": 1126,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4219c3a36847f8003d2d",
               "name": "Krzysztof Kieślowski",
               "profile_path": "/aNvobc9gzJWIiHLNHx08tpmb5n1.jpg",
               "id": 1126,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4219c3a36847f8003d33",
               "name": "Krzysztof Piesiewicz",
               "profile_path": "/pq57vilI1WSLBwQmizVFo3MmFQq.jpg",
               "id": 1132,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "553e2965c3a3683c480060fa",
               "name": "Halina Dobrowolska",
               "profile_path": null,
               "id": 66457,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "553e29959251416874007592",
               "name": "Claude Lenoir",
               "profile_path": null,
               "id": 1174114,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "553e29afc3a3683e55007d83",
               "name": "Margot Capelier",
               "profile_path": null,
               "id": 10471,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "553e29c292514138a900a560",
               "name": "Teresa Violetta Buhl",
               "profile_path": null,
               "id": 1459966,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "553e29d2925141125600da98",
               "name": "Yvon Crenn",
               "profile_path": null,
               "id": 67535,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 7.958338,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "PL",
            "name": "Poland"
         }
      ],
      "id": 109,
      "vote_count": 280,
      "budget": 0,
      "overview": "Polish immigrant Karol Karol finds himself out of a marriage, a job and a country when his French wife, Dominique, divorces him after six months due to his impotence. Forced to leave France after losing the business they jointly owned, Karol enlists fellow Polish expatriate Mikolah to smuggle him back to their homeland.",
      "similar": [
         4922,
         634,
         914,
         162,
         423,
         424,
         10661,
         50544,
         112160,
         334541,
         289222,
         9928,
         9486,
         1643,
         667,
         956,
         712,
         1607,
         2196,
         527
      ],
      "original_title": "Trois couleurs : Blanc",
      "runtime": 91,
      "poster_path": "/xOLY69rXKwuH9JUnOE4G2HHKiW5.jpg",
      "spoken_languages": [
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Magyar",
            "iso_639_1": "hu"
         },
         {
            "name": "Polski",
            "iso_639_1": "pl"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Le Studio Canal+",
            "id": 183,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "France 3 Cinéma",
            "id": 591,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Eurimages",
            "id": 850,
            "origin_country": ""
         }
      ],
      "release_date": "1994-01-26",
      "vote_average": 7.4,
      "belongs_to_collection": {
         "backdrop_path": "/AeHExfHIl70SZCea907KfEoSkfJ.jpg",
         "name": "Three Colors Collection",
         "id": 131,
         "poster_path": "/rVdd23QuT5rHX7lZvuAkRRUkeCZ.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Krzysztof Kieslowski"],
      "runtime": 91,
      "synopsis": "After opening with a brief, seemingly irrelevant scene of a suitcase on an airport carousel, the story quickly focuses on a Paris divorce court where Polish immigrant Karol Karol (Zbigniew Zamachowski) is pleading with the judge (the same legal proceedings that Juliette Binoche's character Julie briefly stumbled upon in the previous film 'Blue'). Despite his difficulty in understanding French, Karol is made to understand that his French wife Dominique (Julie Delpy) does not love him. The grounds for divorce are humiliating: Karol was unable to consummate the marriage. Along with his wife, he loses his means of support (a beauty salon they jointly owned), his legal residency in France, and the rest of his cash in a series of mishaps, and is soon a beggar living on the streets. He only retains a 2-franc coin that he got as change from the phone while trying to speak with his now ex-wife. In a Paris Métro station, performing songs for spare change, Karol meets and is befriended by another Pole, Mikoaj (Janusz Gajos). While Karol has lost his wife and his property, Mikoaj is married and successful, he offers Karol a job consisting of killing someone who wants to be dead but does not have enough courage to do it himself. Through a hazardous scheme, Mikoaj helps him return to Poland hidden in the suitcase shown at the beginning of the film, which is later stolen by employees at the airport. The airport thieves, eager to find something valuable inside their stolen trunk, are angry when they open it and they find Karol inside. The thieves beat up Karol and leave him behind in a nearby garbage dump. Despite his mishap, Karol returns to working as a hairdresser with his brother (Jerzy Stuhr) whom he now moves in with. After a while, Karol, no longer content to working at his brother's salon, quits his job and sets up to make himself a pot of cash in newly capitalist Poland. Karol takes another job as as a bodyguard in a seemingly innocent cash exchange office. Mikoaj meets Karol in a Warsaw Metro tunnel for the execution of the \"suicide\", it turns out to be that Mikoaj is the intended victim and asks Karol to kill him. Karol shoots a blank into Mikoaj's chest and asks him if he really wants to go through with it as the next bullet is real. Mikoaj refuses and is able to feel alive again. Using his position as a deceptively foolish bodyguard, Karol spies on his bosses and discovers their scheme to purchase different pieces of land that they knew were going to be targeted by big companies for development and resell for large profits. Karol beats them to it, and then tells his ex-bosses that if they kill him all his estate shall go to the Catholic Church, and they are therefore forced to purchase all the land from him. With the money he gained from this scheme and with the payment from Mikoaj, the two go into business (of a vaguely defined but possibly illegal nature) together. Karol becomes ruthlessly ambitious, focusing his energies on money-making schemes while learning to speak French and brooding over his wife's abandonment. He uses his new financial influence in a world where, as several characters observe, \"you can buy anything\" to execute a complex scheme to first win back Dominique, and then destroy her life. Karol takes his revenge against his ex-wife by faking his own death after which she shows up for his funeral. Karol then sneaks into her hotel room and has sex with her to prove his potency again. Then afterwords, Dominique is arrested and imprisoned for his 'murder'. The final image of the film shows Karol secretly visiting his wife in prison and staring at Dominique through the window of her prison cell, while she is crying. Karol then suddenly feels ashamed at himself for this revenge plot against his wife and decides to try to get back together with her when she is released after he clears the air over faking his death.",
      "writers": [
         "Krzysztof Kieslowski",
         "Krzysztof Piesiewicz"
      ],
      "originalLanguage": "Polish",
      "imdbLink": "http://www.imdb.com/title/tt0111507/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BODUzNDcwNzY4Ml5BMl5BanBnXkFtZTYwODk4Mzk5._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Zbigniew Zamachowski, Julie Delpy, Janusz Gajos | See full cast and crew »"],
      "reviews": [
         "Ostensibly Kieslowski chose white of the French flag to make a movie on equality. Equality if it can be reached in marriage, makes it work. Marriage is rocked when an equilibrium is not reached. A dove can be caressed and be a symbol of peace and purity; a dove can defecate and dirty as well White in the movie is used as an epiphany of the joyous moments in marriage. The doves are weaved in Kieslowski visually and aurally to accentuate the marriage as a rite of passage in life. He brings in the phrase \"light at the end of the tunnel\" towards the end of the film. There is another marriage, that of Mikolaj in the subplot that also survives in a strange way. The film begins with divorce proceedings and ends with the wife signalling the reinstatement of the wedding ring on her finger. The film begins with husband recalling the wedding that has failed. The doves flying overhead unload excreta on him. Towards the end of the film, the husband again recalls the wedding as he sets off for the wife's prison. Kieslowski's treatise on equality is based on marriage as a great leveller with the doves flutter captured on the soundtrack appearing as a frequent reminder of marital bonds. It even appears in the underground metro, an unlikely place if you have a logical mind. You have to throw away logic if you need to enjoy this film. There are aspects of the film that are obviously unrealistic. Putting a grown man in a suitcase and letting the suitcase go through airport security is not feasible. Moreover, the director shows the heavy suitcase perched precariously on a luggage cart. Impossible to believe all these details. But the deeper question is whether Kieslowski was using marriage as a metaphor for politics? There is the mention of the Russian corpse with the head crushed for sale, there is a mention of the neon sign that sputters...The name Karol Karol seems reminiscent of Kafka. Sex in this film is not to be taken at face value. Impotence of Karol Karol at strategic points of the film is deceptive. He apparently does more than hair care for women clients at his hair care parlor in Poland (suggested, not shown). I have a great admiration for Polish cinema, having gown up watching works of Wajda and Zanussi. I met Kieslowski in 1982 when he attended an international film festival in Bangalore, India, promoting his film \"Camera Buff,\" another film with Jerzy Stuhr, who plays Jurek in \"White\". I took note of \"Camera Buff\" but I could not imagine the director of \"Camera Buff\" would evolve into a perfectionist a decade later. Stuhr has been metamorphosed from a live wire in \"Camera Buff\" to an effeminate colleague of Karol Karol in \"White\". \"White\" is a carefully made work with support of other top Polish directors in the wings--Zanussi and Agniezka Holland. Although the film is heavy in symbolism, it is also a parody. Karol Karol comes to kill with a blank bullet and a real one. Did he plan that out, when he did not know who he was going to shoot? The performances are all brilliant--the good Polish, Hungarian, and Czech filmmakers extract performances from their actors that could humble Hollywood directors, because the stars are not the actors but the directors. Great music. Great photography. And a very intelligent script. This is a major film of the nineties--providing superb wholesome entertainment and food for thought. The film deservedly won Kieslowski the \"best director\" award at the Berlin Film festival in 1994. It is sad for the world of cinema that Kieslowski is no longer with us.",
         "Imagine that the woman you love has successfully filed a claim against you, and that this claim has become so nasty the courts have awarded her all her freedom. In turn, however, all which you have worked for so hard has gone down the drain and a pair of scissors snip your access to monetary freedom, effectively making you a homeless person who can't even go back home. Much more vicious than its predecessor, THREE COLORS: WHITE introduces us to this story of a marriage gone sour. Karol Karol (Zbigniew Zamachowski), named so for his clear link to the Everyman we all know as Charlie Chaplin (the actor has a passing resemblance to the character) is the man in question, who has lost everything and in turn is marinating in two very different emotions: the desire to get even, but the need to get his wife Dominique (Julie Delpy) back. The tone established in WHITE is fate. Even in its darker moments there is an element that something beyond the characters' control is making its way to an uncertain conclusion. I can see that in the scene when Karol meets Mikolaj (Janusz Gajos), an enigmatic man who passes him by and recognizes a song he is playing on a comb: their interaction under the streets of Paris feels almost preordained and it's not surprising when soon Mikolaj, a man with a secret, is helping Karol get back to Poland. What is surprising is the way these events happen, but I will not reveal them because of two things: one of them has to do with a test of friendship that suddenly swings the film into high gear and liberates it from its moral heaviness seen in the first third of the film, and secondly, because Kieszlowski connects several disjointed scenes involving Dominique and Karol that will eventually reveal themselves not to be out of time or imagined but very real. THREE COLORS: WHITE is all about the symbolic nature of the color inasmuch as 'equality'. At the beginning Karol is 'erased' from society. He has been whited out because he could not consummate his marriage. There is a gun fired, but it only has blanks. Dominique is a woman with a white-hot, destructive personality. White doves come into a scene where Mikolaj, an angel of sorts, saves Karol from a grim destiny, and the angelic face of love is the white bust that survives most of the film as Karol begins his plans to move against Dominique. At the same time we have two moments of its position in the French flag that also come into play when seen as a trilogy. At the beginning, Karol's freedom (blue) is destroyed as his bank card is repossessed. Equality (white) shimmers in one particular scene in which Dominique achieves orgasm. In the closing, irony-filled sequences, Dominique is seen enveloped in lush red tones, which will establish the tone of the next film RED, fraternity.",
         "I love the entire Three Colors trilogy, but \"White\" is my sentimental favorite because I sympathize so deeply with the hero. I've experienced the same kind of competitive, destructive love that drives Karol throughout this movie, and I'm also a nerdy schmuck like he is, so I found myself really commiserating with him. Unfortunately, \"White\" has acquired a reputation as the weakest entry in the series. I think it's the odd one out, but certainly not the worst. It's the only one of the three that regularly stretches credibility (the plot twists are really wild), and the only one with a male protagonist, but it's also the most exciting of the films and, ultimately, the most disturbing. The ending in particular is a killer. \"Red\" tinkers a bit with \"White\"; in fact, if I'm not mistaken, it entirely changes the resolution of this film for the worse. That's too bad. \"White\" works best on its own, as a pessimistic movie, without the more optimistic outlook of \"Red\" grafted on in retrospect. But since both films are so great on their own, I'm not too bothered by their failure to gel properly.",
         "WHITE IS THE COLOR OF DOMINIQUE'S WEDDING DRESS at the exit of the church, surrounded by the blazing whiteness of an overexposed background, full of subtle symbolisms imbued with hypnotic nuances. WHITE is the glimmer of the impending reflexes in the background of a lazy town buried under the snow. WHITE is the bust of a statue caressed as a memento of a love irremediably lost. WHITE is Dominique's final orgasm, a real scream of liberation from the yoke of her spiteful stubbornness, the false revenge of a woman unaware of her impending calamity, completely unacquainted with the bitter game of make-believe inspired by a wickedness that cries out for vengeance. According to Karol, the main character, it's better to have loved and lost than never to have loved at all. His desire for revenge blows out his residual flickering flame of love after having suffered unforgivable affronts devised by his heartless wife. \"Trzy kolory: Bialy\" (Three colors: White), second episode inspired to the three colors of the French flag and to the three principles of the French Revolution (Freedom, Equality and Fraternity), brings back to us two old acquaintances, Zbigniew Zamachowski (very similar to the pathetic Italian character Fantozzi,) and Jerzy Stuhr. It may be considered the most unforeseeable movie of the whole colors trilogy, full of sharp and witty tones of grotesque melodrama, with a reluctant and peevish Julie Delphy never seen so cold-mannered on the screen before. The inborn sense of Kieslovski's BLACK humor comes out here in all its might almost counterbalancing the concept of absolute WHITE connected with he story. \"Three colors: white\" is very different from the other two episodes of the trilogy, but nonetheless the unmistakable touch of the genius can be generously found in the accurate care of the details, in the emotional intensity of the dialogs, in the careful analysis of the individual values, in his safe distance from the events represented by him, in his constant application of the principle of casualness and in his large use of metaphors (look for instance at the sequences of simultaneous flights of pigeons, symbolizing an open concept of freedom often cherished in his works). And Julie Delphy's following words sound as a sort of sincere homage to Kieslovski's art: \"Kieslowski is a director who draws his inspiration from the true life of people, who instills his own soul into his movie, who dwells upon the details as if he wanted to examine the life under a microscope.\" Absolutely true. There is nothing else left to say: \"Three colors: red\" looms on the horizon.",
         "Another interesting chapter in the saga, it is not as technically impressive as 'Bleu' but the story's premise is certainly more fascinating this time. Delpy pretty much plays a stereotype of evil, but as her soon to be divorced husband, Zamachowski is great, and it is quite interesting to follow his experiences, even if his motivations are a bit hard to relate to. Kieslowski uses some great camera angles once again, and this is another very well shot film, as well as one with some brilliantly fitting music, plus slow motion is used very effectively. There are ideas about love, equality and revenge, the plot is intriguing, and there are some very intense moments, making it another solid entry in the trilogy, even if it is not as critically acclaimed as the first film, 'Trois Couleurs: Bleu' or the last film, 'Trois Couleurs: Rouge'.",
         "White is a Polish film in Polish and French with English subtitles. The film is the second series in the Three Colours trilogy which started with the film Blue and ends with Red. The film takes place in France where a man named Karol Karol whose wife Dominique just divorced him. To make matters work Karol's bank account is frozen and he has no money and no place to go. In the subway he meets a man named Mikolaj who helps him get back to his homeland of Poland. Karol eventually gets there, but not the way he planned on. Once he gets to Poland some friends help him get back on his feet and establish himself. Soon he is doing fine, but is still upset over what Dominique did to him. So with some more help he plans a scheme of revenge to get back at her. Winner of The Silver Berlin Bear for Best Director (Krzysztof Kieslowski, who also co-wrote the film) at The Berlin International Film Festival. White has good direction, a good script, good performances by the entire cast, good original music and good cinematography. White is a very interesting film. From where it started off in the beginning I had no idea how it would end or what would happen next. It kept me following the movie eagerly waiting to see what happened next. It is a very smart and sharp story and the acting and great direction make this film really stand out as well. This film is in no ways similar to Blue, the previous film in the series and I really admire the director for making two totally different films that each work really well. I really loved White because of it's sharp script and because it kept me compelled and interested and I really did not know how it was going to turn out. After these two great films I'm looking forward to completing the series by watching Red. Judging by what I thought of Blue and White, I'm sure I'm going to like Red very much as well.",
         "It is not only difficult to comment separately on the three parts of Kieslowski's trilogy, it seems obvious that the filmmaker wants us to do just the opposite: view them in order, Blue, White, and Red, and consider them together as one complete work. It is true they are distinct stories with distinct themes: liberty, equality, fraternity, and each them is developed with unique applications of intrigue and artistry. They are each well worth seeing independently, but I believe they are best seen as one work. Collectively, I would rate the trilogy as a 9; separately, I place each in my top ten for the years 1993 and 1994. White is the fabric of a bride, chaste and pure at the outset of her marriage; later it is the flash of an orgasm in the dark; and then .... But any more said of the instances of white in this film might spoil it for the first-time viewer. Unlike Three Colors: Blue, White is a more plot-oriented movie, with two main characters to Blue's one. And this is as it should be. Blue's theme of Liberty, the first word of France's motto, is an individual's principle, while White's theme of Equality, the French motto's second word, requires at least two people. The central quest for liberty is personal; the struggle for equality is fundamentally social. White is the most conventional of the three Color films, and while it is still one of my ten top films of 1994, I rate it an 8, slightly less than the highly visual Blue and the mind-bending Red.",
         "Spoilers herein. Kieslowski's trilogy is usually explained, even by him, in trivial terms, this being the \"equality\" segment. But this is an intelligent filmmaker, one of the type who actually thinks about the narrative stance of his projects. In this case, we have \"Blue\" which follows - but not quite - the standard convention of reporting something that happened in the past. `Red' gives you a meditation on two folded presents. `White,' this film, is cast as depicting the future, in particular the conditional future. While other films attempt this more directly, ` White' - among the three - is so subtle that you have to actually pay attention. Everything is what you would do, every detail and plot element from the courthouse sequence. Is it all imagined? It doesn't matter, but if you consider it so - many parallel futures - it is easier to see how it fits in with the others. Even to the tense of the French Karol studies. I rate this as the least of the three because he does too much in the plot. The plot is there only to provide a skeleton for the rest, and it is intended to keep us occupied while he does his thing. But its just too elaborate to serve as a mere skeleton and gets in the way. Many viewers even think the story is what the film is about. Each of the three is an excellent film, but you must see the others first to get this one to register. Each of the three deals with a sense. This is `sight.' The DVD commentary is pretty useless, in my estimation. It is not enough to have been there. Ted's Evaluation -- 3 of 3: Worth watching.",
         "Seeing revenge in \"Blanc\" it's like you left the theater a couple of minutes before the end of the movie. The final scene is the explanation of Karol's strange actions. It is not a revenge story, it is a story of obsessive desire of possession. The \"love\"-story of Karol for Dominique. He tried to posses Dominique, he becomes a wealthy man and he is able to do ANYTHING to have her. Well, `anything' includes evil things. When a bird flies away from the master that \"loves\" it so much, what should be done? To put the bird into a cage. In this way, Karol will be able to see, feed, speak and listen Dominique every day. Karol finally posses Dominique.",
         "White is often referred to as the weak link in Krzysztof Kieslowski's trilogy of films based on the colours of the French flag, but this may be because many people consider drama to be a higher form of art than comedy. Make no mistake: though the punchlines may be particularly wry and ironic in tone, White is often a very funny film. It is also one of the most underrated movies of the '90's. Dominique, a French model, has divorced Karol, her Polish husband, because he is unable to consummate their marriage. Karol is initially grief-stricken but his despair soon turns to anger and he plots revenge. He decides to become as wealthy and successful as possible so as to win back his beautiful ex-wife, only to destroy her utterly. Surprisingly, he succeeds, but at great cost. Be careful what you wish for... Yes, I know it doesn't sound like a barrel of laughs, but it has many humorous moments. The scene where Karol is 'stolen' is one highlight, and his transformation from an impoverished wastrel sleeping on the streets of Paris to a powerful property developer with slicked-back hair is a joy to behold. Although White has far more lighter moments than either Blue or Red, this is still a Kieslowski movie. We laugh at Karol's outrageous gall but there are intermittent moments of gravity where the reality of his actions hit home with great force. Many of these scenes involve his dour friend Mikolaj, beautifully played by Janusz Gajos. Mikolaj, although a deeply unhappy man, is often the only person on screen who seems to suspect what the outcome of Karol's determination to achieve 'equality' will be. By the films bittersweet end both Karol and Dominique have got what they wanted, though not without unpleasant side effects. Although they are both prisoners in their own way, Karol has won back Dominique's love and, overwhelmed by her sacrifice, is unable to resist his passion for her. Through mutual love they have finally achieved equality. Krzysztof Kieslowski's ample talents are at full strength here, but White isn't a one-man show. The entire cast know they're onto a winner with this one and give their all, while Edward Klosinski's cinematography deserves credit for being consistently striking without ever overwhelming the action. White is somewhat overlooked now but I suspect that time will be kind and it will one day receive the recognition it deserves."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Mystery",
         "Romance"
      ],
      "productionCompanies": [
         "MK2 Productions",
         "France 3 Cinéma",
         "CAB Productions"
      ],
      "summaries": [
         "Karol (Polish) marries Domininque (French) and moves to Paris. The marriage breaks down and Dominique divorces Karol, forcing him into the life of a metro beggar and eventually back to Poland. However, he never forgets Dominique and while building a new life for himself in Warsaw he begins to plot...",
         "The destructive dynamics of a relationship based upon great inequality. Karol is a Polish hairdresser working in France. He has a beautiful wife, Dominique, whom he loves to obsession, and who is in the process of divorcing him for his inability to \"consummate the marriage\". Karol loses all of his earthly possessions and is literally driven out of France by his estranged wife. He then fights to resolve his deep passion for Dominique with his own helplessness.",
         "Second of a trilogy of films dealing with contemporary French society shows a Polish immigrant who wants to get even with his former wife."
      ],
      "budget": 0
   },
   "movielensId": 308,
   "movielens": {
      "languages": [
         "Français",
         "Magyar",
         "Polski"
      ],
      "releaseDate": "1994-01-26",
      "dvdReleaseDate": "2003-03-04",
      "directors": ["Krzysztof Kieślowski"],
      "runtime": 91,
      "movieId": 308,
      "title": "Three Colors: White",
      "mpaa": "R",
      "actors": [
         "Zbigniew Zamachowski",
         "Julie Delpy",
         "Janusz Gajos",
         "Jerzy Stuhr",
         "Aleksander Bardini",
         "Grzegorz Warchol",
         "Cezary Harasimowicz",
         "Jerzy Nowak",
         "Philippe Morier-Genoud",
         "Juliette Binoche"
      ],
      "imdbMovieId": "0111507",
      "originalTitle": "Trois couleurs : Blanc",
      "genres": [
         "Comedy",
         "Drama",
         "Mystery"
      ],
      "youtubeTrailerIds": ["xECEAPfdqic"],
      "plotSummary": "Polish immigrant Karol Karol finds himself out of a marriage, a job and a country when his French wife, Dominique, divorces him after six months due to his impotence. Forced to leave France after losing the business they jointly owned, Karol enlists fellow Polish expatriate Mikolah to smuggle him back to their homeland.",
      "tmdbMovieId": 109,
      "avgRating": 3.89905,
      "releaseYear": "1994",
      "numRatings": 5988,
      "posterPath": "/xOLY69rXKwuH9JUnOE4G2HHKiW5.jpg"
   }
}