{
   "tmdb": {
      "original_language": "mk",
      "keywords": [{
         "name": "post-apocalyptic",
         "id": 4458
      }],
      "imdb_id": "tt0179196",
      "video": false,
      "title": "Goodbye, 20th Century",
      "recommendations": [
         17595,
         104292
      ],
      "backdrop_path": "/29qkgQmGnTfBOCV3OVfi2VZpVeT.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Santa Claus",
               "gender": 2,
               "credit_id": "52fe48b49251416c750b0adb",
               "name": "Lazar Ristovski",
               "profile_path": "/pANyfGd5U8eABBuZ6qoJSIWo6uc.jpg",
               "id": 70874,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Kuzman",
               "gender": 0,
               "credit_id": "52fe48b49251416c750b0adf",
               "name": "Nikola Ristanovski",
               "profile_path": null,
               "id": 980147,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "The Prophet",
               "gender": 0,
               "credit_id": "52fe48b49251416c750b0ae3",
               "name": "Vlado Jovanovski",
               "profile_path": "/c4qm2S6qU1sNRsy29KSpbD4HWhp.jpg",
               "id": 225704,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "The Priest",
               "gender": 2,
               "credit_id": "52fe48b49251416c750b0ae7",
               "name": "Dejan Aćimović",
               "profile_path": "/kCpX3KMWoRQCuGqMtOinpE3AXiJ.jpg",
               "id": 4640,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "The Brother",
               "gender": 0,
               "credit_id": "598f8ee6925141675f01a5c4",
               "name": "Petar Temelkovski",
               "profile_path": null,
               "id": 1364580,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "The Sister",
               "gender": 0,
               "credit_id": "598f8eef925141675f01a5cf",
               "name": "Sofija Kunovska",
               "profile_path": null,
               "id": 1315419,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "The Man with Green Hair",
               "gender": 2,
               "credit_id": "598f8ef8c3a3687461019aab",
               "name": "Toni Mihajlovski",
               "profile_path": "/rLgAMpy5SfYjefMx9CUHi6Nnb8L.jpg",
               "id": 585468,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "The Warrior",
               "gender": 0,
               "credit_id": "598f8f03925141673901a131",
               "name": "Zvezda Angelovska",
               "profile_path": null,
               "id": 225707,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "The Man with the Helmet",
               "gender": 2,
               "credit_id": "598f8f0cc3a3687493019085",
               "name": "Petre Arsovski",
               "profile_path": "/3dL4XfpvcSTpXoGrM3zdygLU3Lc.jpg",
               "id": 1177693,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "The Brother-In-Law",
               "gender": 0,
               "credit_id": "598f8f17c3a368748101a2bc",
               "name": "Samoil Dukovski",
               "profile_path": null,
               "id": 1496469,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "The Nameless",
               "gender": 0,
               "credit_id": "598f8f21925141670b01b3d0",
               "name": "Vladimir Endrovski",
               "profile_path": null,
               "id": 1868620,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "The Old Cowboy",
               "gender": 0,
               "credit_id": "598f8f30c3a368748101a2ca",
               "name": "Josif Josifovski",
               "profile_path": "/akOtkPpedS3BEiXd82YsyPoJqPE.jpg",
               "id": 1372191,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "",
               "gender": 0,
               "credit_id": "598f8f39c3a36874c401b5fa",
               "name": "Marin Babić",
               "profile_path": null,
               "id": 1345466,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "",
               "gender": 0,
               "credit_id": "598f8f3f925141673e01b8b1",
               "name": "Igor Džambazov",
               "profile_path": null,
               "id": 1866071,
               "order": 13
            },
            {
               "cast_id": 19,
               "character": "",
               "gender": 0,
               "credit_id": "598f8f47925141673901a17a",
               "name": "Mladen Krstevski",
               "profile_path": null,
               "id": 1500635,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe48b49251416c750b0ad1",
               "name": "Darko Mitrevski",
               "profile_path": "/nDYaOVVtnaE15TxoDWweay8n9Iw.jpg",
               "id": 225702,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe48b49251416c750b0ad7",
               "name": "Aleksandar Popovski",
               "profile_path": null,
               "id": 938731,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "598f8ec0c3a368744201a859",
               "name": "Petra Hačkova",
               "profile_path": null,
               "id": 225703,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "598f8ec8c3a3687493019041",
               "name": "Aleksandar Popovski",
               "profile_path": null,
               "id": 938731,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 0.213882,
      "production_countries": [{
         "iso_3166_1": "MK",
         "name": "Macedonia"
      }],
      "id": 90762,
      "vote_count": 4,
      "budget": 0,
      "overview": "In the year 2019, after global destruction and descent into savagery, the immortal Kuzman tried to discover his destiny in order to learn how to die. As he enters the whirling circles of time, we discover the blasphemy of our century, and how it is to close its circle",
      "similar": [
         8810,
         9355,
         294254,
         110415,
         861,
         12244,
         9659,
         76341,
         131631,
         6479,
         63,
         1576,
         534,
         20766,
         198663,
         263115,
         119450,
         20504,
         49049,
         280
      ],
      "original_title": "Zbogum na dvaesetiot vek",
      "runtime": 83,
      "poster_path": "/8bfNDwNCh694nKfvHhMxrF6mGBx.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "",
            "iso_639_1": "mk"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Mirco & Slavco - First Partizan Production",
         "id": 93591,
         "origin_country": ""
      }],
      "release_date": "1998-11-17",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "The future is as screwed up as the past.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Republic of Macedonia",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Darko Mitrevski",
         "Aleksandar Popovski"
      ],
      "runtime": 83,
      "synopsis": null,
      "writers": [
         "Darko Mitrevski",
         "Aleksandar Popovski"
      ],
      "originalLanguage": "Macedonian",
      "imdbLink": "http://www.imdb.com/title/tt0179196/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BOTQ2MTU1NzU5Nl5BMl5BanBnXkFtZTYwMTc4NDg4._V1_SX214_AL_.jpg",
      "actors": ["Stars: Lazar Ristovski, Nikola Ristanovski, Vlado Jovanovski | See full cast and crew »"],
      "reviews": [
         "sometimes i think it's a shame that movies like this one don't get the exposure that they deserve - that very few people will get to enjoy them... but sometimes, i think that the lack of exposure is what makes movies like this one - if indie was mainstream it wouldn't have been indie, would it?... so, the best thing i could say about \"Zbogum na 20 vek\" is a that it's a great movie, but it's not for everyone. the story is rather controversial, the level of blood and gore on screen is rather high (it makes the US horror flicks from the '90s look like kindergarten cartoons) and the editing... well, it's so uneven, that it might induce vomiting... however, if you have the stomach to go over these things, chances are that you will love this film, because it is indeed full of heart. if you don't love it, watch it again... once you know what's happening in the movie it will be much easier for you to pick up all the small details that not only make the scenes look cooler, but also deeper (i have a theory that the whole movie could be seen through symbols only, but it's too long to write it down here)... none of my friends liked it at first, but after two or three viewings, they find it at least respectable if not outright brilliant... so, to cut things up, if you can find this movie, see it by all means. 9.5/10",
         "\"Goodbye 20th Century\" is a unique, surreal and visionary film that's divided into three parts. The film's three stories take place in the future, past and the end of the twentieth century. Some parts reminded me of El Topo. Imagine, if you will, Road Warrior and Christmas Evil filmed by Kusterica and Jodorowsky. This was the first film I have ever seen from the country of Macedonia, and because of its atmosphere; it takes its viewers to another dimension. The two directors combine elements of mysticism, gypsy folk lore, sci-fi and surrealism for a bleak and bizarre view of the future. The first part of the film takes place in the 2019. A man is to be executed at gunpoint. Even when repeatedly shot at, the man cannot die. He continues to live. We later learn that he was cursed for having sex with a saint. He was impotent and could only get it up for this woman. The curse causes the town's children to die. He is now forced to go on living. A mysterious immortal prophet tells him a way to break the curse. There is also Lynch like elements such as a crazed green haired joker in the film who looks straight out of a batman comic. I know, it sounds strange. The bizarre costumes and abandoned environment is in a cinematic category of its own. The second part of the film takes place in the 1900's, Where we witness the first incestuous marriage and murder to be caught on camera. And finally, the film dives into the present which is New Years Eve, before the year 2000. A man in a Santa suit goes crazy at a funeral, or is it the family who's crazy along with their coke addicted relatives and farting grandmother. This is the chaotic event (not Y2K) that leads the world to a bleak future. This film defies description. \"Goodbye 20th Century needs to be released on DVD. The low VHS quality doesn't do it justice. On another note, God can only imagine the horror stories that people could tell about living in war torn Macedonia. So the film may feel irrelevant to some western viewers. If you enjoy the films of Jodorowsky, Arrabal, Zulawski and Kusturica, then \"Goodbye 20th Century\" is for you. It would make a good triple feature with \"The Holy Mountain\" and Tekeshi Miike's \"Izo\" since all films have bizarre mystical imagery. And Remember, The future is as screwed up as the past.",
         "well since i get hooked on IMDb and traveled trough all this users comments , i felt like commenting to.hope so will be understandable due to my language.first at all i'am not giving at it 10 out of 10 for pricing it like a one of the very rare Macedonian movies coming out into this Hollywood polluted world,but because of the visionary and surrealistic way of seeing were the world is heading to, even after this comments survive us.i had chance to meet the directors in the festival of Catalonia - Sitges of horror and Si-Fi and congratulate them for making it and bringing it to the festival,where i went to after seeing the program for the year 1999.to bad that was shown on Wednesday night and when was Barcelona football club playing. so the auditorium in Sitges was almost deserted.i could not find it on DVD nowhere ,especialy in Spain were i live.the surrealism in the movie is like seeing a mixture between Jodorowski ,Buñuel,Lynch and a very stylish Tarantino.the Santa Claus will make you feel you don't want any Christmas presents.i hope one day it will become a cult movie and be possible for the future generation to admire it. pozdravi od makedonceto od sitges.",
         "We are only able to interpret from a piece of art what we bring to it. Our own personal knowledge is all we have to unravel, or judge information, when confronted with something that requires diagnosis. Whilst there is limited writing on this obscure Macedonian film, what is written I have found not to be what I considered whilst viewing it. The film's intention I gleaned, began with it's own remission, with a reference to the old testament. This is followed with a scene apparently set in 2019, where Kuzman (Nikola Ristanovski), is gunned down in a post apocalyptic desert, only to survive these apparently severe wounds. Kuzman then has to battle with heavy weaponry with the \"Man With Green Hair\" (Toni Mihajlovski), and ends the first sequence bathing with a naked woman who has just dropped a basket of apples into the water (is this a reference to the garden of Eden?). Before the second half appears, we are shown a wedding in 1900 that results in the killing of the groom. After this we are introduced to a man dressed as Santa Claus (Lazar Ristovski) who travels back to his apartment on the 31st of December 1999. At his apartment he finds that a wake for what appears to be a military official is underway and the members of the party are dismayed to see his entry. This is the extent of my formal explanation of \"what happens on the screen\". I spent the majority of the film in confusion. I perhaps need to research the history of Macedonia (war has always been prevalent in the Balkans - but that is all I know). And this is why I am standing by my opening sentence, and therefore will state what I took from this bizarre but interesting film, is what very limited knowledge I had to begin with. I personally felt that this often violent piece of cinema was attempting to break down, and possibly eliminate icons that should have dissipated before the 20th century even began. The first half I felt was Jesus - his body is unbreakable, despite being shot on many occasions, he simply rises from this - but, like Adam in the garden of Eden, he is tempted by the body of woman. In the last sequence, Santa occupies his apartment, which is completely white - perhaps a signal to a waiting room of death - where the occupants degenerate into madness and violence, and death to the real is the only outcome. This brings me to the interpretation that I have of this apparently confusing and a seeming clash of disparate ideologies, comes into effect. I see this as an analysis of the need for a destruction of false idols, icons, or illusions. Unfortunately, it is the illusory - i.e. the image of Santa Claus - that will prevail at the end of the 20th century. We are left with the concept that the fantasy of the man in red, will always prevail over what is real will always take precedent over the realities of our constantly complex world. But again, in conclusion, I probably have this completely wrong, and can only speculate over the historical aspects that I have no knowledge of. In terms of the films overall result, it is certainly interesting, and absolutely different. It is also wonderful to look at - it's aesthetic seeped in often clinical beauty. www.the-wrath-of-blog.blogspot.com",
         "As an admirer of the director's tandem, I must admit that Orbis Non Sufficit for them! If this story was to be filmed in some of the richest European [warning: not World] productions, it would have been a hit in hand. This way, only selected circles can see and enjoy the saga of the real world future, the excellent 'Ubermakedonische' in the background, as well as one of the hottest love scenes filmed ever [bravo Mirko&Slavko + Sofi]. Highly recommendable 'indie' for the people who expect everything from virtually nothing."
      ],
      "genres": [
         "Adventure",
         "Comedy",
         "Fantasy",
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": ["Mirco & Slavco - First Partizan Production"],
      "summaries": ["In the year 2019, after global destruction and descent into savagery, the immortal Kuzman tried to discover his destiny in order to learn how to die. As he enters the whirling circles of time, we discover the blasphemy of our century, and how it is to close its circle."],
      "budget": 0
   },
   "movielensId": 3080,
   "movielens": {
      "languages": [
         "English",
         ""
      ],
      "releaseDate": "1998-11-17",
      "dvdReleaseDate": null,
      "directors": [
         "Darko Mitrevski",
         "Aleksandar Popovski"
      ],
      "runtime": 83,
      "movieId": 3080,
      "title": "Goodbye, 20th Century",
      "mpaa": "",
      "actors": [
         "Lazar Ristovski",
         "Nikola Ristanovski",
         "Vlado Jovanovski",
         "Dejan Aćimović",
         "Petar Temelkovski",
         "Sofija Kunovska",
         "Toni Mihajlovski",
         "Zvezda Angelovska",
         "Petre Arsovski",
         "Samoil Dukovski",
         "Vladimir Endrovski",
         "Josif Josifovski",
         "Marin Babić",
         "Igor Džambazov",
         "Mladen Krstevski"
      ],
      "imdbMovieId": "0179196",
      "originalTitle": "Zbogum na dvaesetiot vek",
      "genres": [
         "Adventure",
         "Comedy",
         "Fantasy",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "In the year 2019, after global destruction and descent into savagery, the immortal Kuzman tried to discover his destiny in order to learn how to die. As he enters the whirling circles of time, we discover the blasphemy of our century, and how it is to close its circle",
      "tmdbMovieId": 90762,
      "avgRating": 2.5,
      "releaseYear": "1998",
      "numRatings": 11,
      "posterPath": "/8bfNDwNCh694nKfvHhMxrF6mGBx.jpg"
   }
}