{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "chemical",
            "id": 852
         },
         {
            "name": "castle",
            "id": 3098
         },
         {
            "name": "living dead",
            "id": 157351
         },
         {
            "name": "female vampire",
            "id": 174878
         }
      ],
      "imdb_id": "tt0084357",
      "video": false,
      "title": "The Living Dead Girl",
      "recommendations": [
         29111,
         90949,
         81189,
         29129,
         88052,
         135214,
         36835,
         24928,
         253277,
         106758,
         27328,
         87503,
         129385,
         47957,
         172824,
         5035,
         5051,
         36232,
         70351,
         68757
      ],
      "backdrop_path": "/yeAPkwTZv6L8Ee2znMALwQOkEri.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Hélène",
               "gender": 0,
               "credit_id": "52fe4957c3a368484e1267c7",
               "name": "Marina Pierro",
               "profile_path": "/nJh2KjmPS6cP7vfTbGmyraedW6o.jpg",
               "id": 239337,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Catherine Valmont",
               "gender": 1,
               "credit_id": "52fe4957c3a368484e1267cb",
               "name": "Françoise Blanchard",
               "profile_path": null,
               "id": 102104,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Greg",
               "gender": 2,
               "credit_id": "52fe4957c3a368484e1267cf",
               "name": "Mike Marshall",
               "profile_path": "/4YQxw0JnqkSOQPUT6HOeAniJMFk.jpg",
               "id": 19613,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Barbara Simon",
               "gender": 1,
               "credit_id": "52fe4957c3a368484e1267d3",
               "name": "Carina Barone",
               "profile_path": "/aB3o1CMCbfsX0Qny1KCu5UUS9NZ.jpg",
               "id": 581063,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "6th Victim",
               "gender": 0,
               "credit_id": "52fe4957c3a368484e1267d7",
               "name": "Fanny Magier",
               "profile_path": "/kQ32VJePvjU5IehWT95ulImkLdf.jpg",
               "id": 104256,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4957c3a368484e1267db",
               "name": "Patricia Besnard-Rousseau",
               "profile_path": null,
               "id": 581064,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4957c3a368484e1267b7",
               "name": "Jean Rollin",
               "profile_path": "/odV8f23LdkRqYzxKMWBEEMddYZ.jpg",
               "id": 88820,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4957c3a368484e1267bd",
               "name": "Jean Rollin",
               "profile_path": "/odV8f23LdkRqYzxKMWBEEMddYZ.jpg",
               "id": 88820,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4957c3a368484e1267c3",
               "name": "Jacques Ralf",
               "profile_path": null,
               "id": 581062,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "552fb9eec3a3681c41000b7d",
               "name": "Max Monteillet",
               "profile_path": null,
               "id": 1053067,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "552fba0bc3a3685da60025de",
               "name": "Janette Kronegger",
               "profile_path": null,
               "id": 1124528,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "552fba31c3a3686be2006616",
               "name": "Eric Pierre",
               "profile_path": null,
               "id": 1455021,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "552fba4a9251415b7a0022b5",
               "name": "Benoît Lestang",
               "profile_path": null,
               "id": 94068,
               "department": "Crew",
               "job": "Special Effects"
            },
            {
               "gender": 0,
               "credit_id": "552fba69c3a3686be2006626",
               "name": "Pierre Leblond",
               "profile_path": null,
               "id": 1455022,
               "department": "Camera",
               "job": "Still Photographer"
            },
            {
               "gender": 2,
               "credit_id": "57164bd4c3a3682e65004554",
               "name": "Philippe D'Aram",
               "profile_path": null,
               "id": 104250,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 1.922339,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 77010,
      "vote_count": 22,
      "budget": 0,
      "overview": "A toxic spill revives a beautiful, dead heiress who, with the help of her childhood friend, must quench her insatiable thirst for blood",
      "similar": [
         17102,
         138,
         653,
         22440,
         755,
         32023,
         7131,
         6404,
         36648,
         6114,
         49017,
         252171,
         29778,
         12437,
         76492,
         159824,
         36647,
         2907,
         1547,
         628
      ],
      "original_title": "La morte vivante",
      "runtime": 86,
      "poster_path": "/3fOXjfhLwRBbaqdrRTDwrKHGXqd.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Les Films du Yaka",
            "id": 51320,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Films A.B.C.",
            "id": 7996,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Les Films Aleriaz",
            "id": 51321,
            "origin_country": ""
         }
      ],
      "release_date": "1982-10-23",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jean Rollin"],
      "runtime": 85,
      "synopsis": "When they were children, Catherine [Francoise Blanchard] and Hélène [Marina Pierro] swore blood oaths that they would always love each other and, whomever died first, the other would follow. It was Catherine who was first to go. She was laid to rest in the Valmont crypt underneath the family castle. Two years later, however, some men reawaken Catherine while illegally dumping toxic waste in the Valmont vault. Unfortunately, Catherine now requires the blood of the living to survive. Having just returned from a lengthy trip, Hélène telephones the Valmont castle which, unbeknown to her, is up for sale. Catherine, who is a virtual zombie, picks up the receiver while playing a musicbox that she and Hélène shared. Not knowing who answered the phone, Hélène pays the castle a visit, only to find Catherine and the dead bodies of the waste dumpers, the real estate saleswoman, and her boyfriend. Concerned for Catherine, Hélène cleans up the mess, thinking that Catherine is sick and that her death was faked. When Hélène realizes that Catherine needs human blood, she begins to lure young women to the castle to provide it, while trying harder and harder to bring Catherine out of her catatonia. It's working. Catherine is beginning to \"wake up\" and become less and less of a zombie. She regains the ability to speak and to recognize the nature of her emotions. She also comprehends that she is \"evil,\" a living dead girl, and refuses to drink any more blood. She begs Hélène to kill her, but Hélène refuses. Meanwhile, Barbara Simon [Carina Barone] and her American friend Greg [Mike Marshall] are in town taking photographs. Barbara shot a picture of Catherine walking through a field and has become interested in her. Barbara begins asking the townspeople if they recognize the girl in the photograph. In all cases, she is identified as Catherine Valmont who died two years ago. But Barbara just took the photo a day ago so this is impossible according to Greg, who thinks the girl is just a Catherine lookalike. Barbara decides to pay a visit to the Valmont castle to see if she can get Catherine to pose for more photos. When Barbara meets Catherine face to face and Catherine is mumbling jibberish about being dead, Barbara concludes that Catherine is disturbed and in need of help. Hélène attempts to wrest the camera from Barbara, but Barbara is able to escape. At a town festival that evening, Barbara spies Hélène, who is in town seeking the next meal for Catherine. Barbara convinces Greg to accompany her to the castle. Bad move. Hélène sets Barbara afire and drops an axe into Greg's skull. Catherine, wanting to rest in peace, sets the latest victim free and advises her to tell everyone in town what happened. Hélène, remembering her blood oath, promises to stay with Catherine, even knowing what the consequences might be. So Catherine kills Hélène and drinks her blood. [Original Synopsis by bj_kuehl.]",
      "writers": [
         "Jacques Ralf",
         "Jean Rollin"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0084357/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTAwMTgxOTM0NzheQTJeQWpwZ15BbWU3MDg4Mjk3MTE@._V1_SY317_CR10,0,214,317_AL_.jpg",
      "actors": ["Stars: Marina Pierro, Françoise Blanchard, Mike Marshall | See full cast and crew »"],
      "reviews": [
         "I hate to admit it, but I like the idea of Jean Rollin more than the reality of sitting through one of his films. It's not that I don't appreciate what he's doing. I do. He has a unique world view and holds a special place in the world of \"fantastique\" cinema that is indisputable. Still, I find his films a little boring. Case in point THE LIVING DEAD GIRL springs from a simple and fascinating concept of a dead woman, who must drink blood to survive, returning to a château to be with an old friend. As fascinating as the concept is, Rollin doesn't do a whole lot with it. He serves up plenty of atmosphere, imbues his material with a subtle eroticism and draws a superb performance from the beautiful Francoise Blanchard. What else do you want? you may ask. I'm not sure. I wanted more to happen, I guess. I wanted Rollin to jettison the boring bits and replace them with his signature set pieces. It's been described as \"savage\", an adjective I wouldn't use myself. It's also been described as \"dreamy\". For the most part that's true. My frustration is with the film's uneven tone. Why couldn't it remain \"dreamy\" right through? You do need patience and a little forgiveness to enjoy Rollin. I still wouldn't miss anything he's done. He's one of us.",
         "Jean Rollin's \"La Morte Vivante\"/\"The Living Dead Girl\" is an excellent erotic ultra-gory vampire tale and I like it very much.The film has some wonderful atmosphere and some striking images of eternal painful life.There is plenty of graphic gore to satisfy fans of extreme horror.Along with all of the gore there is a large amount of beautiful naked women running around.Rollin's trademark photography is naturally here but this film is much gorier than his other films that I've seen.Francoise Blanchard who plays bloodthirsty Catherine is incredibly beautiful.Overall,I enjoyed this film and you should too if you like zombie/vampire cinema.There is also an unofficial sequel to this one called \"The Revenge of the Living Dead Girls\"(1987).",
         "Grisly, potent shocker from Jean Rollin regarding how a dead young lady of two years, the body surprisingly fresh without rot during that time(?), is revived from a spilled can of toxic waste, put there by some corpse looters, after a minor earthquake. She has vampire mentalities(..not to mention terrifying fingernails which can tear into flesh with ease) meaning this uncontrollable thirst for flesh and blood from human beings..the girl, Catherine(Françoise Blanchard), calls the evil inside. A \"blood sister\", Helene(Marina Pierro)did not know her best friend from childhood had been dead and after a phone call leading to Catherine's discovery(hearing the sound box playing music both listened to as children)she races to the villa to see about her. What Helene sees is a bloody mess, several unfortunates who became blood donors to Catherine's unhinged feeding time. Helene will slowly grow obsessed with keeping her beloved \"sister\" alive doing whatever it takes, meaning luring those unaware of what awaits them, to become victims for Catherine. A photographer, Barbara(Carina Barone)sees Catherine walking in a daze upon leaving her crypt and takes a snapshot. That snapshot fascinates her..the image that compels her to seek out the identity of Catherine might seal her fate. Perhaps, Barbara's husband(Mike Marshall)will be able to keep her from harm before it's too late. Or, will Barbara's obsession with learning more about Catherine, and taking more pictures of her, lead to a gruesome demise. What the people around this villa need to worry about is Helene's mad desire to find fresh bodies for her Catherine. The most important story element, and what I feel is the most haunting aspect, is that as days go by Catherine is realizing the monster she becomes when the evil hunger returns. She wishes to be put away and begs for Helene to see this through. The idea of losing her friend a second time, and not being able to come to terms with the fact that Catherine is dead, I think Helene is the tragic character of the film. Friendship and love seem to be very powerful emotional drives within this plot while Rollin often cuts into this with a furious rage when he shows Catherine's eating habits. She just doesn't suck blood with any form of sophistication, but tears into her meal like a crazed, starving animal. And, believe me, the feasting is extremely unsettling as we watch the flesh of throats, arms, and stomachs ripped with vengeance by Catherine who seems out of control with her senses with the primal urge to munch operating in overdrive. The direction is rather straight-forward, I felt, and followed a projected path. It ended about the way I imagined it would. The ending leaves only despair for the victim who just wishes for the blood lust and torment to leave her.",
         "Two childhood friends Catherine & Helene make a pact to always be together. Catherine dies and they forced to split. A toxic spill manages to bring Catherine back from the dead, turning her into a monster. Catherine reunites with her to help Catherine with her insatiable need for blood. Leave it to Jean Rollin to turn a subject like zombies into something erotic and artsy. I liked this one. It's leisurely paced like most Rollin films, but it's very interesting. The bond between Catherine and Helene is very strong and you are able to feel like they truly love one another. There are dull moments. We get many shots of Catherine wandering the halls that may get tiresome for people, but they have meaning in this one. Watching Catherine reminisce over childhood photos of her and Helene was saddening and riveting with the way it was done. Also, the slow build of Catherine's insatiable hunger for blood was well done, giving Catherine a bit of a human side to her. There is great photography as well. This movie is pretty gory. We get extremely gory puncture throats that gush blood all over the place. A woman is burned alive, somebody gets a foreign object in their head, eyes are gouged out, and more. The best part is the ending. It's a tragic gore fest. I won't spoil it, but it is both saddening and enjoyable. The acting is pretty good for this sort of thing. Marina Pierro is great as the supporter of Catherine. The show belongs to the lovely Francoise Blanchard. She gave a memorable performance with her beauty. My only real complaint is the version I watched alternated between subtitles and English dubbing Final Thoughts: You probably won't find many better films of Rollins than this, if any. For a guy that is known for his boring eroticism, he made a gem with this one. It's tragic, interesting, and beautiful. I recommend it. This one actually has a decent story 7.2/10",
         "OK, a trawl through my past user comments will reveal that I am really interested in this genre of movies for purely purient interest. Having said that, I do know a good film when I see one. While Holywood rarely produces these, neither does Jean Rollin. I simply cannot understand how some people can give films such as these high marks. Different strokes obviously. To be fair, this is the best produced Rollin film (out of three) that I have seen, but the others were pretty bad, so that is no commendation. Can bad acting, sloppy plotting and woeful gore effects really be that easily ignored? The story revolves around a girl brought back from the dead who needs blood to sustain herself, her childhood friend's efforts to meet her need, and a French-American's efforts to expose what is going on. The story is threadbare and doesn't go anywhere. Everyone but the vampire girl bleed profusely by the film's end, but to no effect. Little horror, only litres of fake blood and latex gore. Worst of all, there is little nudity or sex action to compensate. The opportunity of a lesbian relationship (de rigueur I would have thought!) between the vampire and her girlfriend is not realised, and there is only one sex scene. Isn't this the reason thats these films are made?!? I can think of no other. The other Rollin films I have seen (earlier than this one) are worse overall, but manage to compensate by some spirited flesh action. And have I mentioned the screaming that occurs throughout the film? It's a wonder my neighbours haven't called the police. So to those who rate this film highly, purporting it to be some kind of arty French tour de force: I have seen films which are the real thing, and it is an insult to competant French directors to make any comparison with Rollin.",
         "I'm rather a latecomer to this movie, as I don't seek out Jean Rollin movies (based on what little I have seen), but as this is supposed to be something of a classic of it's type, I gave it a go - but it is certainly not converting me into a fan. The slim story sees a dead girl named Catherine unexpectedly revived in her coffin when disturbed by grave robbers. She quickly attacks one of them, and then seemingly in a daze, makes her way rather unsteadily back to an empty castle which is her former home. Her newly living status comes to the attention of her former best friend Helene, who seems to think the best course of action is to keep Catherine hidden in the empty mansion, rather than seek help - even despite the realisation that her friend craves the taste of fresh blood! I was really expecting something more stylish from this movie due to it's reputation, but I have to say I think it's really poorly made. Jean Rollin was no genius, if movies like this are the evidence. Several shots are out of focus, the acting is poor, the dialogue stilted and the gore effects are downright terrible. You can clearly see the tubes that squirt blood from a throat in one shot, and the bag that Catherine is squeezing in her hand to squirt gore from a stomach wound in another. All Rollin seems to be interested in is keeping his actresses nude, for as often and as long as possible. The two leads are both very attractive, and the ornate mansion is very picturesque, but that doesn't mean that Jean Rollin is using any talent to show that off. Anyone who is not part of the main cast is so obviously an amateur, and the direction of scenes involving extras is terrible - they continually stare directly at the camera, in almost every shot. I guess the lighting is pretty enough in daytime scenes, but at night, everything is floodlit by flat, harsh industrial lighting. And the castle's underground vaults seem to have enough light to grow tomatoes in! I also read that the portrayal of the relationship between the two women is strong enough to carry the film, but again, I don't think this is true either. As Catherine becomes more and more aware of what she is, things get more interesting, and there are moments that hint at some depth, but these are few. In conclusion, I am amazed that people rate this movie so highly. I think it is average at best. It has a lot of nudity, which seems to please a lot of viewers, but having acting and special effects that are as downright poor is they are here, strips this effort of any redeeming value.",
         "Jean Rollin, French Horror Sexploitation Auteur hits hard with a Zombie- Lesbo love tale about a resurrected woman, Catherine Valmont (Fransoise Blanchard) and her long time girl friend Helene (Marie Pierro) and their exploits of lust-filled murder, kidnapping and the consequences that follow. Foolish Grave Robbing Thieves, who also dump toxic waste meet their eye- gouging demise with the beautiful Living Dead Girl after a small tremor awakens her from her coffin. After Catherine racks up a 3 man body count, she wanders the beautiful French country side barefoot and only wearing a white gown and is photographed by a tourist and her husband. The tourist woman becomes obsessed that this Living Dead Girl is the young Catherine only back from the dead and confronts her. After a few more naked dead people pile up, Helene unscuccessfully attempts to feed Catherine with a dead bird, then kidnaps a random woman and gives her to Catherine who then tears the victim apart. Most fans of Rollin expect his films to be loaded with French styled gore and nudity and also are aware of the slow pacing in between scenes. Such is the staple for Euro Sleaze. The films last 10 minutes kick in to high gear and to honest, it is pretty damn grueling to the degree of saying out loud \"what other horror film can offer such goodies\"? (Spoliers) Catherine then frees her next stripped bare victim and sets her loose, realizing that she is evil and hates herself. Then Helene sets a tourist on fire who flees screaming and jumps of a bridge and chops another tourists head with a midieval axe. Catherine attempts to drown herself in a lake but is rescued by Helene. In Catherine's fury she rips her to shreds and devours her with a slow backwards moving camera shot, leaving the blood-soaked Catherine alone in the dark. www.thecultofhorror.blogspot.com",
         "This Jean Rollin feature is an erotic horror about a woman who returns from the dead due to an accident involving an earthquake and toxic chemicals. She is The Living Dead Girl and she has a vampire like taste for blood. She is drawn back to her 'blood sister' Helene, who in turn finds victims for her. This is another melancholic and downbeat effort from Rollin. Once again his vampire is a tragic one. She did not choose her fate. She feels guilt at her subsequent actions and is repulsed by them. We feel sorry for her. The film is also about friendship and loyalty. The bond between the two girls is effectively a pact that goes beyond the grave. One of the defining features of The Living Dead Girl is its goriness. It is very bloody by Rollin's standards, so in this respect it may be a little more accessible to a wider horror audience. But then again, aside from this, it's strictly business as usual. There are the usual selection of paper thin characters, weak dialogue and low production values; while the story emphasises things that are atypical for a standard horror film, such as a melancholic 'monster' and some poetic imagery. Examples of the latter would include scenes of the girl wandering through fields in a white night dress and the night time river scene. As usual Rollin does ensure the film looks interesting. There are some nice French countryside locations and a picturesque villa. While the atmosphere is moody throughout, with some delicate musical accompaniment on the soundtrack. It is a little odd though having an American couple in the movie. This, no doubt was a way of trying to sell the film easier overseas. But like all other Rollin films these characters are uninteresting, Rollin seems to be only interested in his female vampires/villains. It isn't without faults; it does drag in places but like others from the director would probably improve on re-watches. The film does, however, wrap up in one of the most effectively haunting endings Rollin ever conceived.",
         "Living Dead Girl, The (1982) *** (out of 4) French horror film from director Jean Rollin, which mixes tons of sex and nudity with plenty of the red stuff. After some toxic waste falls on her grave, a young woman returns with a hunger for blood. This is probably the best place for a newbie to Rollin to start as this perfectly captures the atmosphere of his best movies but also throws in plenty of over the top gore scenes, which will probably make a casual viewer sick. As with other Rollin films, there's plenty of beautiful women getting naked but the film does move at a snail's pace, which will probably put some to sleep.",
         "This is an interesting film on several levels. It is not full of top notch acting, but it is different and I like that. First, some sleaze-bags are dumping chemical waste in an underground burial vault that dates from the 12th century. A tremor releases gases and awakens our living dead girl (Françoise Blanchard). She wanders into the castle above, which happens to have been her home when she died two years ago. Now, the realtor (Dominique Treillou) brings her boyfriend for a weekend of fun. Surprise! Our living dead girl needs some blood to survive. Now, is she a zombie or a vampire? She doesn't bite, but tears the flesh apart, but she doesn't eat the flesh either; she drinks them dry. Topic for discussion. What I like about European films is that they have no problems with full frontal. They also use very healthy actresses, not some skinny starlet. Gorgeous bodies are on display in this film. There isn't much story here. The film has constant flashbacks to the childhood of the zombie and her friend Hélène (Marina Pierro). Hélène comes to the castle after a phone call to see if her friend is alive. At first she doesn't understand, but is soon getting her fresh meat to drink dry. The living dead girl just wants to die, but Hélène wants to keep her alive. One is never sure if there is more to this relationship than childhood friendship, but there is only one possible ending to it. Really should be seen by all zombie lovers for a different take on the subject."
      ],
      "genres": ["Horror"],
      "productionCompanies": [
         "Films A.B.C.",
         "Les Films Aleriaz",
         "Les Films du Yaka"
      ],
      "summaries": ["A toxic spill revives a beautiful, dead heiress who, with the help of her childhood friend, must quench her insatiable thirst for blood."],
      "budget": 0
   },
   "movielensId": 3085,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1982-10-23",
      "dvdReleaseDate": "1999-11-09",
      "directors": ["Jean Rollin"],
      "runtime": 86,
      "movieId": 3085,
      "title": "The Living Dead Girl",
      "mpaa": null,
      "actors": [
         "Marina Pierro",
         "Françoise Blanchard",
         "Mike Marshall",
         "Carina Barone",
         "Fanny Magier",
         "Patricia Besnard-Rousseau"
      ],
      "imdbMovieId": "0084357",
      "originalTitle": "La morte vivante",
      "genres": ["Horror"],
      "youtubeTrailerIds": ["hDu-ePaSXJM"],
      "plotSummary": "A toxic spill revives a beautiful, dead heiress who, with the help of her childhood friend, must quench her insatiable thirst for blood",
      "tmdbMovieId": 77010,
      "avgRating": 2.80851,
      "releaseYear": "1982",
      "numRatings": 47,
      "posterPath": "/3fOXjfhLwRBbaqdrRTDwrKHGXqd.jpg"
   }
}