{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "holiday",
            "id": 65
         },
         {
            "name": "toys",
            "id": 10324
         }
      ],
      "imdb_id": "tt0024852",
      "video": false,
      "title": "Babes in Toyland",
      "recommendations": [
         30230,
         43691,
         108213,
         46026,
         43269,
         48670,
         31678,
         98398,
         15401,
         26728,
         31163,
         45965,
         84337,
         48817,
         38925,
         22614,
         22606,
         50830,
         22999,
         48830
      ],
      "backdrop_path": "/m4sMWLqBZ12szGvYjPeZIpIpNgY.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Stannie Dum",
               "gender": 2,
               "credit_id": "52fe44e2c3a368484e03c86d",
               "name": "Stan Laurel",
               "profile_path": "/cYrYC6qpRng0aB34zscpxMGxdx3.jpg",
               "id": 89670,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Ollie Dee",
               "gender": 2,
               "credit_id": "52fe44e2c3a368484e03c871",
               "name": "Oliver Hardy",
               "profile_path": "/abqNQE8qBjUIB4NMQE4OiIOulmI.jpg",
               "id": 78057,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Little Bo-Peep",
               "gender": 1,
               "credit_id": "52fe44e2c3a368484e03c875",
               "name": "Charlotte Henry",
               "profile_path": "/l2cZzQjuK8BotLKEeO5Bde57ubR.jpg",
               "id": 94105,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Tom-Tom Piper",
               "gender": 0,
               "credit_id": "52fe44e2c3a368484e03c879",
               "name": "Felix Knight",
               "profile_path": "/glfaQS2Pzr0uURJENLEN8GWbIgS.jpg",
               "id": 94331,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Silas Barnaby",
               "gender": 2,
               "credit_id": "52fe44e2c3a368484e03c87d",
               "name": "Henry Brandon",
               "profile_path": "/xjkd8VhfGkYidjMiqJ4tjihLHsH.jpg",
               "id": 30553,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Mother Widow Peep",
               "gender": 1,
               "credit_id": "52fe44e2c3a368484e03c881",
               "name": "Florence Roberts",
               "profile_path": "/jJzGMGUGMLa1p9Y7DxvNbrHyZig.jpg",
               "id": 94332,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Mother Goose",
               "gender": 0,
               "credit_id": "52fe44e2c3a368484e03c885",
               "name": "Virginia Karns",
               "profile_path": "/wIGb04V3AhI6wQ4YdmoXW2yJF6D.jpg",
               "id": 94333,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Mary Quite Contrary",
               "gender": 1,
               "credit_id": "52fe44e2c3a368484e03c889",
               "name": "Marie Wilson",
               "profile_path": "/4ZnT4i0Aa53Y8yw7ZgD92q9UWGe.jpg",
               "id": 131441,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Little Boy Blue",
               "gender": 2,
               "credit_id": "52fe44e2c3a368484e03c88d",
               "name": "Johnny Downs",
               "profile_path": "/shVecyKb99iqayV3dhrQ5FYJnPM.jpg",
               "id": 131442,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Schoolboy (uncredited)",
               "gender": 2,
               "credit_id": "562b2ada925141400600280b",
               "name": "Scotty Beckett",
               "profile_path": "/1cKFfAtdB7FO101jl5ICPeTylwB.jpg",
               "id": 125847,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "Chief of Police (uncredited)",
               "gender": 2,
               "credit_id": "562b2af1c3a3681b5e003f6f",
               "name": "Billy Bletcher",
               "profile_path": "/wVMoPHj7zTswZJx96VqY1yWgN8j.jpg",
               "id": 31771,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "Townswoman at Tom-Tom's Trial (uncredited)",
               "gender": 1,
               "credit_id": "562b2b09925141284c0041ef",
               "name": "Ellen Corby",
               "profile_path": "/3oBJ4HH5z7FspFMxOTUe1eBzoIA.jpg",
               "id": 5738,
               "order": 11
            },
            {
               "cast_id": 23,
               "character": "Curly Locks (uncredited)",
               "gender": 1,
               "credit_id": "562b2b1c9251414ad800263d",
               "name": "Jean Darling",
               "profile_path": "/pgEoBPfcIvG8Lv0ch8A8CJjofEG.jpg",
               "id": 949499,
               "order": 12
            },
            {
               "cast_id": 24,
               "character": "Townsman (uncredited)",
               "gender": 2,
               "credit_id": "562b2b36925141285300410f",
               "name": "Charlie Hall",
               "profile_path": "/vttfiluEvKP7hZIcSCmrLqK07jj.jpg",
               "id": 137404,
               "order": 13
            },
            {
               "cast_id": 25,
               "character": "Schoolboy (uncredited)",
               "gender": 2,
               "credit_id": "562b2b65c3a3681b5e003f85",
               "name": "Dickie Jones",
               "profile_path": "/4dGe5gm0nDGwUN9u6hVx7iFlxaU.jpg",
               "id": 67371,
               "order": 14
            },
            {
               "cast_id": 26,
               "character": "Townsman (uncredited)",
               "gender": 2,
               "credit_id": "562b2b75925141284c004204",
               "name": "Ham Kinsey",
               "profile_path": null,
               "id": 141133,
               "order": 15
            },
            {
               "cast_id": 27,
               "character": "Townswoman (uncredited)",
               "gender": 0,
               "credit_id": "562b2b9e925141285700401f",
               "name": "Alice Lake",
               "profile_path": "/jbNhzrllOQBdlzfx5B8Jjrcj1BF.jpg",
               "id": 133971,
               "order": 16
            },
            {
               "cast_id": 28,
               "character": "Schoolgirl (uncredited)",
               "gender": 0,
               "credit_id": "562b2bb4c3a3681b4b003cb0",
               "name": "Joy Lane",
               "profile_path": null,
               "id": 1526343,
               "order": 17
            },
            {
               "cast_id": 29,
               "character": "Nobleman (uncredited)",
               "gender": 2,
               "credit_id": "562b2bc69251412845003ca9",
               "name": "Jack 'Tiny' Lipson",
               "profile_path": null,
               "id": 33382,
               "order": 18
            },
            {
               "cast_id": 30,
               "character": "Dunker (uncredited)",
               "gender": 2,
               "credit_id": "562b2be1c3a3681b5c003f7f",
               "name": "Tiny Sandford",
               "profile_path": "/4Tw4KnA3S8dhl9tIs2v9aa0Va1c.jpg",
               "id": 30194,
               "order": 19
            },
            {
               "cast_id": 31,
               "character": "Barnaby's Minion (uncredited)",
               "gender": 2,
               "credit_id": "594587d49251413ff4015e4c",
               "name": "John George",
               "profile_path": "/gEhNTzAQ2EoZzpAQWMYQuOVkSpF.jpg",
               "id": 97999,
               "order": 20
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44e2c3a368484e03c893",
               "name": "Frank Butler",
               "profile_path": null,
               "id": 131408,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e2c3a368484e03c899",
               "name": "Nick Grinde",
               "profile_path": null,
               "id": 96608,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e2c3a368484e03c89f",
               "name": "Bert Jordan",
               "profile_path": null,
               "id": 131411,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e2c3a368484e03c8a5",
               "name": "William H. Terhune",
               "profile_path": null,
               "id": 89739,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e2c3a368484e03c8ab",
               "name": "Hal Roach",
               "profile_path": "/6VQIciKwBUsoJGDBlnIMV2iS4Cm.jpg",
               "id": 33223,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e2c3a368484e03c8b1",
               "name": "Gus Meins",
               "profile_path": null,
               "id": 131443,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e2c3a368484e03c8b7",
               "name": "Charley Rogers",
               "profile_path": "/ovzxz7anu5OLLmq2ilmBZHJS2QD.jpg",
               "id": 131406,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 2.369014,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 25898,
      "vote_count": 34,
      "budget": 0,
      "overview": "Ollie Dee and Stanley Dum try to borrow money from their employer, the toymaker, to pay off the mortgage on Mother Peep's shoe and keep it and Little Bo Peep from the clutches of the evil Barnaby. When that fails, they trick Barnaby into marrying Stanley Dum instead of Bo Peep. Enraged, Barnaby unleashes the bogeymen from their caverns to destroy Toyland.",
      "similar": [
         11395,
         13673,
         10147,
         10872,
         9279,
         17979,
         9021,
         10437,
         1581,
         8871,
         634,
         296100,
         9479,
         13377,
         18147,
         9647,
         287903,
         51052,
         5825,
         1585
      ],
      "original_title": "Babes in Toyland",
      "runtime": 73,
      "poster_path": "/8EoKfCGMTcywFSA6Wxt1a8HDQlx.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1934-12-14",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": [
         "Gus Meins",
         "Charley Rogers"
      ],
      "runtime": 77,
      "synopsis": null,
      "writers": [
         "Frank Butler",
         "Nick Grinde"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0024852/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU2NTQwNzc0NV5BMl5BanBnXkFtZTcwOTU4NTgxMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Stan Laurel, Oliver Hardy, Virginia Karns | See full cast and crew »"],
      "reviews": [
         "Babes in Toyland was the first movie I saw on a big screen- -a holiday presentation in my grammar school auditorium, circa 1957- -uncut, unlike the many subsequent presentations I saw on TV in after years. I fell in love with Stan and Ollie, with Toyland, with the magic of the movies, all at once- -all of us watching laughed and thrilled to see all of the characters we had heard of in nursery rhymes come to life- -even the Three Little Pigs (with \"Who's Afraid of the Big Bad Wolf\" on the soundtrack, courtesy of Uncle Walt Disney's studio!)- -we trembled with ecstatic terror at Silas Barnaby and his army of Bogeymen and cheered the house down when Stan and Ollie discovered the Perfect way to rout them and save the day!- -and yes, many of us, watching Charlotte Henry and Felix Knight as Bo-Peep and her plucky suitor Tom-Tom (the Piper's Son), found awakening within ourselves the realization of what romantic love might be about.- -and Stan and Ollie?- -a funny, wonderful duo, children like ourselves, joyously silly and giddily amazing. I dreamt of Toyland that night, and many nights after- -sweet dreams, scarey dreams, dreams of Ollie and Stannie as wonderful friends- -and once I woke crying, realizing that once I was grown up, Toyland would fade to a distant memory. Well, I was wrong. You can go back to Toyland, that Childhood's Dreamland, any time you watch this movie. I love it. You may, too. Note: current video versions are mostly also uncut, some are colorized, which in this instance (perhaps the only one)improves the presentation!",
         "first i must disagree with the review of your last member on his appraisal of henry brandons role as mr. barnaby. my wife and i were personal friends of henry brandon and it was his favorite role and his first. he maintained a friendship with stan laurel and oliver hardy until their passings. he was scheduled to appear at a laurel and hardy convention in july of 1990 with ms. charlotte henry and my wife and i were to meet him there. his recollection of the production sets were of vivid colors. when he attended the preview of the film he was disappointed because all he saw were greys and black and whites. he wished that hal roach would have shot the film in color even two strip technicolor. when talking to him about his long career always babes in toyland was foremost in his mind. the film holds up well today with another generation of children ( my grandkids included} and adults enjoying this trip into the world of fairytales and make believe. recently it has been released in computerized color, but i prefer the original black and white; but i think henry brandon would be happy to see his supreme villiany in the color version. a wonderful film, laurel and hardy at their best and the birth of a cinema villain for decades to come, my friend henry brandon nee kleinbach. yours at the movies joe rinando.",
         "This movie has always been known to me as \"March of the Wooden Soldiers, and has always had a special place in my memories of my childhood. I remember it was always shown on Thanksgiving Day after the Macy's parade, but we children would never be able to see the whole thing because it came on right at dinner time (this was long before VCR's). This is a wonderful, endearing film... bringing out the essence of childhood and the simplistic joys of make believe. Laurel and Hardy are their usual wonderful selves in this film. All the lead actors were wonderful, especially Henry Brandon as Barnaby -- oh, how he scared me as a child! I especially enjoyed the singing of Charlotte Henry and Felix Knight. When my work took me overseas, I made sure I had a copy of this movie with me so that I could continue the tradition of watching it each year on or close to Thanksgiving. Like that other holiday favorite of mine, Miracle on 34th Street (original version), this is a true classic -- a staple for the holiday season.",
         "I know this movie better as \"March of The Wooden Soldiers,\" but it really is one of, if not the, best of Laurel and Hardy. Somehow cast as a Christmas movie (there is an arbitrary reference to Christmas in this movie, and a Santa Claus toy order is messed up), the movie shines as all of the characters in the Mother Goose tales come to life, as do the goblin-like bogey-men, but the movie's best parts shine on Laurel and Hardy's scenes. Beautiful Charlotte Henry ( fittingly enough,a former Alice in Wonderland )and Felix Knight share the rest of the movie charmingly without taking away from the duo. The songs aren't that bad either, but a special note should go to Henry Kleinbach (nee Brandon) in his portrayal as Barnaby. Plucked off the stage while doing a nearly identical role, this young actor at the time creates a more despicable role than Ray Bolger in the Disney version. In fact, Brandon lived much of his career trying to forget this role in which he was almost typecast. This is one movie that should be seen every Christmas.",
         "When video was much less accessible, I waited every holiday season to see this movie. I always remembered the fun stuff, especially Laurel and Hardy, but forgot some of the bad music and rather draggy dialogue. Nevertheless, the set designers did a nice job creating this nursery rhyme world, with three little pigs (one of whom gets turned to sausages), and a raft of other characters. The scenes in the toy shop with the Boys are the best. I do remember as a small child being pretty terrified of that land of the bogy men. It was well done, as are all places where \"you must never go\" or \"where you will be banished to.\" Stan and Ollie do their shtick with finger wiggles and some silly game called \"peewees.\" They attempt to save the day for the old woman who lives in a shoe. They manage to bumble everything up royally. Still, as things play out, this doesn't have the tightly knit fabric of their best comedies--they need to be on camera more. But as a holiday event, this is worth a look for a new generation.",
         "Fabulous rendition of the Victor Herbert operetta. Stan Laurel and Oliver Hardy are endearing as the two workers in the toy factory who need to help out their landlady-the old lady who lives in the shoe. Not only can't they borrow money to help her with the mortgage, they soon find themselves out of work for making the wrong size soldier. What a blessing that will be by film's end. Silas Barnaby, played with great contempt, by Harry Kleinbach,who in real life was a refugee from Nazi Germany, owns the mortgage. He will tear it up if he can marry the old woman's daughter, a sweet Charlotte Henry. Leave it to Laurel and Hardy to dress up the former as a bride to fool the old skinflint. Bitter, Barnaby plots to destroy Henry (Bo Peep's) lover, Felix Knight. He plants damaging evidence proving that Knight had killed those poor 3 little pigs. Knight is condemned to Devil's Island. When Laurel and Hardy discover that Barnaby has made this mischief, all hell breaks loose. Seems as though Barnaby is really the head of the Bogey Men, a scary animal-like men hiding out on the island. To gain further revenge, Barnaby brings them out to destroy all of Toyland only to see those overly tall soldiers exact revenge. A wonderful film for children and adults as well. The singing by Charlotte Henry and Felix Knight is wonderful. The jokes by Laurel and Hardy are as corny but delightful as ever. Great family fare.",
         "BABES IN TOYLAND (Hal Roach/MGM, 1934), directed Gus Meins and Charles Rogers, is a musical fairy tale based on Victor Herbert's 1903 operetta that became tailor-made for the talents of comedy team Stan Laurel and Oliver Hardy in what's considered to be their very best and highly acclaimed adaptation taken from an operatic work, thanks to its fine script, comedy material and notable storybook characters brought to life on the screen. In spite of Stan and Ollie having to take time away from the screen in favor of plot development, musical interludes and romantic subplot, even appearing nearly ten minutes from the start of the story, the movie, overall, succeeds. Set in the mythical land of Toyland, Widow Peep (Florence Roberts) is an old woman about to be evicted from her home by the evil Silas Barnaby (Henry Brandon) unless her mortgage is paid. Barnaby is willing to overlook the matter and offer her the deed in favor of being honored for having her daughter, Bo-Peep (Charlotte Henry) as his bride. Bo-Peep loves Tom Tom Piper (Felix Knight, dressed like Peter Pan), and will have nothing to do with him. Stanley Dumb (Stan Laurel) and Oliver Dee (Oliver Hardy), a couple of toy-makers who take up room and board in Widow Peep's home, attempt to help by asking their employer, the toy master (William Burress) for an advance in salary, but because Stanley confused Santa Claus's (Ferdinand Munier) order 600 toy soldiers at one foot high, thus giving him 100 toy soldiers at six foot high instead of 600 soldiers at 1 foot high, they both get fired, and must come up with another solution in rescuing Bo-Peep from the clutches of Barnaby. A memorable score by Victor Herbert, only a few were selected for the screen, including: \"Toyland\" (sung by Virginia Karns); \"Don't Cry, Bo-Peep, Don't Cry\" (sung by Felix Knight); \"The Castles in Spain,\" \"Go to Sleep, Slumber Deep\" and \"The March of the Toys (Wooden Soldiers).\" Some reissue prints retitled MARCH OF THE WOODEN SOLDIERS eliminate Mother Goose's opening of \"Toyland\" as she opens the \"Babes in Toyland\" storybook and introduces it main characters in song: Little Bo Peep who lost her sheep; Tom Tom the Piper's Son; The Little Old Lady Who Lived in a Shoe (Widow Peep); Silas Barnaby, \"the meanest man in town\"; Hi Diddle Diddle, The Cat and the Fiddle; Three Little Pigs: Elmer, Willie and Jiggs; and finally Stanley Dumb and Oliver Dee, \"they love to sleep as you can see;\" along with the \"Go to Sleep\" number, having recently been restored on both video and DVD distributions ranging from colorized to original black and white photography. The musical interludes are not overdone yet capture the mood of the story. In fact, more than half of Victor Herbert's original score has been cast aside in keeping the story to average length (79 minutes). Charlotte Henry, who starred in Paramount's fantasy to Lewis Carroll's now forgotten screen adaptation of ALICE IN WONDERLAND (Paramount, 1933), is ideally cast as Bo-Peep. Had fate taken a different turn, one wonders if Henry would have succeeded playing Dorothy in THE WIZARD OF OZ had the L. Frank Baum story been brought to the screen about this time instead of 1939? It so happens that TOYLAND and OZ are similar in nature. They are both set in a mythical land; Silas Barnaby and the Wicked Witch are evil individuals who bring fear to those around them; Barnaby is assisted by hideous Bogeymen while the Witch has her flying monkeys; Laurel and Hardy are do-gooders similar to the Tin Man and the Scarecrow; and finally Toyland citizens bursting into song. Unlike most fantasies of this sort, BABES IN TOYLAND is not one extended dream sequence from which the leading character awakens back to reality as did Dorothy at her farm in Kansas following her Technicolor experience in the land of OZ. This is Toyland from start to finish, with a touch of Disneyland as one of the citizens of Toyland looking very much like Mickey Mouse! While as Dee and Dumb, Laurel and Hardy perform their roles in their usual traditional manner, but minus their trademark derbys. Their key scenes include having them sneaking into Barnaby's home to retrieve Widow Peep's deed only to get caught, thanks to Stanley, and being sentenced to public dunking in a pond of cold water (only Ollie gets the treatment) and thrown out of Toyland into Boogeyland forever (the same fate later set for Tom-Tom accused of pig-napping Elmer, thanks to Barnaby); their participation in Barnaby's wedding, as well as the grand finale where the toy soldiers are brought to life from the toy factory in their war against the bogeymen with Stan and Ollie's ammunition of darts fired from the cannon. Great march formation and still photography outdoes any computer technology today since more effort was put into this sequence alone. Cartoon violence is the essence here, especially when Ollie falls victim to it in the Wile E. Coyote tradition, but not to the extreme. More Laurel and Hardy than Victor Herbert, BABES IN TOYLAND is geared for children and adults alike, especially adults who watched this annually on television during the Christmas when they were kids themselves since the 1950s. In recent years, TOYLAND aired on American Movie Classics (1994-1996) and finally Turner Classic Movies (TCM premiere: December 24, 2012, with original theatrical title intact). Remade theatrically in 1961 by Walt Disney Productions, then again as either television movies or new theatrical adaptations in later years, it's the 1934 original that appears to live on happily ever after. (***1/2)",
         "I expected just another Laurel & Hardy slapstick comedy but instead got something that surpassed all my expectations. The story is absolutely great (based on the Glen MacDonough operetta) and features many well known fairy tale characters. The entire movie is set in a cheerful and colorful (atleast when you watch the colored-in version of the movie, released in the '90's of course.) world where everyone lives their simple and happy life and spend most of the time singing cheerful sappy songs. It's truly a movie that's both over-the-top and terribly outdated but that now has become a part of its charm and makes this movie a totally great and absolutely irresistible one. All of the fairly tale like characters are absolutely great in the movie. Most of them don't really play a significant role but their presence alone is enough reason to give the movie a joyful feeling. Speaking of insignificant roles; how about the boys? Well, to be honest Laurel & Hardy don't really play a most significant role in the movie. They are mealy sidekicks in the story and even though they get to do some funny sequences, with some typical Laurel & Hardy humor, this movie is not really a slapstick or comedy. It's more a cheerful musical with some comical characters in it. It's difficult to see if the presence of Laurel & Hardy make this movie a better one or not. It isn't really a Laurel & Hardy movie and it has a totally different feel and atmosphere. Some of the fans will be delighted with their appearance in this movie, while others will perhaps be disappointed by it. What really drives the movie is the story and its characters. The movie has a very solid villain in it, perfectly portrayed by Henry Brandon. Brandon apparently only was in his 20's when he played the role, so also lots of credits have to go to the make-up and costume department, for making him look like a scary, old, ugly, almost Scrooge like villain. The story also really has some solid moments in it. The ending is surprisingly big and spectacular and features monster like creatures, versus an army of wooden soldiers (in certain sequences created with some early stop-motion effects), build by our two boys. Even though the movie is mostly cheerful, it also knows how to build up its tension, with as a result some really well story-wise constructed moments that all work out extremely well. I'm going to say something very daring now but here goes; In my opinion this movie is even better than \"The Wizard of Oz\". Both movies are much alike in several different ways. Both movie are set in a cheerful imaginary world, with imaginary likable characters and a ruthless villain who spoils all the happiness in that same cheerful world. Let's face it, both of those movie are extremely old fashioned and outdated but the cheerful charm makes both of the movie irresistible ones, that still speak to the imagination. This movie is a real forgotten masterpiece and the movie deserves to be better known and seen by persons all over the world. Really a movie that I truly enjoyed watching. 10/10 http://bobafett1138.blogspot.com/",
         "Christmas comes but once a year. Of course we think of Frank Capra's IT'S A WONDERFUL LIFE (1946), which until recently had been thought to be in public domain. It was subject to almost constant showings. From Thanksgiving until New Year's, it was run on any channel and was. (We even remember seeing it run on 2 channels, simultaneously!) Well, due to some technicality concerning the music's not being out of copyright straightened out that Public Domain business. But that, Schultz, is another Story! Other Seasonal Favourites include: WHITE Christmas (1954), Christmas IN CONNECTICUT(1945), A CHARLIE BROWN Christmas (1965), HOW THE GRINCH STOLE Christmas (1966), Jean Shephard's A Christmas STORY (1983), MEET JOHN DOE (1941)*, GOING MY WAY (1944)*, THE BELLS OF ST. MARY'S (1945)* and Charles Dickens'A Christmas CAROL (all versions). One film that makes its appearance with out any fanfare each Yuletide is BABES IN TOYLAND aka MARCH OF THE WOODEN SOLDIERS (Hal Roach/MGM, 1934). The Musical Fantasy, based on the Victor Herbert Operetta, first performed on October 13, 1903. Its premiere was at the Majestic Theater, on Broadway in New York City. Much of the music that was retained for the film was very well known to the general public. The Movie of BABES IN TOYLAND takes the characters of Tweedle-Dumb and Tweedle Dee, prominent in English literature even before being featured in Lewis Carroll's ALICE IN WONDERLAND; and transforms into Stannie-Dumb & Ollie-Dee. It was a near perfect adaptation; putting Laurel & Hardy right in the story, both as Mother Goose type characters and in their familiar roles. OUR STORY\u0085\u0085The Boys have jobs working in the Toy Factory and share the rental of a room from Mother Peep (Florence Roberts), who is a Widow and lived in a huge Shoe and had so many Children, etc. Her eldest child, Bo-Peep (Charlotte Henry, Woo,woo,woo,woo!) has the job of tending the sheep, which she continually looses. After \"playing hard to get\", she agrees to marriage with Tom-Tom, the Piper's Son (Felix Knight). All of Toyland is jubilant at the announcement. That is, except for one citizen. Lecherous, dirty old man type, Silas Barnaby (Henry Brandon) is the old miserly guy who is desirous of Bo-Peep, and has unsuccessfully proposed marriage to her. But, the \"Crooked Little Man, who lives in a Crooked Little House\" also holds the now overdue, subject to foreclosure Mortgage on Widow Pep's house. The Boys attempt to help Mother Peep both in trying to borrow the money from their stern and crabby boss, the Toymaker (William Burness) and in an unsuccessful attempt to steal the Mortgage agreement from Barnaby's house. Rather than see Stannie-Dumb & Ollie-Dee face punishment and to save her Mother and family from eviction, Bo-Peep agrees to nuptials with Barnaby. With help of Stan & Ollie, Barnaby is fooled (he didn't know that the highly veiled Bride was really Laurel!), but he frames Tom-Tom, who faces punishment of \"Banishment to Bogeyland\". Bogeyland's being a cavernous wasteland populated by the Bogeymen (or 'Boogiemen', if you please!) They are monstrous, half beast-half man, vicious, wild creatures; who turn out to be followers of, you guessed it, Silas Barnaby! In the finale, after Stan & Ollie rescue Bo-Peep & Tom-Tom, Barnaby leads the Bogeymen in the invasion an sacking of Toyland; until Laurel & Hardy turn the tables by using \"The March of The Toys\" and some hereto for useless Toy Soldiers. BABES IN TOYLAND (or MARCH OF THE WOODEN SOLDIERS) successfully touches all the bases and hits the ball right out of the ball park, a Grand Slammer! As a Christmas story, as Family Viewing Fare, as a Musical and of course, as a Laurel & Hardy starring vehicle it cannot be beat! The Laurel & Hardy bits of business just roll out naturally, without any slowing of the story. And we are treated to a vast array of the great Comedians' best stuff; what, with Stan's prowess for a sort of \"stick ball game\" (\"Peewees\") and some references to bits of comic business from previous pictures. Producer,Mr. Hal Roach, Sr. did an excellent job of assembling a supporting cast featuring many a veteran of the old silent comedy days, like Old King Cole (Sennett veteran Kewpie Morgan), Chief of Police (Billy Blecher) and Townsmen (Sam Lufkin, Ham Kinsey & Roach Studios regulars, Baldwin Cooke & Charlie Hall). Additionally we see veteran \"B\" film actors like: Stanley \"Tiny\" Sandford, Frank Austin, Richard Alexander, Jack \"Tiny\" Lipson, Virginia Kams, Marie Wilson, Jean Darling and many more. We must take notice of our Bo-Peep,Miss Charlotte Henry the young, delicate, beauty of a starlet, who regrettably made only about 30 films; opting for early retirement. Her screen persona was so sweet and sexy, even! (What a \"dirty old man\" I have become!) The music is all Victor Herbert, but for short quotations from Disney's \"Who's Afraid of the Big, Bad Wolf\"; as the Three Little Pigs and a couple of additional characters added were \"The Cat and the Fiddle's\" foil, a Monkey dressed as Mickey Mouse! If you see it on Broadcast, Cable or Satellite TV, you're stuck with whatever the format that is being shown. If you rent or buy a DVD or VHS, check its running time to make sure that it isn't an abridged version, as you'll miss out on a lot. It's a shame that this movie was not done in Technicolor, as the MGM Musical Extravaganza, THE WIZARD OF OZ (1939) would be 5 years later. This is one time where I could approve of the \"Colorization\", which has been done to some VHS & DVD editions are; for the effect is one of its being a Gigantic Story Book. And, that's exactly what it is, Schultz! NOTE: * Strictly speaking, these 3 are not Christmas pictures, but do come to their endings at Christmastime; but,so does NIGHT OF THE HUNTER (1955).",
         "I am a huge Laurel and Hardy fan, and while this may not be considered one of their great feature length films, I love to get this out for the December holidays. After the rest of the family watches \"Wonderful Life\", \"Scrooge\" and the Nutcracker, I pull this out and laugh until I cry. The only link to the holiday is the use of the \"March of the Soldiers\" music - but that's enough for me. Stan Laurel's ingenious battle tactics just send me into a fit."
      ],
      "genres": [
         "Comedy",
         "Family",
         "Fantasy",
         "Musical"
      ],
      "productionCompanies": ["Hal Roach Studios"],
      "summaries": ["Ollie Dee and Stanley Dum try to borrow money from their employer, the toymaker, to pay off the mortgage on Mother Peep's shoe and keep it and Little Bo Peep from the clutches of the evil Barnaby. When that fails, they trick Barnaby into marrying Stanley Dum instead of Bo Peep. Enraged, Barnaby unleashes the bogeymen from their caverns to destroy Toyland."],
      "budget": 0
   },
   "movielensId": 3086,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1934-12-14",
      "dvdReleaseDate": "1999-11-09",
      "directors": [
         "Gus Meins",
         "Charley Rogers"
      ],
      "runtime": 73,
      "movieId": 3086,
      "title": "Babes in Toyland",
      "mpaa": "G",
      "actors": [
         "Stan Laurel",
         "Oliver Hardy",
         "Charlotte Henry",
         "Felix Knight",
         "Henry Brandon",
         "Florence Roberts",
         "Virginia Karns",
         "Marie Wilson",
         "Johnny Downs",
         "Scotty Beckett",
         "Billy Bletcher",
         "Ellen Corby",
         "Jean Darling",
         "Charlie Hall",
         "Dickie Jones",
         "Ham Kinsey",
         "Alice Lake",
         "Joy Lane",
         "Jack 'Tiny' Lipson",
         "Tiny Sandford",
         "John George"
      ],
      "imdbMovieId": "0024852",
      "originalTitle": "Babes in Toyland",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [
         "srrxvlYXFVo",
         "S0M6_ZpbB4A"
      ],
      "plotSummary": "Ollie Dee and Stanley Dum try to borrow money from their employer, the toymaker, to pay off the mortgage on Mother Peep's shoe and keep it and Little Bo Peep from the clutches of the evil Barnaby. When that fails, they trick Barnaby into marrying Stanley Dum instead of Bo Peep. Enraged, Barnaby unleashes the bogeymen from their caverns to destroy Toyland.",
      "tmdbMovieId": 25898,
      "avgRating": 3.55,
      "releaseYear": "1934",
      "numRatings": 490,
      "posterPath": "/8EoKfCGMTcywFSA6Wxt1a8HDQlx.jpg"
   }
}