{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "mining town",
         "id": 156018
      }],
      "imdb_id": "tt0067411",
      "video": false,
      "title": "McCabe & Mrs. Miller",
      "recommendations": [
         3121,
         1847,
         3088,
         976,
         776,
         26030,
         16958,
         11577,
         25955,
         14554,
         16305,
         3089,
         678,
         14638,
         965,
         14580,
         980,
         26596,
         15794,
         29845
      ],
      "backdrop_path": "/eu1tpFquagrdJGJZ4sPZcnODp4l.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "John McCabe",
               "gender": 2,
               "credit_id": "52fe45c1c3a368484e06cfd9",
               "name": "Warren Beatty",
               "profile_path": "/1fsYRe1WhIohbfk8qHmjMcuCXeJ.jpg",
               "id": 6449,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Constance Miller",
               "gender": 1,
               "credit_id": "52fe45c1c3a368484e06cfdd",
               "name": "Julie Christie",
               "profile_path": "/8ExaneRh7VHcm2rATpau89Qwzjm.jpg",
               "id": 1666,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Sheehan",
               "gender": 2,
               "credit_id": "52fe45c1c3a368484e06cfe1",
               "name": "Rene Auberjonois",
               "profile_path": "/eAF43tqzBqq7Lgi7jG27BBUZ6Bp.jpg",
               "id": 9807,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "The Lawyer",
               "gender": 2,
               "credit_id": "52fe45c1c3a368484e06cfe5",
               "name": "William Devane",
               "profile_path": "/SYI4fML7EmZDghuieWf6SpiyRF.jpg",
               "id": 21416,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Smalley",
               "gender": 2,
               "credit_id": "52fe45c1c3a368484e06cfe9",
               "name": "John Schuck",
               "profile_path": "/8HJXSRTewFRic6wYmgJTMPNatUf.jpg",
               "id": 24046,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Mr. Elliot",
               "gender": 2,
               "credit_id": "52fe45c1c3a368484e06cfed",
               "name": "Corey Fischer",
               "profile_path": null,
               "id": 34686,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Bart Coyle",
               "gender": 2,
               "credit_id": "52fe45c1c3a368484e06cff1",
               "name": "Bert Remsen",
               "profile_path": "/kLddDLz6g3vBaTnmPD0yzPj04Bo.jpg",
               "id": 30621,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Ida Coyle",
               "gender": 0,
               "credit_id": "52fe45c1c3a368484e06cff5",
               "name": "Shelley Duvall",
               "profile_path": "/iXBGoVOGCzBkz9klj7YJ83pkstf.jpg",
               "id": 10409,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Cowboy",
               "gender": 2,
               "credit_id": "52fe45c1c3a368484e06cff9",
               "name": "Keith Carradine",
               "profile_path": "/b2GbGSrgb6twTdjfvUK4y0WrIjx.jpg",
               "id": 30613,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Eugene Sears",
               "gender": 2,
               "credit_id": "52fe45c1c3a368484e06cffd",
               "name": "Michael Murphy",
               "profile_path": "/ebbKhFgIHugUywSL5udMFNfRxvQ.jpg",
               "id": 4776,
               "order": 9
            },
            {
               "cast_id": 25,
               "character": "Town drunk",
               "gender": 2,
               "credit_id": "5a0bd4a1c3a36876420069a9",
               "name": "Robert Fortier",
               "profile_path": "/4dXEtjQ7ToWOuHXiwDoxkmkNrac.jpg",
               "id": 166790,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45c1c3a368484e06d003",
               "name": "Mitchell Brower",
               "profile_path": null,
               "id": 102546,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c1c3a368484e06d009",
               "name": "Robert Altman",
               "profile_path": "/xA6n9OVD5pVrctLtmxwyhtVFcEf.jpg",
               "id": 9789,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c1c3a368484e06d00f",
               "name": "Brian McKay",
               "profile_path": null,
               "id": 102547,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c1c3a368484e06d015",
               "name": "Robert Eggenweiler",
               "profile_path": null,
               "id": 30591,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c1c3a368484e06d01b",
               "name": "Lou Lombardo",
               "profile_path": null,
               "id": 7770,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "533ee281c3a368706e0001dc",
               "name": "Edmund Naughton",
               "profile_path": null,
               "id": 1016872,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "533ee28ec3a368706e0001de",
               "name": "Robert Altman",
               "profile_path": "/xA6n9OVD5pVrctLtmxwyhtVFcEf.jpg",
               "id": 9789,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "533ee2b2c3a36870880001ee",
               "name": "Vilmos Zsigmond",
               "profile_path": "/zItpdF2B0mohQSFs40E7eUg3nkL.jpg",
               "id": 12235,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "533ee2c4c3a368705f0001ef",
               "name": "Graeme Clifford",
               "profile_path": null,
               "id": 13488,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "533ee2d9c3a36870510001f3",
               "name": "Leon Ericksen",
               "profile_path": null,
               "id": 32772,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "533ee2f2c3a36870510001f5",
               "name": "Al Locatelli",
               "profile_path": null,
               "id": 1016873,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "533ee2fcc3a36870510001fb",
               "name": "Philip Thomas",
               "profile_path": null,
               "id": 1016768,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "589201919251412dd1008990",
               "name": "Leonard Cohen",
               "profile_path": "/r9b0vybiCLx0PQsZOVJ0Tso4QOm.jpg",
               "id": 3185,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [{
         "name": "Western",
         "id": 37
      }],
      "popularity": 7.38111,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 29005,
      "vote_count": 111,
      "budget": 0,
      "overview": "A gambler and a prostitute become business partners in a remote Old West mining town, and their enterprise thrives until a large corporation arrives on the scene.",
      "similar": [
         48855,
         66027,
         26405,
         454363,
         107239,
         45996,
         84090,
         244810,
         65996,
         53939,
         283124
      ],
      "original_title": "McCabe & Mrs. Miller",
      "runtime": 120,
      "poster_path": "/buuKUShkNWfF5clxVE2pGCBFu81.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
         "name": "Warner Bros. Pictures",
         "id": 174,
         "origin_country": "US"
      }],
      "release_date": "1971-06-24",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "Name your poison",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Robert Altman"],
      "runtime": 120,
      "synopsis": null,
      "writers": [
         "Edmund Naughton",
         "Robert Altman"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0067411/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcwMzMzMzUwMl5BMl5BanBnXkFtZTcwMjI1ODAwMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Warren Beatty, Julie Christie, Rene Auberjonois | See full cast and crew »"],
      "reviews": [
         "I spent the entirety of my final year in college reading western literature, reading about western literature, and watching western films. Although I had long been a fan of Altman's 1971 masterpiece, I would probably never have called it the greatest western film. Having sat through most of the Rios, the Searchers, Red River, Stage Coach, the Leone Spaghetti Westerns, and the more current incarnations of the genre (Unforgiven, Dances with Wolves, All the Pretty Horses, et al.), I will say without hesitation that McCabe is a superior film (and a superior western) to all those listed. It is not, of course, a traditional western, nor does it hold true to traditional 'values' of the western. You will not find any rampaging indians, and the typical shots of vast prairies or a surreal Monument Valley. Your hero is a conniving gambler and the heroine is a whore (and one that quite distinctly lacks a heart of gold). They're sympathetic, but they're also quite real with all the faults and foibles humans typically have. The landscape is brown and green; trees are everywhere and it looks like it's wet most of the time (which is appropriate to a film taking place in the Northwest). One of the few \"cowboys\" in the film dies in his underwear. By a long shot, then, this is not your typical western, but it is better. The wooden characters of old are replaced with real people to whom we can relate and about whom we can care. Furthermore, the environment - dark, dirty, wet, and all around not terribly inviting - seems more in line with the historical west than the traditional western. The West was not the nicest place to live; it was dangerous and inhospitable as it is in McCabe. I could go on and on about how Altman inverts the western film tradition throughout the movie (as well as how he dismantles the notion that capitalism is a good economic and social system), but I will not. There is no need to treat McCabe that academically. The film is simply wonderful and entertaining - terrific performances, wonderful cinematography, a fascinating story, and great (and very Altman-esque) direction with overlapping conversations and well-handled improvisations. The movie also has the most perfect soundtrack I have ever heard. The songs - by the one and only Leonard Cohen - perfectly match the mood and atmosphere of the film and moreover feel like artifacts of that bygone era depicted in the film. That they were not written or recorded specifically for McCabe is astounding, as they are such an integral and organic part of this film. If you have not seen this film, please do so; it's well worth the time and, unlike Nashville and Short Cuts - Altman's other masterpieces - it's very accessible.",
         "The first thing to know about Robert Altman's revisionist Western \"McCabe & Mrs. Miller\" is that it takes place in Washington state. Typical Westerns are set in arid semi-deserts, full of blazing skies, blazing shotguns, and blazing tempers. Here, the dank, chilly Pacific Northwest permits, or rather demands, a different range of emotions: poignancy, regret, wintry melancholy. This film takes many risks, using Leonard Cohen's haunting ballads on the soundtrack and shooting scenes in very low light, but remarkably, everything coheres. The film features Altman's trademark group scenes with overlapping dialogue, but not his typical interlocking plot lines. True to its title, the story centers on gambler and brothel owner John McCabe (Warren Beatty) and his shrewd business partner, Mrs. Constance Miller (Julie Christie). Still, supporting characters always hover at the edges, taking part in vignettes that underline the movie's themes and occasionally provide some humor. In this way, the movie avoids the chaos and confusion of some Altman films, while always remaining aware that the main characters are part of a larger community. It's a perfect balance: both clear and complex. Still, \"McCabe & Mrs. Miller\" is more a study of place and character than a narrative drama. The small, isolated settlement of Presbyterian Church is newly built, but already seems to molder. Ironically, McCabe's brothel is the most \"civilized\" place in town: it is built quickly and even gets painted, while the church remains half-finished. No families, parents or children live in this bleak town, just a bunch of weary miners and whores who delude and distract themselves. They all have dreams, but barely know how to achieve them; for this reason, they're sympathetic and all too human. McCabe is a true anti-hero, a guy who thinks he's a slick, wisecracking gambler, but his jokes fall flat and he lacks common sense. Mrs. Miller seems confident and shameless, but she secretly uses opium to dispel the pain of living. At times, the movie is well aware of how it subverts the clichés of the Western genre to reflect what would really have happened out West. For instance, there is a final shootout, but it arises because of a quarrel over business\u0097there are no Indians, no outlaws, and no sheriffs here! But \"McCabe & Mrs. Miller\" is much more than just a clever exercise in revisionism; it's never overtly satirical or mean-spirited. It keenly observes its world and then comments on it, overlaying everything with a delicate sense of poignancy and loss. This is the kind of film that stays with you, but not because of sharp dialogue, beautiful images, or showy performances. Greater than the sum of its parts, \"McCabe & Mrs. Miller\" is memorable for the pervasive but understated mood that runs through every frame, creating a truly atmospheric and humanistic film.",
         "Spoilers herein. Filmmakers - intelligent ones - have to choose where they live in a film. The ordinary ones attach themselves to the narrative, usually the spoken narrative, so we get faces and clear, ordered speech to tell us what is going on. These are the most formulaic because there are after all only so many stories that are presentable. Some attach themselves to characters, dig in and let those characters deliver a tale and situation. Often with the Italians and Italian-Americans, the camera swoops on a tether attached to these characters. I consider this lazy art unless there is some extraordinary insight into the relationship between actor and character. And then there the few who attach themselves to a sense, a tone, a space. That situation has ideas and stories and talk, but they are only there as reflections from the facets of the place. Of the three, this is the hardest to do well; that's why so few try. And of those that do, most convey style only, not a place, not a whole presentation of the way the world works. This film is about the best example I know where the world is 'real,' the situation governs everything and the primary substance is the presentation of a Shakespearian quality cosmology of fate. The camera moves not so much with the story, but it enters and leaves. And there is not just one story, but many that we catch in glimpses. Words just appear in disorder as they do in life. Not everything is served up neat. We drift with the same arbitrariness as McCabe. It is not as meditative as 'Mood for Love' as it has something we can interpret as a story to distract us. So as a matter of craft, this is an important film, one with painful fishhooks that stick. Beatty had already reinvented Hollywood with 'Bonny,' and was a co- conspirator in this. (If you are into double bills, see it with 'The Claim,' which is intended as a distanced remake/homage, that obliquely references Warren.) Quite apart from the craft of the thing, and the turning of the Western on its head long before 'Unforgiven,' there are other values: - the notion that actors are imported into a fictional world as whores. Not a new idea for sure, but so seamlessly and subtly injected here, it becomes just another one of the background stories. (Also referenced in 'Unforgiven.') - the business about the preacher trying to wrestle some old school order from the overwhelming mechanics of arbitrary fate. This is the director's stance. - the final concept that the whole thing, McCabe and church and all is an opium dream of the aptly named 'Constance,' dimly reinterpreting other events after the fashion of 'Edwin Drood.' Ted's Evaluation -- 4 of 3: Every cineliterate person should experience this.",
         "I was led to this movie in 1972 via the Academy nomination of Julie Christie for her remarkable performance and the small trailer used to highlight her. This was enough to get my attention. Since then I have recommended it to any movie lover- whether a \"student of film\" or not. I am constantly surprised at the numbers of people who haven't seen this masterpiece. I've lived with it's haunting scenes for a quarter of a century and, as with anything of depth, constantly find new charms in my old love. From the evocative lyrics of the opening score to it's sudden chilling and deadly encounters, this movie lives in your mind long after the final blizzard cloaks the frame. If one is a contrarian I would guess the only thing to do after seeing this for perhaps the fiftieth time is to begin looking for that moment where someone, anyone has put a foot wrong in this production. From gaffers to grips, actors to designers, continuity to props it is so pure as to be a documentary in it's granular clarity- there may be a wrong note in there somewhere but until then do yourself a favor and give yourself up to as rich a cinematic experience as you are ever likely to find. There are few movies I love- I love this movie.",
         "As a Western this film is fascinating for what it does not contain. There are no sweeping vistas of the Great Plains, no Indians, no cacti, no cowboy hats. There is no sheriff, no broiling sun, and no corny music. And unlike most Westerns, which are plot driven, \"McCabe & Mrs. Miller\" is less about plot than about the tone or mood of the frontier setting. The film takes place in the Pacific Northwest. The weather is cold, cloudy, and inclement. You can hear the wind howling through tall evergreens. And Leonard Cohen's soft, poetic music accentuates the appropriately dreary visuals. In bucking cinematic tradition, therefore, this film deserves respect, because it is at least unusual, and perhaps even closer in some ways to the ambiance of life on the American frontier than our stereotyped notions, as depicted in typical John Wayne movies. Not that the plot is unimportant. Warren Beatty plays John McCabe, a two-bit gambler who imports several prostitutes to a tiny town, in hopes of making money. Julie Christie plays Mrs. Miller, a prostitute with a head for business. She hears about McCabe's scheme, and approaches McCabe with an offer he can't refuse. Soon, the two are in business together, but complications ensue when word gets around that McCabe may be a gunslinger who has killed someone important. Mrs. Miller is clearly a symbol of the women's liberation movement, and the film's ending is interesting, in that context. \"McCabe & Mrs. Miller\" is a vintage Altman film, in that you can hear background chatter, in addition to the words of the main character. It's Altman's trademark of overlapping dialogue. The film's acting is fine. Both Beatty and Christie perform credibly in their roles. The visuals have a turn-of-the-century look, with a soft, brownish hue. Costumes and production design are elaborate, and appear to be authentic. The film is very dark, so dark in some scenes that I could barely make out the outline of human figures. In those scenes, I think they went overboard with the ultra dim lighting. Strictly atypical for the Western genre, \"McCabe & Mrs. Miller\" provides a pleasant change from cinematic stereotypes, and conveys a different perspective on life in the Old West. It's a quality production, one that has Robert Altman's directorial stamp all over it. In that sense, it's more like a cinematic painting than a story. And the painting communicates to the viewer that life on the American frontier was, at least in some places, cold and dreary, and had a quietly poetic quality to it.",
         "Leonard Cohen's songs don't seem an ordinary choice for a western, but Robert Altman was no ordinary director, and his \"McCabe & Mrs. Miller\" was definitely not your traditional western. This film can be called a western because of its settings, but if anything, this is a \"revisionist western\" (à la Clint Eastwood's more recent \"Unforgiven\", a film that also subverted all the clichés and morales of this traditionally macho genre). And, more than anything, it's a love story. John McCabe (Warren Beatty), charismatic but no so smart, sets up a whorehouse in the Old West. Constance Miller (Julie Christie), beautiful, strong and determined, soon arrives in town and offers to run the \"business\" and share the profits with McCabe. They start a tempestuous relationship while business thrives... but when a major corporation tries to buy McCabe & Mrs. Miller's enterprise, McCabe refuses to sell it. It's the beginning of his, her and the town's doom. Even when exploring such a visual genre as the western (and visually the film is also very compelling, with great use of real snow and a beautifully shot \"duel\" on a bridge), Altman uses one of his most notorious trademarks: the overlapping dialogue, commonly used in ensembles but also wisely used in a more intimate, character-driven story like this. It works very well, although the 1 on 1 dialogues are deeply insightful themselves (the scene when Christie teaches a very young widow, played by Shelley Duvall, how she is supposed to behave in her new job, is brief, human, and dry). Beatty gives one of his most subtle, captivating performances, and Christie empowers Mrs. Miller with flesh and blood - she was definitely one of the most beautiful and intriguing actresses of her time, alongside Faye Dunaway and Jane Fonda, who set up a standard for beautiful, strong women who were much more than sheer eye candy. McCabe and Mrs. Miller's relationship is so fascinating that even the bang bang fans will be drawn into it and root for them to end together. So, next time someone says Clint Eastwood reinvented the western with his masterpiece \"Unforgiven\", remember: 21 years before, Altman had experimented and succeeded on that with his \"McCabe & Mrs. Miller\". Because love stories are more than kisses and happy endings, and westerns go beyond blood and testosterone.",
         "Behind every great man is a great woman. McCabe is the man, Mrs. Miller is the woman, and together they form a pretty successful team. Both are in search of the American dream: freedom, fortune, security. Mrs. Miller, a prostitute, and the real brains behind the operation helps make this possible for the couple. She doesn't want to be nothing but a whore for the rest of her life. They partner up and establish the best lil' whorehouse in town. This is quite the unconventional western, and it is executed so perfectly as only the great Robert Altman could do. I loved the whole process of the film. I liked the characters and wanted to see them succeed. When things go bad, as they often do, some very tense sequences ensue. Men are hired to kill McCabe for not negotiating with the right people. There is one part where he first meets the man hired to kill him that is so nerve-wrecking, but so amusing at the same time. I mean, it's pretty clear early on that McCabe is a bit of a buffoon, but I think this is the crucial point in the film when we know we really care about his fate. Wonderfully acted by Warren Beatty and Julie Christie in the lead roles(as well as the supporting cast), being in the hands of Robert Altman, and with some great music by Leonard Cohen, McCabe & Mrs. Miller proves itself as a great, great movie. It's a comedy, a tragedy, a classic, a true masterpiece. My rating: 10/10",
         "Few westerns have succeeded so strangely yet so completely in evoking a sense of place and time than Robert Altman's \"McCabe and Mrs Miller\". In fact, it's not really a western at all; certainly not like any western I've ever seen. It's setting is the Pacific Northwest; cold, rainswept and often covered in snow. There are gunslingers but they are more like the professional hit men of gangster movies. When Altman isn't filming through the haze of a rain-drenched exterior he is filming through the haze of a dimly lit interior where darkness is more prevalent than light. Above all, it doesn't have a conventional western hero. McCabe is like a tragi-comic Everyman out of his depth and his territory in this largely alien environment yet canny enough to apply his savvy into transforming the landscape into something tangible, real and materialistically American. In this respect it is a very modern film in spite of its setting. The fact that Altman doesn't care very much about convention or even about narrative, (it's story is perfunctory; Altman is more interested in 'observing'), makes it so. But then \"MASH\" wasn't a conventional war movie either just as \"Nashville\" wasn't really about the country music business. As for McCabe himself, Beatty plays him with the same laconic, stammering mannerisms he applies to all his roles, (and which he seems either blessed or cursed with in real life), and which actually makes him a perfect Altman hero, (or anti-hero, if you prefer). Mrs Miller, on the other hand, seems coolly distracted from what's going on around her. Julie Christie plays up her Englishness adding another element to the alienation of her character, a stranger in a strange land indeed, while in the foreground the songs of Leonard Cohen seem to hover like warm blankets, cosily familiar and comforting even at their bleakest. They could have been written for the film.",
         "McCABE & MRS. MILLER deals with several of the harsher realities of life in The Old West, and does so unflinchingly, without undue sentimentality (despite the haunting music of Leonard Cohen). Down and dirty filmmaking. Had there been documentary filmmakers roaming The Old West, they might well have shot something not unlike what Altman has wrought here. Unconventional in the extreme, McCABE & MRS. MILLER is the kind of down-to-earth western we need more of. The glamour of hard times washes right off and all that's left is a brutal, harsh reality. Superior filmmaking.",
         "Spoilers Their is so much to say about this film, that it is hard to begin in one place. This could possibly be the best film ever made. Upon my first time seeing this masterpiece, I half paid attention, but got enough out of it to realize that it demanded a second viewing. By the time I had realized I wanted to see this film again, I came to the conclusion that I had to own it. I gave it a serious look once I bought it on DVD, and am continuously drawn into its world no matter how many times I watch it, it only gets better. Powerful is one of the many words which comes to mind, the film starts out beautifully, and subtly becomes deeper as it progresses and the layers are piled on. The stratas are wove together like a sublime tapestry or an orchestral movement by Mozart. It begins simply with one note, and becomes a hauntingly rich harmony. The best scenes, the ones which stuck with me for days and months after, are the opening sequence with Mccabe riding in on the horse, with the absolutely perfectly chosen Leonard Cohen soundtrack (Altman tells of listening to Leonard Cohen so much before filming Mccabe and Mrs. Miller, that he subconsciously thinks set the tone of the film to a Leonard Cohen soundtrack, which he then added after the film was shot) The scene where Julie Christie is in bed after smoking opium and hiding under the covers like a playful child while Mccabe says \"you're a funny little woman\", and the most powerful scene in the film, the innocent cowboy being gunned down on the bridge by the kid who is trying to be a big man in front of his gang. Of course I left out all the brilliant camera work which fits perfectly, never a gratuitous pan or close up, and the final scene of Julie Christie smoking opium while on the bed. In nearly every scene a fire is lit, whether it is a lamp, fire from a fire place, or the church burning in the final scene, fire permeates this film. The warm orange glow of the fireplace in conjunction with Mccabe's giant orange coat, the orange hued leaves lightly pelted with rain, and the warming effect Julie Christie casts from the effects of the opium weave together synergistically, serving as a stark contrast to the wind and snow in the barren newly constructed frontier town. The genius of Altman, lies in shocking the audience, he is a master magician and master of surprise. It is brilliant that he made a western in the middle of winter, it is fantastic that he made the hero an anti-hero, it is magical the entire film came together seamlessly. I am a better person for having seen this film."
      ],
      "genres": [
         "Drama",
         "Western"
      ],
      "productionCompanies": [
         "David Foster Productions",
         "Warner Bros."
      ],
      "summaries": [
         "Set in winter in the Old West. Charismatic but dumb John McCabe arrives in a young Pacific Northwest town to set up a whorehouse/tavern. The shrewd Mrs. Miller, a professional madam, arrives soon after construction begins. She offers to use her experience to help McCabe run his business, while sharing in the profits. The whorehouse thrives and McCabe and Mrs. Miller draw closer, despite their conflicting intelligences and philosophies. Soon, however, the mining deposits in the town attract the attention of a major corporation, which wants to buy out McCabe along with the rest. He refuses, and his decision has major repercussions for him, Mrs. Miller, and the town.",
         "A gambler and a prostitute become business partners in a remote Old West mining town, and their enterprise thrives until a large corporation arrives on the scene."
      ],
      "budget": 0
   },
   "movielensId": 3093,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1971-06-24",
      "dvdReleaseDate": "2002-06-04",
      "directors": ["Robert Altman"],
      "runtime": 120,
      "movieId": 3093,
      "title": "McCabe & Mrs. Miller",
      "mpaa": "R",
      "actors": [
         "Warren Beatty",
         "Julie Christie",
         "Rene Auberjonois",
         "William Devane",
         "John Schuck",
         "Corey Fischer",
         "Bert Remsen",
         "Shelley Duvall",
         "Keith Carradine",
         "Michael Murphy",
         "Robert Fortier"
      ],
      "imdbMovieId": "0067411",
      "originalTitle": "McCabe & Mrs. Miller",
      "genres": ["Western"],
      "youtubeTrailerIds": [
         "DEZAsICGDEI",
         "Xkr5p0XCaUQ",
         "NDiD8a0agok"
      ],
      "plotSummary": "A gambler and a prostitute become business partners in a remote Old West mining town, and their enterprise thrives until a large corporation arrives on the scene.",
      "tmdbMovieId": 29005,
      "avgRating": 3.82085,
      "releaseYear": "1971",
      "numRatings": 1549,
      "posterPath": "/buuKUShkNWfF5clxVE2pGCBFu81.jpg"
   }
}