{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "hairdresser",
            "id": 928
         },
         {
            "name": "presidential election",
            "id": 2946
         },
         {
            "name": "los angeles",
            "id": 12670
         },
         {
            "name": "beverly hills",
            "id": 163047
         },
         {
            "name": "sex comedy",
            "id": 170827
         },
         {
            "name": "1960s",
            "id": 208992
         }
      ],
      "imdb_id": "tt0073692",
      "video": false,
      "title": "Shampoo",
      "recommendations": [
         32044,
         42597,
         31657,
         19429,
         27224,
         17450,
         25697,
         40634,
         116014,
         106143,
         14742,
         31908,
         42176,
         23303,
         25520,
         43336,
         45225,
         42160,
         5769,
         46059
      ],
      "backdrop_path": "/ifOMqqbHFzYEYY5zuv2acwk1YYi.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "George Roundy",
               "gender": 2,
               "credit_id": "52fe44609251416c9100e917",
               "name": "Warren Beatty",
               "profile_path": "/1fsYRe1WhIohbfk8qHmjMcuCXeJ.jpg",
               "id": 6449,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Jackie Shawn",
               "gender": 1,
               "credit_id": "52fe44609251416c9100e91b",
               "name": "Julie Christie",
               "profile_path": "/8ExaneRh7VHcm2rATpau89Qwzjm.jpg",
               "id": 1666,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Jill",
               "gender": 1,
               "credit_id": "52fe44609251416c9100e91f",
               "name": "Goldie Hawn",
               "profile_path": "/29s9YEFtR1A3ijJ01JlLjYtLpNU.jpg",
               "id": 18892,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Felicia Carr",
               "gender": 1,
               "credit_id": "52fe44609251416c9100e935",
               "name": "Lee Grant",
               "profile_path": "/t59I45kO8VxH57gg6hGE5UyC0f7.jpg",
               "id": 30123,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Lester",
               "gender": 2,
               "credit_id": "52fe44609251416c9100e939",
               "name": "Jack Warden",
               "profile_path": "/pD98exbwlD4f9QmQd0N8Sa7j6pw.jpg",
               "id": 5251,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Johnny Pope",
               "gender": 2,
               "credit_id": "52fe44609251416c9100e93d",
               "name": "Tony Bill",
               "profile_path": "/u2bReGWYZYurA6OXIdF2VOdCX1z.jpg",
               "id": 57138,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Mr. Pettis",
               "gender": 2,
               "credit_id": "52fe44609251416c9100e941",
               "name": "George Furth",
               "profile_path": "/hVSE8zXoN7BmNbimcnZZpHYOMYj.jpg",
               "id": 9597,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Norman",
               "gender": 2,
               "credit_id": "52fe44609251416c9100e945",
               "name": "Jay Robinson",
               "profile_path": "/eVZopDhNpFjeZyMg1OZn4LGPQF8.jpg",
               "id": 16097,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Mary",
               "gender": 1,
               "credit_id": "52fe44609251416c9100e949",
               "name": "Ann Weldon",
               "profile_path": null,
               "id": 156444,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Devra",
               "gender": 1,
               "credit_id": "52fe44609251416c9100e94d",
               "name": "Luana Anders",
               "profile_path": "/7iFXDZV0NUkagIkmLVviFUqJpmb.jpg",
               "id": 77485,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Dennis",
               "gender": 0,
               "credit_id": "52fe44609251416c9100e951",
               "name": "Randy Scheer",
               "profile_path": null,
               "id": 1068097,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Lorna",
               "gender": 1,
               "credit_id": "52fe44609251416c9100e955",
               "name": "Carrie Fisher",
               "profile_path": "/oVYiGe4GzgQkoJfdHg8qKqEoWJz.jpg",
               "id": 4,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Gloria",
               "gender": 0,
               "credit_id": "52fe44609251416c9100e959",
               "name": "Susanna Moore",
               "profile_path": null,
               "id": 67582,
               "order": 12
            },
            {
               "cast_id": 22,
               "character": "Boy #1",
               "gender": 2,
               "credit_id": "59a96b0592514157f602db85",
               "name": "Gary Marsh",
               "profile_path": null,
               "id": 1880445,
               "order": 13
            },
            {
               "cast_id": 23,
               "character": "Boy #2",
               "gender": 2,
               "credit_id": "59a96b2bc3a36874d50158ef",
               "name": "Andrew Stevens",
               "profile_path": "/jaWFCqWahZeUimpEU2GJStm6pKI.jpg",
               "id": 21479,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44609251416c9100e925",
               "name": "Hal Ashby",
               "profile_path": "/5VRhD4ZMsTyoAsMmxkNuTg41Sta.jpg",
               "id": 4964,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44609251416c9100e92b",
               "name": "Robert Towne",
               "profile_path": "/hF5R8kmpreIZsv47mIYzDN5XX2Q.jpg",
               "id": 11057,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44609251416c9100e931",
               "name": "Warren Beatty",
               "profile_path": "/1fsYRe1WhIohbfk8qHmjMcuCXeJ.jpg",
               "id": 6449,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "57316108c3a3682171001ad9",
               "name": "Warren Beatty",
               "profile_path": "/1fsYRe1WhIohbfk8qHmjMcuCXeJ.jpg",
               "id": 6449,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "58d453c39251411fdc01bd04",
               "name": "Paul Simon",
               "profile_path": "/tsExCQX0EcVfwIyx1SytyNcfnnO.jpg",
               "id": 10557,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "58d453d49251411f8901b43a",
               "name": "Robert C. Jones",
               "profile_path": null,
               "id": 21012,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "58d45407c3a36812670187a5",
               "name": "László Kovács",
               "profile_path": "/qvsRxyAPJw9Kv8ubV2AKWLiUcz8.jpg",
               "id": 8862,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 3.185829,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 31121,
      "vote_count": 56,
      "budget": 0,
      "overview": "George Roundy is a Beverly Hills hairstylist whose uncontrolled libido stands between him and his ambitions. He wants the security of a relationship. He wants to be a hairdressing \"star\" and open his own salon. But the fact that he beds down with the wife, daughter and mistress of a potential backer doesn't help. It also does little for his relationship with his current girlfriend.",
      "similar": [
         96,
         941,
         171274,
         90,
         9654,
         306,
         10061,
         586,
         376866,
         347123,
         7873,
         11973,
         9440,
         9895,
         10187,
         10858,
         9776,
         294562,
         216541,
         13703
      ],
      "original_title": "Shampoo",
      "runtime": 109,
      "poster_path": "/6jmFvXPV6OhtX3AkAVnH7rwdeUJ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
         "name": "Columbia Pictures",
         "id": 5,
         "origin_country": "US"
      }],
      "release_date": "1975-03-13",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Hal Ashby"],
      "runtime": 109,
      "synopsis": null,
      "writers": [
         "Robert Towne",
         "Warren Beatty"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0073692/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY1MzY0MTk3OF5BMl5BanBnXkFtZTcwNzU5MDEzMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Warren Beatty, Julie Christie, Goldie Hawn | See full cast and crew »"],
      "reviews": [
         "Beatty says he approached Towne to do a modern version of the classic restoration comedy called The Country Wife (hilarious by the way). In the original play, the hero beds all the wives by confessing to their husbands that he's impotent so the husbands make fun of him and think nothing of leaving their frustrated and underappreciated wives in his care. Here in the updated \"Shampoo\", Beatty and Towne make the hero an assumed-to-be-gay hairdresser (instead of impotent)and the results are inspired bedroom farce mixed with social satire. Younger viewers may find the film a little dated but it was a \"period\" film when it was made (set in 68 when it was shot in 74) so Ashby consciously gave it that dated look. For me this and Heaven Can Wait are Beatty's best work. Walks a fine comic/tragic line. And this really feels like the closest character to Beatty's heart. It was after this that I went back and saw Splendor in the Grass and began to appreciate Beatty as an actor rather than just a gigolo celebrity. Great dialogue by Towne, Jack Warden's hilarious and Julie Christie is stunning.",
         "Robert Towne's \"Chinatown\" is considered the greatest script of the past 30 years, but I think \"Shampoo\" (written by Towne and Beatty) is even better. It is an intricately constructed sex farce, with realistic, flesh-and-blood characters. Beatty's character, George, is trying to serve two masters -- his own uncontrollable libido, and his desire to set up his own hair salon. These two desires come into direct conflict when he seeks funding from wealthy financier Lester (Jack Warden), while also having affairs with Lester's wife Felicia (Lee Grant), Lester's mistress Jackie(Julie Christie), and even Lester's daugther (Carrie Fisher). In fact, George beds all of these women in a 24-hour period, while also trying to maintain his relationship with his steady girlfriend (Goldie Hawn). All of these incompatible desires are compressed into a short time frame, and George's life unravels spectacularly, as he learns some very hard lessons by the end. Structurally, \"Shampoo\" is brilliantly devised. Each character has an opposite. George, the satyr, has Lester, the cuckhold, as his opposite. George exudes natural sexual appeal, whereas Lester is loved merely for his wealth. Tony Bill's character, an ad executive, is the younger version of Lester. Tony Bill dangles a job offer to Goldie Hawn in order to bed her. Despite his hip outward appearance, this character is as staid as Lester. In fact, the two characters are linked by separate scenes in which each one stares out of a skyscraper window, gazing at a panoramic view of L.A., and makes a world-weary comment about the craziness below (in Bill's case, he says, \"Jesus, this town\"). There is also a contrast between George and Jackie. George, in his own words, \"doesn't f*** for money, I do it for fun,\" whereas Jackie ends up as a kept girl (by Lester). Goldie Hawn's character also prostitutes herself, in a very subtle way. In the moral universe of Beverly Hills in 1968, Beatty's promiscuity seems more pure than the money-driven machinations of everyone else.",
         "Hal Ashby always leavened his comedic films (Harold and Maude, Being There, Last Detail) with sharp social commentary and observation, and \"Shampoo\" is no different. Taking place on the eve and day of the 1968 Presidential Election, it's as concerned with the \"free love\" hedonism as it is with the profound and dark social changes that had taken place by 1975 (the year \"Shampoo\" was produced). Beatty has never been more charming - or revealing as emptily vain as anyone so \"successful\" with women can become, and the film switches between surprisingly adult material even for now with a concern for mid-life crises, cultural politics, and ultimately, a cynical view of how the free-wheeling 60s counterculture didn't take themselves seriously enough. Robert Towne's influence in the script is clearly evident. Already \"dated\" when it came out, it's a great snapshot of the times, its concerns and issues, and is relevant today.",
         "Dated? Unfunny? Only to those weaned on formula action comedies of the past fifteen years. I can still remember the gasp in the suburban twin theater when Carrie Fisher made her indelible suggestion to Beatty, and the roar of delight as viewers saw what Julie Christie was up to at that dinner party. Towne's script, and the acting, makes us care about George, Jackie, Felicia and even Lester, to a degree, and it makes the excellent point that is still true today: money trumps all. Its logical ending, where nothing happens but life goes on, without a wild chase on motorcycle to the airport in pursuit of Jackie and Lester, is perfect. Did anyone really expect George to win the fair hand of the gorgeous Ms. Christie when he cannot even talk to a banker. As I write more and more highlights come to mind: George giving Lester his lecture on women while Lester's goons wait outside. George fobbing off Felicia in the dark as he hustles to see Jill, the \"terminally ill\" friend. When Kubrick died, print and the net was drowned in tributes, but poor Ashby, a great filmmaker practically left the earth in silence. Ashby lost himself once the 70s ended, and films had to have tacked on happy endings again [e.g. The Natural], but then in my mind the same could be said of Kubrick.",
         "A day in the life of a Southern California hairstylist (Beatty) as he beds three women (Christie, Hawn and Lee Grant) while at the same time trying to seek a loan from businessman Lester (Oscar nominee Jack Warden) to help him open his own salon\u0085 His world soon starts to fall apart as he realizes what he fervently wishes in life and the limitations of his cheerful posture toward others\u0085 Lee Grant won an Oscar for playing Lester's bored wife who can't seem to take her eyes off Beatty, and even her nymphet daughter (a young Carrie Fisher) desperately wanted him to be engaging in reciprocal sex\u0085 Grant's actually quite jovial and adorable in her role as we heartily feel for her character near the climax\u0085 Warren Beatty appears either excitable or distracted through most of the story\u0085 He lies, hides, and denies facts, doing whatever it takes to make everyone happy... If you like to see Julie Christie notoriously fellating Beatty underneath an elegant dinner table\u0085 well don't miss this funny sex comedy which received four Oscar nominations\u0085",
         "In a recent interview in Cineaste magazine, celeb film critic Pauline Kael described the 1970's as the greatest decade of American movies. She then laid claim by listing her seven favorite films from that period. One of the films mentioned was Shampoo. I couldn't agree more with Pauline. Aside from the lighting and some of the camerawork, everything in the film is about as good as it gets---Robert Towne's ear for common parlance, Beatty's understated charisma, and Ashby's whirlwind direction. It's strange that more people haven't written about this movie. In many ways, Shampoo seems to have been forgotten, floating somewhere in film history heaven. I live in Los Angeles and have never heard about it being screened anywhere. Dave Kehr and the critical establishment in general have all written it off as a film that hasn't aged well. And I've never seen a book written about either Shampoo or Ashby. Am I living in a vault or is this really the legacy of Shampoo? If you don't like this movie, I urge you to write or contact me. My e-mail address is listed above. I simply don't understand why more people don't",
         "**SPOILERS** Publicists billed \"Shampoo\" as a comedy, and critics called it a satire; actually, it's a romantic tragedy: a film about decisions we'd rather not have to make. The hero's tragic flaw is that he can't make up his mind, and the heroine's is that she can. Hal Ashby set his film on election day, 1968, when America had to make a decision amidst the epistemological turmoil of the times and chose Richard Nixon (an act that could be read as the beginning of the end of the Sixties, and at the least makes a good metaphor for it). George is a Beverly Hills hair dresser whom women love for more than his skill with a blow-dryer. Warren Beatty conveys the character perfectly: sleeping with virtually every woman who crosses his path, he never seems lecherous, chauvinist or even condescending. He simply loves women, and he can't bear to disappoint them (or let one get away). His life consists largely of trying to avoid the need ever to say, \"No.\" Of course, this does produce comic moments. When Jill (Goldie Hawn) stumbles upon George making love to her best friend in the boat house at a party, he looks up and without missing a beat says, \"Honey, where have you been? We've been looking all over for you.\" A bit later, though, in a rambling, revealing speech, he's at a loss to explain himself in the terms Jill expects. What can it mean that he sleeps with so many women? \"I see a beautiful girl... and it makes me feel like I'm gonna live forever... Maybe that means I don't love 'em. Maybe it means I don't love you, I don't know. Nobody's gonna tell me I don't like 'em very much.\" Eventually, George makes a commitment --- probably his first --- when he asks Jackie (Julie Christie) to marry him. He and Jackie have known each other a long time; they were once lovers. Now he's finally come to the realization that even among the things one loves, some are more important than others. \"I don't trust anyone but you,\" he says. They embrace, and the bond between them is heartbreaking. But Jackie has told Lester (Jack Warden) she will go away with him; he's left his wife and proposed marriage. She runs from George because, if she walked, she might not get far enough before her resolve gave way. In the closing scene of Shampoo, George stands alone. Silhouetted on a Los Angeles hillside, he stands like an icon of the things we leave behind when life offers us no other choice but to grow up. The background music is a wordless version of the theme Paul Simon later recorded as \"Silent Eyes\" --- which cuts to The Beach Boys' \"Wouldn't It Be Nice\" when the credits roll.",
         "This is one of those films that all takes place in one 24-hour period. When such movies work, the changes in the characters' lives feel more real and intense. So it is in \"Shampoo\", as we watch George's world slowly crumble. Rarely has a movie-star's real life persona been used to better effect. Warren Beatty gives a moving performance as a guy who sincerely does not intend to hurt anyone, but he becomes a victim of his own allure. He is supported by fantastic ensemble acting. Written by Beatty and Robert Towne (Chinatown), and directed by Hal Ashby (Harold and Maude, Being There), \"Shampoo\" is Hollywood moviemaking at its best, and it deserves to be ranked with its more well-known contemporaries, like \"M*A*S*H\", \"Annie Hall\", and \"The Sting\". Its theme of the emptiness of unchecked promiscuity is still relevant in a culture where sex is more of a commodity than ever.",
         "'Shampoo' is quite an interesting period black comedy set in the late 60s during the sex revolution. In one sentence, it's about a Casanova hairdresser who sleeps around with every woman he meets but there is one whom he loves and she happens to be the mistress of a not-to-mess-with businessman. Ashby does a splendid job in bringing out the 60's look but it is Towne and Beatty who bring the feel especially through the dialogues and use of language. Not to mention, the make-up department that does an equally fine job. The humour is somewhat different from other films and traditional viewers may find the jokes somewhat vulgar but that doesn't bother me as long as they manage to draw chuckles and at least make me smile. The actors, that include a vivacious supercute Goldie Hawn, a sizzling Julie Christie, a hilarious Jack Warden, a fiery Lee Grant and a very young Carrie Fisher. But, it is Warren Beaty's film. He demonstrates George's wildness, passion, vulnerability and despair with effective skill. In my humble opinion it is one of his best works, both as actor and writer. I don't understand why people call it outdated. It is set in an older time and if the humour still works, why is it obsolete? I got the movie randomly and now I'm glad that I picked this one.",
         "An almost perfect balance showing at once the beauty and shallowness of Los Angeles and those who live there. The film is famous for being about Lothario, but the film is really about a cultural malaise that is Los Angeles. The movie industry has infected everyone in Los Angeles and as a result, you can't get your car repaired without hearing some namedropping (especially today, but even back in 1968) and velvet rope sightings. Some people seem content to try and write off this film as a Hollywood porn film, but it's much more than that. Porn is cheap and often mechanical. Shampoo is full of rich characters and the story, as it should, has the tangles of wet hair. How often has you seen a film where you look forward to each scene? To know what the characters will do next? Shampoo at its center, has Beatty, playing both a fictional character, and to some I'm sure, a bit of the ladies man he was in the public eye for years and years. (Actually, the character is based on a real hairdresser who had a sad ending, being murdered in the terrible Manson murders along with Sharon Tate.) The film not only entertains, but deepens with time. (Anyone, whether here or on other sites, tries to compare movies made years ago with movies today, is either naive or terribly arrogant. Would you hold Wuthering Heights next to Saw? Would you compare Nat King Cole to Marilyn Manson? All were or are popular, so what's the difference? Plenty, I doubt most Blacks would like to go back in time and compare the civil rights laws, if even existed, to today's laws.) Besides Beatty, there are many other fine performances, from Lee Grant, Julie Christie, Goldie Hawn, Tony Bill, Carrie Fisher, Jack Warden among others. Restored on DVD, it's a very good watching experience now as well."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Persky-Bright / Vista",
         "Columbia Pictures Corporation",
         "Rubeeker Films"
      ],
      "summaries": [
         "Thirty-something George Roundy is a Beverly Hills hairdresser, who spends as much time sleeping with his female clients as he does doing their hair. Whether they want to admit it, all the women in his life are on the most part aware that they are are not the only one with whom he is sleeping. And some, such as the wealthy and married Felicia Karpf, have a stronger emotional dependence on George than they would like to admit. George's current girlfriend is Jill, an up and coming actress. Jill's best friend is Jackie Shawn, one of George's old girlfriends who left him because he couldn't make a true commitment to her. In turn, Jackie is currently having an affair with Lester Karpf, Felicia's wealthy businessman husband. George is unhappy working at a salon owned by Norman, with whom he is constantly butting heads. In his first act of wanting finally to be a grown up, George wants to open his own salon, but doesn't have the financial resources to do it, and no bank will lend him money for the venture. Felicia at least convinces Lester to consider investing in George. On Monday, November 4, 1968, the eve of the presidential election, this group spends the evening together, first at a dinner party hosted by Lester, and then another private party. Lester asks his potential new business partner, George, to accompany his mistress Jackie, not knowing that George and Jackie know each other. Jill, who is invited to the party by Jackie, invites director Johnny Pope as her date, he who is considering her for a role in his next movie filming in Egypt and perhaps more. Over the course of the evening, George may come to the realization of what he wants in life both professionally and personally, but achieving happiness will depend upon others in his life, they who have known George up to this time only as an uncommitted narcissist.",
         "George Roundy, is a Beverly Hills hairstylist who's uncontrolled libido stands between him and his ambitions. He wants the security of a relationship. He wants to be a hairdressing \"star\" and open his own salon. But the fact that he beds down with the wife, daughter and mistress of a potential backer doesn't help. It also does little for his relationship with his current girlfriend. As this tongue-in-cheek look at the sexual revolution rolls on, the babe juggling, stress and lies all wear George down. He wants so much. But a hungry kid loose in a candy store easily gets sick.",
         "Lovers undo a hairdresser from Beverly Hills around Election Eve in 1968."
      ],
      "budget": 0
   },
   "movielensId": 3099,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1975-03-13",
      "dvdReleaseDate": "2003-01-21",
      "directors": ["Hal Ashby"],
      "runtime": 109,
      "movieId": 3099,
      "title": "Shampoo",
      "mpaa": "R",
      "actors": [
         "Warren Beatty",
         "Julie Christie",
         "Goldie Hawn",
         "Lee Grant",
         "Jack Warden",
         "Tony Bill",
         "George Furth",
         "Jay Robinson",
         "Ann Weldon",
         "Luana Anders",
         "Randy Scheer",
         "Carrie Fisher",
         "Susanna Moore",
         "Gary Marsh",
         "Andrew Stevens"
      ],
      "imdbMovieId": "0073692",
      "originalTitle": "Shampoo",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["rJllau4-qd0"],
      "plotSummary": "George Roundy is a Beverly Hills hairstylist whose uncontrolled libido stands between him and his ambitions. He wants the security of a relationship. He wants to be a hairdressing \"star\" and open his own salon. But the fact that he beds down with the wife, daughter and mistress of a potential backer doesn't help. It also does little for his relationship with his current girlfriend.",
      "tmdbMovieId": 31121,
      "avgRating": 3.23489,
      "releaseYear": "1975",
      "numRatings": 1439,
      "posterPath": "/6jmFvXPV6OhtX3AkAVnH7rwdeUJ.jpg"
   }
}