{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "crooked lawyer",
            "id": 7340
         },
         {
            "name": "bail jumper",
            "id": 168333
         },
         {
            "name": "mafia accountant",
            "id": 168338
         },
         {
            "name": "stretch limousine",
            "id": 168342
         },
         {
            "name": "manhattan, new york city",
            "id": 168346
         },
         {
            "name": "southwestern u.s.",
            "id": 168347
         },
         {
            "name": "bus station",
            "id": 168350
         },
         {
            "name": "police surveillance",
            "id": 168359
         }
      ],
      "imdb_id": "tt0095631",
      "video": false,
      "title": "Midnight Run",
      "recommendations": [
         10859,
         9080,
         10141,
         10890,
         11896,
         9749,
         26748,
         8012,
         2142,
         18129,
         635,
         1552,
         4105,
         983,
         10223,
         2322,
         9434,
         11718,
         12560,
         150
      ],
      "backdrop_path": "/t2qRUwdbqacM0SmHGJxkgneyzR7.jpg",
      "revenue": 38413606,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jack Walsh",
               "gender": 2,
               "credit_id": "52fe44d1c3a36847f80abcdf",
               "name": "Robert De Niro",
               "profile_path": "/lvTSwUcvJRLAJ2FB5qFaukel516.jpg",
               "id": 380,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Jonathan Mardukas",
               "gender": 2,
               "credit_id": "52fe44d1c3a36847f80abce3",
               "name": "Charles Grodin",
               "profile_path": "/8lHT8QePWTpSfw0DQJ5k8YUuZt1.jpg",
               "id": 28164,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "FBI Agent Alonzo Mosely",
               "gender": 0,
               "credit_id": "52fe44d1c3a36847f80abced",
               "name": "Yaphet Kotto",
               "profile_path": "/qsaWzjzI41EXMldEn6sSp5fnsQ0.jpg",
               "id": 5050,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Marvin Dorfler",
               "gender": 2,
               "credit_id": "52fe44d1c3a36847f80abcf1",
               "name": "John Ashton",
               "profile_path": "/omfIdOt1F8LDkb7AMZTtLDiyJ3O.jpg",
               "id": 778,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Jimmy Serrano",
               "gender": 2,
               "credit_id": "52fe44d1c3a36847f80abd13",
               "name": "Dennis Farina",
               "profile_path": "/o649nAtUimSZxEV6xa5JbMSgsED.jpg",
               "id": 1117,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Eddie Moscone",
               "gender": 2,
               "credit_id": "52fe44d1c3a36847f80abd17",
               "name": "Joe Pantoliano",
               "profile_path": "/zBvDX2HWepvW9im6ikgoyOL2Xj0.jpg",
               "id": 532,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Tony Darvo",
               "gender": 2,
               "credit_id": "52fe44d1c3a36847f80abd1b",
               "name": "Richard Foronjy",
               "profile_path": "/rz8GA26g2uISlcjfVOnSFby6fMw.jpg",
               "id": 47771,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Sidney",
               "gender": 2,
               "credit_id": "54ed4840925141796e003066",
               "name": "Philip Baker Hall",
               "profile_path": "/eH7GrivSuLEvhJL85qPkhNvg3E7.jpg",
               "id": 4492,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44d1c3a36847f80abce9",
               "name": "Martin Brest",
               "profile_path": "/uBdfVZ2YBpnMj24UEviiNxbQgrt.jpg",
               "id": 769,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44d1c3a36847f80abcf7",
               "name": "George Gallo",
               "profile_path": "/29MCvgcfn5jm2ExpS3BXSFxadrJ.jpg",
               "id": 21792,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44d1c3a36847f80abcfd",
               "name": "Martin Brest",
               "profile_path": "/uBdfVZ2YBpnMj24UEviiNxbQgrt.jpg",
               "id": 769,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44d1c3a36847f80abd03",
               "name": "Danny Elfman",
               "profile_path": "/pWacZpYPos8io22nEiim7d3wp2j.jpg",
               "id": 531,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44d1c3a36847f80abd09",
               "name": "Chris Lebenzon",
               "profile_path": "/eA6NqE5wdIM0LT3g1ihanv5vUM7.jpg",
               "id": 541,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44d1c3a36847f80abd0f",
               "name": "Donald E. Thorin",
               "profile_path": null,
               "id": 6490,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "56446b7ec3a36870d60053fa",
               "name": "Michael Tronick",
               "profile_path": null,
               "id": 908,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "56446ba9c3a36870ec004f93",
               "name": "Billy Weber",
               "profile_path": null,
               "id": 909,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "56446bbdc3a36870e30057d9",
               "name": "Michael Chinich",
               "profile_path": null,
               "id": 7185,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "56446bd09251410a3f0051c2",
               "name": "Bonnie Timmermann",
               "profile_path": "/jM8QANtq0v7Eqy8ZYtKot27nsfK.jpg",
               "id": 897,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "56446be39251410a410052c8",
               "name": "Angelo P. Graham",
               "profile_path": null,
               "id": 794,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "56446bf69251410a3f0051cd",
               "name": "James J. Murakami",
               "profile_path": null,
               "id": 795,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "56446c08c3a36870e8005224",
               "name": "George R. Nelson",
               "profile_path": null,
               "id": 8339,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "56446c1ec3a36870ec004f9f",
               "name": "Gloria Gresham",
               "profile_path": null,
               "id": 9255,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "56446c4dc3a36870dd005699",
               "name": "Clarence Lynn Price",
               "profile_path": null,
               "id": 1534846,
               "department": "Art",
               "job": "Construction Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "56446c789251410a49005195",
               "name": "Roy Arbogast",
               "profile_path": null,
               "id": 13410,
               "department": "Visual Effects",
               "job": "Special Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "56446c9bc3a36870ec004fb7",
               "name": "David Gonzales",
               "profile_path": null,
               "id": 1473722,
               "department": "Production",
               "job": "Casting Associate"
            },
            {
               "gender": 0,
               "credit_id": "56446cd0c3a36870dd0056bc",
               "name": "G. Tony Scarano",
               "profile_path": null,
               "id": 75250,
               "department": "Costume & Make-Up",
               "job": "Costume Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "56446cef9251410a4c005227",
               "name": "Wilma Garscadden-Gahret",
               "profile_path": null,
               "id": 1377239,
               "department": "Directing",
               "job": "Script Supervisor"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 7.556773,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9013,
      "vote_count": 300,
      "budget": 30000000,
      "overview": "An accountant embezzles $15 million of mob money, jumps bail and is chased by bounty hunters, the FBI, and the Mafia.",
      "similar": [1813],
      "original_title": "Midnight Run",
      "runtime": 126,
      "poster_path": "/pVUfLM9z2H2rxB4Til8YvjUjnp.jpg",
      "spoken_languages": [
         {
            "name": "Český",
            "iso_639_1": "cs"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "City Light Films",
            "id": 136,
            "origin_country": ""
         },
         {
            "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
            "name": "Universal Pictures",
            "id": 33,
            "origin_country": "US"
         }
      ],
      "release_date": "1988-07-20",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "This could be the beginning of a beautiful friendship.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Martin Brest"],
      "runtime": 126,
      "synopsis": "Jonathan \"The Duke\" Mardukas (Grodin) is an accountant who embezzled $15 million from Las Vegas gangster Jimmy Serrano (Dennis Farina) and skipped bail. He is hiding in New York when his Los Angeles bail bondsman, Eddie Moscone (Joe Pantoliano), hires bounty hunter Jack Walsh (De Niro) to bring the accountant in. To get the $100,000 bounty, Jack needs to get \"The Duke\" back to L.A. before midnight on Friday, or Eddie forfeits the $450,000 bail and faces bankruptcy. The FBI, led by Special Agent Alonzo Mosely (Yaphet Kotto), wants Mardukas under arrest to build their case against Serrano. Alonzo warns Jack not to interfere with his plans, but Jack, under the pretense of accepting, pays no attention, and instead pinches Mosely's identification. Serrano, meanwhile, suspects that Mardukas has access to financial information that could lead to his conviction. Additionally, that information would implicate Serrano and his ties to other mobsters, which could jeopardize his life if exposed. As a result, Serrano intends to have Mardukas killed before he can testify against him in open court. After apprehending Mardukas in Manhattan, Jack is unable to take him to L.A. by plane due to Mardukas' professed fear of flying, which gets them thrown off their transcontinental flight. The pair embark on a wild cross-country chase (with Mardukas even temporarily piloting a plane, proving that his fear of flying was a ruse), relying on various unreliable modes of transportation, all the while dodging the FBI and Serrano's henchmen Tony (Richard Foronjy) and Joey (Robert Miranda). Moscone also hires rival bounty hunter Marvin Dorfler (John Ashton) as insurance in case Jack is unable to deliver Mardukas, but offers him $25,000, claiming he offered the same to Walsh. Throughout their journey, Walsh and The Duke bicker constantly, due to the clash of Walsh's rough-hewn personality and Mardukas' habit of nagging. Much of the movie involves Mardukas' sincere effort to uncover the truth about his captor, a person he suspects is actually a decent man beneath his cynical and embittered exterior. He eventually learns that Jack was a former Chicago undercover detective who refused to go on the take of a heroin dealer he was building a case against. He was then drummed out of the force after being framed for heroin possession by corrupt colleagues and driven out of Chicago, his marriage ended and he became estranged from his family. His ex-wife ended up remarrying one of his colleagues, now a captain, whom Jack insinuates was one of the corrupt members of the force. Jack has not seen his daughter since she was a little girl, and has since then lost all faith in the law, explaining his profession as a bounty hunter. As the plot unfolds, it turns out that the heroin dealer responsible for Jack's framing was Jimmy Serrano himself. Jack, for his part, wants to see the job done so he can retire and open a coffee shop with his promised $100,000 bounty, aware that in doing so, he will most likely be helping Serrano avoid prison. He also has a keen sense of propriety and refuses a bribe from Mardukas, as well as a large cash offering from Serrano's camp in exchange for turning Mardukas over to them. After making it as far as Arizona, the two are chased by dozens of police cars. They narrowly dodge the police, but Mardukas is captured by Dorfler. Finally figuring out that Moscone cheated him and how much The Duke is actually worth, Dorfler decides to give him up to Tony and Joey for $1 million. However, Dorfler inadvertently reveals where he is keeping the fugitive, and is knocked unconscious. Mardukas is captured by Serrano's men, and Dorfler, defeated, decides to go home. Walsh, meanwhile, is finally found by Mosely and his men, and taken into custody. An enraged Walsh calls Moscone and furiously berates him for hiring Dorfler as insurance. Moscone, however, reveals that Dorfler is not delivering The Duke to him, and Walsh realizes that Dorfler has delivered Mardukas to Serrano. Walsh calls Serrano's men and tells them that Mardukas gave him computer disks with enough information to put Serrano away (earlier, Mardukas had informed Walsh that he intended to backup files on to disks but never did). Walsh threatens to turn the disks over to the FBI unless Serrano himself returns The Duke to him at McCarran International Airport in Las Vegas. Walsh tells Mosely and the FBI of his plan to deliver Serrano to them (even though the disks to be used in the sting are blank, Serrano's taking possession of them would be enough to indict him for conspiring to destroy government evidence and obstruction of justice), but will only carry it out if he is allowed to return Mardukas to Moscone personally and collect his money. Mosely, since his primary target is Serrano, accepts Walsh's proposal. At the airport, Serrano and Walsh confront each other for the first time since Jack left Chicago. The exchange is interrupted by Dorfler, who sees the exchange going on, not knowing that the FBI are watching and waiting for Serrano to take possession of the disks. Jack, whose microphone wire gets knocked out by Dorfler, yells to the FBI that Serrano has the disks. The FBI move in, arresting Serrano, his men, and Dorfler. As bargained with Mosely, Jack takes the Duke back to Los Angeles. He calls Eddie Moscone and tells him he has Mardukas in L.A. before the deadline - but he is letting him go. Before Jack can leave, they exchange gifts - Jack hands The Duke his broken watch, and Mardukas hands Jack a money belt he had hidden on his person throughout the film, filled with $300,000 in $1,000 bills: he was planning on leaving before Jack showed up, so he didn't have time to use the money. The two part as friends. Mardukas then disappears, and Jack tries to get a cab. However, since the driver doesn't have change for a thousand dollar bill, he zips up his leather jacket and pulls up his collar, preparing to walk home.",
      "writers": ["George Gallo"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0095631/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg0MTg2NTgyM15BMl5BanBnXkFtZTcwMzI3ODMyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Robert De Niro, Charles Grodin, Yaphet Kotto | See full cast and crew »"],
      "reviews": [
         "They don't come any better than Midnight Run. It has everything except a few Academy Awards and that's a mystery in itself. Dialogue, action, comic timing, stunts and all around fabulous acting ability from everyone involved. If you haven't seen this film yet, dig up a copy from somewhere, get a few beers and prepare to be captivated from beginning to end. To think that only 10,000 or so have voted for this film on IMDb and it's not even in the top 250 is a complete travesty. I know, there are other films just as worthy that are not in the top 250 but this is the one that get's me riled up. There are no weak moments or poor scenes in the whole film and the ending is pure joy. Someone please explain why this didn't clean up when it was released because I can't see anything else that came out in '88 that comes close to Midnight Run.",
         "One of the smartest, funniest, and exciting buddy pictures ever made. It has never received the wonderful attention it justly deserves. The performances by the two leads (De Niro and Grodin) are wonderful and they get outstanding support from Joe Pantolino, Dennis Farina, and Yaphet Kotto. But what separates this picture from all the other action / comedies ever made is that the screenplay is so sharp and original. Easily my all time favorite movie - you know how I know that? I must have seen \"Midnight Run\" at least thirty times and every time I see it, it gets better and better. A true film classic and is getting rereleased on DVD in June of 2003.",
         "DeNiro is (Jack Walsh) a self-righteous ex-cop so unpopular with the Chicago police department, now wanting to make one final 'midnight run' that'll pay big so he can buy a nice coffee shop\u0085 He is hired by an hysterical bondsman to find and bring back a former Mob accountant called Jonathan \"The Duke\" Mardukas (Grodin) who has stolen $15 million from the Los Angeles mob, given the money to the 'unfortunates of the earth.' DeNiro quickly captures the 'white-collar criminal' in New York, and is given five days to bring him to Los Angleles, to collect his $100,000 fee... Unfortunately for DeNiro, the fugitive accountant is too neurotic to fly the distance... The embezzler's ex-boss wants him badly for knowing all his financial transactions, and agent Yaphet Kotto warns Walsh not to interfere with the FBI's plans to bring the 'Duke' into federal court\u0085 And if this isn't enough, there is some third-rate bounty hunter (John Ashton) who is intrigued about DeNiro's special deal\u0085 In an extended cross-country chase, the two men's personalities and relationship develop\u0085 DeNiro shows how to catch talents of improvisation... His cheeky schoolboy look certainly supplies some of the film's lighter moments... He delivers some of the best punchlines, when he replies: 'Well if you don't cooperate, you're gonna suffer from fistophobia.' Charles Grodin is perfect as the prisoner who gets some of Serrano's records on computer disks, figuring if things got too rough, he could always trade them for his life\u0085 He continually gets on DeNiro's nerves, and with his soft and ironic tone of voice he advises Walsh that a restaurant is 'a very tricky investment.' He easily dips into Jack Walsh's life ('Don't you want to be loved?'), wandering about his broken marriage ('Did she hurt you, Jack?'), his habits ('Cigarettes are killers. Put the cigarette out.') and whatever he can think of... The best parts of the film are, in fact, the interactions between the two stars\u0085 The story holds up perfectly and entertains the viewer in every way\u0085 Martin Brest does bring out the realistic, funny and moving sides of his likable characters\u0085 Suspense is maintained to the very end\u0085",
         "Here is a movie of my favourite sort regardless of the genre - you feel you would neither add nor substract anything from it. Excellent cast, beautiful script, professional director's work. The main strength of the movie can be found in its unpretentiousness. It primarily aims at providing fun and entertainment, and fulfills it in an efficient way. You have your comedy and action galore. We are usually willing to suspend our disbelief when watching comedies. No such need when it comes to this movie - the plot, the relations between characters, their motives, everything works like a flawless machinery. It is as credible as life itself. The movie is brimming with memorable scenes. I have seen it twice - first when it appeared more than 15 years ago, and then again yesterday. I was delighted to find that the movie had lost nothing of its freshness and endured all time traps. I highly recommend it. 9/10 !",
         "Way too much objectionable language is the only fault of this otherwise extremely-entertaining film that is justifiably popular. Humor is what makes this \"crime film\" stand out as tough guys Robert De Niro, Joe Pantoliano, John Ashton, Dennis Farina and others provide a lot of laughs as not-so-tough guy Charles Grodin is escorted from New York to Los Angeles to face retribution from a mob boss. The dialog between Grodin and his bounty hunter captive De Niro, is terrific all the way through. The soundtrack, featuring the guitar of Ry Cooder, also is outstanding and adds to the fun of this film. The capper to this likable story is the satisfying ending, which almost everyone seems to like.",
         "To hell with the pretentiousness of a Shyamalan or the increasingly misplaced self-adulation of the Coens, 'Midnight Run' has no other purpose in life other than to use the movie as a medium of entertainment. . . and it does. Oh boy; it does. Badly underrated on release and still unfairly under valued even now, 'Midnight Run' is actually class-act film making, the narrative impeccably engineered and the acting uniformly excellent throughout. Faults? Definitely, not the least of 'em being the gratuitous use of profanity: the movie's tone is such that it just doesn't need the endless ear-grating use four letter words -- 'Midnight Run' isn't about reality or anything remotely approaching it, so the insistence on so much gutterspeak is a major error. Set pieces though are gloriously handled, and the helicopter sequence is quite as good as anything in a Bond movie -- a genre that has managed quite well without spraying profanities everywhere because it knows, and we know, none of it's real. 9/10 then for 'Midnight Run', because as an exercise in how to develop a movie, to establish characters and plot trajectories, to bring 'em all together in a final wrap up and still leave space for a minor plot twist, it's of textbook quality. * I happened to see this as a late-night TV re-run, the day after watching the Coen's 'The Man Who Wasn't There'. 'Midnight Run' is everything that the Coen's work is not: it isn't self reverential, it isn't seeking to be a cult, and above all, it knows how to tell a story with speed and with style. RECOMMENDED.",
         "What can one say about their favorite movie? A movie that would make one laugh, in suspense, excited, and even touched. A film that takes two personalities which clash, and learn to get along with each other, to where they actually care for one another in the end. A film that touches one's soul, is a film that one can consider to be their favorite of all time. Robert De Niro plays Jack Walsh, a ex-Chicago police officer who is currently a bounty hunter. He works in Los Angeles for Eddie Moscone (Joe Pantoliano) who is a bail bonds man. Eddie offers Jack a job to catch and bring back the infamous Jonathan \"the Duke\" Markukas (Charles Grodin). Jonathan is a accountant who stole millions of Jimmy Serrano's (Dennis Farina) money, and gave it all to charity. Jonathan jumped bail and is in hiding. Jack needs to find John, bring him to the L.A. county jail within four days, and Jack will collect 100 thousand dollars. Jack does find John, in New York City, the first day. But Jack has many people following him. First there's the FBI, led by Alonzo Mosely (Yaphet Kotto) who wants John to testify against Jimmy Serrano. Second there's Tony Darvo (Richard Foronjy) and Robert Miranda (Joey), two dim-wits working for Serrano, who want John dead. Then there is Marvin Dofler (John Ashton), another bounty hunter who wants John also, but for a smaller price. From there on, it's a cross country trip which involve all of the men looking for Jack and John. A film which has some very exciting moments with action. Other moments where the scenes are intense where Jack and John's lives are in danger. And scenes where the two men share each other's thoughts and feelings, which surprisingly makes the movie touching. The acting by De Niro is at his best. He does his usual tough guy attitude, but he also mixes it with some humor, and emotions. Charles Grodin is also great as the sensitive accountant who is the exact opposite of Jack's personality. And Dennis Farina is funny and scary as the outraged mob boss who has a vicious attitude. The music by Danny Elfman, I find to be his career best. It's not like his famous BATMAN, BETTLEJUICE, or SLEEPY HOLLOW style of score. It's more like a mixture classic Chicago rhythm and blues, which even Elfman himself considered to be his most unusual score. The writing by George Gallo is also excellent. He manages to fit a cross country story within two hours of time, while still bringing out personalities of the characters and making sure there are no holes in the plot. He also manages to have some very funny scenes involving Jack and John. And the direction by Martin Brest is outstanding. He keeps the movie at a very fast pace, without any slowing down. He does brilliant moves like having De Niro and Grodin improvising their lines while arguing. Brest also does a great job by making the film enjoyable for it's 125 minutes. This is a movie that touched me, it can be considered a \"man's\" movie on the surface. But take apart this film, and it's also a film that women can enjoy also. The most emotional scenes involve Jack seeing his ex-wife and daughter after not seeing them for ten years. It shows that everybody makes a mistake in life, and that we can all try to forgive people that emotionally hurt us. People say that one can identify a person's personality by the movies and music that they like. To find out what I am like, pop in this movie into your DVD player or VCR, and you'll see. Saying this movie is better than CITIZEN KANE, STAR WARS, GODFATHER, and GONE WITH THE WIND is a pretty bold statement. But, the character of Jack Walsh shows my personality. This is the way I am, therefore it's my favorite movie of all time. And I'm not the only one, Robert De Niro said on a interview on Oprah Winfrey, that this is his most enjoyable film that he's done. ***** (out of five; THE BEST MOVIE OF ALL TIME)",
         "Pleasantly surprised by this one. I had heard people refer to this one, but hadn't seen it for myself until recently. One of the better buddy-action movies I've seen, due to a very tight script. Superior writing by George Gallo. The story is what drives this movie from beginning to end, and doesn't need to depend solely on the cast to keep the audience interested for the full 2 hours. DeNiro and Grodin are excellent together, with a great supporting cast. I would keep this movie in my personal collection. I would also consider it a fine example for other buddy action movies to follow, even today. Highly recommended for great comedic writing, directing and acting.",
         "Jack Walsh is an ex-cop turned bounty hunter working for bail-bondsman Eddie Moscone. Looking for another job to bring in, Jack is presented with an ex-mob accountant, Jonathon Mardukas, who has ripped off the mafia for millions of dollars and has gone on the run. Using the very basic tricks of his trade, Jack easily finds and catches his man and prepares to transport him back to Moscone and collect his pay. However, with the FBI, the mafia and other bounty hunters all looking to bring in Jonathon for differing reasons, Jack has a hard road ahead of him \u0096 and that's before he discovers Jonathon's phobias about planes. In terms of cinema, I remember the 80's for one main genre \u0096 the buddy movie; the genre continues today but that is my overriding memory of the films I saw during this time and since then from the period. Hardly a dynamic hotbed or imagination and innovation, the genre did throw up many films that are quite enjoyable if you meet them on their own terms and it did occasionally produce some that are very enjoyable and still stand up years later \u0096 for a combination of reasons, Midnight Run is one of these and, for my money is a great street smart comedy. Of course it is still a genre film but the plot is well written combining a reasonably engaging story with a fun series of set pieces. While it is not laugh our loud funny apart from maybe once or twice what it does manage is to have a comic tone to it and a great sense of fun and energy throughout. It is hard to describe but it is one of those films that just feels comfortable and fun to watch. A major part of this is the fantastic playing of the actors \u0096 the cast and their chemistry go a long way to making this a better film that it may have been in other, less able, hands. De Niro plays his well-practiced tough guy but allows himself to be the butt of humour if not out and out jokes. What he (and the writers) did very well was to keep the audience on his side even though he was basically transporting Jonathon to his death! He comes off as a likable guy and De Niro takes what many other actors have made into a clichéd part and really made it his own. His easy chemistry with Grodin also helps a lot and the two really so work together thanks to a good comic performance from him. Of course in a more serious film, Jonathon as he was would be very unrealistic but Grodin's delivery suits the material and tone of the film perfectly. The support cast are all given minor roles to share out and they all contribute in their own little way. Kotto gives plenty of laughs with a minor character. Ashton has less time and a less likable character but still does OK; Farina could not look more 'mob' if he tried; Pantoliano swears a lot and is amusing while minor roles for the like of Walters and Hall add to the cast in cameos. While the film has a deep cast, it really belongs to De Niro and Grodin, both of whom really deliver and have an easy chemistry between them befitting the genre. If I had a complaint it would be the sheer volume of swear words in the film; the first time I saw it was on ITV (that most notorious of editors \u0096 they cut whole scenes out of Die Hard due to swearing!) and it was cut to shreds with plenty of badly dubbed lines and scenes just removed due to language. Personally I'm not overly bothered by it but it is such a fun film that it seems a shame to make it unsuitable for children by such liberal use of the F word (one or two can be forgiven but every other word pretty much makes it unsuitable), but I suppose it is all part of the tough but fun tone of the film and I enjoy it regardless. Overall this is not one of the greatest films ever nor one of De Niro's best but it is a very, very good genre film and, in my mind, stands out from many other buddy-style movies that have been made in the crime/thriller sort of mould. The plot mixes a good story with many fun set pieces and keeps a solidly enjoyable pace all the way through while a roundly strong cast all make better use of the script than lesser actors could have done. A very enjoyable genre film and one that I will keep coming back to due to its reliable mix of pace, energy, fun and excitement.",
         "This is the most enjoyable movie I have ever seen: hilarious situations, unforgettable lines, car chases, characters you care for, and even a dramatic scene that makes me cry every time. A real American classic: call it a road movie, action comedy, buddy film, whatever---it's a beautiful script, professionally executed. What a country, huh? What a country! My friends and I rented this movie to celebrate a reunion after 12 years, and we were rolling with laughter in five minutes. Don't watch the TV version if it's got the f-words edited out---they are very important to the experience. I can't believe: (a) this movie didn't get an Oscar, (b) it's not well known even in the U.S., and (c) there's no DVD version available any more. I want to buy it! Why don't they want to sell it???"
      ],
      "genres": [
         "Action",
         "Comedy",
         "Crime",
         "Thriller"
      ],
      "productionCompanies": [
         "Universal Pictures",
         "City Light Films"
      ],
      "summaries": [
         "Bounty hunter Jack Walsh is sent to find and return bail jumper and former Mafia accountant, Jonathan \"The Duke\" Mardukas. The FBI have had no success in locating The Duke, so when Jack finds him in next to no time, they are a little embarrassed. In order to collect his $100,000 fee, Jack must take The Duke from New York to Los Angeles. However, the Mafia and the FBI have other ideas, as does Marvin, a rival bounty hunter. On their long cross-country trip to LA, the two get to know each other and they build up a strange friendship.",
         "Jack Walsh is a former cop from Chicago, who was framed by criminal he was investigating and about to arrest. He is now a bounty hunter based in Los Angeles. His boss wants him to find, Jonathan \"The Duke\" Mardukas, an accountant, who was working for Las Vegas mobster, who stole millions of dollars from him and gave it away. His boss was the one who bailed him out, and now unless he can get him back in L.A. in the next 5 days, he will forfeit the bond and be placed out of business. So he sends Jack to get him, which is Midnight Run or easy job in the bail bond business. Except for the fact that the man The Duke stole the money from, wants to get him, and he is also the same man who framed Jack. And also the FBI wants to get Mardukas so that they can use him to get his boss, so they warn Walsh not to get in their way. But Walsh nevertheless finds The Duke and is about bring him back but when Mardukas claims that he has difficulty with flying the airline throws them out of the plane, so they have to go back on the road. When Walsh's boss, learns that he didn't arrive when he was suppose to, he sends another bounty hunter, Marvin, who is Jack's greatest adversary, to get Mardukas. And when Marvin cancels Walsh's card, they don't have enough funds to make it all the way, so they have to scrape everything they have. And it doesn't help that Mardukas is doing everything he can to escape, cause he says that his former boss can get him even in jail.",
         "An accountant is chased by bounty hunters, the FBI, and the Mafia after jumping bail."
      ],
      "budget": 30000000
   },
   "movielensId": 3104,
   "movielens": {
      "languages": [
         "Český",
         "English"
      ],
      "releaseDate": "1988-07-20",
      "dvdReleaseDate": "2003-06-03",
      "directors": ["Martin Brest"],
      "runtime": 126,
      "movieId": 3104,
      "title": "Midnight Run",
      "mpaa": "R",
      "actors": [
         "Robert De Niro",
         "Charles Grodin",
         "Yaphet Kotto",
         "John Ashton",
         "Dennis Farina",
         "Joe Pantoliano",
         "Richard Foronjy",
         "Philip Baker Hall"
      ],
      "imdbMovieId": "0095631",
      "originalTitle": "Midnight Run",
      "genres": [
         "Adventure",
         "Comedy",
         "Crime"
      ],
      "youtubeTrailerIds": [
         "B1_N28DA3gY",
         "IlTrGwowJdc"
      ],
      "plotSummary": "An accountant embezzles $15 million of mob money, jumps bail and is chased by bounty hunters, the FBI, and the Mafia.",
      "tmdbMovieId": 9013,
      "avgRating": 3.79998,
      "releaseYear": "1988",
      "numRatings": 5797,
      "posterPath": "/pVUfLM9z2H2rxB4Til8YvjUjnp.jpg"
   }
}