{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "love",
         "id": 9673
      }],
      "imdb_id": "tt0099291",
      "video": false,
      "title": "Come See the Paradise",
      "recommendations": [
         76286,
         33988,
         115131,
         80047,
         3125,
         76654,
         38750,
         3023,
         53949,
         18262,
         39262,
         83413,
         50767,
         71120,
         24671,
         51878,
         21955,
         26771,
         48885,
         85237
      ],
      "backdrop_path": "/kWCs5v6iawZZ5FDOkRlfWCRc5aQ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jack McGurn",
               "gender": 2,
               "credit_id": "52fe499ac3a36847f81a3037",
               "name": "Dennis Quaid",
               "profile_path": "/fSnnQg8y1LB9yHbn2WuEcUb8i9Y.jpg",
               "id": 6065,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Lily Kawamura/McGann",
               "gender": 1,
               "credit_id": "52fe499ac3a36847f81a303b",
               "name": "Tamlyn Tomita",
               "profile_path": "/iX6zGWXFWLdUnxaVebXGzXXwgft.jpg",
               "id": 3134,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Mr.Kawamura",
               "gender": 0,
               "credit_id": "52fe499ac3a36847f81a303f",
               "name": "Sab Shimono",
               "profile_path": "/jgbTTB8hCfKARta5yGkHrq2DFB.jpg",
               "id": 85500,
               "order": 2
            },
            {
               "cast_id": 15,
               "character": "Frankie Kawamura",
               "gender": 0,
               "credit_id": "5910f156c3a36864ec034d09",
               "name": "Brady Tsurutani",
               "profile_path": null,
               "id": 1813086,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe499ac3a36847f81a3045",
               "name": "Alan Parker",
               "profile_path": "/vABD5OnVL9TcuxLHae6EOTDfWiW.jpg",
               "id": 9168,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "58fb97c2c3a36879f400f5ec",
               "name": "Alan Parker",
               "profile_path": "/vABD5OnVL9TcuxLHae6EOTDfWiW.jpg",
               "id": 9168,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "58fb97cdc3a36879f400f5f9",
               "name": "Randy Edelman",
               "profile_path": "/fGS6OjvQpivFVajkmjTRgRiC9BN.jpg",
               "id": 14712,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "58fb97d392514163df011228",
               "name": "Michael Seresin",
               "profile_path": "/z1gtMRLItEj02DfrzeS8ZjPMZUu.jpg",
               "id": 9165,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "58fb97dbc3a3687a250105c7",
               "name": "Gerry Hambling",
               "profile_path": null,
               "id": 9163,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "58fb97e6c3a36879f400f60f",
               "name": "Geoffrey Kirkland",
               "profile_path": null,
               "id": 32403,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "58fb97edc3a3687a250105d6",
               "name": "Robert F. Colesberry",
               "profile_path": null,
               "id": 1994,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "58fb97f4c3a36879db0117d6",
               "name": "Nellie Nugiel",
               "profile_path": null,
               "id": 933501,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "58fb97fb925141642f010f43",
               "name": "John Willett",
               "profile_path": null,
               "id": 957310,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "58fb9803c3a3687a2a00ffc8",
               "name": "Jim Erickson",
               "profile_path": null,
               "id": 8680,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "58fb9809c3a3687a2a00ffd9",
               "name": "Molly Maginnis",
               "profile_path": null,
               "id": 33456,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "History",
            "id": 36
         }
      ],
      "popularity": 1.679808,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 59820,
      "vote_count": 15,
      "budget": 0,
      "overview": "Come See The Paradise is a deeply touching love story set against the backdrop of a dramatic and controversial period in American history, It follows the romance and eventual marriage of Jack McGurn (Dennis Quad), a hot blooded Irish American, and a beautiful Japanese American Lily Dawanura (Tamlyn Tomita), at the outset of World War II. The clash of cultures, at once painful for the two lovers, becomes insurmountable after the Japanese bomb Pearl Harbor. Lily and the Kawamuras are relocated To a bleak, outdoor internment camp in California, Jack is drafted into the Army, powerless to help the woman he loves abandoning all hope of ever winning her family's approval.",
      "similar": [
         1024,
         19913,
         13523,
         24420,
         1259,
         276,
         1903,
         50544,
         38,
         1628,
         1643,
         316021,
         16980,
         226,
         44564,
         23949,
         17612,
         862,
         1213,
         68718
      ],
      "original_title": "Come See the Paradise",
      "runtime": 133,
      "poster_path": "/xuZQbo67enGmL3CbyrUAorTjAVu.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [{
         "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
         "name": "20th Century Fox",
         "id": 25,
         "origin_country": "US"
      }],
      "release_date": "1990-08-17",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Alan Parker"],
      "runtime": 138,
      "synopsis": "While told in the prospective of a Nisei (2nd generation Japanese-American), this film does not fall to maudlin. The historical prospective is the facts leading up to the internment of West Coast Japanese nationals and Japanese-Americans just after the Pearl Harbor attack. In addition to telling about the internment camps, it also provides some insight into pre-war union efforts to organize It is told in flawless flashbacks. To a large extent the film is a narrative of people whose ability to lead their own lives were constrained by illegal activities of others. Jack McGurn (Quaid) moves to Los Angeles from New Jersey in 1936 to escape from troubles that fall on him as a labor organizer. He takes a job as a projectionist in a Little Tokyo movie theater run by a Japanese-American family. He falls in love with his Japanese boss's daughter. Forbidden by the father to see one another and barred from marrying by California law, the couple elope to Seattle, Washington. (The law there permitted inter-racial marriage.) They have a little girl they name Mini, who looks more like an Asian-American than a European-American. McGurn gets a job working as a \"fish smasher.\" He is unjustly jailed for interfering when a peaceful legal protest of working conditions where he works is violently broken up by management goons and police. He is paroled just as the Japanese nation attacks America. McGurn's wife and daughter, and her family, are sent to Manzanar. McGurn parole is suspended but he then has to joins the United States Army without time to return to his wife before she is sent to the internment camp. He goes AWOL to visit his family in the camp. The movie has reconstructed scenes of the forced sale by Little Tokyo residents and scenes in the camp intended to show injustices that occur as a result of the order to intern west coast Japanese-Americans. 1944 Supreme Court rulings about the camps constitutionality allow American members of the family who had signed loyalty oaths to leave the camp. They go to live with an aunt, since they have no home in Little Tokyo anymore. The story is told in flashback as the mother tells Mini about Jack, whom Mini barely remembers, as the two of them are walking towards a railroad station where they are to meet Jack coming back from the war after the atomic bomb on Hiroshima.",
      "writers": ["Alan Parker"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0099291/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI5Nzk1NTgzM15BMl5BanBnXkFtZTcwOTUyODIzMQ@@._V1_SY317_CR8,0,214,317_AL_.jpg",
      "actors": ["Stars: Dennis Quaid, Tamlyn Tomita, Sab Shimono | See full cast and crew »"],
      "reviews": [
         "\"Come See The Paradise\" is a forgotten gem of a film that takes place during one of the United States' darkest and most shameful times. At the onset of World War II, Japanese-Americans were put into internment camps This injustice lasted for several years. Alan Parker's fictional film takes place before, during and after this time. It tells the story of Jack McGurn (Dennis Quaid), an Irish-American labor organizer who falls in love with Lily Kawamura (Tamlyn Tomita), a young girl who lives with her large family in San Fransisco. Lily's father (Sab Shimono) does not agree with the romance, which forces Jack and Lily to elope in Seattle. Jack gets into some trouble with the law while picketing, and Lily, angry that Jack has not changed his ways since the birth of their daughter, Mini, takes the child back to her family's house. Soon after, Pearl Harbor is bombed, the Kawamuras are shuttled off to various camps (except Mr. Kawamura who is believed to be a traitor), and Jack is forced into the army. Like many films, \"Come See The Paradise\" is about the strength of love. The fact that it uses this period as a backdrop sets it apart from the rest. The chemistry between Quaid and Tomita is amazing. Just watch them together when they meet for the first time and they kiss. It's simply stunning. Quaid has rarely been this good, and Tomita is obviously relishing having a lead role. In most of her films she's listed as \"(somebody's) wife\". Films like this and \"The Joy Luck Club\" prove that she is one of the most talented and under-used actresses. Some have complained that this film uses an \"American\" character to tell the story of a \"Japanese\" family. As if any non-Japanese audience members would not be able to understand, or relate to, the Japanese family. The Quaid character is called \"un-American\" because of his labor rights stance. The family is called \"un-American\" simply because they are of Japanese descent. Even though the children were born in the United States. So what exactly does it mean to be \"un-American\"? Side note: this movie has not been released on DVD. I anxiously await that day.",
         "I wish that this film could have been better--and it could have, in many ways. First of all the acting was quite good, particularly Tamlyn Tomita whose charm and beauty make for radiant scenes. And the sets/cinematography allowed for a good deal of authenticity. However, the difficulty I have with the film concerns--as other reviewers have noted--a wandering and unfocused script. Although Alan Parker allows for an accurate (for the most part) and revealing look at life in the internment camps, we rarely see anything from Jack's (Dennis Quaid) perspective. What happened to him after he went AWOL? How long were they apart? Also, the difficulties that everyone had with the marriage between Lily and Jack are resolved without any discussion. She simply comes home from Seattle and all is forgiven? The cultural tensions and familial disputes were left behind in favor of a highly politicized second half. In order to fit in the family conflicts and internment episodes, the romance between Lily and Jack is hastened to the point of non-existence in the second half hour. Therefore the audience had little reason to dread their eventual separation, and rejoice in their ultimate reunion. Finally, on an historical note, the Supreme Court case Korematsu vs. U.S. (1944) upheld the constitutionality of the internment camps. The movie portrayed a victorious Supreme Court decision that allowed for all internees to return to freedom. However, the US government did not officially recognize the unconstitutionality of Executive Order 9066 until 1988, with a Congressional apology and restitution. Overall, because of the highly-charged emotional potential of the subject matter, I had expected a film with a little more feeling. And if a director/writer is going to make a political movie to illuminate a dark period of American history, he should at least get his facts straight. Salome",
         "This is one of the most powerful films that I have seen about the Japanese-American experience in the internment camps during WW2.The think that struck me from the very beginning was that these folk were just as American as any of us.They,too,were just trying to live the American Dream,until the policies of the US Government took their dreams away from them.History has a bad habit of repeating itself,and movies like this remind us that regardless of race,creed,or color,we're all just Americans.This was a bad time for US domestic policy,and hopefully a shameful policy like this will never rear its ugly head again in our country.",
         "The \"Front-Page\" review of this film gives the impression that it is not worth seeing \"because the plot is wandering\" and other unfair accusations. Instead, take a look at Roger Ebert's fine review under the External review portion of IMDb. I first purchased this film back in the days of the Laser Disc, and I know that my \"ancient by today's standards\" Pioneer player....and perhaps I'm in violation of copyright laws, but I am transferring all my laser discs to DVD, and I cannot possibly think of a finer film to witness the discriminatory laws that existed during the early days of WWII....even if the focus is on an Irish-American played by Dennis Quaid....and you must see the early scene in which he dances/sings to a Japanese song that he has memorized by his position as Projectionist in a Japanese-American theatre in San Francisco. And for those who might enjoy a Jarre/Barry type film score, this one is haunting and lovely. Ignore the reviewer and give this terrific film a chance, and I'll bet you'll love it.",
         "I really loved this movie. It was informational and had a beautiful storyline. I generally don't get my knowledge from movies because they are often very inaccurate but I know this one is based on facts as I have done some research about internment camps for a class paper. I know that the story between Jack and lily is entirely made up, but all the historical events aren't. Also, I feel that movie directors and studios should make more movies with Asian characters and about Asian in America because I find it very interesting. I am not Asian, not one little bit and I am getting tired of seeing always the same kind of people on movie screens. I know that the studios have come a long way but they need to make more movies like this one, and believe that there is an audience (not obviously Asian) interested in seeing them. If you have not seen this movie, get some popcorn, unplug the phone and enjoy.",
         "This movie has faults--don't they all. Have found it very helpful in teaching a variety of concepts to sophomore and junior English students. The scenes showing Lily and her family forced out of their homes by Americans, marching to the train station in total silence except for their haunting, now-forbidden Japanese music are always received with great concentration and silence by my classes--a high tribute to Mr. Parker's ability to let a picture speak for itself. Come to the Paradise offers a refreshingly different viewpoint of a critical point in American history for those of us who prefer a little something to chew on besides popcorn at the movies.",
         "During WWII, Japanese Americans are stripped of their property and sent to prison camps in California. Also seemingly taken away is the family life of an American man and his Japanese soulmate. This is powerful material and COME SEE THE PARADISE does well as a first attempt. Surely, sooner or later more talented directors will revisit this bit of history and hit a home run. Few movie fans know that STAR TREK's George Takei (Mr. Sulu) lived with his family in these California concentration camps during WWII. Both his father and grandmother died in them. As ROOTS showed us the reality of slavery in America, as GERONIMO taught us that the taking of the West was an ugly affair devoid of justice, as the DEAR HUNTER told us that the troubles of Vietnam were deeper than reported on the evening news; COME SEE THE PARADISE gives us an imperfect glimps of some of our darkest mistakes of WWII.",
         "\"Come see the Paradise\" is an amazing film in essence this film does what Michael Moore and \"Fahrenheit 911\" do remind us of an ugly of American history commited by several abusive bureaucractic leaders imposing their form of corrupted civil governments and laws. The film takes place during WWII and like \"Snow Falling on Cedars\" (another great story about the anti-Japanse movement during this time) is about an American, who falls in love with a Japanese women. The two fall in love regardless of their race backgrounds. The girls fathers does not like the White Man, but eventually the family accepts him as partof the family, and this LOVE IS TESTED during the war. Dennis Quaid stars as Jack McGurn a liberal Irish activist who is trying to believe form a union, now forming a Union back then was like being a Communist in this warp view of America. It was pure nonsense and people like disgraced military men like MacArthur and other abusive military leaders wanted to quite down people who spoke out against governemnt corruption. This of course has been the case across history , even movie directors like the late great Elia Kaza have been targeted. Back to the movie: Tamyln Tomita as the love interest, Lily Yuriko , is absolutely great portraying all the anguish of a women in love, but then feels pain and sorrow when she sees her own people being put in Concentration Camps by the Americans and are given no rights, no real jobs (except menial low paying ones) and no hope. (Spoilers) During one dramatic and painful sequence that has to be seen the father is arrrested for no reason and taken into custody, he is then released and is then labeled as traitor leading into a great depression which eventually hurts his spirits and he dies. Quaid deserves a great recommendation for his performance as one of a few Americans who sees whats going and realizes that this is wrong. At one point, like many men he is forcibly drag into the war, and then goes AWOL to see his love and her Japanese family to provide support its very touching still the US carries it's vendetta with the Japanese leading to Atom bomb being dropped on Hiroshima and the bombing of Pearl Harbor. If you don't cry watching this movie there is something wrong with you as \"Come See The Paradise\" by Alan Parker has great dramatic performance , a great score by Randy Edelman and a true life story that SHOULD NOT be forgotten. The movie is also told primarily through the narration of Lily the main character does giving us a very intimate and real portrayal of the evennts unfolding onscreen. Truly an amazing movie, in fact see it with \"Fahrenheit 911\" so you can see some historic, dramatic events that we as Americans should not forget and learn from.",
         "In 1941 Japan launched a surprise attack on the American naval base at Pearl Harbor and caught thousands of Neisei in between two worlds. Come see The Paradise is the story of the Neisei (Japanese immigrants and Americans of Japanese descent) who were removed to the interior from the West Coast. The film is loosely narrated by Lily Yuriko McGann née Kawamura, a young Nisei married to a white American. Notwithstanding the marriage, both she and her daughter Mini McGann (Elizabeth Gilliam; Shyree Mezick; Caroline Junko King) are interned under difficult conditions. The film strives for a degree of balance in that it does present those who out-right favored Japan and fomented trouble in the camps as well as those loyal to their adopted country who volunteered for service in the armed forces. There are several gaps in the film: Mini McGann as the daughter of a white father, couldn't have been legally detained. Jack McGann would have been entitled to an exemption from the draft as a sole custodial parent. Alternatively, with Jack in the Army and Lilly McGann locked up, in those times a grandparent Jack's parents would have been legally responsible for Mini's care and support. How did grandpa Gerry McGurn (Colm Meaney) get away without ante-ing up? The film does not explain what happened to Jack McGann alias Jack McGurn (Dennis Quaid)during the war. There is a suggestion that past union activities caught up with Jack and that he was jailed instead of being sent off into combat. In 1944 that would have seemed unlikely as the US running short on man-power was already draining its prisons into the army. In any event, the unions had been legalized nine years earlier in 1935 by FDR. Former Leftist activity was not regarded as a bad thing during the war years when the Soviet Union was America's ally. The anti-communist purge would await final victory in the war. The movie erroneously claims the US Supreme Court ended internment; to the contrary it not only approved internment but also condoned taking away a reserve commission that had been awarded to a Neisei. But despite the minor lapses in the historical aspects of the account, the film is compelling.",
         "Well, I recently experienced \"Come See the Paradise\" with Dennis Quad. The movie tells the often overlooked and not widely known story of Japanese Americans before, during and after WWII. This film was incredible to say the least, the characters very well drawn up and telling a simple love story beautifully. The performances are memorable and one can feel the sense of conflict in these characters. At times I was actually nearly brought to tears, a rare thing for me (the only movies that have ever made me cry are \"Godzilla vs. Destroyah\", \"I am Legend\", \"Pokémon 2000\" ,I was like seven, \"Rodan\" and \"Schindler's List\"). The encampment of Japanese-Americans is often overshadowed by Pearl Harbor and the Holocaust, but this film shows it how it really happened. The struggle of loyalty, patriotism and freedom all are called out in this movie quite nicely, the director just telling it how it is, you know? The story is sad one that finally lives up to its title, although I couldn't really enjoy it the first time around with my history teacher treating us like five year olds! I only wish it had a scene of the Atomic bomb being dropped on Nagasaki or Hiroshima. It would of helped audiences understand the atrocity of using such a weapon on defenseless civilians."
      ],
      "genres": [
         "Drama",
         "History",
         "Romance",
         "War"
      ],
      "productionCompanies": ["Twentieth Century Fox Film Corporation"],
      "summaries": ["Portraying one of the shadier details of American history, this is the story of Jack McGurn, who comes to Los Angeles in 1936. He gets a job at a movie theatre in Little Tokyo and falls in love with the boss's daughter, Lily Kawamura. When her father finds out, he is fired and forbidden ever to see her again. But together they escape to Seattle. When the war breaks out, the authorities decide that the Japanese immigrants must live in camps like war prisoners."],
      "budget": 0
   },
   "movielensId": 3106,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1990-08-17",
      "dvdReleaseDate": "2006-06-06",
      "directors": ["Alan Parker"],
      "runtime": 133,
      "movieId": 3106,
      "title": "Come See the Paradise",
      "mpaa": "R",
      "actors": [
         "Dennis Quaid",
         "Tamlyn Tomita",
         "Sab Shimono",
         "Brady Tsurutani"
      ],
      "imdbMovieId": "0099291",
      "originalTitle": "Come See the Paradise",
      "genres": [
         "Drama",
         "Romance",
         "History"
      ],
      "youtubeTrailerIds": ["pBxqOy937j0"],
      "plotSummary": "Come See The Paradise is a deeply touching love story set against the backdrop of a dramatic and controversial period in American history, It follows the romance and eventual marriage of Jack McGurn (Dennis Quad), a hot blooded Irish American, and a beautiful Japanese American Lily Dawanura (Tamlyn Tomita), at the outset of World War II. The clash of cultures, at once painful for the two lovers, becomes insurmountable after the Japanese bomb Pearl Harbor. Lily and the Kawamuras are relocated To a bleak, outdoor internment camp in California, Jack is drafted into the Army, powerless to help the woman he loves abandoning all hope of ever winning her family's approval.",
      "tmdbMovieId": 59820,
      "avgRating": 3.28972,
      "releaseYear": "1990",
      "numRatings": 107,
      "posterPath": "/xuZQbo67enGmL3CbyrUAorTjAVu.jpg"
   }
}