{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "therapist",
            "id": 2726
         },
         {
            "name": "suspicion",
            "id": 3301
         },
         {
            "name": "serial murder",
            "id": 11260
         },
         {
            "name": "special education",
            "id": 208728
         }
      ],
      "imdb_id": "tt0110965",
      "video": false,
      "title": "Relative Fear",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Linda Pratman",
               "gender": 1,
               "credit_id": "52fe490d9251416c750bbfb1",
               "name": "Darlanne Fluegel",
               "profile_path": "/bhZdjbtZ71fsdYztrsq3KCC94F.jpg",
               "id": 4761,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Det. Atwater",
               "gender": 2,
               "credit_id": "52fe490d9251416c750bbfb5",
               "name": "James Brolin",
               "profile_path": "/8SGPpN3ieM3K0mHjD8bbQIRD6x.jpg",
               "id": 9274,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Peter Pratman",
               "gender": 2,
               "credit_id": "546e50d49251415ff60003aa",
               "name": "Martin Neufeld",
               "profile_path": null,
               "id": 53596,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Connie Madison",
               "gender": 1,
               "credit_id": "546e50e3c3a36845330003b1",
               "name": "Denise Crosby",
               "profile_path": "/swsAGvviqh4PfDzjKpnR8sd3rx2.jpg",
               "id": 1743,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Earl Ladelle",
               "gender": 2,
               "credit_id": "546e50f39251415fec0003af",
               "name": "M. Emmet Walsh",
               "profile_path": "/dLf79xlsmE40rog0gryjxsZJzml.jpg",
               "id": 588,
               "order": 4
            },
            {
               "cast_id": 4,
               "character": "Adam Pratman",
               "gender": 2,
               "credit_id": "52fe490d9251416c750bbfb9",
               "name": "Matthew Dupuis",
               "profile_path": null,
               "id": 995601,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Clive",
               "gender": 2,
               "credit_id": "58bfb0589251412e3b004607",
               "name": "Bruce Dinsmore",
               "profile_path": "/tt511IEOZ2J6f1PNCvS47WN4ggC.jpg",
               "id": 179270,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Margaret Ladelle",
               "gender": 0,
               "credit_id": "58bfb0649251412e0e0045ff",
               "name": "Linda Sorensen",
               "profile_path": null,
               "id": 1087584,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Mr. Schulman",
               "gender": 2,
               "credit_id": "58bfb0709251412e0e004607",
               "name": "Vlasta Vrána",
               "profile_path": "/ug27TmlJNKvhJEa6xWGCpPz4o2q.jpg",
               "id": 58169,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "K-9 Cop",
               "gender": 1,
               "credit_id": "58bfb081c3a368697b003fda",
               "name": "Linda Singer",
               "profile_path": null,
               "id": 977522,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe490d9251416c750bbfad",
               "name": "George Mihalka",
               "profile_path": "/aOwOiF7wKNMXK2ffGoh3EfrcXVh.jpg",
               "id": 133793,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "546e50c19251415ffb000390",
               "name": "Kurt Wimmer",
               "profile_path": "/vO84pZBssHveIxxnh2d2sbNNCLY.jpg",
               "id": 13927,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.135535,
      "production_countries": [{
         "iso_3166_1": "CA",
         "name": "Canada"
      }],
      "id": 92769,
      "vote_count": 3,
      "budget": 0,
      "overview": "Linda and Peter Pratman's son Adam is autistic, but they still love him and hope that he'll at least start talking some day. However he's teased and abused by the kids of the neighborhood and his grandpa . When several people around Adam die an unexpected death, his parents start to suspect Adam - is he just simulating to be so ignorant about his environment?",
      "similar": [
         12405,
         40807,
         301337,
         340837,
         12220,
         413852,
         9506,
         45612,
         204922,
         122,
         8843,
         17609,
         638,
         253626,
         2313,
         271714,
         687,
         9932,
         68812,
         24150
      ],
      "original_title": "Relative Fear",
      "runtime": 90,
      "poster_path": "/l9mzb7eJ1SOLEwcmLHBa27YtiXR.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Allegro Films",
            "id": 4899,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "west wind entertainment",
            "id": 24946,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Norstar Entertainment",
            "id": 16953,
            "origin_country": ""
         }
      ],
      "release_date": "1995-10-03",
      "vote_average": 4.7,
      "belongs_to_collection": null,
      "tagline": "Trusting your children can be deadly.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": "CAD ",
      "directors": ["George Mihalka"],
      "runtime": 90,
      "synopsis": null,
      "writers": ["Kurt Wimmer"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0110965/",
      "coverLink": null,
      "actors": ["Stars: Darlanne Fluegel, Martin Neufeld, James Brolin | See full cast and crew »"],
      "reviews": [
         "One night, Linda Pratman (Darlanne Fluegel) had her baby born in the hospital but at that same moment, an dangerous psychopath (Denise Crosby) had her baby in the same hospital in that night. Four years has passed, Linda's son Adam (Matthew Dupuis) might be autistic. Adam loves to draw but he finds himself fascinated by crime TV shows. At first, Linda noticed how strange her son is coming to be. While deadly accidents are happening in the house or near their house. Linda is starting to convinced that Adam might not be her son. While Adam might not be as innocent he seems to be. Directed by George Mihalka (Les Boys 4, La Florida, My Bloody Valentine) made an entertaining suspense-thriller with some amusing darkly funny moments. Fluegel and Dupuis are certainly good in the movie. M. Emmet Walsh appears in a small role as Linda's father. James Brolin is certainly in this movie for an paycheck as the candy-loving detective. Perphas what is notable for the movie, it is one of the earlier written scripts by Kurt Wimmer (Equilibrium, Law Abiding Citizen, The Recruit). \"The Child\" does have some guilty pleasure moments and it is also worth an look. Original title of the film was \"Relative Fear\". (****/*****).",
         "I've watched this video several times and the suspense is chilling, the end great fun.",
         "this was actually quite decent i must say the acting was not bad but it falls victim do to a few unlikable characters but other then that this was a well made sometimes suspenseful chiller although there is some poor dialog at times it didn't hurt it all that much either it had a pretty good twist ending that i didn't see coming.And check out the laughable death scene where there is marbles all over the stairs the detective slips and falls to his death pretty lame still i rather enjoyed this one the finale will is quite suspenseful Darlanne Fluegel is good as the caring mother she gives a good show and is very likable the rest of the cast was decent at best overall we have a watchable romp thats worth a rent you might be surprised like i was **1/2 out of 5",
         "This little known film which I caught by channel surfing in 1995 and taped and later bought has turned out to be one of my all time favorite thrillers. It stars mostly little known actors other than James Brolin and M. Emmett Walsh. The movie begins with 2 babies being born at the same hospital one night, one from a lady in restraints who is screaming that they can't take her baby from her, and the other from a married couple who seem very happy and normal. Of course the viewer realizes there's going to be a baby switch. That's a given. The focus is henceforth on the normal couple. The mother, Darlene Fluegel, senses something is wrong before leaving the hospital. The movie then shifts to 4 years later (It should have been 5 or 6 as the excellent Michael DuPuis is way too big to be 4) and \"Adam\" is mute, and fascinated by watching a cable crime channel that covers mainly murder cases live or re-enactments. He has a talent for drawing but never speaks. They are told he is autistic, though his behavior is not typical of autistic children. Then again, the movie is a whodunit, not a study of autism. Soon, strange happenings begin to occur. Adam's Grandfather's dog is lured out and not seen again. A neighbor's child who teases Adam when no adults are around gets shot and killed. Then the Grandfather dies when someone disconnects his oxygen. Adam is always present at these events. Is he a bad seed? The parents hire a professional tutor to try to get Adam to speak from a well known Child Help Foundation. The rest of the film has many twists and turns and a very powerful climax, with a few chills along the way. It was written by Kurt Wimmer, who just this year (2010) wrote \"Law Abiding Citizen\" starring Gerard Butler. Some may figure out the ending early on, but the scene where Adam's mother finds her biological child is a winner, and all the characters are intelligent people. The film is \"R\" rated for violence, though by today's standards it should be PG-13 at worst. No gore. Most of the deaths occur off screen. It is more suspense than horror. I know most don't think this is a great film judging from critics and viewers reviews, but it is one of my 20 favorite movies ever (I am nearly 70 and have seen nearly 3000 films, some as many as 40 times), and everyone I have shown this has at least liked it. Some similarity to the original \"Stepfather\".",
         "this was a pretty good movie..i was surfing channels and came across this..relative fear is a real creepy affair..especially the autistic adam that kid creeped the s**t out of me... the plot was good and so were the twists....but creepy adam stole the show ... so if you like thrillers with good twists then relative fear is for you... i give it 8/10 and will never look at 4 year old autistic kids the same again",
         "SPOILERS!! This is the story of a family with an autistic child. Isn't that exciting? Adam is a four year old boy who is apparently autistic, despite the fact that he doesn't seem to show any signs of it, other than he can't talk. He is a gifted artist, and he loves the Crime Channel. As his drawing become more and more violent, people around him start to die. Is it Adam committing the murders? Perhaps if the movie didn't give everything away in the first few minutes we might think so. As it turns out the \"twist\" is obvious from the get go, although it makes little sense. None of the actors were great, a few were really horrible, but no one was so bad that you had to turn the movie off. The little boy who plays Adam spends the whole movie in a trance (I guess thats his autism?), and he makes you want to slap him. There are other, better movies with similar themes that I would recommend such as the Bad Seed, The Good Son, or even Mikey, although the \"twist\" does make this movie slightly different from those listed above."
      ],
      "genres": [
         "Drama",
         "Horror",
         "Thriller"
      ],
      "productionCompanies": [
         "Allegro Films",
         "Norstar Entertainment",
         "West Wind Entertainment"
      ],
      "summaries": [
         "Linda and Peter Pratman's son Adam is autistic, but they still love him and hope that he'll at least start talking some day. However he's teased and abused by the kids of the neighborhood and his grandpa . When several people around Adam die an unexpected death, his parents start to suspect Adam - is he just simulating to be so ignorant about his environment?",
         "Just why are people surrounding Adam Pratman dropping down dead? Is this five year old really a murderous sociopath?"
      ],
      "budget": 2500000
   },
   "movielensId": 311,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-10-03",
      "dvdReleaseDate": null,
      "directors": ["George Mihalka"],
      "runtime": 90,
      "movieId": 311,
      "title": "Relative Fear",
      "mpaa": "",
      "actors": [
         "Darlanne Fluegel",
         "James Brolin",
         "Martin Neufeld",
         "Denise Crosby",
         "M. Emmet Walsh",
         "Matthew Dupuis",
         "Bruce Dinsmore",
         "Linda Sorensen",
         "Vlasta Vrána",
         "Linda Singer"
      ],
      "imdbMovieId": "0110965",
      "originalTitle": "Relative Fear",
      "genres": [
         "Horror",
         "Drama"
      ],
      "youtubeTrailerIds": ["hVwPmQEugcw"],
      "plotSummary": "Linda and Peter Pratman's son Adam is autistic, but they still love him and hope that he'll at least start talking some day. However he's teased and abused by the kids of the neighborhood and his grandpa . When several people around Adam die an unexpected death, his parents start to suspect Adam - is he just simulating to be so ignorant about his environment?",
      "tmdbMovieId": 92769,
      "avgRating": 2.73837,
      "releaseYear": "1995",
      "numRatings": 86,
      "posterPath": "/l9mzb7eJ1SOLEwcmLHBa27YtiXR.jpg"
   }
}