{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "suicide",
            "id": 236
         },
         {
            "name": "parent child relationship",
            "id": 970
         },
         {
            "name": "epilepsy",
            "id": 1944
         },
         {
            "name": "pulitzer prize",
            "id": 3558
         },
         {
            "name": "based on play or musical",
            "id": 10181
         },
         {
            "name": "suicide by gunshot",
            "id": 11767
         }
      ],
      "imdb_id": "tt0090556",
      "video": false,
      "title": "'night, Mother",
      "recommendations": [],
      "backdrop_path": "/wKkbsUrteLSC1WjcrQhUjSGm2sc.jpg",
      "revenue": 442000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jessie Cates",
               "gender": 1,
               "credit_id": "52fe457a9251416c91033bf3",
               "name": "Sissy Spacek",
               "profile_path": "/zauFMssYujKk7Kadz0t100VU5WE.jpg",
               "id": 5606,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Thelma Cates",
               "gender": 1,
               "credit_id": "52fe457a9251416c91033bf7",
               "name": "Anne Bancroft",
               "profile_path": "/ydabiabIsMBe2HsNmx43gBpqzxx.jpg",
               "id": 10774,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Dawson Cates",
               "gender": 2,
               "credit_id": "52fe457a9251416c91033bfb",
               "name": "Ed Berke",
               "profile_path": null,
               "id": 113068,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Loretta Cates",
               "gender": 0,
               "credit_id": "52fe457a9251416c91033bff",
               "name": "Carol Robbins",
               "profile_path": null,
               "id": 113069,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Melodie Cates",
               "gender": 0,
               "credit_id": "52fe457a9251416c91033c03",
               "name": "Jennifer Roosendahl",
               "profile_path": null,
               "id": 113070,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Kenny Cates",
               "gender": 2,
               "credit_id": "52fe457a9251416c91033c07",
               "name": "Michael Kenworthy",
               "profile_path": "/nzls59Y37TTiNSHThmTyUm8RAxp.jpg",
               "id": 92852,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Agnes Fletcher",
               "gender": 0,
               "credit_id": "52fe457a9251416c91033c0b",
               "name": "Sari Walker",
               "profile_path": null,
               "id": 113071,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Operator (VOICE)",
               "gender": 1,
               "credit_id": "52fe457a9251416c91033c0f",
               "name": "Claire Malis",
               "profile_path": null,
               "id": 113074,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe457a9251416c91033c15",
               "name": "Tom Moore",
               "profile_path": null,
               "id": 113102,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe457a9251416c91033c1b",
               "name": "Marsha Norman",
               "profile_path": null,
               "id": 113105,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "52fe457a9251416c91033c21",
               "name": "Marsha Norman",
               "profile_path": null,
               "id": 113105,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.378407,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 34760,
      "vote_count": 7,
      "budget": 0,
      "overview": "It happened in 1983. It was a rare and remarkable theatrical experience. Controversial. Provocative. And shocking. Now, two Academy Award-winning actresses make the Pulitzer Prize-winning play the motion picture event of the year. What would you do if someone you loved sat down with you one night and calmly told you that they were going to end their life before morning?",
      "similar": [
         277216,
         842,
         8272,
         2539,
         8967,
         2288,
         4347,
         401,
         773,
         858,
         2253,
         111,
         334,
         112160,
         39254,
         244772,
         11012,
         15584,
         284276,
         43923
      ],
      "original_title": "'night, Mother",
      "runtime": 96,
      "poster_path": "/8bpgDDGx9RK6dDBBEcBETlVPtMM.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1986-09-12",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Tom Moore"],
      "runtime": 96,
      "synopsis": "Jessie Cates, an unemployed epileptic with a failed marriage and a deeply troubled son, tells her mother, Thelma, that she plans to kill herself before the night is over. Thelma tries to convince her daughter life is worth living, but Jessie remains resolute. Directed by Tom Moore, this gripping film was adapted from the Pulitzer Prize-winning play by Marsha Norman. A dark, tear-jerking drama, this film stars Anne Bancroft (Thelma), who was nominated for Best Actress in a Motion Picture (Drama) for \"'night, Mother\".",
      "writers": [
         "Marsha Norman",
         "Marsha Norman"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0090556/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcyNDEyOTI1OF5BMl5BanBnXkFtZTcwNzU0NzkxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Sissy Spacek, Anne Bancroft, Ed Berke | See full cast and crew »"],
      "reviews": [
         "Marsha Norman's play was gripping and harrowing on Broadway and while Director Moore opens it up as much as possible without losing the repartee, it is still a filmed stage play -- but one that packs every bit of the emotional wallop it did on the stage. The acting is marvelous and pulls no punches. Bancroft is almost unrecognizable, in a good way, completely immersing herself in the energetic mother character. Spacek is completely believable as the determined daughter. This is a true clinic in two-person character study acting.",
         "\"'Night Mother\" is a film for those who appreciate a good, thought provoking drama. Anne Bancroft, the Italian/American actress from NYC plays a Southern woman with gusto. Sissy Spacek as her daughter is excellent as a woman who has had enough of life & has decided to end hers. It's hard to decide who you feel more sorry for. My heart tends to go out more to the Bancroft character because Spacek's character has finally found some peace with her decision to end her life. This movie is very intense & the music on the soundtrack is beautiful & adds to it's emotional impact.",
         "That is just one of the thought provoking lines from this movie. There are many. And while most of the reviewers praise the acting in this movie, and rightly so since it is a tour de force, I have to give praise to Marsha Norman who adapted her own Pulitzer Prize winning stage play for the screen. When a movie is a \"slice of life\" such as this one, I unconsciously look for good and realistic dialog. There are just so many lines in this movie that ring true to real life conversations. There's a part where the Mom (Bancroft) tells Jessie (Spacek) to call her ex-husband up & try again, he might be ready and Jessie tells her that there's no point in calling him up because what's she gonna say, \"nothing's changed, I'd just like to look at you if you don't mind?\" In another scene Jessie compares life to a bus ride. She says it's hot, crowded & noisy and the only reason you don't get off is that your destination is 10 stops away. She says if she gets off now, or later, it's the same place when she steps down to it. In another part of the movie she says that she thought about sticking around if there was just something that she really liked, like rice pudding or cornflakes- but Jessie is a person robbed of any enthusiasm for life. So for her, staying around, especially for others, just doesn't make sense any more- she's had enough. I really don't think Marsha was asking us to agree w/that point of view or to even condone it. I think she was just giving us some perspective- another point of view. And I have to admit, after having seen this many times, maybe Jessie made the right decision. As she also says in the movie, she is what *became* of her (Bancroft's) child. That she, Jessie, that might have made a difference to herself, didn't show up. Which is really food for thought for ANYone watching this movie- make a difference to yourself first and foremost. Despite the movie being about suicide, this is actually a life affirming movie if you look at it from that point of view. The \"acting\" (I say that in parenthesis because it's so real it doesn't even seem like acting) from Spacek and Bancroft is absolutely first rate. I would recommend this movie on that score alone. Luckily, with the powerful and thought-provoking screenplay and the lovely music by Dave Grusin, there is much to recommend this heart wrenching tale of life and death.",
         "Only people who have seriously considered suicide as an option can fully understand this movie. It is dark but it is from the perspective of a realist and is performed brilliantly. Both actresses are totally believable. I saw this movie in \"87\" and it has haunted me ever since.",
         "This film was amazingly well acted and filmed. It plays like a very intimate stage play. Sissy Spacek & Anne Bancroft each present their characters so seamlessly and flawlessly that I left the theater wondering if they actually were mother and daughter. This movie is extremely well written. The fact that it infuriated me, in this instance is not a put-down. I believe this script was designed to do so. It's infuriating because Ms. Spacek's character is so hell-bent on her intentions that nothing but nothing is going to change her mind. Ms. Bancroft's character's job is to try and stop Spacek from reaching this particular goal she's set, at any cost. This script is a good case study into the mind-set of people who are suffering from extreme depression and the skewed decisions that they might make while in the midst of that depression. I would highly recommend this film, with the understanding that it is not your light, airy, happy-ending movie. If you're looking for one of those don't bother with this one.",
         "This film is an adaptation of a play - and it shows. It all takes place in one small house, and there are really only two characters, Jessie and her mother. Sissy Spacek and Anne Bancroft do an incredible job in their respective roles. The writing is fantastic. Jessie is intent on killing herself, and tells her mother what she is planning, in order to explain herself. Her mother, of course, is appalled, and struggles to convince her to change her mind, and also to try to understand why Jessie wants to do something so drastic and final. Both roles are emotionally laden, and extremely well-drawn. The result is a film that is complex, interesting, sometimes funny, and heart-wrenchingly sad. It is, no doubt, a tear-jerker, but it is well worth seeing.",
         "It's gut wrenching, incredibly sad, funny in a few parts and completely shocking. I first saw this movie in my early 20's and it had a profound effect on me. I do not watch it much because it is very, very deep and extremely, depressing. Jessie Cates, played by Sissy Spacek, is a middle-aged, epileptic living with her mother. She has had a traumatic, divorce in her past and a wayward son headed for prison. Due to her illness, she can't drive or hold down a job and has no hopes that anything will get better for her. Jessie, has after years of contemplating suicide, finally picked the night to do it. She has organized her personal belongings and put everything in order. Now, all she has to do is tell her mother. Anne Bancroft, plays Jessie's mother, the blissfully ignorant, Thelma Cates. Who by her own description, is \"a plain, old, country woman\" who \"just really doesn't think there's all that much to things\". She is caught totally off guard when her daughter tells her, she is planning to kill herself that night. Momma Cates is so blatantly unaware that her daughter is unhappy that she even tells her where the gun is before asking why. The subject matter and the way it's presented is so thought provoking that one doesn't even take notice of the fact that almost this entire movie consists of basically only two actresses. I highly recommend this movie, just don't expect a happy ending.",
         "I remember as a young adult when I first discovered this movie. It was on a local cable channel....late one night. I was flipping channels and came across it. Immediately I was taken aback by the content of the feature. I continued watching. It is a most amazing feature indeed....I have a problem myself with severe depression and have on several occassions....considered suicide myself. But, this movie so pinpoints what the loved ones left behind go through....the sorrow and misery they must suffer...that since anytime the thought crosses my mind...I think of this wonderful masterpiece of a movie and it helps me through those few moments of unclear thought. The odd thing about the movie...is it is like you are watching a televised play...rather than a regular movie....this is one of the things I liked most about it. Bancroft was wonderful in her role and Spacek did well enough as well. I give it 8 out of 10.....only because I felt it eventually became to \"drawn out\".....and should have concluded a bit before it did...But, all in all the movie...as a whole is quite a marvel to behold!!!!!",
         "Wow, here it is almost 20 years after this film was made, and I am just finding out about it. I accidentally stumbled upon it on a cable station one afternoon a few months ago. It has taken me many months since then to find the title and details! Now that I have found the title I am so glad. I hope that I can one day see it again. However, the first and only time I saw this movie I was in the middle of suffering from a deep depression myself. When I watched this movie I almost felt liberated. Through the whole movie I just kept imagining how liberating it must feel to have one person to reveal these painful, awful thoughts to. Everyone I had been in contact with tells me to 'cheer up', or 'think happy thoughts', or 'stop being selfish', etc. There has been not one person close to me whom I could tell my thoughts of wishing for death. When I saw this movie I wanted to cry. I wanted to cry because I truly felt the pain of the character Jessie. I wanted to leave this world as much as she did, there are days that I still want to leave! Medication and therapy helps to keep those days farther and farther apart, but they are still there. Watching this movie did help me to realize that I was not alone, and it also helped me to see that there has to be, and there should be other alternatives. I wish that I could own this movie, to watch again and again and dissect it and research it. But, I am at least glad I got to see it once, and I am so thankful for www.IMDb.com for having it on record, as I have not been able to find it ANYWHERE ELSE!!!!",
         "'Night Mother left me dumbfounded, angry, and with the feeling that I was helpless to the fate of Spacek's character, Jessie. Of course, with any movie, I don't control how it goes, or how it ends, but in this one, I was so sure Jessie's mother was going to win. I just knew there was no way the suicide plan could be carried through. I was teased with happiness (definitely not engulfed) when it seemed that Mama was going to try to make up for all the time Jessie needed with a cup of cocoa...but teased mind you. For every glimmer of hope for Jessie to live (there weren't many), there was a slap of determinedness (if that's a word) for Jessie to make her own decision. Although, I do not advocate suicide, or any act that does not glorify God, I feel glad to have watched this movie. It teaches you that not every story has a happy ending, and that you'd better work out your own soul salvation, because life WILL go on without you."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Aaron Spelling Productions",
         "Blackbird Productions",
         "Universal Pictures"
      ],
      "summaries": ["What would you do if someone you loved sat down with you one night and calmly told you that they were going to end their life before morning? This is Thelma Cates' dilemma. Her daughter, Jessie, has had it. A middle-aged epileptic unable to hold a job or drive with a failed marriage and a drug-addicted runaway son on the wrong side of the law, Jessie can find no reason to go on living. Adapted from the play by Marsha Norman, \"'night, Mother\" is the story of a parent's worst nightmare. How can Thelma convince her daughter that life is worth living if she can't feel her pain? How can she end her daughter's embrace of death before morning?"],
      "budget": 0
   },
   "movielensId": 3112,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1986-09-12",
      "dvdReleaseDate": "2010-08-03",
      "directors": ["Tom Moore"],
      "runtime": 96,
      "movieId": 3112,
      "title": "'night, Mother",
      "mpaa": "",
      "actors": [
         "Sissy Spacek",
         "Anne Bancroft",
         "Ed Berke",
         "Carol Robbins",
         "Jennifer Roosendahl",
         "Michael Kenworthy",
         "Sari Walker",
         "Claire Malis"
      ],
      "imdbMovieId": "0090556",
      "originalTitle": "'night, Mother",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["3E2kkkaq5mc"],
      "plotSummary": "It happened in 1983. It was a rare and remarkable theatrical experience. Controversial. Provocative. And shocking. Now, two Academy Award-winning actresses make the Pulitzer Prize-winning play the motion picture event of the year. What would you do if someone you loved sat down with you one night and calmly told you that they were going to end their life before morning?",
      "tmdbMovieId": 34760,
      "avgRating": 3.4508,
      "releaseYear": "1986",
      "numRatings": 376,
      "posterPath": "/8bpgDDGx9RK6dDBBEcBETlVPtMM.jpg"
   }
}