{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "san diego",
            "id": 1768
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "single mother",
            "id": 14768
         },
         {
            "name": "mother daughter relationship",
            "id": 240315
         }
      ],
      "imdb_id": "tt0161023",
      "video": false,
      "title": "Tumbleweeds",
      "recommendations": [
         49803,
         18451,
         52654,
         33430,
         62677,
         91217,
         41386,
         48918,
         43232,
         61280,
         19362,
         63437,
         27397,
         36046,
         71881,
         28029,
         54794,
         43047,
         92968,
         41166
      ],
      "backdrop_path": "/wGWn7Hc4lbB77NYMEM1wsICJnHJ.jpg",
      "revenue": 1281176,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Mary jo Walker",
               "gender": 1,
               "credit_id": "52fe48bcc3a36847f8176aa9",
               "name": "Janet McTeer",
               "profile_path": "/fVxhoT9udQl9UFXe3qa9cbUq3h4.jpg",
               "id": 47627,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Ava Walker",
               "gender": 1,
               "credit_id": "551bc479c3a368766c002a65",
               "name": "Kimberly J. Brown",
               "profile_path": "/cjowbswZrv8M3kmZ25Yv2Tg1UPC.jpg",
               "id": 43893,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Nurse",
               "gender": 1,
               "credit_id": "58117f0692514152d5010907",
               "name": "Jennifer Paige",
               "profile_path": "/kLG2SmLWVGwp3m4CmzgH0q2LJDP.jpg",
               "id": 1700177,
               "order": 2
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe48bcc3a36847f8176aa5",
            "name": "Gavin O'Connor",
            "profile_path": "/zf3MHvbf2uKC4UbsuFHQYLz48g.jpg",
            "id": 77003,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.078906,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 55123,
      "vote_count": 14,
      "budget": 312000,
      "overview": "A woman constantly runs from town to town with her 12 year old daughter to escape failed relationships. The film opens with one escape and the shift into a new start in San Diego. There Mom takes up with a controlling trucker and fights with her weirdo boss. Meanwhile, the daughter, used to making the constant shifts, finds a fit at school including getting chosen for a play lead.",
      "similar": [
         3134,
         11564,
         281,
         298312,
         133805,
         2142,
         22323,
         948,
         8810,
         483,
         1359,
         141,
         185,
         101,
         205,
         949,
         12162,
         8923,
         769,
         793
      ],
      "original_title": "Tumbleweeds",
      "runtime": 102,
      "poster_path": "/aNdLEAK48fjVPk9r6Ei6r90Itgz.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/78ilmDNTpdCfsakrsLqmAUkFTrO.png",
         "name": "Fine Line Features",
         "id": 8,
         "origin_country": ""
      }],
      "release_date": "1999-11-28",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "They ran away from everything but each other.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Gavin O'Connor"],
      "runtime": 102,
      "synopsis": null,
      "writers": [
         "Angela Shelton",
         "Gavin O'Connor"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0161023/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA5NzAzNTAwNl5BMl5BanBnXkFtZTcwMzExMzEzMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Janet McTeer, Kimberly J. Brown, Jay O. Sanders | See full cast and crew »"],
      "reviews": [
         "Mary Jo Walker is constantly on the road. She moves from state to state as one relationship ends and she heads out looking for another. Her daughter is used to the unsettled lifestyle but starts to feel at home in her new school once she gets a lead role in the school play. Mary Jo gets herself a job and a new boyfriend, trucker Jack, however how long will it be before problems put her on the road again? As a concept, this film lacks originality - the plot and the characters will be recognisable from other films, but that in itself is not a bad thing as nothing is ever totally unique (well, rarely). That said, this film still manages to be enjoyable and engaging thanks to a well written script that gives us characters and not caricatures combined with some very good performances to deliver them. The story relies heavily on the characters and this really does a good job of bringing those out to the strength of the film. It struggles towards the end with a bit of sentimentality that betrays what has gone before but mostly it is pretty true to itself. The writing allows Mary Jo to be a complex character but yet one that we can understand and sympathise with even if we can't empathise. Likewise her relationship are real rather than just being one-dimensional - with Jack we can easily see the major problems between them but we can also see what drew them together. This works because the film has the cast to deliver these characters well. McTeer was Oscar nominated for this film and she deserved t hat at least. Her thunder was stolen a year or so later by Roberts' doing a similar performance but in a bigger film (thus more kudos). She is very good and she made the film. Brown is just as good and isn't the `cute kid' that can kill movies. Sanders has the worst role and he knows it - his white knight threatens the whole film but it is not his fault. O'Conner gets the triple by being good as Jack as well as doing the business with directing and writing. Overall, I wasn't sure if I'd like this film as generally the genre doesn't always do it for me, but here the performances really bring a well written script to live. It doesn't quite know what to do with itself towards the end and risks it's integrity a bit but mostly it is very good and worth seeing.",
         "I urge all film lovers to see -Tumbleweeds-. The relatively unknown cast, director and screenwriter(s) blew me away! This film is a gift of fantastic proportions wrapped in plain, brown paper, so tear into it and see what's awaiting you beyond the simple plot of serial-monogamist mother and almost-fully-teenaged daughter fleeing the scene of yet another bad breakup, and heading West to find a new home. I was gripped by Janet McTeer's powerful performance, and unusual character, from the first scene. I cannot imagine anyone not being similarly bowled over. The supporting cast will also surprise and delight you--why can't all young actors be as natural as Kimberly Brown? Rent it today! :-)",
         "The other review of this film misses the point entirely. There is indeed tension, of the emotional variety, between daughter and mother. The child is the adult and the adult is child-like. One always hopes for the mother to make the right decision, to turn her and her daughter's life around. The performances are of the highest caliber, as is the writing, and the direction complements both beautifully, never getting in the way of the simple story. Watch this with a parent, a son, a daughter...a rewarding viewing experience.",
         "The premise of a film about a mother and 12 year-old daughter on the road is not necessarily attractive to everyone. But this was a refreshing example of the genre, mainly because the director allowed character development. Mother and daughter have characteristics both endearing and infuriating (like all of us; something that Hollywood so often forgets) and, as a result, we're not forced to take sides with one against the other. Rather we find ourselves looking out for opportunities for them to both lead a more stable existence. Inevitably in a film of this nature there must be a great temptation to play on sentimentality and help boost Kleenex sales. But fortunately that doesn't happen; in fact the only tearful moment comes from one of the male characters recounting the loss of his wife. The two leads react well to each other, something which was essential for the film to work. An entertaining approach to the genre for which the viewer doesn't have to suspend rationality.",
         "I must admit that I didn't really look forward to this movie. I mean, a movie with a story about a mother and daughter on the run for an abusive husband, is there a bigger cliché in the history of Hollywood? I really don't think so. This is the stuff bad TV-movies, which have only one intention and that is to make the average housewife cry her eyes out, are made of. I only gave it a try because I didn't have much better to do and was only thinking about watching the first 15 minutes, just in order to be sure that it was one of the many. But guess what, I finished it. That already says it all, but for those who are interested, I'll also explain why I liked it. Every time her relationship fails, Mary Jo Walker runs from town to town and from state to state with her 12 year old daughter. And every time she promises herself and her daughter that everything will be different this time. Now she will look for a decent man who will love them forever. They decide to go to San Diego. But before they get there, their car breaks down and they need the help of a trucker to fix it. Mom immediately sees a new candidate husband in him, but her daughter already sees what is about to happen. He's the same kind of guy as always, mom will fall in love again and tell that this one is different, but will end up running from him like she has always done. And indeed, that's the way it happens, but this time Ava, doesn't want to leave anymore. She has made friends at school and will soon act in a school play... Even though this movie was rather predictable and far from original, I admit that I had a good time watching it. The story isn't the reason why I liked it so much, although it could have been a lot worse. The fact that Ava wasn't the 'cute and lovely' kid who will bring her mother on the right track again by organizing a romantic date with a great man sure had a lot to do with the fact that I still enjoyed the story. But in the end it's still the acting that really did it for me. Janet McTeer was really excellent as the runaway mom and together with Kimberly J. Brown, who played Ava, she formed an excellent team. Overall this is a nice movie that sure is a lot better than what I expected. Yes, I even liked it and no I'm not a middle-aged housewife. It just wasn't too corny and had some very fine performances to offer. That's also the reason why I give this movie a rating in between 7/10 and 7.5/10.",
         "A Southern woman (excellent Oscar nominee Janet McTeer) leaves an abusive relationship and hits the road with her young daughter (Kimberly J. Brown) looking for the man of her dreams. Of course though McTeer's dreams are foggy and incoherent when it comes to the opposite sex. She has a love affair with a moronic trucker (director Gavin O'Connor), finds friendship with co-worker Jay O. Sanders and dodges advances from old perverted boss Michael J. Pollard. Shades of Martin Scorsese's \"Alice Doesn't Live Here Anymore\" as this is basically a road trip picture for the fairer sex. McTeer is amazing and totally believable as an American from the wrong side of the tracks (she is a classically-trained Brit in reality). The quirky situations and hilarious moments make up for the picture's helter skelter screenplay and prodding tone. 4 stars out of 5.",
         "In \"Join Together,\" the Who sang, \"It's the singer, not the song/That makes the music move along,\" and that can be true of certain kinds of movies as well. TUMBLEWEEDS is surely not the first mother/daughter film ever made, even this year. I haven't seen ANYWHERE BUT HERE yet(though the novel it was based on is quite good), but TUMBLEWEEDS distinguishes itself from the crowd by its attention to detail and character, and the performances. Director/co-writer(with ex-wife Angela Shelton) Gavin O'Connor makes San Diego come alive, from the office Mary Jo(Janet McTeer) works in, to the beach, and the small houses she and her daughter Ava(Kimberly Brown) end up living in. And except for perhaps Mary Jo's boss(well-played by Michael J. Pollard), who is a caricature(albeit a funny one), every character here is well drawn. Even Jack(O'Connor), the trucker Mary Jo ends up with in San Diego who later turns bad, is well-drawn; we're never meant to see him as completely bad, though he does have his darker side. But the real reason to see this is the performances of the two leads. McTeer and Brown are fresh faces to movie audiences, which means they have no image to distract us from the story, but it also means they bring nothing we know from them to the part, so they have to start fresh. And they respond with wonderful and realistic performances. McTeer doesn't turn Mary Jo into the stereotype of an oversexed woman or the insufferably noble mother but as a woman who wants to do right but isn't always sure how. And Brown doesn't make Ava overly cute or precocious, but a recognizable kid who nevertheless has to be the adult at times. The two of them also have a terrific bond together as well, and like a character late in the film they meet, O'Connor the director knows enough not to intrude on that. One last note; some comments have dismissed this entirely because it's familiar. Are you the same people who will gladly see a hundred SLEEPLESS IN SEATTLE clones or THE MATRIX clones and not complain about them being familiar? As I said at the top, sometimes the telling can distinguish a familiar tale.",
         "British actress Janet McTeer gives a convincing, first-rate performance as a Southern woman and man-lover who can't find a good man to love. She and her pre-teen daughter drive from one state to the next, lighting in a motel-room somewhere until a local romance blooms--and then high-tailing out of town when it predictably blows up. Soon after arriving in Southern California, McTeer's Mary Jo Walker finds a decent job, begins making friends, and sees her daughter excelling in school for the first time; however, a new relationship with a sexy but volatile trucker may put everything on the rocks. What starts out as a generic road movie--with hints of \"Alice Doesn't Live Here Anymore\" besides--becomes an absorbing, intimate character portrait. McTeer (who resembles Laurie Metcalf) isn't your typical tramp or \"lover of life\"; she isn't unstable, and she's a good mother, but what she's trying so hard to get (a husband and a real home) doesn't always respond to her in kind. We see Mary Jo trying her damnedest to make her life work, eventually falling into familiar patterns but this time learning from her mistakes. The finale is rose-colored and probably not credible, but the optimistic nature of director Gavin O'Connor's screenplay (co-written with Angela Shelton), as well as his perceptive direction, makes the journey a fun, embraceable ride. **1/2 from ****",
         "Janet McTeer's multi-faceted performance makes this otherwise predictable character study a must-see for serious acting buffs. As a native Southerner, I have suffered through more hideous attempts at Southern accents than I care to remember, but McTeer nails the accent right down to the complicated vowel sounds and makes it seem utterly natural. The story runs out of gas in the final third, and the \"Winnebago ex machina\" element comes out of left field, but why quibble? McTeer is absolutely phenomenal, bringing far more complexity to the role than is written on the page.",
         "This is the kind of low-budget film that truly proves that a small story can be much more meaningful than a larger one! A woman constantly runs from town to town with her 12 year old daughter to escape failed relationships. You can predict the whole movie and ending easily. The directing, music, editing, etc are not focused on at all. My girlfriends and I were so excited to see this movie, thinking it was going to be a fun movie. But it will either surprise or disappoint you, depending on what your expectations are. The plot is not as well thought out as the original script, but it still does the cast well. It's fun watching it and it warrants 7/10."
      ],
      "genres": [
         "Drama",
         "Comedy"
      ],
      "productionCompanies": [
         "Spanky Pictures",
         "Solaris",
         "River One Films"
      ],
      "summaries": ["A woman constantly runs from town to town with her 12 year old daughter to escape failed relationships. The film opens with one escape and the shift into a new start in San Diego. There Mom takes up with a controlling trucker and fights with her weirdo boss. Meanwhile, the daughter, used to making the constant shifts, finds a fit at school including getting chosen for a play lead."],
      "budget": 312000
   },
   "movielensId": 3118,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-11-28",
      "dvdReleaseDate": "2000-04-11",
      "directors": ["Gavin O'Connor"],
      "runtime": 102,
      "movieId": 3118,
      "title": "Tumbleweeds",
      "mpaa": "PG-13",
      "actors": [
         "Janet McTeer",
         "Kimberly J. Brown",
         "Jennifer Paige"
      ],
      "imdbMovieId": "0161023",
      "originalTitle": "Tumbleweeds",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["WhV3uzr6sZ8"],
      "plotSummary": "A woman constantly runs from town to town with her 12 year old daughter to escape failed relationships. The film opens with one escape and the shift into a new start in San Diego. There Mom takes up with a controlling trucker and fights with her weirdo boss. Meanwhile, the daughter, used to making the constant shifts, finds a fit at school including getting chosen for a play lead.",
      "tmdbMovieId": 55123,
      "avgRating": 3.45025,
      "releaseYear": "1999",
      "numRatings": 402,
      "posterPath": "/aNdLEAK48fjVPk9r6Ei6r90Itgz.jpg"
   }
}