{
   "tmdb": {
      "original_language": "it",
      "keywords": [
         {
            "name": "suicide",
            "id": 236
         },
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "mass murder",
            "id": 1583
         },
         {
            "name": "wheelchair",
            "id": 2564
         },
         {
            "name": "psychopath",
            "id": 6259
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "squid",
            "id": 9968
         },
         {
            "name": "gore",
            "id": 10292
         },
         {
            "name": "serial killer",
            "id": 10714
         },
         {
            "name": "skinny dipping",
            "id": 13078
         },
         {
            "name": "extreme violence",
            "id": 14687
         },
         {
            "name": "maniac",
            "id": 14805
         },
         {
            "name": "violence",
            "id": 14819
         },
         {
            "name": "axe murder",
            "id": 157758
         },
         {
            "name": "video nasty",
            "id": 189921
         },
         {
            "name": "axe",
            "id": 225938
         },
         {
            "name": "proto-slasher",
            "id": 233450
         }
      ],
      "imdb_id": "tt0067656",
      "video": false,
      "title": "A Bay of Blood",
      "recommendations": [
         28055,
         28050,
         28043,
         20465,
         5482,
         5485,
         20115,
         49361,
         39982,
         6591,
         20345,
         63025,
         5483,
         28041,
         27632,
         67087,
         19204,
         28051,
         27346,
         28049
      ],
      "backdrop_path": "/1uTsElgkaNwU1onA8ypDVZpjQPf.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Renata",
               "gender": 1,
               "credit_id": "52fe4408c3a36847f807e593",
               "name": "Claudine Auger",
               "profile_path": "/lFw5lRx5oY5CKOJkzhQe9EPDy3C.jpg",
               "id": 9919,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Albert",
               "gender": 2,
               "credit_id": "52fe4408c3a36847f807e597",
               "name": "Luigi Pistilli",
               "profile_path": "/85bLFJaFDEF2Ae1KhXWycwCRogG.jpg",
               "id": 5814,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Simon",
               "gender": 0,
               "credit_id": "52fe4408c3a36847f807e59b",
               "name": "Claudio Camaso",
               "profile_path": null,
               "id": 44987,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Laura",
               "gender": 0,
               "credit_id": "52fe4408c3a36847f807e59f",
               "name": "Anna Maria Rosati",
               "profile_path": "/7OenfHPrKiivd02hok1SOXWlkkc.jpg",
               "id": 44988,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Frank Ventura",
               "gender": 2,
               "credit_id": "52fe4408c3a36847f807e5a3",
               "name": "Chris Avram",
               "profile_path": "/cDWaHpOmE9o59bFbVJ7DNYHueI.jpg",
               "id": 27382,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Paolo Fossati",
               "gender": 2,
               "credit_id": "52fe4408c3a36847f807e5a7",
               "name": "Leopoldo Trieste",
               "profile_path": "/3DEbCzT2gL4ebP4zAYROH0QWeGA.jpg",
               "id": 14151,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Anna Fossati",
               "gender": 1,
               "credit_id": "52fe4408c3a36847f807e5ab",
               "name": "Laura Betti",
               "profile_path": "/z1gRI0KcshCyTGBm10Hgp5FUslO.jpg",
               "id": 7710,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Brunhilda",
               "gender": 0,
               "credit_id": "52fe4408c3a36847f807e5bb",
               "name": "Brigitte Skay",
               "profile_path": "/4cev942jTxxDt9inMnnq8TY2A1u.jpg",
               "id": 44978,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Countess Federica Donati",
               "gender": 1,
               "credit_id": "52fe4408c3a36847f807e5bf",
               "name": "Isa Miranda",
               "profile_path": "/aemPrhfj61GQYQuxeds5frqDCiW.jpg",
               "id": 31696,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Denise",
               "gender": 1,
               "credit_id": "52fe4408c3a36847f807e5c3",
               "name": "Paola Montenero",
               "profile_path": null,
               "id": 1162494,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "Renata and Albert's Daughter",
               "gender": 0,
               "credit_id": "52fe4408c3a36847f807e5c7",
               "name": "Nicoletta Elmi",
               "profile_path": "/zWYK5425ecjzwkA7mmJHA6A6Z8E.jpg",
               "id": 29920,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "Renata and Albert's Son",
               "gender": 0,
               "credit_id": "52fe4408c3a36847f807e5cb",
               "name": "Renato Cestiè",
               "profile_path": null,
               "id": 548190,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4408c3a36847f807e565",
               "name": "Mario Bava",
               "profile_path": "/7IAC3ab2HeveW537a3bymiDrVce.jpg",
               "id": 25826,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4408c3a36847f807e56b",
               "name": "Filippo Ottoni",
               "profile_path": null,
               "id": 44984,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4408c3a36847f807e571",
               "name": "Giuseppe Zaccariello",
               "profile_path": null,
               "id": 44985,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4408c3a36847f807e577",
               "name": "Mario Bava",
               "profile_path": "/7IAC3ab2HeveW537a3bymiDrVce.jpg",
               "id": 25826,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4408c3a36847f807e57d",
               "name": "Stelvio Cipriani",
               "profile_path": "/lMk2Iwbq2RcvCZd9UJw0QtT74VZ.jpg",
               "id": 29501,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4408c3a36847f807e583",
               "name": "Carlo Reali",
               "profile_path": "/fc5LTUaduPG1U24UB7jqQgg12j6.jpg",
               "id": 44967,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4408c3a36847f807e589",
               "name": "Mario Bava",
               "profile_path": "/7IAC3ab2HeveW537a3bymiDrVce.jpg",
               "id": 25826,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4408c3a36847f807e58f",
               "name": "Sergio Canevari",
               "profile_path": null,
               "id": 44986,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe4408c3a36847f807e5b1",
               "name": "Franco Barberi",
               "profile_path": null,
               "id": 1089678,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe4408c3a36847f807e5b7",
               "name": "Dardano Sacchetti",
               "profile_path": "/gAOsap6fh6S9WBTR6iSX0jSLIxX.jpg",
               "id": 44957,
               "department": "Writing",
               "job": "Story"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 5.970375,
      "production_countries": [{
         "iso_3166_1": "IT",
         "name": "Italy"
      }],
      "id": 5486,
      "vote_count": 80,
      "budget": 0,
      "overview": "An elderly heiress is killed by her husband who wants control of her fortunes. What ensues is an all-out murder spree as relatives and friends attempt to reduce the inheritance playing field, complicated by some teenagers who decide to camp out in a dilapidated building on the estate.",
      "similar": [
         10781,
         12619,
         74997,
         45569,
         12662,
         9373,
         8090,
         10692,
         10285,
         281957,
         588,
         979,
         238636,
         434873,
         69578,
         341006,
         27328,
         39988,
         3134,
         310137
      ],
      "original_title": "Reazione a catena",
      "runtime": 84,
      "poster_path": "/tgtNELlRmnfvpIrBSv2Wekw7wpM.jpg",
      "spoken_languages": [{
         "name": "Italiano",
         "iso_639_1": "it"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Nuova Linea Cinematografica",
         "id": 1920,
         "origin_country": ""
      }],
      "release_date": "1971-08-08",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "They came to play, they stayed to die.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mario Bava"],
      "runtime": 84,
      "synopsis": "At a remote mansion overlooking a vast, empty bay lake, Countess Federica (Isa Miranda), wheels herself through her dark, empty house. She sorrowfully looks out her window at the rain when Filippo Donati (Giovanni Nuvoletti), her husband, appears and murders her by wrapping a noose around her neck and kicks her out of her wheelchair. The countess cannot stand on or move her useless legs and is strangled to death. But then Filippo is then murdered by a unseen killer who jumps out at him from behind a curtain, and drags his body away. The presence of a suicide note, stolen from the countess' diary, leads the police to believe that she has killed herself. Several days later, Frank Ventura (Chris Avram), a real estate agent, and his secretary/lover Laura (Anna Maria Rosati) are in bed discussing their plans to take over Countess Federicas property following her murder. They both realized the bay's potential to fetch a large price on the estate market, and they are the ones who have convinced Donati to murder his wife. All that Ventura needs to take control of the bay is Donati's signature on some paperwork, although he does not realize that Donati too has been murdered. Ventura plans to go to his cottage, which adjoins the desired property, to meet with Donati. Laura, jealous of Ventura's obsession with the property, asks to come along. When he tells her to stay put, she complains that he enjoys making her life miserable. Ventura tells Laura about a 'squonk' which is mystical creature who is crafty, but never stops whimpering. Laura understands the analogy and agrees to be patient. Back at the bay, Paolo Foscari (Leopoldo Trieste), an entomologist who owns a small house on the grounds, is hard at work trying to capture an insect. He runs into Simon (Claudio Volonte), a handyman who also lives on the property and makes a living by catching squid in the bay. During their conversation, Foscari suggests that the countess might have been murdered. Very defensively, Simon replies that the police ruled it a suicide. Foscari sarcastically replies that it was a suicide before running off to catch more insects. Meanwhile, four rowdy teenagers, Brunhilda (Brigette Skay), Denise (Paola Rubens), Duke (Guido Boccaccini), and Robert (Roberto Bonanni), arrive at the bay for a day of partying and fun. The trouble-making teens break into Ventura's vacant cottage to steal some liquor and smoke some dope. While Denise and Duke retreat to a nearby bedroom for sex, Robert, makes a fire in the fireplace, while Brunhilda goes swimming in the bay. There, she accidentally discovers the badly decomposed body of Filippo Donati floating under water. In a panic state, she runs out of the water, quickly dresses, and runs back to the cottage to tell the others of her find, only to get chased and attacked by a unseen maniac wielding a large billhook, who catches up to her and slashes her throat. Robert is next when he opens the front door of the cottage after hearing a noise and is whacked in the face with the same billhook. The unseen killer takes a fisherman's spear, and kills both Denise and Duke by impaling them in bed while they are in the middle of sex. As night falls on the bay, Renata (Claudine Auger), Donati's estranged daughter, arrives in a mobile home with her weak-willed husband Albert (Luigi Pistilli), hoping to lay claim to the bay estate. Leaving their two young children asleep in their camper, the couple pay a visit to Foscari and his wife Anna (Laura Betti), a fortune teller and tarot reader with a very supercilious nature. Sitting down for tea, Anna slyly insinuates that the countess' death was probably Renata's father's doing, and that Simon may be the one to inherit the property. Shocked to discover that she has a half-brother, Renata leaves with Albert who tells him that Simon will have to be disposed of. Renata and Albert meet with Simon to talk with him about the countess' death when they discover the badly decomposed body of Donati's in Simon's boat. Simon claims to have only found the body floating in the bay and will inform the authorities. Renata and Albert flee to stop at Venturas cottage hoping to meet with him, but find it apparently deserted. When Albert walks away for a moment, Ventura suddenly appears and attempts to kill Renata. She runs into the bathroom where she discovers the four mutilated, dead bodies of the teenagers. But Renata gets the upper hand by grabbing a pair of scissors, and stabbing Ventura. This is accidently witnessed by Foscari, and when he runs back to his house to call the police, Albert follows him there and strangles him to death. When Anna, hearing the commotion at Ventura's cottage, arrives there and gets decapitated by Renata weilding an rafting axe. Frightened by the aura of violence around him and disgusted with himself for killing an innocent man, Albert tries to persuade Renata to make a run for it. But the murderous Renata tells Albert that she has no intention of giving up when she's so close to inheriting the bay. She also reminds Albert that they still have to kill Simon. Things gets more complicated when Laura shows up at the bay looking for Ventura, when she stumbles into Simon's shack on the bay where he appears and threatens her with a machete. It is revealed by Simon that Ventura hired him to murder Filippo Donati with the promise that Ventura will give him his share of the property and money to leave the country. Simon really is the countess illegitimate son who was supported by his mother all this time and the one who murdered the four teenager after one of them discovered the body of Donati since he was ordered by Ventura not to let Donati's death be made public knowledge until after Simon inherits the bay. Furious at Laura when he finds out that she and Ventura were responsible for Donati murdering his mother, he attempt to kill her too. But at first Laura gets the upper hand by throwing a pot of boiling water on Simon, scalding his face. But he quickly recovers and strangles her with his bare hands. Simon then goes after both Renata and Albert hiding out in the property. But then Albert turns the tables on Simon by impaling him to a wall with the same fisherman's spear Simon used to kill two of the teens. With Simon finally taken care of, Renata and Albert search the countess' house for the missing will which has the listings of beneficiaries. But then Ventura, who was presumed to be dead, shows up and attempts to kill both of them, but is then dealt with by Albert who kills him for good. The next morning, with all the loose ends tied up and the countess will burned, Renata and Albert plan to return home to wait for news of her inheritance of the bay. But in an ironic twist, both Renata and Albert are shot to death by the very own neglected children, who playfully point a loaded shotgun at their parents and shoot them both down. The little girl says to her brother, \"Gee, they sure are good at playing dead, aren't they?\" The sister and brother then run out of the camper to playfully skip some stones by the water.",
      "writers": [
         "Franco Barberi",
         "Mario Bava"
      ],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0067656/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjExMzc5MjUzMV5BMl5BanBnXkFtZTcwMjUyNDQzMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Claudine Auger, Luigi Pistilli, Claudio Camaso | See full cast and crew »"],
      "reviews": [
         "BAY OF BLOOD (or TWITCH OF THE DEATH NEVER) is a brilliant film. The idea behind it is original and it's still a one-of-a-kind flick, even if the movie itself inspired a gazillion slashers. Regarded as the granddaddy of slashers, BAY OF BLOOD has a unique concept behind it that none of its duplicators have successfully copied: the concept of people being murdered one by one, not by just one killer but by several killers, in very gruesome ways, all in the name of super dry, jet black comedy. There's something surprisingly stealthy about Mario Bava's approach to the deliberately confusing story. Throughout the labirynth like story-line, we bounce from one character to the next, never having enough time to get to know the people in the movie to care enough for them and when they are killed, their deaths suddenly take a surprisingly modern twist. Unlike most slashers out there, like FRIDAY THE 13TH or even HALLOWEEN and their endless sequels, many critics have said that in order for the horror element in those movies to work, you have to care about the people getting killed. Many critics have dismissed the whole slasher genre just on that basis: the films are not horrifying because the people getting killed either deserve it because they're annoying or the acting was really bad, or just because the writing was terrible and the characters were just token characters and it's not scary to see token, cardboard characters getting killed. Well, in BAY OF BLOOD, the ingeniously scripted story transcends this. The characters in BOB are not really deep or even memorable but their introduction to us, the viewer, is so quick and their deaths are so gruesome and so sudden and unexpected that the fact we know little about them hardly matters. It hardly matters because the killings aren't being made by a single killer with a singular reason but by several killers, whom all have a confusing number of reasons (which can all be traced to greed), with few of the killers knowing that others are also killing other people at the same time and as the film progresses, the killers, in turn, also become victims themselves. This is the brilliant aspect of BOB. People just kill each other left and right in a neverending succession of blood and violence, each people completely indifferent to each other. Watching this made me giggle and wince. The story cannibalises itself repeatedly, every ten minutes or so, snowballing into an all-out blood bath. The effect this creates is like being trapped inside a time-loop, in which the same thing happens over and over AND over again. Combine this with the fact that the story's actions happens mostly within a brief time-line (except for the beginning, everything happens on the same day) BUT that it also goes back and forth in time, with flashbacks and such, and BOB, oddly enough never feels grounded to one specific time. The killings in BOB feel different than anything I've ever seen in a horror film. Each killing is seemingly detached from the story itself and the film takes an all new unique approach, as the deaths come to the fore while the rest fades in the background. It almost feels like we're watching the killings happen \"live\". There isn't a single lone female survivor, or a surprise ending like most horror films (there is a surprise ending in BAY OF BLOOD but it's not a killer coming back to life). The acting is good but the cast is mostly anonymous (deliberate?). Except for Claudine Auger, the rest of the cast seemingly all meld together. The location and sets were also good. Only the music was inappropriate at times and the cinematography was sometimes annoying, with Bava's constant use of out-of-focus shots, which I don't like at all. My favorite scene in BOB is the one when Claudine Auger goes to the bathroom. Arf!!! Though I consider BAY OF BLOOD to be brilliant, the film is dated and there's a certain aloofness to it that even if it serves the story to a certain extent, this aloofness is carried to an unfortunate extreme which makes the film feel not as \"passionate\" as it could have been or should have been. I guess aloofness is a Bava trademark, which is one of the reasons why I'm not a big Bava fan. Except for HATCHET FOR THE HONEYMOON, I've haven't been impressed by most of his films. Well, BAY OF BLOOD has impressed me a lot and I have to say that it's probably my favorite Mario Bava film, along with HATCHET. All in all, I think BAY OF BLOOD is a unique, one-of-a-kind gruesome movie. Anyone who didn't like it just didn't get it.",
         "This is one of Bava's few films where everything works. It does exactly what it sets out to do. The minimalistic script makes no attempt at either character motivation or logic, but serves merely as an engine for the 13 bloody murders. Here the main pleasure, as in all subsequent body count movies, is in seeing in which new and inventive manner the next murder will be committed, but as usual, it is Bava's visual style which sets this film above Friday 13th and all it's imitators, as well as a knowing sense of humour and a pounding jazzy soundtrack. Here Bava's style is refined and reduced ad absurdam, with intermittent atmospheric interludes making use of the natural features of the landscape, from slow pans across the horizon, focus pulls through the foliage, and rapid zooms in and out of each bloody murder. It is true that the script loses its footing in the final quarter, unable to maintain the intensity throughout, but that fact notwithstanding, this is one of the finest films of its genre.",
         "Many films on the Video Nasty list are horror cinema's answer to well-respected classics; The Last House on the Left offers a new spin on Ingmar Bergman's The Virgin Spring, Island of Death is a more brutal telling of the story of Bonnie and Clyde and, indeed, this Mario Bava film owes its plot to the French classic, La Ronde. Bay of Blood is often noted as being an obvious inspiration on the Friday the 13th series, and when taking things such as the setting and a certain murder sequence into account, that is certainly true; but let's not forget that this is also a fantastic movie in its own right. The film starts off with a glorious sequence that opens inside a beautiful manor house. We watch as a wheelchair-bound baroness is brutally strangled, only for the rug to be torn from under us moments later when her assailant is the next one to bite the bullet! It has to be said that the film never tops its opening sequence, but Mario Bava's gore-fest manages to remain fascinating all the way through, as it turns out that the first murder scene sets off a violent chain of events that results in a very high body count. This film would be properly categorised as a slasher, but its Italian roots ensure that it's often labelled a Giallo, and indeed Mario Bava does include Giallo elements; from black gloved killers and an array of odd characters, all the way to an amazingly convoluted plot. Indeed, the storyline here gets so complicated at times that it's liable to give the viewer an extreme headache, but Bava is always on hand with another glorious murder scene, and as the film features thirteen deaths in it's eighty one minute running time - there's certainly no lack of the red stuff. Bava ensures that the murders are suitably varied, and we get treated from an array of methods of dispatch, including axes, a spear through a lovemaking couple and an excellent scene that sees someone skewered to a wall. Mario Bava's eye for detail doesn't wane with this film, as despite being a grisly slasher; there's still more than enough time for beautiful scene setting. The bay itself looks great and excellently lends itself as a location for savagery, while the decors of the character's homes are elaborately Gothic. With the pitch-black ending, the director shows us that the film isn't meant to be taken seriously, and overall, Bay of Blood is both influential and a great time - and therefore shouldn't be missed by horror fans.",
         "A handicapped and wealthy countess, who owns the lands of a disputed bay, is hanged by her husband and he is immediately killed. The crime scene is forged to simulate a suicide of the old woman. Later, two young couples are murdered in the bay. The inheritors of the fortune of the countess want the possession of the place and kill each other, in a bloodshed bath in the area. \"Reazione a Catena\" is a gory slash movie with a different characteristic: there is no serial killer, but almost a chain reaction of murders. The deaths are motivated by the greed of different persons, and their motives are based on the interest of the civil construction in the ecological area, and the reluctance of the elder countess in selling her property. None of the character is innocent, except the two young couples that arrive in wrong the place for fun. The camera, with many closes and movements, is quite different. The black humor is very sharp; most of the deaths are very original and the conclusion is silly. The copy of the Brazilian VHS is a little dark, but it is watchable. My vote is seven. Title (Brazil): \"Banho de Sangue\" (\"Blood Bath\") Note: On 06 July 2009, I saw this movie again on DVD.",
         "A Bay of Blood aka Twitch of the Death Nerve is something of an endurance feat that seems more interesting for its influence on the splatter movie genre (in particular the Friday the 13th series) than as a film. It's light on plot for a giallo, being little more than a collection of gruesome sudden deaths, some, like the opening murder of a woman in a wheelchair, imaginative, others less so, all related to various unpleasant characters out to control the rather grotty looking bay of the title to either redevelop it or preserve its natural beauty. The plot is largely thrown away in a series of flashbacks in the last couple of reels, but seems little more than an excuse for the killings, which are exercised with surprisingly little atmosphere: until the finale there's no real build up or suspense, just multiple murders from multiple murderers. There's also surprisingly little flair to it all, leaving a film that's not much better than the very average splatter movie. Still, at least there's some fun to be had from a duplicitous lawyer being dubbed in the American version by someone doing what sounds like a Gregory Peck impersonation.",
         "Largely cited as the inspiration behind Carpenter's Halloween (1978), Cunningham's Friday the 13th (1980) and the hundreds of countless other gory slasher movies, this is an entertaining horror film from Mario Bava, who is probably the greatest of the Italian genre directors. He is also an incredibly talented cinematographer, as you can tell with many clever, artistic touches and how his camera looms for some time over the tranquil lake-front setting in between the very graphic murder sequences. This is an art concept; coupling savagery and the ills of man (greed, lust) with the beauty and serenity of nature, with loud shrieks occasionally piercing through the calm. It's a shame that the later copycats failed to realize the potential found here. There's a high enough body count and creative kills to entertain most fans of these type of movies. If you try to deeply analyze the plot, you will be somewhat disappointed. But if you can appreciate this as a colorful piece of the macabre, you will love it. There are several jump-out-of-your-seat moments (the best being a surprise awaiting a man who opens his front door) and a truly nasty neck slashing. There's also some brief nudity. The ending is a huge surprise, but definitely more than a little hard to swallow. Then again, this sense of playful parody helps to diffuse some of the gore. If you love horror films, I recommend this one!",
         "Ok I will admit that this film has some gory and creative kills...but where is the darn plot? The body count is extremely high, but there is nothing to hold all those kills together, which led me to just watch the film in fastforward to get to all the points where people get killed. Also, I would say that the ending is very contrived, and not pleasing one bit. To say the least, it was very random and not even with the rest of the story such as it is. Even though the rating is somewhat high for this flick avoid it, methinks people just like it because its Italian, however for me thats just not enough!",
         "\"Bay of Blood\" is the (complicated) story of a countess being murdered by her husband, and then the husband is murdered by an unseen attacker. Soon, a killer begins stalking people in the bay area, but are the murders just random or is there a purpose for all the carnage? First off, this movie was pretty confusing. It wasn't until the end that I fully understood what was going on. However, the setting is beautifully eerie and the film has several peaceful shots of the bay at sunset (Usually after a grisly murder). I do love this film's style and the direction by Mario Bava make this an above-average horror film. Check it out. Not Rated: contains Violence, Gore, and Nudity. Grade: B",
         "Mario Bava's ultra-violent black comedy is mainly a satire on human greed - with one person killing another to gain the inheritance of a recently deceased woman. Opening with a double murder, the film has proved to be highly influential, with many contemporary slasher movies (among them various segments of the \"Friday The 13th\" series) replicating some of it's key death sequences. While Carlo Rambaldi's superbly well-done gore effects retain their shock value (and they assured that the film went onto the infamous \"video nasties\" list), it's Bava's gorgeous cinematography that steals the show and proves once again that the great Italian director did not just make horror movies - he made genuine art.",
         "DVD/Video title: Bay of Blood. This was a tough call, but I only gave this a 5. I love horror movies and I love explicit gore but... The film is well-directed by Mario Bava and has a beautiful score. Also the murders are suspenseful and (occasionally) very gory. But there's a boring plot and LOTS of padding (a girl goes skinny-dipping for no reason; lots of shots of people walking down paths, through houses, through rooms, etc etc etc.) which adds nothing to the film. Basically it just bides the time between murders. Also the dubbing is atrocious and the acting ranges from OK to unbelievably bad. I need a plot or some good acting to go with the gore--this doesn't have either. Also Bava once referred to this film as \"a piece of s***\". What does that tell you? Still, it's historically important as the first slasher/body count film. But what a let-down!"
      ],
      "genres": [
         "Horror",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": ["Nuova Linea Cinematografica"],
      "summaries": ["An elderly heiress is killed by her husband who wants control of her fortunes. What ensues is an all-out murder spree as relatives and friends attempt to reduce the inheritance playing field, complicated by some teenagers who decide to camp out in a dilapidated building on the estate."],
      "budget": 0
   },
   "movielensId": 3119,
   "movielens": {
      "languages": ["Italiano"],
      "releaseDate": "1971-08-08",
      "dvdReleaseDate": "1999-11-16",
      "directors": ["Mario Bava"],
      "runtime": 84,
      "movieId": 3119,
      "title": "A Bay of Blood",
      "mpaa": "R",
      "actors": [
         "Claudine Auger",
         "Luigi Pistilli",
         "Claudio Camaso",
         "Anna Maria Rosati",
         "Chris Avram",
         "Leopoldo Trieste",
         "Laura Betti",
         "Brigitte Skay",
         "Isa Miranda",
         "Paola Montenero",
         "Nicoletta Elmi",
         "Renato Cestiè"
      ],
      "imdbMovieId": "0067656",
      "originalTitle": "Reazione a catena",
      "genres": [
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "RTUI9rTMswo",
         "ZiKC1P621eI",
         "PN_L2FV9-1w"
      ],
      "plotSummary": "An elderly heiress is killed by her husband who wants control of her fortunes. What ensues is an all-out murder spree as relatives and friends attempt to reduce the inheritance playing field, complicated by some teenagers who decide to camp out in a dilapidated building on the estate.",
      "tmdbMovieId": 5486,
      "avgRating": 2.96018,
      "releaseYear": "1971",
      "numRatings": 113,
      "posterPath": "/tgtNELlRmnfvpIrBSv2Wekw7wpM.jpg"
   }
}