{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0114571",
      "video": false,
      "title": "Stuart Saves His Family",
      "recommendations": [
         36946,
         146761
      ],
      "backdrop_path": "/mOSLFtby4r6FgzP3J2CQ2JVxwc3.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Stuart Smalley",
               "gender": 2,
               "credit_id": "52fe4574c3a368484e05c005",
               "name": "Al Franken",
               "profile_path": "/ynVu5T7vxiGkpHtXF6UAxTyna4S.jpg",
               "id": 65348,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Julia",
               "gender": 1,
               "credit_id": "52fe4574c3a368484e05c009",
               "name": "Laura San Giacomo",
               "profile_path": "/xOPY9e0HN6zYmI5HrmRSbwygEzy.jpg",
               "id": 1212,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Donnie - The Smalley Family",
               "gender": 2,
               "credit_id": "52fe4574c3a368484e05c00d",
               "name": "Vincent D'Onofrio",
               "profile_path": "/lUEn7f7xCLuT1kRCHoxMTRnYKXW.jpg",
               "id": 7132,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Mom - The Smalley Family",
               "gender": 1,
               "credit_id": "52fe4574c3a368484e05c011",
               "name": "Shirley Knight",
               "profile_path": "/ehtTPcvqq91Dxl7mtlzi0xJI6KP.jpg",
               "id": 28778,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Dad - The Smalley Family",
               "gender": 2,
               "credit_id": "52fe4574c3a368484e05c015",
               "name": "Harris Yulin",
               "profile_path": "/MCW4IR3mEB6oeRbX9bfeHkZ3qm.jpg",
               "id": 1166,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Jodie - The Smalley Family",
               "gender": 1,
               "credit_id": "52fe4574c3a368484e05c019",
               "name": "Lesley Boone",
               "profile_path": "/gqYmiWfUS2YiyNyfzs1kV2elJ4u.jpg",
               "id": 99407,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Kyle - The Smalley Family",
               "gender": 2,
               "credit_id": "52fe4574c3a368484e05c01d",
               "name": "John Link Graney",
               "profile_path": null,
               "id": 99408,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Mea C. - Chicago Public Access",
               "gender": 1,
               "credit_id": "52fe4574c3a368484e05c021",
               "name": "Julia Sweeney",
               "profile_path": "/mOl6ecUZ1F6XIh1jvPnxzkrRMXn.jpg",
               "id": 11806,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Announcer",
               "gender": 2,
               "credit_id": "52fe4574c3a368484e05c025",
               "name": "Phil Hartman",
               "profile_path": "/rf62sAab9vOjm9x7ZA0VBWDkHvD.jpg",
               "id": 14104,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Aunt Paula",
               "gender": 1,
               "credit_id": "5abcdc329251411e970241d3",
               "name": "Marjorie Lovett",
               "profile_path": null,
               "id": 154818,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Smalley Uncle",
               "gender": 0,
               "credit_id": "5abcdc700e0a2609e40262c0",
               "name": "Walter Robles",
               "profile_path": null,
               "id": 74787,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Smalley Uncle",
               "gender": 0,
               "credit_id": "5abcdca4c3a36843a6027b15",
               "name": "Erik Cord",
               "profile_path": null,
               "id": 91833,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Smalley Uncle",
               "gender": 0,
               "credit_id": "5abcdcedc3a3684379026eac",
               "name": "Denver Mattson",
               "profile_path": "/kqsx5Vq5s3tBbWuMPzGqp4rrAp.jpg",
               "id": 26737,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Young Stuart",
               "gender": 0,
               "credit_id": "5abcdd070e0a2609d2025ebd",
               "name": "Grant Hoover",
               "profile_path": null,
               "id": 2010355,
               "order": 13
            },
            {
               "cast_id": 19,
               "character": "Young Donnie",
               "gender": 0,
               "credit_id": "5abcdd520e0a2609d5027a78",
               "name": "Cory Milano",
               "profile_path": null,
               "id": 1242280,
               "order": 14
            },
            {
               "cast_id": 20,
               "character": "Young Jodie",
               "gender": 1,
               "credit_id": "5abcdd689251411e9202538d",
               "name": "Michelle Horn",
               "profile_path": "/ftqGJJ6QUmBe9M4k90vloxNNEjk.jpg",
               "id": 20847,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4574c3a368484e05bff5",
               "name": "Harold Ramis",
               "profile_path": "/dFERLL9HGBw9xGMwDQRuhUgAneI.jpg",
               "id": 1524,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4574c3a368484e05bffb",
               "name": "Al Franken",
               "profile_path": "/ynVu5T7vxiGkpHtXF6UAxTyna4S.jpg",
               "id": 65348,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4574c3a368484e05c001",
               "name": "Al Franken",
               "profile_path": "/ynVu5T7vxiGkpHtXF6UAxTyna4S.jpg",
               "id": 65348,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "573523d2c3a368025800058c",
               "name": "Nancy Foy",
               "profile_path": "/blCkmS4dqNsbPGuQfozHE6wgWBw.jpg",
               "id": 4952,
               "department": "Production",
               "job": "Casting"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.379087,
      "production_countries": [
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 28033,
      "vote_count": 8,
      "budget": 0,
      "overview": "Stuart Smalley, the Saturday Night Live character, comes to the big screen. Stuart, the disciple of the 12 step program, is challenged by lifes injustices.",
      "similar": [],
      "original_title": "Stuart Saves His Family",
      "runtime": 95,
      "poster_path": "/9EwB291UkaAHhS3m7PQ6QLizu3w.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1995-04-12",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Germany",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Harold Ramis"],
      "runtime": 95,
      "synopsis": null,
      "writers": [
         "Al Franken",
         "Al Franken"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0114571/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMwODE1MDkxOF5BMl5BanBnXkFtZTcwNTEyNzIyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Al Franken, Laura San Giacomo, Vincent D'Onofrio | See full cast and crew »"],
      "reviews": [
         "I rented this movie expecting a movie like \"A Night at the Roxbury\", \"Superstar\", or \"Coneheads\" - not a great plot or great acting, but a lot of laugh-out-loud, tasteless jokes that will cause me to feel guilty for laughing later. Not very good movies critic-wise, but I need a good tasteless comedy every now and then. However, \"Stuart Saves His Family\" is different. It had a bittersweet plot and some pretty good acting. It turned out to be a good movie. On the other hand, it wasn't tastelessly laugh-out-loud funny. In fact, I only remember laughing once in the whole movie. So did \"Stuart Saves His Family\" accomplish its goal, or did it fail miserably? I'm not quite sure. I still don't know what to think of this movie. I'd say it's worth renting just for its uniqueness.",
         "As far as SNL movies go it's definately above average, of course, that's comparing it to \"It's Pat\", \"A Night at the Roxbury\" and \"Ladies Man\"... Still... this one hits more than it misses. If you have a dysfunctional family or can identify with any of Stuart's relatives, it's worth the hour and a half.... While it won't win any awards, it should be worth an hour and a half of your time... I give it 6/10 for the average person.... 8/10 if you have a highly diversified and dysfunctional family.",
         "This movie is so much better than anything you'd expect. Needless to say, most of the films based on SNL characters are pretty lame, and this one slipped under the radar so quickly, you might assume it's another \"It's Pat\". It's not! If you like the Stuart Smalley character, you'll of course be more disposed to liking the film. But even those previously unfamiliar with the 12-step junkie will find a sweet and surprisingly honest story here -- one that both pokes fun at self-help groups and acknowledges that they can work. There are plenty of laughs; and in its treatment of Stuart's highly dysfunctional family of origin, this film achieves something near-great. Watch and see. And \"get yourself to a pound cake!\"",
         "I recently recalled the Stuart Smalley affirmation, \"I'm good enough, I'm smart enough, etc...\", as a joke in a conversation with a coworker, and felt inspired to watch this film again. Note the fact that Stuart's \"affirmation\" has the distinction of being one of those rare TV/film buzzlines that become part of American pop vocabulary, and you already have an insight to the quality and staying power of Al Franken's humor, and of this movie as well. I was delighted to find that indeed, \"Stuart Saves His Family\" was just as gut-bustingly funny as it was 10 years ago at its release. For those who care about such things, this is a film that got thumbs up and good reviews from Ebert and the late Siskel, and generally good reviews across the board. There were the token detractors. But the truth is, this is one of the better-reviewed films to come out of the SNL/Lorne Michaels franchise because it is one of the better films. The underlying joke in the film (and the Stuart character itself) is a satire of 12-step programs and the recovery \"culture\"--and there is one--and the humor admittedly is probably funnier to those connected to that culture, or to human services professionals. But even those not familiar with self-help and recovery philosophies will appreciate the humor in the blatant satire of the clichés and affirmations and even the demeanor of those who practice these philosophies. Phrases like \"shame spiral,\" \"making amends,\" \"rage-aholic,\" \"owning my anger,\" and the like, when lampooned, are simply funny in and of themselves, especially when delivered deadpan by characters like Stuart. Because there are so many of these clichés, they remain fresh and humorous throughout the film. And viewers will certainly recognize and hopefully be able to laugh with the movie at the dysfunctional qualities of their own families and friends reflected there. In a nutshell, the Stuart character is a guy involved in multiple recovery programs to correct the effects of coming from an alcoholic family. He has decided to share his wisdom through a public access cable show showcasing recovery philosophies, and as the film unfolds he faces a number of humorous crises related to his show. At the same time, his dysfunctional family undergoes a series of crises related to the death of an aunt. We are introduced to Stuart's alcoholic father, guilt-inducing mother, anxious overeating sister, and addict brother. The story that unfolds about the family's response to the crises, with their chaotic family interactions and childhood flashbacks both hilarious and touching, ends up being woven back into the drama around Stuart's cable show for a satisfying, if not all-too-realistic, resolution. The film has been lauded for being a comedy with depth, because it is at heart a story about families and relationships--all dysfunctional, of course. There are some scenes that literally are tear-jerkers in the film, dealing with the affects of alcoholism and broken relationships, as well as the hope that recovery philosophies can bring. Indeed, one of the rewarding things about the film is that the recovery culture is both the butt of the joke, and at the same time is correctly represented as having a real, positive impact in peoples' lives. Though as in real life, we find that for the Smalley family, not everything can be fixed. And that gives this film, surprisingly, a ring of authenticity. The other thing that struck me this time around was that the movie has a number of very talented actors in the supporting cast: Vincent D'Onofrio, Laura San Giacomo, Harris Yulin. Certainly this helped to carry the movie, but the screenplay is tight and the comedic timing of the dialog consistently right on. Whether you're looking for a good spoof of pop psychology and the recovery culture, dysfunctional families, or just a well-made comedy, this movie will satisfy.",
         "That doesn't sound like an accomplishment, since the best SNL movies are probably \"Blues Brothers\" and \"Wayne's World,\" and both are uneven. Furthermore, Stuart Smalley seems at first glance like one of the most obnoxious characters to base a movie around. He has characteristics that turn a lot of people off (effeminate, new agey, \"caring\"), but Franken shows that this veneer is painfully constructed over anger and hurt, and you end up actually liking him better the more time you spend with him. (The TV skits tend to just make fun of him.) One of the movie's most interesting scenes is between Franken and Laura San Giacomo when he tells her \"I love you.\" In any other Hollywood movie, this would be a romantic-interest scene, because everyone knows you can't have a male and female star in a movie without their getting together. Well, here it's that incredibly rare thing: a scene of genuine friendship and support, with Stuart's sexuality left out of the question. To me, that's more impressive than if they got into a liplock.",
         "A not-so-well-remembered SNL movie based on a not-so-well-remembered SNL sketch. I watched it last night, and I don't think I've ever seen it before so it was kind of surprising at how unfunny it was. Not necessarily in a bad way, but it just felt more like an offbeat drama than a comedy. It dealt with real issues and didn't have pristine solutions and I've left it feeling contemplative and, to be honest, a little sad, which is sort of a compliment and sort of isn't. But the acting in the movie is great. I have this idea in my head of Al Franken as this gruff, intense comedic force but here he's so soft-spoken and calm so you gotta hand it to him, the guy is COMMITTED. Laura San Giacomo is also excellent and has a heartbreaking little speech. And Vincent D'Onofrio as the pothead slacker brother is good stuff. I don't know. Not sure how I altogether feel about it. I'd probably give it a 6/10, not great but by no means bad. I think it's on Netflix. Check it out.",
         "For those you who don't know that Al Franken became a political author/congressional candidate, he was a funny comedian who had entertained \"Saturday Night Live\" audiences since the 70's, and into the 1990's (off-and-on). His most famous character was a self-help, for lack of a better word, addict; i.e., his character was addicted to self-help groups, sponsors, 12 step meetings, etc., because he lacked or was coming to terms with his low self-confidence everyday and was trying to spreading self-esteem to others through a fictional cable access show on SNL called \"Daily Affirmations with Stuart Smalley.\" He would say things like \"Doggone it, people like me.\" Okay, that's a lousy summation of an SNL character made into a film, but if I told you about two blues singing brothers who were wanted by all of Chicago ... of two rock n' roll delinquents who had their own cable show ... or two party guys whose heads moved when they heard \"What is Love ...\" ... would you know what the hell the fess is about in every case? If you want to look up Stuart on YouTube, or DVD feel free. He was funny, at times. But for this movie, know that it is both funny and sad (in a dark humor way) as we see a child of alcoholics and food addicts overcome his past, this film is a pretty damn good one. Directed by Harold Ramis, it doesn't go for any real forced SNL-inspired laughs, even though there are a lot in there if you want to look. The laughs basically occur because they come from pain, comedy's actual twin. There is a both sad and happy ending (or is it happy and sad?) from this film, but its never forced because Ramis, Franken, Vincent D'Onofrio, Juila Sweeny, and Laura San Giacomo know how to play the tightrope between pain and humor. It's not perfect, but its easily one of the best SNL character movies ever made, and one of the best about family alcoholism.",
         "This is one of best comedies of all times. The psychology of the main character is very incisive and realistic. However it is put in a grotesque context. Other characters are also very true to life or rather caricatures of certain types of people. The brother and the father of the main character seem to bring up the politically correct goofiness and dorkines of Al Franken. The Mother cuts also a very real and yet exaggerated person. The plot flows well and the whole dysfunctional family is funny and sad at the same time. The friends of Al Franken are also funny in their pseudo psychological babble and pretense. I find this film to be so good that I have bought the DVD.",
         "Whenever trying to memorialize the recently departed, I tend to seek out lesser known films by them, or at least films that I haven't seen. I'd always wanted to see this film, adapted from the Stuart Smalley sketches from Saturday Night Live. I remember Siskel & Ebert liking the film quite a bit back in the day, plus the star is now my Senator. And this is actually quite a good film. What's most surprising about it is it's actually quite serious for what it is. In fact, trying to get the serious subject to work while also trying to keep the same style of comedy the sketches had on SNL makes it a little tonally uneven, but I love what they were trying. Al Franken stars as Stuart Smalley, who hosts a cable access show called Daily Affirmations, where he reveals his many problems to his small audience and tries to work through them. As the film opens, his producer fires him. Soon after, his aunt dies so he goes back home to Minneapolis for the funeral. His family is hugely dysfunctional, with many drinking and weight problems. He tries to help. The film takes the problems entirely seriously. I mean, there is comedy, but the family dysfunction is never the butt of the joke. Al Franken is very good and the character is given more subtlety than he had on SNL. Vincent D'Onofrio plays his younger brother, Harris Yulin his father, Shirley Knight his mother and Lesley Boone his sister. Laura San Giacomo and Julia Sweeney also co-star as Stuart's friends. Not a great movie, but a nice one.",
         "surprisingly, what I thought would be a farce had some interesting depth. What's starts off as lampooning 12 step programs becomes a touching and somewhat tragic ride through recovery. Laced with humor, this is a dry, yet poignant study in recovery from 'our family of origin'. I watched this with several friends and we were stunned at the ending, namely,Stauart did not save all his family because it was their choice not to be saved. As Stuart says, he needed to move on with his life.Its easier to wear slippers than to carpet the whole world. True enough,you cannot fix others, particularly those who do not want to be fixed. Some revel in their misery or are so addicted to it some real peace would be disturbing. D'on't expect a major laugh riot here in this movie, expect the subtleties of humanity and conditions to give you a smirk, a grin,an 'aha' here and there. The real humor comes in Stuarts' journey. I salute the filmmakers for adding some really 'teary' moments.Alcoholism isn't fun. Perhapsthose touched by this disease,particularly those children (grown or not) who still ache from the hurts. You'll cheer Stauart for his own personal choices, not because he couldn't get his father into rehab."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Paramount Pictures",
         "Constellation",
         "Mont Blanc Entertainment GmbH"
      ],
      "summaries": [
         "Stuart Smalley, the Saturday Night Live character, comes to the big screen. Stuart, the disciple of the 12 step program, is challenged by lifes injustices. He loses his Public Access Cable Television Show, must beg his manipulative overbearing boss for his job back, rehabilitate his alcoholic father and drug abuser brother, and support his over-weight mother and sister in their lack of ability in handling their relationships with their husbands. Stuart is supported by his 12 step sponsors as a he regresses back to his negative behaviors each time he faces these challenges.",
         "A self-help advocate struggles to put his dysfunctional family in its place."
      ],
      "budget": 0
   },
   "movielensId": 312,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-04-12",
      "dvdReleaseDate": "2001-04-17",
      "directors": ["Harold Ramis"],
      "runtime": 95,
      "movieId": 312,
      "title": "Stuart Saves His Family",
      "mpaa": "",
      "actors": [
         "Al Franken",
         "Laura San Giacomo",
         "Vincent D'Onofrio",
         "Shirley Knight",
         "Harris Yulin",
         "Lesley Boone",
         "John Link Graney",
         "Julia Sweeney",
         "Phil Hartman"
      ],
      "imdbMovieId": "0114571",
      "originalTitle": "Stuart Saves His Family",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["RvgMIerTXl4"],
      "plotSummary": "Stuart Smalley, the Saturday Night Live character, comes to the big screen. Stuart, the disciple of the 12 step program, is challenged by lifes injustices.",
      "tmdbMovieId": 28033,
      "avgRating": 2.60822,
      "releaseYear": "1995",
      "numRatings": 1363,
      "posterPath": "/9EwB291UkaAHhS3m7PQ6QLizu3w.jpg"
   }
}