{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "business man",
            "id": 4480
         },
         {
            "name": "greed",
            "id": 5332
         },
         {
            "name": "falling in love",
            "id": 13072
         },
         {
            "name": "bribery",
            "id": 159937
         }
      ],
      "imdb_id": "tt0104114",
      "video": false,
      "title": "The Distinguished Gentleman",
      "recommendations": [
         11066,
         12158,
         8860,
         11595,
         9713,
         10136,
         11353,
         11718,
         150,
         11566,
         9099,
         9085,
         306,
         6522,
         11517,
         9292,
         9546,
         10158,
         10859,
         14361
      ],
      "backdrop_path": "/AsHtMLsGsmaWXXl5lLtFKBfFtYK.jpg",
      "revenue": 46434570,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Thomas Jefferson Johnson",
               "gender": 2,
               "credit_id": "52fe436a9251416c7500f669",
               "name": "Eddie Murphy",
               "profile_path": "/bsi706zdqs0KAPdOsqz6AkLNcFF.jpg",
               "id": 776,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Dick Dodge",
               "gender": 2,
               "credit_id": "52fe436a9251416c7500f66d",
               "name": "Lane Smith",
               "profile_path": "/js7GonfBVNHLYhaB0Xjtnm93DpH.jpg",
               "id": 65019,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Miss Loretta Hicks",
               "gender": 1,
               "credit_id": "52fe436a9251416c7500f671",
               "name": "Sheryl Lee Ralph",
               "profile_path": "/7F5p0zzzhqaNxeZZxLzGM9H3W7m.jpg",
               "id": 33613,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Olaf Andersen",
               "gender": 2,
               "credit_id": "52fe436a9251416c7500f675",
               "name": "Joe Don Baker",
               "profile_path": "/7WQq2nmSXXIC4vR3MhHLYRZD2wE.jpg",
               "id": 10671,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Celia Kirby",
               "gender": 1,
               "credit_id": "52fe436a9251416c7500f679",
               "name": "Victoria Rowell",
               "profile_path": "/3vGWTtqtqHzVTUXGqtq2dl3tbx9.jpg",
               "id": 65020,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Ellen Juba",
               "gender": 1,
               "credit_id": "56e79395c3a36840940014cb",
               "name": "Susan Forristal",
               "profile_path": "/A8Dh5EKIjaRUqGmpY8GdIAW9pJY.jpg",
               "id": 21620,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe436a9251416c7500f67f",
               "name": "Jonathan Lynn",
               "profile_path": "/nvMGnGbGdXrRvGAjulNqhJWUB9c.jpg",
               "id": 21217,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe436a9251416c7500f685",
               "name": "Marty Kaplan",
               "profile_path": null,
               "id": 65021,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe436a9251416c7500f68b",
               "name": "Leonard Goldberg",
               "profile_path": null,
               "id": 12842,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe436a9251416c7500f691",
               "name": "Marty Kaplan",
               "profile_path": null,
               "id": 65021,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe436a9251416c7500f697",
               "name": "Michael Peyser",
               "profile_path": null,
               "id": 59949,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe436a9251416c7500f69d",
               "name": "Randy Edelman",
               "profile_path": "/fGS6OjvQpivFVajkmjTRgRiC9BN.jpg",
               "id": 14712,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe436a9251416c7500f6a3",
               "name": "Gabriel Beristain",
               "profile_path": "/zpy2AF6fmOFgZTKcLV1Wa3raQ9N.jpg",
               "id": 10832,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe436a9251416c7500f6a9",
               "name": "Barry B. Leirer",
               "profile_path": null,
               "id": 25981,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe436a9251416c7500f6af",
               "name": "Tony Lombardo",
               "profile_path": null,
               "id": 56972,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "58e01db29251415e3600e896",
               "name": "Mary Goldberg",
               "profile_path": null,
               "id": 23349,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "58e01dba9251415e4000e551",
               "name": "Leslie Dilley",
               "profile_path": null,
               "id": 5059,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "58e01dc19251415e4000e556",
               "name": "Ed Verreaux",
               "profile_path": null,
               "id": 4953,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "58e01dc7c3a3683cff00e8c3",
               "name": "Dorree Cooper",
               "profile_path": null,
               "id": 37429,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "58e01dce9251415e4000e55f",
               "name": "Francine Jamison-Tanchuck",
               "profile_path": null,
               "id": 62643,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 6.124153,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10411,
      "vote_count": 91,
      "budget": 0,
      "overview": "A Florida con man uses the passing of the long time Congressman from his district who he just happens to share a name with, to get elected to his version of paradise, Congress, where the money flows from lobbyists. But soon he learns the nature of the game and decides to fight back the only way he knows how, with a con.",
      "similar": [
         93456,
         137106,
         212716,
         9928,
         2288,
         391,
         82695,
         452507,
         310307,
         7972,
         9722,
         9621,
         1643,
         9293,
         11130,
         13188,
         4379,
         10033,
         8051,
         3090
      ],
      "original_title": "The Distinguished Gentleman",
      "runtime": 112,
      "poster_path": "/vFB0VCxa7z93x6lpAoKnOFULEsj.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Português",
            "iso_639_1": "pt"
         }
      ],
      "production_companies": [{
         "logo_path": "/xXojkyRWFZ0JTJyjiu13ThKeFbz.png",
         "name": "Hollywood Pictures",
         "id": 915,
         "origin_country": ""
      }],
      "release_date": "1992-12-04",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "From con man to congressman",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jonathan Lynn"],
      "runtime": 112,
      "synopsis": null,
      "writers": [
         "Marty Kaplan",
         "Jonathan Reynolds"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0104114/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU2NjUxNjQxNF5BMl5BanBnXkFtZTcwNjQ1NDMyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Eddie Murphy, Lane Smith, Sheryl Lee Ralph | See full cast and crew »"],
      "reviews": [
         "This overlooked Eddie Murphy from 1992 gem is much better than most critics would have you believe. Murphy plays a charming con man who swindles his way into Congress through voter inattention -- they think he's the incumbent, who is actually deceased. What starts as a game to merely soak the job for all it's worth turns into an unlikely effort to make a real difference. Several scenes are laugh-out-loud, particularly early on. Though a shade overlong, the story is engaging enough to keep the viewer's attention, and it serves up some nice potshots at how bloated and self-serving government has become. One of Murphy's best 'non-family' entries.",
         "Being a Government teacher, I was curious about this film. As an Eddie Murphy vehicle, I was what somewhat curious to see if it would be an educational movie or just a comedic flick. Well, it was both. The story is funny and the plot is politically sharp. We see how the congressional committees work and how money influences our legislative process. Eddie Murphy has arrived as an actor that is still capable of making quality films.",
         "Though it laid a big fat egg at the box office, THE DISTINGUISHED GENTLEMAN is still one of Eddie Murphy's smartest and most entertaining films. Eddie plays a career con man who decides there is real money to be made in the political arena and using the name of his state's recently deceased incumbent, runs for Congress and is actually elected on the strength of his predecessor's name. Upon his arrival in Washington, he finds himself courted by many special lobbyists and finds him squaring off against one semi-crooked congressman (the late Lane Smith), whose personal agendas outweigh his duties to the people he represents and it is through his dealings with this guy and learning that politics is more than the big dodge he thought it was going to be, our hero learns to be a better person. This clever comedy takes the expected pot-shots at Washington, DC and politics in general, but also presents a fun good vs evil story surrounded by some elaborate trappings that make for a sophisticated comic romp. Murphy has rarely been better and he has surrounded himself with a superb supporting cast including Kevin McCarthy, Joe Don Baker, Charles S. Dutton, Sheryl Lee Ralph, Noble Willingham, and Grant Shaud. There is also a very funny cameo by James Garner as the congressman who Murphy succeeds. The movie is about 20 minutes too long, but for the most part, it is a very entertaining ride. It's not the kind of film hard-core Eddie-philes expect from him, but for those looking for something a little original and very funny...have your fill here.",
         "Normally, I dont like Eddie Murphy films. This is a definite exception. He is not as over the top as in a lot of his roles, and carries it off with charm and substance, a little like Will Smith does now. The plot (concerning a con man who decides theres more money to be made in politics) is for the most part hilarious, but seriously falls down into schmaltz once he starts developing a conscience. Also, it is not as scathing about the American political system as it could be, giving out the impression that apart from a few bad apples, the majority of politicians do have the publics best interests at heart. Anyone who enjoyed this should try and check out the English tv series \"Yes, Minister\". It is written by the director of this film (Jonathan Lynn) and is really much more effective in dealing with the British political system. Another british series along these lines is \"House of Cards\" and its follow ups, which really pulls no punches at all. And stars Ian Richardson. What more could you possibly want?",
         "There were so many spots that seemed to demand \"more Eddie.\" He only did a couple of impersonation schticks (during the campaign in the van scene, and the nerdy guy visiting the dead congressman's widow), and I wanted more! They were great. The story is good, too. A con artist decides to become a congressman and play the game, only to find out that the issues involved are not a game. He becomes a person who cares. Granted, it's a comedy, but it continues to remind us that, as long as humans run organizations, is ANY organization pure virtue and no vice? Religion? Law enforcement? Academia? Government? Corporate society? Sports? Is any system free of corruption? We all live in glass houses. And there are individuals out there trying at least to keep their windows clean.",
         "As a political wonk, I found this movie perfect! I think this is the best Eddie Murphy movie ever! Actually, I am disappointed it took me so long to see it (today, 12/28/02). I was amazed at the negative reviews. What is these people's problem? That the US government doesn't work like this? Or that Eddie's character could actually realize that screwing ordinary citizens is different from swindling corporations and rich people?",
         "I'll start off by saying I don't particularly like Eddie Murphy. I think he is not always in tune with what is funny, and the only movie that he was in that I truly enjoyed (I thought he was excellent in the Nutty Proffessor but I didn't like the movie really) was Beverly Hills Cop. And this one. Here's why: Eddie Murphy does not force his humor in this movie, like he tries in almost everything else I've seen him in. For most of the movie, he seems himself. Not only that, you actually see a little drama from Eddie, which while not ranking up there with the likes of Hanks and Hackman, he certainly makes you believe he's got another side to him. The movie, while stretching credibility, attacks the System very well, both dramatically and humorously. If one watches this movie expecting a mild satire instead of a barrel of laughs or a breathtaking plot, they will probably enjoy it, assuming they didn't hate Beverly Hills Cop.",
         "I've seen Citizen Kane and wasn't half as impressed with it as I was with this film which I credit to producer and writer Marty Kaplan (who, as I understand, is a CPA). The only thing this movie lacks is violence and nudity, not that it needs either. I've never seen a more thorough and realistic comedy about government and politics before or since this film. Only Bulworth comes close, yet the solutions suggested in that film were just as liberal as the institution it parodied. There are a few liberal connotations in The Distinguished Gentleman (particularly environmental), but they are immediately balanced and authenticated by the conditions presented in the story. This film isn't an absolute probe into political science, but it gives a more lucid perspective of politics than the media would ever care to attempt. Eddie Murphy's performance is vintage, particularly his mimicking skills and his genuine comedic brilliance. A moment that defines the film is when his character gives a victory speech which consists exclusively of several cliches coined by historic politicians (\"'Four score and seven years ago...' 'If you can't stand the heat, get out of the kitchen...' 'We have nothing to fear but fear itself...' 'Ask not what your country can do for you...' and in conclusion 'Read my lips!'\"). The crowd response, as with actual politicians, is full of mindless cheers of concurrence. Political experts may find this film silly and full of inconsistencies. Yet, the fact is, most movies are silly compared to reality. This film, however, does not insult the viewer and gives political novices a good idea of political mechanics while presenting a hilarious performance. The fact presented in this film is that the most powerful people are the most corrupt, and corruption can only be defeated by more clever and deceptive corruption. This is not a film for \"Generation X\"ers who rate a film on its music soundtrack and how thoroughly the females cast in it prostitute themselves. If you appreciate the comedy of Eddie Murphy and have a critical appreciation for politics, you will enjoy this film. I'd give it a 9.5, but the IMDB won't allow decimals.",
         "Thomas Jefferson Johnson is a small time con artist who realises the money in politics when he overhears Congressman Jeff Johnson during one of his scams. When the Congressman dies between his secretary's legs in his office while \"poling the electorate\" Thomas sees his opportunity. Dropping his first name in the hope that name recognition will see him through, Thomas and his crew go to work and it is not long before they slide their way to Washington. Once in town he gets on the gravy train straight away \u0096 joining his colleagues in Congress, he is soon up to his neck in contributions and fund raisers but is this really what it is all about? Although it starts out with plenty of big, easy targets the first half of the film is lively and quite funny. The broad satire is never that cutting or intelligent but it does the job for an Eddie Murphy comedy. Unfortunately, around the halfway mark the obvious plot suddenly has Thomas develop a heart and the film grinds to a halt. Happily it gets its senses back in the final section and is a return to the lively first part \u0096 this is not to say that it is brilliant because it isn't, but it is amusing and pretty enjoyable apart from the narrative arch having a massive hole in the middle of it. The cast are mixed dependant on their material. Murphy himself is on good form. His con artist character suits his on screen personae and he works the dialogue really well \u0096 he is all at sea when he has to convince the audience of the change in his character but he moves through that as quickly as he can. The supporting cast are all in his shadow on this but at least there are plenty of famous faces. Smith, Dutton, McBride, Baker, Ralph and McCarthy all add an ensemble feel to the film even if it is very much Murphy's vehicle. Lynn's direction is OK but he can't do much of real intelligence with the basic tools presented to him by the writers. Overall this is not the sharpest of satires but the big simple targets are still enjoyably hit. The middle section is poor but Murphy ensures that the majority of it will be good enough to please his fans even if it could have been so much better.",
         "Eddie Murphy is a great actor and he proves it in this movie. In it, Con man Murphy decides he can make more money as a United States Congressman than a hood. Victoria Rowell as Murphy's lawyer-activist love interest, Lane Smith as his double-dealing \"political\" mentor, and Joe Don Baker as the power magnate who tries to put both men in his pocket, bat great cleanup. All of this movie, coming from a pure political buff like myself, is great. For all you Alan Keyes fans out there, watch this movie for Charles S. Dutton's great performance as Eliah Hawkins, a preachy minister-Maryland congressman who I think is like Keyes in every way."
      ],
      "genres": [
         "Comedy",
         "Crime"
      ],
      "productionCompanies": [
         "Hollywood Pictures",
         "Touchwood Pacific Partners 1"
      ],
      "summaries": ["A Florida con man uses the passing of the long time Congressman from his district who he just happens to share a name with, to get elected to his version of paradise, Congress, where the money flows from lobbyists. But soon he learns the nature of the game and decides to fight back the only way he knows how, with a con."],
      "budget": 0
   },
   "movielensId": 3120,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1992-12-04",
      "dvdReleaseDate": "1999-11-16",
      "directors": ["Jonathan Lynn"],
      "runtime": 112,
      "movieId": 3120,
      "title": "The Distinguished Gentleman",
      "mpaa": "R",
      "actors": [
         "Eddie Murphy",
         "Lane Smith",
         "Sheryl Lee Ralph",
         "Joe Don Baker",
         "Victoria Rowell",
         "Susan Forristal"
      ],
      "imdbMovieId": "0104114",
      "originalTitle": "The Distinguished Gentleman",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["FTsd3VUAiYg"],
      "plotSummary": "A Florida con man uses the passing of the long time Congressman from his district who he just happens to share a name with, to get elected to his version of paradise, Congress, where the money flows from lobbyists. But soon he learns the nature of the game and decides to fight back the only way he knows how, with a con.",
      "tmdbMovieId": 10411,
      "avgRating": 2.94845,
      "releaseYear": "1992",
      "numRatings": 999,
      "posterPath": "/vFB0VCxa7z93x6lpAoKnOFULEsj.jpg"
   }
}