{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "mexico",
            "id": 534
         },
         {
            "name": "suspense",
            "id": 9937
         },
         {
            "name": "hitchhiker",
            "id": 11546
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "film noir",
            "id": 195402
         }
      ],
      "imdb_id": "tt0045877",
      "video": false,
      "title": "The Hitch-Hiker",
      "recommendations": [
         73492,
         20298,
         21454,
         28663,
         49334,
         22112,
         23342,
         41020,
         43463,
         42794,
         217411,
         28249,
         141906,
         38417,
         35852,
         3575,
         36949,
         64078,
         34593,
         26174
      ],
      "backdrop_path": "/9kShLliN8PYW1jL3T2ydcUy9o5R.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Roy Collins",
               "gender": 2,
               "credit_id": "52fe45cbc3a36847f80dacb5",
               "name": "Edmond O'Brien",
               "profile_path": "/jyi6OW4ZFWudfyk0TgnBK4i3XSf.jpg",
               "id": 8254,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Gilbert Bowen",
               "gender": 2,
               "credit_id": "52fe45cbc3a36847f80dacb9",
               "name": "Frank Lovejoy",
               "profile_path": "/54lyen5kzZ7xehjCVR6dJxe3qRo.jpg",
               "id": 81179,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Emmett Myers",
               "gender": 2,
               "credit_id": "52fe45cbc3a36847f80dacbd",
               "name": "William Talman",
               "profile_path": "/v3EG7QdDBYDcBTPJtWzFrlCZEx.jpg",
               "id": 89581,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Captain Alvarado (as Jose Torvay)",
               "gender": 0,
               "credit_id": "52fe45cbc3a36847f80dacc1",
               "name": "José Torvay",
               "profile_path": "/A5s0VGXCnVQsym4QaZkwyh3psvc.jpg",
               "id": 30307,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Radio Broadcaster",
               "gender": 0,
               "credit_id": "52fe45cbc3a36847f80dacc5",
               "name": "Sam Hayes",
               "profile_path": "/3Um7tYoqfNosRqLJu9vDOBgRsfa.jpg",
               "id": 126549,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Wendell Niles (as Wendel Niles)",
               "gender": 0,
               "credit_id": "52fe45cbc3a36847f80dacc9",
               "name": "Wendell Niles",
               "profile_path": "/4UyXWwiwII37oYgKiNZz3O690ls.jpg",
               "id": 126550,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Inspector General",
               "gender": 2,
               "credit_id": "52fe45cbc3a36847f80daccd",
               "name": "Jean Del Val",
               "profile_path": null,
               "id": 22099,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Government Agent",
               "gender": 2,
               "credit_id": "52fe45cbc3a36847f80dacd1",
               "name": "Clark Howat",
               "profile_path": "/evBot6971Pf6YTAFoxUTbjOcF0H.jpg",
               "id": 117027,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Jose (as Natividad Vacio)",
               "gender": 0,
               "credit_id": "52fe45cbc3a36847f80dacd5",
               "name": "Natividad Vacío",
               "profile_path": "/aNrydVspldovt5KixcVNNhj0Ad0.jpg",
               "id": 14530,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "FBI Agent (uncredited)",
               "gender": 2,
               "credit_id": "576d2723c3a3685bc5005367",
               "name": "Larry Hudson",
               "profile_path": null,
               "id": 1640750,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Sleeping Mexican Peon (uncredited)",
               "gender": 0,
               "credit_id": "576d2714c3a3683089006b7f",
               "name": "Collier Young",
               "profile_path": null,
               "id": 96246,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe45cbc3a36847f80dacb1",
               "name": "Ida Lupino",
               "profile_path": "/pcc80NSvf3ZN6gbcTLwV4iC4inu.jpg",
               "id": 46617,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "560ae96e925141719100329f",
               "name": "Collier Young",
               "profile_path": null,
               "id": 96246,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "560ae99192514171910032a7",
               "name": "Ida Lupino",
               "profile_path": "/pcc80NSvf3ZN6gbcTLwV4iC4inu.jpg",
               "id": 46617,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "573e296c9251413fec0003a9",
               "name": "Mel Berns",
               "profile_path": null,
               "id": 4352,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 2,
               "credit_id": "576d275a9251416954004aca",
               "name": "Leith Stevens",
               "profile_path": null,
               "id": 40460,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "576d276b9251416933004b10",
               "name": "Nicholas Musuraca",
               "profile_path": null,
               "id": 10150,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "576d277e92514169bc004a56",
               "name": "Christian Nyby",
               "profile_path": null,
               "id": 13973,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "576d279192514169bc004a68",
               "name": "Collier Young",
               "profile_path": null,
               "id": 96246,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.939934,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 41462,
      "vote_count": 36,
      "budget": 0,
      "overview": "Two fishermen pick up a psychotic escaped convict who tells them that he intends to murder them when the ride is over.",
      "similar": [
         12162,
         9741,
         793,
         242224,
         910,
         996,
         3766,
         858,
         141,
         634,
         112160,
         437557,
         297762,
         9272,
         6977,
         1359,
         2252,
         2502,
         9654,
         9509
      ],
      "original_title": "The Hitch-Hiker",
      "runtime": 71,
      "poster_path": "/9ORvQWC2o0FwIEl6zYU1jw9qH0X.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [{
         "logo_path": "/n53F7K9scQWFXYbrCablqLKqJdp.png",
         "name": "RKO Radio Pictures",
         "id": 6,
         "origin_country": "US"
      }],
      "release_date": "1953-10-16",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "Who will be his NEXT victim... YOU?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Ida Lupino"],
      "runtime": 71,
      "synopsis": null,
      "writers": [
         "Collier Young",
         "Ida Lupino"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0045877/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcyODEzMzI1Ml5BMl5BanBnXkFtZTcwNTc1NzAyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Edmond O'Brien, Frank Lovejoy, William Talman | See full cast and crew »"],
      "reviews": [
         "Thanks to modern technology, another film noir classic has escaped from Hollywood's vault of too-often-overlooked or forgotten films. Albeit a minor classic, \"The Hitch-Hiker,\" directed by Ida Lupino, is a taut drama notable for it's realism, as well as a haunting performance by William Talman. Reputedly based on a true incident (\"Penned from the headlines\"), the story traces the movements of a hitch-hiker, Emmett Myers (Talman), who repays his highway hosts by robbing and murdering them. Initially, we are shown mere glimpses of Myers and his victims, which successfully sets the stage for the introduction of Roy Collins (Edmond O'Brien) and Gilbert Bowen (Frank Lovejoy), two friends on their way to a fishing trip in Mexico, when, unawares, they pick up Myers. What follows is a realistic depiction of what most likely would transpire when ordinary people are suddenly faced with such extraordinary circumstances. And the strength of the film lies in the fact that when Collins and Bowen are kidnapped, held at gunpoint and forced to do the bidding of their captor, they react and behave in a manner that is both consistent with their current state of affairs and believable. There are no feigned heroics or superhuman contrivances that allow the two captives to effect an escape; instead, the story plays out in much the way one would, in reality, expect in such a situation, which, when extrapolated, effectively drives home the true horror of Collin's and Bowen's circumstance. The lion's share of the credit for the success of this film must go to director Ida Lupino, whose almost documentary-style approach to the story lends it the necessary grit and intensity. She scores double points, as well, for not only delivering a memorable film, but doing so at a time in which few women were afforded the opportunity to perform at such a level behind the camera. Lupino's success no doubt helped pave the way for the likes of Jane Campion, Jodie Foster, Gillian Armstrong, Allison Anders and a host of other women who have since proved that gender alone does not equate to excellence and ability in the director's chair. In arguably his best performance, character actor William Talman turns in a memorable performance as the sociopath, Myers. Forget your Freddys and Jasons; Talman's portrayal creates the kind of character that nightmares are really made of. Myers is a guy you could pass on the street, or-- yes, even give a lift to if you saw him with his thumb out on the highway-- without giving him a second thought. And that's what makes him so scary; his disguise is that he doesn't have a disguise, and it's so much more effective than having a hockey mask or hands with steel fingers could ever be. O'Brien and Lovejoy also turn in credible performances, creating characters who, like Talman's Myers, are real. Watching them, you believe that Collins is, indeed, an auto mechanic, and Bowen a draftsman; two friends off together to do some fishing. The supporting cast includes Jose Torvay (Captain Alvarado); Jean Del Val (Inspector General); Clark Howat (Government Agent); and Natividad Vacio (Jose). The 71 minute running time is perfect for this film; rather than resort to superfluous filler, Lupino stays on task without ever straying, and in the end makes \"The Hitch-Hiker\" a ride that will leave you wondering what you would do in a like situation, and hoping that you'll never have to find out. It's the magic of the movies.",
         "\"The Hitch-Hiker\" is an excellent little independently produced film-noire thriller directed by Ida Lupino. It is essentially a three character story about two pals on a fishing trip (or is it?) who stop to pick up a hitch-hiker whose car has apparently broken down, What they don't realize is that the hitchhiker is a crazed killer. The two buddies are played by two of the best character actors of the period, Edmond O'Brien and Frank Lovejoy. The hitcher, in the role of his career, is played by William Tallman (of TV's Perry Mason fame). The story covers their trek across the desert back roads of Mexico in an effort to evade the law. Most of the film takes place within the claustrophobic confines of O'Brien's car as he and Lovejoy remain at the mercy of loose cannon Tallman never knowing where or when he might decide to shoot them. Lupino gives us a compact, tense and suspenseful thriller. Shot in black and white, it runs a brief 71 minutes and delivers an excellent drama on a limited budget. Rarely seen today, this movie is a buried little treasure.",
         "Supposedly the only Film Noir directed by a woman (Ida Lupino of 'High Sierra' and 'On Dangerous Ground'), 'The Hitch-Hiker' is a fascinating thriller that holds your attention from start to finish. Edmond O'Brien ('D.O.A.') and Frank Lovejoy ('in A Lonely Place') play two buddies on a road trip who pick up a hitch-hiker (William Talman, best remembered as Hamilton Berger on the old \"Perry Mason\" TV show). BIG MISTAKE! He is actually notorious psycho killer Emmett Myers. Talman gives a terrific performance as Myers, a real nasty piece of work with a bum eye so you never know if he's asleep or awake. He holds the men hostage, bullies and provokes them, even uses them as target practice. We've seen many similar plots over the years but I thought this was a fresh and unpredictable. Lupino's direction really suits the material, the tension builds throughout, and Talman is unforgettable. If you like thrillers track this one down. Highly recommended.",
         "William Talman once mentioned this film in a personal interview. He was driving in Los Angeles in an open convertible and stopped at a stop light. A fellow in another convertible looked over at him and asked, \"You're the hitch hiker, aren't you?\" Talman shook his head indicating that he was. The other driver then left his car and went over and slapped Talman in the face. Talman, when relating this story, said, \"You know, I never won an academy award but I guess that was about as close as I ever will come to one.\"",
         "Usually when movies based on factual events start with a warning that it easily could have happened to you instead of to the characters, you don't pay too much attention to it, as it mostly handles about unlikely situations. Sure you'll wonder how you'd respond or randomly imagine what it would feel like, but in general the true events won't haunt your thoughts for long. In the case of Ida Lupino's \"The Hitch-Hiker\", this is totally different! Chances are high that once in your life, or maybe even recently, you picked up a hitcher and, after seeing this film, you won't do that again any time soon. That's how much of an impression this excellent film-noir will make on you. This flawlessly acted & directed thriller sustains a uniquely tense atmosphere from start to finish, and this without reverting to explicit violence or dreadful clichés. Inspired by the real-life murder case of Billy Cook, the plot centers on merciless serial killer Emmett Myers, who hitchhikes on the quiet roads of rural America but coldly executes the people that are kind enough to offer him a ride. As the list of casualties dramatically increases and police forces get to close on his tail, Myers hijacks one last car to escape into Mexico. The unfortunate passengers are Roy Collins and Gilbert Bowen, two buddies on their way for a fishing weekend. Myers continuously holds them at gunpoint, even sleeping with one eye open, and makes perfectly clear they aren't supposed to survive the journey. Amazingly realistic in \"The Hitch-Hiker\" is the depiction of Roy and Gilbert's behavior. Even though they have nothing to lose, they always obey their hijacker and live in fear for him. Perhaps it's because the director is a woman, but there's absolutely no macho nonsense or tough dialogs going on here. Myers is the guy with the gun and certainly not afraid to use it, so you obey his every command. William Talman's performance as the maniac is simply perplexing! With his odd eyes, monotonous voice and overall nihilistic world perspective, he definitely makes one of the scariest villains in the history of film-noir cinema. Top recommendation, don't miss it.",
         "Two old army buddies (Edmund O'Brien, Frank Lovejoy) take off on a fishing trip from California to the Mexican coast. At the same time, a fugitive serial killer (William Tallman) is hitch-hiking and killing his way across the country. They intersect in the desert, just before the Mexican border. He hijacks and holds them hostage on an odyssey into hell. We follow them deeper and deeper into the beautiful, but hostile desert as Tallman seems to outwit the authorities time and again. They become more and more terrified as he becomes more and more psycho. He displays a kind of pure malice and cruelty that makes your skin crawl. Example: He forces one of the buddies to shoot the glass out of the other's hand. His evil character has a drooping right eye. While preparing to sleep around a campfire, he dares the captives to guess whether he is awake or asleep. They guess wrong - he kills them. The viewer takes this trip across the desert with them, all the way to their final destination, and the climax of this exciting film. It is easy to see why Ida Lupino, was considered one of the premier film noir directors. Her concept of the fishing buddies, courageous, proud, but terrified reaches right down into our guts. But it is her balanced vision of the evil, intelligent, unpredictable killer that defines the film. This is a keeper. If you like it - and how could you not - try Split Second. There is a curious coincidence between these two films. Both were directed by famous and respected actors. This by Ida Lupino and the other by Dick Powell.",
         "I saw this movie recently for the first time on Turner Classic Movies. This is a tough and suspenseful little movie. The killer is a truly evil character; no ambiguity about his character as you might expect in a more recent film. It must have been considered a brutal film when it was made, though its mild by today's standards. The location setting in the bleak desert adds to movie's atmosphere and tone. And, it was directed by a woman, rare today, and even more rare in the 50s. Exciting, fast-paced, and never boring.",
         "THE HITCH-HIKER is based on a true story, which makes it all the more creepy. Well-directed by Ida Lupino; it was powerful without a lotta trappings. Simple story, inexpensive exterior shooting, and tight acting. Starred William Talman (the bungling D.A. of Perry Mason), Frank Lovejoy, and... Edmund O'Brien. Never was much a fan of the early O'Brien-- he doesn't pull off the toughness he tries for, so I was on-guard for some over-acting from him. No worries this time, for the most part. But TALMAN was the great surprise! Wow! What happened to his career after this film?? He was terrific in this role. His villain wasn't one of those super-intelligent, epitome-of-evil psychos. He's not an exotic, like Hannibal Lecter. Nor did Talman act like one of those oh-so-polite sorts. (As if it makes them more menacing to have nice manners when they threaten you. Think \"Goldfinger\".) No, Talman was effective as a more true-to-life sort.. the kind that seems more menacing to me as a viewer, because you really might run into this bastard. The only politeness he showed to his victims was to offer them a cigarette. And when he was feeling pleased with himself for nearing the end of his escape, he bought them a beer. Talman's character was a pushy sadist, but never tried to spice it up by pretending to be nice. His ugly game of target practice was evil-- he held one guy at gunpoint and made him shoot a rifle at his friend, who was forced to hold up a tin can. (I don't think this is too much of a spoiler.) He wasn't a Brainiac, just had a talent for staying in control, keeping a never-closing vigilante eye (his creepy-looking right eye wouldn't close when he slept, so his hostages never knew when to try anything). He invested all his energy into avoiding capture. Lovejoy and O'Brien worked well together as the Normal Joes who happened to pick up the wrong guy. Again, because they're more true-to-life, you can identify with them better than a hard-boiled detective. Realistic location shooting also makes this simple story more powerful. Lupino deserves credit as a film-maker, and I'm glad she's being recognized more and more.",
         "At one time actually thought lost, now this minor classic is on video (who says these aren't the good old days?). William Talman, who is mainly remembered as Perry Mason's dullish adversary/stooge on the TV show for years and years, gives a powerful and creepy performance as an insolent psychopath who holds two men hostage through a long road trip around the desert southwest and Mexico. Loosely based on a true story, there's not much more to it than that-- but it's tense and well-crafted all the way through, and deserves its reputation as Lupino's best movie.",
         "I never knew that William Talman could be such a killer. His character Emmett Myers, hitch-hiker killer is so opposite his most famous character D.A. Hamilton Burger from the Perry Mason series that I was fascinated. Meyers's right eyelid was paralyzed and could not close. When he was holding Edmond O'Brien & Frank Lovejoy captive in the Mexican desert late at night, as a human being he needed to sleep. Now, how could he hold his prisoners captive while sleeping? That is what O'Brien & Lovejoy were wondering. But, that eye could not close, was Myers really asleep or just pretending, after all, Meyers just kept looking at them with this eye. The first time it happen late at night, it wasn't worth the chance that he was pretending. Director Lupino does an excellent job of suspense with this scene. It happens a second time. This time it was worth a try, maybe he really was asleep? Would it be worth the gamble of my life? When you see this movie, you be the judge, is he pretending sleep or really awake?"
      ],
      "genres": [
         "Crime",
         "Film-Noir",
         "Thriller"
      ],
      "productionCompanies": [
         "RKO Radio Pictures",
         "Filmakers, The"
      ],
      "summaries": [
         "Two friends on a fishing trip pick up a stranded motorist who turns out to be a psychotic escaped convict. This sociopath has already murdered other good Samaritans in his efforts to evade authorities. He sadistically taunts and threatens the two men and perversely delights in telling them that he has them both marked for death sometime before the end of the trip. His destination is a ferryboat in Baja, California, which he hopes will help him get to the mainland. The hostages hope to stay alive long enough to escape or be rescued by Mexican authorities.",
         "While traveling in a fishing trip to San Felipe, the draftsman Gilbert Bowen and his friend, the garage owner Roy Collins give a ride to a stranger. Sooner they learn that the man is the psychopath serial-killer Emmett Myers, who has escaped from prison and wants to reach Santa Rosalia in Mexico. The sadistic criminal also tells them that he will kill them in the end of the line.",
         "Two old friends, Roy Collins and Gilbert Bowen, are driving south into Mexico for a one week fishing trip. They'd been there once before as young men and there's some nostalgia attached to the trip though family man Bowen admits early on that he already misses his wife and kids. When they see a car broken down by the side of the road, they offer its occupant a lift. It doesn't take long before they realize they've picked up the notorious Emmett Myers, who is desperately trying to evade authorities and get to Mexico. He's left a trail of good Samaritans who have given him a lift and are now dead. While the police chase them down, Collins and Bowen will be driven to the breaking point by the madman.",
         "Two fishermen pick up a psychotic escaped convict who tells them that he intends to murder them when the ride is over."
      ],
      "budget": 0
   },
   "movielensId": 3121,
   "movielens": {
      "languages": [
         "English",
         "Español"
      ],
      "releaseDate": "1953-10-16",
      "dvdReleaseDate": "2003-06-24",
      "directors": ["Ida Lupino"],
      "runtime": 71,
      "movieId": 3121,
      "title": "The Hitch-Hiker",
      "mpaa": "",
      "actors": [
         "Edmond O'Brien",
         "Frank Lovejoy",
         "William Talman",
         "José Torvay",
         "Sam Hayes",
         "Wendell Niles",
         "Jean Del Val",
         "Clark Howat",
         "Natividad Vacío",
         "Larry Hudson",
         "Collier Young"
      ],
      "imdbMovieId": "0045877",
      "originalTitle": "The Hitch-Hiker",
      "genres": [
         "Crime",
         "Thriller"
      ],
      "youtubeTrailerIds": ["9KDdbH1Gdio"],
      "plotSummary": "Two fishermen pick up a psychotic escaped convict who tells them that he intends to murder them when the ride is over.",
      "tmdbMovieId": 41462,
      "avgRating": 3.4233,
      "releaseYear": "1953",
      "numRatings": 176,
      "posterPath": "/9ORvQWC2o0FwIEl6zYU1jw9qH0X.jpg"
   }
}