{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0097717",
      "video": false,
      "title": "Lauderdale",
      "recommendations": [],
      "backdrop_path": "/fuNvY5HTIUlrZ7Lg6vR05u937G5.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Heather Lipton",
               "gender": 1,
               "credit_id": "52fe45a5c3a368484e066c69",
               "name": "Janine Lindemulder",
               "profile_path": "/zw7KkEDx71rGhpIXREk1Q1q7X4r.jpg",
               "id": 75926,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Larry Wilson",
               "gender": 0,
               "credit_id": "52fe45a5c3a368484e066c6d",
               "name": "Darrel Guilbeau",
               "profile_path": "/2B7144iK0KDE090KaEpo0nUYBzV.jpg",
               "id": 101281,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Jane Beaumont",
               "gender": 0,
               "credit_id": "58fa9752c3a36879db00347c",
               "name": "Michelle Kemp",
               "profile_path": null,
               "id": 1800940,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Animal",
               "gender": 0,
               "credit_id": "58fa970692514163ec003034",
               "name": "Jeff Greenman",
               "profile_path": null,
               "id": 1328809,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Rachel Thorne",
               "gender": 0,
               "credit_id": "58fa974392514163ec003065",
               "name": "Lara Belmonte",
               "profile_path": null,
               "id": 1800939,
               "order": 4
            },
            {
               "cast_id": 4,
               "character": "Amy (Car Wash Girl)",
               "gender": 1,
               "credit_id": "52fe45a5c3a368484e066c71",
               "name": "Amy Lynn Baxter",
               "profile_path": null,
               "id": 99795,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Beach Beauty",
               "gender": 0,
               "credit_id": "52fe45a5c3a368484e066c75",
               "name": "Renee Shugart",
               "profile_path": null,
               "id": 101299,
               "order": 6
            },
            {
               "cast_id": 7,
               "character": "Vinyl Vixen #1",
               "gender": 1,
               "credit_id": "52fe45a5c3a368484e066c79",
               "name": "Sherrie Rose",
               "profile_path": "/17fLSzwWmOP567fNATCBdHbtIsR.jpg",
               "id": 43068,
               "order": 7
            },
            {
               "cast_id": 8,
               "character": "Cycle Psycho",
               "gender": 2,
               "credit_id": "52fe45a5c3a368484e066c7d",
               "name": "Ron Jeremy",
               "profile_path": "/l4aDQlLafsG3N4pJ3W6YjpMXWI3.jpg",
               "id": 42545,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Liquor Store Owner",
               "gender": 0,
               "credit_id": "58fa979092514163f500312e",
               "name": "Beano",
               "profile_path": null,
               "id": 158794,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Girl on Campus",
               "gender": 0,
               "credit_id": "58fa980692514163df00336a",
               "name": "Cari Mayor",
               "profile_path": null,
               "id": 1092569,
               "order": 10
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe45a5c3a368484e066c65",
            "name": "Bill Milling",
            "profile_path": null,
            "id": 101297,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [],
      "popularity": 2.013988,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 28604,
      "vote_count": 3,
      "budget": 0,
      "overview": "\"Porky\" style teen comedy with plenty of gross out jokes and nudity. A nerd and his out-of-control friend chase a dream girl to a beach on Florida where all the expected carrying on occurs.",
      "similar": [],
      "original_title": "Lauderdale",
      "runtime": 91,
      "poster_path": "/3owX5g86KzOqEf1EPQYmIKWAqn4.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1989-01-01",
      "vote_average": 1.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Bill Milling"],
      "runtime": 91,
      "synopsis": null,
      "writers": ["Bill Milling"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0097717/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjExMzY2MjkzM15BMl5BanBnXkFtZTcwMDUxMzAyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Renee Shugart, Darrel Guilbeau, Jeff Greenman | See full cast and crew »"],
      "reviews": [
         "Another entry in the Spring Break genre (in fact, titled SPRING FEVER USA for television) is actually a fun spoof of other films of its ilk, filled with in-jokes and amusing comedic dialogue (not to mention the prerequisite chicks in bikinis). Good-natured for the most part, it never takes itself too seriously, and you needn't either; you can just sit back and enjoy without thinking too much. Too bad the voluptuous Michelle Kemp hasn't appeared in any other films. **1/2 out of ****.",
         "There ought to be a MST3K-type show that shows these cheap, racy, knock-off spring-break movies. This particular show is one of my favorites because I was going to Nova University in Ft. Lauderdale when this movie was filmed. City Limits is an actual club, and the actual house band appeared in the movie. The best scene is the shot of \"star\" Janine Lindemulder (she appeared in Penthouse and now does porn) jamming with Frank Vocale and the band (nice hair, Frank!). They then cut to the next scene of a bar in the club, the music still playing in the background . . . and the band members are sitting at the bar having a drink!!",
         "\"Larry Wilson\" (Darrel Guilbeau) is a student at UCLA who is serious about his studies but also happens to be in search for the perfect woman. His buddy \"Animal\" (Jeff Greenman) is also a student but his main interest is partying. One day Larry and Animal happen to meet \"Heather Lipton\" (Janine Lindemulder) and Larry falls head over heals for her. Suddenly out of nowhere two thugs try to kidnap her but she manages to escape when both Larry and Animal come to her rescue. What results is a mad dash from one state to another as both Larry and one of Heather's associates named \"Jane Beaumont\" (Michelle Kemp) try to track down Heather who is being chased by the same two thugs led by a young woman named \"Rachel Thorne\" (Lara Belmonte). Now rather than reveal any more about this movie and risk spoiling it for those who haven't seen it I will just say that it had some good points and some bad points. For starters all three ladies just mentioned were quite attractive and certainly lent some nice scenery to the screen. Likewise, there were plenty of other young women in bikinis to help out as well. However, the plot meandered all over the place and there really wasn't much else to this movie. The comedy wasn't that sharp and everything else was rather predictable. That said this is one of those films where you have to turn off your brain and just appreciate the sight of gorgeous women frolicking in their swimsuits. Even so that isn't quite enough for me to rate this movie any higher than I have. Slightly below average.",
         "This movie can be found with two different titles Lauderdale and Spring Fever USA It is available on VHS and Laser Disc as Lauderdale, and as Spring Fever USA on DVD. There is sadly no soundtrack for this movie, I have searched since seeing the movie on Showtime back in the early 1990's for an LP and CD, but none exist. I have talked to several movie soundtrack specialty retailers from all over the US and no one has ever heard of a soundtrack for this movie under either name. The Rebel Pebbles have 3 songs in the movie, \"We Go To The Beach\" \"Nighttime Assassin\" sadly neither of the 2 preceding songs can be found on any Rebel Pebbles' recording. and an early version of \"How Do You Feel\"",
         "Parts of it were filmed in Ft. Lauderdale. In the beginning of the film is a conga line scene on the beach composed of extras who were local to the area. My wife lived there when she was 18 (10 years before I met her) and she is in this scene -- she is the last one they show and the only one who defied the instructions about not looking into the camera. So, here it is, YEARS later and she mentions to me that she MIGHT have been in a movie called Spring Break 2 -- long story short, I track the movie down under its new title and there she is. Totally uncredited and in the shot for about 1/3 of a second. So, the best part about this film is that I get to tell people that my wife made a movie with Ron Jeremy when she was a teenager. The fact that she did not even know that he is in the movie doesn't matter. The look on her face is priceless.",
         "This is the worst movie I ever saw. Not kidding. When we first rented it, people either left the building, fell asleep or started fighting within 15 minutes. We stopped the movie, but a few days later we rented it again - maybe this was really the worst movie ever! And it was! Some movies are so bad, they are fun to watch, but this one is a struggle! It has no plot at all, to guys go to Ft. Lauderdale to party and that's it. When there's only 10 minutes left, they finally realize that the movie is about to end and they have no ending because there is no story. So they have to come up with a conflict in a hurry and solve it just as quickly, which is actually quite funny.... but you have to stay awake through what seems to be an eternity of complete, extreme, horrible boredom before.",
         "i am not sure but i think this might be the movie i am looking for the soundtrack from. is this the one with the Rebel Pebbles, it has a song that isn't on there album, its called \"Midnight Assassin\" not sure if it is from this movie, but i know the movie had a character in it called \"TBC\" which stood for \"The Big Cahuna\". is this the movie. thanks for any help. sorry i have to repeat myself, this thing wants ten lines of text to submit my request. i am not sure but i think this might be the movie i am looking for the soundtrack from. is this the one with the Rebel Pebbles, it has a song that isn't on there album, its called \"Midnight Assassin\" not sure if it is from this movie, but i know the movie had a character in it called \"TBC\" which stood for \"The Big Cahuna\". is this the movie. thanks for any help. how is that for ten lines."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Alpha Pictures"],
      "summaries": ["\"Porky\" style teen comedy with plenty of gross out jokes and nudity. A nerd and his out-of-control friend chase a dream girl to a beach on Florida where all the expected carrying on occurs."],
      "budget": 0
   },
   "movielensId": 3123,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1989-01-01",
      "dvdReleaseDate": "1999-11-16",
      "directors": ["Bill Milling"],
      "runtime": 91,
      "movieId": 3123,
      "title": "Lauderdale",
      "mpaa": "",
      "actors": [
         "Janine Lindemulder",
         "Darrel Guilbeau",
         "Michelle Kemp",
         "Jeff Greenman",
         "Lara Belmonte",
         "Amy Lynn Baxter",
         "Renee Shugart",
         "Sherrie Rose",
         "Ron Jeremy",
         "Beano",
         "Cari Mayor"
      ],
      "imdbMovieId": "0097717",
      "originalTitle": "Lauderdale",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "\"Porky\" style teen comedy with plenty of gross out jokes and nudity. A nerd and his out-of-control friend chase a dream girl to a beach on Florida where all the expected carrying on occurs.",
      "tmdbMovieId": 28604,
      "avgRating": 2.21795,
      "releaseYear": "1989",
      "numRatings": 39,
      "posterPath": "/3owX5g86KzOqEf1EPQYmIKWAqn4.jpg"
   }
}