{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "date",
            "id": 248
         },
         {
            "name": "puberty",
            "id": 1525
         },
         {
            "name": "dublin",
            "id": 4729
         },
         {
            "name": "pub",
            "id": 5319
         },
         {
            "name": "children",
            "id": 10103
         },
         {
            "name": "best friend",
            "id": 12392
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0160509",
      "video": false,
      "title": "Agnes Browne",
      "recommendations": [58473],
      "backdrop_path": "/t7alLWz3NJxdZmT5RZ3MdfxT9o9.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Agnes Browne",
               "gender": 1,
               "credit_id": "52fe46629251416c7507690b",
               "name": "Anjelica Huston",
               "profile_path": "/Aiyv68gYWcEe9OYhyCkOa09kjmy.jpg",
               "id": 5657,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Marion Monks",
               "gender": 0,
               "credit_id": "52fe46629251416c7507690f",
               "name": "Marion O'Dwyer",
               "profile_path": null,
               "id": 78285,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Mark Browne",
               "gender": 2,
               "credit_id": "52fe46629251416c75076913",
               "name": "Niall O'Shea",
               "profile_path": null,
               "id": 78286,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Frankie Browne",
               "gender": 2,
               "credit_id": "52fe46629251416c75076917",
               "name": "Ciaran Owens",
               "profile_path": null,
               "id": 65032,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Cathy Browne",
               "gender": 0,
               "credit_id": "52fe46629251416c7507691b",
               "name": "Roxanna Williams",
               "profile_path": null,
               "id": 78287,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Simon Browne",
               "gender": 0,
               "credit_id": "52fe46629251416c7507691f",
               "name": "Carl Power",
               "profile_path": null,
               "id": 78288,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Dermot Browne",
               "gender": 0,
               "credit_id": "52fe46629251416c75076923",
               "name": "Mark Power",
               "profile_path": null,
               "id": 78289,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Rory Browne",
               "gender": 0,
               "credit_id": "52fe46629251416c75076927",
               "name": "Gareth O'Connor",
               "profile_path": null,
               "id": 78290,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Trevor Browne",
               "gender": 0,
               "credit_id": "52fe46629251416c7507692b",
               "name": "James Lappin",
               "profile_path": null,
               "id": 78291,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Mr. Billy",
               "gender": 2,
               "credit_id": "52fe46629251416c7507692f",
               "name": "Ray Winstone",
               "profile_path": "/kLh8zKA9M8dCOvr44dGdczxMoz4.jpg",
               "id": 5538,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Pierre",
               "gender": 2,
               "credit_id": "52fe46629251416c75076933",
               "name": "Arno Chevrier",
               "profile_path": "/9drUbAD4wBJr63y5QHZXQ8i4umX.jpg",
               "id": 78292,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Mr. Aherne",
               "gender": 2,
               "credit_id": "52fe46629251416c75076937",
               "name": "Gerard McSorley",
               "profile_path": "/AfXsqVrfS0Q9oxHYt2zX7ZJhN1P.jpg",
               "id": 43131,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe46629251416c7507693b",
               "name": "Tom Jones",
               "profile_path": "/gP3WE86AGBTP70wuW083UcgymaG.jpg",
               "id": 523,
               "order": 12
            },
            {
               "cast_id": 14,
               "character": "Fat Annie",
               "gender": 0,
               "credit_id": "52fe46629251416c7507693f",
               "name": "June Rodgers",
               "profile_path": null,
               "id": 78293,
               "order": 13
            },
            {
               "cast_id": 15,
               "character": "Winnie the Mackerel",
               "gender": 0,
               "credit_id": "52fe46629251416c75076943",
               "name": "Jennifer Gibney",
               "profile_path": null,
               "id": 78294,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe46629251416c75076949",
               "name": "Anjelica Huston",
               "profile_path": "/Aiyv68gYWcEe9OYhyCkOa09kjmy.jpg",
               "id": 5657,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46629251416c7507694f",
               "name": "Jim Sheridan",
               "profile_path": "/mfukw1JcUsXmUzt6IoaayMaescv.jpg",
               "id": 53334,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46629251416c75076955",
               "name": "Arthur Lappin",
               "profile_path": null,
               "id": 43143,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe46629251416c7507695b",
               "name": "Anjelica Huston",
               "profile_path": "/Aiyv68gYWcEe9OYhyCkOa09kjmy.jpg",
               "id": 5657,
               "department": "Production",
               "job": "Other"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 3.0318,
      "production_countries": [],
      "id": 15506,
      "vote_count": 13,
      "budget": 0,
      "overview": "When Agnes Browne's husband died, she discovered something amazing... Herself.",
      "similar": [
         166,
         40807,
         858,
         141,
         634,
         242224,
         112160,
         394117,
         391713,
         9603,
         1631,
         5123,
         12689,
         43923,
         19458,
         41630,
         55721,
         437557,
         298312,
         1607
      ],
      "original_title": "Agnes Browne",
      "runtime": 92,
      "poster_path": "/n7VbmERQZKTedbdHjRrURMA7hbM.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1999-11-08",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Anjelica Huston"],
      "runtime": 92,
      "synopsis": null,
      "writers": [
         "Brendan O'Carroll",
         "John Goldsmith"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0160509/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk5MTk2MTg3NF5BMl5BanBnXkFtZTcwNTA1NDQzMQ@@._V1_.jpg",
      "actors": ["Stars: Anjelica Huston, Marion O'Dwyer, Niall O'Shea | See full cast and crew »"],
      "reviews": [
         "I think some of the others who commented on this movie were too harsh...it's not meant to be a human drama of great proportions. It's simply a fun, fairy tale that is a feel good movie. It's not made to make you think about the social plight of widowed Irish mothers in the 1960's...it's made to give you a good laugh and to leave a smile on your face. And that it did. I particulary like the relationship between Agnes and Marion...I think it was a perfect display of women's relationships, and how they change and grow over time. I admit I found the characters a bit \"oirish\" at times, but it was lovely and fun. I give it 7/10.",
         "In Dublin, 1967, a woman with seven children is suddenly faced with the travails of widowhood in `Agnes Browne,' directed by and starring Anjelica Huston. After the unexpected death of her husband, life becomes something less than a picnic for Agnes (Huston), what with children ranging in age from two to fourteen and no assets to speak of. She keeps her head above water and some food on the table by selling fruit at an outdoor market, but makes barely enough to make ends meet, while she awaits her widow's pension from her late husband's union. But even when and if it comes, she realizes it won't be enough on which to live. It's a bleak state of affairs for Agnes, who luckily has a dear friend, Marion (Marion O'Dwyer), who is always there for her; and with friendship, a sense of humor, and the dream of seeing Tom Jones in concert, it's enough to keep her going as she manages to take it all one day at a time. There are poignant moments in this character driven, heartwarming film, as well as some funny ones; Huston has done an outstanding job of creating a mood and an atmosphere that brings the Irish working class vividly to life, and she populates her landscape with characters who are not only real, but incredibly rich in their humanity. She captures the heart of Agnes and the others with an emotional depth that draws in the viewer and allows the empathy through which an intimate bond with the characters is established. And they quickly become more than just characters in a story; these are people you come to care about, and when something bad or untoward happens to any of them, you feel it just as deeply as they. Huston gives a terrific performance as Agnes, imbuing her with both a strength and vulnerability that make her real. She has a look of world-weariness about her, but there's a glint of hope and humor in her eyes, which are like a doorway to her soul; you need only look there to know what she is feeling inside. And Huston plays it all so perfectly. In her motion picture debut, O'Dwyer gives a memorable performance as well, as Marion; though nondescript in appearance, there is nevertheless something charming about this woman, and it has everything to do with `character.' Through her unwavering loyalty to Agnes she personifies the meaning of friendship, and exemplifies how invaluable a true friend can be, especially in times of need. It's a touching portrayal that is one of the strengths of the film. The supporting cast includes Niall O'Shea (Mark), Ciaran Owens (Frankie), Roxanna Williams (Cathy), Carl Power (Simon), Mark Power (Dermot), Ray Winstone (Mr. Billy), June Rodgers (Fat Annie), Jennifer Gibney (Winnie the Mackerel) and Tom Jones as himself. No stranger to all things Irish, Huston was the perfect choice to star in and direct this project. With `Agnes Browne,' she succeeds splendidly, with a film that is striking both visually and emotionally. And, lest it be taken for granted, one need but consider Alan Parker's `Angela's Ashes,' which visited the same territory but came off flat and uninspired, especially compared to Huston's film, which so distinctly and fervently imparts the essence of the proud Irish poor. Largely ignored during it's theatrical release, this film hopefully will find a second life on DVD and video, and realize the acclaim it so richly deserves. A real sleeper, this is a gem of a film just waiting to be discovered. I rate this one 8/10.",
         "This is definitely a chic-flick, but a very good one. Angelica Huston's Irish accent is absolutely fabulous (her bio says she went to school in Ireland). Angelica and her co-star Marion O'Dwyer bond very well together; I felt like I was glimpsing into a real true-life friendship. There is a very funny scene between the two when they are comparing their romances that is sure to make even the strictest of movie critics crack a smile. And the 7 children that play Angelica Huston's kids are an asset to the movie. This is an endearing, quality independent film for those of us who love a good drama as well as some good chuckles! I am looking forward to reading the trilogy novels by Brendan O'Carroll--which was the basis of this film.",
         "I thoroughly enjoyed this directorial effort by Angelica Huston. Her acting, as well as that of the actress who plays Marion Monks, was outstanding. Left a widow with seven children, Agnes Browne, is undaunted in her spunk and determination to rise above adversity. Agnes' best friend nearly steals the movie with her believable, heartwarming performance as the down-to-earth, pungently irreverent, Marion Monks. The children, (all seven of them) never seem like actors. The French baker next door also adds flavor as the love interest. Working-class Ireland in the poor section is seen realistically but with much more kindness and hope than Frank McCourt's world of Angela's Ashes. Excellent and underrated film--highly recommended.",
         "Yet another hidden gem. As a dealer in new and used movies, especially since I specialize in unusual, out-of-print, Indies, foreign, and other non-mainstream titles, I have the opportunity to discover many films in the hidden-gem category, like this one. Films get my attention when the demand is unusually high. This is no guarantee that the film is a good one, but if other factors are favorable, I may watch it. This one's a winner. On my first viewing I thought it was a nice little film but nothing special. Mild thumbs up. I'm not sure why, but about a year later I decided to watch it again. I enjoyed it more the second time. Six months later I watched it a 3rd time and it seemed better yet. Today I watched it for the fourth time and I enjoyed every moment of it tremendously. The opening scene is just delicious, and hilarious. Even though I have a pretty good ear for the Irish idiom, I turned on the English subtitles and caught some bits of dialog that were not clear before. If you are a film student, this a good one to study. It is extremely well crafted. Yes my dears, with no big stars and a small budget, you can make a fine film. The camera work is first class. Lighting is perfect. The colors pop out at you. No doubt Ms. Houston sought to bring her Ireland to life with all of it's vivid vitality, and she succeeded. She squeezed a lot into a small film. Humor, music, romance, pathos, and even a little suspense. Perfect editing. The film never lags. Perfect pacing. Perfect storytelling. Nothing is unnecessary and nothing is missing. Yes, it is a bittersweet tale, but so is life. We have all been there. Agnes Browne and her brood are good souls, instantly likable. The beaming faces of those kids, ah, they'll steal your heart. That's what makes this movie a winner above all else. It's a movie with heart.",
         "I think some of the others who commented on this movie were too harsh...it's not meant to be a human drama of great porportions. It's simply a fun, fairy tale that is a feel good movie. It's not made to make you think about the social plight of widowed Irish mothers in the 1960's...it's made to give you a good laugh and to leave a smile on your face. And that it did. I particulary like the relationship between Agnes and Marion...I think it was a perfect display of women's relationships, and how they change and grow over time. I admit I found the characters a bit \"oirish\" at times, but it was lovely and fun. I give it 7/10.",
         "This is an excellent picture of the life of working-class women on the housing estates ('projects' to Americans,probably as true now as in the 'sixties, as well as being a very good movie for women actors. The men are cyphers but the women and children are real enough. The colour is almost real (compared to Angela's Ashes), the dialogue believable, the dress and make-up accurate, in fact the design of the whole piece is convincing and satisfying visually and its sentimentality is not so sweet as to stick to back of the teeth. Anjelica Huston is unselfish. I have my doubts about Tom Jones' scenes at the end, but nothing's perfect. I find it growing on me as I look back on it.",
         "AGNES BROWNE (1999) **1/2 Anjelica Huston, Marion O' Dwyer, Ray Winstone, Tom Jones (cameo). Huston, who also co-produced with filmmaker Jim Sheridan and directs in her big-screen debut, gives it her all as stoic, decent Irish mother of seven in Dublin circa 1967 whose adjustment to widowhood takes its toll in her daily struggle to keep her brood under wraps even as she attempts to enjoy her life as it proceeds. Straight forward but no real sense of palpable tension even as it dredges up the themes of death, poverty and an unsteady future.",
         "Truly a heartwarming story of friendship with Marion and Agnes, but when the whole community is thrown in what an amazing film about friends and friendship. Angelica Huston has captured the essence of Ireland , it's people and their language. Tossed with a bit of Tom Jones and.......",
         "What a refreshing and delightful movie, depicting the conquering of the human spirit in the face of adversity in a humorous, yet profound way. This is probably one for the more 'mature' in life, thus the low ranking. The acting is superb, the casting brilliant, the directing great.. it's a top movie in my books! Anyone who has ever tried, or is trying, 'single parenting', will really relate to this one in a special way. I had heaps of laughs and lot of tears too. Not bad for a male who also likes movies like the 'Fight Club'."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Hell's Kitchen Films",
         "October Films"
      ],
      "summaries": ["The unexpected death of her husband sends a woman and her seven children, ages 2-14, into emotional turmoil and financial crisis in 1967 Dublin. She is forced to borrow money from a ruthless loan shark to make ends meet. She faces her dismal existence by selling fruits and vegetables at an open air market where she spends time with a best friend who gives her encouragement. Wishing to escape her existence, if only for a short time, she dreams of finding enough money to attend an upcoming Tom Jones concert. She realizes her dream by accepting her first date with a French baker. Her kids pool their money so she can buy a new dress. Of course, eventually the family has to face the loan shark, but this is a movie where obstacles are maybe too easily overcome."],
      "budget": 0
   },
   "movielensId": 3124,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-11-08",
      "dvdReleaseDate": "2000-08-22",
      "directors": ["Anjelica Huston"],
      "runtime": 92,
      "movieId": 3124,
      "title": "Agnes Browne",
      "mpaa": "R",
      "actors": [
         "Anjelica Huston",
         "Marion O'Dwyer",
         "Niall O'Shea",
         "Ciaran Owens",
         "Roxanna Williams",
         "Carl Power",
         "Mark Power",
         "Gareth O'Connor",
         "James Lappin",
         "Ray Winstone",
         "Arno Chevrier",
         "Gerard McSorley",
         "Tom Jones",
         "June Rodgers",
         "Jennifer Gibney"
      ],
      "imdbMovieId": "0160509",
      "originalTitle": "Agnes Browne",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "When Agnes Browne's husband died, she discovered something amazing... Herself.",
      "tmdbMovieId": 15506,
      "avgRating": 3.19032,
      "releaseYear": "1999",
      "numRatings": 155,
      "posterPath": "/n7VbmERQZKTedbdHjRrURMA7hbM.jpg"
   }
}