{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0160513",
      "video": false,
      "title": "A Map of the World",
      "recommendations": [
         294261,
         259658,
         40562,
         50225,
         75531,
         93263,
         70515,
         53734,
         11871,
         82432,
         2074,
         5332,
         41127,
         41801,
         84278,
         41007,
         110598,
         17168,
         60792,
         28026
      ],
      "backdrop_path": "/pEQOrUnWasc1MIaatzwaIZLoO2Z.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Alice Goodwin",
               "gender": 1,
               "credit_id": "52fe48b4c3a36847f81750c1",
               "name": "Sigourney Weaver",
               "profile_path": "/gxBIAr3CnBjkNRoPovVJCvEGqP0.jpg",
               "id": 10205,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Howard Goodwin",
               "gender": 2,
               "credit_id": "52fe48b4c3a36847f81750c5",
               "name": "David Strathairn",
               "profile_path": "/5P9hWKVBXVD6bNdDO3O7upa1A6S.jpg",
               "id": 11064,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Theresa Collins",
               "gender": 1,
               "credit_id": "52fe48b4c3a36847f81750c9",
               "name": "Julianne Moore",
               "profile_path": "/v2FcWGiiuvl6P7NV0966jNL09uh.jpg",
               "id": 1231,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Carole Mackessy",
               "gender": 1,
               "credit_id": "52fe48b4c3a36847f81750d1",
               "name": "Chloë Sevigny",
               "profile_path": "/54k4DrrkDmYhA4rRVt57CUkrVS6.jpg",
               "id": 2838,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Debbie",
               "gender": 1,
               "credit_id": "52fe48b4c3a36847f81750cd",
               "name": "Sara Rue",
               "profile_path": "/1OlEg9M8oSsGivjyFJJFyCkKqkk.jpg",
               "id": 10131,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Robbie Mackessy",
               "gender": 2,
               "credit_id": "546d4ddbc3a3685ab60008c8",
               "name": "Marc Donato",
               "profile_path": "/jdP3gZVywVFLljMtRO2rEJNv9Mv.jpg",
               "id": 112600,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Dan Collins",
               "gender": 2,
               "credit_id": "546d4de8c3a3685aa8000865",
               "name": "Ron Lea",
               "profile_path": "/g8q5de1Axmnvm8dXnOBgNJeK9J2.jpg",
               "id": 44248,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Audrey Collins",
               "gender": 1,
               "credit_id": "546d4dfcc3a3685ab300084b",
               "name": "Hayley Lochner",
               "profile_path": null,
               "id": 1236553,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Nellie Goodwin",
               "gender": 1,
               "credit_id": "546d4e0cc3a3685ab9000868",
               "name": "Louise Fletcher",
               "profile_path": "/A4Cn7LsuLlOXvOMKv5ez4ThyeZL.jpg",
               "id": 7071,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Paul Reverdy",
               "gender": 2,
               "credit_id": "546d4e209251414c78000580",
               "name": "Arliss Howard",
               "profile_path": "/zDBEVA7Skrje3A8bmR2VOJRwkZc.jpg",
               "id": 3229,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Dyshett",
               "gender": 1,
               "credit_id": "546d4e2d9251414c78000582",
               "name": "Aunjanue Ellis",
               "profile_path": "/xo8wv5fhpxAPnNA7HS7WH8psguQ.jpg",
               "id": 53923,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Sherry",
               "gender": 1,
               "credit_id": "546d4e399251414c78000586",
               "name": "Nicole Ari Parker",
               "profile_path": "/vvEt8sXPKm9HxxDrHyg9aIxwvEM.jpg",
               "id": 74615,
               "order": 11
            },
            {
               "cast_id": 19,
               "character": "Lynelle",
               "gender": 1,
               "credit_id": "546d4e439251412bad0007ff",
               "name": "Bruklin Harris",
               "profile_path": "/jbYhvYwDIMQK3tlZlY5eUN9bOAx.jpg",
               "id": 188642,
               "order": 12
            },
            {
               "cast_id": 32,
               "character": "Little Alice",
               "gender": 1,
               "credit_id": "5a921a3d9251410b030016c9",
               "name": "Sarah Rosen Fruitman",
               "profile_path": "/drRwow1FjvUpqgMa7ZNSatoVSZj.jpg",
               "id": 558342,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe48b4c3a36847f81750ab",
               "name": "Peter Hedges",
               "profile_path": "/f9LzlH4veKD7XFMbB2xEUg53fhj.jpg",
               "id": 3290,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe48b4c3a36847f81750b1",
               "name": "Scott Elliott",
               "profile_path": null,
               "id": 161784,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe48b4c3a36847f81750b7",
               "name": "Jane Hamilton",
               "profile_path": null,
               "id": 161818,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 1,
               "credit_id": "52fe48b4c3a36847f81750bd",
               "name": "Polly Platt",
               "profile_path": null,
               "id": 21067,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "55589e6dc3a368777200912c",
               "name": "Kathleen Kennedy",
               "profile_path": "/6rGtk7OdbkO2QDM2OQxt9Blww3O.jpg",
               "id": 489,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "55589e8892514141e4000c90",
               "name": "Frank Marshall",
               "profile_path": "/dVPOD85wQ1Xscpe3DOVQ1I59IIF.jpg",
               "id": 664,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "55589f2d92514129b7002246",
               "name": "Seamus McGarvey",
               "profile_path": "/yXEsxEMHlMDemBy8JrHZFAmd3uD.jpg",
               "id": 3285,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "55589f4692514129b700224d",
               "name": "Tina Gerussi",
               "profile_path": null,
               "id": 42306,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "55589f5f9251410b39000f05",
               "name": "Avy Kaufman",
               "profile_path": "/yQPGktsmkKkhkOQAUlmYlxHJOiJ.jpg",
               "id": 2952,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "55589f7292514141e4000caf",
               "name": "Naomi Geraghty",
               "profile_path": null,
               "id": 2597,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "55589f86c3a368776f009d81",
               "name": "Craig McKay",
               "profile_path": null,
               "id": 4869,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "55589f9ec3a368777200915d",
               "name": "Richard Toyon",
               "profile_path": null,
               "id": 1446658,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "55589fdac3a3687779007f61",
               "name": "KEi",
               "profile_path": null,
               "id": 61655,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 1,
               "credit_id": "5558a011c3a368777e008758",
               "name": "Megan Less",
               "profile_path": null,
               "id": 17235,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "5558a023c3a368777e00875c",
               "name": "Suzette Daigle",
               "profile_path": null,
               "id": 1468104,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "5558a0439251412ff9007260",
               "name": "Anna Rane",
               "profile_path": null,
               "id": 1345635,
               "department": "Directing",
               "job": "Script Supervisor"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.409602,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 54933,
      "vote_count": 13,
      "budget": 0,
      "overview": "School nurse Alice Goodwin lives with her husband and two daughters on a dairy farm in a small Wisconsin community. After an accident on her property involving a friend's child, the town turns against her and Alice finds herself fighting charges of child abuse.",
      "similar": [],
      "original_title": "A Map of the World",
      "runtime": 125,
      "poster_path": "/4BptsbrpUp7tlLzahxr7LmfKPmB.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Overseas FilmGroup",
            "id": 888,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Cineventa",
            "id": 29072,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "First Look International",
            "id": 11054,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "The Kennedy/Marshall Company",
            "id": 862,
            "origin_country": ""
         }
      ],
      "release_date": "1999-09-13",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "A woman's life falls apart after she's blamed for an accident on her property.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Scott Elliott"],
      "runtime": 125,
      "synopsis": null,
      "writers": [
         "Jane Hamilton",
         "Peter Hedges"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0160513/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU3MzEzNTUzOF5BMl5BanBnXkFtZTcwMjc4NjUyMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Sigourney Weaver, Julianne Moore, Dara Perlmutter | See full cast and crew »"],
      "reviews": [
         "Strong performances by Sigourney Weaver and Julianne Moore highlight this involving and, at times emotionally draining film about the boundaries that are inherently a part of our lives, and the limits of those boundaries, both in how much we are able to give, as well as how much we can take. `A Map of the World,' directed by Scott Elliott, examines the confines of the parameters within which an individual must live, and the finite capacity of any one person to endure stress that exceeds the specific limitations established for that individual by nature. And it's not a matter of one knowing one's limitations; rather it is a matter of knowing how to cope with the results, once one has been driven past the breaking point into a world that can no longer be viewed in black and white, but only in shades of gray-- that point beyond right or wrong or what is politically correct; the point at which nothing matters but survival-- how to live in a world that can have so much to offer, while being so relentlessly unmerciful and decidedly unforgiving at the same time. Transplanted from the big city to a farm in Wisconsin, Alice and Howard Goodwin (Sigourney Weaver, David Strathairn) are attempting to make a go of their own dairy business. But it isn't easy. Howard is immersed in his work, while Alice, in addition to taking on the full time responsibilities and pressures of raising their two daughters and maintaining the household, also works as a school nurse. And though Alice likes her life, the constant strain of keeping her own life on task, as well as seemingly everyone else within her sphere of existence, begins to take a toll on her. With no respite from the daily grind, Alice becomes increasingly exhausted and exasperated. She finds some solace in her close friend, Theresa Collins (Julianne Moore), but what she really needs is some time to herself; some time to clear her head and regroup. Instead, an unexpected summer tragedy strikes the Goodwin and Collins households, which damages Alice's much needed relationship with Theresa. And as if that isn't enough, further trials and tribulations are about to descend upon Alice-- one of those curves life has a way of throwing at you when it's least expected, or needed. And it's something that will test the limits of Alice's capacity to endure, more than ever before. Working from a remarkably insightful screenplay by Peter Hedges and Polly Platt (adapted from the novel by Jane Hamilton), director Elliott presents a genuinely honest film that takes an in-depth look at what it often takes just to `maintain' on a daily basis, and the very real issues and situations that a person like Alice is apt to encounter. From the very beginning, Elliott establishes the credibility of the film by creating an atmosphere and setting that is entirely real-- so real, in fact, it will be more than a bit disconcerting to many who will so readily be able to identify with Alice and relate to her situation. And, having effected such realism, Elliott then moves on to deliver a thoroughly engrossing, emotional drama, which he renders with great care and sensitivity. Elliott achieves success with this film through an obviously keen understanding of the material, the story, and the characters and their corresponding attitudes and reactions to given situations. And he keeps it `real' throughout by eschewing any superfluous melodrama or sub-plots, the likes to which a film like this in lesser hands could easily lend itself. In the final analysis, Elliott knows what he wants to convey, and furthermore, knows how to do it by exacting the kind of performances from his actors that really sells it. As often happens (too often, in fact), the extraordinary performances in this film were inexplicably overlooked (as well as the film itself) and/or ignored. Sigourney Weaver gives a commanding performance as Alice, arguably as affecting and effective as the work that earned Hillary Swank the Oscar this year for her portrayal of Brandon Teena in `Boys Don't Cry.' This is quite simply some of the best work Weaver has ever done, and it's a shame that she has not enjoyed the kind of acclaim that would accompany such an accomplishment in a perfect world. Which adds some irony to the whole thing, inasmuch as part of what this film is attempting to convey (and does so, successfully) is that we do not, in fact, live in a perfect world. All that aside, this is a memorable portrayal, in which Weaver exhibits a phenomenal depth and range of emotion. The field was strong in the Supporting Actress category this year (Angelina Jolie received the gold for `Girl Interrupted'), but Julianne Moore's performance here stands alongside any of those honored with a nomination for their work. Like Weaver, Moore faced the challenge of creating a character that is so mainstream and `normal'-- one of those everybody's neighbor or the-clerk-at-the-store type of roles-- that the real difficulty lay in making it look so natural, which when successfully effected, makes it all look so `easy.' Which is exactly what Moore did with her portrayal of Theresa. And-- again, like Weaver-- it's a performance for which she has never received the deserved acknowledgement. Suffice to say, it's terrific work, and a big part of what makes this film so emotionally stirring. Also effective is David Strathairn as Alice's self-absorbed husband, Howard, a man suffering from a terminal case of tunnel vision. How good he is here, in fact, can be measured by the feelings of disdain he manages to evoke toward his character, which at times, is quite substantial. The supporting cast includes Arliss Howard (Reverdy), Louise Fletcher (Nellie), Sara Rue (Debbie) Nicole Parker (Sherry) and Aunjanue Ellis (Dyshett). An ardently thought provoking film, `A Map of the World' invites a sense of introspection and reflection; a film that's definitely going to make you do some thinking. 9/10.",
         "\"A Map of the World\" is easily one of the most honest films I've ever seen. The merits go specially to a very fine cast and a clever, well written screenplay. Sigourney Weaver really shines here, in an Oscar caliber performance, as Alice Goodwin, a woman who is not afraid to show what she is feeling. She is married, has two young girls, lives in a farm and works at a school nursery. Her life seems calm, but happy, until a terrible accident happens, followed by a sad mistake, and her life falls apart. \"A Map of the World\" had everything to be a bland and conventional film, but it is not. I have to say that I don't give any merit to the direction- this is indeed the main problem. The director doesn't captivate the audience, and doesn't seem to care about that. There are many slow moments and scenes that could have been cut. But \"A Map of the World\" is a rarity- a very good film with mediocre directing. Who is the miracle maker? Sigourney Weaver, surely. She shows passion for acting and an incredible strength as Alice Goodwin. I can't imagine anyone else playing Alice, because Sigourney is perfect building her character. The Oscar was gone, but I put Weaver on my list of snubbed stars this year. But she doesn't work alone- Julianne Moore is here, and when she is in you can expect much. I'm a fan of Ms. Moore since I've seen her in \"Short Cuts\", and now that I've seen \"Magnolia\" (if you've read some of my reviews you know how much I praise \"Magnolia\") I'm starting to adore this lady. She shines even in slapstick comedies as \"Nine Months\"... There's nothing she can't do! Getting back to \"A Map of the World\", I have to say that I appreciated very much its screenplay. It was written with strength, trying to escape of the clichés even in courtroom scenes. There are many beautiful messages the film has to pass and it should be admired for this. It shows that everyone commits mistakes, more than one time, and that is why we are ordinary people, with qualities and flaws. We should learn with ourselves and with the others. We should believe in ourselves and try to cope with our mistakes. The film has messages like these to learn, and many others, resulting in a complex study of people in conflict. I truly recommend \"A Map of the World\", despite its flaws. Watch it for Sigourney, Julianne and the messages and forget the weak directing. It is a worth seeing.",
         "Sigourney Weaver offers a marvellous performance in this film, playing mother and school nurse Alice Goodwin, whose world is torn apart after the death of a friend's child on her property, and the lodging of a sexual assault charge by the mother of one of the students she deals with on a regular basis. This is most definitely NOT a light movie. It has adult themes, and some very troubling subject matter. As good as Weaver is, the supporting cast also offers some very powerful moments. David Strathairn portrays Howard Goodwin, Alice's husband, as he helplessly watches the community turn against the entire family, and as he struggles with the decisions that need to be made to free Alice. Julianna Moore (as Theresa Collins, the mother whose child died while being watched by Alice) is very believable as the grieving mother, struggling with her anger toward Alice over her daughter's death, and yet also convinced that the assault charges against her are ridiculous. The scenes between Strathairn and Collins, both playing vulnerable characters dealing with circumstances completely beyond their control, are raw with emotion. The only performance I found truly disappointing was that of Arliss Howard as attorney Paul Reverdy. I didn't find him believable in the role. All in all, though, this is a strong movie, and well deserves an 8/10.",
         "When I finished this film, I was sure that it ran over two and a half hours. In reality, it was only 125 minutes. That reveals something about the pace. If you can imagine a worm burrowing through granite, you have the idea. Actually, the story was a good one. The problem was the screenplay and the direction. This is a story of Alice Goodwin (Sigourney Weaver) a city girl who has moved to the country so her husband could try his hand at farming. However, this is no Green Acres. Alice is having difficulty coping with country life and her relationship with her two children. One day she is minding a friend's children and leaves them playing with her own children momentarily to put on her bathing suit. Upon returning, she discovers one of her friend's little girls missing and after a desperate search finds her face down in the pond. Subsequent to this tragic accident, Alice is accused of child abuse by another child who claims she molested him in her duties as school nurse. The two incidents together turn the whole town ugly as they assume she must be guilty. The story is an in-depth character study of Alice and her struggle to cope with both her guilt and innocence. The guilt is her feeling of responsibility for the little girl's drowning and the innocence is the knowledge that she is not a child abuser. Usually I enjoy complex character studies with deep conflicting emotions, but this one left me exhausted. This is not because of the story, but because of the script and the presentation by Director Scott Elliot. Far too much time was spent on scenes that weren't really interesting or relevant. The dialogue often seemed inconsistent with the characters, especially in Howard's (David Straithairn) case. The lawyer was made to look like a buffoon. Having seen Arliss Howard in a number of other films, I know he is a capable dramatic actor so I have to assume this was the director's interpretation of the character. Sigourney Weaver has received much critical acclaim for this performance, but I found it to be somewhat uneven. She was superb in parts, especially the parts where she was playing the strong woman trying to hold it all together. However, she seemed to struggle with the vulnerable parts, as if she wasn't comfortable with the character. I realize that part of the point was that Alice wasn't comfortable in her own skin and used a lot of defense mechanisms to cope, but Weaver seemed unnatural and forced in these scenes. She seems to have a lot tougher time playing weakness than strength. In that regard, Julianne Moore's performance was much better. Her breakdown scene in the woods was compelling and heartrending. David Straithairn was well cast as the self-sacrificing and supportive husband, a role with which he is well familiar. However, he too seemed uncharacteristically tentative. When veteran actors have so much trouble giving confident performances, one has to wonder if there was a disconnect between the actors and the first time director. Overall, despite some good performances and a solid story, the whole project just didn't come together and dragged ponderously from scene to scene. I rated it a 6/10. For patient viewers only.",
         "This film could terrify some. It is certainly gripping, but it's carried by superb performances by Sigourney Weaver and Julianne Moore. The only film I can think of that is quite as moving is another Sigourney Weaver film, Death and the Maiden. The tone of the two is very similar, but there is more hope in this outing. It still isn't something for the kids. But if you love acting, if you love to see real emotions rather than concocted attempts to feel, then watch it. And remember to keep your own Map of the World.",
         "Stage director Scott Elliott had his hands full with this story, and while it has its moments, overall his choices didn't really add up to a winner. Some people have sleighted this movie because of how \"quickly\" the trial is taken care of near the end, but in fact the book is the same way, and for good reason: the trial is not what the story is about. Unfortunately, as with so many book-to-film translations, the poetry of the prose and thus some of the deeper meanings are lost. Some of the changes between the film and the book work effectively to condense dozens of pages into one idea (the \"wall of baby pictures\" in the jail helps quickly convey Alice's changing relationship with her unit mates), but other changes only serve to hammer home a point that was made with much more subtlety in the book. (Did we really need angry graffiti on the side of the Goodwin's house? WE GET IT -- the town didn't like them!) Pat Metheny's original soundtrack was beautifully melodic, as he usually is, but it didn't fit in with the feel of the movie, and surprisingly, it didn't have much of the Midwest sensibilities one would expect from a composer from Missouri. Nonetheless, this movie will at least be worth a video rental, especially if you are a Sigourney Weaver fan and want to see her doing something other than an _Alien_ pic. While it took me awhile to warm to it, her portrayal of Alice in the end is stunning, and much more complex than anything else in this movie.",
         "It is a pity that \"A Map of the World\" was not better directed. It had it all, a wonderful story, brilliant actors but the movie somehow lacked guidance. In spite of this problem, Sigourney Weaver was nothing short of magnificent, her performance did deserve an Academy Award nomination. It is astonishing how well she plays roles that range from comedy to drama, always doing it beautifully. If \"A Map of the World\" were to be directed by somebody else, it would have been a masterpiece.",
         "It's not an easy subject at all. It's about the life of a married woman (a city woman) in a farming small town environment, with two young daughters and a not quite communicative husband, how things just happened one day out of the blue, and the subsequent unexpected spin-off events turning her life topsy turvy, and her unusually calm approach to it all. Nothing is what it seems - we just have to ride the enduring travails with the three principal characters. Very mature performance by Sigourney Weaver as Alice Goodwin, the seemingly always self-assured, independent, educated person in control: as the wife giving instructions to her husband, as the mother handling her daughters, as the school nurse attending to the kids. She always knows what she's saying or doing. Yet she's actually holding back a lot of mixed emotions within herself, unable to let go, most of all, unable to forgive herself. Julianne Moore is Theresa, a good friend and neighbor to Alice. She gave another supporting nuance performance. David Strathairn is Howard the quiet gentle husband. Arliss Howard is the assured lawyer that Alice wanted for the case; he commented he has never seen anyone took to these wrongful accusations so well, and asked what's her trick to keep so calm and collected, to which she replied, \"Have you ever wanted to go away on an island\u0085\" That's how she felt about being away from it all - that world of conceivable madness outside. The three principals are veteran actors who have matured with such elegance and in multiple intelligent roles: Sigourney Weaver is far beyond the queen of alien movies since 1979 with the subsequent three sequels, she has been the unattainable woman opposite William Hurt in 1981 \"Eyewitness\", Mel Gibson in 1982 \"The Year of Living Dangerously\", Michael Caine in 1986 \"Half Moon Street\"; delivered tour de force performances in 1988 \"Gorilla in the Mist\", 1994 \"Death and the Maiden\", 1995 \"Copycat\". Twice opposite Kevin Kline in 1993 \"Dave\" and 1997 \"The Ice Storm\". Comedy-wise, she shines as one of the super fun members in 1984 and 1989 \"Ghostbusters\" flicks, the wicked boss to Melanie Griffith in 1988 \"Working Girl\", and yet another fun member of the hilarious team in 1999 \"Galaxy Quest\". David Strathairn - I first remembered him in director Phil Alden Robinson's 1992 \"Sneakers\" with the fun ensemble cast of computer wizards Robert Redford, Sidney Poitier, River Phoenix, Dan Aykroyd; Strathairn was the wiz who's blind and what an outstanding performance he did. His other roles have been pretty much the subtle supporting man, e.g., to Mercedes Ruehl in 1993 \"Lost in Yonkers\", as the pastor in 1998 \"Simon Birch\", but he was definitely front and center in his long time association (since 1980 and seventh time round) with John Sayles in 1999 \"Limbo\", delivering a terrific performance opposite Mary Elizabeth Mastrantonio and Vanessa Martinez. Julianne Moore - I remember her initially in Robert Altman's stellar ensemble cast of 1993 \"Short Cuts\", then her unforgettable performance in Todd Haynes' 1995 \"Safe\"; she stands out in another ensemble cast in Paul Thomas Anderson's 1997 \"Boogie Nights\". In 1999, she's in five films: an outstanding delivery playing opposite Glenn Close in Altman's fun ensemble piece \"Cookies Fortune\"; another ensemble tongue-whipping cast in Oscar Wilde's \"An Ideal Husband\" (Oliver Parker directed); yet part of another ensemble engineered by P.T. Anderson in \"Magnolia\"; then front and center as the love of Ralph Fiennes' character in Neil Jordan's \"The End of the Affair\"; and here an effective supporting role in \"A Map of the World\". Bold (debut) direction by Scott Elliott. A bonus is the film scored by the Pat Metheny Group - the guitar plus strings aptly complemented the mood and flavor of the plot. This film may not be for a teenage audience, it certainly warrants mature appreciation.",
         "kudos to Sigourney Weaver for yet another outstanding and sympathetic performance. David Straithairn also is effective as the husband, caught in a web of chaos; Weaver as a school nurse is accused of child abuse in a small Wisconsin town; this after a child she is babysitting accidentally drowns. (The mother of the drowned child is portrayed by Julianne Moore). Look for an excellent part with Arliss Howard as the defense attorney; it is a shocking surprise that 5 other children come forward accusing Weaver; it develops into a sort of witch hunt- and the actress playing the prosecutor is quite odious. \"A Map of the World\" is not an easy story to take to; there are many complicated and also malicious sides of several characters; The character Weaver portrays is complex; guilty, and angry about a child accidentally dying, she accepts prison as an appropriate sentence, and even injures herself; She remains sympathetic however, throughout this film, and that is a rare talent that many actors could NEVER carry off. A must see. 9/10.",
         "There are movies which are absorbing just because there are actors who are able to transcend an academic directing :Sigourney Weaver is part of them ,and she gets fine support from the whole cast (with the eventual exceptions of the two lawyers ,two cardboard characters,and some of the jail inmates). \"Crime and punishment\" would be another apt title for \"map\" :that's the book the heroine claims (along with Laura Ingalls Wilder's \"little house\",a return to childhood's kingdom,\"Walnut Grove\" being another world like the one she drew on her map) when she's in jail.Sigourney Weaver portrays a woman with a strong guilty feeling because of two events in her life (one minor with a pupil,another one,quite tragic).When she's unfairly charged with abuse,she accepts the punishment.When she's in jail,she's beaming,and nobody really understands her.More,she still thinks it's not enough (the self-inflicted wounds are revealing).It takes all Weaver's talent to make this complex character credible .Moore's evolution makes sense as well.She too feels guilty and her behavior does not shock. \"Map\" tells a story which concerns us all: Its core is responsibility. Recommended."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Cinerenta Medienbeteiligungs KG",
         "Cineventa",
         "First Look International"
      ],
      "summaries": [
         "School nurse Alice Goodwin lives with her husband and two daughters on a dairy farm in a small Wisconsin community. After an accident on her property involving a friend's child, the town turns against her and Alice finds herself fighting charges of child abuse.",
         "A woman's life falls apart after she's blamed for an accident on her property."
      ],
      "budget": 0
   },
   "movielensId": 3128,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-09-13",
      "dvdReleaseDate": "2000-09-19",
      "directors": ["Scott Elliott"],
      "runtime": 125,
      "movieId": 3128,
      "title": "A Map of the World",
      "mpaa": "R",
      "actors": [
         "Sigourney Weaver",
         "David Strathairn",
         "Julianne Moore",
         "Chloë Sevigny",
         "Sara Rue",
         "Marc Donato",
         "Ron Lea",
         "Hayley Lochner",
         "Louise Fletcher",
         "Arliss Howard",
         "Aunjanue Ellis",
         "Nicole Ari Parker",
         "Bruklin Harris"
      ],
      "imdbMovieId": "0160513",
      "originalTitle": "A Map of the World",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["26ytp0Z05jw"],
      "plotSummary": "School nurse Alice Goodwin lives with her husband and two daughters on a dairy farm in a small Wisconsin community. After an accident on her property involving a friend's child, the town turns against her and Alice finds herself fighting charges of child abuse.",
      "tmdbMovieId": 54933,
      "avgRating": 3.26019,
      "releaseYear": "1999",
      "numRatings": 319,
      "posterPath": "/4BptsbrpUp7tlLzahxr7LmfKPmB.jpg"
   }
}