{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "new york",
            "id": 242
         },
         {
            "name": "guitar",
            "id": 953
         },
         {
            "name": "jazz",
            "id": 1416
         },
         {
            "name": "night life",
            "id": 1759
         },
         {
            "name": "egocentrism",
            "id": 1906
         },
         {
            "name": "jazz musician",
            "id": 3017
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "pretty woman",
            "id": 156322
         }
      ],
      "imdb_id": "tt0158371",
      "video": false,
      "title": "Sweet and Lowdown",
      "recommendations": [
         11448,
         11382,
         28384,
         2639,
         10569,
         11337,
         2779,
         19200,
         15867,
         9716,
         10440,
         8217,
         30890,
         12762,
         9466,
         22478,
         9688,
         11561,
         22477,
         11562
      ],
      "backdrop_path": "/feGjikVrxhcXZMdk71i95CafrWT.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe451bc3a36847f80bccd7",
               "name": "Woody Allen",
               "profile_path": "/wpcOUlaszvJoVRf1yLbDtu7u4FI.jpg",
               "id": 1243,
               "order": 0
            },
            {
               "cast_id": 30,
               "character": "Himself",
               "gender": 0,
               "credit_id": "59a1ae7bc3a36847d402bd39",
               "name": "Ben Duncan (DJ)",
               "profile_path": "/h8ZKAcCMGUnVPyTpZsAEJy78Dqe.jpg",
               "id": 1877540,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "A.J. Pickman",
               "gender": 0,
               "credit_id": "52fe451bc3a36847f80bccdf",
               "name": "Daniel Okrent",
               "profile_path": "/FCkRrWHbhOQgpb5w9dkX2DFLqv.jpg",
               "id": 58520,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Boss",
               "gender": 0,
               "credit_id": "52fe451bc3a36847f80bcce3",
               "name": "Dan Moran",
               "profile_path": "/RYLy1wjivcyM8r5s4efax8901b.jpg",
               "id": 28040,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Ben",
               "gender": 2,
               "credit_id": "52fe451bc3a36847f80bcce7",
               "name": "Tony Darrow",
               "profile_path": "/ckz3hqyTyRiwVEauD6PBgvrQw0u.jpg",
               "id": 11482,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Ace - Pool Player",
               "gender": 2,
               "credit_id": "52fe451bc3a36847f80bcceb",
               "name": "Chris Bauer",
               "profile_path": "/3KYVMaGkWTEDQ0T9lsu85pVbP4T.jpg",
               "id": 4445,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Emmet Ray",
               "gender": 2,
               "credit_id": "52fe451bc3a36847f80bccef",
               "name": "Sean Penn",
               "profile_path": "/f2uy1zq0qmtLBpsr6N9uQ8FktOr.jpg",
               "id": 2228,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Don",
               "gender": 2,
               "credit_id": "52fe451bc3a36847f80bccf3",
               "name": "Darryl Alan Reed",
               "profile_path": "/nbgq1oMr9vAsxV653yZetx97zoN.jpg",
               "id": 58523,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Harry",
               "gender": 2,
               "credit_id": "52fe451bc3a36847f80bccf7",
               "name": "James Urbaniak",
               "profile_path": "/13cOcBh08yfhJQGvrnZ6ZteWfzw.jpg",
               "id": 58528,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Blanche",
               "gender": 1,
               "credit_id": "52fe451bc3a36847f80bcd07",
               "name": "Uma Thurman",
               "profile_path": "/6SuOc2R7kXjq3Em24KTNDW9qblJ.jpg",
               "id": 139,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Jake",
               "gender": 2,
               "credit_id": "52fe451bc3a36847f80bcd0b",
               "name": "Denis O'Hare",
               "profile_path": "/6NlYnzkp8QMfADWRNYNj6xAWes4.jpg",
               "id": 81681,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Hattie",
               "gender": 1,
               "credit_id": "52fe451bc3a36847f80bcd0f",
               "name": "Samantha Morton",
               "profile_path": "/zRvK2T98rz5smCwRiAaFRq1CoDo.jpg",
               "id": 2206,
               "order": 11
            },
            {
               "cast_id": 22,
               "character": "Mr. Haynes",
               "gender": 2,
               "credit_id": "52fe451bc3a36847f80bcd13",
               "name": "John Waters",
               "profile_path": "/4foU1kJ24CJwz2RVZgyc7oxMs4i.jpg",
               "id": 10367,
               "order": 12
            },
            {
               "cast_id": 23,
               "character": "Al Torrio",
               "gender": 2,
               "credit_id": "52fe451bc3a36847f80bcd17",
               "name": "Anthony LaPaglia",
               "profile_path": "/22sOEc37TsxxcnIl1XmucuW3IDl.jpg",
               "id": 57829,
               "order": 13
            },
            {
               "cast_id": 24,
               "character": "Joe Bedloe",
               "gender": 2,
               "credit_id": "52fe451bc3a36847f80bcd1b",
               "name": "Brad Garrett",
               "profile_path": "/wXihtlnIvqP2oSNj33hiorDd3v9.jpg",
               "id": 18,
               "order": 14
            },
            {
               "cast_id": 25,
               "character": "Ellie",
               "gender": 1,
               "credit_id": "52fe451bc3a36847f80bcd1f",
               "name": "Gretchen Mol",
               "profile_path": "/46mBoe7xf3pJgQLEYNw6Msniq3r.jpg",
               "id": 15370,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe451bc3a36847f80bccfd",
               "name": "Woody Allen",
               "profile_path": "/wpcOUlaszvJoVRf1yLbDtu7u4FI.jpg",
               "id": 1243,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe451bc3a36847f80bcd03",
               "name": "Woody Allen",
               "profile_path": "/wpcOUlaszvJoVRf1yLbDtu7u4FI.jpg",
               "id": 1243,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "571940a7925141769a000009",
               "name": "Santo Loquasto",
               "profile_path": null,
               "id": 23966,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "56a2cbb2c3a368388b000f85",
               "name": "Ray Fisher",
               "profile_path": null,
               "id": 1393558,
               "department": "Art",
               "job": "Leadman"
            },
            {
               "gender": 0,
               "credit_id": "58960a16925141294a008d9e",
               "name": "Zhao Fei",
               "profile_path": null,
               "id": 28001,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 5.521301,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9684,
      "vote_count": 140,
      "budget": 0,
      "overview": "A comedic biopic focused on the life of fictional jazz guitarist Emmett Ray. Ray was an irresponsible, free-spending, arrogant, obnoxious, alcohol-abusing, miserable human being, who was also arguably the best guitarist in the world.",
      "similar": [
         507,
         2142,
         3134,
         8649,
         298312,
         4771,
         769,
         594,
         205,
         873,
         101,
         281,
         281957,
         339692,
         244786,
         395834,
         8834,
         445954,
         8810,
         10285
      ],
      "original_title": "Sweet and Lowdown",
      "runtime": 95,
      "poster_path": "/23S5qa8j3ajYnERcYCqMLfSeOvw.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Magnolia Productions",
            "id": 21717,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Sweetland Films",
            "id": 21716,
            "origin_country": ""
         }
      ],
      "release_date": "1999-12-03",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Woody Allen"],
      "runtime": 95,
      "synopsis": null,
      "writers": ["Woody Allen"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0158371/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE2MzA5MDQ4NV5BMl5BanBnXkFtZTgwNjI4ODQxMDE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Sean Penn, Samantha Morton, Woody Allen | See full cast and crew »"],
      "reviews": [
         "A slow, rich movie. Though it lags in places, the three lead performances are indelibly written in my memory. And the great jazz soundtrack and warm colors made this movie go down like a glass of bourbon. Embodying the archetypal difficult genius, Emmet Ray is an almost cartoonishly dislikable guy. But Sean Penn keeps him just this side of sympathetic; we loathe his actions, we curse his self-destructiveness, and yet we're compelled to keep watching in the increasingly futile hope he'll turn himself around. His last scenes are heartrending. As Hattie, Samantha Morton strikes a perfect, almost Chaplinesque, balance of comedy and tragedy. The line separating the two is razor-thin; she dances gracefully upon it. I could say more, but perhaps appropriately, it's difficult to find words that capture the beauty of her silent performance. Half the joy is in watching her reactions naturally unfold anyway. Like Penn, Uma Thurman portrays a pretty unlikeable character. Her Blanche is overly intellectual, questions incessantly and is in some ways just as emotionally alienated as Emmett. Though her character is grating at first (particularly in contrast to Morton), Thurman does not shrink from the less flattering aspects of her character. It's a brave performance in a thankless role. Woody Allen has constructed a thoughtful meditation on the nature of artistry. Not on celebrity -- we all know how that film turned out -- but on the rights and responsibilities of the true artist. Emmett, Hattie and Blanche represent the axis of artists, fans and critics respectively. As their relationships play out -- naturally, inexorably and poignantly -- the viewer gets a rare treat: a film that plucks at the mind and at the heart as gracefully as Emmett picking his guitar strings.",
         "In my opinion, there is more than one type of Woody Allen film. There is the antic lunacy of films like Bananas and Sleeper, the serio-comic \"serious\" film with \"meaning\", like Annie Hall, Husbands and Wives and Deconstructing Harry and then there are what I think are Woody Allen's \"love notes\", if you'll bear with the expression, films like The Purple Rose of Cairo, Bullets Over Broadway and Sweet and Lowdown, films as a general rule that are period pieces (generally the '30's or thereabouts) that are basically mash notes from Allen to something Allen particularly cares about, such as jazz in Sweet and Lowdown (specifically jazz guitar and Django Reinhardt). The score is great, which is typical for a Woody Allen film. Allen does these little films vey well and they are almost always worth watching. Sean Penn plays a self-centered, egotistical creep with talent. I will leave any further interpretations regarding the preceding statement to the Gentle Reader. Why he was nominated for an Oscar escapes me. Samantha Morton, on the other hand, gives a sweet, if almost one-note, performance, which basically sums up the movie: worth the time and effort to watch, but a one-note film. If you like this side of Woody (and I do), this is worth seeing.",
         "Sean Penn plays Emmett Ray, a little-known jazz guitarist, an eccentric, egocentric genius self-proclaimed as the \"greatest guitar player in the country\" or the \"second greatest guitar player in the world\" - because of that gypsy from France, the bane of his life, Django Reinhardt. The story of Sweet and Lowdown is the story of Emmett and the girl he first describes as \"the little one with the silly hat,\" who is also, incidentally, called Hattie. There is something so special and memorable about the chemistry between Hattie and Emmett. Hattie is perfect for Emmett, because she's mute, and therefore he can sound off all day about how great he is, and she's the one person who won't contradict him. Woody has the knack of making highly watchable movies - and popping them out one a year. There is a continuity across them all, yet they all seem somewhat unique. Sweet and Lowdown stands heads and shoulders above every other film Woody has made since Husbands and Wives. With Sweet and Lowdown, Woody reminds us why we loved him in the first place - yet i'm not sure i can think of another Woody film that's as genuine, beautiful and moving, yet eccentric and funny at the same time. Annie Hall was probably as touching, but with Woody is no actor next to Penn, which i think makes an incredible difference! Penn brings to life a character so eccentric and unbelievable, yet we never doubt him, we never feel he's not a total human being. Penn's performance is counterbalanced by another equally moving performance by Samantha Morton as Hattie. Often you'll find yourself watching a two-shot with the both of them on screen, and you won't be able to decide which character you're more curious to watch. More often than not, you'll watch Samantha Morton, to see what Hattie is thinking and feeling. An extraordinary job by an extraordinarily talented actress you may have seen as the mother in In America or the pre-cog Agatha in Minority report. The one fault in the film is Uma Thurman - she is badly miscast and clearly only suited to intentionally hammy fodder like Kill Bill. Her character, Blanche, is great (\"Okay, so i slept with him, but i was just researching a book!\"), which makes it more the shame that Thurman speaks her line like she thinks this is a cartoon or a Tarantino movie. The audience will only accept the eccentricity of this style if the performances are genuine: she gets an F. She pops the bubble of this movie. When she appears, we suddenly realise its only a movie, and the spell is broken. Nevertheless, she's only in a relatively small portion of the film, and she can't bring down the rest of it. Sweet and Lowdown has the feeling of telling you a tale, and it spins some great fun yarns about little-known jazz guitarist Emmett Ray. Penn and Morton bring to life an incredible couple of characters - two of Woody's best creations. Well designed with nice period costumes and well directed, especially the magestic final crane shot (a reference to La Strada i believe). The story is beautifully punctuated with scintillating jazz music by Dick Hyman and others. \"Come listen,\" Emmett tells someone at one point, \"you'll love this, i'm great.\"",
         "This is a strange movie, but one made a little bit special to me because of one memorable character: \"Hattie,\" played by Samantha Morton. What a wonderful, endearing character! The sweet look on her face alone makes this movie worth keeping. Another huge positive for this film is the cinematography. This is beautifully shot with great colors which look all the better on DVD. As mentioned by other reviewers, Sean Penn also does an excellent job in the lead. The shocker for me was how good a comedic touch he exhibits. Putting his general persona or politics aside, this man deserves kudos as an actor. There is a third very different and interesting character in this movie: \"Blanche,\" played by Uma Thurman, who portrays an amoral woman in the last part of the film. She, too, is fascinating. So....three interesting characters, great photography AND terrific music - jazz guitar is a central part of this story - all make for a fun hour-and-a-half of entertainment.",
         "Sweet and Lowdown is the story of a fictional jazz guitarist who is self admittedly the second best in the world(next to that gypsy in France) but there is one thing that is clear while watching this movie, sean penn is second to no one. He is simply the greatest actor of our time and he once again proves it here. As emmett Ray, sean penn invests his very soul and embodies the role of a vain, talented, yet oblivious and cold hearted man who is actually filled with self doubt and remorse. The character is as crude a low life thief and pimp as he is a excellent musician. He is the zany, pathetic artist with a heart of stone. That penn can make you feel for him is no easy task. Penn also did an exceptional job mastering the appearance of playing the guitar for the role. Woody Allen has crafted a gem of a film filled with poignancy and humor. Samantha Morton is incredible as Hattie the mute girl who clearly worships everything about Ray, though Ray doesn't have the ability to notice a good thing when it's standing in front of his self absorbed face. That Ray is both a genius and a fool is clear and it's the emotional core of the film. He's just as at home shooting rats at the train tracks as he is performing drunk for his adoring audience. At the end of the movie there is a series of scenes in which the emotional weight of Rays mistakes seem to finally be understood by him. In one he meets Hattie again on the same boardwalk where they originally met, though she is now happily married and a mother. The false bravado of Rays personality seems to crack momentarily only to be swallowed again by his deluded machismo. The second even more heart wrenching is the final scene at the railroad with Gretchen Mol. Penn in an ill fated attempt to show off his skills for her seems to have all of his regrets, conceits and pain hit him at once. Watching Penn slowly remove the mask of Rays lonely broken heart is a gift, in an acting class of it's own. He is truly the master of American acting. Who won best actor in 2000? Russell Crowe in gladiator? And we wonder why penn doesn't believe in acting awards.",
         "Woody Allen has such control over the story telling tools of cinema that he can do whatever he wants. Mixing \"documentary\" comments about what is happening with the characters, and straightforward and yet superbly filmed feature sequences, Allen shows once again why he is one of the greatest film directors of our time. Good plot, great performances, skillfully constructed characters, excellent camera work... can you ask for more?",
         "This is a very enjoyable movie. It has many touches in it that are classic Woody Allen, so it should appeal to his many fans. It is also so strong on the jazz material that it should appeal to jazz afficianados even if they are not Woody Allen fans. The biographical / documentary styles keep this movie away from Woody's worst excesses (I am a fan, but not a blinkered one)and provide momentum. There are one or two scenes that migrate towards farce, such as the hold-up scene(s) and the \"moon seat\". This film is well worth seeing.",
         "When we try to understand genius, or love, or \"why?\", we run into the same problem that the ancients encountered: \"I went to the poets \u0085 I took them some of the most elaborate passages in their own writings, and asked what was the meaning of them \u0097 thinking that they would teach me something. I must say that there is hardly a person present who would not have talked better about their poetry than they did themselves. That showed me in an instant that not by wisdom do poets write poetry, but by a sort of genius and inspiration; they are like diviners or soothsayers who also say many fine things, but do not understand the meaning of them.\" \u0097 Socrates, The Apology So here we have Woody telling a story about a storyteller, who talks and struts endlessly (Penn has a ball with this), but can only say anything through music, and he can't explain a bit of it. Much like Woody, who prattles on about every neurosis, but speaks volumes through his control of the medium. It's just something he's born to do. And this is the only way to understand Django -- with only two working fingers on his fretting hand (accidental disfigurement), he reinvented the whole medium of guitar. The new shape of his hand forced him into holding octaves - which can be done on guitar with two adjacent fingers, unlike on the piano - and changing the way leads and comping - here, self-accompaniment - were played. His art was the necessary step before Les Paul, and thence to Wes Montgomery, and so on to you and me. Here is devotion without hagiography, because all of this is wrapped into \"one of those Emmett Ray stories\", where you can 'never be sure' of what is truth, confabulation, or exaggeration. Brilliance. Bravo, to all.",
         "As Woody Allen said of Sean Penn after working with him on this film \"(Sean's) a tremendous actor\". And he displays his tremendous talent in playing the role of Emmett Ray, jazz guitarist, a genius at his craft, rather a disastrous dope in all other aspects of his life. Then there's Samantha Morton who is brilliant in her portrayal of sweet, adorable Hattie, a cute mute young woman whose simple needs and wants, along with her lack of narcissism and inability to spew out mind numbing volumes of bulls+t banter obscure her deep strength and savvy intelligence. Those that value pure, sweet, unassuming kindness will find her irresistibly lovable. Emmett only really knows one thing, how to play guitar like no one else in the world, with the exception of the one person he idolizes to the point of hysteria: Django Reinhardt. He's obliviously inept at just about everything else in his life, especially his feelings, to the point where he doesn't know real, rare, wonderful love when it's right next to him. Sean is able to make Emmett so very likable, even in his worst of behavior. He excels at what he does best, bringing real human depth and qualities to his craft that exceptionally few actors are or have been capable of doing. This film is much like the character of Hattie, deceptive in its initial appearance and of a substantially better quality than you may first think. It seems like a light, cute little story largely due to its entertaining presentation and lack of dramatic pretense but there is significant texture and reality to this work of art. Emmett is perhaps the greatest guitar player in America and has so many of the essential ingredients for huge success: drive, ambition, presentation, wardrobe, personality, yet he tends to sabotage himself frequently and never gets the lucky break needed to put him at the top. True he could probably do rather well if he didn't p+ss away such volumes of cash but he never gets the type of success that the best supposedly deserve and is so wrought with money it won't disappear in the most extravagant lifestyles. Emmett also makes the tragically universal mistake of believing bullsh+t, both his and society's. He thinks the money and possessions and trophy girlfriends are what happiness are all about. His one saving grace is his love and respect for his craft but can this alone keep him from making a disaster of his life? He discovers all too painfully that the beautiful woman with the sophisticated, witty repartee, whom all the other men drool over, has an extremely high price tag of impenetrable, cold blooded narcissism. And though Emmett acts for the most part like a shallow dope, trying to hide and deny that besides being a genius he is a painfully sensitive man in desperate need of sweet, nurturing love, he still makes way too many foolhardy decisions. He is blind to the fact that the women who use sweetness merely as a tool of manipulation are the last thing he, or anyone else with a shred of decency, need or deserve. This is a great film and story and you can also enjoy a very pretty picture of life in the 1940's while you watch it. Apparently there was an obscure jazz guitarist named Emmett Ray but even if there wasn't, this is not really a fictionalized account. Certainly not in the sense of capturing the essence of character, love and genius. As he has done so marvelously before and since, Woody Allen masterfully captures an immensely watchable slice of life that most of us will only have an opportunity to witness with this fine offering. For the film itself as well as the two stellar leads this is will go into my relatively short list of wonderful, favorite films.",
         "The two movies that come to mind when I think about Sean Penn and his acting ability are not Mystic River and Fast Times at Ridgemont High. They are Carlito's Way and Sweet & Lowdown. In both of these movies, he immerses himself in the characters, while in most of his other movies, including the art house hits like 21 Grams and Hurly Burly, he plays more or less the same type of person. Sweet and Lowdown has Penn playing a self-absorbed classical guitarist who obsesses over a world-renowned guitarist much in the way Woody Allen obsesses over things in his other movies. Woody himself shows up as a commentator (this, like Zelig, is presented in mock documentary fashion). It is amusing, if slight (and a sign of things to come in 2000-2002, with Small Time Crooks, Curse of the Jade Scorpion and Hollywood Ending). Samantha Morton won a justified Oscar nomination, but Uma Thurman and Gretchen Mol are wasted (Uma got second billing over Sean Penn, and is hardly in the movie!) Not a Woody Allen masterpiece, but fans could do worse."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Music"
      ],
      "productionCompanies": [
         "Sweetland Films",
         "Magnolia Productions"
      ],
      "summaries": [
         "A comedic biopic focused on the life of fictional jazz guitarist Emmett Ray. Ray was an irresponsible, free-spending, arrogant, obnoxious, alcohol-abusing, miserable human being, who was also arguably the best guitarist in the world. We follow Ray's life: bouts of getting drunk, his bizzare hobbies of shooting rats and watching passing trains, his dreams of fame and fortune, his strange obsession with the better-known guitarist Django Reinhardt, and of course, playing his beautiful music.",
         "In the 1930s, fictional jazz guitarist Emmet Ray idolizes Django Reinhardt, faces gangsters and falls in love with a mute."
      ],
      "budget": 29750000
   },
   "movielensId": 3129,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-12-03",
      "dvdReleaseDate": "2000-06-20",
      "directors": ["Woody Allen"],
      "runtime": 95,
      "movieId": 3129,
      "title": "Sweet and Lowdown",
      "mpaa": "PG-13",
      "actors": [
         "Woody Allen",
         "Ben Duncan (DJ)",
         "Daniel Okrent",
         "Dan Moran",
         "Tony Darrow",
         "Chris Bauer",
         "Sean Penn",
         "Darryl Alan Reed",
         "James Urbaniak",
         "Uma Thurman",
         "Denis O'Hare",
         "Samantha Morton",
         "John Waters",
         "Anthony LaPaglia",
         "Brad Garrett",
         "Gretchen Mol"
      ],
      "imdbMovieId": "0158371",
      "originalTitle": "Sweet and Lowdown",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["x1X7hfx9BT0"],
      "plotSummary": "A comedic biopic focused on the life of fictional jazz guitarist Emmett Ray. Ray was an irresponsible, free-spending, arrogant, obnoxious, alcohol-abusing, miserable human being, who was also arguably the best guitarist in the world.",
      "tmdbMovieId": 9684,
      "avgRating": 3.67309,
      "releaseYear": "1999",
      "numRatings": 1895,
      "posterPath": "/23S5qa8j3ajYnERcYCqMLfSeOvw.jpg"
   }
}