{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0118780",
      "video": false,
      "title": "Broadway Damage",
      "recommendations": [],
      "backdrop_path": "/tB3qG9pt3PrKxxIYDv0U7dkQMtx.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "",
               "gender": 0,
               "credit_id": "55d9f0c7c3a3680dd5004217",
               "name": "Hugh Panaro",
               "profile_path": null,
               "id": 1499720,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "",
               "gender": 0,
               "credit_id": "55d9f0d8c3a36831fa00530b",
               "name": "Michael Shawn Lucas",
               "profile_path": null,
               "id": 1499721,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Cynthia",
               "gender": 1,
               "credit_id": "58dc1ebec3a3685cce002daf",
               "name": "Mara Hobel",
               "profile_path": "/l6fDNvtiVwWnzsqD3UKPadDblYv.jpg",
               "id": 150212,
               "order": 4
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "55d9f102925141721d003d38",
            "name": "Victor Mignatti",
            "profile_path": null,
            "id": 1080873,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [],
      "popularity": 0.036503,
      "production_countries": [],
      "id": 41638,
      "vote_count": 1,
      "budget": 0,
      "overview": "Romantic comedy about aspiring writers in NY.",
      "similar": [],
      "original_title": "Broadway Damage",
      "runtime": null,
      "poster_path": "/iUyvUNUoX7KKFHPVKyVXgOXGx2e.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1997-08-26",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Victor Mignatti"],
      "runtime": 110,
      "synopsis": "When your perfect mate is right under your nose, but you don't see him.",
      "writers": ["Victor Mignatti"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118780/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzY4MzI1OTEyMF5BMl5BanBnXkFtZTcwMzY3NDkxMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Mara Hobel, Michael Lucas, Hugh Panaro | See full cast and crew »"],
      "reviews": [
         "C'mon, World, wake up and REdiscover this little gay gem of a movie. There are so many out there that easily deserve their 0- or 1-Star; surely this little pearl deserves more. Yes, 1997's \"Broadway Damage\" is probably one of the most underrated and least known \"gems\" of gay filmdom........why not discover its delights yourself? So, just what is it about this production? Well, hey, there's no weird, dreary storyline; it's lite and fun......with guys who are not afraid to kiss. Yes, Michael Shawn Lucas (as Marc) has a body \"to die for\" and, c'mon, when he's also as earnestly sincere and sweet as he is, who wouldn't wanna wind up with him. And it would be very hard to forget Aaron Williams (as Robert), playing an endearing \"little puppy\" of a guy, who'll bring down Marc in the end. In fact, both male leads wear their sincerity on their sleeves----kinda refreshing to think there might still be guys like this out there. Above all, if you can't stand the sunny sincerity of a Broadway musical (but without all the singing), then stay away from this cuz it definitely tries to be sincere.......and succeeds at that in spades. Along with this there's really great cinematography: brite and colorful (how'd they do it with what must have been a piddl'in budget?). Hey, and there's that soundtrack to fall in love with, too. How Director Victor Mignatti put all this together, with no more money than he likely had, is anybody's guess and is a minor (scratch that), major miracle. How does a guy like this then just disappear from directing for the next 8, 9 years? Sad, sad, sad. In closing, one thing to possibly question is if maybe, just maybe, Director Mignatti should'a rethought the title. \"BD\" might resonate more with NY City-ers, but his own within-the-movie phrase: \"The Grand Gesture\" might have had more meaning to audiences at large (would the latter, as a title, have drawn in more viewers/buyers who'd fondly remember this film?). Ah, well, Monday morning \"after-thought-ing\" is always easier, isn't it? Besides, any way you look at it, Marc and Robert are gonna wind up being one of the favorite couples you'll meet in your home film library from time to time.....I betcha. PS: You know what? I'll even betcha this movie is one that other favorite film couples, such as Aaron & Christian (see Title 1, below) and Cedric & Laurent (see Title 2, below) would wanna have in their home video collections. (1) \"Latter Days\" / (2) \"Just A Question Of Love\"",
         "Two friends, a young gay man and his straight girl friend share an apartment in Manhattan and try to deal with life in the big city. Mara Hobel is very funny as the fag hag friend and the movie is light and comical as it explores the characters lives and loves. Seeing the film in a packed house of gay men in Manhattan made it clear that the filmmaker was pretty on target as the audience laughed with recognition through most of the film. A very fun movie!",
         "This film is a most delightful example of what filmmaking can do without a ton of money. The talent displayed in this film is extraordinary, from the music writing to the acting to the manner in which it is filmed. Start to finish it is a pure delight. I rented it for a week and have watched it 5 times so far! We need more films like this which provide us with real stories but an optimistic and loving view of the world. The romance in this film is the best I can recall ever seeing. BRAVO to all involved in making this magnificent film!",
         "This film is a breath of fresh air in so many ways. It makes you feel good, and the production quality is stunningly brilliant for a low-budget film. You don't even think of the film budget when you watch it because everything is so completely first-rate, including the photography, editing, original music, and the wonderful performances. \"Broadway Damage\" is a lovely old-fashioned romance, but since it involves two men, you haven't seen this film before no matter how many romantic comedies you've seen. This film's adorable main characters are people you would love to know, and due to the excellent decision to film this on location in actual buildings in Greenwich Village, you really feel like you have just stepped into the lives of the main characters. The story is a typical romance, but it has so many fun and charming moments along the way that you just hate to see the film end. The original music by Cindy Soltoff is absolutely reason enough to watch the film. Hugh Panaro, who has gone to great fame on Broadway since this movie was made, plays the hot object of one main character's affections... until it is learned that he isn't what he seems. But alas, a happy ending is around the corner anyway, and the ending is just so beautiful and charming, that you really don't care if you may have figured out how it all ends. I didn't figure out the ending, but I know people who did. All of us were totally charmed by the ending irregardless of whether or not we figured it out ahead of time. We need more joyful endings like this one. It's a shame they are so rare.",
         "Two years ago, in high school, I did some community theater shows in a theater that was also used by the actress Mara Hobel as part of her acting school for children (in suburbs outside of NYC). There was a big bulletin board showing pictures of Mara's film work, including of course \"Mommie Dearest,\" (she was Baby Christina) and a movie I had never heard of, \"Broadway Damage.\" I didn't see it until a few months ago, and being a student at NYU, I was able to play \"spot that building\" since much of the movie was filmed in NYU's surrounding neighborhood. But on to more important things: Regardless of where I grew up or where I live now, this is one adorable movie. When it was over, I felt like I wanted to hug the world. And it's great when movies have such a positive effect on you. Watch this one with people you love. 9/10",
         "What can I say. With the number of newer \"Gay Cinema\" films being released there are some that are just down right FUN! This is one of them. No serious or ominous meanings to glean from this delicious little gem, just sit back and enjoy the silly, and quite funny ride. There are two REALLY GREAT LINES in this film which I treasure greatly. The lusciously Titian like fag hag in this film is delightfully screwball and says at one point referring to their new apartment...\"It's FABULOUS, and I don't use the F word lightly\"! How funny is that? She also remarks in a plaintive voice...\" Whatever happened to Disco? I loved disco. It had VIOLINS\"! How fun! This is well worth a rental anytime. 3 and 1/2 stars out of 4. Clive2",
         "There can't be too many gay romantic comedies. I like this genre, and I like seeing gay characters in this type of film. The casting was right on the mark. The only thing I found a little weak was Aaron Williams' (Robert's) singing. But his acting made up for it. He portrayed the hopelessly hopeful romantic perfectly. Mara Hobel as Cynthia almost stole the show, with her emotions running the complete scale from one extreme to the other. Michael Lucas played Marc, and was able to slowly and subtly reveal Marc to be something of a romantic himself, which was not what we thought when the film started. This film is a very affirming one for gay men, and I would love to see many more like it. Bring 'em on.",
         "For starters, you must have a good outlook on low budget indie type films to even enjoy this film at all. I personally loved this film for a couple of reasons. First of all the comedy the fag hag in the movie is a whiny bitchy fat glamorous chick with a tacky fashion sense that is admirable. The story line is a bit awkward but it's just another tale of romance, two gay room mates that are \"friends\" masculine hot one falls for boy next door while the Broadway boy gets jealous of boy next door, things fall apart with the jock and the boy next door and the two room mates fall for one another while the fag hag, like all many other try to play match maker. I loved it :D",
         "This is a sweet movie, yes, sweet movie about gay love, gay friendships, gay life and finding the right guy in your life. It took me back to the days when I went through this, myself, while living on the West Side in New York. I, too, had a girl-friend, a bit overweight by the name of Cass Elliot [Mama Cass before success]. Mara Hobel reminded me of Cass, except Cass didn't go back to Baltimore, where she was from. Hobel had some wonderful moments [funny and sad]. The boys did well for themselves. The gorgeous Michael Shawn Lucas [Marc] and his romantic tryst with Hugh Panaro [David] seemed doomed from the beginning. It was the key case that gave him his walking papers in my diary. Yet Panaro gave the role lots of depth without making him just a sleeze-ball. Some tenderness in him and such a body, oh my. I'd ask him in to share my bed. But the line, \"Let's be lovers for just one night\" went out in the 60s. When was this movie filmed? Then there was dear sweet Robert [Aaron Williams] who without those glasses looked really cute. Sort of a good looking Gilligan [from Gilligan's Island]. That book store clerk was crazy to turn him down. His scene where he wrote the song for Marc [and by the way, it was a gorgeous song and I'd love to have a recording of it] but then denied it when discovering Marc with David was touching. Yet, when he finally sang the song for him, my heart went out to him. And still he was denied. Ugh! But, love wins out in this and thanks for that goes to writer/director Victor Mignatti. Mignatti is a romantic, thank heavens, and gives us this special Valentine of love. Victor, if you ever read this critique, where can I get a copy of that song that Robert sang?",
         "\"Broadway Damage\" is a sweet confection spun around the the classic gay triangle: the lovable Hunk, the fag hag Chunk, and the best pal Lunk secretly in love with the Hunk. More corn syrup is ladled on thick when Hunk and Chunk move in together in modern Greenwich Village, no less. Apparently set in the present, \"Damage\" feels like the kind of screwball romantic comedy that Hollywood never really made. You half expect the cast of \"Wonderful Town\" to come marching down Sheridan Square humming a showtune. Combing the obits finds them a bohemian squat lately owned by a deceased young actor - they've hit the real estate jackpot! No one mentions, however, that their good fortunes are probably due to the tenant's death from AIDS. In true fairy tale style, the dive is transformed into an ultra cool pad in one brief montage segment. (You know how talented those fellas are with decorating!) Despite some modern kinks (Hunk's love trouble, Chunk's job trouble, and Lunk's Hunk jones) flick never can get too serious about much. And dialogue never really cracks like genre demands. Fade out is just as we'd expect. And no one suffers much damage - on Broadway or elsewhere."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Musical",
         "Romance"
      ],
      "productionCompanies": ["Village Art"],
      "summaries": ["A quirky, romantic comedy about the complexity and frustration of finding a true love in the gay community. Marc is a struggling actor who finds an apartment in NYC by searching the obituaries. He lives with his out-of-work, eccentric fag-hag Cynthia. His best friend, Robert, is secretly in love with Marc, while Marc falls head over heels for flighty studio musician David. Things heat up as Marc's desire for David keeps him waiting by the phone, while Cynthia gets financially cut off from her rich parents and Robert struggles to express his feelings for Marc."],
      "budget": 0
   },
   "movielensId": 3131,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-08-26",
      "dvdReleaseDate": "1999-11-23",
      "directors": ["Victor Mignatti"],
      "runtime": 0,
      "movieId": 3131,
      "title": "Broadway Damage",
      "mpaa": "",
      "actors": [
         "Hugh Panaro",
         "Michael Shawn Lucas",
         "Mara Hobel"
      ],
      "imdbMovieId": "0118780",
      "originalTitle": "Broadway Damage",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "Romantic comedy about aspiring writers in NY.",
      "tmdbMovieId": 41638,
      "avgRating": 3.14583,
      "releaseYear": "1997",
      "numRatings": 24,
      "posterPath": "/iUyvUNUoX7KKFHPVKyVXgOXGx2e.jpg"
   }
}