{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "boarding school",
            "id": 6271
         },
         {
            "name": "orphan",
            "id": 13014
         },
         {
            "name": "silent film",
            "id": 154802
         }
      ],
      "imdb_id": "tt0010040",
      "video": false,
      "title": "Daddy-Long-Legs",
      "recommendations": [
         70803,
         70753,
         42367,
         22940,
         95866,
         98078,
         55544,
         22943,
         32590,
         24200,
         54986
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Judy Abbott",
               "gender": 1,
               "credit_id": "52fe4812c3a368484e0e7f0d",
               "name": "Mary Pickford",
               "profile_path": "/1kG12uiv0VPNaPCjbkLkRLTqmIW.jpg",
               "id": 100047,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Mrs. Lippett",
               "gender": 1,
               "credit_id": "5429da95c3a3682d62000747",
               "name": "Milla Davenport",
               "profile_path": null,
               "id": 1167813,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Miss Pritchard (as Miss Percy Haswell)",
               "gender": 0,
               "credit_id": "5429daab0e0a260a270007af",
               "name": "Percy Haswell",
               "profile_path": null,
               "id": 1368766,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Angelina",
               "gender": 0,
               "credit_id": "5429dac50e0a260a2d00079a",
               "name": "Fay Lemport",
               "profile_path": null,
               "id": 1368767,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Jarvis Pendleton",
               "gender": 0,
               "credit_id": "5429dad80e0a260a21000772",
               "name": "Mahlon Hamilton",
               "profile_path": "/92dnDIsrYNbcWjzo5nV4zQRS5bG.jpg",
               "id": 1196934,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Mrs. Pendleton",
               "gender": 0,
               "credit_id": "5429daf1c3a3682d690007ca",
               "name": "Lillian Langdon",
               "profile_path": null,
               "id": 29954,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Julia Pendleton",
               "gender": 0,
               "credit_id": "5429db06c3a3682d65000783",
               "name": "Betty Bouton",
               "profile_path": null,
               "id": 1368769,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Sallie McBride",
               "gender": 0,
               "credit_id": "5429db1bc3a3682d6f0007bb",
               "name": "Audrey Chapman",
               "profile_path": null,
               "id": 1368770,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Jimmie Mc Bride (as Marshall A. Neilan)",
               "gender": 2,
               "credit_id": "5429db460e0a260a21000783",
               "name": "Marshall Neilan",
               "profile_path": "/zTtq3yKZOIjcCYOtPG83PIp4Wax.jpg",
               "id": 559559,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "(uncredited)",
               "gender": 1,
               "credit_id": "5429dbbb0e0a260a3a000709",
               "name": "Joan Marsh",
               "profile_path": "/kQQPJu16vjkGhpvzWfwuaSaukcn.jpg",
               "id": 120542,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Mrs. Semple (as Carrie Clark Warde)",
               "gender": 0,
               "credit_id": "58f14d87c3a3681a52004dc2",
               "name": "Carrie Clark Ward",
               "profile_path": null,
               "id": 1392579,
               "order": 11
            },
            {
               "cast_id": 22,
               "character": "Orphan Boy (uncredited)",
               "gender": 0,
               "credit_id": "58f14d90c3a3681a3d004d2d",
               "name": "Wesley Barry",
               "profile_path": "/8uObbOgIpdUE8laBHUWmBz1q5gt.jpg",
               "id": 1004150,
               "order": 12
            },
            {
               "cast_id": 23,
               "character": "Orphan Boy (uncredited)",
               "gender": 2,
               "credit_id": "58f14d9a9251415556004f62",
               "name": "True Boardman",
               "profile_path": null,
               "id": 153738,
               "order": 13
            },
            {
               "cast_id": 24,
               "character": "(uncredited)",
               "gender": 0,
               "credit_id": "58f14da3925141551f004d58",
               "name": "Jeanne Carpenter",
               "profile_path": "/ljzZijyQGrCaX0cbFG84yFrlV2.jpg",
               "id": 1158634,
               "order": 14
            },
            {
               "cast_id": 25,
               "character": "(uncredited)",
               "gender": 1,
               "credit_id": "58f14dac9251415515004eca",
               "name": "Estelle Evans",
               "profile_path": null,
               "id": 8494,
               "order": 15
            },
            {
               "cast_id": 26,
               "character": "(uncredited)",
               "gender": 2,
               "credit_id": "58f14db5c3a3681a3d004d3e",
               "name": "Fred Huntley",
               "profile_path": null,
               "id": 1051750,
               "order": 16
            },
            {
               "cast_id": 27,
               "character": "(uncredited)",
               "gender": 0,
               "credit_id": "58f14dcfc3a3681a52004df0",
               "name": "Frankie Lee",
               "profile_path": null,
               "id": 1476426,
               "order": 17
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4812c3a368484e0e7f13",
               "name": "Marshall Neilan",
               "profile_path": "/zTtq3yKZOIjcCYOtPG83PIp4Wax.jpg",
               "id": 559559,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "5429da6bc3a3682d690007be",
               "name": "Agnes Christine Johnston",
               "profile_path": null,
               "id": 148426,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 0,
               "credit_id": "5429da7a0e0a260a270007a7",
               "name": "Jean Webster",
               "profile_path": null,
               "id": 1368764,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 1,
               "credit_id": "58f14d38c3a3681a7d005045",
               "name": "Mary Pickford",
               "profile_path": "/1kG12uiv0VPNaPCjbkLkRLTqmIW.jpg",
               "id": 100047,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "58f14d409251415519005274",
               "name": "Charles Rosher",
               "profile_path": null,
               "id": 9080,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "58f14d479251415567004dce",
               "name": "Henry Cronjager",
               "profile_path": null,
               "id": 1313101,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "58f14d4f9251415556004f40",
               "name": "Edward M. McDermott",
               "profile_path": null,
               "id": 128356,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "58f14d569251415542004bc0",
               "name": "Alfred E. Green",
               "profile_path": "/oqzfZ6R6wjlz7UebaHqpp0XTbE6.jpg",
               "id": 97774,
               "department": "Directing",
               "job": "Assistant Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 0.32248,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 70801,
      "vote_count": 6,
      "budget": 0,
      "overview": "Wealthy Jervis Pendleton acts as benefactor for orphan Judy Abbott, anonymously sponsoring her in her boarding school. But as she grows up, he finds himself falling in love with her, and she with him, though she does not know that the man she has fallen for is her benefactor.",
      "similar": [
         12405,
         37135,
         810,
         9655,
         19,
         44826,
         278927,
         196867,
         10719,
         9475,
         10545,
         150689,
         399055,
         342473,
         460793,
         283366,
         74643,
         2252,
         9325,
         674
      ],
      "original_title": "Daddy-Long-Legs",
      "runtime": 85,
      "poster_path": "/AeEOxZjQlk6GHoTRx0m8eNMMdez.jpg",
      "spoken_languages": [{
         "name": "No Language",
         "iso_639_1": "xx"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Mary Pickford Company",
         "id": 21540,
         "origin_country": ""
      }],
      "release_date": "1919-05-11",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Marshall Neilan"],
      "runtime": 85,
      "synopsis": null,
      "writers": [
         "Jean Webster",
         "Agnes Christine Johnston"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0010040/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ4Mzc0MDczOF5BMl5BanBnXkFtZTgwNTUwNzYwMjE@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Mary Pickford, Milla Davenport, Percy Haswell | See full cast and crew »"],
      "reviews": [
         "A wonderful and multi-faceted performance by Mary Pickford turns a pleasant but somewhat routine story into a fine film that is very enjoyable to watch. The story gives her a chance to use a lot of different talents, and whenever she is on-screen, which is most of the time, there is something worth seeing. Pickford is equally charming (it seems impossible to write about a Pickford film without using that word) and equally believable as a young orphan and as a college girl. And she is equally good at creating laughs, expressing feelings, and evoking sympathy - often all at the same time, especially in the orphanage scenes, which have some of this film's best material. There is some excellent comedy that keeps the story from becoming overly cute or sentimental, and she makes the most of all of it. They put some real work into the title cards for this one, filling them with some good art work and also using them at times for some well-chosen commentary. A couple of the other cast members are pretty good, too, although it is definitely Pickford that makes this so worthwhile. This is an engaging little gem from the silent era, and a great example of what it was that made \"America's Sweetheart\" so popular.",
         "An irrepressible orphan girl, living in the appalling conditions of a large asylum, is rescued by a mysterious benefactor and sent to college. Affectionately referring to him as DADDY-LONG-LEGS, she strives to make him proud of her. But when unexpected love comes her way, will she follow her heart or the wishes of her patron? Mary Pickford was the greatest movie star of the 20th Century. No one else even came close to inspiring the love & devotion of the millions of fans who flocked to see her silent films. In our jaded age it is difficult to understand why a diminutive little lady could engender such ardor right around the world. For answers, one need look no further than DADDY-LONG-LEGS. Expertly blending joy & pathos, Mary makes us instantly feel the emotions her character is living through. Whether it's stealing a doll for a dying child, dunking a bully in a well, listening to her dead mother being insulted in the worst way, or feeling the pangs & delights of a first love, Pickford tugs at our heart strings, our tear ducts, our funny bones. To watch this film is to get a glimpse as to why America's Sweetheart stands absolutely unique in her legendary status. Although this is Mary's show all the way, in the supporting cast Milla Davenport should be noted for her vivid portrayal of the vile asylum warden. The film's director, Marshall A. Neilan, appears as a hapless young Lothario. It was the success of this film at the box office which inspired Pickford to form a studio & become her own distributor. So it was that United Artists was born, with partners Douglas Fairbanks, Charlie Chaplin & D. W. Griffith. The film has been beautifully restored, with a fine musical score. Notice the original `art titles,' the evocative paintings which enrich the captions.",
         "Mary Pickford gives her usual delightful performance in \"Daddy Long Legs\", but the screenplay for this movie drove me crazy. The storyline jumps around and is misleading. For example, Mary's character Judy is at first shown to be a tomboy who speaks the sort of Huck Finn dialect that silent-film intertitle writers found so amusing, but suddenly we're told that she's a brilliant scholar. The impression I had up to then was that the orphanage kids weren't exactly being given a stellar education. The supporting characterizations are also inconsistent. The orphanage mistress is mostly murderously abusive, but then is shown desperately trying to help Judy catch a train to a new school. Why does she suddenly care? Judy's young suitor is portrayed alternately as an oafish fool and a charming lad, 'til we don't know what we're supposed to think of him. I'm not saying movie characters should be one-note--the heartless rich girl in the story is so unbelievably mean that she's dull--but the extreme switches indicate that the screenplay wasn't well-thought-out. There are loads of loose ends: what was the deal with the broken tail-light? What happened to the $1000 check? Why was Mary too ashamed to tell a certain story about herself, but not too ashamed to write a book about it? AND DID THAT GIRL EVER GET OUT OF THE WELL? I also was kind of creeped out by the Jarvis Pendleton character--he was too controlling. There are good things in the film besides Mary: the photography and tinting are beautiful (though the untinted whites of Mary's eyes are a little distracting), I liked the score, and the subject of the orphanage was an important one in its day. (I just today heard a radio documentary that discussed orphanages of that period, and they were much worse than the one in the film, which I had wrongly assumed was exaggerated.) To the film's credit, Judy works hard to become independent, but that aspect of the story isn't fully explored. All in all, worth it for serious Mary fans, but for everyone else, I'd recommend \"My Best Girl\" over this one any day.",
         "This sweet and funny silent stars Mary Pickford as an orphan who, after much kindhearted mischief, goes to college and finds true love, thanks to her anonymous personal trustee, whom she dubs \"Daddy-Long-Legs\" after the seeing his legs in a shadow. It's a familiar story, since it was remade in 1931 (with Janet Gaynor), 1938 (as the Netherlands film Vadertje Langbeen), and 1955, with Leslie Caron and Fred Astaire. There are quite a few memorable images in this lovely version: the drunk dog, the one-armed doll, and the scene with the baby cupids. The recent score by Maria Newman complements the movie, unlike the wretched one she wrote for another Pickford film, The Love Light (1921).",
         "This movie made me happy and not a lot of movies do that nowadays. Even though the mood of the movie changed halfway through, I think it helped differentiate between the 12 year old and the adult. I highly recommend this movie to everyone! The first time I saw this movie was late at night. My dad was flipping through channels and came across this movie and said that I would love it. Not just because it has Mary Pickford in it. So I was allowed to stay up until midnight on a school night, and back then it was a big deal! That suddenly became my dad's and my thing, to stay up late and watch old movies. I will always love this movie for itself and now it's sentimental value.",
         "Another terrific Mary Pickford performance and film. Daddy-Long-Legs is a familiar story, but the Pickford version accentuates the comedy and leaves the sappy romance to the horrid 50s version with Astaire and Caron. Sweet and innocent, this film has several memorable comic moments, including Mary getting drunk with a fellow orphan (Wesley Barry?) and leaving the jug for a dog. Very funny. A little tipsy, Mary also slides down banisters and accidentally knocks \"Stink Weed\" down a well. Oops! This film is a little unusual for a Pickford picture since it allows Mary to grow up. She gets to go to college and be wooed by her roommate's uncle (Mahlon Hamilton). She's also pursued by Jimmie (Marshall Neilan, who also directed the film). Milla Davenport is the orphanage director and Fay Lemport is the nasty Angelina. Nice comedic touches throughout to keep it all light and entertaining. The version I saw was clean, had beautiful title cards, and good (new) score my Maria Newman. All very impressive for a 1919 film. This film seems miles away from Pickford's 1917 Pride of the Clan, but she had been in over 200 films by the time she made this! Pickford was one of the greats, a true giant in Hollywood, and it's too bad she's so forgotten now. I've never seen a Pickford film I didn't like.",
         "Mary Pickford (as Jerusha \"Judy\" Abbott) is found, as a baby, in a garbage dump. Orphaned, she is brought to the \"John Grier Home\", where young boys and girls are treated more like convicts than children. By the time she is 12, little Mary is leading the orphans in a strike against eating prunes. Some years later, Ms. Pickford is the beneficiary of a lucky, life-changing event: one of the orphanage's new trustees wants to sponsor an orphan's higher education; and Pickford is chosen. At college, Pickford is a fetching young woman, which sends Cupid's arrows flying. Love-struck Princeton man Marshall Neilan (as Jimmie Mc Bride) and \"older man\" (as Jarvis Pendleton) vie for Pickford's hand in marriage. Pickford becomes a writer; her first effort fails, but she instinctively follows the advice \"write what you know\" in creating a successful tome about orphans. Finally, Pickford must choose her man, and payback her \"mysterious benefactor\". Some of \"Daddy-Long-Legs\" doesn't ring true; vignettes are cute, in isolation, but add little to the overall film; it's obvious, for example, that the children experience some childhood fun, which is said to be completely absent. And, the cruelty of the \"John Grier Home\" is hardly comparable to a prison! You may also wonder why a fully clothed boy is considered \"naked\", how a baby might have digested a mouth organ, how that girl got in and out of the well, and other stuff. The film is not at all unpredictable. However, Mary Pickford is outstanding. She very believably plays \"Judy\" - growing from a precocious 12-year-old girl to young career woman. As the film progresses, Pickford seems to add layers upon her character. For example, in some later scene, beginning at a society party where Pickford admires some ancestral portraits; watch, as the party progresses, both Pickford's past, and future, register on her face. Pickford constructs her character extremely well. Director Marshall Neilan (who also appears, as Jimmie Mc Bride) was an important Pickford collaborator; and the supporting cast is delightful. Wesley Barry is wonderful as Pickford's early orphan pal; he manages to steal scenes from Mary Pickford - 11-year-old Barry play \"drunk\" better than Pickford! Carrie Clark Ward is delightful as love-weary \"Mrs. Semple\", and Fay Lemport (as Angelina Wyckoff) shows how pampered, selfish little girls grow up. \"Daddy-Long-Legs\" was filmed again and again, but this is the definitive version, thanks, mainly, to Mary. ******** Daddy-Long-Legs (5/11/19) Marshall Neilan ~ Mary Pickford, Mahlon Hamilton, Wesley Barry",
         "I caught about 1/3 (in the middle) of Daddy Long-Legs on AMC and remarked to myself what a good actress the girl playing Judy was. It was only after my curiosity was piqued that I found out the title and that this was none other than the renowned Mary Pickford. It was my first date with America's Sweetheart. Since then I have bought three films over the Internet, Croquette, Daddy Long-Legs and Stella Maris. I have yet to see the third of these. I just watched Daddy Long-Legs in its entirety (tinted VHS version) and was most impressed. I also ordered and read a biography of Ms. Pickford during the interim. Have no doubt: this lady could act. While she showed in Croquette that she would probably have adjusted well to sound and mature roles, had her public been willing to accept this, we see her in her true element in Daddy Long-Legs. Hollywood silents were entering their maturity in 1919 and this was a solid one. I'm not sure if the tinting was original (as in the case of Nosferatu, which Kino lovingly restored) or added. If it IS original, it is marvelous. I wonder how close the orchestra score is to the tunes audiences would have heard performed during the film at theatres. The cast is solid and Pickford is brilliant. I have to defend a couple of criticisms of the screenplay. I don't feel Miss Pritchett is inconsistent in trying to help Judy catch the train. After all, SHE would look bad if her charge missed the train after the rich new director had gone to the trouble of making these arrangements. Plus, her relationship to Judy changes somewhat at that point. While Judy had always been a thorn in her side, she suddenly becomes someone who can make HER look good if she succeeds in college \u0096 sort of like a pro athlete making his/her high school coach look good. Obviously, had Judy been kicked out of college, she would have had nothing more to do with her and would have felt justified in her earlier harsh treatment of her. The question about her increase in scholarship is a legitimate one. It troubles me a tad. Yet it appears that at least a couple \u0096 and probably four \u0096 of years go by between her arrival at and graduation from college. Since she has no boyfriend to start with, no parents to miss, etc., it stands to reason that she would likely have poured herself into diligent study, as she had to her work at the orphanage. She may well have been exceptionally bright, but merely lacking much \"book learning.\" Is this a stretch? Maybe. Maybe not. I would say getting a novel published on the second try at that age is a bigger stretch \u0085 but, still, with a story like the one she would have had to tell, it seems feasible, too. I wish we had a version restored to the 16 apertures per second, or whatever the silent film era speed was. Nosferatu is glorious with remastered and restored sound and speed. This version is still a tad faster than normal \u0085 but it still flows very well. It is easy to see why Mary Pickford was America's Sweetheart. Watch Daddy Long-Legs and fall in love with her, yourself!",
         "One evening my daughter and I were at home - I was cleaning in another room, but after a time, I realized the program my daughter was watching had no words. So I went into the living room and promptly was entranced. It was our first silent film (thanks A&E for showing it) - we were hooked. I didn't find myself treating it like a film with subtitles...reading and missing the scenes - instead it was appropriately sub'd prior to a scene, then the silent film told the story all on it's own. It was a great plot of an orphan (back then, that was a social climbing status killer) who broke the ranks and found herself. She had a bit of fun along the way (the scene in the garden when she was young was hilarious!) and eased past the social-highlife land mines. A great family movie for sure.",
         "What I really want to know after watching this film is what happened? Please excuse me for sounding like I'm using latent feminist criticism here, which I'm not but I really dislike the change in Judy's (Mary Pickford's) character after about the first 50 minutes of this film. Yes, there is the great silent humor by both Pickford and the boy when they get drunk which rivals the genius of Chaplin. There is also The Prune Strike and Judy's defense of the baby and Bosco against the harshness of the Trustees/ Aristocrats. She seems like a Dickensian Joan of Arc who will one day save all the children from the harshness of the orphanage. Now I'm not against Ironic twists of fate because she is set up by the headmaster who wants to be rid of her. So a trustee is coerced to pay for her education and Judy then falls in love with him not knowing this man is also the trustee, when a surprise is obvious to me (I am easily mesmerized and don't usually guess how films end) someone has done something wrong. Not only that but when she finds out Daddy-Long-Legs is the man she wants to marry she curses him and marries him anyway? While Pickford's performance is excellent throughout I cannot understand why she is so pleased at conforming. With all the liberal-minded titles which are sometimes poetic and sometimes just too much suddenly we are give a tale where a woman who hated the rich is now constantly surrounded by aristocracy at school, marries a man she used to fear, and she lives happily ever after? She could've shutdown the orphanage, reformed it or adopted a kid but we get none of that. And it left me scratching my head. Not only that as soon as she gets to college there is a non-diegetic inclusion of these baby cupids that make absolutely no sense and make this film seem like it was two stories spliced together when they would've been better as two separate shorts instead of as one feature. On the plus side it was enjoyable watching a beautifully restored, shot and finally a tinted silent film. Mary Pickford is a film legend who was so natural as a visual performer that words to her would just be clutter. It's just a shame to be exposed to her in a film where her character's motivation is ill-defined."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": ["Mary Pickford Company"],
      "summaries": ["Wealthy Jervis Pendleton acts as benefactor for orphan Judy Abbott, anonymously sponsoring her in her boarding school. But as she grows up, he finds himself falling in love with her, and she with him, though she does not know that the man she has fallen for is her benefactor."],
      "budget": 0
   },
   "movielensId": 3132,
   "movielens": {
      "languages": ["No Language"],
      "releaseDate": "1919-05-11",
      "dvdReleaseDate": "1999-11-23",
      "directors": ["Marshall Neilan"],
      "runtime": 85,
      "movieId": 3132,
      "title": "Daddy-Long-Legs",
      "mpaa": "",
      "actors": [
         "Mary Pickford",
         "Milla Davenport",
         "Percy Haswell",
         "Fay Lemport",
         "Mahlon Hamilton",
         "Lillian Langdon",
         "Betty Bouton",
         "Audrey Chapman",
         "Marshall Neilan",
         "Joan Marsh",
         "Carrie Clark Ward",
         "Wesley Barry",
         "True Boardman",
         "Jeanne Carpenter",
         "Estelle Evans",
         "Fred Huntley",
         "Frankie Lee"
      ],
      "imdbMovieId": "0010040",
      "originalTitle": "Daddy-Long-Legs",
      "genres": [
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Wealthy Jervis Pendleton acts as benefactor for orphan Judy Abbott, anonymously sponsoring her in her boarding school. But as she grows up, he finds himself falling in love with her, and she with him, though she does not know that the man she has fallen for is her benefactor.",
      "tmdbMovieId": 70801,
      "avgRating": 3.49408,
      "releaseYear": "1919",
      "numRatings": 169,
      "posterPath": "/AeEOxZjQlk6GHoTRx0m8eNMMdez.jpg"
   }
}