{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "high school",
            "id": 6270
         },
         {
            "name": "basketball",
            "id": 6496
         },
         {
            "name": "family relationships",
            "id": 10235
         },
         {
            "name": "marine",
            "id": 11399
         },
         {
            "name": "military",
            "id": 162365
         },
         {
            "name": "strick father",
            "id": 210653
         }
      ],
      "imdb_id": "tt0079239",
      "video": false,
      "title": "The Great Santini",
      "recommendations": [
         32081,
         107934,
         41852,
         399786,
         25297,
         29973,
         14911,
         130002,
         56448,
         28368,
         15720,
         20263,
         47359,
         91767,
         63437,
         15669,
         208377,
         25576,
         21038,
         31692
      ],
      "backdrop_path": "/sVXxox4KoksT24LxAMmSClU4BPm.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Lt. Col. 'Bull' Meechum",
               "gender": 2,
               "credit_id": "52fe442cc3a368484e013b8f",
               "name": "Robert Duvall",
               "profile_path": "/1aBC7NxPy10ofng6HsJBecJ1vMZ.jpg",
               "id": 3087,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Lillian Meechum",
               "gender": 1,
               "credit_id": "52fe442cc3a368484e013b93",
               "name": "Blythe Danner",
               "profile_path": "/vGv4EMRcy7xrRt8OvDzSuXohXjv.jpg",
               "id": 10401,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Ben Meechum",
               "gender": 2,
               "credit_id": "52fe442cc3a368484e013b97",
               "name": "Michael O'Keefe",
               "profile_path": "/w6ssYHZER9wrZ1fWen6iUEQWYan.jpg",
               "id": 38085,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Mary Anne Meechum",
               "gender": 1,
               "credit_id": "52fe442cc3a368484e013b9b",
               "name": "Lisa Jane Persky",
               "profile_path": "/9H3tSghbilxzikD3Ob59zt15Vp.jpg",
               "id": 9259,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Karen Meechum",
               "gender": 1,
               "credit_id": "52fe442cc3a368484e013b9f",
               "name": "Julie Anne Haddock",
               "profile_path": null,
               "id": 100208,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Red Petus",
               "gender": 2,
               "credit_id": "52fe442cc3a368484e013ba3",
               "name": "David Keith",
               "profile_path": "/v1b7NQqJifk7xgt9HOGh0lvfkbP.jpg",
               "id": 18181,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Matthew Meechum",
               "gender": 2,
               "credit_id": "52fe442cc3a368484e013bd1",
               "name": "Brian Andrews",
               "profile_path": null,
               "id": 15505,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Toomer Smalls",
               "gender": 2,
               "credit_id": "52fe442cc3a368484e013bd5",
               "name": "Stan Shaw",
               "profile_path": "/2KUPUQQFmc8Zyzf16uaiYmVrNvX.jpg",
               "id": 16936,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Arrabella Smalls",
               "gender": 1,
               "credit_id": "52fe442cc3a368484e013bd9",
               "name": "Theresa Merritt",
               "profile_path": "/aTxceAux9NNaclxPJGOhMKvEruM.jpg",
               "id": 77226,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Col. Virgil Hedgepath",
               "gender": 2,
               "credit_id": "52fe442cc3a368484e013bdd",
               "name": "Paul Mantee",
               "profile_path": "/oVVmYw6vcP1XWWIiAx1ONWbz63E.jpg",
               "id": 52590,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Col. Varney",
               "gender": 0,
               "credit_id": "52fe442cc3a368484e013be1",
               "name": "Michael Strong",
               "profile_path": "/7CI6lsiDlsaAzKjtrFJ1rQTt72T.jpg",
               "id": 15650,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Cpl. Atcherly",
               "gender": 2,
               "credit_id": "52fe442cc3a368484e013be5",
               "name": "Bennett Liss",
               "profile_path": null,
               "id": 174873,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "Coach Spinks",
               "gender": 2,
               "credit_id": "52fe442cc3a368484e013be9",
               "name": "Joe Dorsey",
               "profile_path": null,
               "id": 12856,
               "order": 12
            },
            {
               "cast_id": 21,
               "character": "Lt. Sammy",
               "gender": 2,
               "credit_id": "52fe442cc3a368484e013bed",
               "name": "Paul Gleason",
               "profile_path": "/TKFcITuV9vyTSZe55B8klclPor.jpg",
               "id": 7675,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe442cc3a368484e013ba9",
               "name": "Lewis John Carlino",
               "profile_path": null,
               "id": 84657,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe442cc3a368484e013baf",
               "name": "Lewis John Carlino",
               "profile_path": null,
               "id": 84657,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe442cc3a368484e013bb5",
               "name": "Charles A. Pratt",
               "profile_path": null,
               "id": 933462,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe442cc3a368484e013bbb",
               "name": "Elmer Bernstein",
               "profile_path": "/3H3AqKesJnkwJzWFJY9hyFwci5m.jpg",
               "id": 7182,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe442cc3a368484e013bc1",
               "name": "Ralph Woolsey",
               "profile_path": null,
               "id": 41186,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe442cc3a368484e013bc7",
               "name": "Houseley Stevenson Jr.",
               "profile_path": null,
               "id": 115487,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe442cc3a368484e013bcd",
               "name": "Jack Poplin",
               "profile_path": null,
               "id": 1048633,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 5.51537,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 21887,
      "vote_count": 22,
      "budget": 0,
      "overview": "As he approaches manhood, Ben Meechum struggles to win the approval of his demanding alpha male father, an aggressively competitive, but frustrated marine pilot.",
      "similar": [
         133805,
         10947,
         272693,
         10625,
         9655,
         112160,
         85350,
         2108,
         13,
         10229,
         449176,
         26123,
         11355,
         308369,
         286565,
         2105,
         8193,
         315635,
         8363,
         3597
      ],
      "original_title": "The Great Santini",
      "runtime": 115,
      "poster_path": "/4E6D7mUvoZXP12xgozoO9DuqguJ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Bing Crosby Productions",
         "id": 5409,
         "origin_country": ""
      }],
      "release_date": "1979-10-26",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "The bravest thing he would ever do was let his family love him.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Lewis John Carlino"],
      "runtime": 115,
      "synopsis": null,
      "writers": [
         "Pat Conroy",
         "Lewis John Carlino"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0079239/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIwODA3Mjg0NF5BMl5BanBnXkFtZTYwOTk3NTM5._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Robert Duvall, Blythe Danner, Michael O'Keefe | See full cast and crew »"],
      "reviews": [
         "I have not seen this film in over 20 years, but having been in the Marines, it will always be burned in my memory. You may also have to be, or have been, a Marine to fully appreciate the film (although anyone that has lived under authoritarian rule must feel some sympathy for the situations presented). Although the film may have been re-cut for video release, I remember Duvall's character as being a fully fleshed out dichotomy of a man who rebelled against authority when submission was called for (his practical jokes while performing military duties) and invoking authoritarianism when more compassion and understanding were called for (his family life). This is what it was like to be a Marine: The Corps was your family and your family was just an inconvenient duty to be performed for society. If the movie has been re-edited, I suggest you try to see the original theatrical release, if possible. I found it to be a thoughtful and powerful motion picture.",
         "Robert Duvall is magnificent as a classic warrior without a war who moves his family from town to town. Blythe Danner is an excellent match as his wife. And Michael O'Keefe deserves all the kudos he received plus more as Duvall's put-upon son. Lisa Jane Persky strikes a nice balance as the sarcastic-yet-still-loving daughter. Stan Shaw, Paul Mantee, Paul Gleason, and David Keith are flawless in edgy supporting performances. There's perhaps one scene that's slightly overdone which causes me to give it a 9/10 rather than a 10. Otherwise, The Great Santini is an utterly riveting family portrait from start to finish.",
         "\"The Great Santini\" is a powerful, gut-wrenching film that manages to tell the tale of a powerful, abusive, often unlikeable hero named Bull Meecham (Duvall). . . and yet you care about what happens to Bull Meecham just the same. Meecham, a legendary pilot and naval hero, is at his best when faced with death -- but at his worst when faced with peacetime, and with his wife and children. Meecham is actually both sad and scary when left alone with his family; he's an abusive terror, almost trying to start a full-scale war in his own home just so he can feel, well, normal. Duvall is nothing short of brilliant in this movie -- he was nominated for an Oscar, and, in my opinion, he should've won it hands down. Also amazing is Blythe Danner as Lillian, his put-upon wife. An amazing character study that isn't always fun -- in fact, sometimes it's downright harrowing -- but definitely a great story with some incredibly moving performances. A-",
         "Hard-nosed military pilot Robert Duvall (Oscar-nominated in the title role) is a nut of epic proportions as he abuses his wife (Blythe Danner) and four kids (led by Oscar-nominee Michael O'Keefe) with verbal outbursts, bully-style antics and cruel behavior. Duvall's over-the-top role is an intensely interesting and volatile character who is full of fire, but also strangely sympathetic and dare I say even likable. The movie takes place just before the Vietnam years and keeps up an intensity because of the events going on in the world around them. Also O'Keefe gets into all kinds of trouble as a high schooler in the newest town the group has moved to. The relationship between Duvall and O'Keefe is the primary focus and the rest of the project is really just window dressing. Duvall is a revelation once again and he is able to keep everything believable and coherent. 4 stars out of 5.",
         "Imagine a man who considers winning to be absolutely everything. He is like the coach of a sports team, yet he encompasses a far greater reach of authority. And yet, he wants even more authority and always seems to be getting it, because of his natural air of authority and others' natural air of backing down in the fright of his presence. He is a coach, a military man, a patriot, abusive, and to make things even more shocking: a father who just doesn't really know how to be one except his own way. And you have a picture of the type of character that Academy Award-winning actor Robert Duvall plays in this film. He got another nomination for the Academy Award in this film, although he unfortunately did not win it. \"The Great Santini\" is a dramatic film near to perfection and one of the finest great movies of the 70s. Majority of the screen time is devoted to the relationship between Robert Duvall and his screen son, portrayed by Michael O'Keefe, also in an Oscar-nominated performance. The whole point of this is that O'Keefe is the oldest out of four children who have spent their whole life being raised, bullied, and commanded by Duvall. He runs their lives like a boot camp. There is no mercy, no generosity, and all you get for a good job, is a slap on the back. Duvall is trying to raise them in the best way he knows. He wants them to succeed in life, but the only method he knows that is effective is to be rough. And O'Keefe's character has decided he's had enough of being treated like a soldier in war. Every aspect in \"The Great Santini\" is developed and executed perfectly to a magnificent entertaining level. The varsity basketball game depicted in the film is just like watching a real high school ball game. It's not full of tough, imaginative lines. Nothing remarkable happens during it, and yet it is a powerful sequence and highly entertaining, almost as if you were sitting with the cheering and jeering friends and family members of the characters. There are also powerful messages about racism and violence in the film, performed through a friendship between the characters portrayed by Michael O'Keefe, Stan Shaw, and David Keith. It is an excellent subplot that is the next-to-most-important aspect of the story and it involves pretty much all of the characters in some way, shape, or form. It's not just an in-the-background tragedy. \"The Great Santini\" plays out as a magnificent story, mostly revolving around the character played by Robert Duvall. As we see him, he goes on an off with his temper and general-like behavior, and we come to like and dislike him over the course of the film, respecting him as if he were a real person before us. While he's really nothing more than a fictional character being portrayed by a magnificent and talented actor, he is in his own way, one of the greatest heroes of film history. And he just wants everybody to see things his way. Recommended.",
         "More common than not, even though it looks rather mean in these \"politically correct\" times, this is the way many families were back in the 50s. The racial conflicts shown were very realistic and I'm sad to say did happen in the southern state in which I grew up. This movie does a good job of showing how the head of a family, the Dad, was \"expected\" to act. Even though we are lead to believe he was a monster, we never found out that his son grew up to be a doctor of highest esteem.",
         "Duvall received a much deserved Oscar nomination as a Marine who runs his family like he runs his men... with vigor and power. He's a Patton without a war and Duvall plays it off beautifully. O'Keefe (also Oscar nominated) is fantastic as his son who's only wish is to please his father. There are many startling scenes in the picture, especially the basketball game where Duvall orders O'Keefe to put another player \"on the floor\" for obvious flagrant fouls. Duvall's Bull Meechum rules with a iron fist and screams at his son, \"Put him down, or you don't come home tonight.\" The film is based on Pat Conroy's novel and also stars the always wonderful Danner, as Duvall's wife and Stan Shaw as a black man befriended by O'Keefe. Lewis John Carlino directs.",
         "This film is one of the finest ever made, in my humble opinion, and the greatest display of Robert Duval's acting abilities. This film is powerful and moving. An \"era\" piece, it's message resounds regardless. The cinematography is beautifully done. The acting is top notch. The scenes between Metchum and his son are the most riveting, of course but the scenes between the son and mother are also quite touching and tender, and contrast wonderfully with the other scenes. And while this is a gripping drama, with very well acted round characters, there is humor too, and handled brilliantly. Truly every movie library should have this film in it's collection.",
         "This movie is excellent for its first half: crisply delivered, well-developed, it takes chances that you don't see in films made today. Characters like Bull Meechum are usually, in contemporary films, greatly exaggerated or treated with utter contempt (the military dad in American Beauty as a typical example). This film delivers all the way through the basketball game episode. Then it starts to fall apart. The episode with Toomer and Red seems like a mighty big price to pay just to show Bull's lack of sensitivity and empathy, or anything else it intends to show. Not too long after, Bull himself gets yanked right out of the movie. I really would have appreciated seeing all of these interesting characters resolve their differences - or see things come to a head. I just felt that the movie just quit with 30 minutes to go. The music was also kind of hit and miss in the last half. For example, when Ben confesses that he prayed for his father's death, the music is inappropriately creepy. It resolves into sorrow, but the net result was kind of off-putting.",
         "Lt. Col. 'Bull' Meechum (Robert Duvall) is a wildcat Marine Pilot stationed stateside ; at the beginning , he along with his family are living in Spain , then , they return to USA . The family is formed by father , mother (Blythe Danner) and children (Michael O'Keefe as Ben , Lisa Jane Persky as Mary Anne , Julie Anne Haddock as Karen and Brian Andrews as Matthew Meechum) . They are a dysfunctional family , rigidly governed by the father , as he abuses and deals them in military style , because he doesn't allow himself any other way yo show his affection . The motion picture mingles tenderness , warm humor , racism with harsh cruelties inherent with unsettling as well unpleasant main character , including his repressed emotions , frustrated career and family mistreat . According to author Pat Conroy, Lt. Col. Bull Meecham is based entirely on his own father, Donald Conroy, a Marine fighter pilot who referred to himself in the third person as \"The Great Santini.\" Donald Conroy took the nickname from a magician he'd seen as a child ; in fact Pat and Donald Conroy were on the set on the day . Producers gratefully acknowledge the technical assistance of the US Marine Corps , in the production of this picture . The movie was virtually undistributed and originally released directly to cable and airlines, under the title \"The Ace\" , when the NY Times reviewed it very favorably, it was pulled from cable, and released due to critical acclaim to theaters under the title \"The Great Santini\" . Very good acting by Robert Duvall as an aggressively competitive, but frustrated marine pilot strictly related to his family with whom he shares a strident and sometimes fun love-hatred relationship . Skillful acting especially from the youngsters with special mention to Miles O'Keefe . And standout performance by Blythe Danner ; despite playing the mummy , Blythe Danner is only 12 years older than children Michael O'Keefe and Lisa Jane Persky . Secondary cast is pretty good such as Stan Shaw , Paul Gleeson , Paul Mantee , Michael Strong and David Keith film debut . Atmospheric cinematography by Ralph Woolsey , filmed on location in South Carolina and in Samuel Goldwyn studios , Hollywood Calif. Cameraman used lenses and Panaflex camera by Panavision , prints by Technicolor . In 1981, the movie got nods for nominated for Academy Awards to actor and supporting actor. Rousing musical score by the master Elmer Bernstein in his particular as well as martial style . The motion picture was professionally written and directed by Lewis Jon Carlino who extracted good performances and well-developed events .He is a writer and director, known for The mechanic , Mafia , Seconds ; having only directed three films : Class , The Sailor Who Fell from Grace with the Sea and this Great Santini ."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Bing Crosby Productions"],
      "summaries": [
         "In 1962, the Marine Corps family, the Meechums - parents Lieutenant Colonel Wilbur \"Bull\" Meechum and Lillian Meechum, and their four children Ben Meechum, Mary Anne Meechum, Karen Meechum and Matthew Meechum - are moving like they do most years, this time to Beaufort, South Carolina. Bull - nicknamed \"the Great Santini\" - is known as a great pilot, but has gotten into much trouble in the past for his sophomoric behavior. He runs his family much as a military commander, where they are all to obey his orders without question. Everything he does within the family context he reasons is to build character, but in reality everything ends up being about him. The oldest Ben, approaching manhood, is the one of his offspring who has the greatest issue with his father. Ben wants his respect, but isn't sure if he really loves him. As Ben goes through his senior year in high school, his attempts to play varsity basketball and an incident between black Toomer Smalls - his friend and their cook Arrabella Smalls' son - and racist Red Petus may forever change the dynamic between father and son.",
         "The four Meechum kids and their mother move from Marine post to Marine post, following their father, a pilot, in the peaceful years before the Vietnam war. Bull Meechum, the self-described \"great Santini,\" is manic: a martinet at once enthusiastic and abusive of his family. In Beaufort, South Carolina, Bull is assigned to whip into shape a squadron of pilots, and Ben makes friends with Toomer, a slow-talking Black youth. Racial and family tensions explode in violence, and Ben must find a way to make peace with his father.",
         "As he approaches manhood, Ben Meechum struggles to win the approval of his demanding alpha male father, an aggressively competitive, but frustrated marine pilot."
      ],
      "budget": 0
   },
   "movielensId": 3135,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1979-10-26",
      "dvdReleaseDate": "1999-11-23",
      "directors": ["Lewis John Carlino"],
      "runtime": 115,
      "movieId": 3135,
      "title": "The Great Santini",
      "mpaa": "PG",
      "actors": [
         "Robert Duvall",
         "Blythe Danner",
         "Michael O'Keefe",
         "Lisa Jane Persky",
         "Julie Anne Haddock",
         "David Keith",
         "Brian Andrews",
         "Stan Shaw",
         "Theresa Merritt",
         "Paul Mantee",
         "Michael Strong",
         "Bennett Liss",
         "Joe Dorsey",
         "Paul Gleason"
      ],
      "imdbMovieId": "0079239",
      "originalTitle": "The Great Santini",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["AluXh0K7Ji0"],
      "plotSummary": "As he approaches manhood, Ben Meechum struggles to win the approval of his demanding alpha male father, an aggressively competitive, but frustrated marine pilot.",
      "tmdbMovieId": 21887,
      "avgRating": 3.837,
      "releaseYear": "1979",
      "numRatings": 1546,
      "posterPath": "/4E6D7mUvoZXP12xgozoO9DuqguJ.jpg"
   }
}