{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "treasure",
            "id": 1454
         },
         {
            "name": "tarzan",
            "id": 7347
         },
         {
            "name": "rescue",
            "id": 10084
         },
         {
            "name": "jungle",
            "id": 10787
         },
         {
            "name": "movie serial",
            "id": 179991
         }
      ],
      "imdb_id": "tt0024645",
      "video": false,
      "title": "Tarzan the Fearless",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Tarzan",
               "gender": 0,
               "credit_id": "52fe4926c3a368484e11c90b",
               "name": "Buster Crabbe",
               "profile_path": "/rP3Oaz4Jb5eF5qSNYNPdIlocivt.jpg",
               "id": 33359,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Mary Brooks (as Jaqueline Wells)",
               "gender": 1,
               "credit_id": "52fe4926c3a368484e11c927",
               "name": "Julie Bishop",
               "profile_path": "/uKyYueZq8n4gxiDhqIM3wKhAnj3.jpg",
               "id": 82349,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Bob Hall (as Eddie Woods)",
               "gender": 2,
               "credit_id": "52fe4926c3a368484e11c92b",
               "name": "Edward Woods",
               "profile_path": "/kNNGeUFR2GTGJTirWAzCfBWezUq.jpg",
               "id": 82316,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Jeff Herbert",
               "gender": 2,
               "credit_id": "52fe4926c3a368484e11c92f",
               "name": "Philo McCullough",
               "profile_path": "/pmzSq7WkC8qQd1e6jMALKctQZP0.jpg",
               "id": 1173173,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Dr. Brooks",
               "gender": 2,
               "credit_id": "52fe4926c3a368484e11c933",
               "name": "E. Alyn Warren",
               "profile_path": "/bzeIBytktSELtD1HP7ucOSbzTp2.jpg",
               "id": 120556,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "High Priest",
               "gender": 2,
               "credit_id": "52fe4926c3a368484e11c937",
               "name": "Mischa Auer",
               "profile_path": "/qeOEHGEThuu7y9spmH60GdkdTUF.jpg",
               "id": 39801,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Nick",
               "gender": 2,
               "credit_id": "52fe4926c3a368484e11c93b",
               "name": "Matthew Betz",
               "profile_path": "/kpYtxMVLZmnMPJyCLAnXvWCDGOF.jpg",
               "id": 138220,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Abdul",
               "gender": 0,
               "credit_id": "52fe4926c3a368484e11c93f",
               "name": "Frank Lackteen",
               "profile_path": "/b06QcR4mZrsrMxyhOz4vhbfMy2P.jpg",
               "id": 111991,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4926c3a368484e11c911",
               "name": "Robert F. Hill",
               "profile_path": "/bkDJwCAAOCxnnuBQ6GRnWEHgwGY.jpg",
               "id": 33690,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4926c3a368484e11c917",
               "name": "Edgar Rice Burroughs",
               "profile_path": "/8JlB8S3XSwRAyampS0nI4cqoa8q.jpg",
               "id": 15776,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe4926c3a368484e11c91d",
               "name": "Basil Dickey",
               "profile_path": null,
               "id": 33375,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4926c3a368484e11c923",
               "name": "George H. Plympton",
               "profile_path": null,
               "id": 33374,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "58dff3259251415e3600c892",
               "name": "Sol Lesser",
               "profile_path": null,
               "id": 592943,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "58dff3319251415e3600c89d",
               "name": "Joseph Brotherton",
               "profile_path": null,
               "id": 1568490,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "58dff33cc3a3683d3e00d2cc",
               "name": "Harry Neumann",
               "profile_path": null,
               "id": 98161,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "58dff348c3a3683d3e00d2db",
               "name": "Carl Himm",
               "profile_path": null,
               "id": 123565,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         }
      ],
      "popularity": 0.344704,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 76083,
      "vote_count": 4,
      "budget": 0,
      "overview": "Mary Brooks' father, who has been studying ancient tribes, falls into the hands of \"the people of Zar, god of the Emerald Fingers.\" Tarzan helps Mary locate her father, rescues everyone from the High Priest of Zar, and takes Mary to his cave.",
      "similar": [
         9326,
         6637,
         85,
         87,
         89,
         1995,
         1996,
         217,
         2059,
         9838,
         258489,
         13183,
         17578,
         12222,
         10303,
         600,
         256274,
         34851,
         879,
         7446
      ],
      "original_title": "Tarzan the Fearless",
      "runtime": 228,
      "poster_path": "/d85mwmPS4zJnMLTtncnOOGJ9zen.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Sol Lesser Productions",
         "id": 4213,
         "origin_country": ""
      }],
      "release_date": "1933-08-11",
      "vote_average": 2.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Robert F. Hill"],
      "runtime": 200,
      "synopsis": null,
      "writers": [
         "Edgar Rice Burroughs",
         "Basil Dickey"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0024645/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIyNTAzMzEzOF5BMl5BanBnXkFtZTcwNTMyOTAyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Buster Crabbe, Julie Bishop, Edward Woods | See full cast and crew »"],
      "reviews": [
         "This is a feature version of a 12-chapter serial, although some don't seem to know that the serial exists. As was a semi-common practice of the time, some serials were produced as both a feature and also as a serial. The reason was that some theatres would not book serials but had no qualms about booking a feature edited from a serial, and this practice allowed the serial producer to get a booking in a theatre for his condensed feature that they would not have gotten as a 12-episode serial. This \"feature version\" consists of the first four chapters of the 12-chapter SERIAL that was titled \"Tarzan the Fearless,\" , which a great many collectors have in its 12-chapter form (that some don't seem to know exists) and, some of the luckier ones, even have all of the different original one-sheets posters issued with each chapter title, and the full eight-card set of different lobby cards issued with each chapter following the showing of the feature version at theatres that did book serials; and most of those theatres that did book serials didn't bother showing this feature version, opting instead to show one chapter a week for 12 weeks. The chapter titles for the 12 episodes of this serial (from which the \"Tarzan the Fearless\" feature version was chopped out of) were: 1. The Dive of Death; 2. The Storm God Strikes; 3. Thundering Death; 4. The Pit of Peril; 5. Blood Money; 6. Voodoo Vengeance; 7. Caught by Cannibals; 8. The Creeping Terror; 9. Eyes of Evil; 10. The Death Plunge; 11. Harvest of Hate and 12. Jungle Justice. Producer Sol Lesser's plan was to make both a feature version and a serial...and he did both.",
         "Buster Crabbe plays Tarzan in this short movie that was the first 4 episodes of a serial. He's GOT to be the first blonde Tarzan ever! I heard this was just awful. I admit the plot jumps around and the print I saw was in terrible condition--but I liked it. Mostly it was because of Crabbe--he had a beautiful, muscular body and was much better-looking than Johnny Weismuller. He also acted better--Weismuller always had a blank look on his face--Crabbe changes expression often. Also he wore the skimpiest lion cloth I've ever seen. His acting wasn't bad either--I was pretty surprised! He hated making this though--he said the \"damned\" monkey who played Cheetah was always biting him! I realize it's a matter of taste but I think Crabbe was easily the best-looking and sexist Tarzan ever. Worth taking a look at.",
         "The Tarzan of the movies was a sissy, compared with the blood thirsty apeman of the early Burroughs novels. The real Tarzan ate raw meat and the blood ran off his chin. Moviegoers might not have been up to this kind of realism. That aside, this is a worthwhile, albeit early, Tarzan film. Buster Crabbe was a better athlete than other actors who played the role; like Weismuller, Crabbe had an Olympic gold medal and was more muscular. He also had a skimpier costume in the pre-Hayes Office days. The plot skips all over the place, probably because it was edited down from an episodic serial. The chimp is there, playing cute, as he did in almost all Tarzan films. The trapeze or vine swinging work is considerably better here. If Buster Crabbe didn't actually do it, he appeared to be quite high and hanging on precariously. Unfortunately the Tarzan yell, a trademark of these films, is a mild bleat compared with those that came later. I miss that in this version. All in all, I'd give this a fair to good grade.",
         "Landing far towards the bottom in many folks' ranking of the Tarzan films, this one has far more charms than it's usually given credit for. Produced separately (and far more cheaply) than the famed Weissmuller/MGM films of the era, this one stars former Olympic champion Crabbe as the ape man. He has befriended a gentleman explorer and researcher (Warren) whose daughter (Wells), along with her suitor (Woods), is en route to find him in the dense jungle. When the safari guides spot Crabbe, they decide to kill him in order to collect a 10,000 pound reward on his head from his enemies in England. Wells, however, is rescued from an alligator by Crabbe and she falls for him, determined to do whatever it takes to save him from slaughter. Meanwhile, a fanatic religious cult, a riled up band of natives and assorted lions add to all the troubles in the jungle. If it sounds like a crowded plot line, it's because the storyline was part of a 12 episode serial and this film is cobbled together from parts of the larger whole. As a result, the story is choppy, the editing is awkward at times and it lacks the coherence of a work intended to be a self-contained feature film and not a prolonged saga. However, especially for Tarzan enthusiasts, there are some pluses. Crabbe is stunning to look at. His adorable face and thick, curly hair compliment his impressive physique. His rather startling loincloth is brief, to say the least (except, oddly, in the swimming sequences when it is inexplicably replaced by a pair of leopard-print trunks!) He approaches the role with complete physical abandon, thrashing animal-like when excited, barely speaking at all and doing a significant amount of his own stunts. When Wells annoys him, he gives her a thump in the shoulder and when Tarzan says it's bedtime, it's BEDTIME! The rope swinging (and there is PLENTY of it!) is among the most realistic of all the films and there are some striking tussles with lions that certainly beat the one Victor Mature did in \"Samson and Delilah\". Some of the aspects of the film are laughably bad, such as the Eqyptianesque fanatics and crude editing which features people looking at things in the wrong direction or running the wrong way or not being able to see something that is in full view. Stay tuned for the scene near the end when a man in a gorilla suit enters the fracas when trying to get an elephant to rescue Crabbe from a pit!! There is also a lot of pausing before and after lines of dialogue, a symptom of the early days of sound film-making. Still, it's certainly worth a look and Crabbe will not be easy to forget, not only for his looks, but for his charm. The kooky finale has a chimp and an elephant dancing (!) along to music from a phonograph!!",
         "Tarzan The Fearless has swimming icon Buster Crabbe in the role of Edgar Rice Burroughs noble savage of the African jungle. What I'm reviewing is a condensed version of a Tarzan serial which this film was. Condensed when referring to serials is never good. I'm not a big fan of serials in general, but editing them down to feature film you lose a whole lot of continuity. I have to confess I gave up trying to follow the plot. Crabbe though was one magnificent specimen. We have a blond 'Jane' played by Julie Bishop who with her fiancé Edward Woods is on an expedition to find her scientist father E. Alyn Warren. Bishop and Woods have a pair of treacherous guides in Philo McCullough and Matthew Betz who've got an agenda of their own which is to locate a fortune in emeralds from the lost people of Zar whom Warren is trying to locate and study. Crabbe even in the condensed version is wrestling with lions and crocodiles and the people of Zar bailing these intruders out of trouble. All in all viewed today it's pretty silly.",
         "TAZAN THE FEARLESS (1933 B&W) features Olympic medal winner Buster Crabbe as Tarzan. On the plus side, Crabbe has the requisite physique for the role and his expressions are more developed than Johnny Weissmuller's blank look; in addition Crabbe has one of the best Tazan yells that I've heard (this is in contrast to another reviewer who panned it). After slaying a lion he lets out a near-bloodcurdling victory cry that well captures the scream as depicted by Burroughs in his books. On the down side, Crabbe wears a loincloth that is ridiculously skimpy on the backside, almost like the costumer was gay and wanted to flagrantly show-off Crabbe's buns. Another negative aspect is that this is a second-rate production compared to the Weissmuller films of the same era, no doubt the result of rival producers wanting to cash-in on the huge success of the Weismuller films. GRADE: C",
         "Tarzan the Fearless (1933) ** (out of 4) Mary Brooks (Julie Bishop) travels into the jungle with some men to search for her missing father. Thankfully she runs into Tarzan (Buster Crabbe) who helps on her search as well as helps fight some of the bad people in her group. TARZAN THE FEARLESS is a pretty bad movie that features all sorts of campy moments but I think it remains watchable because it does have a certain charm thanks to its badness. Originally this was meant to be a 12-part serial but sadly that version is now missing. The producer basically took the first four chapters and turned them into this movie so that will explain why things sometimes don't make sense or that the story is jumping all around the place. Without the serial to see exactly what they did, it's hard to say if they improved anything but most of the time these serial chapters to features don't work. There are quite a few campy moments with this film and most of them are Tarzan himself. He has a really silly and annoying howl here that will certainly make you laugh. As with the first MGM film, Tarzan can't speak here so instead of talking to Mary he always breaks into this weird laugh that makes him seem rather slow. It's clear Crabbe was going for a different type of performance because he makes the Tarzan character more of a mentally challenged person than anything else. Bishop is certainly easy on the eyes as the love interest. Philo McCullough was actually good as the main villain and we get Edward Woods playing the good guy. The film is full of stock footage, fights with lions and of course the eye-rolling moment of yet another beauty getting into their bathing suit and going swimming when of course a croc shows up. TARZAN THE FEARLESS is a real mess of a movie but fans of bad cinema should get a few kicks out of it. I will also say that Turner Classic Movies showed a 87-minute version, which I actually found much better than an earlier version running 71-minutes and included on one of those public domain packs. If you think the fuller version doesn't make much sense try watching that shorter one!",
         "Buster Crabbe was the Tarzan I most vividly remember from my childhood television viewing days and after getting a chance to re-view \"Tarzan the Fearless\" after almost 50 years, I can't understand why he wasn't MGM's first choice. He was given a screen test along with many others including Joel McCrea and Clark Gable but Johnny Weissmuller was Metro's final choice. Crabbe was very handsome and had a far better physique than Weissmuller which he did manage to maintain - apparently in 1970 Crabbe returned to swimming in a Senior Sports Swimming meet and managed to set a world record in the 400 metre freestyle event. Even though he didn't catch Metro's eye, Paramount was interested and he pleased them with \"King of the Jungle\" and later that year starred in a serial \"Tarzan the Fearless\" which was also re-edited into an 85 minute feature which opened at the Roxy in 1933. As Time magazine said \"From the neck down Crabbe easily equals Weissmuller as an attraction to female audiences, from the neck up he is a vast improvement\"!!! This is supposedly (according to the preface) Tarzan's \"strangest and most romantic adventure\" and being a pre-coder there is lots of double meaning dialogue and many chances for Mary to be scantily clad in the jungle. Tarzan is asked by Dr. Brooks (E. Alyn Warren) to take a letter to his daughter Mary (fetching Jacqueline Welles) who is searching for him in the jungle. It wouldn't be a Tarzan movie without crooked safari guides - in this case they want to ditch the pesky girl and get down to the real business which is claiming a 10,000 pounds reward if they can prove Tarzan is dead - oh, and they also plan to look for a lost Emerald mine!!! Tarzan has already made himself known to viewers with an establishing scene that shows off his glorious physique, swinging through the trees (he made it look very real and dangerous) and also shows he is a defender of the weak as he fights a lion to the death to save a defenceless deer. Camping by a river Mary indulges in a near nude swim that brings Tarzan to her rescue when the river turns out to be crocodile infested. He is able to deliver the letter and also guides them to her father's hut but the father has gone to the temple - but wait!! he leaves a map. Being edited from a 12 episode serial there is plenty of action and villains!! Suddenly Bedouins appear (Mischa Auer turns up as a High Priest and beautiful Carlotta Monti as the High Priestess) to kidnap Mary for a Sultan's harem but Tarzan is on hand to save her from a horse stampede and whisk Mary to the treetops at last!! By the end the bad villain is dead, the half hearted villain, who was forcing Mary into marriage with him in return for Tarzan's life has repented and has sent her after Tarzan for the fadeout. At least with this Tarzan, apart from a scene where he is taught to read, there are no scenes to make him feelinferior because of his jungle upbringing - no scoffing at his tablemanners etc. And this Mary (or Jane) looked at him with longing - dare I say lust, she did not try to show she was superior by laughing at him!!! In different books I've read the story goes that once Jacqueline Welles changed her name to Julie Bishop in the early 1940s her career really took off, but looking at her filmography at IMDb she had a pretty big career in the thirties - she was a 1934 Wampas Baby Star and was the female lead in the horror cult classic \"The Black Cat\" (1934).",
         "In an attempt to cash-in on MGM's successful \"Tarzan the Ape Man\" (1932) starring Johnny Weissmuller, producer Sol Lesser went ahead with a serial follow-up. Perhaps not expecting its revival would become so valuable a property, MGM had not fully secured the rights. Cashing in on cashing in, the first four chapters of the \"Tarzan\" serial were edited into a feature-length \"Tarzan the Fearless\". The full 12-part serial is presently lost. This is not a good film, but it's worth seeing muscularly handsome Buster Crabbe in the lead role; he has a different, more spirited, take on the jungle man. Watchers should be advised that Mr. Crabbe's loincloth seems to be missing half of its backside, but his front is securely covered. *** Tarzan the Fearless (8/11/33) Robert F. Hill ~ Buster Crabbe, Julie Bishop, E. Alyn Warren, Edward Woods"
      ],
      "genres": [
         "Action",
         "Adventure"
      ],
      "productionCompanies": ["Sol Lesser Productions"],
      "summaries": [
         "In the African Jungle, a group of Europeans come across the fabled white man who was raised by apes. Tarzan takes an immediate liking to the blond Mary Brooks and rescues her during a nasty storm. Not everyone in the party sees Tarzan as a friend and one of the safari guides, Jeff Herbert, has a written offer of £10,000 for anyone who can confirm that the ape man is dead. Mary's father disappears however, taken prisoner by those who guard the treasure of Zar. It's left to Tarzan to rescue him and the others who have been taken prisoner.",
         "Mary Brooks' father, who has been studying ancient tribes, falls into the hands of \"the people of Zar, god of the Emerald Fingers.\" Tarzan helps Mary locate her father, rescues everyone from the High Priest of Zar, and takes Mary to his cave.",
         "Dr. Brooks is captured by followers of Zar, God of the Jeweled Fingers, but he is soon rescued from their lost city by Tarzan, a while man who was raised in the jungle by apes and speaks no English to speak of. But Tarzan undertakes to locate Brooks' daughter Mary after seeing a photograph of her. Meanwhile, back in the jungle, Mary and Bob Hall are searching for her father. Their guides, Jeff and Nick, are more interested in finding the treasure of Zar and scoring with Mary than finding Dr.Brooks. Jeff is in the possession of a message offering a large reward for Tarzan --- dead or alive. A group of Arabs, also captivated by Mary, accompany the searchers. Following a series of plots and counterplots, foiled by Tarzan, all hands are eventually captured by the followers of Zar. Jeff and Nick are killed and the survivors promise never to return to the Lost City. Mary decides to remain in the jungle as she has become quite fond of quaffing grapes in a cave with Tarzan."
      ],
      "budget": 0
   },
   "movielensId": 3139,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1933-08-11",
      "dvdReleaseDate": "1999-11-23",
      "directors": ["Robert F. Hill"],
      "runtime": 228,
      "movieId": 3139,
      "title": "Tarzan the Fearless",
      "mpaa": "",
      "actors": [
         "Buster Crabbe",
         "Julie Bishop",
         "Edward Woods",
         "Philo McCullough",
         "E. Alyn Warren",
         "Mischa Auer",
         "Matthew Betz",
         "Frank Lackteen"
      ],
      "imdbMovieId": "0024645",
      "originalTitle": "Tarzan the Fearless",
      "genres": [
         "Action",
         "Adventure"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Mary Brooks' father, who has been studying ancient tribes, falls into the hands of \"the people of Zar, god of the Emerald Fingers.\" Tarzan helps Mary locate her father, rescues everyone from the High Priest of Zar, and takes Mary to his cave.",
      "tmdbMovieId": 76083,
      "avgRating": 2.91288,
      "releaseYear": "1933",
      "numRatings": 132,
      "posterPath": "/d85mwmPS4zJnMLTtncnOOGJ9zen.jpg"
   }
}