{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "silent film",
         "id": 154802
      }],
      "imdb_id": "tt0014538",
      "video": false,
      "title": "Three Ages",
      "recommendations": [
         34847,
         32318,
         33015,
         51371,
         38787,
         701,
         46510,
         25768,
         38812,
         38830,
         51364,
         37360,
         51358,
         32600,
         50704,
         51303,
         51362,
         51366,
         51392,
         10146
      ],
      "backdrop_path": "/qKDb1DxUEuzRJX2bUkpt2GjZutL.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "The Boy",
               "gender": 2,
               "credit_id": "52fe44df9251416c9101fbc1",
               "name": "Buster Keaton",
               "profile_path": "/8weZnW4cxkbMxtFAtO1NhfTrM9D.jpg",
               "id": 8635,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "The Girl",
               "gender": 0,
               "credit_id": "52fe44df9251416c9101fbc5",
               "name": "Margaret Leahy",
               "profile_path": null,
               "id": 144005,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "The Villain",
               "gender": 2,
               "credit_id": "52fe44df9251416c9101fbc9",
               "name": "Wallace Beery",
               "profile_path": "/zJJe0w3dXlaU2xhhJFRIukCmPLw.jpg",
               "id": 29260,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "The Girl's Father",
               "gender": 2,
               "credit_id": "52fe44df9251416c9101fbcd",
               "name": "Joe Roberts",
               "profile_path": "/yhEKWSxEyaa6SveFMwe3XMHBalt.jpg",
               "id": 10525,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "The Girl's Mother",
               "gender": 0,
               "credit_id": "52fe44df9251416c9101fbd1",
               "name": "Lillian Lawrence",
               "profile_path": null,
               "id": 144006,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "The Amazon",
               "gender": 1,
               "credit_id": "52fe44df9251416c9101fbd5",
               "name": "Blanche Payson",
               "profile_path": null,
               "id": 140817,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "The Emperor / Cave Man / Roman Thug",
               "gender": 2,
               "credit_id": "52fe44df9251416c9101fbd9",
               "name": "Kewpie Morgan",
               "profile_path": null,
               "id": 144007,
               "order": 6
            },
            {
               "cast_id": 20,
               "character": "Roman Guard Knocked Down",
               "gender": 2,
               "credit_id": "56c62c09c3a3680d41003b1e",
               "name": "George Davis",
               "profile_path": null,
               "id": 120701,
               "order": 7
            },
            {
               "cast_id": 21,
               "character": "Old Fortune Teller",
               "gender": 1,
               "credit_id": "56c62c1ac3a3680d4e003c97",
               "name": "Louise Emmons",
               "profile_path": null,
               "id": 1106625,
               "order": 8
            },
            {
               "cast_id": 23,
               "character": "Undetermined Role (unconfirmed)",
               "gender": 2,
               "credit_id": "59d3f1c59251414b990051ac",
               "name": "Lionel Belmore",
               "profile_path": "/rLdourbL5LOLXNwkRSyIT6iTOti.jpg",
               "id": 29817,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44df9251416c9101fbab",
               "name": "Edward F. Cline",
               "profile_path": "/lkAs1ydjzF9SjDIXDFOx5VvCxjl.jpg",
               "id": 13953,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44df9251416c9101fbb1",
               "name": "Buster Keaton",
               "profile_path": "/8weZnW4cxkbMxtFAtO1NhfTrM9D.jpg",
               "id": 8635,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44df9251416c9101fbb7",
               "name": "Clyde Bruckman",
               "profile_path": "/b5drnn4Fzof0NBkrz7HFVJ7WfAy.jpg",
               "id": 10517,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe44df9251416c9101fbbd",
               "name": "Joseph A. Mitchell",
               "profile_path": null,
               "id": 10519,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "56c62b689251412449003bff",
               "name": "Jean C. Havez",
               "profile_path": null,
               "id": 10518,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "56c62b76c3a3680d4e003c80",
               "name": "Buster Keaton",
               "profile_path": "/8weZnW4cxkbMxtFAtO1NhfTrM9D.jpg",
               "id": 8635,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "56c62b87c3a3680d520038c5",
               "name": "Buster Keaton",
               "profile_path": "/8weZnW4cxkbMxtFAtO1NhfTrM9D.jpg",
               "id": 8635,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "56c62b96c3a3680d54003aa1",
               "name": "Joseph M. Schenck",
               "profile_path": "/h4CrbfNzM5W1edUruPjyvl0uxSj.jpg",
               "id": 10520,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "56c62ba5c3a3680d44003ec1",
               "name": "Elgin Lessley",
               "profile_path": null,
               "id": 10522,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "56c62bb0c3a3680d4e003c88",
               "name": "William C. McGann",
               "profile_path": null,
               "id": 88664,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "56c62bbb92514154750015c7",
               "name": "Fred Gabourie",
               "profile_path": null,
               "id": 10523,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "56c62bc9c3a3680d41003b07",
               "name": "Robert Ives",
               "profile_path": null,
               "id": 1375216,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "59cd74e49251414fee000364",
               "name": "Robert Israel",
               "profile_path": null,
               "id": 11524,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "59d3f218c3a368453f004fd8",
               "name": "Joseph M. Schenck",
               "profile_path": "/h4CrbfNzM5W1edUruPjyvl0uxSj.jpg",
               "id": 10520,
               "department": "Crew",
               "job": "Presenter"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 1.824559,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 32628,
      "vote_count": 29,
      "budget": 0,
      "overview": "\"The Three Ages,\" Buster Keaton's first feature-length film after a number of comedy shorts, is his parody of Griffith's \"Intolerance.\" Keaton tells three parallel stories about the perils of romance, one set in the Stone Age, one during the Roman Empire, and one during the 20th century.",
      "similar": [
         19,
         460793,
         74643,
         81003,
         82023,
         455661,
         458663,
         251516,
         9662,
         36208,
         14813,
         28966,
         293299,
         234,
         326359,
         961,
         43641,
         992,
         653,
         54553
      ],
      "original_title": "Three Ages",
      "runtime": 63,
      "poster_path": "/1xWJWo7FeL6KWvHHiXAnNiqUuUp.jpg",
      "spoken_languages": [{
         "name": "No Language",
         "iso_639_1": "xx"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Buster Keaton Productions",
         "id": 12190,
         "origin_country": ""
      }],
      "release_date": "1923-09-24",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": [
         "Edward F. Cline",
         "Buster Keaton"
      ],
      "runtime": 63,
      "synopsis": null,
      "writers": [
         "Clyde Bruckman",
         "Joseph A. Mitchell"
      ],
      "originalLanguage": null,
      "imdbLink": "http://www.imdb.com/title/tt0014538/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjI3OTEzODA4NF5BMl5BanBnXkFtZTgwODc0NDIwMjE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Buster Keaton, Margaret Leahy, Wallace Beery | See full cast and crew »"],
      "reviews": [
         "I'd have to rate this as slightly above-average Keaton fare. It shows Buster trying to romance the girl away from Wallace Beery, and what would have transpired if the story had taken place in (1) the Stone Age; (2) The Roman Age, and (3) The Modern Age. I liked them in that order, too, with more laughs with the older periods of time, although I laughed at the hardest at a couple of segments in the Roman Age. My favorite was the chariot race held in the sand. That had a number of clever things in the segment. The brief bit with the lion was funny, too, sort of a parody of the Biblical story of Daniel in the lion's den. They were smart only going five minutes or so with each age and then going back with the story each time. Each \"age\" had four or five segments in total. Nothing hilarious but definitely worth your time if you are checking out silent film comedies",
         "Loosely intended as a satire of D.W. Griffith's Intolerance, The Three Ages was Buster Keaton's first attempt at a full length comedy feature. The only similarities to Intolerance are the opening \"book\" scene and the fact that similar stories through the ages are edited together into a complete film. Keaton's reasoning for appropriating this style was that if it didn't succeed as a feature film, it could be reduced to three two-reelers. Fortunately, The Three Ages succeeds brilliantly as a comedy and contains some of the funniest routines I've seen in any of Keaton's film. There is nothing unique or daring about the story lines. They are simple boy-meets-girl, boy-loses-girl, boy-gets-girl plots, but the period satires are riotous and set the standard for future works by Mel Brooks and all films of this genre. However, I don't believe that anyone has ever topped this comedy. No one can play the lovable goof like Keaton and the stunts in this film are some of his best. In addition, Wallace Beery's appearance as Keaton's rival adds to this film's appeal. Anyone who thinks that comedy from the 1920's cannot be appreciated by modern audiences needs to see this movie.",
         "\"The Three Ages,\" Buster Keaton's first feature-length film after a number of comedy shorts, is his parody of Griffith's \"Intolerance.\" Keaton tells three parallel stories about the perils of romance, one set in the Stone Age, one during the Roman Empire, and one during the 20th century. In the context of Keaton, I don't see \"The Three Ages\" given a lot of mention. This is a shame, since while it's not Keaton's finest work, it ranks with his funniest. In one scene, Buster falls into a pit with a lion. Afraid of getting eaten, he pampers the lion and gives it a manicure. What follows is one of the funniest visual gags I've ever seen.",
         "This is a pleasant and funny combination of slapstick and satire, period humor and romantic comedy. It does not have quite the number of sustained chase/stunt sequences as in most of Keaton's features, but instead there are a lot of fine subtle gags of all different kinds. In each of the \"Three Ages\", Buster and Wallace Beery vie for the affections of the same woman, with amusing and unpredictable results. The simple romantic triangle theme sets up a lot of good material, on the one hand lending itself to a lot of gags about the unchanging nature of romantic courtship, and on the other hand being used for a lot of deliberate anachronisms that are often extremely funny. Beery makes a nice foil for Keaton, and the girl's parents also have some good moments. This one usually gets lost in the crowd among so many brilliant Keaton masterpieces, but it works very well and is definitely worth seeing for any fan of silent comedy.",
         "The more time I spend with old films, the more of a giant I see Keaton to be. I'm beginning to think that we all need to see a lot of him, which is why I wandered into this. It seems to have been made only because they had access to a Roman set. The setup is that a courtship story is presented in three eras: a cave-man setup, a Roman context and a modern one. All are based on film notions of those eras of course. Unlike most movie humor of the time, the joke here isn't in embellishing the story with humorous decoration. Its in the difference among the stories. Its a clever piece of what I call folding, and you will see at least one scene here that I swear is quoted in \"Rashomon.\" So there's the idea of the thing, which is worthwhile, but now I've explained it, you hardly have to see it. The jokes are trite. But there is one scene that I recall over and over. I think Keaton did it elsewhere and several others too, but here it is the best. He's driving a car, a rickety one to his girl's house. (This is in the modern setting, obviously.) He hits a bump and the car falls to pieces. And I just don't mean the wheels fall off, the car quite literally disassembles into the parts that went into the factory and there he sits among hundreds of items. I have no idea how he did this. The car really is moving as a car, and then in an instant it is in pieces. Wonderful. Ted's Evaluation -- 3 of 3: Worth watching.",
         "This was Keaton's first feature and is in actuality three shorts, set in different periods (Stone Age, Roman Age, Modern Age) on the eternal triangle of romance. The stories parallel each other as in Griffith's INTOLERANCE, which this was intended to satirize. The strengths of the jokes and gags almost all rely on anachronisms, bringing modern day business into ancient settings. **** WARNING - SPOILERS FOLLOW TO ELABORATE BEST POINTS ****** Here are the classic moments: Using a turtle as a wee-gee board (Stone Age); A wrist watch containing a sun dial (Roman Age); A chariot with a spare wheel (Roman Age); Using a helmet as a tire lock (Roman Age); Early golf with clubs and rocks(Stone Age); Dictating a will being carved into a rock (Stone Age); The changing weather forecaster (Roman Age); The chariot race in snow -Buster using skis and huskies with a spare dog in the chariot's boot(Roman Age). The above are all throw-away gags that keep us chuckling. There are however unforgettable moments as well: Buster taking out shaving equipment to match girl putting on make-up; The fantastic double take when an inebriated Buster gazes at his plate to discover a crab staring up at him (within one second he has leaped to stand on his chair from a sitting position and leaped again into the arms of the waiter - one of the funniest moments I've ever seen). And that lion - the manicure -just brilliant. There's also an off-color bit of racism when four African-American litter bearers abandon their mistress for a Roman crap game. Kino's print is a bit fuzzy and contains numerous sequences of both nitrate deterioration and film damage- most probably at ends of reels. The Metro feature is scored with piano and flute and borrows heavily from Grieg. Lots of fun and full of laughs.",
         "First time of seeing Buster Keaton's first feature film and I have to admit I liked it a lot and only wish I'd stumbled across it years ago. The Rohauer blurb at the start warns that the Three Ages single nitrate print was rediscovered and salvaged in 1954 just in time before combustion, and many frames that seemed hopelessly glued together were separated. So, it's rocky viewing in places, but I've seen and survived much worse. It would have been OK as the 3 short films but as a take on Intolerance it's inventive and funny from the start to the finish: In the Stone Age with baddie Wallace Beery riding an elephant and goodie Buster riding a pet brontosaurus; In the Roman Age Buster riding a chariot with wheel locks and adapted for sledging, No Parking signs in Latin; In this technological Age of Speed Need and Greed his car beautifully falls to bits at the first hump. Both him and Beery are after the Girl through the ages, a never ending tussle. Favourite bit: As the caveman he gets knocked backward over a cliff edge but still blows a kiss to the camera - an amazing second or two! Great stuff, reaffirming my love of silent film comedy.",
         "The Three Ages is not Keaton's funniest or most innovative film. In fact, he plays it rather safe, like a swimmer putting his foot in the water before he makes a dive. Unlike his next film Our Hospitality (1923), this movie feels more like an extension of the collection of two reelers he made in the first three years of the 1920s. The film's structure is meant to lampoon that of DW Griffith's mammoth epic Intolerance (1916). The entire movie has three parallel stories showcasing Buster's attempts to win a young lady in three different periods: prehistory, the Roman empire, and the then modern day. In each period he does battle with Wallace Beery over the girl, whose parents always find Beery a worthier mate. In the end, Beery is always revealed as a brute and it's up to Buster to rescue the girl from his evil designs. Most of the gags in the prehistoric and Roman ages are anachronistic, such as IDs on stone tablets and a sun dial wristwatch. They're cute, but not terribly funny. There are still some good bits of slapstick though, such as a chariot race, Buster's unplanned fall from a roof, and some funny antics at a restaurant. The sets in the Roman age are marvelous too. The leading lady Margaret Leahy is adequate. She was a beauty contest winner originally meant to play a supporting role in Norma Talmadge's Within the Law (1923), however, her lack of acting ability caused Norma to push her onto her brother-in-law Keaton, since it was believed one did not need an acting ability to do well in a comedy. While she's not nearly as charming as someone like Sybil Seely or Kathryn McGuire, Leahy is all right, just a little wooden. She leaves no impression, but then again, the love interest role in most Keaton films is thankless anyway. All in all, this film is decent. This is without a doubt one of the lesser BK pictures, but it's still a cute romp.",
         "Although the movie is clearly dated, audiences can still easily identify with the plight of hapless Buster in this timeless and very funny underdog tale. Buster fights against unkindly odds in three different ages: the Stone Age, The Roman Age, and the Moden Age, playing almost the same character with just a change of scenery to help us identify the different \"ages\". In this movie we see one of the earliest comedic depictions of the \"caveman\" stereotype, who wins his love not by romance but by brute force, as well as a funny twist on Roman gladiatorial combat, two comedic sketches that long predate such spoofs as Mel Brooks' \"History of the World: Part I\". The underlying theme of the movie is simple yet convincing: Although the times may have-a-changed, we still face the same struggles even in modern times that we fought in prehistoric times in order to \"win the girl\" (keep in mind this is the theme of 1923 America, a time when chauvinism was still en vogue). It is interesting to look at this movie over eighty years later, and consider how dramatically things have changed from this movie's \"modern times\" to now.",
         "Don't get me wrong, Buster Keaton fans. Although I do love \"The General\" considered one of the greatest comedies of all time, I find \"Three Ages\" far more dynamic, funny, interesting and way better than 1926's classic. Keaton's target here is love and its definition in a humored and simple presentation. He takes us through three different eras in history to show the challenges a romantic man (all played by Buster) has to go through while fighting for the woman of his dreams (Margaret Leahy), the ones he truly loves. The story of love is presented in a Pre-Historic period, then at the Roman Empire and last in the present day at the time of the movie's release, 1920's. It's the same issue presented again and again, just the problems that vary a little. Love, l'amour, amor: all we need in times of need, greed and speed. It was the goal back at millions of years ago, still is in our current time and always will be in future times. I admire \"Three Ages\" for its intelligence, a movie that directly or indirectly was the source of inspiration of many posterior films, successful or not. This is like Bill Forsyth's \"Being Human\" but with humor; and just like \"History of the World - Part I\" but only about love's evolution. Can we say that the famous between McFly versus Tannen through three different periods are somewhat similar than this film? Yes, I think so. Keaton fights against Wallace Beery in all the historic periods just like Michael J. Fox will deal with Thomas F. Wilson in 1955, 1985 and 2015 in Zemeckis classic. Forget all this conjectures; let us focus on the content. It's funny and gets funnier by the minute. Hilarious moments that can be found here are the priceless chariot race where Keaton uses of his geniality to win the race; his \"friendship\" with a lion that was supposed to eat him; the amazing stunts he pulls in the final moments of the last segment, jumping between buildings; his fighting schemes to defeat his cavemen enemies. Everything is so well made that is impossible not feel something with it. And there's a good and amusing discussion of what love really is and how its concept changes just a little with time and evolution (the very last moment explains it all). Gotta love this funny and precious gem. 10/10"
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Buster Keaton Productions"],
      "summaries": [
         "In his first independently produced feature film Buster tells of love and romance through three historical ages: the Stone Age, the Roman Age, and the Modern Age.",
         "The misadventures of Buster in three separate historical periods."
      ],
      "budget": 0
   },
   "movielensId": 3140,
   "movielens": {
      "languages": ["No Language"],
      "releaseDate": "1923-09-24",
      "dvdReleaseDate": "1999-11-23",
      "directors": [
         "Edward F. Cline",
         "Buster Keaton"
      ],
      "runtime": 63,
      "movieId": 3140,
      "title": "Three Ages",
      "mpaa": "",
      "actors": [
         "Buster Keaton",
         "Margaret Leahy",
         "Wallace Beery",
         "Joe Roberts",
         "Lillian Lawrence",
         "Blanche Payson",
         "Kewpie Morgan",
         "George Davis",
         "Louise Emmons",
         "Lionel Belmore"
      ],
      "imdbMovieId": "0014538",
      "originalTitle": "Three Ages",
      "genres": [
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "\"The Three Ages,\" Buster Keaton's first feature-length film after a number of comedy shorts, is his parody of Griffith's \"Intolerance.\" Keaton tells three parallel stories about the perils of romance, one set in the Stone Age, one during the Roman Empire, and one during the 20th century.",
      "tmdbMovieId": 32628,
      "avgRating": 3.54297,
      "releaseYear": "1923",
      "numRatings": 128,
      "posterPath": "/1xWJWo7FeL6KWvHHiXAnNiqUuUp.jpg"
   }
}