{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "los angeles",
            "id": 12670
         },
         {
            "name": "private detective",
            "id": 155790
         }
      ],
      "imdb_id": "tt0100828",
      "video": false,
      "title": "The Two Jakes",
      "recommendations": [
         31640,
         71825,
         28761,
         10990,
         10410,
         88818,
         39472,
         18355,
         41760,
         20096,
         6071,
         35201,
         32077,
         36288,
         9455,
         31945,
         29185,
         46027,
         3072,
         69007
      ],
      "backdrop_path": "/osuQWgr5wNwVeSeT9A1oc7sMh95.jpg",
      "revenue": 10000000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "J.J. \"Jake\" Gittes",
               "gender": 2,
               "credit_id": "52fe44e29251416c91020305",
               "name": "Jack Nicholson",
               "profile_path": "/z5kVLyn3sxj0wNRlFgVgT6deeRO.jpg",
               "id": 514,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Julius \"Jake\" Berman",
               "gender": 2,
               "credit_id": "52fe44e29251416c91020309",
               "name": "Harvey Keitel",
               "profile_path": "/4IcHhp1SCKijRxb7kqnxZNJuKdn.jpg",
               "id": 1037,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Kitty Berman",
               "gender": 1,
               "credit_id": "52fe44e29251416c9102030d",
               "name": "Meg Tilly",
               "profile_path": "/qR47kpFZR7ROd82oXJUj1CHYyZl.jpg",
               "id": 39117,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Lillian Bodine",
               "gender": 1,
               "credit_id": "52fe44e29251416c91020311",
               "name": "Madeleine Stowe",
               "profile_path": "/jqd70MNVUs3nTbxn3B3G6UNV4Oc.jpg",
               "id": 289,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Michael 'Mickey Nice' Weisskopf",
               "gender": 2,
               "credit_id": "52fe44e29251416c91020315",
               "name": "Rubén Blades",
               "profile_path": "/5J86KHFqEEFgMAdWfUqdpAD3sjV.jpg",
               "id": 2049,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Cotton Weinberger",
               "gender": 2,
               "credit_id": "52fe44e29251416c9102031f",
               "name": "Eli Wallach",
               "profile_path": "/nRoyZzUjzY7iGdnp2V2kOgrMMFi.jpg",
               "id": 3265,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Chuck Newty",
               "gender": 2,
               "credit_id": "5566b6c09251411d7f000c95",
               "name": "Frederic Forrest",
               "profile_path": "/fCHsWrGcgfREM7e9POq6FCFGvR9.jpg",
               "id": 8351,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Det. Lt. Loach",
               "gender": 2,
               "credit_id": "5566b6cc9251414789000fc9",
               "name": "David Keith",
               "profile_path": "/v1b7NQqJifk7xgt9HOGh0lvfkbP.jpg",
               "id": 18181,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Earl Rawley",
               "gender": 2,
               "credit_id": "5566b6d5c3a368174b000e5d",
               "name": "Richard Farnsworth",
               "profile_path": "/dS8N3GEDzrr0rrCQo6Q3ZyNdX8b.jpg",
               "id": 5605,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Tyrone Otley",
               "gender": 2,
               "credit_id": "5566b6e3925141478d000f9d",
               "name": "Tracey Walter",
               "profile_path": "/pMeImyAZ8fpQ32QyPO8g6W8gs13.jpg",
               "id": 3801,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Lawrence Walsh",
               "gender": 2,
               "credit_id": "5566b6ec9251411d7f000c9a",
               "name": "Joe Mantell",
               "profile_path": "/5yDIgBi2dYc7PdTcAcmSLeSg4t1.jpg",
               "id": 78937,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Kahn",
               "gender": 2,
               "credit_id": "5566b6f3c3a368175a00109c",
               "name": "James Hong",
               "profile_path": "/8k4RrDRsqkvJDePU8ciMOOx5Zso.jpg",
               "id": 20904,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "Captain Lou Escobar",
               "gender": 2,
               "credit_id": "5566b6fdc3a3681749001034",
               "name": "Perry Lopez",
               "profile_path": "/bpw3oCVkAasOd8A2uwy60pnSXoD.jpg",
               "id": 12295,
               "order": 13
            },
            {
               "cast_id": 20,
               "character": "Evelyn Mulwray (voice)",
               "gender": 1,
               "credit_id": "5566b70e9251414787000f53",
               "name": "Faye Dunaway",
               "profile_path": "/sq12RJZ1HTXHHI48y31YIS2qp87.jpg",
               "id": 6450,
               "order": 14
            },
            {
               "cast_id": 21,
               "character": "Plainclothes Policeman",
               "gender": 2,
               "credit_id": "5566fdc19251414789001734",
               "name": "Tom Waits",
               "profile_path": "/3XXe20xrdgUaOchQt5YOQqqSH6u.jpg",
               "id": 2887,
               "order": 15
            },
            {
               "cast_id": 22,
               "character": "Gladys",
               "gender": 1,
               "credit_id": "55f04e5b92514140a600008c",
               "name": "Rebecca Broussard",
               "profile_path": null,
               "id": 1385917,
               "order": 16
            },
            {
               "cast_id": 23,
               "character": "Liberty Levine",
               "gender": 0,
               "credit_id": "55f04e5c92514140a600008f",
               "name": "Paul A. DiCocco Jr.",
               "profile_path": null,
               "id": 1507585,
               "order": 17
            },
            {
               "cast_id": 24,
               "character": "Mark Bodine",
               "gender": 0,
               "credit_id": "55f04e5cc3a3684c7b0000c1",
               "name": "John Hackett",
               "profile_path": null,
               "id": 1507586,
               "order": 18
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44e29251416c910202f5",
               "name": "Jack Nicholson",
               "profile_path": "/z5kVLyn3sxj0wNRlFgVgT6deeRO.jpg",
               "id": 514,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e29251416c910202fb",
               "name": "Vilmos Zsigmond",
               "profile_path": "/zItpdF2B0mohQSFs40E7eUg3nkL.jpg",
               "id": 12235,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe44e29251416c91020301",
               "name": "Anne Goursaud",
               "profile_path": null,
               "id": 2873,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e29251416c9102031b",
               "name": "Robert Towne",
               "profile_path": "/hF5R8kmpreIZsv47mIYzDN5XX2Q.jpg",
               "id": 11057,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "59e2aacdc3a36846bd0013a4",
               "name": "Harold Schneider",
               "profile_path": null,
               "id": 12844,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "59e2aadac3a36846ae001559",
               "name": "Jack Nicholson",
               "profile_path": "/z5kVLyn3sxj0wNRlFgVgT6deeRO.jpg",
               "id": 514,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "59e2aae6c3a36846bd0013db",
               "name": "Robert Evans",
               "profile_path": "/pSzHgQKT3qnCuAFyh3IpilopKt0.jpg",
               "id": 12288,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "59e2aaf692514107f5001598",
               "name": "Van Dyke Parks",
               "profile_path": null,
               "id": 58099,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 4.939516,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 32669,
      "vote_count": 61,
      "budget": 19000000,
      "overview": "This sequel to the classic Chinatown finds private detective Jake Gittes still haunted from the events of the first film. Hired by a man to investigate his wife's infidelities, Jake once again finds himself involved in a complicated plot involving murder, oil, and even some ghosts from his past.",
      "similar": [
         1847,
         96,
         910,
         4771,
         829,
         949,
         320,
         281,
         90,
         984,
         306,
         1266,
         9411,
         963,
         1834,
         10651,
         5236,
         856,
         1640,
         1586
      ],
      "original_title": "The Two Jakes",
      "runtime": 138,
      "poster_path": "/cCRPoFWEvplQ6GyjJlLhXLA9q6z.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1990-08-10",
      "vote_average": 6.2,
      "belongs_to_collection": {
         "backdrop_path": "/mPf6vo6hAzftf8qRS4qbwRVBBkJ.jpg",
         "name": "The Jake Gittes Collection",
         "id": 359005,
         "poster_path": "/bv2if3JS0E5IScbkrNJMmiJtcPF.jpg"
      },
      "tagline": "They say money makes the world go round. But sex was invented before money.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Jack Nicholson"],
      "runtime": 137,
      "synopsis": "In post-war Los Angeles there is an incriminating wire recording of a tryst that isn't supposed to be fatal. It is recorded by LA private detective J.J. \"Jake\" Gittes for his client: real estate developer of B&B Homes \"Jake\" Berman, to 'incriminate' Berman's 'unfaithful' wife Kitty who is having an affair in the Bird of Paradise Motel in Redondo Beach with Berman's own real estate business associate Bodine. Berman shoots Mark Bodine in cold-blood as he flees into the motel's bathroom. In the tape recording, a mysterious reference to Katherine Mulwray between the two adulterers stirs up memories of the past for Gittes. (Katherine Mulwray, the blonde teen aged daughter of the earlier film's tragically-killed heroine Evelyn Mulwray, Jake's former client and lover, was sired by incestuous rape by her tycoon father Noah Cross.) It is revealed that Gittes has been set up in the murder-for-profit scheme. The murder cannot be considered justifiable homicide because Berman deliberately killed his partner-he had a gun conveniently planted under a chair delivered to the room-in order to commit premeditated murder of Bodine, a capital crime. For business reasons, partner Bodine's will excludes his sexpot widowed wife, Lillian Bodine and named \"surviving partner\" Berman the sole beneficiary of B&B Homes' enormously profitable real estate business (tract housing in San Fernando Valley). Her attorney Chuck Newty states that she is entitled to her husband's wealth if the murder could be proven to be premeditated. Did Berman plan the murder with his wife Kitty in order to collect money from the deceased partner's share? If true, this would also make Gittes an unwitting accomplice to murder. During convoluted developments in the plot, Gittes discoveres that Berman's tract housing sub development, located in an orange grove (the same irrigated location that Gittes visited in the original film), is also being surreptitiously drilled for its vast underground resources by greedy oil baron Earl Rawley, Bodine's business associate. In a preliminary court public hearing regarding the recording, the tape is played, but the evidence is obviously tampered with by Gittes to hide Berman's cold-blooded guilt and to protect Mrs. Berman. Red-haired Kitty is actually the elusive blonde Katherine Mulwray- which Gittes figures out when he realizes that she dyed her hair red. Through various legal and title documents, Katherine is shown to be the original owner of the orange grove and of the mineral rights to the subdivision land, but is forced to sign over a quit-claim deed to the land only to criminal nightclub owner Michael 'Mickey Nice' Weisskopf, Berman's gangster associate, on July 17, 1946. Bodine was blackmailing Berman about the real identity of his wife, threatening to expose her if she didn't sign over the mineral rights-and Bodine was also, as Berman jealously admitted, engaged in a real affair. That was the real motivation in killing Bodine. Gittes perjures himself in court to protect the daughter of the woman that he was unable to protect. Berman also divulges to Gittes that he is terminally ill (with advanced syphilis viewed on X-rays and under a microscope, unsuccessfully treated with radium implants which are also causing cancer)-but has not told his wife Kitty about his condition. To ensure that she would definitely inherit his real-estate fortune (his intention all along)-he deliberately and suicidally blows himself up and ends his life in one of the development's tract homes by lighting a cigarette in the volatile, natural gas-filled environment after a shaky earthquake. In the final scene, Gittes speaks to Kitty/Katherine about their mutual pasts as she leaves his office, in the final line: \"It (the past) never goes away\" (Jake's belated answer to her earlier question: \"Does it ever go away, the past?\").",
      "writers": [
         "Robert Towne",
         "Robert Towne"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0100828/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTA4NTI0MzA3MDReQTJeQWpwZ15BbWU2MDMyMDc3OQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Jack Nicholson, Harvey Keitel, Meg Tilly | See full cast and crew »"],
      "reviews": [
         "The Two Jakes and The Godfather 3 were released in the second half of 1990 and both films proved that sometimes it's best not to tamper with classics. This is not necessarily because sometimes a sequel can't compliment a classic, but because no matter what you do, there's no way to avoid comparing the new versions to the old. And the final chapter of the Godfather trilogy is vastly inferior to the first two. And Two Jakes is vastly inferior to Chinatown. But since Chinatown and the first two Godfathers are among the best films every made, that's a pretty pointless comparison. Just as The Godfather 3 stands on its own as a very sturdy and interesting piece of filmmaking, Two Jakes also works on its own merits. It's confusing, overlong (a full ten minutes more than the original), and never fully gels, but it's also passionate, intelligent filmmaking. Go figure. In his autobiography, producer Robert Evans refers to Robert Towne's script for Two Jakes as basically only half-finished. It was half-finished when they started shooting, half-finished when they made it half-way through the shoot, and it pretty much feels half-finished in the final product. This is a movie where characters wander in and out and a full two-thirds of the storylines go essentially unresolved. The grand climax of the film (and trust me, I'm not spoiling anything) is an evidentiary hearing, for heavens sakes! And I couldn't really explain the plot if I wanted to, but here's the quick summary: It's fifteen years after Chinatown and Jake Gittes Jack Nicholson) has become older, fatter, and a good deal more bitter. He's now an Investigator respected throughout LA, but he's still haunted by his experiences with the Mulwrays, especially the late Evelyn. The film begins with a jealous husband, Jake Berman (Harvey Keitel), storming into a hotel room and killing his wife's lover, with Jake listening in the next room. Of course, you know the crime probably wasn't entirely about love or lust and that money probably had something to do with it. Money, history, and oil, actually. And it spins in circles from there. It's easy to notice that the film slacks off at around the half-way point. It's then that you realize just how tight Robert Towne's Chinatown script was. Even at a shred over two hours, every word counts, every gesture, every twist. Two Jakes is flabby in comparison. The dialogue is pleasantly hardboiled and the actors enjoy delivering it, but the resolutions of the various mysteries mostly fall flat. You either see them coming, or don't understand when they arrive. It's to Towne and director Jack Nicholson's credit that the film ends on a number of satisfying grace notes. Nicholson's direction is almost never the source of the film's flaws. And this is legitimately high praise in a film as twisting and convoluted as this. Of course, he again makes you appreciate the brilliant economy of Roman Polanski's direction of Chinatown, a film with an immeasurable amount of class. Nicholson produces several wonderful moments including a beautiful pull shot from the ocean to a teatime conversation with Kahn (who Chinatown fans will avidly remember). Nicholson and director of photography Vilmos Zsigmond capture a Los Angeles of burnt out dreams, on the brink of overdevelopment and overexpansion. The film has noir stylings but it respectfully looks different from Chinatown. Nicholson's performance is more a study of what has happened to the actor since Chinatown, rather than what has happened to the character. Because Jack was less of an icon when Chinatown was made, the original Jake Gittes is one of his least iconic performances. By the time he won his Oscar the next year for One Flew Over The Cuckoo's nest Nicholson had already become JACK (in all caps) and he hasn't looked back. In Two Jakes, Jake Gittes has become JACK. There's no getting around it. However, there's also no getting around the fact that Nicholson is a great actor and even if his performances are frequently variations on a theme, it's a pretty super theme. Two Jakes is peppered with supporting performances of varying degrees of depth. Harvey Keitel has never been better as the second of the two Jakes. His character is emotionally complicated and perhaps the only person in the film (besides Gittes) who gets to go through a character arc. He plays it wonderfully. The femmes fatale in the film, as played by Madeline Stowe and Meg Tilly are less and more complicated than they seem. Ruben Blade, Richard Farnsworth, and Eli Wallach provide capable support when they're given anything to do. The fact is that like the Godfather 3, if you came upon Two Jakes with a completely open mind, you'd find it a complicated thriller, vastly more substantial than most films of the genre. The fact that it's got its flaws that it'll never compare to Chinatown are the basis for a 7/10 rating.",
         "Jack Nicholson is certainly one of the greatest actors of this or any generation. Chinatown is perhaps his greatest film and he certainly should have won an Oscar for it. Sam Spade and Phillip Marlowe certainly have nothing on his Jake Gittes! The only problem with this sequel is that it came out many years too late. I read that Robert Evans originally wanted to make it in the 1980s but legal problems held it up. The Two Jakes was pretty much ignored at the box office and got some awfully bad reviews. I could not understand why because I thoroughly enjoyed it. So many films that come out are geared towards kids and make you feel like a kid again when you see them. Thats okay, but this film made me feel like an adult seeing it. The film is as good as Chinatown in so many ways. I love the props and the ambiance of the 1940s that they use. Jack did a great job directing this film and he deserves a lot more credit.",
         "Most reviews pull The Two Jakes to pieces, except for a very well-considered one by Roger Ebert (find it at the Chicago Sun-Times). Of course, it's not the classic Chinatown is, but it's a damned good movie. It's about the past, how it pervades our lives for the rest of our days, and how we assimilate it into our futures. Many have complained that the film is convoluted, that when the key revelation comes (I ain't givin' that away) you miss the impact of it. I strongly disagree with this. I for one had actually figured out the revelation before it happened - this didn't bother me because I wanted so much for it to be what I had thought it was going to be. And when it comes, it's so subtle you could almost be forgiven for missing it. It's lovely, so comforting in a very ironic way. All I'll say is, pay attention to the scene where Jake (Nicholson) goes to see Kahn (the unmistakable James Hong). Something about the flowers... Anyway, I'm drifting. The Two Jakes is subtle, well-crafted, and when all is revealed, so very simple. The 'convoluted' events in the plot serve to illustrate what a single, simple desire can cause. Just watch it. Bear in mind the events and characters from Chinatown, but only so that you have a backstory for these characters and not a standard to which they should be compared. \"It never goes away...\"",
         "Most reviews pull The Two Jakes to pieces, except for a very well-considered one by Roger Ebert (find it at the Chicago Sun-Times). Of course, it's not the classic Chinatown is, but it's a damned good movie. It's about the past, how it pervades our lives for the rest of our days, and how we assimilate it into our futures. Many have complained that the film is convoluted, that when the key revelation comes (I ain't givin' that away) you miss the impact of it. I strongly disagree with this. I for one had actually figured out the revelation before it happened - this didn't bother me because I wanted so much for it to be what I had thought it was going to be. And when it comes, it's so subtle you could almost be forgiven for missing it. It's lovely, so comforting in a very ironic way. All I'll say is, pay attention to the scene where Jake (Nicholson) goes to see Kahn (the unmistakable James Hong). Something about the flowers... Anyway, I'm drifting. The Two Jakes is subtle, well-crafted, and when all is revealed, so very simple. The 'convoluted' events in the plot serve to illustrate what a single, simple desire can cause. Just watch it. Bear in mind the events and characters from Chinatown, but only so that you have a back story for these characters and not a standard to which they should be compared.",
         "Being a \"sequel\" to \"Chinatown,\" I had high expectations of this film. I even gave it two looks - one on VHS and then one a few years later on DVD - because I wanted so much to like it....but it stunk each time. What a waste of money. The only thing going for it is the beautiful film-work and the great 1940s atmosphere, as \"Chinatown\" had some 16 years earlier when that film came out. (Kind of long wait for a sequel, anyway, don't you think?) If ever a movie could be called \"convoluted,\" it's this one. It made Chinatown as simple as \"Bambi.\" Even the mainline critics all agreed this was incoherent in its storytelling. It's less confusing, but not much, if you know the characters from Chinatown since there are references to \"Kathryn Mulray.\" However, it's just too frustrating to watch and try to follow what's going on. I know lots of people who loved \"Chinatown\" but not one who likes this film.",
         "This sounded pretty good... Nicholson is mostly fun to watch, and I enjoyed Chinatown immensely(Towne returning to write this sequel was a treat, as well). I enjoyed it for a while, but not too far past the half-way point, I realized that it had run out of steam... the film kept rolling, but it no longer kept the viewers' attention. Jack Nicholson is no director, and it shows... while he is a skilled actor, he should stay in front of the camera instead of trying his hand behind it. The cinematography is close, but doesn't quite make it to being good... we have shots that linger, and wasted opportunities aplenty. Polanski's loose, involving camera is sorely missed here. The pacing is also off... the film ends up seeming heavy as a result. The writing is quite good. The acting varies, but is mostly on the positive end. The tone isn't entirely sure what it wants to be, but does create some great \"noir\" moments. Jake's monologues are occasionally spot-on. The mystery varied some... parts of it, I had figured out before the lead, whereas others only became clear to me just as they were revealed. This is a hit and miss scenario... and unfortunately, it misses more than it hits. This is worth watching as a continuation of Chinatown for those that want more of the plot, and can compromise with the drop in style and finesse of the film-making values. I recommend this to big fans of Jack Nicholson and those interested in seeing what occurred after the events of Chinatown. 6/10",
         "\"The Two Jakes\" is the sequel to \"Chinatown\", a film that really did not need another chapter. However, with that said this is an above average film that works most of the time. Jack Nicholson returns and is sucked into another web of deception and corruption. He is hired by Harvey Keitel to follow his two-timing wife (a very sexy Madeleine Stowe). Just like before, the more Nicholson learns about his case, the stranger and more complicated it becomes. Everything will lead to fireworks which involves a housing development and oil-drilling in the Los Angeles area. Like \"Chinatown\", \"The Two Jakes\" is multi-layered and somewhat confusing at times. It will likely take multiple viewings to get the full effect of this film if you are unable to get it on the first try. Robert Towne's screenplay is smart, but Nicholson's direction lacks the creativity and overall brilliance of Roman Polanski's. Meg Tilly is adequate in the film. Ruben Blades and Richard Farnsworth both do good work, but overall nothing in this film can match what was accomplished 16 years earlier with its predecessor. 3.5 out of 5 stars.",
         "Knowing this Chinatown sequel's detested reputation, I was too interested in seeing a movie directed by Jack Nicholson to turn away. I was surprised to find that it is very under-appreciated. Nicholson is quite an inventive, if a little show-offy, director. His confident helming of the very late sequel to a highly revered contemporary classic is full of interesting shots and his performance realistically portrays an older, wiser Jake Gittes who has been seasoned with philosophies on the pain and importance of the past. It is not simply on account of Nicholson. Robert Towne's own continuation of his predecessor is quite creative. Harvey Keitel plays the second Jake, who has hired the initial Jake to catch his wife cheating on him red-handed. In the course of the sting, Keitel up and shoots the adulterous lover, who turns out to be his real estate partner. Nicholson is now under intense scrutiny for his unwitting part in the crime and has to figure out if it was justifiable homicide or straight murder. The case proceeds to elude to California's booming oil industry as well as his own past after he stumbles upon a wire recording during the investigation that mentions the daughter of Faye Dunaway's ill-fated character in the last film. The Two Jakes, to me, can stand on its own with Chinatown. Polanski directed the first film much much differently than Nicholson addresses this follow-up. I don't believe in the case of Chinatown a sequel needs to be a comparable continuation. Making a second installment sixteen years later allows a lot of license for it to be its own beast. Some such sequels done that way are disasters. The Two Jakes stays afloat. And Madeleine Stowe remains the most insatiably attractive woman of any superlative comment that I've made within the past month, at least. And I've made a lot. The film's theatrical trailer is actually incredible. It's narrated by Gittes, telling us how the war was good for Los Angeles in so many different ways that contribute to his business, as extremely dry bits of humor throughout the film punctuate it here and there and provocative, often voyeuristic shots from the movie are included.",
         "In \"The Two Jakes\" (just as in \"Chinatown\"), private investigator Jake Gittes (Jack Nicholson) finds himself in a tight spot after having been misled by one of his clients. The deception in \"Chinatown\" related to a client's identity whereas in this case, it's hidden motives that lead to big problems for Jake. The subsequent investigations in both movies soon mushroom into something far larger than originally anticipated and eventually uncover serious corruption involving California's valuable resources. The similarities between the two plots are not untypical of what's normally seen where a successful movie is followed by a sequel, but in order to establish its own value convincingly, a sequel needs to provide something different or better than the original. In this case, something different is attempted as, due to the passage of time since the original film, Jake has evolved significantly as a character and his preoccupation with past events fills him with sadness and regret as well as a profound sense of loss. The events in \"The Two Jakes\" take place in Los Angeles in 1948. Eleven years have elapsed since Evelyn Mulwray was shot in Chinatown and Jake is now considerably more prosperous. His business has expanded and been relocated to an impressive new building and despite the often sleazy nature of his work, he's gained a certain degree of respectability as well as some extra weight. A property developer, who's convinced that his wife is having an affair, approaches Jake with what appears to be a routine job to gather evidence against her. Jake supplies the recording equipment and cameras to record what transpires when he and his client, Jake Berman (Harvey Keitel) go to the motel where Mrs Berman (Meg Tilly) is expected to be with her lover. On the night when their plan is put into action, Berman breaks into the motel room and on finding his wife with another man, simply shoots him dead. Jake is shocked to discover that the dead man is Berman's business partner and his wife, Lillian Bodine (Madeleine Stowe) thinks that what transpired was a planned murder. Furthermore, Lillian's attorney Chuck Newty (Frederic Forrest) tells Jake that it appears that he was an accessory to murder and that unless he can prove that Berman planned to kill his partner, he will see to it that Jake is sued and financially ruined in the process. Mysteriously, the recording made at the motel included a couple of mentions of Katherine Mulwray's name and Jake decides to find out their significance as well as pursuing his investigation into what lay behind the killing of Mark Bodine (John Hackett). He discovers that Berman and Bodine were involved in selling houses in a subdivision of the San Fernando Valley and that, in the event of Bodine's death, Berman and his wife would inherit the whole business. As it seemed possible that there may be oil deposits on the land, the business could, in fact, be more valuable than first realised and in that case, whoever held the mineral rights could potentially become very rich. Jake pursues the various strands of his investigation with limited success until he eventually finds the answers to all his questions from someone who, like him, is haunted by the past. An important prerequisite for fully understanding and enjoying \"The Two Jakes\" is an ability to recall the complicated plot of \"Chinatown\" and the names of its various characters. As this sequel was released 16 years after the original film, it's obvious that a high proportion of cinema-goers at that time would not have been able to appreciate it sufficiently to enjoy it themselves or to recommend it to their friends and consequently it's also not surprising that it wasn't a box office success. In a very empathetic performance which is both measured and subtle, Jack Nicholson conveys just how jaded, world weary and cynical Jake has become since his experiences in Chinatown and also how deeply he's haunted by the past. The remainder of the cast also contribute strong performances with Keitel, Stowe and Tilly being particularly good. \"The Two Jakes\" falls short of the brilliance of its classic predecessor but there's still much to commend it. Its story of adultery, greed, blackmail and murder is intriguing throughout and extremely well written. The inclusion of Peggy Lee's song \"Don't Smoke In Bed\", some eye-catching art deco surroundings and Vilmos Zsigmond's stunning cinematography also contribute immensely to the wonderful atmosphere of the piece which seems to evoke late-1940s L.A. so convincingly. The only caveat, however, is to make sure to see \"Chinatown\" before watching this movie.",
         "The Two Jakes is probably the most perfect example of why no one should ever make a sequel to a masterpiece 16 years later (Godfather III, anyone?). It's very easy to say that it suffers unfairly in comparison to the masterpiece that was Chinatown, & that one should take it on its own terms. Fair enough, but to anyone who hasn't seen Chinatown, the plot of The Two Jakes is completely & utterly incomprehensible, as opposed to extremely confusing to those who have. The film can only be understood as an addition to the story that began in Chinatown, & as such, can't avoid savage comparisons when placed alongside such a vastly superior film. It picks up the story of Jake Gittes ten years or so after the events of Chinatown. He finds himself embroiled in another seemingly straightforward infidelity case gone wrong, which leads to corruption & treachery in the highest corridors of power, this time over oil, rather than water. The twist, such as it is, involves Katherine Mulwray, the incestuous offspring of Evelyn Mulwray & her father, the vile Noah Cross, the heroine & villain from Chinatown. Sounds good, but this interesting idea is buried within a labyrinthine mess of a plot that jumps all over the place, with real estate scams, terminal diseases, petty hoodlums, earthquakes, gay bars, & most irritating of all, Jake's over-demanding fiancé. What buries the film is the fact that it doesn't ever really know what sort of film it actually wants to be. Chinatown was a twisted detective story that got darker & darker every minute, & left the viewer in a world where evil triumphed, nothing was certain, & no one could be trusted. The Two Jakes, however, is constantly veering between Jake's depressing musings over the past, screwball sex comedy with Madeleine Stowe's loopy widow, vague hints at conspiracy theories over who really runs Los Angeles, & a general air of cuteness around the character of Jake Gittes. Rather than being regarded by his peers as the disruptive & sleazy bedroom peeper that he is, he tends to be popular among just about everyone, cop & criminal alike. You can just hear them saying, \"Oh, that Jake, he's such a character, tsk, tsk...\" There's no terrifying villain to even approach the demon that John Huston created with Noah Cross - no real villain at all, come to think of it. Harvey Keitel's Jake Berman is the architect behind the whole scam, but ends up as some sort of hero/victim who was acting with good intentions all along (despite shooting a man in cold blood), Mickey Nice (Ruben Blades) is more like a cartoon character waving weapons around & never using them, & Earl Rawley (Richard Farnsworth) is never exactly made out to be doing anything REALLY immoral or illegal, despite being the man who seems to be in charge of absolutely everything (i.e. the successor to Noah Cross). The great twist regarding the identity of Katherine Mulwray is the final nail in the coffin. Given Jake's obsession over the past, & over her in particular, it's not convincing at all that he wouldn't have recognised her immediately, even though he meets her 'alter-ego' several times before finally realising her true identity in one of the most poorly executed revelation scenes I've ever seen. You're left thinking, \"Um, so who's she really meant to be? Oh, that's right, Katherine Mulwray - but wouldn't he have known anyway, er, are you sure she's Katherine Mulwray, he didn't actually say, maybe she's someone else...\" For the psychotic Chinatown fan (& yes, I do count myself as one), there's plenty of cameos & references - Joe Mantell as Jake's offsider Walsh, Perry Lopez as a handicapped Lou Escobar, James Hong as Kahn, Evelyn Mulwray's butler, the snotty clerk in the hall of records makes an appearance, the same orange groves are used as a location (complete with the exact same 'No Trespassing' sign - it just happens to be lying around), old photos & newsclippings are used ad nauseam, despite the fact that they're stills from Chinatown that couldn't possibly have been taken as photos, & even Faye Dunaway pops up, in a brief voice-over. Plenty of things to remind the fans what it's a sequel to, & there are some wonderfully haunting echoes of the past that constantly torments Jake Gittes, but ultimately, The Two Jakes is just a big, disappointing mess. Loads of talent, no direction. Chinatown's writer & creator, Robert Towne, had originally envisioned a trilogy of J.J. Gittes films chronicling the history of Los Angeles, one set in the 1930's about water, one in the 1940's about oil, & another in the 1950's about the freeway system (apparently to be called 'Cloverleaf', after a type of freeway exit configuration). He, along with Robert Evans & Jack Nicholson, set up a company in the 1980's called TEN (Towne, Evans, Nicholson) to continue the endeavour, & Towne was slated to direct The Two Jakes, but he walked away long before the production actually started. The one reason that's most often cited was his objection to the original casting of producer Robert Evans as Jake Berman. Roman Polanski wasn't available to direct for obvious reasons. So, much like Jake Gittes' own thoughts, The Two Jakes is largely a collection of \"what if?\"s. Had Towne still been on board, & had Polanski been available to direct, who knows what might have been?"
      ],
      "genres": [
         "Crime",
         "Drama",
         "Mystery"
      ],
      "productionCompanies": [
         "88 Productions",
         "Paramount Pictures"
      ],
      "summaries": [
         "After the war, L.A. private eye Jake Gittes is hired by realtor Jake Berman. He proves the infidelity of Berman's wife Kitty and sets up a way for her to be caught in the act. At the rendezvous, Berman shoots the co-respondent who turns out to be his business partner. Gittes finds himself in the middle of a complicated web, under pressure from all sides for a wire recording of the fatal encounter. He then realises that the land the partners were developing was once an orange grove connected with a case he has never quite got over.",
         "The sequel to Chinatown (1974) finds Jake Gittes investigating adultery and murder... and the money that comes from oil."
      ],
      "budget": 19000000
   },
   "movielensId": 3141,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1990-08-10",
      "dvdReleaseDate": "1999-11-23",
      "directors": ["Jack Nicholson"],
      "runtime": 138,
      "movieId": 3141,
      "title": "The Two Jakes",
      "mpaa": "R",
      "actors": [
         "Jack Nicholson",
         "Harvey Keitel",
         "Meg Tilly",
         "Madeleine Stowe",
         "Rubén Blades",
         "Eli Wallach",
         "Frederic Forrest",
         "David Keith",
         "Richard Farnsworth",
         "Tracey Walter",
         "Joe Mantell",
         "James Hong",
         "Perry Lopez",
         "Faye Dunaway",
         "Tom Waits",
         "Rebecca Broussard",
         "Paul A. DiCocco Jr.",
         "John Hackett"
      ],
      "imdbMovieId": "0100828",
      "originalTitle": "The Two Jakes",
      "genres": [
         "Crime",
         "Drama",
         "Mystery"
      ],
      "youtubeTrailerIds": ["WWbiQAr8miI"],
      "plotSummary": "This sequel to the classic Chinatown finds private detective Jake Gittes still haunted from the events of the first film. Hired by a man to investigate his wife's infidelities, Jake once again finds himself involved in a complicated plot involving murder, oil, and even some ghosts from his past.",
      "tmdbMovieId": 32669,
      "avgRating": 2.98193,
      "releaseYear": "1990",
      "numRatings": 581,
      "posterPath": "/yIVkNzi08VNs8aFd5uxGHDI29Fg.jpg"
   }
}