{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "tour",
            "id": 5287
         },
         {
            "name": "concert",
            "id": 6029
         },
         {
            "name": "u2",
            "id": 10097
         }
      ],
      "imdb_id": "tt0096328",
      "video": false,
      "title": "U2: Rattle and Hum",
      "recommendations": [
         75772,
         32591,
         42898,
         39081,
         19537,
         78056,
         107268,
         104697,
         106808,
         17868,
         214090,
         38955,
         64262,
         120637,
         4375,
         91018,
         43234,
         25163,
         28717,
         62944
      ],
      "backdrop_path": "/e7lbRMn7Ldf1fdDE9399VsdtwlN.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Bono",
               "gender": 2,
               "credit_id": "52fe47649251416c75097a93",
               "name": "Bono",
               "profile_path": "/pj3JYEJlVkNV91fxDHkgWKhDdot.jpg",
               "id": 33684,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "The Edge",
               "gender": 2,
               "credit_id": "52fe47649251416c75097a97",
               "name": "The Edge",
               "profile_path": "/oB64cRlIPxNwXjQp9npCo1eGbsM.jpg",
               "id": 82426,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Larry Mullen Jr.",
               "gender": 2,
               "credit_id": "52fe47649251416c75097a9b",
               "name": " Larry Mullen Jr.",
               "profile_path": "/xHKSUpnNubNaA3ABVhcYgG5s4LT.jpg",
               "id": 82428,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Adam Clayton",
               "gender": 0,
               "credit_id": "52fe47649251416c75097a9f",
               "name": "Adam Clayton",
               "profile_path": "/fqCXyDitGMPzAPvCsAtZ1spor1R.jpg",
               "id": 82427,
               "order": 3
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe47649251416c75097aa5",
            "name": "Phil Joanou",
            "profile_path": "/5snXDgDV7xU0uX6ZbXiAxSXHbmI.jpg",
            "id": 18500,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Documentary",
            "id": 99
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 2.235139,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 18161,
      "vote_count": 30,
      "budget": 0,
      "overview": "A concert movie on an unprecedented scale, Rattle And Hum captures U2 - on and off the stage - during their triumphant Joshua Tree tour. From the giant technicolour stadium celebrations to the black-and-white intensity of the indoor shows, this is U2 at their best. Follow the group across America, exploring new influences, playing with the legendary B.B. King from Dublin to Graceland.",
      "similar": [
         17356,
         20575,
         17000,
         344181,
         63973,
         152851,
         786,
         344130,
         525,
         344198,
         27962,
         20313,
         6477,
         22097,
         1584,
         27,
         69,
         114150,
         254470,
         3902
      ],
      "original_title": "U2: Rattle and Hum",
      "runtime": 98,
      "poster_path": "/bFgdLWRpvS1rKxR5GADEyvgLm56.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1988-11-04",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Phil Joanou"],
      "runtime": 99,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0096328/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY4MDYzNzQ4NF5BMl5BanBnXkFtZTcwMjAxODEzMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Bono, The Edge, Adam Clayton | See full cast and crew »"],
      "reviews": [
         "This movie delivers U2 doing what they do best (touring), experimenting with new types of music in America and showing us that they're truly the nice guys they're projected to be. I see nothing disappointing about charismatic interviews, solid musical performances and meaningful reflection. Those who disliked this departure from the band's \"usual\" style can't recognize the importance of musical growth we see here. Looking back to what The Joshua Tree was and what became Achtung Baby, it's easy to see Rattle and Hum was a necessary expression of their progress at that time, and a humble look at a band celebrating their artistic heroes.",
         "Tens of thousands of feet of film were shot during the making of 'U2: Rattle and hum', Most of it in black and white. Some of this was intentional, but allot of it was due to the fact that director Phil Joanou had a limited budget to work with and black and white film at least at that time was less expensive. Shooting in 16mm as well as 35mm was another reason that this film was shot almost entirely in black and white. About 90% of the footage was done in that format rather than color. From Watching the final cut of the film it would seem to suggest that it was more like 80% of the over all footage, but keep in mind there was allot more black and white footage cut from the film than color. I obtained a great amount of the footage that was never seen in the original version of 'U2: rattle and hum', 480 minutes of it to be exact. When I first saw 'U2: rattle and hum' In 1988, I was fortunate enough to see it at a 'century theater' complex in San Jose Ca. On the biggest screen they had out of the 2 blocks of 'century theaters' lining one side of Winchester blvd. There in San Jose. They even had a special concert PA system temporarily installed for this special feature. It was truly the best way to see this movie, and the experience has stuck with me ever since. For many years I have felt that this movie could very well be the best film about a band ever made. Maybe even possibly the best music related film ever made with the exception of 'Woodstock' or perhaps 'The last waltz'. The movie has at times a real gritty look to it due to the 16mm footage. It feels earthy, grounded, cultural, important. Especially the portion of the film where U2 put on the 'Free the yuppies' concert at the 'embarcadero center' in San Francisco. This was the portion of the film where the band performs 'All along the watch tower'. This concert was monumental (no pun intended) for the history of music in many ways. For one this concert was announced 2 hours prior to the performance over San Francisco's 'Live 105' fm alternative station. The concert was not scheduled prior to the two hour announcement. Bono, the edge, larry mullen jr., adam clayton as well as their management decided to put the show on the day before it actually took place. I was living in San Jose at the time and heard the announcement on the radio that day. I didn't have to work that day so I could have easily made it but a problem came up and to my bitter disappointment I was unable to attend the show. The entire show is truly wonderful (I have the entire performance on video). The monumental thing about this performance was of course the point in which Bono paints the Monument erected many years before in the embarcadero square by a french artistic designer. The now infamous \"rock and roll stops the traffic\" slogan that bono spray painted on the monument is one of the greatest moments in music history. What most don't know is that bono never left the stage during all along the watch tower, the monument was painted during another song. which one was it? Well you'll have to find out for your self, I'm not telling. I went to see the monument the next day late at night. A friend and I climbed the thing to see the painted area. It was already painted over but you could see where it had been painted from the color shades being off a bit. I did make it to the performance at Oakland Stadium the next day. This was of course the 'Joshua tree' tour. Bono managed to find the french artist who created the monument that bono had spray painted just the day before. After a short 'wave hello' the artist proclaimed \"U2 can spray paint anything I create any time they want!\". This was in retaliation to the mayor of San Francisco who banned U2 from returning to San Francisco for the deed. Later the ban was lifted. But now back to the footage cut from the final film released through 'Paramount pictures'. It is anybody's geuss as to why some of the best footage was cut from the film. Most notably 'the voices of freedom' performance at 'madison square garden'-performing 'still haven't found what I'm looking for' with the band. It is truly touching and would have been 'hands down' the best part of the entire movie had it made the final cut. directly after the group of church singers leave the stage U2 kicks into a rare live performance of 'Spanish eyes'. It is really a shame that these performances were left out of the fianl cut. I have 40 minutes of footage of U2 on their van ride to the church where they were to first meet the 'voices of freedom' as well as 40 minutes of footage after they arrive at the church. Also the entire graceland tour was filmed which I also have. I can understand why joanou left most of this out, it can be rather dull to watch, but it was interesting to hear allot of U2's questions and comments as they went along the tour. Hours of other precious moments are also seen in the deleted footage. 'U2: rattle and hum' is a true classic music film, but if phil joanou and U2 wanted to share those precious moments with the rest of the world they might think about releasing the entire thing in a directors cut. I had to pay allot of moola for the footage I have, and I mean allot!, all 480 minutes of it. Having seen it for myself in my opinion it is a crime to hide this footage from the public. U2: 'rattle and hum' is a great movie, a complete directors cut would make it a landmark in the history of the cinema.",
         "At the time of writing, this film is almost 20 years old. When I first watched it I was a half U2 fan, a U1 if you will. Joshua tree was one of my favourite CDs, but despite being a frequent listener of the earlier stuff, I'd remained unhooked. But after seeing Rattle and Hum I was almost literally breathless. It became one of a small handful of VHS music videos that I made the effort to take with me as I moved through life. When I discovered the concept of digital movies, it was the first tape I digitised so I could watch it on my computer, and when video CD came along, I bought that too because the quality was much better than my amateur 'rip'. Naturally when DVD came along I had to have the quality offered by that too. And when I got my first portable video player, well Rattle & h Hum was the first DVD I ripped so I could play it on that (although Pink Floyds pulse had become it's constant companion too). Today, I took delivery of my iPod Touch, and, sad bastard that I am, Rattle and Hum is the first movie I'm watching on it. Why is it I love this film when the music press and the band itself seem to dis this film? I once read an article that suggested the band almost split after the release of the film. Instead they went off and regrouped into their post Achtung baby period. Better they had split and then reformed once whatever itch was out of their system, I think. I still hope they still will. I love this film because it presents the band a their absolute peak. Every inch of concert footage is tight. Bono sounds amazing, much better than I ever saw him. The Edge soars, Larry beats perfect time, while Adam holds everything together. If that isn't enough, the photography is stunning. There is not a single scene in the whole film that would benefit from a different point of view, lighting setup or depth of field (except perhaps the Bono scene 31 minutes in where he tries his hand at graffiti backed by watchtower, personally I'd have made that blurred I think). The visuals are completely stunning and reinforce the bands stature already perfectly presented by just enough short of perfect performance. If I last another 20 years, I'm confident this film will make the Journey with me.",
         "I have been a U2 fan since the days of \"Boy\" and \"October\". I was very excited to see this movie about the band when it first came out but after viewing it I left the theatre feeling strangely flat. And wishing I had seen alot more. The footage was different then what I was expecting and maybe I just had different expectations of what I was seeing. The film, in my eyes, lacked depth. I wanted to hear about the band themselves but U2 the band came across as almost feeling a little awkward-that was my interpretation anyway. I had no problem with the black and white footage, that sort of reinforces the band's haunting brooding qualities anyway, but the movie didn't TELL me anything and thats what I was looking for. The best CONCERT footage of U2 I've ever seen is U2 at The Red Rocks which blew me away and which I guerentee the same response from any fan who may not have seen that. Rattle and Hum wasn't a bad effort, I had no problem sitting through it and staying focused. After all it was about a talented and brillient group of individuals. But the film lacked the soul I was looking for. I wouldn't call this truely great. It didn't give me the feeling I knew anything more of U2 the people and likewise didn't give me any musical enrichment I hadn't already gotton TRIPLE from watching U2 at Red Rocks. I'd give this 6.5 of 10.",
         "The only concert I have ever attended in my life was the U2 concert held at Murrayfield Stadium in Edinburgh on the first of August 1987 . This was part of the band`s Joshua Tree tour and I was slightly disappointed with the concert possibly down to the fact that The Joshua Tree is the band`s most Americanized album and as a die hard fan I much preferred their first three albums U2:RATTLE AND HUM is the movie release made to tie in with the album of the same name that when it was released in the Autumn of 1988 became the fastest selling album in British chart history . It consists of interviews , concert footage (and the occasional track being recorded in the studio , nothing groundbreaking or radical and what you make of this documentary all comes down to what you make of late 1980s recordings from Bono and the boys since most of the concert tracks are from The Joshua Tree . In its favour it`s far better directed and edited than the 1983 release UNDER A BLOOD RED SKY but if like me you prefer early 80s U2 then you`ll be disappointed with what`s missing , stuff like Gloria ( Not the Van Morrison song ) , I Will Follow and Electric Co . Bizarrely the best track from the album HawkMoon 269 is conspicious by its absence . I say bizarrely because Bono is on record as saying at the time it was his all time favourite U2 track and is the stand out track from the album . As it stands the movie`s highlight is the rendition of Sunday Bloody Sunday played on the night of Sunday 8th November 1987 hours after an IRA bomb had murdered 11 people and maimed scores more at a remembrance service in the Northern Irish town of Enniskillen where Bono explodes a few myths of \" The glory of the revolution \" I got the DVD for my Christmas a couple of years ago ( Thanks Michelle ) and I was very disappointed since it basically contains just the movie and a choice of subtitles with no extras",
         "When U2 arrives in the fall 1987 to start the second leg of their American tour to promote \"The Joshua Tree\" (1987), they already filled with enthusiasm millions of Americans with their masterpiece and they were showered with praise by virtually all musical critics but also important newspapers (the magazine Newsweek even put them on the cover!). The amount? Bono and his band were crowned the biggest rock and roll band in the world. A status which isn't easy to assume and when one has a rock and roll masterpiece under one's belt, delivering it a follow-up is a difficult task. Maybe that's why the most famous Irish quartet had the idea to make a film accompanied by an album: to try to forge ahead and to take a new musical direction. So, \"U2: Rattle and Hum\" (1988) is a documentary which goes back over the band's tour in America where they alternate concerts and cultural discoveries (the visit of Graceland). Their album \"the Joshua Tree\" had already expressed their fascination for America, the movie \"Rattle and Hum\" confirms it. The director Phil Joanou (Martin Scorsese turned down this role) also filled his work with interviews and recording sessions which took place after the tour in 1988. Each member's disposition is revealed in these interviews but also throughout the movie and during their tour especially with concerts. So, in Joanou's opus, Bono and his men reaffirm their positions on a social, cultural and above all musical point of view while not forgetting their Irish roots. Concerning music which constitutes the backbone of the movie, the band explores several facets of American music. The Stax-soul tribute \"Angel of Harlem\", the blues \"When Love Comes to Town\" with a prestigious guest: BB King, \"I Still Haven't Found What I'm Looking For\" in a gospel version show a progressive Americanization of the band. But in parallel, not to lose their identity, the four members remain faithful to their musical influences; either it is the sinewy \"Desire\" or the atmospheric \"Heartland\" that sounds like a \"the Joshua Tree\" outtake. Hence an impression of hodgepodge: the tracks cut in studio are rather badly linked up. It is difficult to let oneself rock with beautiful heavenly flights then to follow with unusual tracks for the band without losing the thread. That said, the musical trimmings that somewhat hinders the movie didn't stop Bono and his men to write some of U2's best songs. On another extent, Phil Joanou's technical feats enable the spectator to attend the concerts as if he were on stage with the band. The latter is presented in this state like we would imagine them for the ones who have never seen them in concert: fiery, feverish, passionated by their music and ready to make a declaration aiming at peace in Northern Ireland and why not in the rest of the world (Bono's words in the middle of Sunday Bloody Sunday\"). And I address the fans of the band who may have the album but not seen the movie and the casual listeners: a good part of U2's hits of the eighties and notably from \"the Joshua Tree\" are performed on stage: \"Bad\", \"Where the Streets Have No Name\", \"With or Without You\". I also think that having shot the movie in black and white and in color gives it a arty side. At the end of the day, it's a worthy but suicidal undertaking. Indeed, the limited commercial career of Joanou's opus clearly shows once again that this kind of film is seldom successful in the theaters in spite of the fact that the video was a best-seller in the Anglo-Saxon countries. And for U2, the eighties ended in a little rough way but fortunately, the nineties will begin (and for me end) triumphantly with \"Achtung Baby\" (1991).",
         "I love this film, and have for years. Some were unhappy with the lack of documentary-like footage concerning who the band \"really\" are and such...but since it is described as a \"concert\" film, i got what i expected...footage of and about the formation of key songs and song adaptions. I never saw the film as self-congratulatory, and i think that's just a swipe by bashers of the band.......they (u2) just seemed to be enjoying themselves delving into the new musical forms they were discovering and paying homage to those forms. If you like music, see this dvd.",
         "I knew little about U2 in the 80s. I was still a pre-teen, and I was probably listening to what my parents put on like Michael Jackson, Joe Cocker, John Denver, Janis Joplin, and Willie Nelson. However, little by little, I grew to be a fan of theirs, probably especially after I first heard the song \"Bad\" on the radio as my parents drove me to college for my first year. I bought the DVD of this on a total whim and was greatly rewarded. The opening sequence with \"Helter Skelter\" establishes a somewhat otherworldly yet gritty intensity for the b&w sequences. I agree that the film doesn't do a good job of getting at the personalities of the singers, and besides these guys are so used to the camera that they'd be able to manipulate the coverage anyway. What Phil Joanou does get wonderfully is the passion for the music in these guys and how they inspire others: those moments when they stop and listen to the Harlem blues man singing \"Freedom for My People\" or the Gospel choir that takes flight with \"Haven't Found what I'm Looking For\" are something pure with a hint of magic. This is also well-played in the GORGEOUS transition to color in the Super Bowl-size stadium for \"Streets Have No Name.\" You'd think Jesus himself was about to come on stage. My only qualm: the music and lyrics themselves have enough social meaning of their own. Bono really doesn't need to interject much more on stage. Their performance of Bullet the Blue Sky gets at the social points with greater force, \"Pelting the women and children/Pelting the women and children,\" than Bono's well-intentioned commentary. I give it four stars though because it hits all the right notes. PHIL, WHY HAVEN'T YOU DONE ANYTHING LIKE THIS IN YEARS?",
         "An outstanding documentary/concert film detailing the irish rock band U2 on a tour..of course the band plays their greatest hits and some other known songs, including a duet with blues great BB king.. Great cinematography and the black and white usage makes it all that much better. A must see for any U2 fan.. On a scale of one to ten.. 8",
         "Rattle and Hum is a great movie for both hardcore and casual U2 fans. It's an interesting look at U2's musical exploration in the late '80s, and for younger U2 fans, like me, it's almost a way to experience The Joshua Tree tour. Seeing footage of some of their most popular and biggest songs being performed live is both fascinating and enthralling. U2 is probably the best live band still around today, and seeing them where they are most at home, on stage, is an experience in itself. Emotion is a big factor when it comes to their music, and you can feel it throughout the film. The black and white footage adds a nice touch of rawness, of sincerity. And although Rattle and Hum is essentially a concert film, it's also a glimpse at U2's growing maturity as a band. Rattle and Hum is a fun, fascinating, intense U2 experience. It's quite funny at times--like the first, hilariously awkward interview at the beginning of the movie--but it's also very serious. I think that the most powerful performance in the movie is Sunday Bloody Sunday. Bono's angry, outraged speech both before and during the song are stunning. I was left both in shock and awe at the sincerity and absolute frustration the band displays while they perform it....it's sure to give you goosebumps. My only complaint--and a minor one at that--was the shortage of interviews, but I can understand why they might have left it out to make room for more songs. So even if you're only a casual fan of U2, you should see Rattle and Hum. It's powerful, entertaining, and interesting. It's a look back at a much younger U2 (you might even laugh at both Bono and The Edge's hair, and at Adam Clayton's birdlime strut on stage) and a good one at that. To quote Larry Mullen Jr., \"It's a musical journey.\""
      ],
      "genres": [
         "Documentary",
         "Music"
      ],
      "productionCompanies": [
         "Paramount Pictures",
         "Midnight Films"
      ],
      "summaries": [
         "This film documents the 1987 North American tour of the great rock band, U2. Fresh with their success of their best selling album, The Joshua Tree, the band plays monster gigs. Along the way, the band takes the opportunity in indulge in some special musical activities like playing with BB King and performing \"I Still Haven't Found What I'm Looking\" with a famous church choir. All the while, concert footage of the band's biggest hits on tour is featured while Bono speaks his mind on the problems of his homeland.",
         "A documentary of Irish rock group U2's Fall 1987 tour of North America."
      ],
      "budget": 0
   },
   "movielensId": 3142,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1988-11-04",
      "dvdReleaseDate": "1999-11-23",
      "directors": ["Phil Joanou"],
      "runtime": 98,
      "movieId": 3142,
      "title": "U2: Rattle and Hum",
      "mpaa": "",
      "actors": [
         "Bono",
         "The Edge",
         " Larry Mullen Jr.",
         "Adam Clayton"
      ],
      "imdbMovieId": "0096328",
      "originalTitle": "U2: Rattle and Hum",
      "genres": [
         "Documentary",
         "Music"
      ],
      "youtubeTrailerIds": ["MSrDZO3Ho5I"],
      "plotSummary": "A concert movie on an unprecedented scale, Rattle And Hum captures U2 - on and off the stage - during their triumphant Joshua Tree tour. From the giant technicolour stadium celebrations to the black-and-white intensity of the indoor shows, this is U2 at their best. Follow the group across America, exploring new influences, playing with the legendary B.B. King from Dublin to Graceland.",
      "tmdbMovieId": 18161,
      "avgRating": 3.41363,
      "releaseYear": "1988",
      "numRatings": 1181,
      "posterPath": "/bFgdLWRpvS1rKxR5GADEyvgLm56.jpg"
   }
}