{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "japanese",
            "id": 907
         },
         {
            "name": "world war ii",
            "id": 1956
         },
         {
            "name": "pilot",
            "id": 3203
         },
         {
            "name": "u.s. air force",
            "id": 3366
         },
         {
            "name": "naval officer",
            "id": 6610
         },
         {
            "name": "friends who hate each other",
            "id": 10033
         },
         {
            "name": "marooned",
            "id": 10792
         },
         {
            "name": "pacific island",
            "id": 11823
         },
         {
            "name": "airplane crash",
            "id": 12617
         }
      ],
      "imdb_id": "tt0063056",
      "video": false,
      "title": "Hell in the Pacific",
      "recommendations": [
         18262,
         29715,
         22383,
         42995,
         44043,
         79827,
         42186,
         43407,
         42728,
         26516,
         18649,
         31804,
         22733,
         21454,
         18727,
         43248,
         73455,
         46691,
         139324,
         119555
      ],
      "backdrop_path": "/pHhdQxe2HpX5a5Fs7H9aAcNOTOr.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "American Pilot",
               "gender": 2,
               "credit_id": "52fe44979251416c910161bb",
               "name": "Lee Marvin",
               "profile_path": "/xsXdqvZpxlo7iEm2ODMnXbfNgZM.jpg",
               "id": 18391,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Captain Tsuruhiko Kuroda",
               "gender": 2,
               "credit_id": "52fe44979251416c910161bf",
               "name": "Toshirō Mifune",
               "profile_path": "/32nCFJneAfmZxYTQsaF5bcmCB7e.jpg",
               "id": 7450,
               "order": 1
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44979251416c910161a5",
               "name": "John Boorman",
               "profile_path": "/zPZkbiZms6DUZz74xLLFFGUJY0n.jpg",
               "id": 19665,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44979251416c910161ab",
               "name": "Alexander Jacobs",
               "profile_path": null,
               "id": 66918,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44979251416c910161b1",
               "name": "Eric Bercovici",
               "profile_path": null,
               "id": 80610,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44979251416c910161b7",
               "name": "Reuben Bercovitch",
               "profile_path": null,
               "id": 136508,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe44979251416c910161c5",
               "name": "Reuben Bercovitch",
               "profile_path": null,
               "id": 136508,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44979251416c910161cb",
               "name": "Henry G. Saperstein",
               "profile_path": null,
               "id": 30771,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44979251416c910161d1",
               "name": "Selig J. Seligman",
               "profile_path": null,
               "id": 136509,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44979251416c910161d7",
               "name": "Lalo Schifrin",
               "profile_path": "/zYz8R5xJGdO4Rq2FrcagMoG1UxD.jpg",
               "id": 9217,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44979251416c910161dd",
               "name": "Conrad L. Hall",
               "profile_path": "/fGWnmu9EAYqX974sP0ddkOjgVEy.jpg",
               "id": 8217,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "550ddd90c3a3681db2006227",
               "name": "Thomas Stanford",
               "profile_path": null,
               "id": 37880,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "War",
            "id": 10752
         }
      ],
      "popularity": 2.59672,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 31681,
      "vote_count": 47,
      "budget": 0,
      "overview": "During World War II, a shot-down American pilot and a marooned Japanese navy captain find themselves stranded on the same small uninhabited island in the Pacific Ocean. Following war logic, each time the crafty Japanese devises something useful, he guards it to deny its use to the Yank, who then steals it, its proceeds or the idea and/or ruins it. Yet each gets his chance to kill and/or capture the other, but neither pushes this to the end. After a while of this pointless pestering, they end up joining forces to build and man a raft...",
      "similar": [
         676,
         228150,
         369885,
         8741,
         1771,
         853,
         1904,
         5925,
         423,
         424,
         857,
         2253,
         87502,
         203833,
         16869,
         14574,
         613,
         637,
         374720,
         227306
      ],
      "original_title": "Hell in the Pacific",
      "runtime": 103,
      "poster_path": "/vtXTjpIZT32ciDaWbuk6XGT8C4c.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "日本語",
            "iso_639_1": "ja"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Selmur Productions",
         "id": 6090,
         "origin_country": ""
      }],
      "release_date": "1968-12-19",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "Out of violence, compassion. Out of suspicion, trust. Out of hell, hope.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Boorman"],
      "runtime": 103,
      "synopsis": null,
      "writers": [
         "Alexander Jacobs",
         "Eric Bercovici"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0063056/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE4NzQ2NzE5OF5BMl5BanBnXkFtZTcwMzUzMTUyMQ@@._V1_SY317_CR10,0,214,317_AL_.jpg",
      "actors": ["Stars: Lee Marvin, Toshirô Mifune | See full cast and crew »"],
      "reviews": [
         "Was there a better hard man in the 70's then Lee Marvin ? I don't think so. Team him up with Toshiro Mifune (yojimbio, Seven Samurai), gorgeous scenery (Paulau islands) under the light hand of John Borman (Deliverance) and watch as a simple story grows and develops into a visual feast. There is no lead-in to the film, all we see is a lone Japanese soldier on a tropical island spotting a life raft and realising he is suddenly not alone, and worse, his company is an enemy soldier. The initial confrontations are tension filled as the two chase each other around and around their new home in a battle of wits and cunning. Eventually the inevitable happens and they are forced to start living together. Rather than a Disneyish style 'lets all learn to live together because we are all really the same under the skin' co-operation, the two have as little to do with each other as possible, unless arguing about possession of driftwood (in a scene that left me in tears of laughter). Eventually they do co-operate through necessity to leave the island and develop a bond of friendship through adversity, only to have this challenged when exposed to the realities of the world outside their desert island refuge. A bitter but unavoidable ending reminds us of the insanities of war. I loved this film because it was totally gripping in a way few movies are, I genuinely cared about the characters. It was in some ways like watching 'survivor' in the way the relationship changed-only in reverse- so naturally did it happen on screen. Bormans direction was great, more of a fly on the wall perspective that made the story all the more involving. This movie deserves to be seen.",
         "I only discovered Hell in the Pacific after searching for Lee Marvin films as I have become enamored with his work as of late. I thought this was going to be a war movie from start to finish, which I'm not always a big fan of. I am glad to say I was surprised and very pleased with this film. This is a rare work of film that uses two actors, limited dialog(half of it in Japanese), and only one location. There have been many attempts at making movies about people stranded on islands, but this one pulls it off in a way no other has. Thsi is a film about not only survival, but overcoming prejudice towards ones sworn enemy in a time of war. It is about moving past the fears of what you do not know, and using what you do know and the basic need to survive to pull through and band together. I was more enthralled by this movie with almost no dialog, than I have been with movies that have won screenplay Oscars. To me, this is an example that if you have the right actors, the right story, and the right setting, dialog is not always necessary.",
         "A Japanese naval officer and an American pilot find themselves stranded alone on a desert island during WWII. How would you react to being marooned with a dangerous enemy? This film is an obscure treasure that should be better known. I suspect that people are put off by the cheesy and unsuitable title. The film explores the evolving relationship of two men from different cultures as they each struggle to find the best way to survive. Their collective fate is an exploration of the human condition. One outstanding feature of this film is that it is in both Japanese and English, intentionally without sub-titles. An American or Japanese audience could watch this film and appreciate its message. This duality serves to heighten the cultural differences between the two men, and it is cultural bias that is the true enemy. Buy it, it's a keeper!",
         "\"Hell in the Pacific\" is a magnificent movie, with only two actors - but two of my biggest favorites. I watched it without subtitles and I couldn't understand Mifune and I often didn't here what Marvin said either. The best way to appreciate it is to not know English or Japanese, because you will understand it anyway. A film almost without dialog, a very interesting experience. Surely one of director John Boorman's most memorable movies, with flawless direction. The end is a \"surprise\" which fits in well. A must see! Rating: 10 of 10.",
         "No. Not really. The differences are numerous: first off, the plot structure is much tighter and centers on the animal side of man, and HITP doesn't have CA's boring first and last acts to bog it down. Pitting Marvin against Kurosawa favorite Mifune was a great idea, but could have failed with a more conventional approach. Here we are introduced to both in a neutral way, free to prefer which ever one we choose to. Both actors do a fine job, playing mostly emotional and physical roles with great restrain and intelligence. Boorman's direction is perfect, rejecting excess stylization in favor of a subtle approach and relying on superb photography. You have got to see this at least once, simply because it is very philosophical without ever trying to be. Because it boasts top performances from two of the last century's greatest leading presences in action cinema. Because, though frustrating at first, the ending is, for once, the smartest one that could have been chosen. Humanity is on trial and the judges choose to be honest and pragmatic, thus delivering something that combines greatness and very thoughtful substance.",
         "In World War II, a shot-down American pilot (Lee Marvin) and the marooned Japanese Captain Tsuruhiko Kuroda (Toshiro Mifune) are stranded in a small island in the Pacific. When they find the presence of each other, the American tries to steal the water provision of the Japanese that protects it, initiating their personal war. After a period fighting each other, they decide to join forces and build a bamboo raft to seek a larger island. \"Hell in the Pacific\" is a good movie about how struggle to survive supersedes any other feelings even in times of war. The Japanese and the American soldiers find how pointless is their fight and resolve their situation joining forces and learning to accept and respect their culture differences despite the language barrier and warfare. Surprisingly they also become friends but the abrupt conclusion is too stupid and meaningless, apparently imposed by the studio. The alternate ending is also terrible but better then the original one. In 1985, Wolfgang Petersen used the same idea in a futuristic environment in \"Enemy Mine\". My vote is seven. Title (Brazil): \"Inferno no Pacífico\" (\"Hell in the Pacific\")",
         "What I would give to know only Japanese and watch this movie. You don't have to understand what Toshiro Mifune is saying to understand this movie. Does war extend to the individual? Trained to kill or be killed, two adversaries face off. Each with his own fear that the other will succeed. Why didn't they kill each other when they had the chance? Because man is a social animal and he needs the company of others. To use a cliché - No man is an island. And in the end conflict erupts. Not because of any innate difference between the two men - but because of how they define themselves in a greater scene. I am Japanese - you are American (and vice versa). Throw in the element of non-communication (neither spoke any of the other's language) and you have it. Two great actors, a great script, a grand theme.",
         "Not much more can be said about this outstanding film that hasn't already been said. It really is one of the finest meditations on war and the nature of men ever made. Boorman's direction is amazing, Conrad Hall's cinematography is luminous, and Mifune and Marvin are forces to be reckoned with. I did notice however that some of the reviewers had some issues with the ending. I thought I might just pop in here to let those of you who don't know, the DVD of \"Hell in the Pacific\" features an alternate ending that may be a bit more easily digestable, yet is no less powerful than the original ending. In fact in some ways it may be better. Watch the movie with both versions of the ending for an interesting example of what a difference the conclusion of a film can make. Viva Lee Marvin.",
         "Not only is this film a fascinating account of survival against odds, its a reflection of cultural differences within a crucial historical timeframe. Its narrative may be flawed, a little too stylized, but it features two of the greatest faces of 60s cinema history: Marvin and Mifune. Looking back on the second world war, it seems ironic that the Japanese believed their culture was superior in warfare, and the Americans believed theirs was superior for peace. In the end it will turn out to be the other way around. This film touches on that subject, highlighting Marvins aggressive, loud, and brutal behavior, and Mifunes quieter, more methodical survival methods. But in their battle to survive, the two men become almost indistinguishable. The most touching scene in the film: Both men collapsed in their sinking raft, dejected, exhausted, dehydrated, totally at their mercy of nature, a symbolic scene for human life. The DVD i saw contained both endings, the original, never seen in TV prints, much more believable and satisfying.",
         "This is a truly cinematic experience: character and plot develop through visual storytelling. The two characters can't even speak the same language, but compelling performances speak volumes to the audience. The often breathtaking scenery provides a dramatic contrast to the ugliness of Man's cruelty. Marvin and Mifune show Man is bound to 'return to where he started;' sin spoils moments of grace despite our noblest intentions. The devastating ending perfectly completed the metaphor of the film. The primal setting (in Panavision) and \"Twilight Zone\" ending reminded me of \"Planet of the Apes.\" Fans of the Boorman-Marvin director-actor collaboration must see \"Point Blank.\" Those who don't like island-survival films with controversial endings should avoid \"Limbo.\""
      ],
      "genres": [
         "Drama",
         "War"
      ],
      "productionCompanies": [
         "Selmur Productions",
         "Henry G. Saperstein Enterprises Inc."
      ],
      "summaries": [
         "During World War II, a shot-down American pilot and a marooned Japanese navy captain find themselves stranded on the same small uninhabited island in the Pacific Ocean. Following war logic, each time the crafty Japanese devises something useful, he guards it to deny its use to the Yank, who then steals it, its proceeds or the idea and/or ruins it. Yet each gets his chance to kill and/or capture the other, but neither pushes this to the end. After a while of this pointless pestering, they end up joining forces to build and man a raft...",
         "A shot-down American pilot finds his way to a small, unpopulated island where he hopes to find provisions. He soon discovers that he is not alone; there is a Japanese officer marooned on the island also. Will they continue to fight each other to the death, or will they reach a modus vivendi?",
         "During World War II, an American pilot and a marooned Japanese navy captain are deserted on a small uninhabited island in the Pacific Ocean. There, they must cease their hostility and cooperate if they want to survive, but will they?"
      ],
      "budget": 0
   },
   "movielensId": 3143,
   "movielens": {
      "languages": [
         "English",
         "日本語"
      ],
      "releaseDate": "1968-12-19",
      "dvdReleaseDate": "1999-11-16",
      "directors": ["John Boorman"],
      "runtime": 103,
      "movieId": 3143,
      "title": "Hell in the Pacific",
      "mpaa": "G",
      "actors": [
         "Lee Marvin",
         "Toshirō Mifune"
      ],
      "imdbMovieId": "0063056",
      "originalTitle": "Hell in the Pacific",
      "genres": [
         "Drama",
         "War"
      ],
      "youtubeTrailerIds": ["-hf4PTnCkho"],
      "plotSummary": "During World War II, a shot-down American pilot and a marooned Japanese navy captain find themselves stranded on the same small uninhabited island in the Pacific Ocean. Following war logic, each time the crafty Japanese devises something useful, he guards it to deny its use to the Yank, who then steals it, its proceeds or the idea and/or ruins it. Yet each gets his chance to kill and/or capture the other, but neither pushes this to the end. After a while of this pointless pestering, they end up joining forces to build and man a raft...",
      "tmdbMovieId": 31681,
      "avgRating": 3.47442,
      "releaseYear": "1968",
      "numRatings": 215,
      "posterPath": "/vtXTjpIZT32ciDaWbuk6XGT8C4c.jpg"
   }
}