{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "fish",
            "id": 1357
         },
         {
            "name": "aquarium",
            "id": 2269
         },
         {
            "name": "carnival",
            "id": 3473
         },
         {
            "name": "house",
            "id": 6095
         },
         {
            "name": "callboy",
            "id": 6739
         },
         {
            "name": "vacation",
            "id": 6876
         },
         {
            "name": "illegal prostitution",
            "id": 33625
         }
      ],
      "imdb_id": "tt0205000",
      "video": false,
      "title": "Deuce Bigalow: Male Gigolo",
      "recommendations": [
         11453,
         11090,
         11852,
         9678,
         11017,
         10663,
         2022,
         9429,
         9957,
         10985,
         9622,
         10723,
         13595,
         11001,
         10956,
         11469,
         9894,
         8859,
         9032,
         9285
      ],
      "backdrop_path": "/2BE6SGCQsXu4Z3kNK4MbQe9lfsR.jpg",
      "revenue": 65535067,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Deuce Bigalow",
               "gender": 2,
               "credit_id": "52fe43679251416c7500f08b",
               "name": "Rob Schneider",
               "profile_path": "/vDbjHkAc4OMKObi9W5xW9OuDhDI.jpg",
               "id": 60949,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Det. Chuck Fowler",
               "gender": 2,
               "credit_id": "52fe43679251416c7500f08f",
               "name": "William Forsythe",
               "profile_path": "/3oaz2y7hIm3r3OyDKvQ1i2D8cLR.jpg",
               "id": 4520,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Tiberius Jefferson \"T.J.\" Hicks",
               "gender": 2,
               "credit_id": "52fe43679251416c7500f093",
               "name": "Eddie Griffin",
               "profile_path": "/jgz5HDtC3aXYXBSULqay1PKWQOL.jpg",
               "id": 62842,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Kate",
               "gender": 1,
               "credit_id": "52fe43679251416c7500f097",
               "name": "Arija Bareikis",
               "profile_path": "/qxJ6M4eCAhUlXkAaXCK8iGLl14g.jpg",
               "id": 33432,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Antoine Laconte",
               "gender": 2,
               "credit_id": "52fe43679251416c7500f0bf",
               "name": "Oded Fehr",
               "profile_path": "/kiNGbfGzjbCKIAsdy0UcuzgGHRc.jpg",
               "id": 18041,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Claire",
               "gender": 1,
               "credit_id": "5585b8c092514137b7000cb5",
               "name": "Gail O'Grady",
               "profile_path": "/e2moRkIxkuZXZDHFbbocKvA5SUR.jpg",
               "id": 26009,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Bob Bigalow",
               "gender": 2,
               "credit_id": "5585b8ca9251417f6f0006cf",
               "name": "Richard Riehle",
               "profile_path": "/fFFjfOX7BUsfBQQP54K8QEkkEC2.jpg",
               "id": 18262,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Elaine Fowler",
               "gender": 1,
               "credit_id": "5585b8d59251417f6f0006d3",
               "name": "Jacqueline Obradors",
               "profile_path": "/gOtzchBSdiGenM8LnNfHN4QX7Lq.jpg",
               "id": 49818,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Fluisa",
               "gender": 2,
               "credit_id": "5585b8e0c3a3682743000bc6",
               "name": "Big Boy",
               "profile_path": "/sFuWG1VHlaJRz0iBrJbyL5RxYLr.jpg",
               "id": 90149,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Ruth",
               "gender": 1,
               "credit_id": "5585b8ea92514137bc000c5e",
               "name": "Amy Poehler",
               "profile_path": "/uMGW762oDZbR8jhFJRImJ1ls5cd.jpg",
               "id": 56322,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Bergita",
               "gender": 1,
               "credit_id": "5585b8f8c3a3682743000bcd",
               "name": "Dina Platias",
               "profile_path": "/3jOYDAjZeRoER6EMvpHtROJT6op.jpg",
               "id": 954122,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Tina",
               "gender": 2,
               "credit_id": "5585b90092514137bc000c66",
               "name": "Torsten Voges",
               "profile_path": "/qsqyjQCNuoQdRDF57Q9hzngIRci.jpg",
               "id": 1238,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "Carol",
               "gender": 1,
               "credit_id": "5585b90892514137b7000cbd",
               "name": "Deborah Lemen",
               "profile_path": "/lCkvyAXN0P9oCQ4sAMvXBhfmcqN.jpg",
               "id": 952333,
               "order": 12
            },
            {
               "cast_id": 21,
               "character": "Allison",
               "gender": 1,
               "credit_id": "5585b910c3a3680e6c000537",
               "name": "Bree Turner",
               "profile_path": "/c9EHEvBmsRTBrWzlalssYSgTdFP.jpg",
               "id": 62065,
               "order": 13
            },
            {
               "cast_id": 22,
               "character": "Sally",
               "gender": 1,
               "credit_id": "561e0ff292514142bf0018bd",
               "name": "Jackie Sandler",
               "profile_path": "/q8cRcRf03twtqq9uHtmDiJLZhbX.jpg",
               "id": 60959,
               "order": 14
            },
            {
               "cast_id": 23,
               "character": "Neil",
               "gender": 2,
               "credit_id": "57c8bc57c3a3685c02000ece",
               "name": "Andrew Shaifer",
               "profile_path": "/cCoDGPaL4yOVagU4PrR1iQBYBBF.jpg",
               "id": 87332,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43679251416c7500f09d",
               "name": "Mike Mitchell",
               "profile_path": "/thoCDW89KWWaSYrbvUX0adPcg8S.jpg",
               "id": 64151,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43679251416c7500f0a3",
               "name": "Adam Sandler",
               "profile_path": "/tv9V6QsuZ3bcp4ciUJjwjcc4qAg.jpg",
               "id": 19292,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43679251416c7500f0a9",
               "name": "Rob Schneider",
               "profile_path": "/vDbjHkAc4OMKObi9W5xW9OuDhDI.jpg",
               "id": 60949,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43679251416c7500f0af",
               "name": "Teddy Castellucci",
               "profile_path": null,
               "id": 20822,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe43679251416c7500f0b5",
               "name": "Peter Lyons Collister",
               "profile_path": null,
               "id": 20823,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43679251416c7500f0bb",
               "name": "George Bowers",
               "profile_path": null,
               "id": 11454,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "552582d69251417be200afe2",
               "name": "Mike Cachuela",
               "profile_path": "/cpFzLDMttRswVY3XLefXDYwKN9L.jpg",
               "id": 1450347,
               "department": "Writing",
               "job": "Storyboard"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 8.154624,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10402,
      "vote_count": 399,
      "budget": 17000000,
      "overview": "Deuce Bigalow is a less than attractive, down on his luck aquarium cleaner. One day he wrecks the house of a gigolo and needs quick money to repair it. The only way he can make it is to become a gigolo himself, taking on an unusual mix of female clients. He encounters a couple of problems, though. He falls in love with one of his unusual clients, and a sleazy police officer is hot on his trail.",
      "similar": [
         12609,
         324807,
         24808,
         224414,
         44328,
         41035,
         281343,
         501859,
         27499,
         37589,
         247983,
         289624,
         282468,
         124525,
         38631,
         38593,
         37231,
         501873,
         315127,
         49067
      ],
      "original_title": "Deuce Bigalow: Male Gigolo",
      "runtime": 88,
      "poster_path": "/1AGR1KdIk1llaW983XsW5YsoPsI.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Happy Madison Productions",
            "id": 2608,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Quinta Communications",
            "id": 6370,
            "origin_country": ""
         },
         {
            "logo_path": "/ou5BUbtulr6tIt699q6xJiEQTR9.png",
            "name": "Touchstone Pictures",
            "id": 9195,
            "origin_country": ""
         }
      ],
      "release_date": "1999-12-10",
      "vote_average": 5.4,
      "belongs_to_collection": {
         "backdrop_path": "/5jvRtBbRahwy1dDDNgh4kN1Yz24.jpg",
         "name": "Deuce Bigalow Collection",
         "id": 95664,
         "poster_path": "/szTJbYJnm3OPwYxQKLuTtgsUsQ1.jpg"
      },
      "tagline": "He charges $10 but he’s willing to negotiate.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Mike Mitchell"],
      "runtime": 88,
      "synopsis": null,
      "writers": [
         "Harris Goldberg",
         "Rob Schneider"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0205000/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNjg4OTE5ODAzM15BMl5BanBnXkFtZTcwODY4NTMzMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Rob Schneider, William Forsythe, Eddie Griffin | See full cast and crew »"],
      "reviews": [
         "Let's see...you're watching a movie starring and co-written by Rob Schneider. You're obviously not expecting something with depth and plausibility. But he is a talented comedian, and anyone who is an avid SNL fan has seen Rob perform some very funny skits. He's not Milton Berle, but he has that mindlessly funny comic energy that frequently works. \"Deuce Bigalow\" is a film almost aimed at ticking off critics. Not all audiences will find the crude gags funny, but others--preferably those who can let go of their inhibitions for an hour and a half--will have tons of laughs. The subplot involving Deuce's father as a bathroom attendant is pretty cheap. It's an obvious setup for scatological gags. One of them involving a scene in which Deuce is having a pleasant man-to-man talk with his Dad while you can hear the groans of someone in one of the stalls loudly...relieving himself made me roll with laughter. I wouldn't call it a priceless gag, but you don't always have to aim high with comedy. If it's funny, it's funny. If you laughed, you laughed. Just like any Farrelly Brothers movie, there are gags involving physical handicaps like obesity, narcolepsy and Turrett's Syndrome. However, the jokes are executed in such a broad manner that no one--even ones with any of those disorders--shouldn't be offended. Naturally, some will hate this movie, some will like this movie, some will love this movie. In my mind, if it's a comedy and I'm laughing--what other factors should I be looking for? My score: 7 (out of 10)",
         "I hate to admit this but I liked this movie, at least the first time I saw it. Yes, it's crass, crude, stupid and whatever but it's generally likable and a funny movie in many spots. Rob Schneider does a fine job playing this amiable loser. Several scenes are just laugh-out-loud funny. The female interest, Arija Bareikis, is not someone I was familiar with but I liked her wholesome looks. William Forsythe plays the villain and, of course, he's over-the-top. The film had a nice soundtrack, a lot of familiar rock tunes. As with most modern comedies, this gets carried and a little stupid at the end but, overall the film is good low-grade fun (and I mean \"low grade!\")",
         "\u0085 which is as much a commentary on the state of American cinema as it is on the quality of this surprising film. Thoroughly enjoyable as long as you're not looking for One Flew Over the Cuckoo's Nest. Deuce Bigalow provides a deft blend of juvenille humor and inventive verbal humor and situational gags. I have to say that it has one of the funniest \"reconcilation\" scenes in a romantic comedy that I have seen in a long time. But the great thing about this movie is that Rob Schneider has created a couple of really memorable and unique characters. On top of that, there are many wonderful and touching moments hidden beneath the more obvious jokes and the many throwaway gags.",
         "While watching `Deuce Bigalow: Male Gigolo,' you may well find yourself laughing out loud from time to time \u0096 and hating yourself for it afterwards. For this lame brained comedy, beyond being incredibly juvenile and silly in its comedic temperament, also manages to be as politically incorrect as possible, using as its targets the obese, the handicapped and an assortment of social outcasts and misfits. And, although the ribbing is generally quite good-natured and even affectionate at times, one can't help but feel a little guilty about laughing. The formula for the film adheres very closely to the one employed by virtually all \"Saturday Night Live\" or \"Second City\" alumni in their initial forays into big screen comedies. Once again we have the usual bumbling nerd trying to win acceptance as a `cool dude,' making a shambles of everything he touches, yet ultimately managing to garner the respect of his peers and the love of a beautiful woman. Rob Schneider plays the title role, a professional fish tank cleaner who, through a complicated series of circumstances, finds himself delving into the realm of `man whore' in order to earn some much needed money. The stupidity of the premise and the situations cannot be underestimated as Schneider is put through a series of pratfalls, misunderstandings and verbal slugfests that are often quite amusing almost in spite of themselves. It takes either a certain amount of daring or a shocking degree of insensitivity (or perhaps a little of both) to line up a series of jokes and sight gags aimed at people who suffer from obesity, Tourettes Syndrome, Narcolepsy, blindness and limb amputation - but this film does it. Somehow, though, the film manages to treat its characters with such a genial fondness that it never seems particularly harsh or mean spirited. Whether or not that mitigates the feeling of guilt resulting from one's laughter must, finally, be a matter of personal conscience I suppose. Schneider plays the lead in a nicely relaxed fashion, not succumbing to the hyperbolic mugging that so many comics are prone to indulge in when faced with similar roles. And what a pleasant surprise to encounter Marlo Thomas of all people in an uncredited cameo appearance \u0096 and still looking like a knockout in her sexy lingerie. `Deuce Bigalow' may not sit well with the easily offended or with those who prefer their comedy to be of a bit more - um, shall we say - cerebral nature. Still, unabashed silliness makes for a fun time every now and then and, in that spirit, this film deserves to be seen.",
         "Rob Schneider is not known for his acting but he proved that he can perform with the rest of them in \"Deuce Bigalow: Male Gigolo.\" This might be his best film to date because he is what makes this film come alive along with the rest of his castmates. I liked this movie so much that it hurt me every time I laughed. This was a film that should be used as a model for true laughter and comedy because the jokes were clean and funny at the same time. Schneider co-wrote this film that introduced a plot that was so funny, which had a sweet underlying plot that I found to be very enjoyable to watch. My favorite scene in this whole movie involved the blind date with the woman who could not control her mouth. You will have to watch the movie to understand what I'm talking about. The whole cast was incredible as they all turned in superb performances. It also seemed they were having fun with one another on the set and it showed in their performances, which is one thing I look for in a good film. \"Deuce Bigalow: Male Gigolo\" cracked me up and should be watched by everyone.",
         "Rob Schneider(Deuce Bigalow),\"The Hot Chick\",'02, had me laughing through out the entire film. Bigalow starts out as a very simple guy who cleans fish tanks and other details, like plunging a toilet bowl. He meets up with a guy who lets him use his home while he goes on a trip and things start to happen. As the picture progresses, Bigalow finds himself having to service all kinds of women with very crazy personalities and wild desires. One gal has such bad language he takes her to a baseball game where she can use all kinds of filthy words and be applauded by the crowd. However, Deuce Bigalow does meet up with a gal Arija Bareikis and falls madly in love with her, however, he pulls her leg too much and gets her very hot and bothered. Deuce eventually goes to trial and you will have the view the film to find out how it ends. Great Comedy and a fantastic performance by Rob Schneider.",
         "I had waited a long time to watch this film after seeing the hilarious trailers that were shown on tv when this first came out on the cinema. I'm glad to say i wasn't disappointed as this film is very funny indeed. Rob Schneider stars as Deuce Bigalow a fish tank cleaner who stumbles into the male prostitution through cleaning a gigalo's fish tank. While looking after his apartment he accidently smashes the very expensive tank. the only way to pay for a new one is to do his own stint of of being a male madame!the problem is it is at the very bottom end of the market. He rents his body to the strangest of female clients ,who really are the stars of the film,with the funniest of consequences. Some of the film is a bit silly and not funny, the blind woman bit of the movie is just not funny and really plays no part in the film also i think the woman with tarets syndrome could have been played by someone with a bit more personality but apart from that a very,very funny film. 8 out of 10.",
         "Duece Bigalow cleans fish tanks for a living and by a contrived set of circumstances finds himself looking after the home of male gigolo Antoine Laconte who is very house proud and a bit of a psycho . What's the odds of Laconte coming home to find his house a bit of a mess ? There you go a very simple predictable premise featuring someone who's got a rude sounding name . I lost count of how many times people mispronounced the name \" Laconte \" but I will be honest in saying I did like some aspects to this film no matter how predictable and unlikely they were : \" Hey Deuce it's Antoine . If I come back to find out there's any mess I will kill you \" . I also liked the not so unsubtle references to THE MATRIX and American GIGOLO Of course I can understand why some people don't like it . It's a very unsophisticated movie that feels like it's trying to be a Farrelly brothers comedy but failing and even I became very fed up with the cop showing Deuce his thingy in every scene they appeared in together along with the running gag about sea snails , but come on it's a low brow comedy and I knew before I sat down to watch it that it wasn't an Oscar contender . Try FREDDY GOT FINGERED or GET OVER IT if you want to see a really bad comedy Six out of Ten",
         "This has to be the greatest movie of Rob Schneider's career. Everything else that he has done has been crap crap crap. I like this movie. It finally is a different type of movie. Gigolo Comedy is what I call it. When they made Deuce Bigalow European Gigolo it sucked, but this one it much better. I caught this on regular television towards the end of the middle, then I decided to rent it and give it a try. It was funny. The part when he is dancing on the pole is priceless. Rob Schneider is funny but this has to be his best work. He didn't even do that You Can Do It thing.",
         "Deuce Bigalow: Male Gigolo is far from an original or subtle comedy, but I don't think that is what the director had in mind when doing this movie. All in all it is quite a good movie, even though it is a real no-brainer. Deuce Bigalow used to work as a tank cleaner in SeaWorld, but got fired because he was cleaning the tanks in the nude in front of a lot of people. Since than he cleans domestic fish tanks for a living. This job brings him into contact with Antoine Laconte, who works as a male escort and owns a gigantic apartment, filled with all kinds of precious items. One of these is a tank full of very expensive fish. When one of the fish gets sick Deuce is asked to help and, since Antoine is going to Europe for 3 weeks, he has to check in on the apartment daily to look at the fish. But instead of checking in on Antoine's home, Deuce takes the opportunity to move into the flat. He accidentally sets fire to the toaster and breaks the fish tank. Knowing that Antoine will kill him for that when he sees it, Deuce has to make sure everything is exactly the way it was. But that will cost a lot of money... which he doesn't have. To raise enough money in that short period of time he decides to start working as a low-budget male gigolo. As you can expect in this kind of movie, he doesn't meet any normal women who want to make use of his services. It is a real freak show, filled with a 500 pound woman, a woman who's about 8 feet tall... The movie is full of this kind of predictable facts, but when you are prepared for it, it really doesn't bother. Don't expect to see a highly sofisticated movie, but it isn't as bad as you might expect. One of the scenes that I really liked were the parodies on other movies like The Matrix. I would recommend this movie to everybody who doesn't mind laughing about older and predictable jokes. It's an excellent movie when you came home from a hard day at work, when you are tired and looking for a good laugh without having to think too much. I reward it with a 7/10."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Happy Madison Productions",
         "Out of the Blue... Entertainment",
         "Touchstone Pictures"
      ],
      "summaries": [
         "Deuce Bigalow is a less than attractive, down on his luck aquarium cleaner. One day he runs into a male gigolo who asks him to look after his precious fish while he is away on business. However, he wrecks the house and needs quick money to repair it. The only way he can make it is to become a gigolo himself, taking on an unusual mix of female clients. He encounters a couple of problems, though. He falls in love with one of his unusual clients, and a sleazy police officer his hot on his trail.",
         "Deuce Bigalow is a fish tank cleaner until he gets a temporary job watching over a gigolo's house. But when Deuce accidentally wrecks the house, he is forced to compensate by becoming a gigolo himself! He takes on interesting clients (a tall Norwegian woman, a rotund eater in drag, a roommate who curses every five seconds, a nurse)...and together with a detective chasing Deuce down...",
         "A man becomes a male gigolo after being mistaken for one while housesitting a male gigolo's house."
      ],
      "budget": 17000000
   },
   "movielensId": 3146,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-12-10",
      "dvdReleaseDate": "2000-06-20",
      "directors": ["Mike Mitchell"],
      "runtime": 88,
      "movieId": 3146,
      "title": "Deuce Bigalow: Male Gigolo",
      "mpaa": "R",
      "actors": [
         "Rob Schneider",
         "William Forsythe",
         "Eddie Griffin",
         "Arija Bareikis",
         "Oded Fehr",
         "Gail O'Grady",
         "Richard Riehle",
         "Jacqueline Obradors",
         "Big Boy",
         "Amy Poehler",
         "Dina Platias",
         "Torsten Voges",
         "Deborah Lemen",
         "Bree Turner",
         "Jackie Sandler",
         "Andrew Shaifer"
      ],
      "imdbMovieId": "0205000",
      "originalTitle": "Deuce Bigalow: Male Gigolo",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["wk_19DT6y9Y"],
      "plotSummary": "Deuce Bigalow is a less than attractive, down on his luck aquarium cleaner. One day he wrecks the house of a gigolo and needs quick money to repair it. The only way he can make it is to become a gigolo himself, taking on an unusual mix of female clients. He encounters a couple of problems, though. He falls in love with one of his unusual clients, and a sleazy police officer is hot on his trail.",
      "tmdbMovieId": 10402,
      "avgRating": 2.62154,
      "releaseYear": "1999",
      "numRatings": 4266,
      "posterPath": "/1AGR1KdIk1llaW983XsW5YsoPsI.jpg"
   }
}