{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0167423",
      "video": false,
      "title": "Diamonds",
      "recommendations": [
         40951,
         221121,
         45674,
         98116
      ],
      "backdrop_path": "/3tFvdYbN4Zk42hYAfvFqe3Xls66.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Harry Agensky",
               "gender": 2,
               "credit_id": "52fe45939251416c91037283",
               "name": "Kirk Douglas",
               "profile_path": "/vIZgu07gJtS2j460jgBlI1IvkAO.jpg",
               "id": 2090,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Michael Agensky",
               "gender": 2,
               "credit_id": "52fe45939251416c91037287",
               "name": "Corbin Allred",
               "profile_path": "/1REAXIdyWFaSkrSvX6pLHymgIwI.jpg",
               "id": 63492,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Lance Agensky",
               "gender": 2,
               "credit_id": "52fe45939251416c9103728b",
               "name": "Dan Aykroyd",
               "profile_path": "/lV7t37Dla8SILS1G7KpOplmviPg.jpg",
               "id": 707,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Sin-Dee",
               "gender": 1,
               "credit_id": "52fe45939251416c9103728f",
               "name": "Lauren Bacall",
               "profile_path": "/kolRFeufmFpcdRJL6v44FHkqdbJ.jpg",
               "id": 7570,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Moses Agensky",
               "gender": 2,
               "credit_id": "52fe45939251416c91037293",
               "name": "Kurt Fuller",
               "profile_path": "/rZUUgDoYTfYwbh87V7E4VVWUPlh.jpg",
               "id": 29685,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Sugar",
               "gender": 1,
               "credit_id": "52fe45939251416c91037297",
               "name": "Jenny McCarthy",
               "profile_path": "/itsSilp7prfi3lKQMFn1p5J6hWI.jpg",
               "id": 35597,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Tiffany",
               "gender": 1,
               "credit_id": "52fe45939251416c9103729b",
               "name": "Mariah O'Brien",
               "profile_path": null,
               "id": 133456,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Border Guard",
               "gender": 2,
               "credit_id": "5323fe6cc3a3685725007736",
               "name": "Lee Tergesen",
               "profile_path": "/eb2fKDGpVLYJGGuC4SUHRpezP8U.jpg",
               "id": 6906,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Tarzan",
               "gender": 2,
               "credit_id": "562b44989251412857004313",
               "name": "Val Bisoglio",
               "profile_path": "/wxeAHpKODn5oYRu359jCRgmHGDL.jpg",
               "id": 107068,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Gambler",
               "gender": 2,
               "credit_id": "562b44e5c3a3681b5e0042b0",
               "name": "John Landis",
               "profile_path": "/4MVt3MDXZzW2TsiQNvZCGv1ivRx.jpg",
               "id": 4610,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "June",
               "gender": 0,
               "credit_id": "562b44fec3a3681b52004362",
               "name": "Joyce Bulifant",
               "profile_path": "/hZgRI9cmtLAhtbLTmuh0gpTt2T9.jpg",
               "id": 1211892,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45939251416c910372a1",
               "name": "John Asher",
               "profile_path": null,
               "id": 24970,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45939251416c910372a7",
               "name": "Allan Aaron Katz",
               "profile_path": null,
               "id": 133457,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 1.212681,
      "production_countries": [],
      "id": 35118,
      "vote_count": 9,
      "budget": 0,
      "overview": "Mystery about an ex-prizefighter who embarks on a journey to find 13 missing diamonds",
      "similar": [],
      "original_title": "Diamonds",
      "runtime": 91,
      "poster_path": "/6sjCYkq3OhOgJXnOQ1XnfXw6t41.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         },
         {
            "name": "Polski",
            "iso_639_1": "pl"
         }
      ],
      "production_companies": [],
      "release_date": "1999-12-10",
      "vote_average": 4.8,
      "belongs_to_collection": null,
      "tagline": "Hunting for buried treasure was never this much fun.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Germany",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Asher"],
      "runtime": 91,
      "synopsis": null,
      "writers": ["Allan Aaron Katz"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0167423/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEzMDE3NTkzNF5BMl5BanBnXkFtZTYwMDk4NDg5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Kirk Douglas, Lauren Bacall, Dan Aykroyd | See full cast and crew »"],
      "reviews": [
         "A quietly charming film that starts slow and builds: Father (Dan Ackroyd) and son (Corbin Allred) take Grandpa (Kirk Douglas) along on a vacation trip, despite the fact that Gramps has had a stroke and his health--physical and mental--is in question. Those who've read Kirk's books, \"Climbing the Mountain\" and \"My Stroke of Luck\" will realize just how many of Kirk's real experiences have been written into the role, especially his continuing efforts to improve his damaged speech. (Who will ever forget the 1995 Academy Awards, when Kirk, just weeks after the stroke, came out to accept his honorary Oscar, and forced recognizable speech out of a mouth that was, at the time, very much a ruined instrument?) The film begins with a uneasy tenseness that makes it hard to enjoy, but this moderates as we come to know the characters, and a certain largeness of spirit appears when the three generations enter a brothel, run by Lauren Bacall, whose screen magic hasn't diminished one little bit. Incidentally, this is only the second film Douglas and Bacall have made together; the first was \"Young Man With a Horn\" in 1949. Does that mean we have to wait until 2O49 for them to do it again?",
         "The scenes between Dan Aykroyd and Kirk Douglas where they are working through Dan's disappointment that Kirk was not a better father are fantastic! Every man who has ever been disappointed in his father should watch the old post stroke Kirk Douglas telling his son \"I never kicked you in the ass, and I'm proud of that. My father beat me and I didn't beat you and that was a great thing.\" Maybe the definition of growing up is learning that your parents were children once, and they were hurt and disappointed and did not get enough from their parents, and that we are just all in this together, trying to find love. Maybe I am not a grown up until I have cried for the pain and disappointments my own mother and father have had in their lives, even though they also disappointed me. It is just lovely to know that even in a movie I never heard of, that never really made it, I can find such moments of genuine humanity.",
         "Its one of those films that makes an impact on a more subtle level than were used to these days. Its like a classical black and white, but with more sex and swearing. But don't let that put you off, every moment is justified, the emotion and the expression tell the story more than the words alone ever could. I don't think I would ever have watched it had it not been for the lack of anything to do at work (TV broadcaster's master control room), but once I got started I was sorry when it ended. So, I'm not saying throw out the mainstream block buster, but why not try adding it to the B-Roll list and watch it before something else to make you feel good. Bob",
         "I saw this movie on the rack at the video store and decided to rent it. I thought the movie was well written, and the kid (Allred) was great, BUT Kirk Douglas' performance was superb and overpowering. He made me laugh out loud. I had my next-door neighbors watch it to confirm my thoughts. They couldn't stop laughing. A must-see film!!!",
         "Normally I will agree with most of the online respected critics (Ebert, etc.). But this time I think they were really wrong. Yes, the movie was a bit predictable and at times slow. Not a great script and the casting might have been a bit better but Kirk Douglas and Lauren Bacall made the movie shine. It was a heart warming movie that definitely makes you happy you spent the time watching. Yes, it was probably a device made just for Douglas. But so what.... It worked for me and I would recommend it for all that has a heart and likes to divulge in an occasional sentimental and semi comedy drama. Cheers to \"Diamonds\"",
         "Kirk Douglas' stroke may have impeded his speech but not his acting ability,as he plays the role of a retired world boxing champion who refuses to let the death of his beloved wife and a recent stroke defeat him. Lauren Bacall, likewise, has also retained her acting skill, playing a call-house Madam with both a heart of gold and the wisdom that comes from age and experience. Dan Aykroid and Corbin Allred skillfully carry out their roles of son and grandson in this entertaining comedy road caper.",
         "\"Diamonds\" was a very good movie. I initially rented it because a former teen crush (Jenny McCarthy) of mine had a starring role in it. As I watched the movie I began to see that there was a lot more substance to it than just being a flick with a former Playboy playmate in it. It was well worth the money and it most certainly was one of the best I have seen to date. Go see it. It was Kirk Douglas's best (and last) movie in my opinion.",
         "I'm willing to bet that Kirk Douglas liked this project so much he decided to do it again with his own son and grandson. Diamonds is a story that finds Kirk in pursuit of some diamonds he hid away in the house of an old hoodlum friend in Reno, Nevada. Back in the day Douglas was a boxer by trade and this was a payoff for throwing a big fight back in the Fifties. To make his pursuit more interesting he takes along one of his two sons Dan Ackroyd and Ackroyd's son, Corbin Allred. So three generations of the Agensky family go in pursuit of some diamonds. Of course the trip is a bonding experience for all concerned. Ackroyd just went through a bitter divorce with Allred's mother and he's been estranged from Douglas for several years. I found Diamonds to be a pleasant film, entertaining and in a few instances quite touching. The Agensky family outing also included a visit to a bordello run by Madam Lauren Bacall. Before she married Humphrey Bogart, Bacall was an acting student in New York with Kirk Douglas and she persuaded him to come to Hollywood. Back in 1951 they co-starred in Young Man With a Horn so 48 years later they're back together on the screen. They're scenes are precious. With Diamonds I think Kirk was trying to send a message that all stroke victims aren't helpless. His scene with fellow former boxer Val Bisoglio as the two old ring enemies meet are a delight and later how he obtains his quest proves that while his speech is impaired he hasn't lost one single marble. Later on Kirk Douglas did It Runs In the Family with son Michael and grandson Cameron. But I kind of like this one better.",
         "This road movie deals about Harry(Kirk Douglas), an old retired boxer affected by a stroke. He claims to have a fortune in diamonds hidden in location of Reno into house a mobster(James Russo). Harry along with his estranged son(Dan Aykroyd)and grandson(Corbin)going on a road trip toward Nevada to retrieve it. Throughout travel enjoy various adventures and feeling moments. Meanwhile, they stop in a brothel with a veteran madame(Lauren Bacall) and attractive prostitutes (Jenny McCarthy). This is an independent road movie developing an agreeable father-son-grandson relationship with intimate bonding moments. Casting is justly excellent. Kirk Douglas is magnificent,in spite of his real stroke, as one-time boxing champion .He appears in a television images about his film titled ¨Champion¨(1949,Mark Robson)and is reunited with Lauren Bacall with whom he played in ¨Young man with a horn¨(1950,Michael Curtiz¨. Appears uncredited in a special cameo, John Landis as a gambler. Appropriate cinematography and sensible music score by Joel Goldsmith( Jerry Goldsmisth's son). The motion picture is professionally directed by John Asher. He's usually actor(CSY, NavyCSI) and director TV and occasionally director for his wife, Jenny McCarthy(Dirty love, Thank heaven), here lively playing a whore. Rating : Acceptable and entertaining.",
         "I doubt this movie would ever have been made but for Kirk Douglas. Its plot (generation gap and how to overcome it) has been told hundreds of times - and much better, too. The jokes are usually signalled with a red flag, the character-\"development\" is hardly in need of a soothsayer, nor are the plot \"twists\". Add the rather artificial sentimentality and you've got stuff that wouldn't even make it to TV. Thus said - I'd advise anyone strongly to watch \"Diamonds\". A contradiction? Yes, but the contradictory factor is simply: Sir Kirk. His presence, his strength to carry a film or his brilliance as an actor haven't diminished one bit since his stroke. Neither have his courage and his fighting spirit. Most actors his age would have given up, being bereft of their most important tool - speech. Kirk Douglas thought otherwise, and proved in \"Diamonds\" that he is still there and going strong. Though Dan Aykroyd and Corbin Allred do their parts credit, the only one to match Douglas' powerhouse performance is another screen-legend: Lauren Bacall. Their (all too brief) sequences bristle with chemistry and the competence of more than half a century in the business. In the end, \"Diamonds\" is simply proof that Kirk Douglas still can (and always will) overcome mediocre to bad material - and shine. That alone is reason enough to see \"Diamonds\"."
      ],
      "genres": [
         "Comedy",
         "Mystery"
      ],
      "productionCompanies": [
         "Cinerenta Medienbeteiligungs KG",
         "Total Film Group"
      ],
      "summaries": [
         "Boxing champion Harry Agensky, the Polish Prince, now an elderly widower and a stroke victim, takes speech lessons and fears confinement in an old age home. He convinces his son Lance and grandson Michael to take him to Reno to look for diamonds he stashed, his payoff when he threw a fight years before. Lance doesn't believe the diamond story but wants a last trip with dad, and all three have father-son issues to work out. After some gambling, they head for a brothel where each needs psychological intervention from a prostitute. Then it's time to find out if the diamonds really exist and if a road trip together can strengthen familial bonds.",
         "Mystery about an ex-prizefighter who embarks on a journey to find 13 missing diamonds."
      ],
      "budget": 0
   },
   "movielensId": 3149,
   "movielens": {
      "languages": [
         "English",
         "Deutsch",
         "Polski"
      ],
      "releaseDate": "1999-12-10",
      "dvdReleaseDate": "2000-07-18",
      "directors": ["John Asher"],
      "runtime": 91,
      "movieId": 3149,
      "title": "Diamonds",
      "mpaa": "",
      "actors": [
         "Kirk Douglas",
         "Corbin Allred",
         "Dan Aykroyd",
         "Lauren Bacall",
         "Kurt Fuller",
         "Jenny McCarthy",
         "Mariah O'Brien",
         "Lee Tergesen",
         "Val Bisoglio",
         "John Landis",
         "Joyce Bulifant"
      ],
      "imdbMovieId": "0167423",
      "originalTitle": "Diamonds",
      "genres": [
         "Comedy",
         "Drama",
         "Mystery"
      ],
      "youtubeTrailerIds": ["56Lf_8LJ_e0"],
      "plotSummary": "Mystery about an ex-prizefighter who embarks on a journey to find 13 missing diamonds",
      "tmdbMovieId": 35118,
      "avgRating": 2.55303,
      "releaseYear": "1999",
      "numRatings": 66,
      "posterPath": "/6sjCYkq3OhOgJXnOQ1XnfXw6t41.jpg"
   }
}