{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "explosive",
            "id": 1653
         },
         {
            "name": "revenge",
            "id": 9748
         },
         {
            "name": "explosives expert",
            "id": 159358
         }
      ],
      "imdb_id": "tt0111255",
      "video": false,
      "title": "The Specialist",
      "recommendations": [
         9691,
         9874,
         9618,
         11228,
         9604,
         9972,
         9350,
         9594,
         9091,
         8831,
         2019,
         9946,
         11517,
         10861,
         9268,
         1825,
         2142,
         10413,
         9349,
         11074
      ],
      "backdrop_path": "/dcHU8hCNqo5TEPLJSX4nFW2jDVY.jpg",
      "revenue": 170362582,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Ray Quick",
               "gender": 2,
               "credit_id": "52fe4361c3a36847f804fd67",
               "name": "Sylvester Stallone",
               "profile_path": "/gnmwOa46C2TP35N7ARSzboTdx2u.jpg",
               "id": 16483,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "May Munro",
               "gender": 1,
               "credit_id": "52fe4361c3a36847f804fd6b",
               "name": "Sharon Stone",
               "profile_path": "/n28skoawvqAymYr6gRSm2pfro0i.jpg",
               "id": 4430,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Ned Trent",
               "gender": 2,
               "credit_id": "52fe4361c3a36847f804fd6f",
               "name": "James Woods",
               "profile_path": "/fl5Jx1WFvBcg1b9VZRfXTH6LPUE.jpg",
               "id": 4512,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Joe Leon",
               "gender": 2,
               "credit_id": "52fe4361c3a36847f804fd73",
               "name": "Rod Steiger",
               "profile_path": "/cc96tXM1O0PAoyog9hzo1GgSwB5.jpg",
               "id": 522,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Tomas Leon",
               "gender": 2,
               "credit_id": "52fe4361c3a36847f804fd77",
               "name": "Eric Roberts",
               "profile_path": "/45i6fsxBwH1UyA74tWQ6am0DntC.jpg",
               "id": 21315,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Charlie",
               "gender": 0,
               "credit_id": "52fe4361c3a36847f804fd7b",
               "name": "Mario Ernesto Sánchez",
               "profile_path": "/f6XWjHEPuPf35RswwZJBzV8bAq.jpg",
               "id": 26651,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Strongarm",
               "gender": 0,
               "credit_id": "52fe4361c3a36847f804fd7f",
               "name": "Sergio Doré Jr.",
               "profile_path": null,
               "id": 26652,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Stan Munro",
               "gender": 0,
               "credit_id": "52fe4361c3a36847f804fd83",
               "name": "Chase Randolph",
               "profile_path": null,
               "id": 26653,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Alice Munro",
               "gender": 0,
               "credit_id": "52fe4361c3a36847f804fd87",
               "name": "Jeana Bell",
               "profile_path": null,
               "id": 26654,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Young May",
               "gender": 1,
               "credit_id": "52fe4361c3a36847f804fd8b",
               "name": "Brittany Paige Bouck",
               "profile_path": null,
               "id": 26655,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Pianoplayer",
               "gender": 0,
               "credit_id": "52fe4361c3a36847f804fd8f",
               "name": "Emilio Estefan",
               "profile_path": null,
               "id": 26656,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Singer #1",
               "gender": 0,
               "credit_id": "52fe4361c3a36847f804fd99",
               "name": "LaGaylia Frazier",
               "profile_path": "/wPorrajfTZKar9AQArCEEMKLu0D.jpg",
               "id": 1176261,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4361c3a36847f804fd3f",
               "name": "Luis Llosa",
               "profile_path": null,
               "id": 26648,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4361c3a36847f804fd4b",
               "name": "Alexandra Seros",
               "profile_path": null,
               "id": 26649,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4361c3a36847f804fd51",
               "name": "Jerry Weintraub",
               "profile_path": "/wqmJO4ChjNmmlz3wZ8qoCIC1VG9.jpg",
               "id": 1888,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4361c3a36847f804fd57",
               "name": "Jeffrey L. Kimball",
               "profile_path": null,
               "id": 904,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4361c3a36847f804fd5d",
               "name": "Jack Hofstra",
               "profile_path": null,
               "id": 21811,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe4361c3a36847f804fd63",
               "name": "Jackie Burch",
               "profile_path": null,
               "id": 1097,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "52fe4361c3a36847f804fd95",
               "name": "John Barry",
               "profile_path": "/9NyieJO78xbwKIBZ1589WfdRPV8.jpg",
               "id": 2289,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5788e268925141361a000bf9",
               "name": "John Shirley",
               "profile_path": null,
               "id": 1217663,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 1,
               "credit_id": "53735acc0e0a267c590017bd",
               "name": "Judianna Makovsky",
               "profile_path": "/fdRHxR0k3b95mY8p3VOzFTFN2p9.jpg",
               "id": 10970,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "53735ae20e0a267c5c0016bf",
               "name": "Walter P. Martishius",
               "profile_path": null,
               "id": 4147,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "53735afa0e0a267c5c0016c2",
               "name": "Alan E. Muraoka",
               "profile_path": null,
               "id": 17149,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "53735b2e0e0a267c67001664",
               "name": "Scott Jacobson",
               "profile_path": null,
               "id": 7417,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "53735b4f0e0a267c5c0016d5",
               "name": "Carole Brown-James",
               "profile_path": null,
               "id": 1319404,
               "department": "Costume & Make-Up",
               "job": "Costume Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "53735b670e0a267c6e001605",
               "name": "Kent James",
               "profile_path": null,
               "id": 1319405,
               "department": "Costume & Make-Up",
               "job": "Costume Supervisor"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 9.55461,
      "production_countries": [
         {
            "iso_3166_1": "PE",
            "name": "Peru"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 2636,
      "vote_count": 392,
      "budget": 45000000,
      "overview": "May Munro is a woman obsessed with getting revenge on the people who murdered her parents when she was still a girl. She hires Ray Quick, a retired explosives expert to kill her parent's killers. When Ned Trent, embittered ex-partner of Quick's is assigned to protect one of Quick's potential victims, a deadly game of cat and mouse ensues.",
      "similar": [
         357096,
         37835,
         156022,
         281957,
         3134,
         46957,
         55292,
         24,
         245891,
         261023,
         8456,
         281,
         956,
         979,
         2652,
         238636,
         395834,
         25473,
         445954,
         26789
      ],
      "original_title": "The Specialist",
      "runtime": 110,
      "poster_path": "/flK0OtdFRvfbs5BixEqU327H8ZB.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Jerry Weintraub Productions",
            "id": 2596,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Iguana Producciones",
            "id": 11134,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1994-10-07",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "The government taught him to kill. Now he's using his skills to help a woman seek revenge against the Miami underworld.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Peru",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Luis Llosa"],
      "runtime": 110,
      "synopsis": "1984. Ray Quick (Stallone) and Ned Trent (Woods) are explosives experts for the CIA, on an assignment to blow up a bridge while a certain vehicle is passing over it. Quick rigs everything on the bridge, after which Trent sets off the timer. As the target vehicle approaches, Quick sees a child inside, and pleads with Trent to stop the timer. Trent refuses. Quick runs back to the bridge and tries to disable the bomb there, but is too late. In the violent confrontation between Quick and Trent that follows, Quick vows that Trent's career in the CIA will be over because of this. Fast-forward to the \"present day,\" which is 1994. Trent is indeed out of the CIA and now works as head of security for a mobster named Joe Leon, but still seeks revenge on Quick. Quick has also left the CIA and now works as a free-lance bomber-for-hire. He lives secretively in an abandoned waterfront warehouse he has converted into an armed bunker, and refuses to meet personally with his clients or even let them contact him. His only communication with clients is when he contacts them, usually by taking public transit to another part of the city and using a pay phone. On one such bus ride, Quick gets out of his seat and offers it to a pregnant woman, only to have a young hoodlum take the seat instead. Quick calmly beats the crap out of the hoodlum and all his friends, throwing one of them out a window (not open), and then re-offers the seat to the woman. This scene has no bearing on the plot, but helps us get to know Quick. Quick has been hired by a young woman named May Munro (Sharon Stone) to kill the three men who killed her parents years ago, who happen to be Joe Leon's son Tomas and two henchmen. Eventually we learn that May has been hired by Trent to lure Quick out into the open where Trent can get his revenge. As Trent describes the arrangement, \"You get your three corpses, I get Quick.\" May not only wants her corpses but wants to watch Tomas Leon die, and therefore spends time at parties at the Leon compound. Tomas takes a liking to her and makes a pass, which May pretends to respond to favorably. But afterwards she is so disgusted at having been that close to him that, when she gets home, she throws the dress she was wearing while with him in the trash, and mopes around the house the rest of the evening in nothing but her panties. This also does not advance the plot in any way, but helps us get to know May. After Quick dispatches the two henchmen in separate incidents (the second involving a bomb with an LED screen that displays \"Bye Bye\" before it explodes), Joe Leon convinces his friend the chief of police that the police need Trent's explosives expertise to help solve the case. The chief arranges for Trent to work with the bomb squad. In order to impress and intimidate his new colleagues, Trent takes some parts lying on a table at the bomb squad headquarters, puts together a bomb, and activiates it, daring the cops to deactivate it before it explodes. When they are unable to, he does. When Quick takes out Tomas, May arranges to be in the same room, and introduces herself (her real identity) to him right before the explosion. She is not injured but fakes her own death by going to the hospital and dropping her wallet into the purse of a dying junkie. Stallone goes to the funeral of the woman identified as May Munro, and finds the living May there, who is lurking in the background expecting him to show. They leave, after which Trent arrives somewhat less unobtrusively, confronting the priest at gunpoint and demanding that the coffin be opened. Quick and May go to a hotel, where their interactions in the bedroom and the shower go beyond discussion of business. But May leaves in the morning while Quick is still asleep and is captured by Trent, who forces her to reveal Quick's location. But when Trent and his men arrive at the hotel room, Quick is gone, and explosives he has rigged detach that portion of the hotel (with some of Trent's men in it) from the building as a whole, falling into the water below. With Trent prepared to kill her if she doesn't cooperate, May arranges to meet with Quick at a waterfront restaurant, but is able to word things in such a way that Quick recognizes that it's a trap. Quick and May escape out the back in a boat, but in an impressive bit of detective work, Trent and the cops determine the location of Quick's residence, and arrive the next morning with what looks like the entire police force. But Quick has the whole place rigged, and after several huge displays of pyrotechnics, Quick and May escape yet again. This time Trent does not. Along the way May has learned that it was Joe Leon himself who ordered the hit on her parents. So in the end, we find Joe opening a small package, in which he finds a locket, which he opens to reveal a picture of May's parents. Boom. Watching from nearby, May gets into a car with Quick and they drive away.",
      "writers": [
         "John Shirley",
         "Alexandra Seros"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0111255/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTA5ODg3NTMzODZeQTJeQWpwZ15BbWU2MDA5MDg2OA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Sylvester Stallone, Sharon Stone, James Woods | See full cast and crew »"],
      "reviews": [
         "Hey, I enjoy a good revenge movie as well as the next guy, even though I know forgiveness is the better way. Revenge films satisfy base urges in all of us. But, holy smokes, this crosses the line a little bit with the glorification of such....at least with the ending (which I won't give away but involves Sharon Stone's character). Along the way is a fun ride as the revenge-obsessed Stone hires Sylvester Stallon (The Specialist, a term for his bomb-making talents) to kill all the people responsible for her parents' murder years earlier. The villains are over-the-top, to say the least. One almost has to laugh out loud at one of them: James Woods. Few people in his era (70s and 80s mainly) were better at playing despicable villains than Woods, and in this film he plays that role to the hilt. He also rattles off the best line in the movie when he tells some tourist to \"get a new shirt, too.\" The other villains are played by Eric Roberts and Rod Steiger. Roberts is nasty and arrogant all the way and Steiger - as he has so often since the 1970s - appears cartoonish in his over-acting. The film moves quickly which means it's very entertaining and some of the bombing scenes are quite memorable, such as a chunk of a condo building falling into the ocean. Even though the villains are really nasty, there are no \"good guys\" here, either. Everyone is seriously flawed, as is the message of the film. I guess this is one of those \"guilty pleasure\" movies they talk about, because I still enjoy watching it every five or so years.",
         "* 1/2 out of **** Arguably Sylvester Stallone's last box office hit (unless you count Cop Land), The Specialist is not the typical Stallone testosterone fest. In fact, it remains a fairly atmospheric thriller revolving around obsession and revenge. But it's not as interesting as it may sound, thanks to the generally lackluster script and mostly unlikeable characters. Stallone plays Ray Quick, an ex-bomb specialist who works for hire. After the movie's requisite prologue, he's in Miami working for May Munro (Sharon Stone), who wants him to kill three mobsters, especially the head mobster's son, Tomas (Eric Roberts), because they murdered her parents when she was a little girl. Quick contacts her only by phone, they are to never meet, but he's admittedly intrigued by her and vice versa. However, she's actually working for Ned Trent (James Woods), Quick's former colleague who's out for revenge. Action fans expecting bombastic and over-the-top action sequences should steer clear, this movie will be too sluggish for them. The Specialist has no desire to function as a typical Stallone actioner. There are no large-scale gun battles, fisticuffs, or car chases. In fact, I gather Stallone received the role purely on the basis of his box office clout (and perhaps also his ability to brood and act generally depressed fairly well). So what is The Specialist, then? Is it a thriller? Yeah, sort of, there are a few suspenseful moments, mostly pertaining to Stallone using his bombs to knock off the mobsters. Surprisingly enough, the twist of having the hero kill the bad guys with explosives (Speed and Blown away came out the same year) works well enough, mostly because the villains' impending doom bears a certain inevitability that plays to the movie's advantage. But there's little else about the movie worth recommending. The story doesn't make much sense; as soon as it's revealed Roberts' murdered Stone's parents when she was a child, I scratched my head in confusion. He couldn't possibly be more than a year or two older than Stone, meaning he committed the murders when he was about, what, ten or eleven? More likely, it appears the filmmakers are trying to pass off Stone as a twenty-year old bombshell. Sure, Stone looks great (and I do mean great) in this film, but she can't even pass for thirty. The romance is unsurprisingly perfunctory and generic. As soon as the hero and heroine meet, they almost immediately tear their clothes off and go at it. This is neither romantic nor sexy, even with the undeniably hot Sharon Stone as part of this tryst. I've always kind of liked Stallone, subpar an actor as he may be. He's always had a fairly commandable screen presence, though he has yet to translate that to genuine charisma (which is what puts him considerably behind that other big lug, Arnold Scwarzenegger). Neither suspenseful nor exciting enough to recommend, The Specialist is of little interest to anyone except for Stallone and Stone fans (and maybe James Wood fans, who will either delight or wince at his maniacally over-the-top performance). I'm still waiting for Stallone to revive his career with a big-budget action blockbuster, but I don't see it happening. Hey, I'm one of the few guys out there who actually liked D-Tox, so I wouldn't necessarily say his career has gone down the drain.",
         "The Specialist may not be great cinema, but it does offer some good bang-bang explosives action and also some interesting characters. Sly Stallone is a former CIA-attached Army explosives expert, Raymond Quick, skilled at focus detonations that blow up certain areas while leaving surrounding areas unharmed. In 1984 he and his partner, Ned Trent, must blow up a bridge frequented by a Columbian drug lord, but a civilian bus enters as the explosives are set to go off. When Trent callously goes through with the mission, Ray disarms the bombs, then beats up Trent before having him discharged from the Agency. Ten years later Trent now works as security chief for a Miami mafia chief who years earlier had a former underling named Munro killed - in front of the man's daughter, May. May Munro now wants her parents' killers blown up, and she wants Ray Quick for the job. Ray is initially reluctant, believing it to be a setup, but eventually accepts, and starts blowing up the three thugs responsible one by one. But it is a setup - May Munro is in reality working for Trent, who is using her very real desire for revenge to smoke out Ray. Quick, though, is too smart for Trent's traps - until Ray and May's passion heats up ad Trent gets the break he needs to finish off the both of them. The film's highlights are James Woods' over-the-top performance, the explosion scenes, and also John Barry's haunting score, fleshed out by Gloria Estefan's garish cover of Vicki Sue Robison's 1970s disco classic \"Turn The Beat Around.\"",
         "This movie is, apart from the film music, as a whole a must-see for action movie lovers with erotic scenes, built in smoothly. The double role of May makes the movie richer: there IS a plot possible in these kind of movies!. Action abound and well distributed over the time. Eric Roberts and James Woods play their roles at the same high level as Sylvester Stallone and Sharon Stone.I see originality, in the sense of action: the highly developed explosive devices-do hey really exist?CIA will know.. A flaw ,which i do not understand up to now, is that the getaway boat from M&M seafood seemed to be so readily available. The goofy trick with the telephone in the Fontainebleu Hptel as well, but those are not disturbing details. The movie has a steady pace and ends with the Miami Sound Machine!. Best scene is of course , the intimate scene in the hotel. Superb entertainment! A 9. Will see it again.",
         "Although I'm not really a Sly-fan I found this movie highly entertaining and it made me laugh quite a lot. I totally agree with the comment of bensonl who, in my opinion understands the value of entertainment. Right you are, mate! I think it's silly to look for a good plot (is there one?) in an action flick like this. Anyway, who cares? If you're in for a plot go see 'Usual Suspects', I'd say. By the way, if you're being led by all the negative comments, you'll miss the chance of (yet again) seeing Sharon without clothes.....mmmm! 8 out of 10 to push up the score.",
         "I know, if you read some of the other comments people have posted, they say that The Specialist is just a lame action movie. Well, they're wrong. IT WAS A GREAT ACTION MOVIE. But then again, what else would you expect from Sylvester Stallone, the most entertaining actor in history. Sly stars as an ex-CIA agent who is hired by a mysterious women (Sharon Stone)to blow up the men who murdered her parents. The explosions are awesome, and the fight scenes are great too. Sly and Sharon both give great performances, and so does James Woods. Woods plays a phsychotic hired gun with a personel vendetta against Sly. All in all, The Specialist was a very entertaining movie. But don't take my word for it, go see it for yourself. Trust me, you won't be disappionted.",
         "As others have mentioned, James Woods is the only really entertaining asset this film has. Even a good dosage of Sharon Stone in the nude cannot elevate this film above the level of crappola. The plot isn't worth commenting on. You just have a vengeful woman (Stone) hiring Sly Stallone to blow up a crime family who killed her parents when she was a child. By the way, does anyone else find it totally ridiculous that Stone's character is a child when her parents are killed by Eric Roberts & co., but now she's supposed to be all grown up and he still looks the same? Totally laughable. Anyway, just watch James Woods do what he does best. He goes way over the top with his portrayal of a former colleague of Stallone (in the CIA I think) now trying to help mob boss Rod Steiger hunt him down. Woods easily steals every scene he's in. He looks like he's having a blast with the corny dialogue. My favorite scene: Woods and some hit men are on their way up to Sly's hotel room to waste him. About four of them jump on an elevator, and just before the door is about to close, a couple of senior citizens try to get on with them. The man is wearing a god-awful brightly colored shirt, and woods not only tells him and his wife to get lost, but also insults him about his shirt! You can just tell Woods ad-libbed the line about the shirt just as the doors were closing on the old couple. Truly hilarious! The rest of the film besides Woods is terrible. Stallone never knew how to say no to a bad film, and that is why his career has bottomed out. Stone bounced back with a big role in Casino the following year. Woods is also in that one, and once again, he steals every scene. At least Casino was good, though! The Specialist is worth about 4 of 10 stars. So sayeth the Hound.",
         "Sylvester Stallone is without doubt still in shape, and if you have previously enjoyed watching him on screen, you will surely like him on this movie. Sharon Stone is also a good choice to play the girl, since her and Stallone have good chemistry on the film. The mutual attraction on both characters is divinely shown by the two actors. Although a lot of people didn't seem to enjoy this film, or even think of it as \"acceptable\" this movie is actually quite amusing. It is mostly to divert yourself for a while, so don't expect a big film with deep dialogues. But if what you're looking for is to have a good time without having to think too much, this is what you want, since it is indeed an agreeable way to entertain yourself.",
         "This seems like a film tailor-made so Sly & Sharon can 'strut their stuff' in the coupling dept. Sharon vamps, Sly warbles thru his lines. Yea, he's got a deep & sexy voice but you can only pick up on what he's saying to her on the phone if you got close-caption on your set! Anyway, they both look VERY fine in this film. James Woods is the pest you'll love to hate being the back-stabber that he is. \"Slime\" is the only word to use for Eric Roberts role & Rod Steiger's Hispanic accent is fun! See the edited version of this one. It's got a slick color to it that's quite appealing being that it was shot in Miami where everything's bright pink & green.",
         "I have to admit that even though this films rating is 4.7 I found it very good and enjoyable. The cast is excellent and includes Stallone, Stone, Steiger, Woods and Roberts, who all give decent performances. Stallone and Stone are both great as the leads, and I reckon this is certainly one of Stallone's better films compared to the ones he's been in recently. You get to get away from the action side of him and see more of his personality and emotions which is good, as we usually see as the action hero. Steiger and Roberts are both decent as the supporting villains but stealing the honours from the rest of the cast is James Woods who gives a quite outstanding performance as the key villain. This film has several great scenes including some great explosions and a very good sex scene. I thoroughly enjoyed this and would recommend it to people who like thrillers. 9/10 Check it out"
      ],
      "genres": [
         "Action",
         "Crime",
         "Drama",
         "Romance",
         "Thriller"
      ],
      "productionCompanies": [
         "Warner Bros.",
         "Jerry Weintraub Productions",
         "Iguana Producciones"
      ],
      "summaries": [
         "Ray Quick is a bomb expert who worked for the CIA along with a guy named Ned Trent, who's extremely demented. When they have a falling out, Ray becomes a freelancer who lives off the grid. A woman named May Munro contacts and wants him to kill the three men who killed her family years ago, who work for the Leon crime family. Ray does it and after killing the first one, the Leons need to find the one who did it and it turns out Ned is now working for them and they task him with finding the bomber. The Leons get him to work with the police and he looks for the bomber. In the meantime Ray, while working on getting the others, can't help but follow May wherever she goes.",
         "Ray Quick is an ex-CIA bomb expert now living as an high-tech outsider somewhere in Miami, Florida. May Munro has heard of his skills and tries over and over to convince Ray to bomb the guys who killed her parents once. Ray begins to overshadow May. He is interested in May's case, but still is of the opinion to never use his skills again. The situation changes dramatically when a former CIA comrade of Ray appears on the scene.",
         "Ray Quick is a former CIA explosives expert turned bomber-for-hire living in Miami, Florida. Ray's latest client is a beautiful woman named May Munro, May hires Ray to assassinate Miami mobsters who murdered her parents when she was a child. Agreeing, Ray eliminates the three mobsters one-by-one and blows them up. But things go from bad to worse, one of the mobsters Ray has killed is Tomas Leon, the son of Miami crime boss Joe Leon and Ned Trent, a vicious and crooked Ex CIA agent (Ray's former college) is working for the Miami mob and was Tomas's bodyguard, has been assigned by Joe to find the bomber-for-hire who killed his son and his two employees. Ray becomes distrustful and suspicious of May, and suspects May has set him up and is working for Ned who is out to get his revenge on Ray.",
         "May Munro is a woman obsessed with getting revenge on the people who murdered her parents when she was still a girl. She hires Ray Quick, a retired explosives expert to kill her parent's killers. When Ned Trent, embittered ex-partner of Quick's is assigned to protect one of Quick's potential victims, a deadly game of cat and mouse ensues.",
         "A woman entices a bomb expert she's involved with into destroying the mafia that killed her family."
      ],
      "budget": 45000000
   },
   "movielensId": 315,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-10-07",
      "dvdReleaseDate": "1998-02-24",
      "directors": ["Luis Llosa"],
      "runtime": 110,
      "movieId": 315,
      "title": "The Specialist",
      "mpaa": "R",
      "actors": [
         "Sylvester Stallone",
         "Sharon Stone",
         "James Woods",
         "Rod Steiger",
         "Eric Roberts",
         "Mario Ernesto Sánchez",
         "Sergio Doré Jr.",
         "Chase Randolph",
         "Jeana Bell",
         "Brittany Paige Bouck",
         "Emilio Estefan",
         "LaGaylia Frazier"
      ],
      "imdbMovieId": "0111255",
      "originalTitle": "The Specialist",
      "genres": [
         "Action",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "mqTrjDsEg4g",
         "SS75LoRrmMg"
      ],
      "plotSummary": "May Munro is a woman obsessed with getting revenge on the people who murdered her parents when she was still a girl. She hires Ray Quick, a retired explosives expert to kill her parent's killers. When Ned Trent, embittered ex-partner of Quick's is assigned to protect one of Quick's potential victims, a deadly game of cat and mouse ensues.",
      "tmdbMovieId": 2636,
      "avgRating": 2.89988,
      "releaseYear": "1994",
      "numRatings": 12485,
      "posterPath": "/flK0OtdFRvfbs5BixEqU327H8ZB.jpg"
   }
}