{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "japan",
            "id": 233
         },
         {
            "name": "journalist",
            "id": 736
         },
         {
            "name": "war",
            "id": 6091
         }
      ],
      "imdb_id": "tt0037547",
      "video": false,
      "title": "Blood on the Sun",
      "recommendations": [
         101770,
         85670,
         73125,
         166316,
         26699,
         109886,
         176901,
         142629,
         166655,
         49064,
         43599,
         156322,
         153163,
         72997,
         18229,
         27035,
         26718,
         33001,
         84099
      ],
      "backdrop_path": "/cO61qj12EvlkP8JK3ModbFxu0JS.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1013,
               "character": "Nick Condon",
               "gender": 2,
               "credit_id": "52fe491ac3a368484e11a2fb",
               "name": "James Cagney",
               "profile_path": "/ltNtoIKkh6zjjLxPTkw8EKYiQPi.jpg",
               "id": 5788,
               "order": 0
            },
            {
               "cast_id": 1014,
               "character": "Iris Hilliard",
               "gender": 1,
               "credit_id": "52fe491ac3a368484e11a2ff",
               "name": "Sylvia Sidney",
               "profile_path": "/eUDO5p5Zra4e51yQW4IdNifhzlc.jpg",
               "id": 528,
               "order": 1
            },
            {
               "cast_id": 1015,
               "character": "Arthur Bickett",
               "gender": 2,
               "credit_id": "52fe491ac3a368484e11a303",
               "name": "Porter Hall",
               "profile_path": "/73hzC2AnpyFHOceuq4ZdUbsNQds.jpg",
               "id": 14975,
               "order": 2
            },
            {
               "cast_id": 1016,
               "character": "Premier Gilchi Tanaka",
               "gender": 2,
               "credit_id": "52fe491ac3a368484e11a307",
               "name": "John Emery",
               "profile_path": "/44mz6m4k3x6Q7hLIlUgQ6aMCUMv.jpg",
               "id": 35194,
               "order": 3
            },
            {
               "cast_id": 1017,
               "character": "Col Hideki Tojo",
               "gender": 2,
               "credit_id": "52fe491ac3a368484e11a30b",
               "name": "Robert Armstrong",
               "profile_path": "/aCVVQrACinfyBlkYYJefXhaxGtH.jpg",
               "id": 3243,
               "order": 4
            },
            {
               "cast_id": 1018,
               "character": "Ollie Miller",
               "gender": 2,
               "credit_id": "58fc93f792514163ec01fa53",
               "name": "Wallace Ford",
               "profile_path": "/nfXCJAU3ddSn2K6SjwxXt2h1yQU.jpg",
               "id": 35849,
               "order": 5
            },
            {
               "cast_id": 1019,
               "character": "Edith Miller",
               "gender": 1,
               "credit_id": "58fc9406c3a36879f401cd35",
               "name": "Rosemary DeCamp",
               "profile_path": "/tVOdH79ocS1FGcmvUAfi32il66d.jpg",
               "id": 30273,
               "order": 6
            },
            {
               "cast_id": 1020,
               "character": "Capt. Oshima",
               "gender": 2,
               "credit_id": "58fc9415c3a36879f401cd47",
               "name": "John Halloran",
               "profile_path": null,
               "id": 88680,
               "order": 7
            },
            {
               "cast_id": 1021,
               "character": "Hijikata",
               "gender": 2,
               "credit_id": "58fc9423c3a36879db02115a",
               "name": "Leonard Strong",
               "profile_path": "/c4w7CzUtElSEt4hdQ94vod52MoH.jpg",
               "id": 30514,
               "order": 8
            },
            {
               "cast_id": 1022,
               "character": "Charley Sprague",
               "gender": 0,
               "credit_id": "58fc9433c3a3687a2a01e33e",
               "name": "James Bell",
               "profile_path": "/wRkt24kVhuy2iMYdzgYJ2qbava9.jpg",
               "id": 84935,
               "order": 9
            },
            {
               "cast_id": 1023,
               "character": "Yamada",
               "gender": 2,
               "credit_id": "58fc9442c3a3687a2501f11b",
               "name": "Marvin Miller",
               "profile_path": "/2tDxHBQdcuhMf36behkn1mf3BNj.jpg",
               "id": 19404,
               "order": 10
            },
            {
               "cast_id": 1024,
               "character": "Joseph Cassell",
               "gender": 2,
               "credit_id": "58fc9452c3a36879be0203d8",
               "name": "Rhys Williams",
               "profile_path": "/jaD2gAkx9AhNABqDobe9D23oexT.jpg",
               "id": 82835,
               "order": 11
            },
            {
               "cast_id": 1025,
               "character": "Prince Tatsugi",
               "gender": 2,
               "credit_id": "58fc946292514163ec01fab0",
               "name": "Frank Puglia",
               "profile_path": "/cC89EI595bAz4SPIE1JKIOkdVU.jpg",
               "id": 89691,
               "order": 12
            },
            {
               "cast_id": 1026,
               "character": "Amah",
               "gender": 1,
               "credit_id": "5a3170ebc3a3680b8d18bdb1",
               "name": "Grace Lem",
               "profile_path": null,
               "id": 1940781,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe491ac3a368484e11a2e5",
               "name": "Garrett Fort",
               "profile_path": null,
               "id": 29807,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe491ac3a368484e11a2eb",
               "name": "Lester Cole",
               "profile_path": null,
               "id": 78158,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe491ac3a368484e11a2f1",
               "name": "William Cagney",
               "profile_path": null,
               "id": 30266,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe491ac3a368484e11a2f7",
               "name": "Frank Lloyd",
               "profile_path": "/h3QW1G6QlkC1cKtcIaFC2kRVkHy.jpg",
               "id": 72061,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "War",
            "id": 10752
         }
      ],
      "popularity": 1.127165,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 75888,
      "vote_count": 7,
      "budget": 0,
      "overview": "Nick Condon, an American journalist in 1945 Tokyo, publishes the Japanese master plan for world domination. Reaction from the understandably upset Japanese provides the action, but this is overshadowed by the propaganda of the time.",
      "similar": [
         324786,
         279641,
         1904,
         616,
         374720,
         227306,
         11948,
         8741,
         11422,
         826,
         1369,
         22972,
         4421,
         346,
         667,
         676,
         137113,
         228150,
         354287,
         64686
      ],
      "original_title": "Blood on the Sun",
      "runtime": 93,
      "poster_path": "/43WkbXQJeeIpmghkHNSzDonlqq.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "日本語",
            "iso_639_1": "ja"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "William Cagney Productions",
         "id": 16056,
         "origin_country": ""
      }],
      "release_date": "1945-04-26",
      "vote_average": 5.1,
      "belongs_to_collection": null,
      "tagline": "Having a wonderful time In Tokyo!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Frank Lloyd"],
      "runtime": 98,
      "synopsis": "Nick Condon (James Cagney) is a journalist for the Tokyo Chronicler. He prints a story disclosing Japan's plan to conquer the world. The newspaper is seized by Japanese officers. Condon get the Tanaka Plan, a paper in which all the plans are laid in written. The Japanese spies who follow him think that Ollie and Edith Miller (Wallace Ford and Rosemary DeCamp) are the ones who discovered all the plan because they suddenly have a lot of money and are coming back to the USA. When Condon goes to the ship to say them farewell, he finds Edith dead. He can only see a woman's hand with a ring with a huge ruby. Back home, he finds Ollie, in a terrible condition. He gets from Ollie the Tanaka plan. Premier Giichi Tanaka (John Emery) wants his plans to remain secret, and sends Col. Hideki Tojo (Robert Armstrong) Capt. Oshima (John Halloran) and Hijikata (Leonard Strong) to follow him everywhere. Condon loses the document with the Tanaka plan. Ollie's disappeared, and the police arrest them in terms of scandal and much noise while having a party with two girls in his apartment, which is a complete lie. Condon meets Iris Hilliard (Sylvia Sidney), half American and half Chinese. At first, he suspects her of being the lady in the ship, then he doesn't. They fall in love. She seems to be betraying him, specially when Condon sees the ring with the ruby in her hand. At the end, it turns out she's been sent by a politician who wants peace and was present when the Tanaka plan was devised. Condon leaves his job after ten days. When he's about to leave Japan, he meets the politician and Iris in the harbour. The politician signs the document to prove it's real. They are discovered by the Japanese army. Iris runs away with the document in a cargo ship which will take her out of Japan. To distract the Japanese officers, Condon fights his greatest enemy and tries to reach the American Embassy. He's shot at by spies dressed in street clothes, but he's not killed. The consular adviser goes out of the Embassy and takes Condon inside still alive, and the Japanese officers can't prevent it, because they couldn't find the Tanaka document when searching Condon.",
      "writers": [
         "Lester Cole",
         "Nathaniel Curtis"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0037547/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA1MTg1NjM2N15BMl5BanBnXkFtZTcwOTcwMDYyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: James Cagney, Sylvia Sidney, Porter Hall | See full cast and crew »"],
      "reviews": [
         "No one can deny that Adolf Hitler wrote MEIN KAMPF, and spelled out his anti-Semitism, his plans for German domination of at least Europe and possibly the globe, and his desire for the destructions of Jews, Slavs, and other \"undesireables\" in his world view. It is there in full print, and one can still read it. Moreover Nazis and their supporters boast of the book's brilliance and clarity. So nobody denies that book and it's authorship. But other political writings have a less stable provenance. For instance, the Zinovieff letter of 1924. It was supposedly written by Gregory Zinovieff, one of the leading figures of the Soviet Government of that day, and it was supposedly advising Russian communists to support the reelection of the Ramsay MacDonald Labor Government. The letter suggested that support for Labor would lead to a Sovietized Britain. As a result of the publication of the letter, MacDonald's minority government lost reelection and Stanley Baldwin's Tories took control for five years. It is now certain that the letter was not written by Zinovieff, but by anti-Soviet Russians living in exile in France, and that the Tories used it unscrupulously but successfully, to win the election. Similarly we have the \"maguffin\" of this film: \"The Tanaka Memorial\". Baron Tanaka was a leading Japanese political figure who supposedly wrote this fanatical piece about the need for Japan to expand in Asia, at the expense of the colonial empires of France, Britain, Holland, and Portugal, and the United States. The story went that this paper was meant for the loyal members of the army and navy of Japan, but it got out to non-fanatics who threatened to publish it. And the result was that Tanaka was disgraced, and committed suicide (he did commit suicide, but we don't really know the reason). Historians are mostly skeptical about the truth regarding this document, though a few still insist it was a blueprint for Japanese expansion and aggression. In actuality, given the paucity of needed natural resources in Japan, aggression against neighbors like China, Korea, Russia, Indonesia, the Philippines makes sense without the need for a formal document stating their need to expand. But the story spread, and given the anti-Japanese mood of the Americans in 1945 a film based on the publication of the document was inevitable. Because several figures in the film (John Emery as Tanaka, and Marvin Miller as the head of the Tokyo Police Department) are occidentals performing as Japanese there is a feeling that the the film is racist. Actually it isn't - in fact it is rather the reverse. In 1945 it was rare to have a film where Germans (aside from refugees, who were probably Jewish) were good people. An exception is that marvelous Spencer Tracy movie THE SEVENTH CROSS. As the country that had sent the surprise attack on Pearl Harbor, and caused the Bataan Death March, it was even harder to be friendly to Japan. But this films reminds us that Tanaka and those fanatics were not all the Japanese. Many opposed the militarists, and tried to keep their nation in line with the U.S. and Britain (one of the moderates, by the way, was Admiral Yamamoto, who knew how powerful the U.S. was having been military attaché in Washington - ironically in this film he is painted as a vicious militarist planning to attend the surrender of the United States in the White House). Unfortunately the militarists used political assassination throughout the late 1920s and 1930s to force the politicians into silence or acquiescence to their aggressive policies. Few Americans realized this, especially after the anger that arose after December 7, 1941. James Cagney was remarkable for his willingness to be different in choosing material for his films and for doing odd bits in them. He did mostly melodramas, but he varied them with Shakespeare (his Bottom in A MIDSUMMER NIGHT'S DREAM), westerns (THE OKLAHOMA KID), musicals (FOOTLIGHT PARADE, YANKEE DOODLE DANDY - his Oscar winning part), and comedies (THE BRIDE CAME C.O.D.). In the film TAXI (a melodrama about a gang trying to dominate the taxi industry in New York City) Cagney added a gag scene where he talked fluent Yiddish to a Jewish passenger. Imagine Bogart or even the Jewish Edward G. Robinson doing that - only Cagney could get away with it. In an independent film musical he made in the 1930s, SOMETHING TO SING ABOUT, Cagney had several scenes with Philip Ahn playing Ito, his valet. When he first shows up (Ahn has been hired for Cagney, sight unseen) he speaks a pidgin English. But as soon as Cagney shows he is a realist, Ahn thanks him for allowing him to speak like a normal person (Ahn is a college graduate). It may have been the first time an Asiatic was played as an intelligent (and non-belligerent) human being. Similarly here Cagney (and his brother William, who produced his films and helped choose his properties) are fair to the bulk of the Japanese, who were normal people like ours. He paints the militarists as foolish villains, but he reminds us that they were only more unscrupulous and better organized. With a little bit of real luck they might have been kept under control. Tragically they weren't.",
         "Jimmy Cagney is like a firecracker in this movie, set in pre-WWII Japan. In some ways it's a cross between Casablanca and The Maltese Falcon and sometimes it's silly (e.g., white actors in Japanese makeup), but it's one of the most entertaining movies of its era. It reminds you how much of a talent James Cagney was - he carries the picture. There are also excellent character performances by Wallace Ford and Porter Hall. Even Sylvia Sidney as an unconvincing half-Chinese vixen has some good moments. Beware of the DVD, however - the audio is mixed so badly that at times you'll have to put your ear up against the TV to hear the dialogue.",
         "Nicely done war thriller with Cagney as a suave but pugnacious newspaper reporter in Japan who comes into possession of secret war plans. The plans are the work of a fascist Baron Tanaka who pushes the war agenda for the right-wing militarists over the objections of those opposed to war. The characters are interesting, and while many are static yet well-played, quite a few others are nicely fleshed out and grow during the plot. Cagney, some of the newspapermen and the female spy have some plot movement to develop their characters with. Even the villains, who could easily be cardboard, are well-played and exhibit human motivation. Obviously this is not a documentary, but it's also not pure melodrama either. Perhaps the most visually interesting areas of the film are the contrasts between beautiful, high-class modernist settings, a representation of more traditional Japanese architecture, and gritty realistically-dressed street scenes. All the more interesting that the good production and pretty sets were created in Hollywood backlots in 1945 during the war. While this is not a huge film, the production design is as good as anything from the golden age. There is a lot of eye-candy in the set design, tastefully filmed and a treat to view. The politics and cultural sensitivities of the film are also fascinating and far more balanced and subtle than other reviewers seem to indicate here. Cagney's character is well-immersed in Japanese culture and aware of the social issues of the time. He speaks Japanese, in addition to Chinese, and is a highly-skilled Judo aficionado. The film portrays Japanese opponents of the war as well-meaning but fairly easily countered by ruthless militarists and their secret police which is likely generally accurate. Surely similar struggles played out in Nazi Germany and Fascist Italy, along with Stalinist Russia, Mao's China and other 20th century totalitarian dictatorships both right and left. This film is not anti-Japanese; it's anti-Fascist. Those who claim to be unaware of the difference would imply that Japanese are Fascists. That would be unfortunately ignorant.",
         "While the entire world watched the early success of the German book ¨Mein Kampf¨ by Adolph Hitler, few were aware of the existence of an Oriental Hitler...Baron Giichi Tanaka ,he was a true life a bad guy who united with rich proprietaries and war lords to further his own ends. His plan of world conquest and dominance depended upon secrecy for success.This story deals with its first exposure by an American newspaperman(James Cagney) in Tokyo. Thus Cagney publishes in a newspaper ¨Tokyo Chronicle¨ that Tanaka plans attack on United States and China is the first victim of Premier Tanaka's plan for military conquest,revealing the existence of a document blueprint.Besides the marriage Mr. and Mrs. Miller(Wallace Ford and Rosemary DeCamp)have been murdered and Cagney will investigate it .Meanwhile he falls in love a charming double spy(Sylvia Sidney) . The picture combines intrigue,action,violence,noir cinema ,historic background and arts martial fights, being the first American film in what there are arts martial(Judo) struggles.Plus appear noted historical personages whom will intervene for second war world as colonel Tojo(Robert Amstrong),emperor Hiro Hito,Yamada(Martin Milner) and Tanaka(John Emery).Magnificent Music Score with Oriental sounds by classic Miklos Rozsa.The film won Oscar to the best Art Direction and Interior decoration and was produced by Cagney Production. The motion picture is finely directed by Frank Lloyd who realized excellent movies(Mutiny of the Bounty,If I were King,Under two flags). Rating : Good and entertained.",
         "Blood on the Sun is a fairly good World War II espionage thriller set in imperial Japan. There is a fair amount of intrigue and suspense and Cagney carries the picture on the strength of his patriotic conviction, charisma, and judo. His love interest is also written and performed well in the style of the film noir heroine. The villains though of the stock variety are nonetheless a welcome change from the gangsters usually seen in such pictures. Modern audience may perceive the film as being politically incorrect especially since key Japanese roles were played by American and British actors. Still the film is an entertaining and even educational experience, 7/10.",
         "I must admit at the outset that Jimmy Cagney is not my favourite Hollywood personality, though I did enjoy this movie. (I just can't help thinking that he's going to break out into \"Yankee Doodle\" any minute). I thought this to be an interesting drama, with a bit of action (thought the martial arts scenes left a lot to be desired) and good performances by the leads. The story was great and that alone was enough to keep me interested all the way through. It seemed to be trying to be \"noir\" by having most of the elements of a true noir there, but as a whole I wouldn't classify it as such. Worth a look. The DVD copy I bought is excellent, a really clear copy with great sound.",
         "Entertaining Anti-Japanese drama centering on James Cagney as an American editor in 1930's Japan involved in breaking the Japanese plot to invade China and bomb the United States. This film is interesting in that it fairly represents the anti-Japanese sentiment going on in the US since Pearl Harbor. Cagney, as always, is solid in this character as well as the other principals. As usual, the lead Japanese characters are played by Caucasian actors as was the custom of the times. Good Judo sequence for Cagney fans..",
         "One point is made repeatedly in this film--the fascist government which ruled Japan was extreme in both concept and execution. James Cagney, as reporter Nick Condon, fights against fascism in this movie and he fought against injustice in so many other films. In a way, this film is another gangster movie, somewhat like the gangster movies of the 1930s, but, too, the story has to do with much more that simple violations of law for the gangsters are in the Japanese Imperial Government. Cagney seems willing to take on the whole Imperial concept of Japanese rule which began prior to World War Two. His efforts are not anti-Japanese but anti-Facist. In fact, the movie could have been made about Hitler's Nazism and the story would have been about the same. One finds Cagney as the tough guy confronting bumbling police and meeting with mysterious women. He even maintains the newspaper tradition relative to the constant drinking of alcohol. Yet, the film transcends the mundane because of the importance of the struggle during the war years, years which follow the movie's time frame. It's vintage Cagney, well worthwhile.",
         "This is a bit of a crazy movie, not the type of thing that really holds up on its own after the propaganda value has passed the way \"Casablanca\" and a few of the other early 40s topical films do (Fritz Lang's \"Hangmen Also Die\" comes to mind as well). James Cagney is the undoubted star of the film, playing an American news editor in pre-war Tokyo with an unhealthy lack of restraint where issues of Japanese militarism come into play. There is a certain document which proposes a Japanese plan for \"world domination\" that was supposedly written by a certain Tanaka (John Emery), who the crawl at the beginning of the movie informs us was the \"Japanese Hitler.\" There is also a beautiful part-Chinese woman played by Sylvia Sidney, who is a double agent working for China against Japanese interests. It's hard to take a movie seriously where James Cagney is supposed to be a Judo expert, and he beats up a guy who is 2 feet taller than he is. It's one of those very predictable movies where just because there is this really tall guy who talks at one point about Cagney's Judo skills, you know with 99.9999% certainty that the movie will not end before they tussle. It's a bit like Edward Dmytryk's \"Behind the Rising Sun\" where Robert Ryan beats up a karate expert with his boxing skills. This is just sort of silly jingoism/propaganda stuck in the movie to get audiences hootin' and hollerin'. Definitely worked in 1945, but it all feels a bit silly now considering that Cagney's only Judo move is to throw a guy over his shoulder. It's not a wretched, awful movie; it does take time like most propaganda movies to remind us that there are at least some Japanese who aren't crazed killing maniacs. Well, the one Japanese guy who helps them happens to have a beard and wear very Western-looking clothing, but at least it's something. The entire plot is telegraphed miles in advance. There is very little dramatic resonance. Basically I believe this film will be of interest mostly to hardcore Cagney fans and people who appreciate unintentional humor from seeing old propaganda and mediocre cross-racial performances.",
         "Not Cagney's best but still interesting enough to watch. The goof or error is that the Tanaka plan, which the story is about and has the Baron Tanaka in the movie is off historically. Cagney dates the time when he says to Slyvia Sidney, \" left the US in 1921, spent 2 years somewhere and 10 years in China\" That total would make the current time in the movie 1933! Baron Tanaka, died in 1929! The director should have caught this historical error! Although this is not the best movie and revues are not the best, it was Slyvia Sydney's last leading role and for movie buffs it is worth seeing. Overlook the terrible and obviously staged fight scenes and the political errors of the time based on what we know today and you can enjoy it. For movie buffs I think it is worth viewing."
      ],
      "genres": [
         "Drama",
         "Romance",
         "Thriller",
         "War"
      ],
      "productionCompanies": ["William Cagney Productions"],
      "summaries": [
         "Nick Condon is a newspaper reporter working in Tokyo who refuses to toe the Japanese line on the expansionist policies of the anti-democratic Imperialist government. When it becomes clear to the authorities that Condon isn't going to cooperate and that he has some valuable information and contacts, they decide to get him in their clutches for some interrogations and then dispose of him.",
         "A dedicated American reporter in 1930's Japan, is determined to expose that government's plan for world domination."
      ],
      "budget": 0
   },
   "movielensId": 3154,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1945-04-26",
      "dvdReleaseDate": "2001-07-03",
      "directors": ["Frank Lloyd"],
      "runtime": 93,
      "movieId": 3154,
      "title": "Blood on the Sun",
      "mpaa": "",
      "actors": [
         "James Cagney",
         "Sylvia Sidney",
         "Porter Hall",
         "John Emery",
         "Robert Armstrong",
         "Wallace Ford",
         "Rosemary DeCamp",
         "John Halloran",
         "Leonard Strong",
         "James Bell",
         "Marvin Miller",
         "Rhys Williams",
         "Frank Puglia",
         "Grace Lem"
      ],
      "imdbMovieId": "0037547",
      "originalTitle": "Blood on the Sun",
      "genres": [
         "Action",
         "Drama",
         "War"
      ],
      "youtubeTrailerIds": ["gCSoCGlRFvs"],
      "plotSummary": "Nick Condon, an American journalist in 1945 Tokyo, publishes the Japanese master plan for world domination. Reaction from the understandably upset Japanese provides the action, but this is overshadowed by the propaganda of the time.",
      "tmdbMovieId": 75888,
      "avgRating": 3.31132,
      "releaseYear": "1945",
      "numRatings": 53,
      "posterPath": "/43WkbXQJeeIpmghkHNSzDonlqq.jpg"
   }
}