{
   "tmdb": {
      "original_language": "zh",
      "keywords": [
         {
            "name": "china",
            "id": 478
         },
         {
            "name": "assassin",
            "id": 782
         },
         {
            "name": "kingdom",
            "id": 4152
         },
         {
            "name": "occupying power",
            "id": 4691
         },
         {
            "name": "governance",
            "id": 6088
         },
         {
            "name": "concubine",
            "id": 8754
         }
      ],
      "imdb_id": "tt0162866",
      "video": false,
      "title": "The Emperor and the Assassin",
      "recommendations": [
         45043,
         105703,
         47694,
         44837,
         99600,
         88811,
         49559,
         38099,
         28171,
         19275,
         46986,
         65335,
         36353,
         65852,
         15699,
         36046,
         152640,
         24909,
         55123,
         2805
      ],
      "backdrop_path": "/wYH2I92471gI9LgjUnD67yYXujU.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Lady Zhao",
               "gender": 1,
               "credit_id": "52fe43649251416c7500e8fb",
               "name": "Gong Li",
               "profile_path": "/dgGWKMAP5vbgACkXTazZXt3JQoT.jpg",
               "id": 643,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Jing Ke",
               "gender": 2,
               "credit_id": "52fe43649251416c7500e8ff",
               "name": "Zhang Fengyi",
               "profile_path": "/4CQmKbA8fdjngOrKBbjhHhm3dTQ.jpg",
               "id": 65277,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Dan, Prince of Yan",
               "gender": 0,
               "credit_id": "52fe43649251416c7500e903",
               "name": "Sun Zhou",
               "profile_path": "/uCGTIJ8JYj4RC3xr3y9B4QBHZT3.jpg",
               "id": 65278,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "General Fan Yuqi",
               "gender": 0,
               "credit_id": "52fe43649251416c7500e907",
               "name": "Xiaohe Lü",
               "profile_path": null,
               "id": 65279,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "Marquis Changxin",
               "gender": 0,
               "credit_id": "52fe43649251416c7500e929",
               "name": "Wang Zhi-Wen",
               "profile_path": "/eSkabnJRA8BfhTeCJCf7NCGrU20.jpg",
               "id": 109435,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Lu Buwei",
               "gender": 2,
               "credit_id": "52fe43649251416c7500e92d",
               "name": "Chen Kaige",
               "profile_path": "/ApkE9y5x9hCYz1XfDZ1Tqz37LH5.jpg",
               "id": 20640,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Queen Mother",
               "gender": 1,
               "credit_id": "52fe43649251416c7500e931",
               "name": "Yongfei Gu",
               "profile_path": "/7wMlgFNxhBZiTirhLqLSYVRJ0d3.jpg",
               "id": 551529,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Gao Jianli",
               "gender": 0,
               "credit_id": "52fe43649251416c7500e935",
               "name": "Zhao Benshan",
               "profile_path": "/cVdZj8vr7rivIFBQuJAO6qGB2iD.jpg",
               "id": 131514,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Qin Wuyang",
               "gender": 0,
               "credit_id": "52fe43649251416c7500e939",
               "name": "Haifeng Ding",
               "profile_path": null,
               "id": 551530,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Prison Official",
               "gender": 2,
               "credit_id": "52fe43649251416c7500e93d",
               "name": "Pan Chang-Jiang",
               "profile_path": "/h8TnHTT6fhvkdQrbzwYy8Hwp3kf.jpg",
               "id": 551531,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Blind Girl",
               "gender": 1,
               "credit_id": "52fe43649251416c7500e941",
               "name": "Zhou Xun",
               "profile_path": "/hIOJS7EX6qBormh7Q6KNmtBlWlC.jpg",
               "id": 71057,
               "order": 10
            },
            {
               "cast_id": 23,
               "character": "Ying Zheng",
               "gender": 0,
               "credit_id": "52fe43649251416c7500e945",
               "name": "Li Xuejian",
               "profile_path": "/ramX1jQg0oFmxkQDE790EOY2irj.jpg",
               "id": 143358,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe43649251416c7500e90d",
               "name": "Jiping Zhao",
               "profile_path": null,
               "id": 65285,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe43649251416c7500e913",
               "name": "Xinxia Zhou",
               "profile_path": null,
               "id": 65289,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe43649251416c7500e919",
               "name": "Chen Kaige",
               "profile_path": "/ApkE9y5x9hCYz1XfDZ1Tqz37LH5.jpg",
               "id": 20640,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe43649251416c7500e925",
               "name": "Han Sanping",
               "profile_path": "/fOEIOgkq0Sfcjkgm984FbPFaUt3.jpg",
               "id": 20638,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "58960899c3a36808a500c324",
               "name": "Zhao Fei",
               "profile_path": null,
               "id": 28001,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "History",
            "id": 36
         }
      ],
      "popularity": 2.628714,
      "production_countries": [
         {
            "iso_3166_1": "CN",
            "name": "China"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "JP",
            "name": "Japan"
         }
      ],
      "id": 10387,
      "vote_count": 26,
      "budget": 0,
      "overview": "In pre-unified China, the King of Qin sends his concubine to a rival kingdom to produce an assassin for a political plot, but as the king's cruelty mounts she finds her loyalty faltering.",
      "similar": [
         787,
         186,
         101,
         1538,
         11645,
         9837,
         10473,
         1494,
         6637,
         810,
         27582,
         1948,
         657,
         667,
         682,
         390043,
         156022,
         121856,
         249070,
         1620
      ],
      "original_title": "荊軻刺秦王",
      "runtime": 162,
      "poster_path": "/ly1C2GApAy1d3c0XMAcZ3EMuv8r.jpg",
      "spoken_languages": [{
         "name": "普通话",
         "iso_639_1": "zh"
      }],
      "production_companies": [],
      "release_date": "1998-10-08",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "China",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Kaige Chen"],
      "runtime": 162,
      "synopsis": null,
      "writers": [
         "Kaige Chen",
         "Peigong Wang"
      ],
      "originalLanguage": "Mandarin",
      "imdbLink": "http://www.imdb.com/title/tt0162866/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNjc4MDA0MTY1MF5BMl5BanBnXkFtZTYwOTM4MTY5._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Li Gong, Fengyi Zhang, Zhou Sun | See full cast and crew »"],
      "reviews": [
         "I've read some grumbles about the court scenes. These people betray their ignorance. This production went to simply amazing lengths to recreate all aspects of the period in which the story occurred. Courtly manners are something few people outside the court ever see. While the acting may appear highly stylized, it is, in fact, as close a replication as possible of the behavior of individuals in their particular stations as the director could create. The actor's facial expressions are a marvel, particularly the duplicitous Marquis Changxin and the King's mother. There are, of course, reflections of both Greek and Shakespearian tragedy in the relationship between the king, his parents and his love. The juxtaposition of the king transforming from good to bad and the assassin from bad to good provides much food for thought on the evolution of an individual's nature. This movie would provide much to ponder in a college course on the humanities. At the same time, it almost rushes along, even in the slowest scenes heading towards an inexorable denouement. One suspects the involvement of large portions of the troop movements, which were quite awesome. It makes The Lord of the Rings battle scenes pale by comparison. Few directors have the ability to literally field thousands of humans on the field of battle just for art's sake. I recall one scene in which at least 30,000 troops can be seen moving across a huge plain. The logistics for such a shot would have been staggering. I could go on... but simply, I can't recommend this film highly enough.",
         "I will admit my ignorance of this film's existence, until I saw it advertised on a cable outlet. I was very impressed with the novelistic structure of the film. The film, which is in a language I do not understand, shone with intelligence and nuance for me. I think this speaks to the film's quality. It was visually stunning. The acting was visually entrancing. The Chinese theater traditions of movement, used to enhance the delivery of dialogue, is so compelling after watching Western film, where actors traditionally focus more heavily on the dialogue. The action in this film comes right at you, without a lot of explosions to get your attention. It is human action that is so affective here. The added advantage that the film taught me history about one of the world's greatest tourist attractions, the funereal clay army of China's First Qin Emporer, was very impressive. It seemed to give the film an international relevance beyond the film's great ethical themes. This is a film I can comfortably recommend to a wide variety of friends and acquaintances.",
         "This is an epic film about the unification of the ancient kingdoms of China in the third century BC. What makes it interesting is the tragic downfall of the king and all the palace intrigue going on around him. It reminded me a bit of \"King Lear\" and some of the other Shakespeare plays. The king starts out with noble ambitions, to unify the kingdoms under one ruler and to stop all the quarrelling so that the people can prosper and lead better lives. He and his childhood sweetheart, played beautifully by Li Gong, concoct a scheme whereby she pretends to go into exile in a rival kingdom in order to recruit an assassin to kill the king, thus giving him a pretext to go to war. But while she's away, the king becomes sadistic in his lust for power and goes on a killing spree. There are numerous side plots that keep the action going. There is the Marquis, who pretends to be stupid and foppish but who's really very clever and wants to become king himself. He fathers two children with the king's mother and manages to keep it secret for years. Then there is the Prime Minister, a political rival to the king, who turns out to really be his father. The assassin is a complex character himself. An adept swordsman and killer, he is undergoing a reformation when the king's lover comes to recruit him. He wants nothing more with killing, but is eventually won over by Li Gong (who wouldn't be?) when he sees how cruel and vicious the king has become. Some spectacular cinematography, especially the battle scenes that are carried out on a grand scale - like they used to say, a cast of thousands, literally. The acting is OK, nothing special. It's the story that's interesting, though at over two and a half hours, it pushes the limit. Definitely worth viewing.",
         "This three-hour Chinese epic, set in 220 B.C., may ultimately amount to a familiar theme of an Emperor's idealistic dream of peace through unification mutating into corrupted isolation, and there's nothing inherently challenging about the film, but it's a compelling narrative, crammed with intrigue and passion and betrayal and epic events told in vivid strokes. Even for those not drawn to such historical spectacles for their own sake, it's an astonishing feast for the eyes: the scene depicting the coup attempt of the Marquis is one of the most staggering evocations of physical space and grandeur in memory, and the battle scenes are memorable both in their scope and their immediacy. The title sums up the film's use of compelling contrasts - huge plainland vistas set against intimate horrors; the noblest of motives set against the most degraded; hope turning to dust. If you've never seen a three-hour Chinese epic, this wouldn't be a bad place to start.",
         "After seeing dressed up action films, like the two mentioned above, Emperor and the Assassin was a godsend. This film was such a marvelous blend of action, intrigue, and personality, and I'm sure I'll see it again and again in years to come. Some of the complaints about the movie have been the golden/brown tint and the quick, disorienting editing. However, I loved both of these qualities in the movie, though the editing did take some time to get used to. A great example of it, is when we're introduced to Jing Ke, the assassin. He is offered an assignment for five thousand, and we see a close up of his face as he demands ten thousand. The next shot shows him with sword drawn, in the house of his victims. That whole introduction to the assassin was marvelously edited, in my opinion. You have to realize that in order to fit the epic plot into just under three hours, a lot of tiny details needed to be cut out. The quick editing also makes the movie seem much shorter than it really is. Someone said that the swordfighting in the movie (what little of it there was) seemed like high school drama, but I strongly disagree. Most of the action is captured in a few shots, making it seem much more realistic. In so many american films, we see a a flash of a dozen close ups, without getting a feel for what is even happening! Also, the constant use of slow motion in many movies gets so old. By having the fighting in this movie fast and furious, it is much more affecting. I won't give away the ending, but it was really suspenseful and surprising. I had no idea what would happen (being unfamiliar with Chinese history helped), and was on the edge of my seat! So, to conclude, if you like sweeping historical epics, make sure to see this! I really like the films of Kurosawa, and saw some similarities here, so also if you like his movies, see this!!",
         "After watching the movie a few times, I found so many subtle touches and emotions within the dialogue. Jing Ke, the Assassin has become one of favorite movie characters of all time. This fine Chinese actor says more with his eyes and his economy of words and movements then any big screen American actor today. Qin, the Emperor, is brilliant as he leads the audience to believe the kindness in his heart, only to unleash the most cruel acts upon the people around him. The promises he makes with incredible passion and shattered with an evil fist. Gong Li, as in just about every movie I've ever seen her in, is simply fantastic. Her screen dominance is so graceful and emotionally charged. In case you couldn't tell, I loved this movie.",
         "This is an excellent film. No, it's not Mel Gibson in \"Braveheart,\" but then, it's not trying to be. Actually, \"The Emperor and the Assassin\" probably has (thankfully) more in common with a Shakespearean production than a Hollywood blockbuster. In the third century BC, the King of Qin is attempting to unite (in other words \"conquer\") the seven kingdoms of China. He has already overthrown the Kingdom of Han. Now he needs an excuse to invade the Kingdom of Yan. This is where the Lady Zhao comes in. She and the King have been friends since childhood. They are obviously very much in love, but cannot marry for political reasons. Together they devise a plot. She will pretend to have fallen into disfavor with the King and escape to Yan. Once there she will convince the Prince of Yan to send an assassin back to kill the King. When the assassination fails, the King will have his excuse to invade Yan. Once in Yan, however, Lady Zhao begins to reconsider. Hearing and seeing more and more examples of her old childhood friend's ruthlessness, she begins to wonder if the King may need to be assassinated for real. One sure sign that you're not watching a Hollywood production is the final encounter between the King and the assassin. Unlike a Hollywood movie where the hero and villain are clearly defined and the final outcome already predetermined, this is a fight that could truly go either way. This is a well crafted and well acted story of a tumultuous time in Chinese history. There is a mixture of both incredible beauty and incredible ugliness. Most beautiful of all, however, is Gong Li as the Lady Zhao. I grow more and more convinced every time I see her that Gong Li is the most beautiful woman in the world. I must say, however, that she does have one unintentionally funny line in this film. Early on Gong Li asks one of her servants \"Do I have a beautiful face?\" Duh!!!",
         "Based on the actual event , this epic, is set in the year 221 B.C and tells the true story of the unification of China. Action packed and filled with intrigue, passion, betrayals and unforgettable battle sequences, it held my attention throughout in spite of its 160 minute length. The king, Ying Zeng, played by Li Xuejian is obsessed with unifying the seven kingdoms of China and becoming its first Emperor. His lover, Lady Zhao, played by the beautiful actress Gong Li, devises a plot whereby she will travel to the neighboring kingdom of Yan to set a fake assassination plot in motion which will give the king an excuse to invade Yan. However, she falls in love with the assassin as the king becomes more and more ruthless. There are subplots, and tragedy and constant high drama. There are scenes of great beauty and of abject cruelty. There is great cinematography and brilliant use of physical space. The deep characterization made me think of Shakespeare. And tragic events that call to mind Greek drama. And yet it is totally Chinese as it deals with age-old questions of whether the ends justify the means. And raises the questions dealing with life and death and good and evil and all the blurred edges in between. It is the story of individuals against the backdrop of history, a history that has shaped China for the past two thousand years. I was swept up in the story as well as the moral questions raised. There are no easy answers and this was one of the strengths of the movie. Recommended. But be prepared for the violence and gore.",
         "For a feature film, the plot closely follows history--or at least historical gossip. But then the Chinese, who know the story very well from seeing it portrayed again and again, would never tolerate it otherwise. The attention to detail is wonderful, especially for anyone who has read Sima Qian's account in the Records of the Historian. Jing Ke, according to Sima Qian, did indeed make an attempt on Qin Shi Huang's life at the request of the Crown Prince of Yan before unification. Sima Qian explicitly mentions both the head of General Fan and the dagger rolled up into the map, as well as the dagger being thrown into the brass column. Although Jing Ke is described as no stranger to swordplay, he's hardly the invincible warrior portrayed by Chen Kaige. Jing Ke is indeed this film's weakest link. In reality (again, according to Sima Qian), he was a heavy drinker and put off his visit to Qin for as long as possible, spending a good deal of time with the ladies of Yan before the crown prince finally ordered him on his way. He was, in short, a human being and was not looking forward to death although he was willing to accept it. Chen Kaige's Jing Ke is afraid of death, but not his own. He is the classic ruthless killer turned disillusioned pacifist. His love (or maybe just affection) for a woman and pity for several hundred children whom Zheng had buried alive (not even two thousand years of hostile Confucian historians claimed Qin Shi Huang did this, although there is a legend about him burying 460 Confucians up to their necks and then beheading them)is enough to make this former assassin kill again. The melodrama is not convincing and the character ends up being just plain boring. The acting here isn't shabby, though not very interesting given the character. As for Lady Zhou, in all the numerous stories I've heard about Qin Shi Huang, she's never come up. Anyway, Gong Li is famous enough for Americans to have heard of her (thanks to Zhang Yimou) and there needed to be a love interest, so here she is. It's unfortunate that her performance is almost as wooden as Jing Ke's character. She's done much better (in Qiu Ju for example) at being subtle; here she just barely manages presence. But all of this is trivial compared to the extraordinary acting of Li Xuejian as Zheng himself. Qin Shi Huang is for the Chinese rather what Milton's Satan is for us: accepted as a villain, but a noble one. Qin Shi Huang's accomplishments radiate an awe all the way across two thousand years into the present and Li captures his frightening will without compromising his humanity. Li's performance is enough, but the scope of the film is grand although the photography is purposely drab. It does feel ancient. The score is adequate, scarcely moving though very appropriate to the action. Though I've only seen it once, I believe that Chen Kaige should be given more credit for his camera work than other reviewers have allowed him. The opening credits are exhilarating. If five stars its absolutely average, I given three more for Li Xuejian's acting and Chen Kaige as an actor, writer, and director.",
         "The Emperor and the Assassin (w/English Subtitles) at 161 minutes is long, but the time is packed with a story that barely fits into it. Golden hued palace scenes and dusty yellow panoramas of Chinese landscapes background a true story of China's unifying King, circa 300 BCE. An intricate plot with a myriad twists and turns is played out with excellent portrayals by the cast. King Qin's simple wish for a unified Empire for his common people is fulfilled, but not without treachery, plots and counter plots and oh yes, bodies. Lots of bodies. This epic story of China's beginnings is a great way for Westerners to glimpse little known Asian history. Emperor Qin's legacies include the thousands of life-size terra-cotta figures which are still being excavated today. As an historical person, this film makes it clear that Emperor Qin should be regarded along with George Washington, Napoleon Bonaparte, Alexander the Great, Genghis Khan and Julius Caesar, to name a few of the world's greatest conquerors/statesmen. I highly recommend seeing The Emperor and the Assassin, especially on the big screen."
      ],
      "genres": [
         "Drama",
         "History"
      ],
      "productionCompanies": [
         "Shin Corporation",
         "Canal+",
         "New Wave Company"
      ],
      "summaries": [
         "In the 3rd Century BC, Ying Zheng, heir to the Kingdom of Qin, seeks to dominate the remaining six Chinese kingdoms. Ying's strategy is to seem invincible. Ying sends his concubine Zhao to the Han Kingdom as a spy, to enlist an assassin he can conquer. Zhao persuades Jing Ke, but falls in love.",
         "In pre-unified China, the King of Qin sends his concubine to a rival kingdom to produce an assassin for a political plot, but as the king's cruelty mounts she finds her loyalty faltering."
      ],
      "budget": 0
   },
   "movielensId": 3158,
   "movielens": {
      "languages": ["普通话"],
      "releaseDate": "1998-10-08",
      "dvdReleaseDate": "2000-06-13",
      "directors": ["Chen Kaige"],
      "runtime": 162,
      "movieId": 3158,
      "title": "The Emperor and the Assassin",
      "mpaa": null,
      "actors": [
         "Gong Li",
         "Zhang Fengyi",
         "Sun Zhou",
         "Xiaohe Lü",
         "Wang Zhi-Wen",
         "Chen Kaige",
         "Yongfei Gu",
         "Zhao Benshan",
         "Haifeng Ding",
         "Pan Chang-Jiang",
         "Zhou Xun",
         "Li Xuejian"
      ],
      "imdbMovieId": "0162866",
      "originalTitle": "荊軻刺秦王",
      "genres": [
         "Drama",
         "History"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "In pre-unified China, the King of Qin sends his concubine to a rival kingdom to produce an assassin for a political plot, but as the king's cruelty mounts she finds her loyalty faltering.",
      "tmdbMovieId": 10387,
      "avgRating": 3.62056,
      "releaseYear": "1998",
      "numRatings": 394,
      "posterPath": "/ly1C2GApAy1d3c0XMAcZ3EMuv8r.jpg"
   }
}