{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "friends",
            "id": 9713
         },
         {
            "name": "sexual confusion",
            "id": 156930
         }
      ],
      "imdb_id": "tt0066892",
      "video": false,
      "title": "Carnal Knowledge",
      "recommendations": [
         42719,
         26686,
         50011,
         14441,
         87235,
         18262,
         38724,
         102634,
         38772,
         22176,
         40973,
         75641,
         84278,
         37258,
         26817,
         26520,
         54302,
         53229,
         31064,
         21950
      ],
      "backdrop_path": "/heqDck28IZtgFA55cKsSXXA6Pbv.jpg",
      "revenue": 28623900,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jonathan",
               "gender": 2,
               "credit_id": "52fe45ed9251416c9104332f",
               "name": "Jack Nicholson",
               "profile_path": "/z5kVLyn3sxj0wNRlFgVgT6deeRO.jpg",
               "id": 514,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Susan",
               "gender": 1,
               "credit_id": "52fe45ed9251416c91043333",
               "name": "Candice Bergen",
               "profile_path": "/wzRihM7eZyCyAuKpgyBewCzDRWJ.jpg",
               "id": 11850,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Sandy",
               "gender": 2,
               "credit_id": "52fe45ed9251416c91043337",
               "name": "Art Garfunkel",
               "profile_path": "/kGbVVEfv7e0O4SjXebP7NfUHXon.jpg",
               "id": 64928,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Bobbie",
               "gender": 1,
               "credit_id": "52fe45ed9251416c9104333b",
               "name": "Ann-Margret",
               "profile_path": "/jx5lTaJ5VXZHYB52gaOTAZ9STZk.jpg",
               "id": 13567,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Louise",
               "gender": 1,
               "credit_id": "52fe45ed9251416c9104334b",
               "name": "Rita Moreno",
               "profile_path": "/cpu3QeMGvbkBLmrFy8dUxEP7zdd.jpg",
               "id": 13299,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Jennifer",
               "gender": 1,
               "credit_id": "52fe45ed9251416c9104334f",
               "name": "Carol Kane",
               "profile_path": "/tftY60jQYQBcpGjqAzKIiFNZV2J.jpg",
               "id": 10556,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Cindy",
               "gender": 0,
               "credit_id": "5490c391c3a368228300005f",
               "name": "Cynthia O'Neal",
               "profile_path": null,
               "id": 1400215,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Mama",
               "gender": 0,
               "credit_id": "54d3380fc3a3686abf002945",
               "name": "Sheri Jackson",
               "profile_path": null,
               "id": 1423321,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "56a93ce8c3a36872db001e2e",
               "name": "George R. Nelson",
               "profile_path": null,
               "id": 8339,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "52fe45ed9251416c91043341",
               "name": "Mike Nichols",
               "profile_path": "/eJgJEVil7iOJ9sTAXLCVRKfeKKM.jpg",
               "id": 5342,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45ed9251416c91043347",
               "name": "Jules Feiffer",
               "profile_path": null,
               "id": 69051,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5490c3b3c3a3682283000068",
               "name": "Mike Nichols",
               "profile_path": "/eJgJEVil7iOJ9sTAXLCVRKfeKKM.jpg",
               "id": 5342,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "56a93ca7c3a36872e1001e8f",
               "name": "Robert Luthardt",
               "profile_path": null,
               "id": 19778,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "569cf9459251415e64003fbd",
               "name": "Giuseppe Rotunno",
               "profile_path": null,
               "id": 15131,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "56a93cdc9251417db9001d86",
               "name": "Anthea Sylbert",
               "profile_path": null,
               "id": 12020,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "56a93d8cc3a36872db001e42",
               "name": "Meta Rebner",
               "profile_path": null,
               "id": 18376,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 2,
               "credit_id": "5ac2cc40c3a3682d33026f90",
               "name": "Sam O'Steen",
               "profile_path": null,
               "id": 12015,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 3.093532,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 36492,
      "vote_count": 43,
      "budget": 0,
      "overview": "The concurrent sexual lives of best friends Jonathan and Sandy are presented, those lives which are affected by the sexual mores of the time and their own temperament, especially in relation to the respective women who end up in their lives.",
      "similar": [
         28178,
         68718,
         397422,
         9382,
         44564,
         118051,
         14778,
         31299,
         440858,
         862,
         8839,
         13523,
         11356,
         44606,
         446257,
         21244,
         9986,
         207901,
         60713,
         18885
      ],
      "original_title": "Carnal Knowledge",
      "runtime": 98,
      "poster_path": "/rjXLiPokqTsAlXFROuWsMemqvVQ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "AVCO Embassy Pictures",
         "id": 494,
         "origin_country": ""
      }],
      "release_date": "1971-10-21",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "Everyone needs to be loved - sometime or another.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mike Nichols"],
      "runtime": 98,
      "synopsis": "At Amherst College in the late 1940s, freshmen roommates Jonathan and Sandy develop a friendly rivalry over their attempts at \"scoring\" on their dates with female students. The sexually aggressive Jonathan wants to be \"smothered and mothered\" by large breasts, while shy, romantic Sandy claims to value intelligence and sincerity. At a college party, Jonathan spots Smith College student Susan and, after summarily dismissing her breast size, encourages Sandy to approach her. Sandy's initial clumsy attempt leads to several dates with the intellectual and humorous Susan, which he then reports in detail to Jonathan. After Jonathan pushes him to \"feel her up\", Sandy persists in trying to touch Susan's breasts on a subsequent date, but Susan claims that she is not sexually attracted to him. Desperate, Sandy admits that she is the first girl that he has ever tried to touch in that way. Feeling sorry for Sandy, Susan allows him to touch her while she puts her hand on his penis. After Jonathan learns that Susan is more promiscuous than he had previously thought, he asks Susan to go out with him. While neither Jonathan nor Susan tells Sandy about the resulting romance, Sandy continues to tell about his dates with Susan, claiming that he has fallen in love because she appreciates his sensitivity and intellect. On his next date with Susan, Jonathan, jealous that Susan likes Sandy more than him, tries to win her sympathy by fabricating a story about his humble childhood which led him to want to become a socially conscious lawyer. Several dates later, Jonathan's ploy pays off and Susan agrees to have sex, but does not enjoy the act. Jonathan describes his dates with Susan to Sandy, but calls her \"Myrtle\" to keep their betrayal a secret. When Sandy learns that Jonathan has lost his virginity with \"Myrtle\", he tries to have sex with Susan, who at first refuses but finally relents. Months later, Sandy confesses to Jonathan that he is jealous of the fact that Jonathan lost his virginity before him and continues to have more adventuresome sex than he does. One night, when the three friends go out together, Susan dances with both men, enjoying Jonathan's suave demeanor and easy footwork more than Sandy's awkward attempts at intimacy on the dance floor. Later, Jonathan, angry that Susan has told Sandy that she feels so close to him she can read his thoughts, demands that Susan choose between the two men. When they both agree to break the affair soon after, Susan suggests that they can still be friends, but Jonathan coolly remarks, \"I hope not\". Days later in Sandy and Jonathan's dormitory room, Susan and Sandy playfully argue like a married couple over packing for a camping trip while Jonathan sullenly watches. Over ten years later, the two friends meet and discuss their lives. Jonathan, who is now a taxman, is still the consummate playboy and complains the assertive women are gold-digging castrators, and claims that he wants to settle down with someone \"if their figure is good enough\". Meanwhile Sandy, who has married Susan and started a family, is bored with their suburban life and jealous of Jonathan's sexual freedom. Soon after, Jonathan begins dating model Bobbie, whose revealing clothing displays her voluptuous figure. After several weeks of dating and passionate lovemaking with Jonathan, Bobbie suggests they move in together, but Jonathan rejects the proposal, suggesting that it will ruin their sex. Soon after, Jonathan confesses to Sandy that he was experiencing moments of impotence, but has been cured by his attraction to Bobbie's figure. After Bobbie moves in with him, Jonathan insists the she quit her job, promising to provide for her. Bobbie concedes in hopes of marrying Jonathan and having children, but he continues to adamantly resist the idea. At home with nothing to do, Bobbie becomes increasingly depressed, rarely leaving her bed and barely capable of warming television dinners for Jonathan. Lacking in any tenderness, Jonathan constantly berates and humiliates Bobbie, causing her to weep in despair. After Jonathan rages at Bobbie for having a more \"checkered\" sexual past than him and orders her to do something useful like housework, a desperate and sobbing Bobbie states that she cannot stand her life. One night, when Sandy and his sophisticated girlfriend, Cindy, are at Jonathan's apartment to pick them up for a party, Jonathan tells Sandy that Bobbie is too passive, while Sandy claims Cindy dominates him in the bedroom. After Jonathan urges Sandy to swap partners for the night, Sandy agrees and goes to the bedroom to find Bobbie. Jonathan then dances with Cindy, who refuses his advances, confidently explaining that she will sleep with him but only on her terms. When Cindy leaves after ordering Jonathan to tell Sandy that he should not bother returning home if he sleeps with Bobbie, Jonathan opens the bedroom door to find Bobbie passed out from an overdose and Sandy calling an ambulance. Even as he witnesses Bobbie's despair, Jonathan can only yell at the unconscious woman that their relationship is \"not going to work out\". In the 1970s, twenty years since their college days, the now jaded middle-aged friends are still far from understanding love in a committed relationship. Wealthy Jonathan complains about his alimony payments to his now ex-wife Bobbie and their child, while Sandy, desperate to recapture his youth, dates demure eighteen-year-old Jennifer, dresses in hippie attire, and espouses the \"free love\" of the new generation. When Sandy and Jennifer visit Jonathan, he presents a slide show of all his lovers, including a picture of Susan which he attempts to ignore, referring to them all as \"frigid ballbusters\", and paints increasingly degrading verbal portraits of each woman, upsetting Sandy and Jennifer. Later, Jonathan confesses to Sandy that he has only glimpsed the illusive nature of love through brief sexual encounters, while Sandy laments that when he finally falls in love with a woman and makes a commitment, his sexual interest in them dies. With his impotence increasing, Jonathan seeks out prostitute Louise, who obliges Jonathan's obsessive request that she perform a verbal ritual worshipping men's \"virile\" and \"domineering\" behavior and castigating women as manipulative and castrating. When Louise veers slightly from the script, an enraged Jonathan, whose libido has immediately faltered, demands that she repeat the lines verbatim to ensure his satisfaction.",
      "writers": ["Jules Feiffer"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0066892/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNDY2MTA1NTIyOF5BMl5BanBnXkFtZTcwNzM4MTEyMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Jack Nicholson, Candice Bergen, Ann-Margret | See full cast and crew »"],
      "reviews": [
         "Its a wry, often funny, often sombre drama about the sex lives of two college roommates, Jack Nicholson and Art Garfunkel (who's actually fine in this - much better than in Catch-22) - at college, and in middle age. There are really very few movies where the dialogue seems so true and searching, yet funny, that you hang on every word. I can only think of a few - and this is one of them. It is episodic, and may be broken into two halves - intentionally, importantly. The heart of the story is in the comparison of the first half and the second: how the two men have or have not changed. If you consider this is the purpose of the film, the two halves are not perfect - but nevertheless a fascinating film. Bitterness, nostalgia and melancholy run through this character comedy from the 70's. Its a frank, confronting (depending on the viewer) laying bare of sex. Though there is very little actual sex in the film, this one is definitely only for adults. A penetrating character study, and a richly worded film filled with wit, irony and character penetration by cartoonist Jules Feiffer. 9/10. Not perfect, but absolutely must-see.",
         "Mike Nichols directed Jules Feiffer's script of two men in their times with the opposite sexes, beginning with college years, then years later when they have occupations, and settling on middle age. Jack Nicholson creates one of his more complex characters here, which like About Schmidt or The King of Marvin Gardens, doesn't end up the happiest guy in town. His Jonathan is lusting, condescending, scared (deep inside), angry, and intelligent all at once, though never knowing himself well enough to know the one he's getting his rocks off with. On the flip-side his best friend Sandy (Art Garfunkel) is sensitive, unsure, though without a feeling of overt confidence and control like Jonathan has, and that feeling of confidence over the other sex is what keeps them together in discussion, and serves as a tinge in their friendship in their older age. In college, Sandy meets Susan (Candice Bergen), and is more of a friend at first, while Susan begins an affair she didn't intend on with Jonathan. This unfolds, and when they graduate and are out in the world Jonathan meets Bobbie (Ann Margaret) who is a pure vixen with, at the behest of Jonathan, is a louse and wanting a commitment Jonathan can't take. The last scene with Rita Moreno, and especially the last shot featuring an ice skater Jonathan saw once, say it all about his character- essentially, as it is with nearly all men, he wants what he can't have. Many of the angles and many of the one shots of faces for long stretches, the camera compositions and time length, etc, reminded me of techniques that director Ingmar Bergman used in his movies that dealt with relationships, men with women, and how the desperation in their personalities either become their downfall, or a life lesson later on. In a sense, Carnal Knowledge is Nichols' throwback to Bergman as was Interiors for Woody Allen, though his dealt with the strife in a family and Nichols is a character study dealing in love and sex. Never-the-less, non-art film goers shouldn't be scared off by the notion that Carnal Knowledge is bleak or sterile. It may not be the most cheerful, or an entirely fair to both sexes, but it is important in that it views Jonathan, Sandy, Susan, and Bonnie, as people, and Nichols doesn't force the viewer to judge these people if they don't want to. For its time it was groundbreaking, and today it's almost mature compared to the barrage of \"relationship\" movies of late. And, if anything, it should have mass appeal to devourers of film acting. Grade: A",
         "It's depressing to see what a low rating Carnal Knowledge gets. Jules Feiffer, the brilliant cartoonist, wrote an extraordinary script for this film. I loved the dialog so much I found the script on Alibris and read it immediately. This is a dark movie. Not that it's violent or bloody, but its take on men vs. women relationships is bleak, blunt, and accurate. Jack Nicholson is charismatic and smart in his role, showing the misery at the heart of a cynic. As others have written, it's not a kids' movie. It's not even a young adults' movie-- I was bored when I first saw it, at 21. It's an \"adult movie\" in the non-euphemistic sense of that phrase, an adult movie about the mortality of romance",
         "This movie is one of the most accurate reflections of the sixties' sexual revolution, as well as perennial sexual ambiguity throughout someone's entire adult existence! It's about knowing that there are no strings attached, and that it is, in fact, just sexual intercourse and nothing else!! All is fine and good except one thing....YOU GOT MARRIED!!!!...Now enters the commitment, or shall I say, lack of it...There is a cynical outlook on each other.....The verbal abuse that is the end result of a relationship that has nothing but sex to offer, serves as an acrimonious aftermath to everyone's insincerity!! Some people (Ann Margaret) give up in life....Some people (Art Garfunkel) get resentful and searching...And others (Such as Jack Nicholson) remain misunderstood even to himself!! The college day's fiasco with Candace Bergen (Between Jack Nicholson and Art Garfunkel) should have served as a harbinger of things to come!! Instead, the hedonistic challenge casual sex provided for everybody, not only made people oblivious to the negative emotional battleground casual sex had the potential for presenting, but it established a pattern of recklessness for everybody's self centered priorities!! The prestige of being a Central Park West intellectual evokes an aura of false confidence, and it is evident that New York City merely spreads out the welcome mat for adversity before most any place else!! All of these theatrics simply translate to callous gratification! This is a film where people talk to one another, but it doesn't work out......So they have sex, they know they will grow tired of it, but when this occurs, they can't accept it either!!! Popular scapegoats seem to be; confusion, idealistic notions which have turned to blatant misconceptions, a distasteful awakening with selfishness, and disgruntled generalizations that \"Women are all ball-busters!!\" (Not just independent!!) It becomes a living nightmare for all of the characters concerned to distinguish between casual sex, and apathetic hobby!!! All of them are isolated by the negative consequences of casual sex!!! Jack Nicholson's condescension from a sex surrogate (Rita Moreno) denounces meagerness, and thus, becomes a form of precarious vindication which will give the movie audience a thorough comprehension of the type of person Jack Nicholson's character is, and always will be too!! Mike Nichols is a fabulous director, and this film is compelling in it's ability to tell the truth!!! The camera angles in this movie are spectacular! This film is very controversial for the time it was made because it brought to the attention of the movie viewer that the erroneous perceptions about recreational sex, and the truth about recreational sex are about as compatible a mixture as oil and water!! Nobody in this movie had any compunction about throwing necessary caution to the wind! The depiction of such people in \"Carnal Knowledge\" was very astute! Above all else with regards to this film, recognize the amazing array of talent this movie possesses!!",
         "The plot begins with Jonathan (Jack Nicholson) and Sandy (Art Garfunkel) roommates in the university. Each one of them has a different behavior and experience with women: Jonathan is cynical, malicious, and selfish. He does not respect anybody (even his best friend is not respected) and just want to have sex. Women are objects for him. Sandy is almost the opposite of Jonathan and has a different approach with women: he is shy and respectful, he does not have much experience with women. These characteristics are presented in the film having Susan (the gorgeous Candice Bergen, the most beautiful actress of the 70's) as pivot. Then the story advances a few years and shows both of them successful in their professions and boring with their mates. The character of Susan (who married Sandy) is just occasionally mentioned and does not appear on the screen any more. Now, we see basically the relationship of Jonathan with Bobbie (the sexy Ann-Margret). Then, there is another jump in time and other relationship of Jonathan and Sandy are presented in this movie, since its essence is about relationship of men and woman having the focus mainly in Jonathan. In 1971, I was too young to watch this movie and certainly I would not understand most of the story. Only a couple of days ago I had the chance of seeing it. It is amazing how this movie for adults has not aged. Further, it does not look like an American movie. The camera, the screenplay, it does look like European movie (maybe a little of 'Jules and Jim'). All the actors and actresses have outstanding performance, but certainly Jack Nicholson and Ann-Margret are superb. My vote is seven. Title (Brazil): \"Ânsia de Amar\" (\"Eagerness for Love\") Note: On 18 January 2014, I saw this movie again.",
         "\"Carnal Knowledge\" (1971) directed by Mike Nichols with Jack Nicholson, Art Garfunkel, Candice Bergen, Ann-Margret in an Oscar nominated performance as a sex kitten who wants to marry Nicholson's Jonathan, and Carol Kane and Rita Moreno in the small roles is one of the movies that made 70s so memorable. It is also the movie that keeps reminding me why I love Jack Nicholson of his early years and how grand he was without his \"Jackness\" which he has developed during all these years. Sandy (Garfunkel) and Jonathan are two college friends and like every straight young (and not too young) man in the world they are obsessed by girls and move from one relationship to another in the course of almost thirty years. Nichols and Jules Feiffer who wrote the play and later adapted it for the screen let us look inside the minds and souls of two educated upper-middle class white males and to learn their very intimate thoughts and secrets concerning their plentiful dysfunctional and joyless affairs and it is not a pretty picture - \"Boys begin life not liking girls, later they don't change, they just get horny.\" The film is honest, uncomfortable, \"very slick, very clever\".",
         "The sexual adventures of Jonathan and Sandy. From college to mid-life crises, we see their attitude to the opposite sex and how their male organ leads them to lower depths. A fascinating script from Jules who isn't afraid to show how some men really are. Nichols' direction has the European flavor, allowing the stunning performances to take over with the help of Giuseppe Rotunno's unobtrusive photography. The amazing thing is that this film is still relevant to some of today's modern male species. The writer and director teamed up recently and made CLOSER, for today's generation. Watch the two movies back to back and you'd see the similarities in style and substance after thirty years.",
         "A talky, oddly stage-bound film (though it's not based on a stage play) that nevertheless exerts a kind of raw emotional tug on the viewer. Jack Nicholson and Art Garfunkel (yes, you read that correctly) begin as college chums on a never-ending hunt for female tail, and end the film as stifled adults, still filling their lives with emotionally empty physical affairs that do nothing to fill the yawning void of their boring existences. Sound depressing? It is, but it's also rather fascinating, due to a sharp script and excellent acting. This came out at a time when Jack Nicholson was actually playing characters in movies other than Jack Nicholson, and he does fine work here as the more virile and experienced of the two friends. Candice Bergen is also in fine form in a very dramatic role, a far cry from the comedic roles with which we've come to associate her. And Ann-Margret won a lot of acclaim (and the film's sole Oscar nomination) for her brief performance as the sex-pot basket case Bobbie, the target of Nicholson's emotional abuse. \"Carnal Knowledge\" is entertaining as an intellectual exercise, but it may leave you cold on a deeper, more emotional level, as no one, not even the women, are especially likable or sympathetic. It came out at a time in our cultural history when \"free love\" was in vogue, and seemed to suggest that the price people payed for indulging that urge was high and that people turned to casual sex more as an excuse for avoiding significant human contact than as a way to more fully enjoy living. Certainly these emotionally stunted characters seem no better off for all of their care-free indulgence in pleasure. In many ways, \"Carnal Knowledge\" seems to be the movie Mike Nichols' other 4-person relationship drama, \"Closer,\" wanted to be, and he would have been wise to approach the material in \"Closer\" in a similar way as the material here. The staginess in \"Carnal Knowledge\" works. These people seem to exist in a plane of existence just a fraction removed from the one in which the rest of us live. It's like they live in a vacuum where they're the only people who matter, an airless atmosphere that serves as a fitting backdrop for their selfish behavior. Probably not one of the more important films from this fertile period for film making, but worth checking out. Grade: B+",
         "Telling the sordid, often depressing story of two men and their sexual hangups over several decades, director Mike Nichols and writer Jules Fieffer concoct a thinking man's dirty movie. At times it's not easy to watch, but it's mostly entertaining and beautifully made. Jack Nicholson and Art Garfunkel are the men ---Nicholson is the callous, emotionally detached one, Garfunkel is the romantic. He marries college sweetheart Candice Bergen, while Nicholson shacks up with sexy Ann-Margret. The scenes with Nicholson and Ann-Margret are cringe-inducing. Nicholson, Garfunkel and Bergen are terrific and Nichol's clever casting of Ann-Margret, putting her sex kitten image through the blender, pays off in spades...she's the best thing in the movie. The supporting cast includes Carol Kane and Rita Moreno.",
         "Just like Nichols' later masterpiece Closer, Carnal Knowledge expertly deals with romances falling apart, coming back together and the study of lust and it's many complications. And just like Closer the dialogue and relationships in the film feel more authentic than virtually anything else I've ever seen. All of the arguments and especially the conversations between Jonathan and Sandy felt so natural, humorous and somewhat depressing. It evoked all of the emotions that lust in life does and perfectly demonstrates how rare true love and happiness is. The performances were all incredible and Ann-Margret more than deserved her nomination (the win in my opinion) but Jack Nicholson really shines above the rest of the cast. His realism, intensity and humor was top-notch to say the least. He also displays this internal pain that I can't even describe, but stunned me to my core. I felt like I could really relate to the character and that made his actions even more devastating to me."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["AVCO Embassy Pictures"],
      "summaries": [
         "The concurrent sexual lives of best friends Jonathan and Sandy are presented, those lives which are affected by the sexual mores of the time and their own temperament, especially in relation to the respective women who end up in their lives. Their story begins in the late 1940s when they are roommates attending Amherst College together. Both virgins, they discuss the type of woman they would each like to end up with. Sandy, the more sensitive of the two, meets Susan at a mixer, she who he believes is going to be the one to who he will lose his virginity. Sandy goes through the process methodically, taking into account what he thinks Susan wants, but without much true passion or romance. Jonathan, the more sexually aggressive of the two, ends up losing his virginity first to \"Myrtle\", who ends up being a steady but hidden girlfriend. Based on what each knows of the other's relationship, both Jonathan and Sandy strive for a little more of what the other has. These relationships also set the tone for all the relationships they will have in the future. Through their lives, they always seem not totally satisfied with their relationship at the time, still pining for what the other has. This view may change as they and their friendship hits middle age, when Sandy is with a domineering woman named Cindy, while Jonathan is with model/actress Bobbie, whose life goes spiraling downward because of her relationship to Jonathan and despite her beauty which on the surface offered so much opportunity for her. Jonathan's sexual trajectory, directed through these experiences, ends up in a manner he probably did not foresee happening.",
         "Jonathan and Sandy are roommates in the university. Each one of them has a different behavior and experience with women: Jonathan is cynical, malicious, and selfish. He does not respect anybody (even his best friend is not respected) and just want to have sex. Women are objects for him. Sandy is almost the opposite of Jonathan and has a different approach with women: he is shy, sensitive and respectful; he does not have much experience with women. Sandy dates Susan but Jonathan gives a pass on her in the beginning of a triangle of love. A few years later, Susan is married with Sandy, and Jonathan and Sandy are successful in their professions and boring with their mates. Now, Jonathan has a relationship with the sexy Bobbie. As years goes by, the two friends have affairs with different women but no steady relationship.",
         "The film traces the sexual and emotional confusion of two men from their Amherst College days in the fifties through the Kennedy sixties, up to the Vietnam era. Jonathan, a successful tax attorney and Sandy, a physician, personify two extremes of self-delusion and self-aggrandizement: Jonathan makes the mistake of thinking sex is love, and embarks on a lifetime of sexual conquest; Sandy dedicates himself to the pursuit of an idealized woman and the dreamy spiritual completeness to be found therein. In Bobbie Jonathan finds a partner whose masochism compliments his selfishness and emotional ambivalence. Jonathan does not want her to hold a job, but neither does he like the fact that she spends all day in bed sleeping, or watching TV. Sandy falls in love with his first college romance, Susan; they marry and have children. But Sandy is haunted by the fear that he was too hasty, even though he and Susan lead a happy domestic life and strive to reinvigorate their sex life by making love \"in all seven rooms\" of their apartment. With Jonathan's help, he enters into an affair with Cindy, a tough professional woman who turns Sandy off because she is too overbearing."
      ],
      "budget": 0
   },
   "movielensId": 3167,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1971-10-21",
      "dvdReleaseDate": "1999-12-07",
      "directors": ["Mike Nichols"],
      "runtime": 98,
      "movieId": 3167,
      "title": "Carnal Knowledge",
      "mpaa": "R",
      "actors": [
         "Jack Nicholson",
         "Candice Bergen",
         "Art Garfunkel",
         "Ann-Margret",
         "Rita Moreno",
         "Carol Kane",
         "Cynthia O'Neal",
         "Sheri Jackson"
      ],
      "imdbMovieId": "0066892",
      "originalTitle": "Carnal Knowledge",
      "genres": ["Drama"],
      "youtubeTrailerIds": [
         "4U22dBfXwzw",
         "3rzphPQ3IH0"
      ],
      "plotSummary": "The concurrent sexual lives of best friends Jonathan and Sandy are presented, those lives which are affected by the sexual mores of the time and their own temperament, especially in relation to the respective women who end up in their lives.",
      "tmdbMovieId": 36492,
      "avgRating": 3.54615,
      "releaseYear": "1971",
      "numRatings": 1170,
      "posterPath": "/rjXLiPokqTsAlXFROuWsMemqvVQ.jpg"
   }
}