{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "holiday",
            "id": 65
         },
         {
            "name": "christmas party",
            "id": 1441
         },
         {
            "name": "santa claus",
            "id": 1991
         },
         {
            "name": "deal",
            "id": 5011
         },
         {
            "name": "christmas tree",
            "id": 5570
         },
         {
            "name": "christmas",
            "id": 207317
         }
      ],
      "imdb_id": "tt0111070",
      "video": false,
      "title": "The Santa Clause",
      "recommendations": [
         9021,
         13767,
         9279,
         10719,
         9446,
         13673,
         11017,
         10414,
         10603,
         5825,
         9574,
         11158,
         9745,
         11528,
         9647,
         332,
         2616,
         11806,
         11418,
         24795
      ],
      "backdrop_path": "/rcQZmnhcb6P4mkgJAHnCYp3c1gp.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "Santa Claus / Scott Calvin",
               "gender": 2,
               "credit_id": "52fe44379251416c7502ce9b",
               "name": "Tim Allen",
               "profile_path": "/uX2xVf6pMmPepxnvFWyBtjexzgY.jpg",
               "id": 12898,
               "order": 0
            },
            {
               "cast_id": 12,
               "character": "Dr. Neil Miller",
               "gender": 2,
               "credit_id": "52fe44379251416c7502cea3",
               "name": "Judge Reinhold",
               "profile_path": "/dra8yOHLV8yqXSdwBueXeaDsLXV.jpg",
               "id": 777,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Laura Calvin Miller",
               "gender": 1,
               "credit_id": "52fe44379251416c7502ce9f",
               "name": "Wendy Crewson",
               "profile_path": "/e20JNF2oF7B0uGcoepL8j3uY0iE.jpg",
               "id": 19957,
               "order": 2
            },
            {
               "cast_id": 14,
               "character": "Bernard the Elf",
               "gender": 2,
               "credit_id": "52fe44379251416c7502ceab",
               "name": "David Krumholtz",
               "profile_path": "/5171elOp1qFxf9c8DkpeyhHBB6d.jpg",
               "id": 38582,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "Mr. Whittle",
               "gender": 2,
               "credit_id": "58603fd792514115c4024cea",
               "name": "Peter Boyle",
               "profile_path": "/hAZw6rJlAemlqND09Km7qGvpZ6D.jpg",
               "id": 1039,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Charlie Calvin",
               "gender": 2,
               "credit_id": "52fe44379251416c7502cea7",
               "name": "Eric Lloyd",
               "profile_path": "/e8NPxDPs3MNjkeesMHgTvpkyjFS.jpg",
               "id": 27564,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Judy the Elf",
               "gender": 1,
               "credit_id": "52fe44379251416c7502ceaf",
               "name": "Paige Tamada",
               "profile_path": null,
               "id": 141801,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Detective Nunzio",
               "gender": 2,
               "credit_id": "58603fe4c3a3681a65020289",
               "name": "Larry Brandenburg",
               "profile_path": "/3TGsmGFwJps4dmVncOZIO3p6ToO.jpg",
               "id": 92119,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Judy the Waitress",
               "gender": 1,
               "credit_id": "58603fef92514115c4024cf6",
               "name": "Jayne Eastwood",
               "profile_path": "/wMeootcDpiid4MYKXLqkWyPgmZ4.jpg",
               "id": 4568,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "ELFS Leader",
               "gender": 0,
               "credit_id": "58603ffcc3a3681a7202639f",
               "name": "Kenny Vadas",
               "profile_path": null,
               "id": 190621,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Fireman O'Hara",
               "gender": 0,
               "credit_id": "5860400692514115c7023e0f",
               "name": "Chris Benson",
               "profile_path": "/emkHKSAhTIVlLnz29T97NbTIGgJ.jpg",
               "id": 76105,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Miss Daniels",
               "gender": 1,
               "credit_id": "5a393f230e0a264cbe1f9a79",
               "name": "Mary Gross",
               "profile_path": "/2gk7Ld7Ah3QveJCMJvUH0LQrO9u.jpg",
               "id": 27862,
               "order": 11
            },
            {
               "cast_id": 22,
               "character": "Susan Perry",
               "gender": 1,
               "credit_id": "5a393f74c3a3680b882005aa",
               "name": "Judith Scott",
               "profile_path": "/Aqeajq8Mdu1SHPVebRCMNKOqcL1.jpg",
               "id": 44185,
               "order": 12
            },
            {
               "cast_id": 23,
               "character": "Reindeer Voices (voice)",
               "gender": 2,
               "credit_id": "5ab720fbc3a3680a490165c1",
               "name": "Frank Welker",
               "profile_path": "/b3gImArbw13mMKJIe9leFc9YYb7.jpg",
               "id": 15831,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44379251416c7502ce6d",
               "name": "John Pasquin",
               "profile_path": null,
               "id": 58072,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44379251416c7502ce73",
               "name": "Leo Benvenuti",
               "profile_path": null,
               "id": 61398,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44379251416c7502ce79",
               "name": "Steve Rudnick",
               "profile_path": null,
               "id": 56643,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44379251416c7502ce7f",
               "name": "Brian Reilly",
               "profile_path": null,
               "id": 56644,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44379251416c7502ce85",
               "name": "Jeffrey Silver",
               "profile_path": null,
               "id": 20908,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44379251416c7502ce8b",
               "name": "Michael Convertino",
               "profile_path": null,
               "id": 4055,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44379251416c7502ce91",
               "name": "Walt Lloyd",
               "profile_path": "/7jVPvsnbqRvHRCn4SW3IV3Z3KOr.jpg",
               "id": 10418,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44379251416c7502ce97",
               "name": "Larry Bock",
               "profile_path": null,
               "id": 16567,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 9.774659,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11395,
      "vote_count": 655,
      "budget": 10000000,
      "overview": "Scott Calvin is an ordinary man, who accidentally causes Santa Claus to fall from his roof on Christmas Eve and is knocked unconscious. When he and his young son finish Santa's trip and deliveries, they go to the North Pole, where Scott learns he must become the new Santa and convince those he loves that he is indeed, Father Christmas.",
      "similar": [
         13673,
         9479,
         10147,
         17979,
         25842,
         9279,
         9021,
         11881,
         1585,
         634,
         8871,
         10719,
         13377,
         18147,
         287903,
         51052,
         1581,
         296100,
         149235,
         772
      ],
      "original_title": "The Santa Clause",
      "runtime": 97,
      "poster_path": "/hrZjAYAF1o37k4Qb442c4yxwVLw.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/4MbjW4f9bu6LvlDmyIvfyuT3boj.png",
            "name": "Walt Disney Pictures",
            "id": 2,
            "origin_country": "US"
         },
         {
            "logo_path": "/xXojkyRWFZ0JTJyjiu13ThKeFbz.png",
            "name": "Hollywood Pictures",
            "id": 915,
            "origin_country": ""
         }
      ],
      "release_date": "1994-11-10",
      "vote_average": 6.2,
      "belongs_to_collection": {
         "backdrop_path": "/jQiwVHJN1rsS4DqhF7hlYZTYCH.jpg",
         "name": "The Santa Clause Collection",
         "id": 53159,
         "poster_path": "/1h8iA6i2DpPhsHC65nUB2voVnm5.jpg"
      },
      "tagline": "What if your dad was Santa Claus?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["John Pasquin"],
      "runtime": 97,
      "synopsis": null,
      "writers": [
         "Leo Benvenuti",
         "Steve Rudnick"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0111070/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNDY4MjgyNTk3Ml5BMl5BanBnXkFtZTcwMTg1NTUxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Tim Allen, Judge Reinhold, Wendy Crewson | See full cast and crew »"],
      "reviews": [
         "The Santa Clause (1994) This movie is a holiday classic. Tim Allen is really funny, and the movie is non stop entertaining and fun. This is one movie that I can watch over and over without getting bored, at any time of the year. Simply a holiday classic. Great for the family. 10/10!",
         "\"The Santa Clause\" isn't laugh out loud, roll on the floor comedy; it isn't old-fashioned \"It's a Wonderful Life,\" romance. Nope. It's an original '90s style Christmas story that tugs at your heart strings, and reminds you that we were all kids once. It reminds you of those days when you dreamt of Santa... when you stood in line waiting to sit on the jolly elf's lap... your knees shaking... as you tried to memorize what you were going to ask Santa. Anyone who isn't touched by this movie should look for the little boy or girl inside, and remember the Christmas Eves when you listened for the clatter of reindeer hooves on the roof. If you have no such memories, you may not understand this movie. Thumbs up to Tim Allen and Judge Reinhold! Thanks for the happy tears!",
         "Ever wonder, who is Santa Claus, really? Where does he come from, how old is he? How in the world does he squeeze down a chimney, and how does he get in if there isn't a chimney? What's the deal here? Well, happily, the answers to these questions and more are finally answered, as the legend of Santa Claus comes to life as never before in `The Santa Clause,' directed by John Pasquin and starring Tim Allen. Scott Calvin (Allen) is an executive with a toy manufacturing company, he's divorced and has a young son, Charlie (Eric Lloyd), who still believes in Santa, but is at an age at which doubt is beginning to creep into the picture. And the fact that Charlie's mom, Laura (Wendy Crewson) has a boyfriend, Dr. Neal Miller (Judge Reinhold), who is a psychiatrist, isn't helping the situation any. Neal, it seems, is adamant about counseling Charlie in the realities of life, which of course includes the real scoop on Santa, which doesn't go over too well with Scott. Then on Christmas Eve, which Charlie is spending with Scott, a strange thing happens. There's a clatter on the roof, and Scott rushes outside to investigate, where he discovers a man in a red suit clamoring about on the roof of his two-story house. As Scott watches, the man loses his footing and falls into the snow on the front lawn. And to Scott's amazement, it's Santa Claus! Or at least a guy dressed up like Santa, and he's not in very good shape at the moment. Lying there on his back, the man hands Scott a card with instructions written on it about what to do in this particular situation. `Put on the suit,' it says, `The reindeer will know what to do.' And when Scott looks back up at the roof, what he sees concludes what Neal would probably call an SEE (Significant Emotional Experience), and though he doesn't realize it at the moment, his life is about to change forever... And with that, Pasquin goes on to tell the story of Scott Calvin's amazing odyssey, which puts a humorous, and at times poignant, spin on this contemporary and highly imaginative rendition of the Santa Claus story, which offers much more than merely a fresh face on an old tale. The Santa angle has that universal appeal that will attract viewers initially, but what makes this story really accessible is the reality which lies beneath the fantasy. The relationships examined in this film-- the whole situation with Scott, Charlie, Laura and Neal-- are quite common in our modern world, and that obstacle in the lives of these characters puts a necessary balance in the story that makes it more than just another Christmas fantasy. It puts an edge on the sentimentality that would've been over-the-top had Scott, for example, been a happily married man with a text book family life. That would've been good for maybe a one hour T.V. special on a Tuesday night, whereas this story and the way it's presented is unique and lends itself well to full length motion picture status. When you think of Tim Allen, you don't necessarily think in terms of Santa Claus-- his Tim Taylor, `Home Improvement' persona is simply too far-reaching (there are, in fact, some `in' jokes sprinkled subtly throughout this film, like when Scott, in Santa's workshop, picks up a toy tool belt and holds it up to himself)-- but it actually becomes a positive here, and another part of the appeal of this film. it establishes Scott as a real person, an average guy attempting to cope with the everyday problems of everyday life. And it keeps the core of the story grounded, which ultimately makes the fantasy work while giving it heart. So, in retrospect, Allen was a perfect choice for the role of Scott Calvin, and in the long run this just may turn out to be one of his most memorable roles (which is somewhat ironic, as this was Allen's big screen debut), because this is certainly the kind of film that is bound to make a lot of people's annual `holiday movies to watch' list, falling into that category of films you can watch over and over again every Christmas season, like `A Christmas Story.' `Christmas Vacation,' `A Christmas Carol' and `It's A Wonderful Life.' All films which, though certainly diverse, have at their center the spirit of Christmas along with family values and traditions, and all told in a way that enables the viewer to readily identify with the characters and the story, which is exactly what this film does. Eric Lloyd turns in a good performance as Charlie, making his character believable while keeping him positive despite the conflicts which surround him, and Crewson and Reinhold are solid in their respective roles, as well. But in supporting roles, the standout performances come from David Krumholtz, as Bernard, Santa's Head Elf, and Paige Tamada, who is endearing as Judy, the Little Elf. Rounding out the supporting cast are Peter Boyle (Mr. Whittle), Mary Gross (Miss Daniels), Larry Brandenburg (Detective Nunzio), Judith Scott (Susan), Jayne Eastwood (Judy, the Waitress) and Joyce Guy (Principal Compton). An entertaining and ultimately uplifting movie, `The Santa Clause' is funny and enjoyable and has a lot to offer in the way of family entertainment, the kind of film adults and kids alike are going to appreciate. And it may even make you believe in some things you hadn't even considered before-- but that's for you to figure out as you watch the movie. And that's the magic of the movies. I rate this one 8/10.",
         "I remember the first time I saw the trailer for The Santa Clause. It was during the previews for The Lion King. As soon as the camera panned up from the snow globe to reveal Tim Allen, all the people in the theater began to laugh. This is a great, wholesome, funny flick that grown-ups and kidlets both can enjoy. Tim Allen was perfect to play the dad who becomes Santa, and I love when he burned the roast! I also thought the actor who played Bernard the elf was very funny and stole every scene he was in. And I especially enjoyed Judge Reinhold's turn as Neal Miller. I love the scene where he finally gets the hot dog whistle he'd wanted since he was a kid! Great holiday fun!",
         "i liked this movie ever since i was little..it was funny and it had a lot of fantasy and good acting by all the people that played in it...it had comedy, fantasy and it was just a good movie to watch for christmas, or any time of the year!",
         "THE SANTA CLAUSE, in my opinion, is an absolutely hilarious Christmas flick! I thought that Scott (Tim Allen) was a very funny guy, although he wasn't very jolly when he was first recruited to be the new Santa. Even so, I laughed really hard when he said, \"Yeah, same to you, and that's not very ladylike,\" \"Nice teeth,\" and, \"It felt like 'AMERICA'S MOST WANTED!'\" I also laughed when he imitated cats and dogs fighting. Oh, man, those parts were funny! Before I wrap this up, I'd like to say, \"Tim Allen has scored huge!\" Now, in conclusion, if you are a fan of Tim Allen, and you haven't this absolutely hilarious Christmas flick, I highly recommend it, that is, if you haven't seen it.",
         "With great, funny holiday flicks like \"The Christmas Story\" and \"National Lampoon's Christmas Vacation\", \"The Santa Clause\" is next on line to add laughs as the common sounds of Christmas other than jingling bells! Tim Allen is great in his movie debut as Scott, a toy salesman that owned the roof where Santa Claus fell from to his death! So in pleading cries from his young son, Scott puts on the late jolly-old-elf's suit and instantly becomes Santa, which insues problems to him, his ex-wife and her new boyfriend (played with annoying sarcasm by Judge Reinhold) and Scott's son. That's where the real chaos starts! > \"The Santa Clause\" is a great flick to watch on Christmas Eve. True, it can get too sentimental at times (Scott and his wife are battling for custody of their son. Remember \"Kramer Vs Kramer\" and \"Over the Top\"?!). But that surely fades away thanks to Tim Allen's antics. It'll make you wonder if Santa really is that clumsy!!",
         "I really enjoyed this movie. It was heart-warming and fun to watch. I remember as a child watching my favorite Christmas movies, such as the Grinch that Stole Christmas (cartoon), Miracle on 34th Street, and the classic Scrooge. This movie was so full of fun and warm fuzzies, and PERFECT for the holiday season, that it has easily earned its way into the holiday film montage for my family.",
         "I really liked this film, it is very funny and pleasant. Tim Allen gives a truly amusing performance as Scott Calvin, who replaces Santa after he falls off the roof. The plot is original, the script is fun, and the pace is surprisingly even. Don't expect a classic like Scrooge(1951), the first 2 Home Alone movies or It's a Wonderful Life, just expect a pleasant family Christmas film, that way the whole family is in for a good time. The film is directed with careful precision, and the characters are likable, though I did find the parents a tad too clichéd and the film a tad too overly sentimental in places. If I had a favourite character, I think it was Judy, there was something about her truly infectious smile that made me warm to her. All in all, well above average and highly recommended. 8/10 Bethany Cox",
         "This is a truly magical film that will continue to enchant children and adults for years and generations to come. The simple premise is executed well and Pasquin excels in making a film that appeals to all ages. Tim Allen plays his part to perfection and has never been funnier. He captures all the heart that the film needs as well as having an excellent on screen rapport with young Eric Lloyd. All the other cast members are good in their roles with David Krumholtz being the standout. Overall a fantastic film that for me truly sums up the spirit of Christmas. Although I like the sequels that followed this film this is the true classic of the series."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Family",
         "Fantasy"
      ],
      "productionCompanies": [
         "Walt Disney Pictures",
         "Hollywood Pictures",
         "Outlaw Productions (I)"
      ],
      "summaries": [
         "Divorcee Scott Calvin is disgusted to learn that his ex and her husband have tried - and failed - to break it easy to their 6-year-old son Charlie that Santa isn't real. On Christmas Eve, Scott reads The Night Before Christmas... then receives an unexpected visitor on his roof. When he's startled by Scott's calling out and falls, the Santa impersonator disappears, leaving only an 8-reindeer sleigh and a suit with instructions to put it on if he's involved in an accident. Scott does, and is transported around the town dropping gifts through chimneys until he's taken to the North Pole and informed by a group who claim they're elves that he is now Santa. Charlie is proud of his dad's new job, though Scott's convinced it's a dream. Until his hair turns white, his beard refuses to stay shaved, he gains weight inexplicably, even for his sudden love of junk food... Now he's accepted it, there's just one problem: how to keep it secret from his disbelieving family?",
         "When a man inadvertantly kills Santa on Christmas Eve, he finds himself magically recruited to take his place."
      ],
      "budget": 22000000
   },
   "movielensId": 317,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-11-10",
      "dvdReleaseDate": "2002-10-29",
      "directors": ["John Pasquin"],
      "runtime": 97,
      "movieId": 317,
      "title": "The Santa Clause",
      "mpaa": "PG",
      "actors": [
         "Tim Allen",
         "Judge Reinhold",
         "Wendy Crewson",
         "David Krumholtz",
         "Peter Boyle",
         "Eric Lloyd",
         "Paige Tamada",
         "Larry Brandenburg",
         "Jayne Eastwood",
         "Kenny Vadas",
         "Chris Benson",
         "Mary Gross",
         "Judith Scott"
      ],
      "imdbMovieId": "0111070",
      "originalTitle": "The Santa Clause",
      "genres": [
         "Fantasy",
         "Drama",
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": ["t067u2Jnks0"],
      "plotSummary": "Scott Calvin is an ordinary man, who accidentally causes Santa Claus to fall from his roof on Christmas Eve and is knocked unconscious. When he and his young son finish Santa's trip and deliveries, they go to the North Pole, where Scott learns he must become the new Santa and convince those he loves that he is indeed, Father Christmas.",
      "tmdbMovieId": 11395,
      "avgRating": 3.13221,
      "releaseYear": "1994",
      "numRatings": 17839,
      "posterPath": "/hrZjAYAF1o37k4Qb442c4yxwVLw.jpg"
   }
}