{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "prison",
            "id": 378
         },
         {
            "name": "repayment",
            "id": 1522
         },
         {
            "name": "gang war",
            "id": 2987
         },
         {
            "name": "boy gang",
            "id": 7858
         },
         {
            "name": "revenge",
            "id": 9748
         },
         {
            "name": "escape from prison",
            "id": 9777
         },
         {
            "name": "escape",
            "id": 10685
         },
         {
            "name": "los angeles",
            "id": 12670
         },
         {
            "name": "gang member",
            "id": 33426
         },
         {
            "name": "mexican american",
            "id": 164253
         },
         {
            "name": "cholo",
            "id": 206318
         }
      ],
      "imdb_id": "tt0195945",
      "video": false,
      "title": "Next Friday",
      "recommendations": [
         10426,
         10634,
         10611,
         16136,
         9490,
         21301,
         15278,
         13950,
         19092,
         14423,
         12657,
         650,
         16094,
         16096,
         16295,
         12695,
         17133,
         14577,
         10952,
         13098
      ],
      "backdrop_path": "/gMCKSic0my5n5ovqJU7fjMC0tD.jpg",
      "revenue": 59827328,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Craig Jones",
               "gender": 2,
               "credit_id": "52fe43769251416c7501151f",
               "name": "Ice Cube",
               "profile_path": "/dzdn1tyWkC4EjlBVKvpAhg5osYA.jpg",
               "id": 9778,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Day-Day",
               "gender": 2,
               "credit_id": "52fe43769251416c75011523",
               "name": "Mike Epps",
               "profile_path": "/64S9zCFVzHoloRSzd7yd0covlhC.jpg",
               "id": 51944,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Roach",
               "gender": 2,
               "credit_id": "52fe43769251416c75011545",
               "name": "Justin Pierce",
               "profile_path": null,
               "id": 57389,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Mr. Jones",
               "gender": 2,
               "credit_id": "52fe43769251416c75011549",
               "name": "John Witherspoon",
               "profile_path": "/mlrxal9uTk2h6i0suarNOyYGiTN.jpg",
               "id": 56902,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Uncle Elroy",
               "gender": 2,
               "credit_id": "52fe43769251416c7501154d",
               "name": "Don Curry",
               "profile_path": null,
               "id": 65132,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Joker",
               "gender": 2,
               "credit_id": "52fe43769251416c75011551",
               "name": "Jacob Vargas",
               "profile_path": "/IP7LaQDCFgoM6rKp8lGG2GUXNU.jpg",
               "id": 16429,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Lil Joker",
               "gender": 2,
               "credit_id": "52fe43769251416c75011555",
               "name": "Lobo Sebastian",
               "profile_path": "/muw74umbo9s6KI22pxzc7RSNqi9.jpg",
               "id": 48071,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Baby Joker",
               "gender": 0,
               "credit_id": "52fe43769251416c75011559",
               "name": "Rolando Molina",
               "profile_path": "/hp06oaA79Qw8z4CIqPsDpGSaVh8.jpg",
               "id": 90448,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Karla",
               "gender": 0,
               "credit_id": "52fe43769251416c7501155d",
               "name": "Lisa Rodríguez",
               "profile_path": null,
               "id": 98899,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Debo",
               "gender": 2,
               "credit_id": "52fe43769251416c75011561",
               "name": "Tom Lister Jr.",
               "profile_path": "/UY4xouwBs8p9QmcXbnP8iy2uYp.jpg",
               "id": 8396,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Suga",
               "gender": 1,
               "credit_id": "52fe43769251416c75011565",
               "name": "Kym Whitley",
               "profile_path": "/87Zy7o5giRo2SpnhNJSvZRhYJue.jpg",
               "id": 80597,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Mrs. Ho-Kym",
               "gender": 1,
               "credit_id": "52fe43769251416c75011569",
               "name": "Amy Hill",
               "profile_path": "/aJ6hQSvpt4zVZVnJmElIAEkaDfc.jpg",
               "id": 59401,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "D'wana",
               "gender": 1,
               "credit_id": "52fe43769251416c7501156d",
               "name": "Tamala Jones",
               "profile_path": "/gG0PHm94ArObvF8LqbuoaWP2ye5.jpg",
               "id": 59154,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "Baby D'",
               "gender": 1,
               "credit_id": "52fe43769251416c75011571",
               "name": "The Lady of Rage",
               "profile_path": null,
               "id": 65628,
               "order": 13
            },
            {
               "cast_id": 20,
               "character": "Pinky",
               "gender": 2,
               "credit_id": "52fe43769251416c75011575",
               "name": "Clifton Powell",
               "profile_path": "/hBw76xJtCwKS2v5rZtzDBqvKLN6.jpg",
               "id": 58924,
               "order": 14
            },
            {
               "cast_id": 21,
               "character": "Tyrone",
               "gender": 0,
               "credit_id": "52fe43769251416c75011579",
               "name": "Kirk Jones",
               "profile_path": "/mI6dOAQ97sL7mygKR3msXJ0oNYz.jpg",
               "id": 86462,
               "order": 15
            },
            {
               "cast_id": 22,
               "character": "Mailman with Tax Notice",
               "gender": 2,
               "credit_id": "52fe43769251416c7501157d",
               "name": "Michael Rapaport",
               "profile_path": "/i39bAISjAUWYlXZZA0wmjYWnZGf.jpg",
               "id": 4688,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43769251416c75011529",
               "name": "Steve Carr",
               "profile_path": "/sZELa2s3bwRZKXAEcSbNcD6hJey.jpg",
               "id": 52112,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43769251416c7501152f",
               "name": "Ice Cube",
               "profile_path": "/dzdn1tyWkC4EjlBVKvpAhg5osYA.jpg",
               "id": 9778,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43769251416c75011535",
               "name": "Terence Blanchard",
               "profile_path": "/vwmLEwopuomO3avDEYlDQ1QN9sh.jpg",
               "id": 5287,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe43769251416c7501153b",
               "name": "Elena Maganini",
               "profile_path": null,
               "id": 3121,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe43769251416c75011541",
               "name": "Christopher Baffa",
               "profile_path": null,
               "id": 50723,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43769251416c75011583",
               "name": "Ice Cube",
               "profile_path": "/dzdn1tyWkC4EjlBVKvpAhg5osYA.jpg",
               "id": 9778,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43769251416c75011589",
               "name": "Ice Cube",
               "profile_path": "/dzdn1tyWkC4EjlBVKvpAhg5osYA.jpg",
               "id": 9778,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 2,
               "credit_id": "52fe43769251416c7501158f",
               "name": "DJ Pooh",
               "profile_path": "/rdhmGM82GL5er2N2YmwRPVQxD9U.jpg",
               "id": 65134,
               "department": "Writing",
               "job": "Characters"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 9.930488,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10471,
      "vote_count": 182,
      "budget": 11000000,
      "overview": "Ice Cube returns as Craig Jones, a streetwise man from South Central Los Angeles who has a knack for getting into trouble. This time out, Craig is still trying to outsmart neighborhood bully Debo (Tommy \"Tiny\" Lister Jr.); after Craig gets the better of Debo in a fist fight, Debo is determined to flatten Craig in a rematch. Looking to stay out of Debo's way, Craig's dad decides that it would be a good idea for Craig to hide out with his Uncle Elroy and cousin Day-Day in Rancho Cucamonga... but trouble seems to find him there also.",
      "similar": [
         483,
         281,
         281957,
         3134,
         1701,
         769,
         185,
         979,
         9654,
         431,
         73,
         562,
         339692,
         238636,
         395834,
         357096,
         9277,
         96,
         193893,
         9093
      ],
      "original_title": "Next Friday",
      "runtime": 98,
      "poster_path": "/zUzn6YBbnEhdIkqtf9w0xG58NMC.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/iaYpEp3LQmb8AfAtmTvpqd4149c.png",
         "name": "New Line Cinema",
         "id": 12,
         "origin_country": "US"
      }],
      "release_date": "2000-01-12",
      "vote_average": 6.4,
      "belongs_to_collection": {
         "backdrop_path": "/pXszT8ZWGj3fohU9FY0niA0IDEw.jpg",
         "name": "Friday Collection",
         "id": 43563,
         "poster_path": "/cJUiqO2Z0PDL6cZ2Ic04F1i4gnb.jpg"
      },
      "tagline": "The suburbs make the hood look good.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Steve Carr"],
      "runtime": 98,
      "synopsis": null,
      "writers": [
         "Ice Cube",
         "DJ Pooh"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0195945/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc2NzU0NTM0M15BMl5BanBnXkFtZTcwMDI0OTEyMQ@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Ice Cube, Mike Epps, Justin Pierce | See full cast and crew »"],
      "reviews": [
         "Next Friday is actually pretty funny even though it lacks the film's first scene stealer Chris Tucker. Ice Cube makes a funny script with the help of new scene stealer Mike Epps who plays his cousin Day-Day. All in all if you just want a good time check this one out.",
         "Rated R for Language,Drug Use and Sexual Content. Next Friday is the sequel to the movie Friday and the second movie in the trilogy.Friday and Friday After Next were very funny movies.This one was not as funny but did have some really funny moments and was overall a fun and entertaining film.In this one, Craig moves to the suburbs with his rich uncle Elroy and his cousin Day Day.The reason he moves out of his old neighborhood is because Deebo has broken out of jail and wants revenge on Craig for beating him up(this happened in the first movie).There are some more funny characters in this movie such as Pinky the owner of the record store that Day Day works at and the three Mexican brothers who like to start trouble.Next Friday may not be as good as the first or third Friday movie but it is still funny and worth watching. 8/10",
         "First off: Why is Craig smoking? Why is Craig pimping? Why is Craig beating up Pinky? Where are the good Female Characters? Where is Smokey? Where is F. Gary Gray? Why is Craig's dad poop gag (good in the first one) so played out? Why is Baby D a rip-off of Felicia? Why is day-day's gf a rip-off of Craig's gf in Friday? Why is the soundtrack not as good as the first one? Why, in spite of all this, it's still funny!!!! If you haven't seen/don't like Friday, check it out. It's cliched (fat girl, crazy white guys, crazy mexican guys) but it's pretty good. 7/10",
         "That's my favorite of many funny lines from the Joker Bros. in NEXT FRIDAY. Jacob Vargas was hilarious, and he's been in a lot of other good movies like AIRBORNE, CRIMSON TIDE, MY FAMILY, GET SHORTY, SELENA, and ROMY AND MICHELLE. Justin Pierce was also another funny character, one most kids like me could identify with (white boy from the 'burbs who loves skateboarding but can't skate for crap). It's sad that he's no longer with us. Ice Cube is a talented guy, and he did the best (or worst) he could with his character, but it wasn't a shining role like it was in FRIDAY. The family (Uncle Elroy, Day-Day, Suga, Mr. Jones) got a little annoying at times. The \"biches\" (Joker's women) were very hot, and Lisa Rodriguez had a smart female character, something not seen much in movies like these. Also, the return of Tom \"Tiny\" Lister Jr.'s character was unnecessary. It was built up nicely, but the delivery sucked. \"Whites in hot, colors in cold, ese!\"",
         "You have to give Ice Cube credit. He tried to make a good sequel, but somehow it didn't quite work. It was close though, and fairly funny. At one point, in narration, Craig says, \"I sure miss Smokey.\" We do too.",
         "I saw this movie tonight at the theater. I was delighted at the humor involved in this movie, but was also upset that certain elements of the first movie were used in this. It was also disappointing that Chris Tucker was not a part of the cast. Overall, I believe the movie was hilarious, and if you are a fan of the first movie you should definitely see this one.",
         "This is the worse film I have seen in a long time, sure it's mildly amusing in parts, but there is no story line whatsoever. I was waiting for the story to kick in but it never does, it is just a collection of people wandering around swearing at each other. There seriously is no need to worry about someone giving the film away to you, because there is no story to spoil. Do not pay to see this.",
         "\"Next Friday\" isn't half as funny as \"Friday.\" The long awaited sequel to the 1995 cult classic hip-hop comedy lacks the hilarity of the ground-breaking original. Sadly, the best character is gone missing. Early in \"Next Friday,\" Craig Jones informs us that Smokey has checked into rehab. Never again do we hear another word about the memorable Chris Tucker character. Nobody in \"Next Friday\" either replaces or matches the live-wire comic energy that Tucker infused into the pot-headed player he impersonated so vividly. The Pillsbury Homeboy of Rap\u0097Ice Cube\u0097John Witherspoon, and Tommy 'Tiny' Lister Jr., reprise their roles, but Nia Long and Regina King are missing, too. Ultimately, with Chris around to cut up, \"Next Friday\" seems just plain 'Tuckered out.' \"Next Friday\" carries on where its lowbrow predecessor faded out, so some surprising narrative continuity distinguishes this farce. If you missed \"Friday,\" Craig (Ice Cube) beat the Goliath of the ghetto, Deebo (Tommy 'Tiny' Lister Jr.) to a pulp after the bully had run roughshod over the neighborhood. Now, Deebo is chillin' in jail, but he vows to get payback. Anxiously, Mr. Jones (John Witherspoon) takes his out-of-work slacker son to live with his lotto-winning brother Elroy (Don 'D.C.' Curry). Elroy resides in the suburbs, far away from South Central Los Angeles. No sooner has he relocated his son than Deebo escapes. Tagging along with Deebo on the wrong end of an ankle shackle is another reluctant inmate, Tyrone (Sticky Fingaz) who slows our towering villain down, especially when Deebo steals a bike. Deebo forces Tyrone to phone Craig's father and warn him that Craig is in trouble. Smuggling themselves in the back of Mr. Jones' animal control track (a clever metaphor for Deebo) Deebo and Tyrone ride out to the posh Rancho Cucuamonga where Uncle Elroy lives. Meanwhile, Craig finds life just as chaotic with his nouveau riche relatives. He dodges Elroy's oversexed wife Suga (Kym E. Whitley) and hangs out with his cousin Day-Day (Mike Epps of \"All About The Benjamins\"). Day-Day drives a new BMW and works in a record shop. Craig discovers a voluptuous Hispanic honey, Karla (Lisa Rodriguez), who lives at the house next door but tangles with her three Latino gangster brothers when he tries to steal their drug money to pay the unpaid property taxes on Uncle Elroy's crib. \"Next Friday\" is just as rude, crude, and lewd as \"Friday.\" Mr. Jones still has drafty bowel movement moments and has dog-do smeared across his back during most of the movie. Unfortunately, producer Ice Cube and freshman director Steve Carr screw up \"Next Friday.\" They squander too many good characters. First, Deebo spends too much time out of sight in the dog pound truck. Lister almost but doesn't quite compensate for Tucker's absence. Second, Craig gets nowhere with Karla, and she drops out of sight inexplicably after the cops have arrested her brothers. Third, everything in \"Next Friday\" is a predictable retread of \"Friday,\" but on a grander scale with less inspiration and no gun control messages.",
         "I saw Next Friday a day after I've seen it's prequel: Friday. It seems like only yesterday... Well, frankly speaking, it was yesterday when I've seen the next Friday movie. I didn't think a lot of it, I always thought Friday was one of the so-so movies ever, except it's grand sequel \"Friday after next\". When I watched Next Friday yesterday, I thought it was pretty good... for a So-So movie hehe... Of course not as good as Friday and Friday After Next but I got a good laugh out of it, and now I think of it a so-so highly. Of course Smokey should have been there too but, anyways, at least there's Day Day but it shows a character from a different perception and Day Day is a funny guy but Smokey is one of the best characters in any movie. They need to bring Smokey back. All in all grade: Next Friday is good too and is definitely worth seeing... Just don't forget yo weeds!",
         "it was funny but not as funny as the second or third. i like how day-day got that crazy ex. scratching his ride and all. and i love how day-day (mike epps) and Craig (ice cube) fight. this is about Craig knocked out debo in the first Friday. now he's busting out of jail getting some revenge. but Craig's got to move with his sex obsessed uncle and his nasty aunt and cousin. they have great adventures in next Friday. good movie. go buy it rent it kiss it whatever. but really it's good. it was funny but not as funny as the second or third. i like how day-day got that crazy ex. scratching his ride and all. and i love how day-day (mike epps) and Craig (ice cube) fight. this is about Craig knocked out debo in the first Friday. now he's busting out of jail getting some revenge. but Craig's got to move with his sex obsessed uncle and his nasty aunt and cousin. they have great adventures in next Friday. good movie. go buy it rent it kiss it whatever. but really it's good."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "New Line Cinema",
         "Cube Vision"
      ],
      "summaries": [
         "Debo has escaped from prison and is looking to get revenge on Craig. So Craig's dad takes him to Rancho Cucamonga to hide out with his Uncle Elroy and cousin Day-Day, who moved to the suburbs after winning the lottery. But once he gets there, Craig and Day-Day have a set of suburban misadventures that make his South Central experiences look tame.",
         "Uncle Elroy and Day Day owe money on taxes so Craig finds a way to steal from the next door neighbors to pay off the taxes so Uncle Elroy's house doesn't get put up for auction."
      ],
      "budget": 9500000
   },
   "movielensId": 3177,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-01-12",
      "dvdReleaseDate": "2000-06-06",
      "directors": ["Steve Carr"],
      "runtime": 98,
      "movieId": 3177,
      "title": "Next Friday",
      "mpaa": "R",
      "actors": [
         "Ice Cube",
         "Mike Epps",
         "Justin Pierce",
         "John Witherspoon",
         "Don Curry",
         "Jacob Vargas",
         "Lobo Sebastian",
         "Rolando Molina",
         "Lisa Rodríguez",
         "Tom Lister Jr.",
         "Kym Whitley",
         "Amy Hill",
         "Tamala Jones",
         "The Lady of Rage",
         "Clifton Powell",
         "Kirk Jones",
         "Michael Rapaport"
      ],
      "imdbMovieId": "0195945",
      "originalTitle": "Next Friday",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["mKepqz19Qb0"],
      "plotSummary": "Ice Cube returns as Craig Jones, a streetwise man from South Central Los Angeles who has a knack for getting into trouble. This time out, Craig is still trying to outsmart neighborhood bully Debo (Tommy \"Tiny\" Lister Jr.); after Craig gets the better of Debo in a fist fight, Debo is determined to flatten Craig in a rematch. Looking to stay out of Debo's way, Craig's dad decides that it would be a good idea for Craig to hide out with his Uncle Elroy and cousin Day-Day in Rancho Cucamonga... but trouble seems to find him there also.",
      "tmdbMovieId": 10471,
      "avgRating": 2.85848,
      "releaseYear": "2000",
      "numRatings": 1491,
      "posterPath": "/zUzn6YBbnEhdIkqtf9w0xG58NMC.jpg"
   }
}