{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "neo-nazi",
            "id": 376
         },
         {
            "name": "prison",
            "id": 378
         },
         {
            "name": "gallows",
            "id": 2125
         },
         {
            "name": "coffee",
            "id": 2439
         },
         {
            "name": "auschwitz",
            "id": 2450
         },
         {
            "name": "gas chamber",
            "id": 2451
         },
         {
            "name": "execution",
            "id": 13129
         },
         {
            "name": "hanging",
            "id": 33407
         },
         {
            "name": "denial",
            "id": 41596
         },
         {
            "name": "revisionist",
            "id": 41597
         }
      ],
      "imdb_id": "tt0192335",
      "video": false,
      "title": "Mr. Death: The Rise and Fall of Fred A. Leuchter, Jr.",
      "recommendations": [
         35638,
         107940,
         86380,
         25099,
         41480,
         49471,
         33324,
         77621,
         12901,
         14273,
         43734,
         53380,
         8847,
         30142,
         56511,
         34659,
         29044,
         24998,
         18902,
         26755
      ],
      "backdrop_path": "/ilT5T6Qk5jmRYVgFu4xnMtTKaHD.jpg",
      "revenue": 507941,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Himself (as Fred Leuchter)",
               "gender": 0,
               "credit_id": "52fe4582c3a368484e05f6ff",
               "name": "Fred A. Leuchter Jr.",
               "profile_path": "/ee1g7xosiUHmOAj47uNYE5GLsXP.jpg",
               "id": 557139,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4582c3a368484e05f703",
               "name": "Robert Jan Van Pelt",
               "profile_path": null,
               "id": 557140,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4582c3a368484e05f707",
               "name": "David Irving",
               "profile_path": "/iL5L0gSLAt4rmIEHkChtTeQRe6v.jpg",
               "id": 557141,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Herself (voice)",
               "gender": 0,
               "credit_id": "52fe4582c3a368484e05f70b",
               "name": "Caroline Leuchter",
               "profile_path": null,
               "id": 557143,
               "order": 3
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4582c3a368484e05f6fb",
            "name": "Errol Morris",
            "profile_path": "/6ck4ws1yMg3oLlZmdONi8T35aSU.jpg",
            "id": 18533,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 1.733606,
      "production_countries": [],
      "id": 28216,
      "vote_count": 20,
      "budget": 0,
      "overview": "Mr. Death: The Rise and Fall of Fred A. Leuchter, Jr. is a 1999 documentary film by Errol Morris about execution technician Fred A. Leuchter.",
      "similar": [
         9291,
         73,
         1429,
         107846,
         5971,
         10398,
         29381,
         2749,
         10360,
         2014,
         9303,
         245706,
         10994,
         8438,
         10536,
         4929,
         10447,
         575,
         17466,
         13012
      ],
      "original_title": "Mr. Death: The Rise and Fall of Fred A. Leuchter, Jr.",
      "runtime": 91,
      "poster_path": "/piRZ7vLqU4OaoPmqyBbZt7QLl0M.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1999-12-29",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Errol Morris"],
      "runtime": 91,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0192335/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE0ODU4OTE2OV5BMl5BanBnXkFtZTcwMDkxNzUyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Fred A. Leuchter Jr., Robert Jan Van Pelt, David Irving | See full cast and crew »"],
      "reviews": [
         "This documentary presents the story of the rise and fall of Fred Leuchter, an apparently self-taught engineer specializing in the repair and fabrication of instruments of capital punishment. His choice to develop evidence to deny the existence of gas chambers at Auschwitz, Poland causes a descent into villainy and subsequent ostracism from his clients and his wife. Several of Leuchter's detractors are interviewed in the film and vilify him as an anti-Semite and a perpetrator of a cruel hoax. His supporters portray him as the second coming of Christ and a man worthy of equal footing with George Washington. If Leuchter actually was aware of his place in the events that led to his downfall, then one could assume he falls somewhere between the two extremes. But this film amply demonstrates that in many ways, Fred in a class by himself. This little man from Massachusetts grew up around the prison where his father worked, and he saw the daily life of both inmates and guards. He came to see both groups as his friends, and later in his life he chose to research ways to make execution equipment safer and more humane, not only for the inmates being executed, but also for the guards that have to deal with the psychologically disturbing business of execution. Over time, he became prominent in his field, and was recognized as perhaps the only expert in the United States on repairing and building execution devices. It was this expertise that drew the attention of holocaust denier Ernst Zundel, who was on trial in Canada for publishing a document entitled \"Did Six Million Really Die?\", which the government of Canada argued was published with deliberate lies about Nazi execution of Jews. Leuchter was approached as an expert on execution and was asked to journey to Auschwitz to develop evidence to disprove that the crematories at that most infamous of concentration camps was used as execution chambers. It is here that the mystery of Fred Leuchter begins. In the film, a holocaust denier relates a conversation he had with Leuchter in which he had asked Fred about his illegal and highly distasteful excavations at Auschwitz. Leuchter replied, \"It wasn't what I found, but what I didn't find that blew me away.\" It is this statement that rings in my head when I try to examine Fred Leuchter's actions. Why didn't he think about what was being asked of him? Why didn't he see this inquiry in the larger scale of the history of the Second World War, and indeed in the history of civilization? Since he was so deliberate and so thoughtful in his research in to execution equipment, why did he not research the subject of the gas chambers at Auschwitz more thoroughly? Journalist Van Pelt explains that all he had to do was examine the archives at the camp to discover a wealth of information that the Nazis put together about the subject of the \"gassing basements\". Leuchter obviously understood nothing about the subject of chemistry (an absolutely necessary discipline to begin addressing the presence of cyanide on the bricks of the camp), and yet he took the job of disproving the existence of gas chambers. Why? This is the area where Errol Morris' skill as a documentarian really shines. He shows Fred lurching around at various white supremacist meetings to discuss the findings of his report, apparently unaware of agenda he was sent to justify. As a thoughtful and deliberate man, he came to the conclusion that the chambers at Auschwitz could not have been used as execution chambers, but obviously uses his own narrow view point to reach that conclusion, since (in his opinion) if he had designed such a device for mass execution he would not have built it that way. He doesn't understand that he was pushed to present a certain result, and that the individuals that wanted justification for their viewpoints were not to be trusted. Morris lets us see all the swirling action around Leuchter, and demonstrates that Leuchter himself was unable or unwilling to see his place in the madness surrounding the trial, as well as demonstrating that Fred couldn't fully understand why state governments were suddenly unwilling to deal with him, killing his business as an execution engineer. Leuchter's detractors took pains to ruin his life which, in a country that thrives on free speech and the open expression of ideas, is as shameful an act as Leuchter's own foolish holocaust denial. But an interviewee stated eloquently in the film that Fred had the chance to retract his statements. Fred at any time could have limited his involvement with the project. He should have conducted his investigation in the full light of day rather than slinking around a vitally important historical site, chopping up pieces of what many consider a holy shine to the lives of those callously murdered there. He could have done many things that any rational and considerate person should have done. But he didn't. Morris' film is one of the best examinations of a person's life committed to film. Highly recommended.",
         "I have never seen a movie handle moral ambiguity quite like this before. It's ambiguous on so many levels. FL Jr. worries about the humanity of the methods of execution, and it never occurs to him that the act itself is inhumane. The obvious hatred in the face of Shelly Shapiro (leader of a Holocaust remembrance group) makes you wince at the moral ambiguity of her acts. And finally that this mouse of a man is neither Jesus nor Hitler (two comparisons made in the film) is the only firm footing you are left with. Not earth-shattering, but what a film!",
         "In Errol Morris's film, \"Mr. Death\", Fred Leuchter Jr. comes across as a passionless, mechanical robot, fitting the engineering profession that he devoted his life to. Leuchter, the innovator of many death penalty devices and subsequently the only scientist willing to testify favorably in a celebrated Canadian trial that questioned the existence of the Holocaust, is either a hero to some or a villain to many. Morris, except for a Frankenstein-inspired opening and closing set in the film, prefers to let Leuchter be Leuchter rather than adding more contempt to a decidedly pitiful figure. The one time Morris does appear to interfere is when he asked Leuchter point blank if he could have been mistaken in any of his analysis. There are also camera tricks which render what Leuchter did as malicious, such as the split screen between what was Auschwitz and now, the slow-motion as Leuchter is chipping away at sites many Jews consider holy ground, and the phasing in and out of color and black and white film as we see Leuchter demonstrate his electric chair. The motivation behind what he did lies at the heart of \"Mr. Death\". He aspired to perfect the most humane killing machine because he said he believed in capital punishment, not capital torture. He cared that prison guards who knew the death-row inmates well would not have to suffer cleaning up the morbid residuals of those electrocuted. Yet he tried to carry this same mind-set in understanding the gas chambers at Auschwitz. In his mechanical mind, he asked how he could have done a better job of extermination. \"Mr. Death\" is an unpleasant but needed lesson about the mosaic people who live and work with each of us everyday - a people who seem anti-social yet amoral and who seem to be guided by that inner light that we can barely know or understand.",
         "Leuchter is an expert in execution technology (designer of electric chairs, gas chambers, etc.), whose career was wiped out when he got swept up in the Holocaust revisionism movement (he testified, as an expert witness in a defamation suit, that the Auschwitz crematoria could not and did not serve as gas chambers). In this vivid documentary, Morris lets Leuchter speak for himself (which reveals him to be a man of limited horizons with a - let's say - quirky moral code, likely undone by hubris rather than evil [although Morris may deliberately be making that as far as possible an eye-of-the-beholder issue]), while providing a blizzard of visual accompaniments that emphasize the lurid raw material of Leuchter's life (a strategy indicated by the B-movie undertone of the title), and flirt with his obvious sense of his own heroism. Leuchter has more than enough rope here to hang himself, and pretty much gets the job done. Morris doesn't try to explore the issue of Holocaust revisionism generally, pretty much taking our revulsion on faith: if anything, from my limited previous reading on the subject, that's doing Leuchter a favor. Anyway, revulsion or not, it's hard not to be fascinated by a man who can calmly chatter about his value-pricing approach to selling death machines (although custom made, he tells us, they're sold at \"off the shelf\" prices).",
         "Fred A. Leuchter, Jr., the subject of this documentary, is a lonely man, and so a man of narrow acumen, because he's just appreciative to be liked, even by Nazi sympathizers. Errol Morris conjoins montages and music into a movie that is more reflection than subjective report. Fred Leuchter, the son of a prison warden, relatively floundered into the Death Row business. An engineer by training, he was inspired by the urge for more competent and compassionate execution apparatuses. He'd seen electric chairs that fried their sufferers without killing them, poison gas chambers that endangered the witnesses, gallows not efficiently constructed to break the neck. He went to work fashioning better versions of these devices, and soon prisons throughout the US were taking his council. Notwithstanding his advance in trade, he was not, we understand, particularly well-received socially, though he does come to marry a waitress he meets owing to his habit of more than forty cups of coffee a day. We hear her offscreen voice as she balks at Fred's belief that their trip to Auschwitz was their honeymoon, where she had to wait in a freezing car, looking out for guards. Leuchter's visit to Auschwitz was the crossroads in his work. He was asked by a neo-Nazi Holocaust denier to provide a professional opinion at his trial. Zundel financed Leuchter's 1988 trip, where he chiseled off chunks of brick and mortar in buildings used as gas chambers and had them examined for leftover cyanide. He resolves that the chambers never had capacity for gas. There is a fault in his report, needless to say. The lab technician who analyzed the samples for him protests that cyanide would sink into bricks but to the measure of one-tenth of a hair. By chiseling large bits, Leuchter had eroded his sampling by several thousand times, not even taking into account the ravages of half a century. To find cyanide would have been supernatural. No bother. Leuchter became a darling after-dinner mouthpiece in the neo-Nazi circle, and the camera captures how his face illuminates and his whole body appears to embrace their cheers and ovations, how thrilled he is to shake hands with his new friends. Other people might recoil from the derelict position of a Holocaust denier, to say the least. An executioner is a derelict anyway and finds his friends where he can. No filmmaker can be accountable for those reluctant or unfit to take in his or her film with a discerning view. Anyone who leaves this deeply unsettling film concurring with Leuchter lays claim with him on the verge of psychosis. What's unsettling about the film is the way Leuchter is fairly honorable up till the point at which the neo-Nazis sink their talons into him. Those who are revolted by ethnic cleansing and other forms of government-sponsored genocide sometimes have no pangs when the state executes them one by one, testing them on elephants as is appallingly shown early in this film through dog-eared stock footage. One can even be a two-term president after governing the most restless American Death Row on record. In cinema, the Holocaust intensifies melodrama in that the conquest of the soul never struck so victorious against atrocity, because the atrocity is so confounding. Morris's haunting documentary tries to do something distinct. It's to attempt to penetrate the thought process of denial. You meditate on the general concept of denial, not as some postwar sensation but as something that was intrinsic in the undertaking itself. Those people did those things. The mystery is how. It's about deciphering why Fred Leuchter holds these beliefs. There is paradox in of so many U.S. states heaping tax money on this guy's work, just to oust him because of his distasteful affiliations. The capability of so many people to live contentedly with the notion of capital punishment may be a hint to how so many Europeans could live with the Holocaust: When you swallow the idea that the state has the right to kill someone and the right to decide what is a cardinal wrongdoing, you're nearly there. Mr. Death offers no complacent position of judgment. He doesn't make it obvious for us with light ethical categorizations, because people are formidably paradoxical and can get their minds around fearsomely peculiar notions.",
         "NOTE: POSSIBLE SPOILERS, BUT THIS FILM IS PRETTY SPOILER-PROOF I saw Errol Morris' MR. DEATH: THE RISE AND FALL OF FRED A. LEUCHTER, JR on the final day of the 1999 Toronto Film Festival, and am happy to report that it's easily his best documentary to-date -- one that I'm certainly glad that a filmmaker of his talents was available and inclined to make. While he's never come close to making a bad (or even mediocre) documentary, Morris' more recent efforts seem to have lacked the knockout punch effectiveness of his most widely known and highly-regarded classic, THE THIN BLUE LINE, which was instrumental in getting an innocent man removed from death row. This is the follow-up that his admirers have been waiting for... the story of a controversial man who easily blows away the combined weirdness of the quartet from Morris' last major effort, FAST, CHEAP AND OUT OF CONTROL. In the first part of the documentary, Fred Leuchter comes across as the embodiment of \"compassionate conservative\" ... a guy who firmly believes in the death penalty, but thinks that capital punishment should be more humanely administered. He's a regular geek of death technology ... the son of a prison guard who in the 80's designed a new state-of-the-art electric chair for Missouri. This lead to contracts with other state governments ... even ones employing execution methods (lethal injection, gas) that he had no immediate knowledge of. There's an undeniable morbid fascination in listening to him discuss the minutiae of death technology, covering topics such as the need for a drip pan under an electric chair. The guy is THOROUGH. But he's also vain in believing in his own infallibility as the leading authority in his \"field,\" and this proves to be his undoing. In 1988, he accepts a job from notorious Canadian Nazi historical revisionist Ernst Zundel to perform forensic investigations as to whether or not gassings could actually have taken place at Auschwitz. This he undertakes in earnestness, collecting all kinds of samples surreptitiously around the remains of the infamous facility while being videotaped by his guide. (Amusing side note: He had just been married at the time, and this excursion was his \"honeymoon\".) When he publishes \"The Leuchter Report,\" which concludes that gassings COULDN'T have taken place at the facility since he found no traces of cyanide in the samples, he immediately gains notoriety. He testifies at the hate crime trial of Zundel and becomes a star speaker on the neo-Nazi circuit. His report becomes the scientific basis for denying that the Holocaust ever happened and is widely circulated (it's easy to find via a Web search). He clearly relishes being revered as a scientific authority -- no matter WHAT the audience. But his business contracts disappear as a result of this notoriety, his wife divorces him, and he's left pretty destitute. In challenging Leuchter's findings, Morris wisely eschews any testimony from Holocaust survivors. Instead, he relies on some very gentile-looking academics who meticulously show the overwhelming archival evidence (schematic diagrams of the technology, correspondence between military officers, etc.) of mass extermination at the camp and demonstrate some HUGE holes in Leuchter's scientific methodology. When Zundel tries to refute these counterpoints by actually likening Leuchter to Christ, the jig's REALLY up. What starts out seeming like another interesting installment of FAST, CHEAP AND OUT OF CONTROL turns out to have a much larger mission: Showing the world the EXACT foundation that the \"scientific evidence\" denying the Holocaust rests upon. It's a masterful tour-de-force from Morris, with his polished documentary techniques on full display. It's VERY satisfying when \"Mr. Death\" turns out to be no match for a documentary filmmaker who knows how to give him enough rope to hang himself with. Even if you don't see documentaries as a rule, this one's a not-to-miss. Truth IS stranger than fiction.",
         "I saw a rough cut of this documentary last year presented by Errol Morris. At this point, I had never seen an Errol Morris documentary, but I have to say I loved it. It's the story of the man who reinvented the modern electric chair and other devices to carry out capital punishment. The first half of the film is darkly funny. The juxtaposition of images with Leuchter's descriptions makes for hilarious irony. The shots are in and of themselves wholly serious, but Leuchter himself is very comedic (whether he knows it or not). The second half of the film evokes anger more than humor. Leuchter becomes an advocate for Holocaust denial through his scientific (?) research for a Canadian Neo-Nazi. The cut that I saw didn't have an explanation as to why Leuchter got the results that he did until a little later in the film. I though Errol Morris should have had this description as soon as the results of the tests were determined. Maybe he changed it, and maybe he didn't. At the film's heart is, like a Greek tragedy, the story of a man whose rise to prominence is cut short by his hybris - his inability to accept that he could be wrong. As a result, a man who was once in demand by state after state is left to rot in his own misery and mistake.",
         "He seems to be concocted by a joint effort between Flannery O'Connor and Philip Roth: Fred A. Leuchter, Jr. builds more humane death technology. He brings electric chairs into the twentieth century and suggests that TV sets be brought into the killing room for the victims of lethal injection. For a while, the director Errol Morris is fascinated by the visual properties of geeky, big-gummed, brown-suited Fred, who reveals his churning interior self in only one way: he confesses to consuming forty cups of coffee and six packs of cigarettes a day. He seems like the obsessive, narrowly niche-defined folk of Morris' FAST, CHEAP AND OUT OF CONTROL--AI geeks and topiary gardeners. Then history intervenes. A Holocaust denier on trial for libel in Canada calls Fred as his star witness, proclaiming this mix of Babbitt and Kevorkian as a world-class expert. And so Fred takes his bride (the waitress who served him his daily forty cups) on a honeymoon to Auschwitz, where, in an almost comic act of desecration, he hacks chunks of brick from the deathhouse walls to prove they contain no Zyklon B. After pride cometh a fall, and Fred is ruined--and in the process Morris has minted a meditation on the roots of evil that joins together \"Twin Peaks\" and Sophocles. The most tightly focussed and probably the best of Morris' documentary features, MR. DEATH is probably the most eloquent spokesman of Morris' continuing theme--the metaphysical delusions ordinary mortals use to get through their very mortal days and nights.",
         "This is a documentary that feels like a compressed news broadcast. Errol Morris, the reason why Werner Herzog ate his shoe, makes this documentary about, well, the rise and fall of Fred A. Leuchter, Jr., also known as Mr. Death. During the 70's and 80's, Mr. Leuchter found himself in a successful niche improving upon and creating new machines to implement capital punishment. Though he was not a licensed technician, he sold blueprints and homemade machines to state penitentiaries as well as acted as a consultant on the lethal machines in prisons across the country. Where Mr. Leuchter went awry was when he was contacted to investigate the truthfulness to the claim that Nazis used lethal gas to exterminate thousands of people at concentration camps in Germany and Poland. His research found him knee deep in the ruins of Auschwitz, taking rock samples off the walls of gas chamber rooms to take back to the United States for arsenic analysis. His research turned up no traces of cyanide in the wall samples nor evidence of the structural integrity of the supposed gas chambers to safely contain the gases. He presented his findings to the trial of Ernst Zundel, a holocaust denier on trial in Canada for publishing documents refuting the Holocaust ever occurred, and was successively outcast from society as a fellow Holocaust denier. Through Morris' ninety minute film, we are shown the relative success of a man quickly sink to the bottom of the world's hating order through the publication of one research project. Mr. Leuchter is portrayed as objectively as possible in this film, sometimes even going to black while his voice continues, but the sheer tenacity of this man makes me grit my teeth with rage when I think of him. His lack of concern for human life and the sufferings of others and his ambivalence towards people as both models of death and financial gain is a horrifying example of what kinds of people do what kinds of things in this world. The movie was well made with nice interludes of beautifully shot slow motion 35mm as well as video footage from trials, video from Leuchter's own research in the tombs of Auschwitz, and the interviews of Leuchter sitting and talking about his work as calmly as a dove coos.",
         "This is a movie in which the protagonist appears to be little more than an eccentric and (at first) \"humane\" engineer of killing machines. By the end of the movie they are seen as much less - or much more. This is the story of a person who's aspiration for recognition get the better of them and the costs of those aspirations. Morris demonstrates better than in almost any of his other documentaries why he is a master of this form. Mr. Leuchter takes an abundance of rope with which to hang himself and insists he 'did the right thing'; though it seems amply obvious to almost anybody watching this fascinating movie that he had no business involving himself in the \"project\" in the first place. He had no idea that the stakes he was playing for were so large and his failure to accept his limited knowledge effectively ruins what was for him, a very lucrative hobby. Maybe a better name for this remarkable documentary would be *Hubris*, since Mr. Leuchter lacks it in spades..."
      ],
      "genres": [
         "Documentary",
         "Biography"
      ],
      "productionCompanies": [
         "Channel Four Films",
         "Fourth Floor Pictures",
         "Independent Film Channel (IFC)"
      ],
      "summaries": [
         "Documentary about Fred Leuchter, an engineer who became an expert on execution devices and was later hired by revisionist historian Ernst Zundel to \"prove\" that there were no gas chambers at Auschwitz. Leuchter published a controversial report confirming Zundel's position, which ultimately ruined his own career. Most of the footage is of Leuchter, puttering around execution facilities or chipping away at the walls of Auschwitz, but Morris also interviews various historians, associates, and neighbors.",
         "A cinematic portrait of the life and career of the infamous American execution device designer and holocaust denier."
      ],
      "budget": 0
   },
   "movielensId": 3182,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-12-29",
      "dvdReleaseDate": "2003-07-22",
      "directors": ["Errol Morris"],
      "runtime": 91,
      "movieId": 3182,
      "title": "Mr. Death: The Rise and Fall of Fred A. Leuchter, Jr.",
      "mpaa": "",
      "actors": [
         "Fred A. Leuchter Jr.",
         "Robert Jan Van Pelt",
         "David Irving",
         "Caroline Leuchter"
      ],
      "imdbMovieId": "0192335",
      "originalTitle": "Mr. Death: The Rise and Fall of Fred A. Leuchter, Jr.",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [
         "vXBfUrUz_rU",
         "niBw8JakaFg"
      ],
      "plotSummary": "Mr. Death: The Rise and Fall of Fred A. Leuchter, Jr. is a 1999 documentary film by Errol Morris about execution technician Fred A. Leuchter.",
      "tmdbMovieId": 28216,
      "avgRating": 3.8895,
      "releaseYear": "1999",
      "numRatings": 1000,
      "posterPath": "/piRZ7vLqU4OaoPmqyBbZt7QLl0M.jpg"
   }
}