{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0174268",
      "video": false,
      "title": "The Third Miracle",
      "recommendations": [
         50116,
         58918,
         69007,
         136727,
         98864,
         15006,
         241432,
         19275,
         16405,
         38986,
         53264,
         55066,
         31605,
         63848,
         143928,
         14896,
         40798,
         36234,
         15720,
         41496
      ],
      "backdrop_path": "/eJqSVFVMG5AXFlClQ6ovJz1UOJ2.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Frank Shore",
               "gender": 2,
               "credit_id": "52fe46099251416c91046f73",
               "name": "Ed Harris",
               "profile_path": "/atzm7ZGRFSWJHQT6qKmzjmNQ9GA.jpg",
               "id": 228,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Roxanne",
               "gender": 1,
               "credit_id": "534cdaa40e0a2661a4000b2d",
               "name": "Anne Heche",
               "profile_path": "/aXMySUgcAJ09dq0oD0qY1mcsr1c.jpg",
               "id": 8256,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Erzbischof Werner",
               "gender": 2,
               "credit_id": "534d14b4c3a368607c000ba4",
               "name": "Armin Mueller-Stahl",
               "profile_path": "/cKdfUl7EuUpBncwvJo2t3hYJPNi.jpg",
               "id": 12647,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 0,
               "credit_id": "534cdacb0e0a2661aa000b51",
               "name": "Charles Haid",
               "profile_path": "/Wna0bUskkYJAMFY5UiJMUbPG93.jpg",
               "id": 69791,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "",
               "gender": 0,
               "credit_id": "54570a6fc3a36869020020f3",
               "name": "Ken James",
               "profile_path": "/neSztvMYp0yFKwbZ7j7FxATkskC.jpg",
               "id": 1226313,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Helen O’Regan",
               "gender": 1,
               "credit_id": "58468318c3a368481301e43f",
               "name": "Barbara Sukowa",
               "profile_path": "/mGKhBMI9P2teTXC1v9HgS3WtL73.jpg",
               "id": 23378,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe46099251416c91046f6f",
               "name": "Agnieszka Holland",
               "profile_path": "/t7OOYOMIre88LLiWYepg8XnF9FD.jpg",
               "id": 1128,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5453efca0e0a2648d2001f28",
               "name": "Richard Vetere",
               "profile_path": null,
               "id": 90385,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "56475f1a9251413ae10038f7",
               "name": "John Romano",
               "profile_path": "/ycXfhk9PHhXHUKSSgNzoV9rn5TS.jpg",
               "id": 1217611,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 2.031171,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 36773,
      "vote_count": 18,
      "budget": 0,
      "overview": "The Vatican sends a priest to verify some miracles, performed by a woman who has been nominated for sainthood...",
      "similar": [
         258480,
         27586,
         370663,
         401898,
         244772,
         12793,
         858,
         112160,
         141,
         634,
         376867,
         394117,
         242224,
         17130,
         10818,
         11421,
         43923,
         152532,
         340485,
         250124
      ],
      "original_title": "The Third Miracle",
      "runtime": 119,
      "poster_path": "/lkxqF5lQSVoLk9ikALSByJgBPoN.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/ueaENQkPcy8rlr5fGZVBXKOhlBh.png",
            "name": "American Zoetrope",
            "id": 70,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Haft Entertainment",
            "id": 1363,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Franchise Pictures",
            "id": 1403,
            "origin_country": ""
         }
      ],
      "release_date": "1999-09-13",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Agnieszka Holland"],
      "runtime": 119,
      "synopsis": "A skeptical Bishop sends a broken priest as Postulator to investigate the possible beatification of a simple, devout woman whose death caused a statue of the Virgin Mary to bleed upon and cure a girl with terminal lupus. The politically weary priest unknowingly embarks on a spiritual journey that rebuilds his shattered faith and life. Summary written by Jim Norman {jnorman1@qwest.net}",
      "writers": [
         "Richard Vetere",
         "John Romano"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0174268/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI4NjQ1MTk0Nl5BMl5BanBnXkFtZTYwNjk1NDM5._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Sofia Polanska, Pavol Simon, Ivan Lukac | See full cast and crew »"],
      "reviews": [
         "\"Dogma\" showed that throwing darts at the Roman Catholic Church isn't hard to do. Similarly, \"Stigmata\" created villains within the Church hierarchy with relative ease. The hard part is making some sense of what motivates priests and nuns to carry on in spite of this undeserved negativism. That's what makes \"The Third Miracle\" a joy to watch - a film that goes beyond stereotypes and biases to try to find answers. There is something in this film that believers and non-believers can take away from even though \"The Third Miracle\" has decidedly taken a strong stand about matters of faith. The linking of a wayward postulator, Father Frank, searching to legitimize a common woman for sainthood, with his own personal search for God is very effective. Equally so is how the film shows the powerful role of secularism in the lives of men we call 'holy' (can it be any more obvious than the Bishop's mud bath?). A stroke of trickery at the end doesn't spoil the way this film invites us to consider faith as truly an all-or-nothing proposition. Certainly for Father Frank, the invitation to faith and to his own priesthood was based on a shaky bargain with God to spare the life of his father. For Roxane, the daughter of Helen O'Reagan, the decision to exclude God was equally as capricious - that God would take her mother away from her just because she had to do God's work. For Archbishop Werner, the God he defends and the God he internalizes are two different beings - one who is all knowing and all powerful, the other who cannot see beyond things black and white. \"The Third Miracle\", then, is not just about canonizing a dead woman, a holy housewife, but about how these three living players interact and struggle with each other to arrive at their own faith. This interaction is played out so well due to brilliant performances by Anne Heche, Ed Harris, and Armin Mueller-Stahl. Miracles strengthen one's faith but the visible miracles are more likely to move those who need a sign to believe. The irony of Father Frank is that he was instructed to disprove the very extraordinary acts of faith which he desperately needed to save his own spiritual life. It took him two hours, the length of this film, to find his miracle. \"The Third Miracle\" leaves us with a similar challenge, how long will it take for us to find that same miracle, that same faith.",
         "It was a treat watching this movie, being that I haven't checked out any low-budget or indie films in a long time. This is one of the lesser-known movies that is definitely worth watching. I was curious about it, mostly to see Ed Harris' performance. I've always loved Harris in everything he does, so I knew I could at least look forward to seeing a great actor at work. I have to say, this is one of his best performances. It's subtle and powerful, and he doesn't play his typecasted villainous role. This is a very different role for him, and one to remember. The premise and overall plot is intriguing, and Holland (I'm not gonna even bother spelling out the first name) does a fine job at keeping the suspense. It brings out great morals about Catholic faith, and faith in God just in general. And it proves that even people of priesthood can screw up, falter to temptation, but can still be summoned by God. Harris' character is a washed-up alcoholic, but God still sent him to investigate this alleged saint. Harris was even questioning his own faith, which made it even more interesting. \"The Third Miracle\" is one of the overlooked films of 1999, and I definitely suggest you give it a viewing. You won't be disappointed. My score: 7 (out of 10)",
         "I am not well qualified to comment on this movie from any technical or artistic perspective. However, it has now become my favourite movie for one reason. As a man of faith, I have had to endure years of Hollywood trivializing or sensationalizing most aspects of faith and religion. It seems to be the one subject with which they can find no degree of comfort or reconciliation. The Third Miracle, however, is a luminous study in how several characters learn to deal with their own faith, and yet it never tries to advocate any of those as right or wrong. It even avoids trying to be too specific about just how the struggle is resolved for each person. In the end there is a sense that they are all just a little further down the road. And that is, to me, exactly what faith is all about. It wouldn't matter if the \"religion\" involved were something other than Christian (spedifically Catholic). This could have been a story about Jews, Baha'is, Buddhists, Muslims, Hindus, or Zoroastrians. Within the context of each religion is the matter of how each believer learns and lives his faith. It is a personal struggle, a mystical relationship that draws each toward his Creator. The events portrayed in the film may seem to some to be fantastic or surreal, but faith is also each of those. Miracles are intended for those who witness them, and they are simply what happens when a higher law than the one we thought immutable comes into play. One can't prove a miracle to another any more than the other can disprove it. The two most interesting characters are those portrayed by Ed Harris and Armin Mueller-Stahl. Each has had profound experiences with both faith and religion, and come to starkly differing conclusions. And yet each man's dedication to his convictions is compelling. Harris' scene in the confessional booth is a heart-wrenching example of how impotent one can feel when in moments of doubt. Mueller-Stahl later gives a chilling demonstration of the intolerance that can arise when one denies the promptings of the spirit: \"Caprice of God! I would say it to His face if He were here now!\" As for the rest of the movie, I will leave that to those who write in very clever and articulate language about character and plot development, cinematography, and such. I will say that I found no serious flaws in it, from the small amount I have learned of such things from reading many such reviews. I'm not sure why such illusory fare as Pulp Fiction becomes legendary, while a faithful rendering of human realities like The Third Miracle becomes a marginalized curiosity. Do we derive more inspiration from caricatures than from characterizations?",
         "Yes, don't be late for this movie. What you see at the beginning sequence sets up the rest of the movie. It's the backbone of the plot. You have to take this film in whole. There are flashbacks. There are video playbacks within the film. They are subtle link backs - rather like navigating on the Web, and this Web is one of Ed Harris' character, who is struggling within himself - his mind, heart and soul, wrestling out of his own doubting web of gray matter. It's clicking on memories, description of things happened before, back to the present, rewind to the beginning imageries\u0085 It's challenging that way - it is a dramatic delivery of a story about humanity, faith, living and loving. The saint to be or not to be is portrayed by Barbara Sukowa - for me, she can very well be a saint after her passionate performance of 1986 \"Rosa Luxemberg\", followed with her role in 1991 \"Voyager\" played opposite Sam Shepard and Julie Delpy. The reason of one leaving a loved one dear to one's heart, like her daughter (Anne Heche) when she was 16, hearkens to Julianne Moore's character in 1999 \"The End of the Affair\" where she left someone (Ralph Fiennes) she loved wholeheartedly, because of a silent promise to God due to God's answer to one's prayer. This is a similar dilemma Father Frank Shore (Ed Harris) is actually coping with. Before \"The Third Miracle\", I didn't realize there's a whole Roman Catholic Church vocabulary unto its own, e.g., postulator, beatify, canonize, saint - these words were described in the dictionary within the breadth of \"Roman Catholic Church.\" Miracle or not, it's up to the believer. How one worships is also to one's own design. The film, on the surface, may feel rather like a Hollywood drama, yet it is not your usual topic. There are gritty scenes and challenging questions raised against one's attitude to faith. Ed Harris, Anne Heche, Armin Mueller-Stahl are a combination of actors worth watching. Whatever and however your feelings are about the subject of this film, it ultimately celebrates life. Miraculously for 1999, \"DOGMA\" is an imaginative, creative piece on the Roman Catholic Church. Writer-director Kevin Smith (1994 \"Clerks\", 1996 \"Chasing Amy\") delivered an ensemble cast with Linda Fiorentino (John Dahl's 1994 \"The Last Seduction\") as the virginal divine connection in the center of it all; Matt Damon and Ben Affleck as the pair of angels in distress; Chris Tucker as the thirteenth apostle; and other colorful characters on this blessed adventure of a satirical religious journey. It's fun. You can tell the actors all have an enjoyable time delivering this fantasy piece! Along the lines of miracles and controversies, 1995 \"GOSPA\" (means \"Our Lady\" in Croatian) is a film about a reportedly true event in Medjugorje, where six children believed they saw the Virgin Mary in 1981, and millions of pilgrims have visited the site since then. It follows the struggle of the parish priest (Martin Sheen) who defended the six children; it becomes more of a political drama with evolving prison and courtroom scenes. Not your usual box office fare. Also remotely reminded me of the Schwarzenegger's 1999 \"End of days\", where explosive devilish special effects treatment were used in the course of the redemption of a young woman (Robin Tunney), while \"The Third Miracle\" provides a more thought provoking film in following the course of a young girl's (Maria) salvation, and even a glimpse into what a Vatican tribunal might have been like. The film is full of details and they came at a subtly non-stop pace, yet director Agnieszka Holland is not thrusting anything at you, rather, the film kind of grows on you after you leave the cinema. If you want something different, try this film - go see it with an open mind.",
         "Bottom line: this is a \"crisis of faith\" story. The main character (Ed Harris) is a priest who has doubts, but wants to believe. He has already successfully debunked one candidate for sainthood; now his superiors ask him to investigate another. Along the way, he is sexually tempted by the saint-candidate's daughter (Ann Heche), and then opposed by a brilliant but embittered German arch-bishop. There's no sex, violence, sci-fi, or spectacular special effects in this one, folks. Just plain old good acting by the leads and supporting characters, excellent and evocative photography, and a first-rate musical score that adds to the overall enjoyment of the film. The script does have its flaws, which prevent \"The Third Miracle\" from being absolutely brilliant, but I was disappointed when the movie ended: I wanted more! Would that the absorbing story and its details continue: Is the candidate ever granted sainthood? Does the arch-bishop change his attitude publicly? And whose baby IS that? But these and other theological issues are what you will ponder and debate after the credits are over. And that's what makes this a worthwhile film.",
         "Warning: possible spoilers. Faith, doubt and miracles are the subjects tackled in The Third Miracle written by John Romano and based on the novel by Richard Vetere. Directed by Agnieszka Holland and starring two-time Academy Award nominee Ed Harris, this 2003 film opens in a flophouse in the late 1970's. Father Frank Shore (Harris), a priest who is faltering in his faith and who has stepped away from the church, eats his meals in soup kitchens, and does what he can to help those less fortunate with whom he lives. A professional postulator ( a person who investigates claims of sainthood) Father Frank is being summoned back to authenticate the miracles of a recently deceased immigrant woman named Helen O'Regan (Barbara Sukowa) who spent her last years living in a convent as a layperson. Loved by all, she is credited with healing a young girl, and every November (the month she died) the statue weeps blood. Known as \"the miracle killer\" it was just such an assignment that \"destroyed the faith of an entire community,\" and has caused his own crisis of faith. Doubt may be healthy for a layperson, but in a priest it is a certain sign of apostasy according to Archbishop Werner (Armin Muellar-Stahl) who is sent by Rome to undermine his findings in front of a church tribunal. The hierarchy of the Catholic Church is not well portrayed in this film. The Archbishop's rigid determination that no saint could possibly came out of America, especially one as \"ordinary\" as wife and mother Helen O'Regan, counterbalances the Bishop who talks politics over golf, spends long afternoons being massaged and mud-packed, and invites colleagues to high-profile gatherings based solely on their ability to converse wittily over cocktails. Even the poor Chicago parish where the possible-saint-to-be lived is tarnished, as the local priest proudly displays rows of scarlet electric pushbutton candles for parishioners to light when they offer a prayer. Doubt and cynicism live side-by-side in Father Frank, and neither this, nor his meeting with O'Regan's feisty, atheist daughter Roxanna (Anne Heche) surprises him. Angry that the mother who abandoned her for the church is even being considered for sainthood, Roxanna invites the priest to dance on her mother's grave in an odd, yet surprisingly sexual scene. Chemistry notwithstanding, the priest is saved from further faltering by a rainy night miracle to which he is a firsthand witness. Reclaiming his collar along with his faith, he returns to the church and argues his case before the tribunal. Several other twists and turns add to the courtroom-like suspense-some we see coming and others we do not-and contribute to an enjoyable two hours. The only question that remains is: What exactly is the third miracle to which the title points? Two are arguably attributed to the candidate for sainthood, but what of the third? On the face of it, it may simply be Father Frank's return to faith, but I would argue that the miracle is ours. Rather than calling us to believe the miracles of this \"saint of the people who live in the ordinary world,\" I suggest it calls us to look for the miracles in our own ordinary lives. In the last scene of the movie we see the first two miracles: the restoration of Father Frank Shore and the joyous motherhood of Roxanna. The third miracle is not named because it can't be named; it is different for us all. It exists in the ordinariness of our lives, and it is up to us to find it.",
         "The third miracle is a well written tale with a great touch of sentiment. A priest saying G*DD*MN*D is like lung doctor lighting a cigarette, provoking, like a movie of this kind should be. It's meant to leave something to think about, for me it was commitment of an individual priest finding his way in mass traffic between his left and right ear. I enjoy these true emotions or behavior because i believe everyone on earth has a set of weaknesses. I like these true emotions and choices when it comes to mind digging. Surely it's understandable that heavy religious people might be offended -the Archbishop was in the Nazi's army, drove around in a limo like a king and thought he was God himself-, but it's not the bible, I see it as a tale in a Catholic setting. This movie is based on personal choices, activated by a game of chess between animal nature and common sense. Throw in some faith and a time structured plot, have it sequenced very well, put in some great dialogue and moody setting, you will get a well deserved great movie! I recommend this film, it's in a way uplifting. 8/10",
         "This film is amazingly crafted, well-acted and thought provoking. Ed Harris gives one of his best performances (in fact, I strongly believe he deserved an Oscar nomination for THIS and not the overrated Pollock). Anne Heche delivers a strong, three-dimensional performance on a character that is hard to play. The flashbacks are beautifully shot and this film really brings up issues about faith, love and forgiveness. If you are a fan of Ed Harris, seek out this film.",
         "This is a review for those who saw the film but didn't think it's first rate. I ask you to look again. So, pardon the spoiler. It takes confirmation of three miracles to elect a candidate to sainthood. By the end of the film, two have been confirmed. And what a wonderful way to confirm the second miracle? The confirmation is given by the Devil's Advocate himself. But, pay attention to the title of the film. What is the third miracle? Magnificent. A thinking man's film. Hollywood should be ashamed. They could never make a film this good.",
         "`The Third Miracle' tackles much of the same subject matter as 1999's `Stigmata' but manages to do so without reducing it to the level of horror movie absurdity. The stories of both movies revolve around a doubting, questioning priest whose job it is to investigate and either certify or debunk purported instances of divine intervention. However, `The Third Miracle,' because it treats the material within the context of a serious drama, emerges as by far the more interesting of the two films. Ed Harris, in a solid performance, stars as the man whose job it is to verify these ostensible miracles but who, like most movie priests it seems, has come to question his faith and to doubt his own worthiness to even carry out the task. Anne Heche delivers her customary fine performance as the cynical daughter of the woman whose potential candidacy for canonization sets the plot in motion. Indeed, the film is at its most intriguing when it allows us to get a glimpse of the behind-the-scenes nuts-and-bolts machinations that the church uses in determining the viability of sainthood. We watch as the Catholic hierarchy treads the fine line between faith in supernatural intervention and the more worldly concerns of pragmatic politics. We see the petty jealousies, character attacks and power struggles that reduce even the most ethereal of ventures to the level of basic human frailty. In many ways, this broader conflict reflects the one which rages on a more intimate, personal level within the tortured psyche of Harris' character himself. It is his internal struggle between doubt and faith, between the physical and the spiritual, between strength and weakness that manages to keep the many strands of the plot together even when the film, at times, verges a bit on the banal and the tedious. Happily, too, the film does not succumb to the fashionable secular cynicism that is all too common in films today. `The Third Miracle' manages to explore the many-sided complexity of this issue without trashing the spiritual nature of the topic in the process. `The Third Miracle' is not by any stretch a great film, but it succeeds in exploring a tricky subject without insulting the intelligence of the audience along the way. After `Stigmata,' we offer our most humble thanks for that."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "American Zoetrope",
         "Franchise Pictures",
         "Haft Entertainment"
      ],
      "summaries": [
         "The Vatican sends a priest to verify some miracles, performed by a woman who has been nominated for sainthood. During his investigation, the priest, who is experiencing a crisis of faith, re-discovers his own purpose in life.",
         "A skeptical Bishop sends a broken priest as Postulator to investigate the possible beatification of a simple, devout woman whose death caused a statue of the Virgin Mary to bleed upon and cure a girl with terminal lupus. The politically weary priest unknowingly embarks on a spiritual journey that rebuilds his shattered faith and life."
      ],
      "budget": 0
   },
   "movielensId": 3183,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-09-13",
      "dvdReleaseDate": "2000-06-13",
      "directors": ["Agnieszka Holland"],
      "runtime": 119,
      "movieId": 3183,
      "title": "The Third Miracle",
      "mpaa": null,
      "actors": [
         "Ed Harris",
         "Anne Heche",
         "Armin Mueller-Stahl",
         "Charles Haid",
         "Ken James",
         "Barbara Sukowa"
      ],
      "imdbMovieId": "0174268",
      "originalTitle": "The Third Miracle",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["khDVs664t80"],
      "plotSummary": "The Vatican sends a priest to verify some miracles, performed by a woman who has been nominated for sainthood...",
      "tmdbMovieId": 36773,
      "avgRating": 3.46528,
      "releaseYear": "1999",
      "numRatings": 216,
      "posterPath": "/lkxqF5lQSVoLk9ikALSByJgBPoN.jpg"
   }
}