{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "boss",
            "id": 5306
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "cancer",
            "id": 10163
         },
         {
            "name": "shootout",
            "id": 10950
         },
         {
            "name": "mistress",
            "id": 11869
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0119699",
      "video": false,
      "title": "Montana",
      "recommendations": [],
      "backdrop_path": "/xO4AGs32D9Ek2WuKWgCzjovZ9z1.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Claire Kelsky",
               "gender": 1,
               "credit_id": "52fe44409251416c9100a18d",
               "name": "Kyra Sedgwick",
               "profile_path": "/udLKlspMdXSC9LMdhygL5rcJ4XI.jpg",
               "id": 26467,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Nicholas 'Nick' Roth",
               "gender": 2,
               "credit_id": "52fe44409251416c9100a191",
               "name": "Stanley Tucci",
               "profile_path": "/omGlTJF2IW5r3L3c5y0qkCt3hFr.jpg",
               "id": 2283,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Kitty",
               "gender": 1,
               "credit_id": "52fe44409251416c9100a195",
               "name": "Robin Tunney",
               "profile_path": "/oQGr5vfYbkarmJQmhGmSpIhSapL.jpg",
               "id": 17346,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Dr. Wexler",
               "gender": 2,
               "credit_id": "52fe44409251416c9100a199",
               "name": "John Ritter",
               "profile_path": "/2WIkWe5UASXpZgLQ1pMTtHNJKJX.jpg",
               "id": 27772,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Duncan",
               "gender": 2,
               "credit_id": "52fe44409251416c9100a19d",
               "name": "Philip Seymour Hoffman",
               "profile_path": "/8DjE4XIngdn0dK3RnIKTHB8U8jZ.jpg",
               "id": 1233,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "The Boss",
               "gender": 2,
               "credit_id": "52fe44409251416c9100a1b3",
               "name": "Robbie Coltrane",
               "profile_path": "/u07QKPs7wvXxzjXi1UUBSGjjmQm.jpg",
               "id": 1923,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Jimmy",
               "gender": 2,
               "credit_id": "52fe44409251416c9100a1b7",
               "name": "Ethan Embry",
               "profile_path": "/btE5T04gKo8isQ2UekgXmZIMXmA.jpg",
               "id": 58019,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Stykes",
               "gender": 2,
               "credit_id": "52fe44409251416c9100a1bb",
               "name": "Mark Boone Junior",
               "profile_path": "/riibKDljUzdSfIZygymhKx9yNPx.jpg",
               "id": 534,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Benny",
               "gender": 2,
               "credit_id": "52fe44409251416c9100a1bf",
               "name": "Jerry Grayson",
               "profile_path": null,
               "id": 60796,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Boulez",
               "gender": 2,
               "credit_id": "52fe44409251416c9100a1c3",
               "name": "Paul Calderon",
               "profile_path": "/2v8spXfKtaMbFZ25FrVsV0SAPwW.jpg",
               "id": 3137,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Ives",
               "gender": 2,
               "credit_id": "52fe44409251416c9100a1c7",
               "name": "Ajay Naidu",
               "profile_path": "/yIlmjzp1IX1sehbE0xvozEBQbxA.jpg",
               "id": 1982,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Bosch",
               "gender": 2,
               "credit_id": "52fe44409251416c9100a1cb",
               "name": "Karl Geary",
               "profile_path": "/cJyQRKyihjOINejTgv5E2vPCrwB.jpg",
               "id": 27176,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Paul",
               "gender": 2,
               "credit_id": "52fe44409251416c9100a1cf",
               "name": "Alan Manson",
               "profile_path": null,
               "id": 79735,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Fuller",
               "gender": 2,
               "credit_id": "52fe44409251416c9100a1d3",
               "name": "Raynor Scheine",
               "profile_path": "/o5jW5NDeFPIyETEVJQItQEqmJcx.jpg",
               "id": 21082,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Lawrence",
               "gender": 2,
               "credit_id": "56a4243c92514172070048eb",
               "name": "Peter Francis James",
               "profile_path": "/ksA1HX5fVPgEj3CiYY9ie9zEaBK.jpg",
               "id": 113230,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe44409251416c9100a1a3",
               "name": "Jennifer Leitzes",
               "profile_path": null,
               "id": 112946,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44409251416c9100a1a9",
               "name": "Erich Hoeber",
               "profile_path": null,
               "id": 112947,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44409251416c9100a1af",
               "name": "Jon Hoeber",
               "profile_path": "/x1rtEgiWKmaI2DtAZyySRVgtujw.jpg",
               "id": 112948,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 2.108022,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 30814,
      "vote_count": 4,
      "budget": 0,
      "overview": "A seasoned enforcer is given the seemingly routine task of finding the Boss's runaway mistress, Kitty. However Kitty is involved in plans to overthrow the Boss and this routine task gets very complicated.",
      "similar": [
         96,
         4771,
         281,
         445954,
         984,
         1266,
         3134,
         10651,
         2749,
         1696,
         18587,
         15069,
         26390,
         3529,
         12150,
         1949,
         9679,
         979,
         4638,
         75780
      ],
      "original_title": "Montana",
      "runtime": 96,
      "poster_path": "/cm2AVOvBlzZR8o9L0JLzGAmMSkW.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Zeta Entertainment",
            "id": 5333,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "No Bones Productions",
            "id": 40542,
            "origin_country": ""
         }
      ],
      "release_date": "1998-01-01",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "Never underestimate the power of a woman.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Jennifer Leitzes"],
      "runtime": 96,
      "synopsis": null,
      "writers": [
         "Erich Hoeber",
         "Jon Hoeber"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119699/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIxOTM5NDM2MV5BMl5BanBnXkFtZTcwMTQ4NzgxMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Kyra Sedgwick, Stanley Tucci, Robin Tunney | See full cast and crew »"],
      "reviews": [
         "It seems nobody could make a crime movie between 1994 and 2000 without being accused of copying Quentin Tarantino. Granted, his movies are great, but scoffing at any movie that has an ensemble cast of decent actors in a story that involves guns and money is just robbing yourself of entertainment. I admit there are a lot of copycat movies out there and some are really crappy, but you have to judge each one on it's own merit. I consider Montana and Things to do in Denver when you're dead to be two great exceptions. They're just too damn fun to watch for me to be so critical of them. Maybe that's just me though. I try to find things that mean something to me in every movie I watch. I love Tarantino as much as the next guy, but how can you not enjoy Kyra Sedgewick beating and shooting people. You just don't see that everyday.",
         "Didn't expect much when i bought the DVD from a local Store a few days ago, actually the reason i chose this one was simply because there were no better choices. But...turns out i made a right choice. You can find most elements of a typical gangster movie in this one: betray, love, hatred, friendship and bloody shootout ... but what makes Montana stand out is not the plot alone(Montana does have a well arranged smart plot that keep you surprised), what makes this one different is the STYLE. The directing style, and the style of those cool actors. The director makes the movie in a way that seems so real. real characters, real events and real humor. and most importantly, not only the leading characters, but every single one shines in this movie. I especially liked Claire and her friend nick(sorry i might spell their name wrong), the trust and loyalty between them really impressed me, and...nick's really got style...hehe...he's the absolutely the cool guy. fast, reliable and sometimes he's nice(to Koo's wife, to ... the boss's girl(a hooker), BTW, i have to admit that she's also a fantastic actress)... and those bad guys also deliver a good performance which in a way enhanced the whole move. anyway, if you are interested in a different/special gangster movie, Montana is definitely your choice! i give it 9 out of 10!",
         "I came across this movie in the video store and was surprised by the cast. Stanley Tucci, Kyra Sedgewick, Robbie Coltrane in a gangster film? What I experienced was a very funny and interesting film with great performances by Tucci and Sedgewick. I thought the double-cross, mistaken assumptions of some of the characters made for a great plotline and the violence wasn't as bad as some films I've seen. Interesting to see a woman in what is generally a male role and the dialogue was juicy! Great movie. If you liked this then I also recommend Judas Kiss.",
         "This is most definitely an over-the-top film, starting off sick and getting progressively sicker and sucking you in during the process. the characters are well-defined and well-realized, especially Philip Seymour Hoffman's smarmy, reptilian Duncan, Robin Tunney's not-as-dumb-or-pathetic-as-she-appears Kitty and Sedgwick's hardboiled-on-the-outside Claire. Of course the film belongs to Stanley Tucci, the film's dying hitman. Another sublime, subtle performance from this extraordinarily talented actor; he actually manages to give this brutal excursion a heart.",
         "Well if you want to be a jerk... I'll point out that in Pulp Fiction the scene was a little different. The bullets did not miss Samuel L. They went through him. Watch it again and see when he moves to look at the wall behind him. The bullet holes are directly behind where he was standing. And i would be willing to bet Tarrentino did not invent this scene either. He just happened to make it in a popular movie. I give Montana an EXCELLENT rating because it is not mainstream and some characters are more interesting (i.e. they don't say everything on their mind, so you have to figure them out). I like having to judge characters by observing behavior. There are many better movies with better directors, but this movie reminds me to figure things out on my own. These kind of movies can be much more stimulating. The only mystery in Pulp Fiction was what was in the case... so what.",
         "I picked up \"Montana\" on a whim, and was very plesantly surprised by it. I'll concede that there were some holes in the story, and some of the characters were very flat, but Claire and Nick made a VERY interesting study. There were enough plot twists that I didn't forsee to keep me surprised, and the main characters were definitely engaging enough to keep my interest. However, the violence and carnage were definitely worse than was necessary (comparisons to Tarantino seem justified). I'd give it a 8 - not great, but interesting and engaging.",
         "The kind of movie you can´t put in a genre. There´s a mix of violence, comedy and romance. One minute you laugh, then you sit stunned because a hooker has just shot the head off a young kid. Obviously not a big budget movie, but somehow I think that works as an advantage. The actors are great, the direction is great and the script is well written. It is a kind of cozy Pulp Fiction where the scenes are in order. The action scenes are not pumped up to be something they´re not, but are shot in style. Kyra Sedgwick deliveres a great performance and so does the rest of the cast. Worth pointing out is Ethan Embry as the young, annoying, psycho wannabe wiseguy. I give 10 out of 10. RENT THIS MOVIE!!!",
         "Kyra Sedgewick (who? just kidding, Kyra) and Stanley Tucci team up in a more than adequate disorganized crime flick. Although this Bonnie and Clyde team are poignant enough, this one's more about two MVP hit men (hitpersons?) and competent gangland executions than complex character study. But me...I love the kiss-kiss/bang-bang formula and this one's a goody. It kept me on edge throughout this sordid tale of assorted nasty things, i.e.; gambling, greed, nepotism, homicide, loyalty and, finally, love revealed in a death rattling disclosure. I am a reluctant convert to the Stanley Tucci Fan Club but, after having seen his career's range, depth and script judgment over these past years, I'm attending regular chapter meetings and considering taking the secretary's position. This is a good film noir offering with lots of twists and plenty of hemorrhaging from gunshot wounds, fatal and otherwise. If you like this kind of stuff...(well, nobody admits liking gory, testosterone-driven cinematic carnage anymore)...uh..uh.. come to think of it, just in case my oldest daughter reads this, I didn't really like this film that much. It had too much gratuitous violence and too much gun play. Not!!! Two thumbs sideways...",
         "No really, it's the best contemporary crime flick, deserving a huge cult following. All the characters are SOOOO cool, the shootout scenes are a cut above your average Hong Kong action-minus the slow motions or pyrotechnics. The coolest ones are the two leads, played by Kyra and Stanly, as buddies/love interests. Stanley's awesome as his character blows the baddies off the screen, with his ailments adding more to his cool, calm sense of obliviousness, while Kyra is a true kick-a** chick with a few human qualities which doesn't deter her strengths. Robin Tunney is charming, in a Matthew Perry sort of way. Overall THE COOLEST FLICK EVER. If you're wondering what's with the Gunsmith Cats in my summary, it's because of some wishful thinking that Kyra's character could teach Rally Vincent a thing or two about how to be tough, smart and cool yet feminine. I wished.",
         "I like this movie. It's not bad at all as a story of betrayal and new beginnings.The humour is quirky and at times the violence startling, but I enjoyed it sufficiently to obtain a copy for my video library. Jennifer Leitzes' film certainly gets your attention from the very first scene. This is an action movie. Ammunition consumption is enormous and the products of the gun makers' art send many malevolent bad hats to their doom. Good will to one's fellow man (or woman!) is in short supply in \"Montana\". The story proceeds with a brisk clarity, something I think is quite refreshing when there are so many movies around relying upon incredible plotting and intrusive style statements. See this movie too for the sometimes surprising casting. I'm not sure Kyra Sedgwick would have been my first choice to play Claire Kelsky. No matter, her astute, charmless and dangerous sub-boss in the gang is professionally done. Claire is matched in status in the outfit by Nicholas Roth, one of the best character creations I've seen from Stanley Tucci. His lightning fast, well-read and refined killer is a classic. I'm impressed too by John Ritter's chilling Doctor Wexler, what a carnivore! Robbie Coltrane matches the quality of these performances with his portrayal of the ruthless Boss, the maker of the one big and fatal mistake in the story, i.e. that of failing to recognise in his relationship with Claire Kelsky and Nicholas Roth that loyalty works both ways or not at all. Duncan, the sharp, slippery money man is the excellent creation of Philip Seymore Hoffman. His dialogue with Kitty, the trapped but quietly determined gangster's moll, played by the equally good Robin Tunney, provides one of the key moments in the movie. The coarse language will offend some viewers, but I found it interesting and stimulating entertainment. So, not for everyone, but see it and hopefully enjoy."
      ],
      "genres": [
         "Action",
         "Comedy",
         "Crime",
         "Drama"
      ],
      "productionCompanies": [
         "Initial Entertainment Group (IEG)",
         "No Bones Productions",
         "Zeta Entertainment"
      ],
      "summaries": [
         "Claire is a tough gang member that has to find the Boss' mistress, Kitty, who ran away from him. She is accompanied by Boss' trigger-happy son Jimmy. Claire's colleague gangster Nick is terminally ill and cancer starts to take over him.",
         "Kyra Sedgwick, Stanley Tucci, Robbie Coltrane, Robin Tunney and John Ritter star in this thriller about a professional hit woman targeted by her own organization. Claire (Sedgwick) is an accomplished assassin who gives her all to the boss (Coltrane). But when the boss gives Claire the low level task of retrieving his runaway girlfriend Kitty, Claire knows she's losing her juice. To make matters worse, the girlfriend (Robin Tunney) commits a murder while in Claire's custody. Forced to flee from her own syndicate, Claire soon finds that Kitty is a femme fatale to be reckoned with."
      ],
      "budget": 4000000
   },
   "movielensId": 3184,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-01-01",
      "dvdReleaseDate": "2003-06-10",
      "directors": ["Jennifer Leitzes"],
      "runtime": 96,
      "movieId": 3184,
      "title": "Montana",
      "mpaa": "R",
      "actors": [
         "Kyra Sedgwick",
         "Stanley Tucci",
         "Robin Tunney",
         "John Ritter",
         "Philip Seymour Hoffman",
         "Robbie Coltrane",
         "Ethan Embry",
         "Mark Boone Junior",
         "Jerry Grayson",
         "Paul Calderon",
         "Ajay Naidu",
         "Karl Geary",
         "Alan Manson",
         "Raynor Scheine",
         "Peter Francis James"
      ],
      "imdbMovieId": "0119699",
      "originalTitle": "Montana",
      "genres": [
         "Drama",
         "Action",
         "Comedy",
         "Crime"
      ],
      "youtubeTrailerIds": ["PuBPaX_Y6fE"],
      "plotSummary": "A seasoned enforcer (Kyra Sedgwick) is given the seemingly routine task of finding the Boss's runaway mistress, Kitty. However Kitty is involved in plans to overthrow the Boss and this routine task gets very complicated.",
      "tmdbMovieId": 30814,
      "avgRating": 2.92708,
      "releaseYear": "1998",
      "numRatings": 48,
      "posterPath": "/cm2AVOvBlzZR8o9L0JLzGAmMSkW.jpg"
   }
}