{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0208261",
      "video": false,
      "title": "The Life and Times of Hank Greenberg",
      "recommendations": [],
      "backdrop_path": "/WeDJNcoIJDC6FvcC19dEHz09XR.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 0,
            "credit_id": "58e7ff65925141281005630f",
            "name": "Aviva Kempner",
            "profile_path": null,
            "id": 1455472,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Documentary",
            "id": 99
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 0.405094,
      "production_countries": [],
      "id": 41276,
      "vote_count": 3,
      "budget": 0,
      "overview": "The story of Baseball Hall-of-Famer Hank Greenberg is told through archival film footage and interviews with Jewish and non-Jewish fans, his former teammates, his friends, and his family. As a great first baseman with the Detroit Tigers, Greenberg endured antisemitism and became a hero and source of inspiration throughout the Jewish community, not incidentally leading the Tigers to Major League dominance in the 1930s. Written by George S. Davis",
      "similar": [],
      "original_title": "The Life and Times of Hank Greenberg",
      "runtime": 90,
      "poster_path": "/q5L7XLJ4ylDAs0txMMREbwuoudD.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2000-01-12",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "When America Needed Heroes, A Jewish Slugger Stepped To The Plate.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Aviva Kempner"],
      "runtime": 90,
      "synopsis": null,
      "writers": ["Aviva Kempner"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0208261/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI1NDE3OTY2MV5BMl5BanBnXkFtZTcwNzE2NDIyMQ@@._V1_SY317_CR10,0,214,317_AL_.jpg",
      "actors": ["Stars: Reeve Brenner, Hank Greenberg, Walter Matthau | See full cast and crew »"],
      "reviews": [
         "I've seen this promoted, most of the time, as a movie for Jewish people because it is about their first big baseball idol, Hank Greenberg. A lot of the material here deals with how big an idol Hank was to all the Jews in Amercia back then. I found that interesting, but I watched it simply because I love baseball, especially the \"old days\" and am thrilled to see footage of any Major League baseball games and stars from the first half of the 20th century. If there is a human-interest behind the diamond heroics, all the better! It's amazing the degree Greenberg was literally worshiped by the Jewish people make in the 1930s and 1940s. Greenberg was a likable guy and I enjoyed seeing him talk here and there from an interview he did in the early '80s, talking about his career. He isn't a braggart, but he's not that modest, either. He knew he was very good. He didn't make excuses either when he didn't accomplish he wanted, like hitting 60 homers one season. Sadly, some of the commentators like attorney Alan Dershowitz are not so unbiased. His paranoia is more than evident, claiming they didn't want a Jewish man breaking Ruth's record so they wouldn't throw strikes to him. That's proved a lie in the next minute when they show Cleveland ace Bob Feller striking him out several times in a late-season game as Hank was stuck at 58 and never made it to 60. To his credit, Greenberg said those claims were false, anyway. I enjoyed not only seeing Greenberg smash the ball but witnessing some of his famous and not-so-famous teammates in footage, too, and also interviewed in their older age - guys like Charlie Gehringer, a great second baseman on Hank's winning teams in Detroit. Greenberg was one of a number of great baseball players who gave up years of his ballplayer prime to serve in the military during World war II, as it is pointed out here. He left at the age of 31 and came back at 35.....and wound up hitting a grand slam in the bottom of the ninth to enable the Tigers to win the pennant! It might have been his greatest hit. The Tigers went on to cap off the season with a World Series win over the Cubs That's one reason (besides the recent steroids scandal) baseball records aren't as meaningful as people think. Guys like Greenberg and Boston's Ted Williams lost 4-5 years of their prime years in baseball. Who knows what their final totals would be had their been no war? I liked what Greenberg said near the end of this long documentary, something I wish more athletes of today would say (and believe): \"I\"ve tried to pattern my life on the fact that I'm out there in the limelight, so to speak, and that there are a lot of kids out there. If I set a good example for them, maybe it will, in some way, affect their lives.\" Amen to that.",
         "Admittedly, this movie is not for everyone. It is for baseball nuts, people with an interest in Jewish life in America (even if they aren't Jewish themselves), people interested in 20th Century American history, and Tigers fans. I fit the first three categories (I'm a Yankee fan but with a lot of respect for the Tiger franchise), and I thought this movie was terrific. Greenberg was not the first Jewish baseball player, but he was the first to become a star and a hero to non-Jews, paving the way for Sandy Koufax and current Dodger star Shawn Green (as well as Rod Carew, who married a Jewish woman and, as Adam Sandler has pointed out in song, converted). The often terrible anti-Semitism that was often faced in pre-World War II America has been obscured -- it's almost as if the Nazi Holocaust was the only indignity that Jews have suffered. Ms. Kempner did a fantastic job bringing this era of baseball, Jewish life and Detroit life to someone not part of that place, time and faith. And I didn't think this film it was much like the Ken Burns miniseries at all. For one thing, the music was better than in the Burns film, at least until you got to the 1950s songs in \"Seventh Inning\"! And except for covering Ty Cobb thoroughly, Burns paid little attention to the Tigers. He covered Greenberg's 58-homer season (1938) and mentioned that Denny McLain won 31 games in 1968, but that's it. He didn't even mention Al Kaline except in a story that Bill \"Spaceman\" Lee told. He didn't cover post-Black Sox Chicago baseball very well either, or California except to discuss Koufax. But what can you do with over 100 years of baseball in 19 hours? Kempner did very well with 75 years of life, and what amounted to 10 full seasons of baseball, in an hour and a half. Greenberg may not have lasted as long in the game as some of its other stars, but his seasons, in baseball and out, were full indeed, and the movie shows this excellently.",
         "As a young girl, I remember his name so well. However, the documentary brought back so many memories. I can't believe that I had actually forgotten about \"Greenberg Gardens.\" I also was somewhat amazed that there were more young people in the audience, than usually seen in a film, that I thought would basically attract older people. Which goes to prove that baseball is and always has been a great national pastime. As a much older girl now, I'm still enamored of him as much as ever. Also the fine production and direction that went with it. Hank, I'll never forget you.",
         "A sprightly, lovingly researched, rather misty eyed sports documentary that steeped in ethnic pride. At first the movie is inspiring in a conventional, hero-treads-a-national-icon way. Greenberg, the towering Jewish slugger from the Bronx, joins the Detroit Tigers as a first baseman in the early '30s and becomes a power-hitting warhorse, leading the team from one World Series to the next. Greenberg defines the image of fearless, cleft-chinned American invincibility.",
         "As a bigtime baseball fan, I was very happy to find this. Hank Greenberg was one of the best players the game has ever had, he was jewish in a time of rampent anti-Semitism(well, in places at least as the documentary shows), who both served as a role model and example of class in the face of all that. He was also: in WWII for 4.5 years, made a run at Ruth's Record of 60 in '38(finished with 58), on a team that got into 4 Series and won 2 of them, a prosperous business man and baseball GM in the 50s and 60s. He was a hero for many a Jewish baseball fan back when, and was shown giving Jackie Robinson a helping hand when things were going badly for Robbie in '47...Robinson was quite thankful for the big man's kind words, according to this. Plus face it-you get some priceless interviews with his teammates-Billy Rogell, Charlie Gehringer, Hal Newhouser, etc. I loved all this, And the footage of the '34-5, '40 and '45 WS he was involved in-can't beat it. Not fast paced, not meant for the MTV audience, but as a time capsule and fond memorial to a good man-it does its job very well. ***1/2 outta ****",
         "As was the case with Walter Kephart of the August 12th review, I am a member of two of the three groups he said would enjoy this movie. \"The Life and Times\" falls into the trap of most biographies, as there was little suspense to the plot, but it was one of the more entertaining and enjoyable movies I've seen lately. It served as a reminder that, in an age of million dollar athletes and cynical fans, there have been superstars with character. Hank Greenberg could not have picked a more difficult time this century to evolve as a Jewish athlete than during the depression-era 1930's. At a time when Nazism rose in popularity on both sides of the Atlantic, in the city of Henry Ford and Father Coughlin, Hank Greenberg persevered, overcoming anti-Semitic prejudice to lead his Detroit Tigers to four American League pennants and two World Championships, all the while putting together some of the better offensive statistics in baseball. He was also loyal to his religion and his country, as was demonstrated by not playing on Yom Kippur and sacrificing five years of his playing career to serve in the United States Army during the Second World War. The other forms of media used by Aviva Kempner, including movie clips such as \"Gentleman's Agreement,\" Mandy Patinkin's Yiddish rendition of \"Take Me Out to the Ballgame,\" and interviews with people ranging from Alan Dershowitz to Al Rosen to the late Walter Matthau all helped illustrate the Hank Greenberg story. A Toronto Star columnist considered \"The Life and Times of Hank Greenberg\" to be the one must-see movie for the summer of 2000. It is definitely worth the price of admission, certainly moreso than nine out of ten movies playing these days.",
         "I'm not American, I'm not Jewish, and I don't like (or understand) baseball. But this film is perfect. For the first time, I can understand the connection between baseball and the American psyche. Every American kid (of any age) should see this. Thank you, Aviva.",
         "Interesting documentary about Hank Greenberg, the Detroit Tigers slugger who was the first major Jewish baseball star. Greenberg braved bigotry in one of the most anti-Semitic cities, and became one of baseball's great stars of the period. The film is good, but presents too much detail of Greenberg's life; every single statistical detail of his playing days is simply unnecessary. Mainly because of this, the film drags a little and is slow at times. A better idea might have been for a film about early Jewish baseball players, with a focus on Greenberg. Still, a good documentary about an important and interesting subject.",
         "This film about baseball Hall of Famer Hank Greenberg proves to be an interesting and well researched documentary full of ethnic pride. Although not the first Jewish baseball player, but the first to not change his name. The lumbering slugger from the Bronx joined the Detroit Tigers in 1930; turning out to be a stout warhorse playing first-base and waving a thunderous bat. The power hitter soon led the Tigers to a World Series in 1935. Hank came close to breaking Babe Ruth's home run record in 1938, missing by three hitting 58. Revered by all American Jews during the depression-era, when the popularity of Nazism rose; Greenberg served in WWII and came back to the Tigers and ended his career playing one year for the Pittsburg Pirates in 1947; during that swan song season, he befriended the Dodger's rookie Jackie Robinson. Greenberg entered the Hall of Fame in 1956 and died thirty years later. This documentary is woven with vintage still shots, newsreel footage, newspaper headlines and testimonials and interviews from people like Rabbi Reeve Brenner, actor Walter Matthau, Alan Dershowitz, Senator Carl Levin, Rabbi Max Tickin and even Greenberg himself and his heirs. Kudos to writer and director Aviva Kempner for this look at a baseball icon.",
         "I bought this DVD because of my life-long passion for baseball history, not as someone interested in seeing a story about a Jewish ballplayer. I am always interested in knowing more about these baseball greats of the past, and this documentary did include facts and stories that I did not know, and I enjoyed the interviews of other ballplayers of the same era. Some were greats of the game as well, some were not, but it is wonderful to put a face and a voice to the photos and stats I grew up memorizing as a kid. The documentary was trying so hard to be an exact copy of the Ken Burns style of film making, so much though that it does serve as a distraction, a feeling of unoriginality dimmishes what could have been a great documentary. With that complaint asside, I felt it succeeded in conveying the whole person behind the Stats, behind the Legend, and the WWII Veteran. 8/10"
      ],
      "genres": [
         "Documentary",
         "Biography",
         "Sport"
      ],
      "productionCompanies": ["Ciesla Foundation"],
      "summaries": [
         "The story of Baseball Hall-of-Famer Hank Greenberg is told through archival film footage and interviews with Jewish and non-Jewish fans, his former teammates, his friends, and his family. As a great first baseman with the Detroit Tigers, Greenberg endured antisemitism and became a hero and source of inspiration throughout the Jewish community, not incidentally leading the Tigers to Major League dominance in the 1930s.",
         "The life and career of Hank Greenberg, the first major Jewish baseball star in the Major Leagues."
      ],
      "budget": 0
   },
   "movielensId": 3188,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-01-12",
      "dvdReleaseDate": "2001-10-16",
      "directors": ["Aviva Kempner"],
      "runtime": 90,
      "movieId": 3188,
      "title": "The Life and Times of Hank Greenberg",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "0208261",
      "originalTitle": "The Life and Times of Hank Greenberg",
      "genres": [
         "Documentary",
         "Family"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The story of Baseball Hall-of-Famer Hank Greenberg is told through archival film footage and interviews with Jewish and non-Jewish fans, his former teammates, his friends, and his family. As a great first baseman with the Detroit Tigers, Greenberg endured antisemitism and became a hero and source of inspiration throughout the Jewish community, not incidentally leading the Tigers to Major League dominance in the 1930s. Written by George S. Davis",
      "tmdbMovieId": 41276,
      "avgRating": 3.66616,
      "releaseYear": "2000",
      "numRatings": 328,
      "posterPath": "/q5L7XLJ4ylDAs0txMMREbwuoudD.jpg"
   }
}