{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "mississippi",
            "id": 787
         },
         {
            "name": "childhood memory",
            "id": 3321
         },
         {
            "name": "dog",
            "id": 15162
         }
      ],
      "imdb_id": "tt0156812",
      "video": false,
      "title": "My Dog Skip",
      "recommendations": [
         15170,
         24795,
         17474,
         22792,
         10449,
         14963,
         17439,
         14522,
         17770,
         26355,
         20616,
         15028,
         39180,
         16110,
         14635,
         20682,
         12257,
         13574,
         62984,
         82626
      ],
      "backdrop_path": "/zysqv8h9yrXxmZrmyYkrhkII06O.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Willie Morris",
               "gender": 2,
               "credit_id": "52fe47519251416c75095197",
               "name": "Frankie Muniz",
               "profile_path": "/pjVw8EUl3zQR5dP4wRy5spSR9ws.jpg",
               "id": 51391,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Ellen Morris",
               "gender": 1,
               "credit_id": "52fe47519251416c7509519b",
               "name": "Diane Lane",
               "profile_path": "/81fhEMQlbhQ3mbI5ghq9RUrjkLB.jpg",
               "id": 2882,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Jack Morris",
               "gender": 2,
               "credit_id": "52fe47519251416c7509519f",
               "name": "Kevin Bacon",
               "profile_path": "/rjX2Oz3tCZMfSwOoIAyEhdtXnTE.jpg",
               "id": 4724,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Dink Jenkins",
               "gender": 2,
               "credit_id": "545d7c410e0a261fb9005468",
               "name": "Luke Wilson",
               "profile_path": "/n7CRA7h1z3FVOzBJ5EjfSrPQbvl.jpg",
               "id": 36422,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Spectator",
               "gender": 0,
               "credit_id": "54629cb70e0a26780d000762",
               "name": "Chaon Cross",
               "profile_path": "/fyPv8Pn4zwbHss2dfhA2NV4R6gO.jpg",
               "id": 1375346,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Narrator",
               "gender": 2,
               "credit_id": "57157f879251414b41000a1b",
               "name": "Harry Connick Jr.",
               "profile_path": "/zdIXPJyfpje8BGBjNQAe73CzSTx.jpg",
               "id": 18688,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Accordian Boy",
               "gender": 2,
               "credit_id": "5a542e44c3a3685ebc005e28",
               "name": "Hunter Hayes",
               "profile_path": "/vpXmKpJdGHCpWwPMfMQPYczybgp.jpg",
               "id": 1956569,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47519251416c750951a5",
               "name": "Jay Russell",
               "profile_path": "/baaNlNwUYSGpznRfWnCCUzGhtKE.jpg",
               "id": 46297,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47519251416c750951ab",
               "name": "William Ross",
               "profile_path": null,
               "id": 11166,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe47519251416c750951b1",
               "name": "James L. Carter",
               "profile_path": null,
               "id": 51783,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 1,
               "credit_id": "5543d8b19251410e84001fbc",
               "name": "Gail Gilchriest",
               "profile_path": null,
               "id": 296686,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5543d8bd925141500700047d",
               "name": "Willie Morris",
               "profile_path": null,
               "id": 1461716,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 7.297065,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 17908,
      "vote_count": 93,
      "budget": 7000000,
      "overview": "A shy boy is unable to make friends in Yazoo City, Mississippi in 1942, until his parents give him a terrier puppy for his ninth birthday. The dog, which he names Skip, becomes well known and loved throughout the community and enriches the life of the boy, Willie, as he grows into manhood. Based on the best-selling Mississippi memoir by the late Willie Morris.",
      "similar": [
         12230,
         28178,
         424488,
         9598,
         11674,
         16859,
         11544,
         134,
         9273,
         97630,
         1927,
         13053,
         55,
         264644,
         9325,
         10340,
         927,
         928,
         613,
         2898
      ],
      "original_title": "My Dog Skip",
      "runtime": 95,
      "poster_path": "/t1jsRTNF1LcVBTfpXWNfrPjgoG1.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Alcon Entertainment",
            "id": 1088,
            "origin_country": "US"
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "2000-01-14",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "Every family needs an optimist.",
      "adult": false,
      "homepage": "http://mydogskip.warnerbros.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Jay Russell"],
      "runtime": 95,
      "synopsis": null,
      "writers": [
         "Willie Morris",
         "Gail Gilchriest"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0156812/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc1NDgxMjg5MV5BMl5BanBnXkFtZTYwNTUxODc5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Frankie Muniz, Kevin Bacon, Diane Lane | See full cast and crew »"],
      "reviews": [
         "Folks, this movie knocked me for a tear-jerking loop when I first saw it, and it knocked me again just now (as it aired on TNT). I had a dog exactly like Skip, and growing up, I was a lot like Willie. The movie will hit incredibly close to home for anyone who loves dogs or who had a close relationship with a dog in his or her childhood. The movie's beginning and its ending are its best moments. In between, the movie carries along pretty well. I dare say, the last five minutes are absolutely some of the most powerful moments any dog lover may ever see in a movie.",
         "There have been many movies about a person's relationship with an animal, but \"My Dog Skip\" is one of the best that I have ever seen. I discovered this movie on video and it will definitely become a part of my collection. In the 1940's, during World War II, things are rough in the USA. Willie Morris is not your average boy. He would rather read than play football with the other guys. When Willie's parents let him have a dog, it changes his whole outlook on life. He and his dog Skip have a unique friendship that becomes unmatched by anything else. While this movie's target audience are kids half my age, it is perfect for everyone. Its story is very true to life, probably because it's based on Willie Morris' own childhood and his memoir of the same name. I had a dog that was just like Skip -- a true friend. There's nothing like a constant companion that will stick by you even when it seems that the world is against you. Even if you're not a dog fan, you shouldn't look past this movie. The cast is excellent, especially Frankie Muniz, who's now known as Malcolm from Fox's \"Malcolm in the Middle.\" He exudes boyhood innocence and bonds with his pet better than he does with humans. His parents, Diane Lane and Kevin Bacon, do a fine job as well. Rounding out the major cast is Luke Wilson, as Willie's changed-by-war neighbor Dink. \"My Dog Skip\" is funny and heartwarming. You'll laugh and chances are you could shed some tears as well, but it's all worth it in the long run. This a movie that should not be missed by anyone, especially if you have had a special animal friend in your life.",
         "This movie sucked me in from the very beginning. I am a sucker for movies that depict childhood through the eyes of the child after they have become an adult. It is really about the powers of friendship and the rites of passage that mark our lives as we get older and move forward through life. Despite all the violence that permeates the movies, where the body count keeps going up, I was shaken when Willie strikes the dog during a baseball game. We all do things that we are ashamed of and this scene struck me as very realistic. In the end when Willie goes away to college and the dog is waiting at the bus stop for him, there is a permeating sadness that I occasionally feel when I think of things I loved that no longer exist. Damn movie made me cry.",
         "This is an absolutely wonderful movie that's aimed for children, but will probably be even more loved by adults. In 1942, a 10-year-old boy who is more intellectual than athletic and is constantly teased by others finds solace in the puppy given to him on his birthday. The dog helps him make friends and grow up. That's the capsule of the plot. This movie is much more than that. The acting all around is excellent, but special credit must be given to Frankie Munoz (as the boy) and Moose, the dog from \"Frasier\" as...the dog. \"My Dog Skip\" does a wonderful job of showing all of the joys and agonies of changing from a child into a young adult. It's hard not to recognize yourself in the episodes. While this movie is sentimental, it's not played for sentimentality. That's much of why it works so well. You won't feel like you're being manipulated as you watch. Be forwarned: some of the scenes might be rather intense for children under the age of seven. You, as an adult, will probably want to bring along some hankies. >",
         "MY DOG SKIP / (2000) *** Starring: Frankie Muniz, Kevin Bacon, Luke Wilson, and Diane Lane Directed by Jay Russell. Written by Gail Gilchriest, based on the book by Willie Morris. Running time: 95 minutes. Rated PG (for brief violence and mild language). \"My Dog Skip\" is an emotionally effective and challengingly involving piece of cinema. The film, directed by Jay Russell, based on a writing by Willie Morris, works well because it proves two theories: 1) The war affected not only the soldiers in battle, but also normal families in minor but critical methods, and 2) Childhood can be best remembered by our fond memories with the family's dog. These elements present the audience with an accurate and knowledgeable atmosphere with memorable characters and issues. The movie is set in the summer of 1942. The story explores a family of three, Jack, Ellen, and Willie Morris. Jack (Kevin Bacon) is the heartbroken father who lost his leg in war years ago. Ellen (Diane Lane) is the simple minded housewife doing more manual labors than women usually complete. Willie (TV's Frankie Muniz) is their lonely son-maybe ten years of age. He has no local friends, is poor at sports and teased at school. His best acquaintance is in his mid twenties, a mechanic named Dink (Luke Wilson), who is called for battle not too long into the picture, leaving Willie all alone. Ellen decides to go against father's orders and purchase Willie a faithful companion of his own for his birthday: a puppy. Although Jack firmly opposes this gift, his wife convinces him Willie is old enough to take care of a dog. Willie names his new friend Skip, who drinks out of the toilet, does not obey commands, and seemingly understands human emotions. \"My Dog Skip\" wisely uses the war as a mood developing overtone; a background event that provokes confusion in Willie and gradually changes the lives of those around him. The time period is ideal for such a film to take place. The filmmakers produce a lifelike atmosphere that perfectly defines what living in the 1940's was like. The film features beautiful and captivating performances by everyone in the cast. Frankie Muniz, from Fox's \"Malcolm in the Middle\" on TV, is very effective and well cast. He creates the appropriate narrative connection the film depends upon. Kevin Bacon is broad yet poignant, with a bold mood of a father in the 40's. Luke Wilson is also successful here, making his dynamic character obvious throughout. Diane Lane does not have enough screen time to explore any real material, but creates rich character chemistry with Bacon. The movie could investigate the Luke Wilson character more thoroughly. About half way into the story, \"My Dog Skip\" nearly drops this seemingly important character only to later bring him back to supply the plot with several crucial sequences. Skip's intelligence appears to altered in various scenes throughout the production. In one scene, the dog will presumably understand human emotion and restore motivation. In others he cannot accomplish simple tricks and drinks out of the family toilet. This animal, although very significant character, needs to be more consistent and less exaggerated. Most of the film's dialogue is right on the money; smart and fitting. It is not too straightforward or excessively blunt, but gentle and thematic. Most of \"My Dog Skip\" is gentle-hearted, however, and provides the lovable atmosphere that starving audiences are searching for, along with high quality and entertaining situations, in family based movies. If this description fits you, regardless of age, this is the movie you are looking for. \"My Dog Skip\" is brought to you by Warner Bros.",
         "Anybody who had a close friend during childhood who happened to be a canine should go for this one. Like most of the pooch films it was corny in spots, but at least Skip wasn't endowed with human intelligence. Of course, the mean men were around to cause trouble for the dog and boy; can't get by without them. Fun movie, but be sure to bring along a crying towel.",
         "Frankie Muniz should stick to roles like these, they're truly brilliant. He plays Willie Morris, a lonely boy who gets given a dog named Skipper for his birthday, and together they have amazing adventures together. Sounds corny, no? Well, the whole thing is so beautifully handled that it's a truly moving piece of drama. Frankie Muniz really surprised me in his role. He went through, something which I would describe as what Adam Sandler went through for Punch-Drunk Love, an absolute revelation. His portrayal of Willie Morris is convincing, accurate, funny, moving, all those words and more. His performance here beats his other film work anyday, and is even better than what he did in his TV show Malcolm in the Middle. His co-stars Diane Lane, Luke Wilson and Kevin Bacon (big names, huh?) are reliably good but it's really Frankie who steals the show here. My Dog Skip is an underrated, moving masterpiece which 100% shows the importance of having a friend. It's so touching, it made me cry. The dramatic score and lovely cinematography add to the wonder. Simply fantastic. My rating: 9.5/10",
         "I loved this movie from start to finish. \"My Dog Skip\" reminded me a lot of a 1998 movie called \"Simon Birch\" from the narrator to the feeling I got inside while watching both films. I was also thrilled to learn that Kevin Bacon was a part of this cast because he is an actor that has presence. Every time he is on screen it is as if the screen shines. \"My Dog Skip\" also stars one the best child stars around named Frankie Muniz. When talking about natural talent this kid has it. Rounding out this cast is Diane Lane and Luke Wilson. As Haley Joel Osment did with his performance last year in \"The Sixth Sense,\" Frankie Muniz stole the show this year with his in \"My Dog Skip.\" This may not be an original idea but it is presented in such a way that works. \"My Dog Skip\" is refreshing and non-violent film that allows everyone to sit back and relax. All I have to say about this film is bravo on a movie well done on the acting as well as the directing. Everything about the film was terrific. I wish I could live the life of this kid and have a dog this loyal and obedient. I really enjoyed this movie from start to finish. I recommend that everyone watch \"MY DOG SKIP.\"",
         "Here's a bit of an unusual film: a modern-day movie made more for adults than kids but could be equally enjoyed by both. There are 9 \"damns\" and a few other profanities, but nothing earth-shaking. It's simply the memoirs of Willie Morris, a southern boy who wound up as a famous writer and editor of Harper's Magazine. Being that magazine is pretty Liberal, you get Liberal slants in the movie (racial and anti-war sentiments) but nothing heavy-handed. As a good story does, it makes you care about the characters, especially the lead one. In here it's \"Willie\" and his dog \"Skip.\" Early shots of Skip growing up - measured in how he related to the toilet bowl - are funny. You also care about his parents and are glad when the dad (Kevin Bacon) softens his stance on things. As a guy, I appreciated just looking at Diane Lane. What a gorgeous face! The cinematography is pure southern charm and looks great on DVD. It's not all sweetness. There are some angry moments and some sad ones, to be sure. In summary, however, a nice film.....pure and simple.",
         "*MAY CONTAIN SPOILERS* \"My Dog Skip\" is a great family film. I saw it in theaters when I was 13 years old and loved it. The plot was cute, the acting was very well done, and \"Skip\" was so cute. \"My Dog Skip\" told the story of a lonely shy boy growing up in the World war II era. He then got a dog named Skip for his birthday and together they had many adventures. My favorite part of this movie is when Skip drives the car. That was so cute. The ending of this movie is very sad and made me want to cry. Overall I give this movie 10/10 stars and suggest all families should see it."
      ],
      "genres": [
         "Drama",
         "Family",
         "Sport"
      ],
      "productionCompanies": [
         "Alcon Entertainment",
         "MDS Productions LLC"
      ],
      "summaries": [
         "A shy boy is unable to make friends in Yazoo City, Mississippi in 1942, until his parents give him a terrier puppy for his ninth birthday. The dog, which he names Skip, becomes well known and loved throughout the community and enriches the life of the boy, Willie, as he grows into manhood. Based on the best-selling Mississippi memoir by the late Willie Morris.",
         "A shy boy grows up in 1940s Mississippi with the help of his beloved dog, Skip."
      ],
      "budget": 5000000
   },
   "movielensId": 3189,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-01-14",
      "dvdReleaseDate": "2000-07-11",
      "directors": ["Jay Russell"],
      "runtime": 95,
      "movieId": 3189,
      "title": "My Dog Skip",
      "mpaa": "PG",
      "actors": [
         "Frankie Muniz",
         "Diane Lane",
         "Kevin Bacon",
         "Luke Wilson",
         "Chaon Cross",
         "Harry Connick Jr.",
         "Hunter Hayes"
      ],
      "imdbMovieId": "0156812",
      "originalTitle": "My Dog Skip",
      "genres": [
         "Comedy",
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": ["wjZ7ZI8Fwt8"],
      "plotSummary": "A shy boy is unable to make friends in Yazoo City, Mississippi in 1942, until his parents give him a terrier puppy for his ninth birthday. The dog, which he names Skip, becomes well known and loved throughout the community and enriches the life of the boy, Willie, as he grows into manhood. Based on the best-selling Mississippi memoir by the late Willie Morris.",
      "tmdbMovieId": 17908,
      "avgRating": 3.49902,
      "releaseYear": "2000",
      "numRatings": 2036,
      "posterPath": "/t1jsRTNF1LcVBTfpXWNfrPjgoG1.jpg"
   }
}