{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0169302",
      "video": false,
      "title": "The Terrorist",
      "recommendations": [
         48691,
         23990
      ],
      "backdrop_path": "/w8qiIifzP2SbjDkXMIcuSntG67B.jpg",
      "revenue": 140021,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Malli",
               "gender": 1,
               "credit_id": "52fe475bc3a36847f8131393",
               "name": "Ayesha Dharker",
               "profile_path": "/jf81ATvSd3AY5r1IEvzafErcJ9I.jpg",
               "id": 33191,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Lover",
               "gender": 0,
               "credit_id": "52fe475bc3a36847f8131397",
               "name": "K. Krishna",
               "profile_path": null,
               "id": 1167095,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Lotus",
               "gender": 0,
               "credit_id": "52fe475bc3a36847f813139b",
               "name": "Vishwas",
               "profile_path": null,
               "id": 1167096,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Leader",
               "gender": 0,
               "credit_id": "52fe475bc3a36847f813139f",
               "name": "Sonu Sisupal",
               "profile_path": null,
               "id": 1167097,
               "order": 3
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe475bc3a36847f813138f",
            "name": "Santosh Sivan",
            "profile_path": "/b5gkbpuPfSjV1iXHcXtbRO44O38.jpg",
            "id": 37236,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.505121,
      "production_countries": [],
      "id": 48233,
      "vote_count": 5,
      "budget": 24554,
      "overview": "A young female terrorist goes on a suicide assassination mission, but her resolve to complete it is put to the test.",
      "similar": [],
      "original_title": "Theeviravaathi: The Terrorist",
      "runtime": 95,
      "poster_path": "/hUbH2hhcBmcothEIpqyuBHXE2FB.jpg",
      "spoken_languages": [{
         "name": "हिन्दी",
         "iso_639_1": "hi"
      }],
      "production_companies": [],
      "release_date": "1998-09-12",
      "vote_average": 7.9,
      "belongs_to_collection": null,
      "tagline": "Her death will not be ordinary.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "India",
      "color": "Color",
      "budgetCurrency": "INR ",
      "directors": ["Santosh Sivan"],
      "runtime": 95,
      "synopsis": null,
      "writers": [
         "Santosh Sivan",
         "Santosh Sivan"
      ],
      "originalLanguage": "Tamil",
      "imdbLink": "http://www.imdb.com/title/tt0169302/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI5MTUyOTgwNl5BMl5BanBnXkFtZTcwMTY5MDkyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Ayesha Dharker, K. Krishna, Sonu Sisupal | See full cast and crew »"],
      "reviews": [
         "I just finished teaching a course in northern Thailand called \"Understanding Cultures Through Cinema.\" This movie was the favorite of the class (and I had some great titles in there!). The students were very moved by the movie, and wrote great papers in response. This short line is my favorite example: \"I liked (reviewer) because (that reviewer) doesn't say whether a terrorist who wanted to sacrifice her life was right or wrong. When your country is controlled by others, you want to have freedom.\" And this from a young sophomore who loves romantic comedies! Talk about a breakthrough!!! Culturally, the students tuned in to some important aspects that don't get noticed: Malli sharing meals with Mr. Vasu, the important moral role played by Lotus/Sorya, and the visual irony of the belt. I gave them a study guide question: How would YOU end this movie? The answers were poignant, and of course, they all mentioned the prevailing motif (which I won't mention here because that would be a spoiler, yes?). When I first saw this movie, I gave it 9. After seeing it several times since, and especially seeing the reaction of my Thai students, I gladly raise it to 10. This is one of my top ten movies of all time.",
         "the terrorist is one of the best movies ever to come out of india. the movie is totally unlike the normal indian bollywood movie. part-inspired by the events surrounding the assassination of late prime-minister rajiv gandhi, terrorist takes a look into the minds of an assassin. the movie moves at a steady pace giving us time to understand the protagonist and sympathise with her. this bond is accentuated by ayesha dharkar's terrific acting, she clearly is a unique talent and hopefully the whole world will get to appreciate her in star wars II. santosh sivan who is essentially a cinematographer takes to directing and comes up with a gripping tale. the movie shines with his brilliant work behind the camera as well, capturing every beautiful raindrop & the subtleties in dharkar's expressions. the movie stands out as special, intelligent & warm, among its peers. a truly significant movie a fantastic 10!!",
         "The movie is about a girl who is sent on a mission to assassinate a VIP by becoming a human bomb. It can be related to the assassination of Rajiv Gandhi, former Prime Minister of India. A notable fact is that no where in the movie is there a mention about the roots of the girl nor who the VIP is. It rather narrates the incidents that occur from the time she is chosen on this mission. The movie has wonderful cinematography by Santosh Sivan and good performances by all the artists. All the artists were very natural making the movie more realistic. The unconventional ending has done justice to the narration.",
         "\"The Terrorist\" is a non-violent film about violence and the subtlety of its camera work and overall direction might remind you of a travelogue rather than a searing drama about political fanaticism. The film takes place in India and yet we don't have any information on what the conflict is nor do we see the rebel leader whose hand controls all the subversion. That really isn't important but what is important is studying the assassin, Malli, who has so many close-ups that it border on obsession as the filmmakers try to reveal the conflicts she has to resolve in her mind, from her eyes blinking at the drops of rain to her face to face encounter with her lover soldier to her final makeup before meeting her destiny. Three men reveal themselves to Malli at pivotal points and the film underscores it with a technique of keeping the background unfocused until it is called for - the lover soldier who sees Malli as an obscured vision, the boy Lotus who stands too late to see his fate, and the VIP as he is greeted by the young women. Never are explosions seen nor direct killings exposed, we only hear gun shots or the splatter of blood on the murderer's face or the bloodied machete. The film seems to tip its hand by introducing the likeable 'Mad Vasu' and his comatose wife with her outstretched hand of comfort but, in truth, we had no way of anticipating the ending. You might want to compare \"The Terrorist\" to \"Day of the Jackal\" or even \"La Femme Nikita\" but such comparisons would be unfair. \"The Terrorist\" is a much better film because it allows the audience to unravel the mind of an assassin, in isolation, without the prejudice of killed bodies or self-serving violence. \"The Terrorist\" is a powerful adventure into the lonely paths of the human soul.",
         "First, I will note that this movie is way atypical for an Indian movie: 1h30 long (instead of 2h30); no songs; no glamorous encounters that are Fate's will to unite 2 persons; no super Tamil hero;... This is a movie with hidden political plots. While no places nor important characters are named, one can find out the utmost realistic background of this movie. The terror techniques are those of the LTTE: cyanide capsules for not being taken alive, suicide bombers (LTTE invented the explosive belts. Other terrorist groups then reused it), children warriors. I did not understand that this movie is related to the assassination of Rajiv Ghandi, but after reading such comments, I must agree (the fact that Malli uses a boat to get to her mission location is a clue that it is to happen in India; Tamil Nadu, from the language spoken by the peasants). When I read some commentators comparing this movie to 9/11, I feel they are wrong: the LTTE terrorism is not about a godly will, but about \"freeing\" Tamil people living in Sri Lanka. Other commentators asked why there are some black screens when Malli is thinking hard. Here is my answer: It is related to Vasu's comments about the seed that need to go into the darkness of the earth to evolve from tiny seed to a big tree. It is a rebirth of Malli. This fact is also shown with Malli sleeping more and more in foetal position as the assassination day approaches. To be understood fully, this movie requires some background about LTTE, Sri Lanka, Cinghalese VS Tamil situation... While this movie is not in my top ten, it remains a good one. Santosh Sivan proves here courage with a politically engaged movie that is surely unpleasant to (some? many?) Tamil people. Even in the title of the movie being \"The terrorist\" (instead of something like \"the Martyr\", \"the Hero\" and so forth...)",
         "I am writing this review after the horror of Tuesday 9/11/2001. All of us have wrestled with the question of how and why would someone commit such an atrocity believing that their act was blessed and sanctioned by God Almighty. As I asked myself this question I remembered this movie. I remembered the beautiful vulnerability of the face of Ayesha as she struggled with her decision to become a suicide bomber to seek justice for herself and her people after she discovers that she is pregnant. Ayesha is able to telegraph every nuance of her thought and emotion as the camera slowly, painfully examines every pore of her skin, every lash of her dark, liquid eyes. While the premise of the film is fundamentally simple, by the time the film is over the sacredness of life and wrenching paradox of its questions has been intimately explored. As raw as birth itself this film is a rare piece of poetry.",
         "This movie should be seen, if for any other reason than to see a story told with minimal dialogue. The script couldn't have been more than 30 pages. Great visuals, and great acting using expression and editing. The only problem is that the ending should have been cut by about 5 seconds. Once you see it you will know what I am talking about. With little dialogue I was suprised how enthralled I was. I never once remember feeling like the movie should move faster. Worth a view.",
         "This film is easily one of the best movies I have ever seen. The idea of seeing the human side of a guerilla-trained killer is amazing in itself, and the film lives up to that promise. Ayesha Dharkar is an extremely talented actress, much more than just a pretty face. Her portrayal of Malli gives a real sense of the conflict between fatal patriotism and personal hopes, as Malli begins to question her personal beliefs for the first time in her life. Her rapid softening-up may be unrealistic, but it is still a haunting performance that causes the viewer to question, \"Could I have made the same choice?\". The other characters play their purposes well, being cold (the guerilla leaders), frightened (the boy Lotus), or lonely and sympathetic (the old man Vasu). However, this is plainly Dharkar's movie. The score is unlike any I have ever heard, mostly because of the unique Indian instrumentation and composition. It does create an incredible atmosphere of suspense, that grabs hold of the viewer and doesn't let go until the gripping conclusion. The combination of these two elements with a well-paced script (seems neither too long nor too short) makes for an intense film with a lasting impact.",
         "This is a starkly sad and beautiful film by the Indian filmmaker Santosh Sivan, in the Tamil language with English subtitles. It was shot in 17 days on locations in Kerala and Madras with a cast made up entirely of nonprofessional actors on a small budget. The theme, however, is large. The lead character, Malli, exquisitely played by Ayesha Dharkar, is a 19-year old woman who lives in a terrorist camp, fighting for her unnamed country. Her eyes are large and her expressions innocent and strong and even though we see her actively participating in an execution, she wins the audience's heart immediately. She is honored by being chosen to become a suicide bomber. A very important person will come to the town, she will put a garland around his neck, and blow him and herself up by pushing a button which will ignite the bombs strapped to her body. But will she really do it? When she leaves the guerilla camp she is led through minefields by a young boy named Lotus. We glimpse the horror of the war through his eyes and his boyish bravery. Then she is taken on a boat to spend a few days with a elderly farmer named Vesu who doesn't suspect her mission. As she dresses for the final event, she is torn with conflict. By subtle complexities in her acting, the audience is drawn in to Malli's dilemma. However, the director sometimes gets a little too arty, with too many close-ups with raindrops on her face. And, in order to show every single emotion, the action of the story moves too slow for my taste. However, the beauty of the film lies not as much in the actual story, but in the director's ability to put a human face on terrorism. The mood is somber, the cinematography beautiful and the emotions of the individuals caught up in the drama are captured well. I recommend this film for serious film buffs only who are willing to incorporate sadness and starkness into their movie-going experience. Others will find it too harsh.",
         "My awareness of suicide bombers came slowly. Once it was grossly wrong. I can barely trace its origins. Conrad's Secret Agent? The myth of the eager kamikaze pilot? Self-immolating monks during the Vietnam War? Joan of Arc retracting her recantation? Those last two political in effect but without collateral damage. Maybe because the rest of us associate suicide with despair or even illness, because we imagine it a solitary act preventable by just the right word from a hotline phone operative, I imagined that suicide bombers in the Middle East and elsewhere acted spontaneously and alone. As if the first and only decision could come seconds before boarding the target bus. As if explosives grew under rocks and leaves. Reading the headlines I'd perceive anger, despair, courage, but miss entirely that someone, someone probably with no intention joining in the self-sacrifice, had to provide not just explosives, but training in their use, and that along with that had to come if not coercion then at least persuasion, cajoling, indoctrination. Much of Santosh Sivan's The Terrorist takes place in a forest as lush as any Miyazaki's ever penned. Malli's journey to her VIP target is a fairytale journey. She's a hero. Her sure-to-survive-her mentor purrs \"You're supreme: A thinking bomb.\" We say that now about tech, about robotics, but in this context it's magic. Young boys, knowing, gape in awe of her. Flashbacks to her brother's and to another's deaths imply that she was born a terrorist so can't possibly feel or deserve blame, and that her people's war is mystic, without beginning or end. In flashback, she discovers beside a river a hand attached to a body apparently dead, but that soon murmurs something \"books\" and then \"You're a girl!\" He's never seen one so close. Gnome-like ferry guide, Surya: \"In the forest every tree, bird, leaf is known to me,\" but both continuing and marring the magic: \"I know here every mine is.\" When an enemy patrol truck hits a mine he hides his eyes: \"We must go another way. There will be blood and flesh everywhere.\" When Malli kills, he's distraught, disillusioned. Malli's less squeamish, yet her eyes, like Surya's, never rest, never stop watching. In the dark river flashbacks there's a side shot so near her pupil and iris form a huge reflective orb. Once she arrives, housed with the philosophy spouting oldster and his comatose wife in a settlement that seems barely maintained against the forest, the terror-bound watchfulness, self-protection, and determination in those huge eyes of hers morphs just slightly toward curiosity. With soldier-like spontaneity, she reports to her new mentor the old man's questions, but backs off at the suggestion he's a threat. She's changed from battle wear to saris, does chores, accepts the old man's friendliness. When he hints that he knows her mission, she opts, probably against her training, to protect him. When she hesitates at assassination rehearsal, the coach prods \"Don't think! Don't think!\" The phrase may damn him in the minds of some viewers, especially us Westerners, but how different is it from Douglas Adams's sarcastic but supremely reassuring \"Don't panic!\"? In the final scene, while she hesitates, flower petals waft across her hand. There the film ends. We don't know what she does, what happens. In reality, she's hesitates so long, the trigger is so exposed, that she might be trapped, might have appeared suspicious. The thing could go off accidentally or by intent as they rush her. But no matter. The film has ended. There is no beyond: only a loop back to film's beginning. All was artifice, myth, hero journey. I really hesitate, lest I offend about this film's very serious and timely subject. But just as the near magic lethal forest here suggests Miyazaki, Malli has no little in common with San, the wolf princess, Mononoke, in Miyazaki's Mononoke Hime."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Moderne Gallerie Motion Picture",
         "Wonderfilms"
      ],
      "summaries": [
         "Malli is a 19 year old girl, who joined a terrorist organization at a very young age after her brother was killed in the cause. Now in her young adulthood, she volunteers for a suicide assassination mission to kill a VIP in the service of her cause. With intricate preparations and seemingly firm resolve, she makes her way to the target area where the plot will be executed. However, events occur that make her question her determination to complete her mission and the very nature of the sacrifice that she is called upon to make.",
         "A young female terrorist goes on a suicide assassination mission, but her resolve to complete it is put to the test."
      ],
      "budget": 1091250
   },
   "movielensId": 3192,
   "movielens": {
      "languages": ["हिन्दी"],
      "releaseDate": "1998-09-12",
      "dvdReleaseDate": "2000-12-05",
      "directors": ["Santosh Sivan"],
      "runtime": 95,
      "movieId": 3192,
      "title": "The Terrorist",
      "mpaa": null,
      "actors": [
         "Ayesha Dharker",
         "K. Krishna",
         "Vishwas",
         "Sonu Sisupal"
      ],
      "imdbMovieId": "0169302",
      "originalTitle": "Theeviravaathi: The Terrorist",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "A young female terrorist goes on a suicide assassination mission, but her resolve to complete it is put to the test.",
      "tmdbMovieId": 48233,
      "avgRating": 3.66774,
      "releaseYear": "1998",
      "numRatings": 155,
      "posterPath": "/hUbH2hhcBmcothEIpqyuBHXE2FB.jpg"
   }
}