{
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Parris Patton"],
      "runtime": 76,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0198385/",
      "coverLink": null,
      "actors": ["Stars: Filberto Ascencio, Butch Dean, Dusty Dean | See full cast and crew »"],
      "reviews": [
         "I would give this a 10 out of 10, but I did walk away from the film wanting to know more about certain aspects of Stacey's life. I too grew up in a small town (farm) in West Michigan and saw many of my parents attributes in Staceys. I am not going through any changes as Stacey, but I found myself nervous for her when she would go home. I applaud her parents for loving her for who she is. I enjoyed the film very much. I never lost interest. I have friends going through the change and it is not something they decided over night and it is an internal and external struggle for them. I believe this film was an honest portrayal showing all sides. I didn't enjoy the scene regarding the fights with Stacey and her boyfriend. But understand that was part of the film. I would like to see where Stacey is at now with her life. After watching this film I thought to myself if I was a producer, this would be a possibly idea for a reality show. not something to laugh or make fun of, but a real inside look at a persons struggle to go from one sex to another. Congrats to Stacey for giving us an up close and personal look inside her life.",
         "This documentary tracks Kyle Dean in his amazing transformation from male to female, although we don't get much of the specifics of her transition, like HRT regimen and if and when she had a sex change. The transition seems to take about 4 years from the time he started hormones at age 23 (he started at 18 as a cross dresser at Arena in LA), although we see \"Stacy\" being passable around 6 months into HRT. Simply amazing! The progesterone I couldn't find information on, so I'm guessing it came from Mexico (Tijuana), a common source of hormones for young girls in the Southern California area, which is where I transitioned. But nowadays, people get their hormones over the net, so this probably isn't the case anymore. For someone in their teens or 20's, and wanting to see what hormones can do, I recommend this film. For the transitioning, I felt this was a great motivation. Particularly the voice, where we see Kyle already getting it down prior to starting HRT. The time line I compiled from watching this film numerous times is: Stacy \"Hollywood\" Dean DOB: July'71 · 1989: First time dressing up; away from home in LA; started at Arena with Barbarella; started developing voice · Dec 1994 Start of Documentary; Stacy has been working at Arena for 5 years as well as prostitution · Jun 1995 Start of Hormones · Dec 1995 Boobs; tennis outfit on couch · Dec 1996 No more Kyle; Bathroom door crack; dog on bed · Dec 1997 7-Eleven; going home · Dec 1999 Boob enhancement; Pose on bed; Dominatrix · Jun 2000 Register for classes at LA City College",
         "A Pearl at great price. Like in the fable where a rich man gave all he had to possess a great pearl. That is what I see this movie about. I wished it showed more it is hard to get an opinion of who Stacey is . But I admire her determination to be who she wants to be.",
         "Kyle Dean has a very horrid past. He or she is a known con artist and has a horrible reputation for trouble making, and is intensely hated in the trans gender community. The film was pretentious and false, nothing like the real Kyle Dean/Stacey in real life. Nothing truthful at all in this scripted documentary. A documentary should be more directed than allowing it's subject to dictate the direction of the movie. Perhaps we can find more insight in other documentaries about the trans community. Hopefully other filmmakers will learn a valuable lesson in this, never fully trust your subject completely. The film was a mess, just like the CREATURE"
      ],
      "genres": ["Documentary"],
      "productionCompanies": [],
      "summaries": ["Kyle Dean was a misfit in her North Carolina school. She was called \"Creature\" because she was a boy who knew she was a girl in part of the country where such things were not understood or tolerated. As soon as she could she left North Carolina for Hollywood where she felt that she'd stand more of a chance of becoming who she wanted to be. Now as Stacey she's going back to visit with with Mom and Pop."],
      "budget": 0
   },
   "movielensId": 3193,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-01-15",
      "dvdReleaseDate": null,
      "directors": ["Parris Patton"],
      "runtime": 0,
      "movieId": 3193,
      "title": "Creature (1999)",
      "mpaa": null,
      "actors": [""],
      "imdbMovieId": "0198385",
      "originalTitle": "",
      "genres": [],
      "youtubeTrailerIds": [],
      "plotSummary": null,
      "tmdbMovieId": 0,
      "avgRating": 2.95,
      "releaseYear": "2000",
      "numRatings": 10,
      "posterPath": null
   }
}