{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0013662",
      "video": false,
      "title": "Tess of the Storm Country",
      "recommendations": [53761],
      "backdrop_path": "/8KRCdnvbvGQhwZ3l1DEC2GqBQll.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Tessibel 'Tess' Skinner",
               "gender": 1,
               "credit_id": "52fe4822c3a368484e0eab91",
               "name": "Mary Pickford",
               "profile_path": "/1kG12uiv0VPNaPCjbkLkRLTqmIW.jpg",
               "id": 100047,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Frederick Graves",
               "gender": 2,
               "credit_id": "5458a3170e0a26115800179a",
               "name": "Lloyd Hughes",
               "profile_path": "/qY78DZDcs9XRVugZ49Z5ZaPFKTp.jpg",
               "id": 29261,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Teola Graves",
               "gender": 0,
               "credit_id": "5458a32ac3a368399d001702",
               "name": "Gloria Hope",
               "profile_path": "/45aOGx3YVbHKsEw2sDU59qCjXgm.jpg",
               "id": 1302584,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Elias Graves",
               "gender": 2,
               "credit_id": "5458a33e0e0a261165001725",
               "name": "David Torrence",
               "profile_path": "/cejygbRMOBNOVy6wlp78P0TddaT.jpg",
               "id": 32139,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Orn 'Daddy' Skinner",
               "gender": 0,
               "credit_id": "5458a3500e0a26116a001632",
               "name": "Forrest Robinson",
               "profile_path": null,
               "id": 1262680,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Ben Letts",
               "gender": 2,
               "credit_id": "5458a3620e0a2611550017a3",
               "name": "Jean Hersholt",
               "profile_path": "/47EWS9uYU5vx10cnyjtqVVDytnI.jpg",
               "id": 32138,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Ezra Longman",
               "gender": 0,
               "credit_id": "5458a3890e0a26116a00163a",
               "name": "Danny Hoy",
               "profile_path": null,
               "id": 1381584,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Mr. Daniel 'Dan' Jordan",
               "gender": 2,
               "credit_id": "5458a3d1c3a36839a0001670",
               "name": "Robert Russell",
               "profile_path": null,
               "id": 1381585,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Old Man Longman",
               "gender": 0,
               "credit_id": "5458a3e3c3a36839a70017b9",
               "name": "Gus Saville",
               "profile_path": null,
               "id": 1348634,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Mrs. Longman",
               "gender": 0,
               "credit_id": "5458a3f60e0a2611550017b3",
               "name": "Madame De Bodamere",
               "profile_path": null,
               "id": 1381587,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Bit Role (uncredited)",
               "gender": 2,
               "credit_id": "5458a4080e0a261165001738",
               "name": "Milton Berle",
               "profile_path": "/kVcyz4eVl1Z8jZYciuybdMqUPvo.jpg",
               "id": 69951,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "(uncredited)",
               "gender": 0,
               "credit_id": "58f236e59251412fb500b251",
               "name": "Jeanne Carpenter",
               "profile_path": "/ljzZijyQGrCaX0cbFG84yFrlV2.jpg",
               "id": 1158634,
               "order": 11
            },
            {
               "cast_id": 21,
               "character": "Child (uncredited)",
               "gender": 0,
               "credit_id": "58f236eec3a3682ee200a325",
               "name": "Maxine Tabnac",
               "profile_path": null,
               "id": 1796669,
               "order": 12
            },
            {
               "cast_id": 22,
               "character": "Girl in Church (uncredited)",
               "gender": 1,
               "credit_id": "58f236f9c3a3682ece00a194",
               "name": "Mavis Villiers",
               "profile_path": null,
               "id": 97250,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4822c3a368484e0eab8d",
               "name": "John S. Robertson",
               "profile_path": null,
               "id": 29571,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "58f236969251412fa900ac8f",
               "name": "Elmer Harris",
               "profile_path": null,
               "id": 234677,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 2,
               "credit_id": "58f2369dc3a3682e3f00aa07",
               "name": "E. Lloyd Sheldon",
               "profile_path": null,
               "id": 105450,
               "department": "Writing",
               "job": "Scenario Writer"
            },
            {
               "gender": 1,
               "credit_id": "58f236a5c3a3682e6600aee8",
               "name": "Josephine Lovett",
               "profile_path": null,
               "id": 145830,
               "department": "Writing",
               "job": "Scenario Writer"
            },
            {
               "gender": 1,
               "credit_id": "58f236b09251412fc700b40c",
               "name": "Mary Pickford",
               "profile_path": "/1kG12uiv0VPNaPCjbkLkRLTqmIW.jpg",
               "id": 100047,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "58f236b99251412fdf00b1eb",
               "name": "Charles Rosher",
               "profile_path": null,
               "id": 9080,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "58f236bf9251412fb100b633",
               "name": "Frank Ormston",
               "profile_path": null,
               "id": 105954,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "58f236c7c3a3682ee200a305",
               "name": "Shaw Lovett",
               "profile_path": null,
               "id": 29576,
               "department": "Directing",
               "job": "Assistant Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.210035,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 71067,
      "vote_count": 3,
      "budget": 0,
      "overview": "Wealthy Elias Graves builds his home on the top of a hill, where a group of squatters have taken up residence at the bottom. Many of the men in the squatters' village have their eyes on young Tess, and one of them, Ben Letts, frames Tess's father for murder. While maintaining her father's innocence, Tess must keep her love for Graves' son a secret, while caring for Elias' daughter's illegitamate child.",
      "similar": [],
      "original_title": "Tess of the Storm Country",
      "runtime": 118,
      "poster_path": "/prwkCGF1ZoQihqAEaxkkjDl9ZPp.jpg",
      "spoken_languages": [{
         "name": "No Language",
         "iso_639_1": "xx"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "United Artists",
            "id": 60,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Mary Pickford Company",
            "id": 21540,
            "origin_country": ""
         }
      ],
      "release_date": "1922-11-12",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["John S. Robertson"],
      "runtime": 137,
      "synopsis": null,
      "writers": [
         "Grace Miller White",
         "E. Lloyd Sheldon"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0013662/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgxMTI2MDU3MF5BMl5BanBnXkFtZTgwMDQyNzM2MzE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Mary Pickford, Lloyd Hughes, Gloria Hope | See full cast and crew »"],
      "reviews": [
         "Here is proof of why Mary Pickford was `America's Sweetheart.' In this rather complex drama, Mary plays the young daughter of a squatter that dare to dream of a relationship with the son of one of the `hill-toppers.' The scenes where they steal a kiss and otherwise fall in love are simply delightful. She is even willing to take a bath. That Mary could pull this role off at the age of 30 is simply amazing and somewhat due to her diminutive stature (5'). Tess must face numerous physical and emotional challenges. She does so with spunk not seen in many heroines of the time. Tess packs a wallop and is not shy about fighting with anyone. Why she agrees to help the `hill-topper' daughter is beyond me, but she sacrifices her own happiness in order to keep a deep secret. Pickford's close ups are wonderful. Danish-born Jean Hersholt is simply wonderful as the villain. The scene in which he manhandles a small baby is enough to make you throw vegetables (or whatever) at the movie screen. If Forrest Robinson (who plays Daddy Skinner) had worn a beard, he would have been a match for the model used in those World War I recruiting posters of Uncle Sam \u0096 Wants You! Although the story is somewhat predictable and slow in the beginning, it is worth the investment in your time to see the piece or pure `Americana.' The film highlights choices available to us all involving making someone else happy and what it is to be a real Christian. Recommended.",
         "I had never seen a silent movie until July 24, 2005. I had never seen a movie with Mary Pickford in it. I've seen thousands of movies. Very few are hypnotic to me. I found Last of the Mohicans and Unforgettable (Ray Liotta) to be hypnotic, so consider the source as you read this. I started watching Tess of the Storm Country on TCM just to see who this Mary Pickford was, who has been credited by many for launching Hollywood. I had no idea what I was in for. Two hours later, I snapped out of it, and realized I'd watched one of the most beautiful women I had ever seen, playing a role perfectly suited to her. Imagine a movie fan in 1922, having never seen anyone that gorgeous and that expressive before. You would have to see her again and again. The setting was perfect for a girl that expressive. She was a poor squatter, couldn't speak the King's English, but you had to admire her. What a movie... time to start my Mary Pickford movie collection!",
         "Uneducated & defiant, beautiful TESS OF THE STORM COUNTRY is the daughter of a fisherman squatting on a rich man's land. Spirited & bold, she captures the heart of the millionaire's son, but violence, terror & sudden death are what will haunt her immediate future before she can claim the sweet peace of happiness. Mary Pickford is utterly charming in this splendid, heart-wrenching film. She considered Tess to be her favorite role and she fills it with all the spunky joy & enthusiasm which made her for years the world's most popular movie star. The story has all the essential elements for a modern fairy tale, with Mary the lovely, distressed heroine beset by all manner of dangerous, stressful situations. The atmospherics are first-rate, with the outdoor fishing village sets being particularly well-conceived. In the supporting cast, Jean Hersholt stands out as the vile villain who tries forcing Pickford to marry him. Hersholt, a very gentle soul off screen, manages brilliantly to depict his character's complete moral corruption. This was actually the second time Pickford filmed TESS. A 1914 version had been one of her first important films, but its production values were a bit antiquated by the standards of the 1920's (no close-ups, for instance) and Mary, producing her own films & powerful enough by 1922 to make whatever film she wanted, decided for the only time in her career to remake a film. The end result certainly lived up to her expectations. Both films were very popular at the box office. A fascinating study for some future film researcher would be the influence of Christianity in Mary Pickford's life; it certainly runs like a golden thread through the silent movies she produced. Although the romanticism inherent in the very nature of silent cinema might cause these spiritual sentiments to appear somewhat awkward today, we are compelled to accept them as sincere reflections, by their very repetition, of Mary's heartfelt beliefs. In TESS, one beautiful scene in particular stands out in this regard: Pickford is teaching herself to read using a Bible. She indicates to Lloyd Hughes (who plays her sweetheart) a word from near the back of the Book that she does not understand. He mimes it for her (the word is obviously `crucified') and, eyes turned Heavenward as the full meaning of the Sacrifice dawns upon her, Mary's face becomes positively beatific. A splendid new orchestral score for TESS has been supplied by Jeffrey Mark Silverman which perfectly underscores the beauty & pathos of this wonderful film.",
         "Mary Pickford often stated that Tess Skinner was her favorite movie role. Well said! She played the part twice and for this version which she herself produced, she not only had to purchase the rights from Adolph Zukor but even give him credit on the film's main title card. Needless to say her portrayal of this role here is most winning. Indeed, in my opinion, the movie itself rates as one the all-time great experiences of silent cinema. True, director John S. Robertson doesn't move his camera an inch from start to finish, but in Robertson's skillful hands this affectation not only doesn't matter but is probably more effective. A creative artist of the first rank, Robertson is a master of pace, camera angles and montage. He has also drawn brilliantly natural performances from all his players. Jean Hersholt who enacts the heavy is so hideously repulsive, it's hard to believe this is the same man as kindly Dr Christian; while Lloyd Hughes renders one of the best acting jobs of his entire career. True, it's probably not the way Mrs White intended, but it serves the plot admirably, as otherwise we would have difficulty explaining why the dope spent a fortune on defense but made not the slightest attempt to ascertain who actually fired the gun that killed his future brother-in-law! Needless to say, this particular quality of the likable hero is downplayed by Jack Ging in the bowdlerized 1960 version which also totally deletes the author's trenchant attack on smug, middle-class Christianity. Notice how the well-washed priest here moves forward a pace or two in surprise at the interruption, but then makes no attempt whatever to assist our plucky little heroine in the performance of duties that he himself was supposedly ordained to administer. This is a very moving scene indeed because it is so realistically presented. \"Tess\" also provides an insight into the work of another fine actress, Gloria Hope, whose work was entirely confined to silent cinema. She married Lloyd Hughes in 1921 and retired in 1926 to devote her life completely to her husband and their two children. Lloyd Hughes died in 1958, but she lived until 1976, easily contactable in Pasadena, but I bet no-one had the brains to interview her. Another opportunity lost! To me, Forrest Robinson only made a middling impression as Skinner. I thought he was slightly miscast and a brief glance at his filmography proves this: He usually played priests or judges! But David Torrence as usual was superb. In all, an expensive production with beautiful photography and marvelous production values.",
         "Besides being a good melodrama with some fine moments, the role of Tess offers Mary Pickford quite a showcase, providing some good comic moments, a number of moving scenes, and some tense confrontations. You can see why it was not only one of her most popular roles, but also one of her own favorites. The story is quite involved and sometimes thought-provoking, although there is more than one occasion when it sacrifices believability for cinematic effect. At the beginning it introduces an interesting assortment of characters, and sets up the conflicts to come between the family of rich, mean-spirited Elias Graves and the poor squatters (including Tess), whom Graves is devoted to driving out. The tumultuous events that follow test their loyalties and perspectives. It does have more implausible or coincidence-laden developments than do most of Pickford's movies, but if you can suspend disbelief on those occasions, it's an entertaining story that makes you care about the characters. It's also quite a bit longer than most of Pickford's features, but that is primarily because there is so much going on; there aren't too many slow spots. In its time it was one of her signature roles, and it's still well worth watching.",
         "Not only was she the most famous and popular woman of her time, Mary Pickford was also the only film actress who had the power and independence to successfully re-film the same story, that had catapulted her to mega stardom 8 years earlier, with the results surpassing the first version brilliantly. The plot is still heavy melodrama, but again Tess is performed with Mary Pickford's unique naturalness, that helps the character to remain captivating and delightful throughout the story. All of the characters are much more convincing with a life of their own, giving this 1922 version of Tess an emotional force that was missing from the original film. Charles Rosher's cinematography is extremely exquisite as he faced a colossal lighting job, since many of the dramatic scenes took place at night. In the 1914 version of Tess, these were shot by day and tinted blue to resemble night. Rosher preferred to do the job properly. An enormous amount of equipment had to be shipped over the mountains to reach the filming locales. The generator alone cost three times the budget of the 1914 film! All of this paid off, for Tess once again pleased both the audiences and critics. One could say the story is still old fashioned and dated today, but with the sheer brilliance of Mary Pickford, this Tess of the Storm Country is an absolute work of art and remains purely enjoyable to watch.",
         "TESS OF THE STORM COUNTRY is a big, busy story about religious hypocrisy in rural upstate New York wherein a Bible-thumping landowner in a hilltop mansion battles a community of hard- scrabble squatters who live below by the lakeside. Spunky Mary Pickford (30 years old at the time of filming, but playing a girl of 17) is the titular character, the daughter of a poor fisherman who is wrongly convicted of murdering a local official. The main villain, a repellent and lecherous squatter who tries to frame Pickford's father, is played by the normally sweet and gentle Jean Hersholt, who is virtually unrecognizable in his role. Kudos must go to Pickford not only as a performer who acts with her whole soul, but as a producer who supervised the construction of a realistic looking village of dilapidated waterfront shacks, and cast within it a gaggle of individuals who look like they came right out of the \"hollers\" of Appalachia. Although the sets are impressive, what goes on within them often cannot pass muster with 21st century viewers. A few of many examples: after Pickford tosses a cauldron of boiling liquid into Hersholt's face, he emerges intact and unblistered; a driving snowstorm outside Tess's shack covers a visitor's coat with flakes but leaves the boardwalk to the front door not only bare but bone dry; Tess takes a bath, including a voluptuously sudsy washing of her copious blonde locks, with nothing but a single bucket of water and in the middle of a wooden floor no less, and emerges clean as a whistle\u0085. uh-huh. Charming scenes: Tess and her boyfriend so smitten with each other that neither one notices that the sleeve of his jacket has burned off after hanging next to the fireplace; bits of business involving a crow that makes a nuisance of itself around the house, providing comic relief between the waves of heavy-breathing melodrama. A showdown in a church, details of which would spoil the story, is still powerful. The most lasting impressions, however, come from Pickford's and Hersholt's stellar performances and the vividly constructed physical environment.",
         "TESS OF THE STORM COUNTRY is possibly the best movie of all of Mary Pickford's films. At two hours, it was quite long for a 1922 silent film yet continues to hold your interest some 80 years after it was filmed. Mary gives one of her finest performances at times the role seems like a \"greatest hits\" performance with bits of Mary the innocent, Mary the little devil, Mary the little mother, Mary the spitfire, Mary the romantic heroine, etc. characteristics that often were used throughout a single film in the past. The movie is surprisingly frank about one supporting character's illegitimate child for 1922 and at one point our Little Mary is thought the unwed mother in question! If the Academy Awards had been around in 1922, no doubt the Best Actress Oscar for the year would have been Mary's.",
         "This film does not fail to engage and move, even in 2008 to an audience only familiar with modern over-produced sound and computer enhanced techniques. The experience of the movie goer in 1922 who could only see this in a cinema with others on their big screen must have been truly profound and a thoroughly satisfying experience. One has to ask could a film maker today make a two hour silent movie and make it interesting and achieve the same structure tempo and balance as this movie has. Silent film making was pure art, it had to hold the attention through its structure, direction and acting - there was no padding out with more words or computer generated distractions. A poorly made or uninteresting silent movie is unwatchable. This film needs to be put into context for those who might be disconcerted with the mention of Christian themes. This is not a 'Christiany' film, it is not selling anything. These themes along with reference to current moral standards often appear in this era - also church going on Sundays was a national past time, Christianity was a given in most households thus the film is only depicting normal life as it was then. The themes would have rung true and deep at the time. It is most odd given the strong support to good Christian thinking of this particular movie (and it is not preaching religion to anyone, only highlighting the difference between hypocrites and the honest)that in 1922 a Pastor in an open debate with a representative from the film industry with a large crowd denounced Pickford as an example of immorality, along with some other individuals he named. NY Times 1922. Maybe they should have watched this movie that also came out in 1922 and, learned some lessons. The Pastor complained that since the film industry had started church attendance had dropped 500,000. The film representative in the debate however made the following observations; that saloon attendance had also dropped, that there were far more pastors in prison than actors (fact) and that selecting a few examples from among the many was not representative of the whole. Thus there was an ongoing battle between church and the film industry during the early days of film. This is a wonderful film about being honest and true to family friends and to be willing to make sacrifices. Mary Pickford, naive, honest, feisty, full of happiness and joy, faithful, humorous and silently sacrificing - though poor and uneducated she represented the perfect character. This however is not thrust down our throat but revealed bit by bit through the film. This is reminiscent of some modern Chinese films where characters are slowly, languidly revealed over the course of a film and it is this tempo that creates a stronger connection with the character. It has a smooth even tempo for the first half that builds all the elements for the last section. The last 30 minutes are great film making and it has to be appreciated it was achieved without the benefit of sound, running dialog - it was achieved through deft acting and great directing. It is sometimes surprising to realize that at the end of the film you haven't hear a word spoken, but it feels like you have heard everything. The supporting cast put in great performances especially Gloria Hope, Jean Hersholt and Lloyd Hughes. The final few minutes are typical Pickford understated humor as she goes outside under the pretext of sweeping the snow, a near perfect balance and ending. This is a special type of touching humor that should not be underestimated. Chaplin used this device often and copied some of from Pickford. Another special observation to be made about Silent films and especially Pickford films is that the star often has to hold the camera for much of the movie without the audience becoming jaded or bored, with the actors over-exposure. That Pickford is usually thoroughly the center of attention through most of her movies but the people still couldn't get enough of her is a testament to her fine acting ability.",
         "Had this been the original 1914 version of TESS OF THE STORM COUNTRY (also starring Mary Pickford), I probably would have rated it a lot higher, as this sort of extreme melodrama and sentimentality was pretty typical of the teens. However, by 1922, this film was already starting to show its age. And, compared to many of Ms. Pickford's other films (such as DADDY LONGLEGS, SPARROWS, MY BEST GIRL and SUDS), TESS comes up a tad short--and not every Pickford film merits a 10 (even if she was \"America's Sweetheart\"). Now this isn't to say that it's a bad film--it certainly isn't. But, I just can't see how so many have given this film a 10. The film has a very long and complicated plot--especially because most films of the era were shorter. A rich old crank builds a mansion at the top of a hill next to the river. At the bottom of the hill are some dirty squatters who he hates but who he cannot evict. So he tries to come up with a variety of ways to get them off the land. One ends up in tragedy, when his daughter's fiancé is killed in a scuffle with the po' folks. The man accused of the murder is dear old Mary's father, though he is innocent. To make things a lot worse, the only witness to the real murder won't talk AND the dead man had gotten his fiancée pregnant! So, at this point, we have an innocent man in prison waiting to be executed and a pregnant lady afraid to tell her sanctimonious father she is \"in the family way\". There's a ton more to the film, such as the crank's son falling in love with Mary, but it's best you just see the film for yourself. The film excels in some ways. The plot, while very complicated, is also rather interesting and the cinematography is top-notch. The very final scene is also pretty cute. However, there is so much overt sentimentality you can practically cut it with a knife. Mary is SO good and SO sweet and So plucky, at times the viewer might find it all a bit hard to take. While it worked great in 1922 (making her the biggest star in the world), today it's very dated. This is NOT true of all her films, but this one certainly is. By the way, the Image Entertainment DVD is of decent quality, though a few scenes are badly degraded--something that isn't very surprising considering the age of the film. Also, the only extras included are a brief filmography."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Mary Pickford Company"],
      "summaries": ["Wealthy Elias Graves builds his home on the top of a hill, where a group of squatters have taken up residence at the bottom. Many of the men in the squatters' village have their eyes on young Tess, and one of them, Ben Letts, frames Tess's father for murder. While maintaining her father's innocence, Tess must keep her love for Graves' son a secret, while caring for Elias' daughter's illegitamate child."],
      "budget": 400000
   },
   "movielensId": 3195,
   "movielens": {
      "languages": ["No Language"],
      "releaseDate": "1922-11-12",
      "dvdReleaseDate": "1999-12-14",
      "directors": ["John S. Robertson"],
      "runtime": 118,
      "movieId": 3195,
      "title": "Tess of the Storm Country",
      "mpaa": "",
      "actors": [
         "Mary Pickford",
         "Lloyd Hughes",
         "Gloria Hope",
         "David Torrence",
         "Forrest Robinson",
         "Jean Hersholt",
         "Danny Hoy",
         "Robert Russell",
         "Gus Saville",
         "Madame De Bodamere",
         "Milton Berle",
         "Jeanne Carpenter",
         "Maxine Tabnac",
         "Mavis Villiers"
      ],
      "imdbMovieId": "0013662",
      "originalTitle": "Tess of the Storm Country",
      "genres": [
         "Romance",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Wealthy Elias Graves builds his home on the top of a hill, where a group of squatters have taken up residence at the bottom. Many of the men in the squatters' village have their eyes on young Tess, and one of them, Ben Letts, frames Tess's father for murder. While maintaining her father's innocence, Tess must keep her love for Graves' son a secret, while caring for Elias' daughter's illegitamate child.",
      "tmdbMovieId": 71067,
      "avgRating": 3.16667,
      "releaseYear": "1922",
      "numRatings": 9,
      "posterPath": "/prwkCGF1ZoQihqAEaxkkjDl9ZPp.jpg"
   }
}