{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "san francisco",
            "id": 582
         },
         {
            "name": "nightclub",
            "id": 2334
         },
         {
            "name": "singer",
            "id": 10229
         },
         {
            "name": "musical number",
            "id": 155707
         },
         {
            "name": "female singer",
            "id": 162078
         },
         {
            "name": "night club singer",
            "id": 166463
         }
      ],
      "imdb_id": "tt0050815",
      "video": false,
      "title": "Pal Joey",
      "recommendations": [
         115039,
         31805,
         35926,
         78265,
         43892,
         43277,
         84582,
         70801,
         49457,
         43846,
         129863,
         96337,
         60566,
         24751,
         25113,
         42510,
         43150,
         89581,
         79372,
         22895
      ],
      "backdrop_path": "/fbpWi7AWGbcHCwqS0cXHPHPjzAC.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Joey Evans",
               "gender": 2,
               "credit_id": "52fe45349251416c9102ad37",
               "name": "Frank Sinatra",
               "profile_path": "/vn9qWseEb2LspaS0LBDntH0L4Qw.jpg",
               "id": 4347,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Linda English",
               "gender": 1,
               "credit_id": "52fe45349251416c9102ad3b",
               "name": "Kim Novak",
               "profile_path": "/uTxpa6y6nKo2nfpOP4zsR6abLdi.jpg",
               "id": 5729,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Vera Simpson",
               "gender": 1,
               "credit_id": "52fe45349251416c9102ad3f",
               "name": "Rita Hayworth",
               "profile_path": "/oG6UWxpq552LN5re0TJESUGP0K7.jpg",
               "id": 33741,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Gladys",
               "gender": 1,
               "credit_id": "52fe45349251416c9102ad55",
               "name": "Barbara Nichols",
               "profile_path": "/5327cqoUJIWAg3iatFdVWQmpoW3.jpg",
               "id": 14575,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Ned Galvin",
               "gender": 0,
               "credit_id": "52fe45349251416c9102ad59",
               "name": "Bobby Sherwood",
               "profile_path": null,
               "id": 1247011,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Mike Miggins",
               "gender": 2,
               "credit_id": "52fe45349251416c9102ad5d",
               "name": "Hank Henry",
               "profile_path": null,
               "id": 567530,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Mrs. Casey",
               "gender": 1,
               "credit_id": "52fe45349251416c9102ad61",
               "name": "Elizabeth Patterson",
               "profile_path": "/8seWJt9xJlcVhmtku25uCHuxc5t.jpg",
               "id": 83237,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45349251416c9102ad45",
               "name": "George Sidney",
               "profile_path": "/t5NzhZ8yYL3hDMm5mGNC7t97qSk.jpg",
               "id": 21506,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45349251416c9102ad4b",
               "name": "Hermes Pan",
               "profile_path": "/vzMhrCLaKC7LycGeGS64fDaOM4j.jpg",
               "id": 142625,
               "department": "Crew",
               "job": "Choreographer"
            },
            {
               "gender": 1,
               "credit_id": "52fe45349251416c9102ad51",
               "name": "Dorothy Kingsley",
               "profile_path": null,
               "id": 31069,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.097408,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 33734,
      "vote_count": 19,
      "budget": 0,
      "overview": "Frank Sinatra, at the zenith of his cocky, world-on-a-string popularity, glides through the film with breezy nonchalance, romancing showgirl Kim Novak (Columbia Pictures' new sex symbol) and wealthy widow Rita Hayworth (Columbia Pictures' former sex symbol). The film also benefits from location shooting in San Francisco, caught in the moonlight-and-supper-club glow of the late '50s. Sinatra does beautifully with the Rodgers and Hart classics \"I Didn't Know What Time It Was\" and \"I Could Write a Book,\" and his performance of \"The Lady Is a Tramp\" (evocatively shot by director George Sidney) is flat-out genius. Sinatra's ease with hep-cat lingo nearly outdoes Bing Crosby at his best, and included in the DVD is a trailer in which Sinatra instructs the audience in \"Joey's Jargon,\" a collection of hip slang words such as \"gasser\" and \"mouse.\" If not one of Sinatra's very best movies, Pal Joey is nevertheless a classy vehicle that fits like a glove",
      "similar": [
         254470,
         277216,
         2005,
         407655,
         31900,
         2750,
         85373,
         18126,
         15157,
         45272,
         21468,
         10537,
         16367,
         3087,
         16980,
         38073,
         1125,
         318044,
         18644,
         29884
      ],
      "original_title": "Pal Joey",
      "runtime": 111,
      "poster_path": "/3dwcWwTEvbygxDQtGJw4k9NevPH.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Essex Productions",
         "id": 14154,
         "origin_country": ""
      }],
      "release_date": "1957-10-25",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "From Your Pal, Columbia!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["George Sidney"],
      "runtime": 111,
      "synopsis": null,
      "writers": [
         "Dorothy Kingsley",
         "John O'Hara"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0050815/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc2NDEwNjY0OF5BMl5BanBnXkFtZTcwMzIzMTAyMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Rita Hayworth, Frank Sinatra, Kim Novak | See full cast and crew »"],
      "reviews": [
         "In his career Frank Sinatra did two film adaptions of Rodgers and Hart musicals. The first was Higher and Higher which was his first feature film speaking part. Pal Joey was the second and it is probably the greatest show Rodgers and Hart ever did. When it debuted on Broadway in 1941 it got good, but not great reviews. But everyone loved the Rodgers and Hart score. Bewitched, Bothered and Bewildered and I Could Write a Book were the big hits of the show and were retained for the film. Pal Joey may have been ahead of its times. It was revived in 1951 and ran twice as long as it did in its original production. The reviews were far better. To say this is unusual is putting it mildly. On Broadway, Joey Evans who we would now call a lounge lizard was played by Gene Kelly and in the revival by Harold Lang. The part really fit Sinatra perfectly. But the role had to be changed from a dancing part to a singing part. I believe that was the reason for the interpolation of other Rodgers and Hart songs in the film. And Sinatra sings some good ones in Pal Joey. Added in for the filmgoers listening pleasure are There's A Small Hotel, I Didn't Know What Time It Was, and The Lady is a Tramp, the last one becoming a Sinatra standard in his live concerts. Movie singing don't get too much better than this. Frank is an ambitious man of rather low morals who is caught between rich widow Rita Hayworth and ingenue Kim Novak. He loves Kim, but Rita can give him financial security. These are the kind of people that populate the John O'Hara world, very real and not too noble. Although a few years later Frank Sinatra sang a concert version of Bewitched, Bothered and Bewildered with a hundred piece orchestra for his Reprise record label, it is in fact a woman's song as is My Funny Valentine. Rita does Bewitched as well as Zip. The latter song is a tribute number to Gypsy Rose Lee as Rita plays an ex-stripper. My Funny Valentine is done by Kim Novak. When I say done, both ladies mouthed the words, but the vocals were dubbed as they always were for Ms. Hayworth. And I guess that had to be because both Hayworth and Novak could never have had the parts done by the best of vocalists. As Pal Joey came to the screen in 1957 along with The Joker is Wild, my favorite Sinatra film, I've always picked that year as the year Old Blue Eyes was at the height of his career. His acting is impeccable and his singing, some of the best he ever did on screen.",
         "If you read my title, that's probably all I should have to say about this one. But I'll flesh it out for you a bit. If you couldn't tell, this is one of my favorite musicals, and one of my favorite films, period. In my view, there's not a flaw to be had here--we'd have to invent one, and it would be implausible. I give plenty of 10s, but quite a few are like rating a one-scoop ice cream cone where they forgot the cone, but where there's an extra scoop of ice cream in an attractive dish to make up for it. Pal Joey is like a one-scoop ice cream cone where not only is the cone there, it's the kind of cone you love, and there are two extra scoops of ice cream that happen to be your favorite flavors. Frank Sinatra is Joey Evans, a peripatetic musician who is also quite popular with women, but who has a reputation for not being exactly dependable or trustworthy. As the film opens he's being put on a train with a one-way ticket out of town because he was caught in an almost compromising situation with the Mayor's underaged daughter. He makes his way to San Francisco, where he sees that an old \"friend\"--more like an old debtee, Ned Galvin (Bobby Sherwood), is leading the band in a local club, The Barbary Coast. Joey finagles his way into a job, made more enticing to him, aside from the fact that he's broke, by the large number of very attractive women performers. But the club owner, Mike Miggins (Hank Henry), can see through his conniving ways. Joey, who dreams of one day having his own club, begins falling for Linda English (Kim Novak), despite the fact that Ned is head over heels for her and out of all of the women, Linda is the one who wants the least to do with him. He also runs into Vera Simpson (Rita Hayworth) when he does a society gig with Ned. It seems that Vera used to be a showgirl like Linda, but she \"married up\". Pal Joey is largely about a love triangle between Joey, Linda and Vera. This is an unusual romance in that for much of its length, all of the involved parties are reluctant. Linda may be attracted to Joey, but she knows better than getting involved with such a shifty womanizer. Vera is likewise cautious--especially since she has an implied history with Joey, and she now has a lot at stake. Joey is more than content to not approach commitment--he's satisfied with the string of women who continually pass through his life, who are all too happy to go out of their way to accommodate him--including doing his laundry and politely looking on and smiling when Joey puts the moves on another \"mouse\", as he calls them. As for Joey's interest in the two principals, it's not that he's not attracted to either, of course (what woman isn't he attracted to?), but with Vera he's playing her both for her money/social influence and to undermine what he sees as a feigned identity, and with Linda, he's initially attracted because she's playing hard to get. Both Linda and Vera also end up playing Joey to an extent to get back at him for various ethical blunders. In addition to being intriguing for its uniqueness and relative complexity, all of this works as well as it does because the three leads are incredible performers and the script is intelligent, witty and tightly constructed. Sinatra, Novak and Hayworth are mesmerizing to watch on their own, but they all have great chemistry together, too. The characters seem tailor-made for these actors, despite the fact that the script was based on a popular Broadway show that began its run in 1940, and the Broadway show was itself based on short fiction pieces by John O'Hara that appeared in New Yorker Magazine. Dorothy Kingsley's screenplay is loaded with subtle, quick humor in its clever dialogue. The combination of script, exemplary direction by George Sidney, and the great performances enables a number of very sophisticated dramatic moves, such as the deep backstory between Joey and Vera that is almost completely implied, and the overall atmosphere of the film, with its captivating and paradoxical combination of an ideal, romantic (in a more formal sense) world and a more earthy, cynical reality. The atmosphere is also helped by the lush Technicolor cinematography, with some impressive shots of San Francisco, but equally attractive soundstage set-ups. It's interesting to note Kim Novak's look here, especially when she's framed against San Francisco cityscapes--it's remarkably prescient of her appearance in Hitchcock's Vertigo (1958). I suppose Pal Joey may have been why Hitchcock decided to cast Novak, and it may have influenced him a bit visually. Before I run out of space, I should mention the music, by the incomparable duo of Richard Rodgers and Lorenz Hart, which is one of the best things about the film. Every song in Pal Joey is a gem. As a testament to how good they are, four of them--\"I Could Write a Book\", \"The Lady is a Tramp\", \"My Funny Valentine\", and my personal favorite, \"Bewitched, Bothered and Bewildered\" (the theme of the film)--have become jazz standards over the years. There have been hundreds of recordings by different artists performing them--for that matter there are hundreds of recordings of \"My Funny Valentine\" alone. The arrangements (partially by Nelson Riddle) and performances (especially by Sinatra, but that probably goes without saying) in the film are sublime. If you're a jazz lover, the film would be worth viewing for the music alone, but of course it offers much more than that. Unless you simply hate musicals (in which case it's very unlikely that you've read this far), make sure you see Pal Joey at least once.",
         "I like Sinatra as much as the next girl and then some. Probably the best thing about this film is the numbers The Chairman does alone onstage. However, I'm also well acquainted with PAL JOEY in its stage form, and this watered down film doesn't serve it well. As is so often the case with film musicals, it bears very little resemblance to the show it purports to represent. First of all, like many other movie musicals this one is rife with interpolations. Viewers should realize that both \"My Funny Valentine\" and \"The Lady is a Tramp\" come from Rodgers and Hart's BABES IN ARMS (though, ironically, both were cut from the film version of that musical). \"There's a Small Hotel\" is from ON YOUR TOES and TOO MANY GIRLS gave us the haunting \"I Didn't Know What Time It Was\" (probably the interpolation that works best). Secondly, most of the songs they did keep don't remain intact. For instance, when they moved the setting from Chicago to San Francisco the song the club girls sing went to pot. Also, the lyrics to \"Bewitched\" had to be sanitized for popular consumption, which is a pity because they're some of Larry Hart's best. \"Zip\" was also revised and given to Vera. The witty \"Take Him\" was cut, which is a real pity, and several other numbers are gone entirely or reduced to underscoring. PAL JOEY was one of the first shows to bring cynicism to the musical stage. The second you inject romance into it, you've killed what it's about. If I was just looking for a lightweight love story, I might enjoy this film. Knowing what I know now, I find it a bit tough to take.",
         "Frank Sinatra's movie career was peppered with great pictures; On the Town, Guys and Dolls, From Here To Eternity, Oceans 11 and so on and so forth. Pal Joey is without doubt, up there with the best of them. The movie centers around Joey Evans, a womanizing nightclub singer who finds himself forced to leave Chicago (literally) and start over in San Francisco. His persistence lands him a spot in the Barbary Coast Club, and while trying to lure a wealthy widow (Rita Hayworth) to the club, he plans to land a posh joint of his own. Frank's portrayal of Joey in this movie is wonderfully entertaining; from his Joey-isms (\"Who's the mouse with the built?\"), to the marvelous list of Rodgers and Hart songs he performs. Rita Hayworth may have been given top billing by Sinatra, but there is no doubt as to who the star is, it's Sinatra's show all the way. Sinatra's other leading lady in the picture is the young and beautiful Kim Novak, who plays hard-to-get Linda English, a dancer/singer at the Barbary Coast who is one of the few women who seems to be able to resist his charms. The songs, as I mentioned are great, and include the legendary 'The Lady Is A Tramp', which is a treasure in itself. This is not the actual studio recording of the song, but one recorded for the movie (as all the songs are), and is in my opinion, far superior to it's mainstream counterpart. Joey is not the only one to sing either as both Novak and Hayworth's characters have numbers also, albeit dubbed by other vocalists, unlike Sinatra. The DVD version of this film looks fantastic considering the age of the picture, containing both anamorphic widescreen and full screen versions. The sound also, while only in 2 channel mono, is lively and clear. For entertainment value, I cannot recommend this movie enough. Even if you are initially put-off by its labelling as a musical, you will not be disappointed. It's a gasser!",
         "Based on the naughty Broadway hit and featuring luscious tunes by Rodgers and Hart, Pal Joey was softened from his arrogant heel stage persona for this more sanitized film version. Now-good guy Joey (Sinatra) wants to open a swanky nightclub in San Francisco, enlisting the help of high society dame Vera Simpson (Hayworth), a former chorus girl. But things get sticky when Joey finds his eyes drifting towards the knockout Linda English (Novak). A leggy singer/dancer with aspirations of being a star, Linda also has a soft place in her heart for Joey. Of course, complications abound, along with much singing and dancing, before tying up nicely with a bouncy, breezy, \"walking into the sunset\" Hollywood finish. A couple of assets make Pal Joey unbeatable entertainment. The first are the wonderful Rodgers and Hart standards, mostly performed by Sinatra. Sinatra is at his all-time best. This was Hayworth's last big movie musical and she does not disappoint. Although actually younger than Sinatra, she was playing a role originally meant for Marlene Dietrich. Hayworth is both gorgeous and haunting. A must see for all Hayworth fans!",
         "Lorenz Hart wrote in a different style from his successor as partner to Richard Rodgers (Oscar Hammerstein 2nd). Hart had a more smart alecky type of lyric, less wholesome. But he still was quite a clever and intelligent lyricist. His tragedy was a personal one. Hammerstein had a happy home life. Hart was a troubled bi-sexual (most of the time he was actually a homosexual, but he did love at least one of his Broadway stars, Vivian Siegal, and proposed to her late in his life). He also had a serious drinking problem. Rodgers too had an alcohol problem, but it was in relative control until the 1960s. Hart's growing binges in the 1930s and early 1940s began to fray the partnership. Rodgers would later admit he got tired being a nurse to his partner. Their partnership was remarkably fruitful from the early 1920s to it's completion in 1944, both on Broadway and in Hollywood. But most of their musicals were in the old fashion method of the songs fitted into the book - not worked into the book. Towards the end of the 1930s, with their \"Shakespeare\" musical THE BOYS FROM SYRACUSE and their ballet/dance musical ON YOUR TOES they started doing more modern style musicals where the songs were used to push the story along. But it was not until 1940 that they came up with their masterpiece: PAL JOEY. PAL JOEY was based on a novel by John O'Hara (author of BUTTERFIELD 8 and APPOINTMENT IN SAMARRA). It is actually a modern epistolary novel, with Joey writing letters describing his adventures to a friend (hence ending the letters with \"Your pal, Joey\"). Joey, to put it bluntly, is an opportunistic heel using people all over the place. He hopes to eventually create the classiest nightclub in Chicago (Joey is a professional emcee). He meets two women (Linda who is his age, and Vera who is older and richer). He keeps jumping and reassuring each until he is caught up in a set of cross-purposed lies. A blackmail attempt puts an end to the entire dream, and both women dump Joey. His last song is how his best friend is himself. The original musical flopped - Broadway was yet to be ready for a musical with an anti-hero. But it had a splendid score of clever tunes, many with double-entendre lyrics (such as \"Happy Little Hunting Horn\" and \"Our Little Den of Iniquity\"). It had Siegal as Vera (she introduced \"Bewitched, Bothered, and Bewildered\"), Elaine Stritch (in a supporting part as a reporter who interviewed Gypsy Rose Lee - she sang \"Zip\"), and (as the star) Gene Kelly. It's nice to report that there is surviving color and black and white film from home cameras of Kelly in several scenes dancing. None with the music, however. It was not until a 1951 revival that the musical became a smash hit. If you read the facts on this thread you will see how long the studios tried to get PAL JOEY onto film. It was not until 1957 that it finally got made. Kelly had been originally wanted for repeating the role, but circumstances prevented this. Instead the role ended up with Frank Sinatra, Vera was played by the film's actual star, Rita Hayworth, and Linda by Kim Novak. The main structure of the story was kept, such as the triangle and Joey's dream of being owner/boss of the classiest nightclub (here, though, in San Francisco). Joey's heel personality is still there, but softened towards the end (in the musical he is a heel to the conclusion). The blackmail plot (involving Gladys Bumps and her boy-friend Ludlow Lowell) is dropped, although Gladys remains as a hostile, suspicious chorus girl (she knows Joey's past) played well by Barbara Nicholls. The cast was a Columbia one, with only one face that is a fair regular one among Sinatra cronies (Hank Henry as Mike, the nightclub manager - he also popped up in OCEAN'S ELEVEN and THE JOKER IS WILD). It is a well done song fest of Rodgers and Hart tunes, although two tunes (MY FUNNY VALENTINE and THERE'S A SMALL HOTEL) are not from the show's score, and most of the tunes are dropped. ZIP is rewritten so that it is sung by Vera, formerly a \"Gypsy Rose Lee\" type. But the remainder keep the basic idea of the musical in tact - including a number showing Joey's dream of what his \"Chez Joey\" would have been like. But it is, on the whole, a wonderfully well made musical and certainly among Sinatra's best.",
         "Another marvelous effort from prolific director George Sidney, who once again displays an uncanny ability to make us wish we lived in the and time and place of his films. The classic Rogers and Hart songs selected from the smorgasbord written for the original 1940 play alone make this movie well worth a look. Gene Kelly, a chorus boy a year earlier, was cast in the title role in the original but critically panned \"Joey\" of 1940. The story line for \"Joey\" was too sleazy and cynical for the 40's, but today comes across better than the average fare in support of many musicals of the period. Frank Sinatra is well suited as the film-version Joey. His musical and acting styles add contemporary flavors that are as appealing in the 1950's film version as they were in the critically acclaimed 1952 revival of the play featuring Harold Lang as Joey. Frank's signature song delivery retains, but also in part redefines in a more contemporary way, the classic appeal of the best show tunes of the 40's and 50's. Although Rita Hayworth's acting talents too often are overlooked, she is the standout actor in \"Joey.\" Casting Kim Novak in a 50's film rather defines the genre, and while she is both appealing and likable in her role, you can't help but be aware that she is stretching her limits as an actor, singer, and dancer. Finally, the film is a visual treat, and San Francisco a more than an adequate substitute for Chicago. Don't analyze, just sit back and enjoy.",
         "Close ups of the 24 year old Kim Novak left me breathless. Her beauty. Her face. What a face! Her body. She was (and still is) a great beauty. I was numb from her beauty when she sang the Valentine song. I liked this movie very much. The best descriptive word I can think of to describe Pal Joey is \"delightful.\" Even the dog was cute. A nice, delightful movie, right out of the 1950's. I thought all the actors did a splendid job--the acting, dialog, the story was fine. All in all, Pal Joey is an enjoyable and fun movie. It is interesting to watch movies made in the 1950's. What a difference from today's films. I highly recommend Pal Joey.",
         "I just purchased the DVD of Pal Joey and the picture and colors are breathtaking. It is wonderful to see the scope of 1957 Frisco in digital Widescreen. I will say that those expecting a full, true musical, might be dissappointed. It is a lighthearted movie that contains songs. AND WHAT SONGS THEY ARE. The Rogers and Hart songs never sounded better and it is always a treat to SEE Sinatra perform them, especially here in 1957 when he was at the peak of his artistry. The look and feel of the movie is quite modern, and although tame in comparison to modern films, the script is coy and sexy. It is lighthearted fun and entertainment and all do a fine job in their roles. (Sinatra won a Golden Globe for best actor) . One could only hope that they hurry and remaster the rest of the Sinatra catalog on DVD. Next should be \"Hole in the Head\". I welcome any and all comments...email me!!",
         "It took 17 years for the play PAL JOEY to reach the screen, and even though this 'Joey' is watered-down, the film is still thirst-quenching to first time viewers. The differences between play and film have been exaggerated. San Francisco (film) and Chicago (play) are related. What does grate on people who \"know the score\",in both senses, is the loss of half the stage songs to background music. They are wonderful and I can- not see why Frank Sinatra wouldn't have begged to sing them. I think that Rita Hayworth, sadly aging (at 39 she looked 49), is extremely underrated as 'Vera'. Here again, Rita lost out on a beautiful and witty stage song \"What Is a Man\"? cut altogether. Overall this IS a good film, and George Sidney (as elaborated on in a splendid biography by author Eric Monder) remains an ignored director. Sidney's films, in truth, contain some amazing technical shots and visually beautiful compositions. I refer interested viewers to rediscover the superb and near-dirty stage score of PAL JOEY (check out the 1952 'Studio' CD with Jane Froman, which I prefer). As to a remake, my choice for 'Joey'... Jerry Seinfeld (hope he can sing 'Rodgers'n Hart')."
      ],
      "genres": [
         "Drama",
         "Musical",
         "Romance"
      ],
      "productionCompanies": [
         "Essex Productions",
         "George Sidney Productions"
      ],
      "summaries": ["Joey Evans is charming, handsome, funny, talented, and a first class, A-number-one heel. When Joey meets the former chorus girl (\"She used to be 'Vera...with the Vanishing Veils'\") and now rich widow Vera Simpson, the two lecherous souls seem made for each other. That is, until Linda English comes along. Linda is a \"mouse on the line\" and built like there's no tomorrow. But she's the typical good little girl from a good little home -- just the right ingredient to louse up Joey's cushy set up."],
      "budget": 0
   },
   "movielensId": 3199,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1957-10-25",
      "dvdReleaseDate": "1957-12-14",
      "directors": ["George Sidney"],
      "runtime": 111,
      "movieId": 3199,
      "title": "Pal Joey",
      "mpaa": "",
      "actors": [
         "Frank Sinatra",
         "Kim Novak",
         "Rita Hayworth",
         "Barbara Nichols",
         "Bobby Sherwood",
         "Hank Henry",
         "Elizabeth Patterson"
      ],
      "imdbMovieId": "0050815",
      "originalTitle": "Pal Joey",
      "genres": [
         "Comedy",
         "Music",
         "Romance"
      ],
      "youtubeTrailerIds": ["renmTEWSrHQ"],
      "plotSummary": "Frank Sinatra, at the zenith of his cocky, world-on-a-string popularity, glides through the film with breezy nonchalance, romancing showgirl Kim Novak (Columbia Pictures' new sex symbol) and wealthy widow Rita Hayworth (Columbia Pictures' former sex symbol). The film also benefits from location shooting in San Francisco, caught in the moonlight-and-supper-club glow of the late '50s. Sinatra does beautifully with the Rodgers and Hart classics \"I Didn't Know What Time It Was\" and \"I Could Write a Book,\" and his performance of \"The Lady Is a Tramp\" (evocatively shot by director George Sidney) is flat-out genius. Sinatra's ease with hep-cat lingo nearly outdoes Bing Crosby at his best, and included in the DVD is a trailer in which Sinatra instructs the audience in \"Joey's Jargon,\" a collection of hip slang words such as \"gasser\" and \"mouse.\" If not one of Sinatra's very best movies, Pal Joey is nevertheless a classy vehicle that fits like a glove",
      "tmdbMovieId": 33734,
      "avgRating": 3.38782,
      "releaseYear": "1957",
      "numRatings": 312,
      "posterPath": "/3dwcWwTEvbygxDQtGJw4k9NevPH.jpg"
   }
}