{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "taxi",
            "id": 444
         },
         {
            "name": "sailor",
            "id": 41599
         },
         {
            "name": "road movie",
            "id": 167043
         }
      ],
      "imdb_id": "tt0070290",
      "video": false,
      "title": "The Last Detail",
      "recommendations": [
         26617,
         31657,
         16153,
         25188,
         1847,
         18900,
         28580,
         13776,
         18254,
         980,
         27094,
         14320,
         10403,
         24748,
         14554,
         16619,
         26748,
         14585,
         851,
         32054
      ],
      "backdrop_path": "/q1nlYO7iuTf7E0SmsHF2TdPNk1F.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "SM1 Billy 'Bad Ass' Buddusky",
               "gender": 2,
               "credit_id": "52fe46249251416c7506e9a3",
               "name": "Jack Nicholson",
               "profile_path": "/z5kVLyn3sxj0wNRlFgVgT6deeRO.jpg",
               "id": 514,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "GM1 'Mule' Mulhall",
               "gender": 2,
               "credit_id": "52fe46249251416c7506e9a7",
               "name": "Otis Young",
               "profile_path": "/up1dpLCZ92evL84eMKm8sfooOWo.jpg",
               "id": 77483,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Seaman Larry Meadows",
               "gender": 2,
               "credit_id": "52fe46249251416c7506e9ab",
               "name": "Randy Quaid",
               "profile_path": "/7rywy6gbSTG60xQWepRktD0feek.jpg",
               "id": 1811,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "M.A.A.",
               "gender": 2,
               "credit_id": "52fe46249251416c7506e9af",
               "name": "Clifton James",
               "profile_path": "/AsUHmUSDCP4FpsmxhOlOElpuT0x.jpg",
               "id": 10224,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Young Whore",
               "gender": 1,
               "credit_id": "52fe46249251416c7506e9b3",
               "name": "Carol Kane",
               "profile_path": "/tftY60jQYQBcpGjqAzKIiFNZV2J.jpg",
               "id": 10556,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Marine O.D.",
               "gender": 2,
               "credit_id": "52fe46249251416c7506e9b7",
               "name": "Michael Moriarty",
               "profile_path": "/vWDVdQpYvCS0ez1z0zk5N9BffY9.jpg",
               "id": 21030,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Donna",
               "gender": 1,
               "credit_id": "52fe46249251416c7506e9bb",
               "name": "Luana Anders",
               "profile_path": "/7iFXDZV0NUkagIkmLVviFUqJpmb.jpg",
               "id": 77485,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Annette",
               "gender": 1,
               "credit_id": "52fe46249251416c7506e9bf",
               "name": "Kathleen Miller",
               "profile_path": "/7l8sELhYIizxIXpHiFVFWlETB1a.jpg",
               "id": 42166,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Nancy",
               "gender": 1,
               "credit_id": "52fe46249251416c7506e9c3",
               "name": "Nancy Allen",
               "profile_path": "/rB8vSEB4or8GUYlyv9EBTBEC5eH.jpg",
               "id": 44038,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Henry",
               "gender": 2,
               "credit_id": "52fe46249251416c7506e9c7",
               "name": "Gerry Salsberg",
               "profile_path": null,
               "id": 77486,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Bartender",
               "gender": 2,
               "credit_id": "52fe46249251416c7506e9cb",
               "name": "Don Charles McGovern",
               "profile_path": "/3AO8R8MuFeYsT57QzXZJOX9zMQ6.jpg",
               "id": 77487,
               "order": 10
            },
            {
               "cast_id": 25,
               "character": "Nichiren Shoshu Member",
               "gender": 1,
               "credit_id": "59ced2169251412ef3006be4",
               "name": "Gilda Radner",
               "profile_path": "/emQLbSIFi8ggCQetkXfvWVhZJ95.jpg",
               "id": 46949,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46249251416c7506e9d1",
               "name": "Hal Ashby",
               "profile_path": "/5VRhD4ZMsTyoAsMmxkNuTg41Sta.jpg",
               "id": 4964,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46249251416c7506e9d7",
               "name": "Robert Towne",
               "profile_path": "/hF5R8kmpreIZsv47mIYzDN5XX2Q.jpg",
               "id": 11057,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe46249251416c7506e9dd",
               "name": "Darryl Ponicsan",
               "profile_path": null,
               "id": 66113,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe46249251416c7506e9e3",
               "name": "Charles Mulvehill",
               "profile_path": null,
               "id": 3222,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46249251416c7506e9e9",
               "name": "Gerald Ayres",
               "profile_path": null,
               "id": 77489,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46249251416c7506e9ef",
               "name": "Johnny Mandel",
               "profile_path": null,
               "id": 9796,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe46259251416c7506e9fb",
               "name": "Robert C. Jones",
               "profile_path": null,
               "id": 21012,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe46259251416c7506ea01",
               "name": "Lynn Stalmaster",
               "profile_path": "/rhyzo2qgsGAXIpGTN5OabbZU95U.jpg",
               "id": 1263,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "52fe46259251416c7506ea07",
               "name": "Michael D. Haller",
               "profile_path": null,
               "id": 4982,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe46259251416c7506ea0d",
               "name": "Theodore R. Parvin",
               "profile_path": null,
               "id": 77491,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 1,
               "credit_id": "52fe46259251416c7506ea13",
               "name": "Maureen Sweeney",
               "profile_path": null,
               "id": 77492,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 2,
               "credit_id": "569f683fc3a36858dc009506",
               "name": "Michael Chapman",
               "profile_path": "/uGg69IydM1NTgbjEHZVVyCDOW8s.jpg",
               "id": 1044,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 5.620465,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 14886,
      "vote_count": 112,
      "budget": 0,
      "overview": "Two Navy men are ordered to bring a young offender to prison but decide to show him one last good time along the way.",
      "similar": [
         339,
         35056,
         2330,
         920,
         773,
         1538,
         296099,
         340485,
         48138,
         83770,
         813,
         2898,
         387,
         158,
         4147,
         11282,
         522,
         103,
         19908,
         100042
      ],
      "original_title": "The Last Detail",
      "runtime": 103,
      "poster_path": "/4kcSyOXWd42G2zAzdSXCx6nhflb.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Acrobat Productions",
            "id": 2992,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Bright-Persky Associates",
            "id": 2993,
            "origin_country": ""
         }
      ],
      "release_date": "1973-12-11",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "No *#@!!* Navy's going to give some poor **!!@* kid eight years in the #@!* brig without me taking him out for the time of his *#@!!* life.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Hal Ashby"],
      "runtime": 104,
      "synopsis": null,
      "writers": [
         "Robert Towne",
         "Darryl Ponicsan"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0070290/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAxMjgyMDc2N15BMl5BanBnXkFtZTYwNTgwMzE5._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Jack Nicholson, Randy Quaid, Otis Young | See full cast and crew »"],
      "reviews": [
         "Ever since 9/11, you hear a lot of fluff in the press about our \"heroes\" in the armed services. Typically they are portrayed as wide-eyed, short hair enthusiasm and commitment machines. It's a nice image, but the real version is much more human, much more interesting and much more likable. I was a naval officer for seven years. The best part of my service was the wonderful opportunity to get to know the many men and women who make up the enlisted ranks of our armed services. They tend to be from the rural towns of the south and Midwest or the inner city ghettos. Most of them were average students with limited financial prospects. The ones who succeed in the ranks enough to stay for 20 years do so because the Navy is the first place where they belong. And because they enjoy the job. They get good at it and they believe that what they are doing is much more rewarding and challenging than their friends back home. They also love to party. To drink and to chase skirts and raise hell. They feel entitled to and they are almost always out for a good time without hurting anyone. They also love to mentor the younger sailors to show them how to survive and how to enjoy the time in. The details of this movie are wonderful. The dreary time in transit, ironing uniforms and staring at the walls. Wanting to be at sea, something that few people can imagine until they've done it. The thrill of a few days per diem to blow in bars. The resignation of being a lifer and above all the nature of Navy friendships. Jack Nicholson's character and Otis Young's are not natural friends. They probably wouldn't have time for one another in any other line of work, but having the shared experience of being First Class Petty Officers at the same base is enough for them to be comfortable with one another and to enjoy each other's company. They also both take to the young kid and they both know how to treat him because they've been doing it for so long. I can't tell you how real these characters were to me. I can's say \"Oh Jack reminds me of GSM1 So-and-so and Otis reminds me of QM1 Whatshisname\". IT's too real for that. They both remind me of many, many people I had the good fortune to work with. And they are flawed. They lack the guts to spare Randy Quad from this injustice. They don't even stick together on the way back to Norfolk, probably because they know they did something less than wonderful to the young man. They are indoctrinated but not inhuman. I also enjoyed seeing shades of Jack's work in \"One Flew Over the Cukoo's Nest\". Bad-ass is kind of a rough draft of his McMuphy. This is Jack at his finest. Randy Quaid's performance made me feel a little bit sad. Not just for the character, but for the actor. He had so much talent back then and somehow he got pigeon holed playing big dopes. He certainly has as much talent as his younger brother but not the leading man looks. I don't think I'll ever see him in the Vaction movies without cringing. He should have become so much more. (Of course his other work is entertaining but it's never touching or through provoking as it is here.) And Otis Young was terrific too. I'm not sure why he never got more good roles, but this is something to be proud of. In short, this is the most realistic navy movie I've ever seen. If you're thinking about enlisting, or if a loved one is, this is not a bad way to see what the navy does to a man-good and bad. And it's funny that they do this without ever setting foot on a vessel. I want to find the poster and hang it on my walls next to my commission.",
         "Jack Nicholson is a performer with the rare ability to completely immerse himself in a chosen role and convince the audience of the stark reality of his performance. Playing Navy Signalman First Class Billy \"Badass\" Buddusky in Hal Ashby's 1973 film rendition of Darryl Ponicsan's novel, \"The Last Detail\" is a sterling example of that uncommon talent. Rough-edged but understanding, crude but compassionate, Buddusky and fellow \"lifer\" Gunner's Mate First Class \"Mule\" Mulhall (skillfully portrayed by Otis Young) are \"detailed\" as armed Shore Patrol guards to escort a young sailor, Larry Meadows (Randy Quaid) from Norfolk, Va. to a naval prison in Portsmouth, NH in order to serve an eight-year sentence after being convicted at a court-martial of petty theft. The five-day journey northward is an adventure for all three. Sympathizing with Meadows's plight, apprised of his utter naivete and realizing his sentence far exceeds the severity of the offense, Buddusky and Mulhall conduct their version of a cram course in traditional male rights of passage--ranging from a drunken spree in Washington, D.C. to duking it out with Marines in New York City and getting their charge sexually initiated with a Boston prostitute--if for no other reason than to give him some taste of what he will not be experiencing for a long time and to teach him in some small way to assert himself as an individual. Darryl Ponicsan's novel (which hit the racks at practically the same time the film had been released--the book's ending is quite different and, to me, is much less believable than the film's) was initially hailed as a polemic against what many believed was the cold indifference of the military establishment. However, since that time, it has been judged more a compelling \"slice of life\" drama about the complexities of everyday human behavior and how it is shaped by our own decisions and by entities beyond our immediate purview. And, more importantly, it forces us to think about how our ever-more-complicated society is increasingly unable to find ways to help its young people constructively mark transition into adulthood. \"The Last Detail\" is a sadly overlooked but superb blend of pathos, ribald bittersweet humor, hard-edged '70s realism and insightful and subtle human drama, one that brashly and subtly brought back many personal memories of my Navy hitch and a work that says something to all of us by merely focusing upon a small \"detail\" of a sadly overlooked and unappreciated decade that was alternately (and simultaneously) bleak yet hopeful.",
         "While the question is a bit rhetorical, I do mean it- you don't see that many movies made anymore like this, The Last Detail by Hal Ashby (Being There) and Robert Towne (later to write another Nicholson gem, Chinatown), where the story is just a baseline to the characters studied in subtle and not so subtle ways. It even grows on the viewer if seen multiple times, where what seems to be dragging on is loaded with nuance. There's a level of existentialism to it: how free are Buddusky and Mulhall, or their choices? Probably not much at all, at least not any more or less than the doomed Meadows. But this is not the only method of Ashby on the material, there are also superlative performances from Jack Nicholson, Otis Young, and a newcomer at the time, Randy Quaid. Nicholson and Young play Buddusky (Bad-ass), and Mulhouse (Mule), who are assigned \"chicken-s*** detail\", to transport petty thief Quaid, sent up for eight years in a naval brig. On the way up the Eastern seaboard, the three stop in Washington, New York, and Boston, and the two try to show the youngster a good time before imprisonment. Probably one of the most under-looked pictures of the 1970's, though one of the more note-worthy, especially for it's attitude delivered ten-fold by Nicholson's Cannes winning Buddusky, and Towne script. A scene in a bar in Washington and a scene at a Nichiren Shosu meeting steal the lot, though there's plenty to look for. It's one of my favorite tragic-comic sleepers, and one of Ashby's best.",
         "I read somebody's comment that this film isn't \"deep.\" I think that viewer missed a whole layer of the story. you have to keep in mind that this was written and produced during the vietnam war and released during the early months of Watergate. The story is about these two working class sailors, who are completely disenfranchised, just \"doing their job.\" They're good guys but in the end, don't lift a finger to stop a massive injustice. They don't even take the time to think about it, because they feel there's nothing they can do about it. They pay lip services to how wrong things are about the situation, but in the end they do what \"the man\" says and they're just as much to blame for the problem as the commanding officers above them. Through the course of the film, the sailors meet a lot of \"chatting class\" folks who are mad at Nixon and discussing politics, and they meet Hari Krishnas who are chanting to change things, but nobody is really taking any ACTION. Everyone is pissed off at the injustice of the world but nobody does anything about it. It's about inaction. And that inaction slowly boils up in the main characters and turns into anger that brings the film to a sad end. (It's one of those great stories that gets you pissed off at the injustice in the world...) Having said all that, on a more tangible level, the performances and scripting are full of emotion and Nicholson's and Quaid's performance are amazing and hilarious to watch. But this isn't really a comedy in the end...more tragic really (with some good laughs along the way). Check it out!",
         "I saw this movie when it was released and just watched it again, in its entirety, for the first time since. This means that I'm completely discounting the horribly butchered version I saw on Bravo (for shame!) a year or so ago. They didn't just bleep out the expletives as you would expect, whole scenes were cut, leaving the work so diluted I almost forgot why I had loved it. It was like Jaws without teeth! Revisiting books, films or any work of art first experienced in youth can be very interesting, and I found that watching The Last Detail through my now (# unspecified!) year-old eyes was one of the many times something turned out to be even better the second time around. I guess that makes it a classic. For those that don't know, this is the story of two career enlisted Navy men who are assigned the dreary detail of delivering a young seaman to prison in Portsmouth, NH, where he will serve an eight year sentence for attempting to swipe $40 from their commanding officer's wife's favorite charity box. It's obvious that poor Meadows, played by Randy Quaid, has been thrown to the dogs for his offense, receiving a dishonorable discharge from the service in addition to the excessive prison term, but this is the Navy and our boys must do as ordered. It's a sh*t detail, but it will take them out of their insulated and listless existence on base \"in transition\" - that is, waiting for assignment to sea duty - and they quickly formulate a plan to relieve themselves of their charge as fast as possible and spend the bulk of the allotted time and money remaining to party the way good sailors do, namely drinking and whoring. Enter young Meadows, and the master plan takes on a life of its own as the seemingly hardened \"Bad Ass\" Buddusky (Jack Nicholson) and \"Mule\" Mulhall (Otis Young) find themselves caught up in Naval-infused fraternity with the childlike Meadows. Resigned to his fate, the hapless swabbie's frustrating passivity is fuel to Baddusky's pugnacious nature, and Mulhall and Meadows are swept along with Chief Signalman Bad Ass on a journey of discovery. From teaching him how to get his hamburger served the way he likes it (with the cheese MELTED, thank you very much), to facilitating the loss of his virginity (Carol Kane is perfect as the young prostitute), this is really a \"buddy\" movie at its finest. In the final frames, we watch the two lifers stroll out of the shot in lock-step, \"Anchors Aweigh\" piping, as they're off to reestablish themselves as individuals for a brief moment before returning to the shelter of their sacred family that is the US Navy. There's nothing sappy about this film, don't get me wrong. There's a definite hard edge to it and life as a Naval enlisted man is not romanticized in any way. Visually, it's quite somber from our side of the screen, and the military music in the score is to music, as the military justice in the story is to justice. There are some fabulously funny moments, and of course, Nicholson kills in this part that no one could have played better. Otis Young is really good as the \"cooler head\" who doesn't want to get himself jammed up in any way but who is none the less down with showing Meadows a good time. It's Randy Quaid though, who impressed me most on this viewing. He played the ingenuous, candy bar-filching boy just right, and I'm afraid in retrospect that he got typecast as the big, goofy dumb guy as a result of his work in this picture. I loved everything about this movie, wouldn't change a thing. Oh, and just for the heck of it... here's a little movie/Navy trivia tidbit I found online when I looked up Portsmouth Naval Prison. I have no idea whether there's any truth to it or not, but when I came across it three different times, I decided to add it here. This is from \"Humphrey Bogart: To Have and Have Not\", by Daniel Bubbeo. \"...Bogart's long time friend, author Nathaniel Benchley, claims it is true that Bogart was injured while on assignment to take a naval prisoner to Portsmouth Naval Prison in New Hampshire. Supposedly, while changing trains in Boston, the handcuffed prisoner asked Bogart for a cigarette and while Bogart looked for a match, the prisoner raised his hands, smashed Bogart across the mouth with his cuffs, cutting Bogart's lip, and fled. Bogart used his .45 to drop the prisoner, who was eventually taken to Portsmouth. By the time Bogie was treated by a doctor, the scar that caused him to lisp had already formed.\" Wow, huh? SO much better than say, getting hit in the mouth with a tennis racket or something.",
         "My absolutely favorite Jack Nicholson film has always and forever will be The Last Detail. I don't think he was ever better on the screen as William Baddusky of the United States Navy. I enjoyed his performance and the film itself on so many levels. Probably not surprising since the script was done by Robert Towne who would soon be teaming with Nicholson again for the critical and popular success Chinatown. It's a simple story, not really any plot to the film. Two sailors, Jack Nicholson and Otis Young, both of them lifers in the Navy are stationed in Norfolk and get themselves an assignment to escort a prisoner to the Naval Stockade at Portsmouth. Of course with the per diem allowance for the two men and the prisoner and five days to travel in, Nicholson and Young are thinking of a mini-spree at government expense. It comes to that and a lot more. the prisoner is newcomer Randy Quaid whose big crime is that he attempted to steal $40.00 from a charity collection box. For that he's getting eight years in military prison and a dishonorable discharge. A dishonorable discharge even today is not a good thing for one's resume. As Nicholson and Young both remark, someone really stuck it to him. Let's face it what Quaid did in civilian life would probably be considered petty larceny and his jail time might be measured in days. Turned out it was the base commander's wife's favorite charity so it got stuck to him good. Sad because the indications we get is that Quaid was a troubled kid in civilian life and probably military service offered him a chance to straighten up and fly right. It's done that for many others including Nicholson and Young who make it very clear even on this disagreeable detail they do like the Navy and like serving in it. They've got five days to deliver Quaid to Portsmouth so the journey becomes quite the odyssey for the three of them up the Atlantic coast. The three men have a great chemistry between them, you get involved with their lives and really feel for young Quaid and his plight. Quaid gets shown a good time and maybe that's not such a good thing considering what he is facing. The Last Detail is a nice realistic look at the military both its flaws and good points. A lot of similarity here in the issues raised to From Here to Eternity and if I mention The Last Detail in the same sentence favorably as From Here to Eternity, you know how good it must be.",
         "If you respond to this film, you will probably go all the way and love it as much as I do. It is probably the high point of the drama of social realism started back by the like of \"Marty.\" It is Nicholson's film, yet Quaid and Otis Young(in his only good movie) really shine as well. It is the most heartbreaking of material played without sap or sentiment. Obscenity like this was still pretty new to movies back in 73, be sure to avoid edited T.V. versions. Reading the comments, it is sad that todays movie fans, spoonfed sledgehammer crappola, really can't respond to a drama played with the kind of subtle grace of \"The Last Detail.\" Give it a shot. Ten out of ten.",
         "The Last Detail by Hal Ashby is much like John Schlesinger's Midnight Cowboy in that they are both road trip movies as well as buddy movies. They are about friendships that forged in extreme circumstances and the effect that these experiences have on each character's lives. In the last detail, an unfortunate seaman by the name of Meadows (Randy Quaid) is condemned to jail for eight years for a misdemeanor crime he was unable to even complete. Being caught with his hand in the cookie jar after a mere forty dollars, he is consequently transported from a naval base in the south to the naval prison in Portsmouth, Maine. The last detail of a few veteran naval officers, namely Billy \"Bad Ass\" Buddusky (Jack Nicholson) and \"Mule\" Mulhall (Otis Young) is to transport this eighteen year old, soon to be prisoner up the east coast. The three gentlemen have never met before and all seem to have different interests. Billy and Mule are after some welcomed time off from the suffocating life on the naval base, while Meadows is drowning in his own depression. Billy is more of a lenient presence, while Mule seems to want to do his duty first and then relax. Soon the men form a bond. This bond and their relationship is what carry the movie. Meadows is an innocent and modest teenager who found his way into the navy because of a shop lifting problem. However, after hearing his story and spending time with the boy, the two officers realize the ludicrous charges that have been brought against such an undeserving soldier. They take pity on him and decide to make his last days of freedom ones in which he will cross every right of passage yet to be undiscovered and make them days that he will never forget. As they gradually open up to each other, they grant the prisoner a certain degree of freedom beginning with the removal of the cuffs in the beginning of the movie. They get him drunk in Washington, D.C., involve him in his first fist fight in New York City and help him lose his virginity in Boston. Beyond these rights of passage, the officers also relate to the emotional side of Meadows. They allow him to visit his mother. What the two officers did not realize is that the journey they would take would be reciprocal. They all end up taking their guard down. One of the more poignant lines in the film is when Meadows refers to the officers as his beast friends. Although he has only known them for less than a week, the sad fact is that these men are probably the closest friends that he has ever had. Mule and Billy have had much more life experience and are well versed in the details and idiosyncrasies that life involves. They connect with meadows because before this trip, he had been yet untouched by the worse side of life. His general doe eyed demeanor drives home the fact that he really does not deserve the treatment that he's receiving. Upon leaving the prison, I don't believe that Mule and Billy are so much angry with the way the ascending officer treated them as they are with the situation that Meadows is now faced with. \"We could have prevented this.",
         "Though the film's storyline diverges from the more existential theme of the Darryl Ponicsan novel from which it was adapted, 'The Last Detail' was, is, and remains the only real deal film about navy enlisted men. Hollywood never did sailors so well as it does them here. If you don't care for testosterone-impelled behavior, parochial esprit de corps, scatology, and profanity - well, never mind: the dialogue here is true-to-life sailorese, and the hi- and low-jinks antics are too. If you can't take the heat, get the hell out of the galley. Gritty cinematography of the earthy, low-rent world of enlisted sailors (for example, watching the \"decent peoples' world\" pass by the filth-streaked windows of a worn, smelly railway car) communicates much of the characters' experience of life in the margins and their ethos and how they came by them. The Johnny Mandel score is often oddly, and too-cheerfully irrelevant, though one suspects its breezy take on nautical marches and ditties was meant to be satirical; but it's often discordant with the serious themes - 'the individual versus society', existential choice and haplessness - of 'The Last Detail'. In a role that could have been tailor-made for him Jack Nicholson's acting is perhaps the best of his career - a superior foreshadowing of his later turn in 'One Flew Over the Cuckoo's Nest'. But without Otis Young as his fellow seasoned petty officer and Randy Quaid as the naive young, brig-bound seaman, Nicholson's tour de force would have fallen as flat as a flathat (for all you landlubbers: the navy blue \"Donald Duck\" US NAVY-ribbon bound winter sailors' hats, which sailors hated intensely, that were abolished in the early 60's). Politically correct left-leaning folks should discover in Gunners Mate 1st Class \"Mule\" Mulhall a perfect example of an African American professional sailor: serious yet fun-loving; jocular but no-nonsense; competent and quietly self-assured: in short, a sailor among sailors, a man among men. I know because I served, and when the chips were up or down no sailor cared about color, and each of us cared only that he or she could rely, or not, on our shipmates. Though it has its arcane rules, written and unwritten, the naval service is remarkably egalitarian in opportunity - and it is so without all the hue and cry of civilian \"social consciousness\". Though it's a marvel of a film, 'The Last Detail' could not cram into its running time all the humor and pathos of the eponymous, tough-tender Ponicsan novel (in which petty officer Mulhall's character looms quite a bit larger than he does in the movie, and Billy Buddusky's reflexive resorting to signalling with his Signalman's semaphoring hands spells out apt clues to his worldview); and the novel (which, incidentally, I read while on active duty, before the film had been made) turns out with a dramatically different ending - with a true denouement absent from the screenplay's conclusion that left me wanting, and which is the film's only grave, if quibbling, flaw. But the screenplay incorporates characters, scenes (Carol Kane as the careworn young whore providing Quaid's Seaman Meadows his first experience of coupling), and dialogue that might also have helped the novel to better flesh out and plumb the characters and their experience. Small matter, really: the book and the film contrast and complement each other perfectly. Anyone considering enlistment should see 'The Last Detail' because it tells enlisted sailors' life like it is. If you can take life like it is, with or without the occasional fix ('An Officer and a Gentleman' anyone?) of kitschy, unrealizable romantic fantasy, then 'The Last Detail' is your meat. The Real Deal. Chow Call, Chow Call - All hands lay to the messdeck! Take all you want - Eat all you take. Down to 'The Last Detail'.",
         "Nicholson's \"Bad Ass\" is a beautifully crafted piece of character. He cusses. He fights. He drinks. He's loud. No one else speaks Robert Towne's words better than Nicholson. In this film he overwhelms at every turn. In the bar scene, he shows brute anger and a desire for dominance. The scenes with a young Nancy Allen are delightfully witty because of Nicholson's schoolboy antics of getting a woman into bed. It is the scenes with Randy Quaid (also wonderful) where Nicholson shines brightest. \"Bad Ass\" represents a paternal figure lacking in Meadows' life. He makes him a man by demanding he send back a hamburger if it's not cooked the way he likes it. He demands Meadows to stop crying and be a man. He demands Meadows to stand up for himself and fight when someone pushes his buttons. He demands Meadows to want to have sex, like other men his age. Nicholson's father figure image here is played off perfectly as Meadows sort of imitates things \"Bad Ass\" does. If Bad Ass has a beer, Meadows has a beer. If Bad Ass wants a woman, Meadows wants a woman. There's a secret trust between the two. It's unspoken, but it's there. That trust is broken in the end when Meadows tries to escape. It wasn't all a lie, Meadows just felt that it was time to stop learning and start moving."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Columbia Pictures Corporation",
         "Bright-Persky Associates",
         "Acrobat Productions"
      ],
      "summaries": [
         "Two bawdy, tough looking navy lifers - \"Bad-Ass\" Buddusky, and \"Mule\" Mulhall - are commissioned to escort a young pilferer named Meadows to the brig in Portsmouth. Meadows is not much of a thief. Indeed, in his late teens, he is not much of a man at all. His great crime was to try to steal forty dollars from the admiral's wife's pet charity. For this, he's been sentenced to eight years behind bars. At first, Buddusky and Mulhall view the journey as a paid vacation, but their holiday spirits are quickly depressed by the prisoner, who looks prepared to break into tears at any moment. And he has the lowest self-image imaginable. Buddusky gets it into his head to give Meadows a good time and teach him a bit about getting on in the world. Lesson one: Don't take every card life deals you. Next, he teaches Meadows to drink, and, as a coup de grace, finds a nice young whore to instruct him in lovemaking. Mule, who worries aloud about his own position with military authority, seems pleased with Meadows's progress. However, when the trio reach Portsmouth, the game comes abruptly to an end as reality sets in.",
         "While on base in Norfolk, Virginia awaiting their next sea assignment, naval seamen Petty Officers Billy Buddusky and Richard Mulhall - nicknamed Badass and Mule respectively - are given a short term shore assignment by their Master at Arms: escort a prisoner to Portsmouth Naval Prison in New Hampshire by bus and train via Washington DC, New York City and Boston. That prisoner is eighteen year old seaman Larry Meadows, who has received a dishonorable discharge and an eight year prison sentence for the $40 theft of a charity box. The severity of the sentence is because the polio charity is the high profile pet project of the commanding officer's wife. They have to get Meadows to Portsmouth in five days, a trip they can accomplish in two. As such, Badass suggests to Mule that they milk the system by taking the five days, collecting on the per diems, and whooping it up on their way back to Norfolk with that per diem money in hand. The focus of their trip changes when they learn of the harshness of the sentence in relation to the crime, and after they meet Meadows, who they can see is an inexperienced, naive, somewhat simple and trustworthy boy whose young adulthood will be taken away from him. So, they decide to take the handcuffs off and give Meadows those adult experiences in the next five days that he has so far not had in his short adult life, as well as allow him to get some closure regarding issues in his personal life. They get into one misadventure after another en route. But as they get closer and closer to Portsmouth and the reality of the situation settles in, Badass, Mule and Meadows may look at the situation in a clearer light for themselves individually and for the other two.",
         "Two Navy men are ordered to bring a young offender to prison but decide to show him one last good time along the way."
      ],
      "budget": 0
   },
   "movielensId": 3200,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1973-12-11",
      "dvdReleaseDate": "1999-12-14",
      "directors": ["Hal Ashby"],
      "runtime": 103,
      "movieId": 3200,
      "title": "The Last Detail",
      "mpaa": "",
      "actors": [
         "Jack Nicholson",
         "Otis Young",
         "Randy Quaid",
         "Clifton James",
         "Carol Kane",
         "Michael Moriarty",
         "Luana Anders",
         "Kathleen Miller",
         "Nancy Allen",
         "Gerry Salsberg",
         "Don Charles McGovern",
         "Gilda Radner"
      ],
      "imdbMovieId": "0070290",
      "originalTitle": "The Last Detail",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["6ZUfuN2DNJ0"],
      "plotSummary": "Two Navy men are ordered to bring a young offender to prison but decide to show him one last good time along the way.",
      "tmdbMovieId": 14886,
      "avgRating": 3.86989,
      "releaseYear": "1973",
      "numRatings": 1272,
      "posterPath": "/4kcSyOXWd42G2zAzdSXCx6nhflb.jpg"
   }
}