{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "road trip",
            "id": 7312
         },
         {
            "name": "drifter",
            "id": 13017
         },
         {
            "name": "class differences",
            "id": 14514
         },
         {
            "name": "rebelliousness",
            "id": 196599
         },
         {
            "name": "pacific northwest",
            "id": 196600
         }
      ],
      "imdb_id": "tt0065724",
      "video": false,
      "title": "Five Easy Pieces",
      "recommendations": [
         14886,
         25188,
         3121,
         28580,
         14554,
         1847,
         16305,
         14580,
         11426,
         976,
         18900,
         15919,
         15794,
         11293,
         851,
         903,
         3116,
         13776,
         216,
         24748
      ],
      "backdrop_path": "/xm9BCrsZ1W0kBkA93KtZ9nGqOFN.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Robert Eroica Dupea",
               "gender": 2,
               "credit_id": "52fe450ec3a368484e046053",
               "name": "Jack Nicholson",
               "profile_path": "/z5kVLyn3sxj0wNRlFgVgT6deeRO.jpg",
               "id": 514,
               "order": 0
            },
            {
               "cast_id": 14,
               "character": "Catherine Van Oost",
               "gender": 1,
               "credit_id": "52fe450fc3a368484e04607f",
               "name": "Susan Anspach",
               "profile_path": "/4ngLGsmuhszryrMXVFW5ifzWlDN.jpg",
               "id": 95788,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Rayette Dipesto",
               "gender": 1,
               "credit_id": "52fe450ec3a368484e046057",
               "name": "Karen Black",
               "profile_path": "/xKtsATh6T64NJfE1io1AnofnFRi.jpg",
               "id": 8963,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Elton",
               "gender": 2,
               "credit_id": "52fe450ec3a368484e04605b",
               "name": "Billy Green Bush",
               "profile_path": "/2SRq2WbO2YNGYHGp6hb0Bu8ef.jpg",
               "id": 35090,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Nicholas Dupea",
               "gender": 2,
               "credit_id": "52fe450fc3a368484e046083",
               "name": "William Challee",
               "profile_path": "/EGjPAqwx4qqfK8R6yyr5nLbNU7.jpg",
               "id": 115086,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Stoney",
               "gender": 1,
               "credit_id": "52fe450ec3a368484e04605f",
               "name": "Fannie Flagg",
               "profile_path": "/nelYB0M6WvF7uwArMwhYJZZkyjv.jpg",
               "id": 18251,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Betty",
               "gender": 1,
               "credit_id": "52fe450ec3a368484e046063",
               "name": "Sally Struthers",
               "profile_path": "/dKYNw09OtpSb8Y2CNH3o9UDZjoL.jpg",
               "id": 49352,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Partita Dupea",
               "gender": 1,
               "credit_id": "52fe450ec3a368484e04606f",
               "name": "Lois Smith",
               "profile_path": "/hYZx3vQ1KICO3Db5Cm89yT3pxZo.jpg",
               "id": 2207,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Terry Grouse",
               "gender": 1,
               "credit_id": "52fe450ec3a368484e046077",
               "name": "Toni Basil",
               "profile_path": "/gKXRSWexAbL9g10IkcLrw6NhTsu.jpg",
               "id": 8964,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Spicer",
               "gender": 2,
               "credit_id": "52fe450fc3a368484e046087",
               "name": "John P. Ryan",
               "profile_path": "/lMdObPGv8eNscCpC0ICYSc01t75.jpg",
               "id": 15213,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Samia",
               "gender": 1,
               "credit_id": "52fe450fc3a368484e04608b",
               "name": "Irene Dailey",
               "profile_path": "/4m6RsRiuIhakWXOGMUvMtHolIs6.jpg",
               "id": 179383,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Carl Fidelio Dupea",
               "gender": 2,
               "credit_id": "5301876492514121a1199e57",
               "name": "Ralph Waite",
               "profile_path": "/fvLzvzgEhznLngnM628rXTt53AX.jpg",
               "id": 8853,
               "order": 11
            },
            {
               "cast_id": 8,
               "character": "Twinky",
               "gender": 0,
               "credit_id": "52fe450ec3a368484e046067",
               "name": "Marlena MacGuire",
               "profile_path": null,
               "id": 95784,
               "order": 12
            },
            {
               "cast_id": 11,
               "character": "Palm Apodaca",
               "gender": 1,
               "credit_id": "52fe450ec3a368484e046073",
               "name": "Helena Kallianiotes",
               "profile_path": null,
               "id": 42155,
               "order": 13
            },
            {
               "cast_id": 9,
               "character": "Recording Engineer",
               "gender": 2,
               "credit_id": "52fe450ec3a368484e04606b",
               "name": "Richard Stahl",
               "profile_path": "/iX93hFXsRMOglVvjDI8Fve01TQX.jpg",
               "id": 95785,
               "order": 14
            },
            {
               "cast_id": 13,
               "character": "Waitress",
               "gender": 1,
               "credit_id": "52fe450ec3a368484e04607b",
               "name": "Lorna Thayer",
               "profile_path": null,
               "id": 95787,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe450ec3a368484e046049",
               "name": "Bob Rafelson",
               "profile_path": "/6YJpKfdlyYUz2jOxYaZ5yvqueeC.jpg",
               "id": 19450,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe450ec3a368484e04604f",
               "name": "Carole Eastman",
               "profile_path": null,
               "id": 95782,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5769bad9c3a36835cf00088f",
               "name": "Bob Rafelson",
               "profile_path": "/6YJpKfdlyYUz2jOxYaZ5yvqueeC.jpg",
               "id": 19450,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 1,
               "credit_id": "5769bae29251416e4300009c",
               "name": "Carole Eastman",
               "profile_path": null,
               "id": 95782,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "5769baf992514117790008c4",
               "name": "László Kovács",
               "profile_path": "/qvsRxyAPJw9Kv8ubV2AKWLiUcz8.jpg",
               "id": 8862,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "59a1d86bc3a368483002ecc5",
               "name": "Richard Wechsler",
               "profile_path": null,
               "id": 1458272,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "59a1d877c3a36847f602f5fb",
               "name": "Bob Rafelson",
               "profile_path": "/6YJpKfdlyYUz2jOxYaZ5yvqueeC.jpg",
               "id": 19450,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "59a1d88a925141775b02fe42",
               "name": "Christopher Holmes",
               "profile_path": null,
               "id": 58135,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "59a1d8a9c3a368480e02df98",
               "name": "Gerald Shepard",
               "profile_path": null,
               "id": 168223,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 5.996132,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 26617,
      "vote_count": 143,
      "budget": 0,
      "overview": "A drop-out from upper-class America picks up work along the way on oil-rigs when his life isn't spent in a squalid succession of bars, motels, and other points of interest.",
      "similar": [
         773,
         340485,
         83770,
         1696,
         13523,
         88,
         4147,
         597,
         41733,
         277216,
         86829,
         11879,
         258480,
         2898,
         158,
         920,
         11282,
         19908,
         100042,
         50456
      ],
      "original_title": "Five Easy Pieces",
      "runtime": 98,
      "poster_path": "/4JsIxivzyj6xEiX1DrD8icONjqZ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Raybert Productions",
         "id": 4541,
         "origin_country": ""
      }],
      "release_date": "1970-09-12",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "He rode the fast lane on the road to nowhere.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Bob Rafelson"],
      "runtime": 98,
      "synopsis": "Bobby Dupea (Jack Nicholson) works in a rural California oil field with his friend Elton (Billy 'Green' Bush), who has a wife and baby son. Most of Bobby's free time is spent hanging out at a local diner during his lunch and dinner breaks to see his waitress girlfriend, Rayette (Karen Black), who has dreams of singing country music. On weekends, Bobby hangs out in the company of Elton, with whom he bowls, gets drunk, and has sex with other women. Bobby has evidently not told anyone that he is a former classical pianist who comes from an eccentric family of musicians. When Rayette becomes pregnant and his friend Elton is arrested and sent to jail for having robbed a gas station a year earlier, Bobby quits his job and leaves for Los Angeles where his older sister, Partita (Lois Smith), also a pianist, is making a recording. Partita informs him that their father, from whom he is estranged, has suffered two strokes and is now an invalid. She urges him to return to the family home in Washington State. As Rayette has threatened to kill herself if Bobby leaves her, he very reluctantly asks her along to his home town. Driving north, they pick up two women headed for Alaska, one of whom is obsessed about \"filth.\" The four of them are thrown out of a restaurant when he gets into an argument with a waitress who refuses to accommodate his special order of a chicken salad. After dropping off the two women (who are implied to be a lesbian couple), Bobby and Rayette check into a roadside motel for the night. The next day, nearing his destination, Bobby, clearly embarrassed by the Southern trailer-trash Rayette's lack of polish and crude manners, tells her to remain at the motel before proceeding to his family home on an island in Puget Sound. Upon arrival at his family's country house, Bobby finds Partita giving their father a haircut, but the old man seems completely oblivious to him. At dinner, he meets Catherine Van Oost (Susan Anspach), a young pianist engaged to his younger brother, Carl (Ralph Waite), a violinist. Despite personality differences, Catherine and Bobby (in which she and everyone in the family formally calls 'Robert'), become attracted and make love in her bedroom. After two weeks, Rayette becomes bored at the motel and comes to the Dupea estate unannounced. Her presence creates an awkward situation, but when Samia, a pompous family friend, ridicules Rayette's background, Bobby gives a fiery defense of her. Storming from the room in search of Catherine, he discovers his father's male nurse giving Partita a massage. Now more agitated, Bobby picks a senseless fight with the massue, and is quickly knocked to the floor. The next day, Bobby tries to convince Catherine to go away with him, but she declines, believing that Bobby does not love himself or anything at all. After trying to talk to his unresponsive father, Bobby leaves with Rayette, who makes a playful sexual advance that is angrily rejected. In the final scene, when Rayette goes in for some coffee at a gas station, he gives her his wallet and then abandons her, hitching a ride on a truck headed north into Canada.",
      "writers": [
         "Carole Eastman",
         "Bob Rafelson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0065724/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNzc3Mzk1NjY2MV5BMl5BanBnXkFtZTcwMzkxMDEyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Jack Nicholson, Karen Black, Billy Green Bush | See full cast and crew »"],
      "reviews": [
         "This film is a classic because it operates and works on every level imaginable, a truly evocative film. Other posters have elucidated upon and discussed the musicology of it, and the significance of Chopin. I'll take their word for it, and not go there. That's out of my league. And, as others have noted, the film is an exploration and study of character, which it certainly is. All that and more. I see the film as being in its own way a period piece unto itself, the period being films made in the late 60s and early 70s. It is quintessentially representative of what was an important movie circa 1970. Of course the storyline of an alienated young man (Jack Nicholson as Robert Dupea), walking away from all that is expected of him, and indeed walking away --if not running away-- from his prodigious gifts, and doing it all with a cocky attitude, no longer resonates quite the way it did in 1970. But, if you weren't around in 1970, trust me, it resonated well then. It was a theme that seemed important and meaningful at the time, even though the character's motivations for his actions are never really explained and remain something of a blank slate for the viewer to fill in. In 1970, when the concept of an \"identity crises\" was big, it worked to just suggest and imply that Dupea felt the need to Quixotically search out and determine for himself what was important for him. That dovetailed with another important component in many movies of that era --you never explain yourself, because if you explain things, you trivialize it all and ruin it. Or, as Jenny, Ali McGraw's character in Love Story (also a 1970 film) put it, \"Love means never having to say you're sorry.\" Meanwhile, unfolding alongside the Dupea character, was Karen Black's tour de force performance as the big-haired clingy-dependent waitress girlfriend, Rayette, and doing it to a medley of apropos Tammy Wynette tunes. Karen Black's performance perfectly captured and spot-on nailed an almost ubiquitous sort of woman prevalent in that era, when the social changes wrought by the women's movement had not yet taken fruit. As for the notorious diner scene, this one scene essentially dominates the whole movie. It is something that people who have seen the movie will bring up and talk about, even decades later. Yet the scene is in no way pivotal or important to the story. At most it once and for all permanently affixes in the viewers' minds that Dupea was an impulsively flippant and angry person, not one to meekly abide any of life's minor frustrations. But we were already getting that picture of him before this scene happens. And, courtesy of Dupea, the scene provides a snippet of gratuitous social commentary about inflexibility and the stupidity of mindless adherence to meaningless rules. Something for the viewers to cheer and say, \"I can relate to that!\" Those things aside, to me the real value of the scene was that it provided an entertaining contrast in a bleak drama, a needed change of pace. But regardless of whether it was a statement about Dupea's attitude, or a social comment about stupid rules, or a needed amusing interlude, no matter which of those it is, its lasting impression renders its importance out of proportion to the movie as a whole. Surely, as he made this film, director Bob Rafelson's never intended that 35 years later this particular scene be the main thing viewers took away and remembered about the film. In this sense, as entertaining as it is, the scene therefore must be viewed as being a bit of a story-telling flaw. In retrospect, it should have been toned down just a skosh. But, then, on the other hand, were it not for this scene, perhaps the film would hardly be remembered at all. It is already a largely overlooked masterpiece. This movie pops up on the movie channels on a semi-regular basis, and when it does I always stop and am riveted. The cinematography is superb. The acting is superb. Nicholson turning in one of the performances from that era that made him the unhinged star in the first place, long before he became a parody of himself. But be warned, it is not a \"happy\" film. It is the product of an era that did not as a rule produce happy films. But it is nevertheless a film that must be seen.",
         "Previously known only for creating 'The Monkees', Bob Rafelson produced an underrated masterpiece when he made 'Five Easy Pieces', a film that deserves to be a lot better known. Jack Nicholson, typically intense but atypically understated, has possibly his finest hour as Bobby Duprea, a self-hating misogynist ill at ease with himself and the world. Many people will, when thinking of Nicholson, bring to mind his pantomime pyschopath Johnny from 'The Shining'; but Bobby, a profoundly human creation, is actually far more scary. Elsewhere the film features characteristically gorgeous cinematography from Laszlo Kovaks; a soundtrack that skilfully offsets Tammy Wynette and Chopin; excellent writing throughout and some very black humour. Like a less extreme version of Mike Leigh's 'Naked', and bristling with uncomfortable truth, 'Five Easy Pieces' is a true classic of 1970s cinema. Few films today are as good.",
         "Bob Rafelson's FIVE EASY PIECES is about inner pain and suffering that just so happens to consume people in all walks of life. It is sometimes hard to watch and Nicholson's character \"Robert\" is a miserable SOB. However, he is also a very compelling character who affects all around him. He is lonely, he is scared, and he does not know what to do with himself. If you are looking for plot, this is not the picture for you. The only remnants of a plot concern Nicholson's father, a distant memory of his previous prestigious lifestyle as a classical pianist, who has fallen sick. Jack decides to visit his family's estate to pay his last respects. This sets the forum of emotional indifference and misery. He hates his old life, which he left to become a construction worker and has taken up with a flighty waitress played brilliantly by Karen Black. He pretends to enjoy this simple way of living, but he treats Black like the trash he considers her to be and could care less about anyone. Why should anyone see this film? Because Jack Nicholson is one of our greatest actors and he is able to transcend what was put on paper regarding the main character and project raw power and feelings in his own, unique way. The movie is littered with classic scenes, in particular, the chicken salad sandwich scene, one of the funniest I've ever seen. The one I feel that stands out and symbolizes the essence of the film is where Jack plays Chopin in the piano room while Rafelson's camera does a slow 360 around the room, glancing at pictures of his life before he fled from it. It is a perfect mixture of intensity, music, and sadness. The last scene, which ends so abruptly, makes perfect sense within this context. It leaves us feeling empty and unfulfilled, exactly how Nicholson's character feels. This is what makes this character piece all the more powerful.",
         "Jack Nicholson plays the lone rebel who is infuriated with his prodigal and affluent upbringing in suburban Seattle...As a rebellion to his adolescent environment, he shifts his adult habitat to a rural, lower middle class lifestyle in South Carolina!! Jack Nicholson is constantly abrasive, and volatile, from dawn to dusk!! He basically hates his wife,(Karen Black). His wife is a promiscuous simpleton who is always apologizing for herself!! Karen Black was perennially type cast as the \"crazy broad\" in the 1970's!!! His home life is one whereby irrational behavior, and depressants of one form or another, are an assurance of what someone doesn't want in their lives without the ability to change it!! As the movie progresses, his father's failing health dictates that he must return to the sadness and reassurance of his family for a junket with reveille and disenchantment!! His biggest downfall is that he cannot understand why people cannot understand him!!!..His one night stand exacerbates his emotional resolve!! He is told with point blank disinterest that his personality can no longer sustain a relationship, regardless of his devotion or non-devotion to marital fidelity!! Selfishness precludes all other emotions with everyone of the characters in the movie!! Jack Nicholson feels that the best way to vindicate himself is to fly the coup from his spousal commitment!!...The film \"Five Easy Pieces\" signifies the five pieces of music Jack Nicholson had to master on the piano as a young child!! This film is an excellent depiction of the isolated feelings that all the characters in the movie experience!! The aggregate rancor in this movie serve as a devastating force for a sadly encroaching me-ism generation!!.. The setting, Washington State, is slightly different for the early seventies, back then, virtually all esoteric lifestyles were generally illustrated in New England or New York!!.. Everybody's subconsciously negative proclivities, which culminated with a vindictive individualistic preoccupation, were characteristics that had always been taboo in movies before... Even ordering things like wheat toast and chicken salad became a form of hostile debate!! Deductive reasoning was successfully accomplished; as explained by the two lesbians Jack Nicholson picked up hitchhiking!! The lesbians were another unusual idea that was innovative for a movie made in the early 1970's!! The moral decline of Jack Nicholson in this movie hence signified the harbinger of ethical decay in the United States!! This film is utterly brilliant, because!! it is avant-garde.. UNFORTUNATELY!!!",
         "In discussing films with extraordinary characterization, Bob Rafelson's \"Five Easy Pieces\" is an exemplary example. The film is an intense character study of an alienated, misfit drifter who seems to have no specific direction or place in life. Jack Nicholson brings to life Robert Dupea, a man who has considerable natural musical talent, but has rejected that life and his family who is also musically talented. There are hints throughout the film that Robert had great promise as a concert pianist if only he had stuck with it. He contains many of the creative personality characteristics that would predispose him to musical greatness. Psychologists who study creativity have found that generally creative people contain a number of specific personality characteristics. Robert contains many of them, but has generally abandoned creating anything. I would first like to comment on why I feel the film received the title, \"Five Easy Pieces\". I at first thought that it might be because Robert plays piano five times throughout the film. But in a second viewing, I counted and he only played piano four times, including the time where he mimics playing the piano at the dinner table when discussing his experience playing in Las Vegas. I pondered a little further and realized that the title was likely spawned from the five classical pieces listed in the introductory credits; Chopin's Fantasy in F minor, Bach's Chromatic Fantasy and Fugue, Mozart's E-flat major concerto, Chopin's Prelude in E minor, and finally Mozart's Fantasy in D minor. I myself am not a musician, but other people who do play music have told me that these pieces are somewhat difficult to play. But Robert can sit down and play them with no problem. In this sense, the title \"Five Easy Pieces\" is somewhat ironic. One of the main characteristics of creative people is 'alienation'. I will discuss this concept first because alienation is one of the central themes of the film. The alienation that lies in Robert is a direct result of his lack of direction towards any one particular life. In his case, one life would be the average working class type of person and the other would be that of a musician. Robert seems to be caught somewhere between the two. He came from a talented, musically oriented family and was at one point, a promising pianist, but now engages in a common, working class lifestyle where he drinks beer, bowls, listens to country music and chases after women. But it is evident that he does not feel settled in this lifestyle. He is as much of a misfit among the common community as he is among the musical atmosphere of Puget Sound. In essence, he is a nowhere type of man. Robert also displays the personality characteristic of 'naivete', meaning that a person tends to act somewhat child-like. Creative people tend to be quite impulsive and open to emotional display, and are quite often labeled as temperamental. Poet, Earl Birney states that \"poets might just be people who have not overgrown their love for poetry as a child\". Many researchers have theorized that the creator is like a child. Schiller argues that you can not create if your intellect (a uniquely adult attribute) hinders you. Another theorist, Osborne argues that to be creative one must eliminate the mature, intellectual attitude, and that creative people are able to resist premature judgements through the use of brainstorming techniques, producing many ideas and alternatives. Freud said that both the child and the creative person are similar in that both have unfulfilled wishes and desires. Satisfied people do not create. He argued that all people need an escape from reality; in adulthood we daydream (play internally) for wish fulfillment, but the creative person keeps it external by creating something such as a symphony, poem, or a painting etc. At many points in \"Five Easy Pieces\", Robert displays child like behavior. This is characterized most notably in the famous scene where he explodes at a waitress in a diner because the establishment does not have the meal that he desires. He flies into a temper tantrum and sweeps all of the glasses and menus off the table. Another wonderful scene illustrating Robert's naivete is the one when he jumps aboard a truck with a piano in the back and begins playing it during a traffic jam. Creative people, like children are often open to high emotional display, and hence Robert seizes the moment by playing the piano to get his mind off the traffic jam which he has lost patience with. He, like many other creative people is very confident, self assertive, dominant, and independent. The film's narrative neatly unfolds, Robert's insecurity, another common creative trait. Many great creators have doubts about the quality of their product and the authenticity of their talent, hence the notion that creative people are never satisfied. It is quite evident that Robert has high doubts that he could be a great pianist. This is probably why he ended up being a drifter, choosing the common, trailer park sort of life. There is a scene near the end of the film where Robert is speaking with his father and in a way apologizing for his own life and not living up to the expectations of the family. He states that they both know that Robert is not any good anyway. This is a depiction of his insecurity. But not only is he insecure about his talent as a musician; he is also insecure about his life in general. He is caught somewhere in between two worlds, the world of the common man and the world of the creative musician, and thus is always running away from things as a result. All of the creative theory aside, \"Five Easy Pieces\" is very enjoyable on the level of acting. Jack Nicholson nails the character of Robert Dupea dead on. The character called for a certain degree of arrogance and obnoxiousness which are characteristics that we all know that no one can portray better than Jack. **** out of ****",
         "This movie is most famous for a scene in which Jack Nicholson tells a waitress to hold the chicken salad between her knees so he can get some plain wheat toast, but, in a movie as good as this, that very famous scene may be its least memorable one. After that scene, I hadn't heard anything about what this film was really about, and its depth and power took me completely by surprise. It's a story of a man trapped in his own life, unable to find a place to settle. All the locations at which he has arrived have lead to nothing but disappointment and the realization that there just might not be a life for him. God, how I can sympathize. Just as I was starting to question whether Nicholson was as good an actor as everybody seems to think he is, I've come upon his very best performance. Karen Black plays his girlfriend, a hick who loves him to death. He's not sure if she's good enough for him, or vice versa. Lois Smith, Ralph Waite, and Susan Anspach give good supporting performances. A flat-out masterpiece.",
         "\"Five Easy Pieces\" was one of the most revered films of the 1970s. It was the film that showed audiences what Jack Nicholson could do, after having worked for many years in movies that were seen only by real cinephiles, but not by a wider audiences. Not having seen the film in a long time, we decided to watch it when it showed on cable recently. The only thing is the copy we saw was not anamorphic in format, which on key scenes almost shows a blank screen while the characters talk off camera! Bob Rafelson and Carole Eastman created a screen play that dealt with existential themes, a rarity in the American cinema. Mr. Rafelson was at the height of his creative period, something that later projects seem to contradict the promise he showed at the time. Bobby Dupea, the main character of the story, is a complex individual who has left a life of privilege and culture behind to become an oil rig worker and getting away from his previous life. At the time we meet him, he is involved with Rayette, a simple woman who loves him, but one can see how different they are. That contrast comes more obvious when Bobby goes back home and meets Catherine, his brother's fiancée, who is a musician and seem to be more attuned with Bobby than the simple minded Rayette. \"Five Easy Pieces\" was a film that showcased the enormously talented Jack Nicholson doing some interesting work. The measure of his acting ability is seen about half way in the movie as Bobby, Rayette, and the two lesbian hitchhikers have stopped at a diner. Bobby's meal order request creates a match of words in which Mr. Nicholson shows what he is capable of doing. The film concludes with a puzzling scene, as Bobby and Rayette are heading back home. We watch them stopping at a gas station and little prepares us for what happens next. In a way, we have seen all along the film how restless Bobby has become and it's clear that in spite of his being with Rayette, she will never understands how to make him happy at all. The reason for watching \"Five Easy Pieces\" is Jack Nicholson. His character is the most interesting one in the film and he does an excellent job in creating the tension behind this complex man he portraits. Karen Black's Rayette is annoying at times because of her whining. Susan Anspach comes out better playing Catherine. Some other familiar faces in the cast are, Sally Struthers, Ralph White, Lois Smith, Billy Green Bush and Fannie Flagg. \"Five Easy Pieces\" is one of the best films of that decade.",
         "This incredible movie would have to be one of Jack Nicholson and the totally underrated Karen Black's finest hours (and a half!). This would probably be my favourite movie of all time and though you might find it initially depressing you too will find many instances of black humour with repeated viewings. Everybody and their dog always raves about the chicken salad sandwich diner scene and the dialogue between the main character and his invalid father but for my money the money shot is when Bobby first tells Rayette he has to visit his family ALONE and as he tries to leave without her (which wouldve ended up being the most humane thing he does in the film!!) he finds his car wont start at the crucial moment and he completely loses it in his car cursing a lotta four letter words under his breath. I wont go into the details of what this film is about but its thoroughly entertaining and works on many levels. Fans of this sort of drama should check out WHEN YOU COMIN BACK, RED RYDER as well for superb character breakdowns also. If you thought the main character in Michael Leigh's NAKED was a miserable lost soul on a road to nowhere you aint seen nothing yet til you check out Jack in this!! A complete masterpiece from beginning to end. Great soundtrack with Tammy Wynette by the way and Karen Black shows off her awesome vocal style as well......",
         "In 1969, Jack Nicholson made his big break in \"Easy Rider\", and the very next year, he got his first lead role in another \"easy\": \"Five Easy Pieces\". He plays Robert Eroica \"Bobby\" Dupea, a man from a well-off musical family. Bobby has given up his potential, choosing instead to work in the oil fields. Angry and with no goal in life, he spends most of his time drinking, partying, and ignoring his girlfriend Rayette Dipesto (Karen Black). Then, his father has a stroke, forcing Bobby to visit his family. Staying with his family prompts him to not only reconsider the path that he has chosen in life, but to reevaluate his whole existence, and how he abandoned his talent. \"Five Easy Pieces\" was one of the movies that affirmed the new direction that the movie industry was taking in the late '60s and early '70s. Ten years earlier, they might have given the movie an idiotically sugary ending, but the movie does not have such an ending. The ending not only shows how unhappy Bobby is, but also the sense of cynicism that had come to pervade the country. A 10/10. Of course, the really famous scene happens in the restaurant. Although that was probably just thrown in for comic relief, it truly is a classic.",
         "Among my favorite films ever - I was in college, 21 or so, circa 1991 the first time I saw this, courtesy of a filmgeek friend who owned a copy. He made a point of not telling any of us a thing about it before we watched it, and from the start I was hooked. It begins slowly - the plot takes a bit of time to get moving - but with great detail, as Rafelson's quiet, unfussy direction (qualities I later discovered in masters like Ozu, Tarkovsky and Satyajit Ray, who I doubt I would've appreciated had I not seen this first) provides plenty of space to establish character. *Spoilers ahead* There's a dramatic, revelatory shift in the story, unveiled in 2 scenes: Nicholson's spontaneous freeway concert, and the visit to his sister shortly thereafter - about 1/3 of the way in. Right at the point where you think you have this character (in fact, several of the characters) pegged, there's a sudden revelation of something else, a critical piece of background very casually revealed (coming completely out of nowhere, yet completely plausible) that not only completely alters this character's identity, but obliterates any stereotypes potentially associated with him. The diner scene is famous, but there are several others of note - the screaming narcissism of Nicholson's character comes to the foreground during the homecoming scenes, and the implosion of the intellectual conversation about TV, media, and \"kitty cats\" is pretty memorable as well. Karen Black's performance is stunning as well - her character is so needy that it almost arrives as a shock when, in one of her final moments in the film, she lets Bobby (Nicholson) know that she's got his number, so to speak. And the ending is completely devastating... Rafelson and screenwriter Carole Eastman aren't exactly making Bobby out to be a hero here - the cowardliness and misogyny of his behavior is apparent throughout, but so is the pretense and overripe unreality that has provoked (or actually encouraged) his utterly self-absorbed individualism. In any case, this is a devastating film, one of the great high-water marks in 60s-70s American cinema."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "BBS Productions",
         "Columbia Pictures Corporation",
         "Raybert Productions"
      ],
      "summaries": [
         "Robert Dupea has given up his promising career as a concert pianist and is now working in oil fields. He lives together with Rayette, who's a waitress in a diner. When Robert hears from his sister that his father isn't well, he drives up to Washington to see him, taking Rayette with him. There he gets confronted with his rich, cultured family that he had left behind.",
         "Bobby Eroica Dupea comes from a well-bred family of musicians, and once showed great promise as a concert pianist. By nature a restless, angry individual, Bobby left his family and his music when he could no longer endure the dull, cloistered routine of daily practice. He took to the road, wanting to \"see the world,\" and hopefully find something or someone to quell his inner turmoil. He has settled in a small town as an oil rigger, where his life consists of going to work, arguing with his dimwitted but loving girlfriend Rayette, and bowling every night with his friend Elton. Not surprisingly, this routine begins to disgust Bobby and, fed up, he decides to travel to Puget Sound, Washington to pay his family a visit. Leaving Rayette at a nearby motel, gets on a truck leaving everything.",
         "Bobby Dupea has been drifting in his life over the last several years. He currently works on an oil rig in southern California, and partakes in stereotypical working class activities during his free time. He is a brooding, irresponsible cad. When he isn't cheating on her, he treats his waitress girlfriend, Rayette Dipesto, poorly. Not the brightest light in the world, Rayette, who lives by the code of Tammy Wynette songs, continually complains to Bobby about his treatment of her, but still clings to him for dear life. This life belies the fact that Bobby grew up in a privileged life as \"Robert\", who, along with his two siblings, were destined for musical greatness, Robert as a classical pianist. Their parents even gave each of the three some classical musical reference as part of their given names. While his siblings followed that path, Robert rebelled against it, he who has not seen his father in three years. He hears from his classical pianist sister, Partita, that their father has suffered a couple of strokes which has rendered him semi-comatose. As such, Bobby, with Rayette tagging along much to his chagrin, decides to return to the home he grew up in - a musical compound where his father and two siblings still live - to visit with his father. This reunion, which includes seeing his siblings' current lives, provides the stepping stone for what Bobby decides to do in the next immediate phase of his life. This reunion, which includes his violinist brother Carl's mentoring of young beautiful pianist named Catherine Van Oost, makes Bobby contemplate running toward instead of running away from something for the first time in a long time.",
         "Bobby Dupea seems to be a regular blue collar kind of guy. He works on oil rigs and lives with his girlfriend Rayette who works as waitress in a diner. He spends a lot of his time drinking and carousing. After having little or no contact with his family for three years, he decides to pay a visit to his family home after sister Partita tells him their father is quite ill having had a stroke. Surprisingly, Bobby's family is quite well off and all seem to be accomplished musicians. Bobby himself is a classical pianist. He still finds them pompous and annoying, something that comes to the fore again during his visit.",
         "A drop-out from upper-class America picks up work along the way on oil-rigs when his life isn't spent in a squalid succession of bars, motels, and other points of interest."
      ],
      "budget": 1600000
   },
   "movielensId": 3201,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1970-09-12",
      "dvdReleaseDate": "1999-12-14",
      "directors": ["Bob Rafelson"],
      "runtime": 98,
      "movieId": 3201,
      "title": "Five Easy Pieces",
      "mpaa": "R",
      "actors": [
         "Jack Nicholson",
         "Susan Anspach",
         "Karen Black",
         "Billy Green Bush",
         "William Challee",
         "Fannie Flagg",
         "Sally Struthers",
         "Lois Smith",
         "Toni Basil",
         "John P. Ryan",
         "Irene Dailey",
         "Ralph Waite",
         "Marlena MacGuire",
         "Helena Kallianiotes",
         "Richard Stahl",
         "Lorna Thayer"
      ],
      "imdbMovieId": "0065724",
      "originalTitle": "Five Easy Pieces",
      "genres": ["Drama"],
      "youtubeTrailerIds": [
         "inIRtrZIvwU",
         "PIYMRqq7cJA",
         "6D5WrobIlFU",
         "M4TM_4h0g9U"
      ],
      "plotSummary": "A drop-out from upper-class America picks up work along the way on oil-rigs when his life isn't spent in a squalid succession of bars, motels, and other points of interest.",
      "tmdbMovieId": 26617,
      "avgRating": 3.90313,
      "releaseYear": "1970",
      "numRatings": 2364,
      "posterPath": "/4JsIxivzyj6xEiX1DrD8icONjqZ.jpg"
   }
}