{
   "tmdb": {
      "original_language": "de",
      "keywords": [
         {
            "name": "rage and hate",
            "id": 3927
         },
         {
            "name": "malice",
            "id": 4914
         },
         {
            "name": "small person",
            "id": 5290
         },
         {
            "name": "insurrection",
            "id": 5726
         },
         {
            "name": "teacher",
            "id": 10508
         },
         {
            "name": "destruction",
            "id": 14796
         },
         {
            "name": "trenches",
            "id": 188725
         },
         {
            "name": "animal cruelty",
            "id": 205685
         }
      ],
      "imdb_id": "tt0065436",
      "video": false,
      "title": "Even Dwarfs Started Small",
      "recommendations": [
         62437,
         55624,
         53200,
         108419,
         51929,
         145720,
         148827,
         128368,
         32543,
         126377,
         67217,
         47011,
         36096,
         110741,
         51949,
         8071,
         10834,
         143551,
         109364,
         42086
      ],
      "backdrop_path": "/5N0vqWOzAaJVwyDrhtkI5lBhsh7.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Hombré",
               "gender": 0,
               "credit_id": "52fe449d9251416c7503b017",
               "name": "Helmut Döring",
               "profile_path": null,
               "id": 70870,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Erzieher",
               "gender": 0,
               "credit_id": "52fe449d9251416c7503b01b",
               "name": "Paul Glauer",
               "profile_path": null,
               "id": 70871,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Pobrecita",
               "gender": 0,
               "credit_id": "52fe449d9251416c7503b01f",
               "name": "Gisela Hertwig",
               "profile_path": null,
               "id": 70872,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Chicklets",
               "gender": 0,
               "credit_id": "52fe449d9251416c7503b023",
               "name": "Hertel Minkner",
               "profile_path": null,
               "id": 70873,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Piccini",
               "gender": 0,
               "credit_id": "56c3e6f59251416ba9000e20",
               "name": "Gertrud Piccini",
               "profile_path": null,
               "id": 1578737,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Theresa",
               "gender": 0,
               "credit_id": "56c3e6fdc3a3687207000fd8",
               "name": "Marianne Saar",
               "profile_path": null,
               "id": 1578738,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Cochina",
               "gender": 0,
               "credit_id": "56c3e705c3a3687203000f06",
               "name": "Brigitte Saar",
               "profile_path": null,
               "id": 1578739,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Pepe",
               "gender": 0,
               "credit_id": "56c3e70cc3a3687207000fdf",
               "name": "Gerd Gickel",
               "profile_path": null,
               "id": 1578740,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Azucar",
               "gender": 0,
               "credit_id": "56c3e7149251416ba7000f7a",
               "name": "Erna Gschwendtner",
               "profile_path": null,
               "id": 1578741,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Territory",
               "gender": 0,
               "credit_id": "56c3e71ec3a36871fd000e13",
               "name": "Gerhard Maerz",
               "profile_path": null,
               "id": 1578742,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "Anselmo",
               "gender": 0,
               "credit_id": "56c3e7269251416bba000e81",
               "name": "Alfredo Piccini",
               "profile_path": null,
               "id": 1578743,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "Schweppes",
               "gender": 0,
               "credit_id": "56c3e72f9251416bac000ddb",
               "name": "Erna Smollarz",
               "profile_path": null,
               "id": 1578744,
               "order": 11
            },
            {
               "cast_id": 23,
               "character": "Chapparo",
               "gender": 0,
               "credit_id": "56c3e7379251416bae000f3a",
               "name": "Lajos Zsarnoczay",
               "profile_path": null,
               "id": 1578745,
               "order": 12
            },
            {
               "cast_id": 24,
               "character": "The President",
               "gender": 0,
               "credit_id": "56c3e7409251416bb1000e7b",
               "name": "Pepi Hermine",
               "profile_path": null,
               "id": 1448455,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe449d9251416c7503b029",
               "name": "Werner Herzog",
               "profile_path": "/uzVcWEmasjz1Wl7w5mBF5vmmHlK.jpg",
               "id": 6818,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe449d9251416c7503b02f",
               "name": "Werner Herzog",
               "profile_path": "/uzVcWEmasjz1Wl7w5mBF5vmmHlK.jpg",
               "id": 6818,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe449d9251416c7503b035",
               "name": "Werner Herzog",
               "profile_path": "/uzVcWEmasjz1Wl7w5mBF5vmmHlK.jpg",
               "id": 6818,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe449d9251416c7503b03b",
               "name": "Florian Fricke",
               "profile_path": "/qa5a0Q28i8wnHbz9KUv2ykAuAr6.jpg",
               "id": 49501,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe449d9251416c7503b041",
               "name": "Thomas Mauch",
               "profile_path": null,
               "id": 20553,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe449d9251416c7503b047",
               "name": "Beate Mainka-Jellinghaus",
               "profile_path": null,
               "id": 20554,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "56c3e6bec3a3687203000ef8",
               "name": "Francisco Ariza",
               "profile_path": null,
               "id": 1578736,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "56c3e6c89251416ba7000f6b",
               "name": "Walter Saxer",
               "profile_path": null,
               "id": 49497,
               "department": "Production",
               "job": "Unit Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "56c3e6d19251416bba000e6b",
               "name": "Wolfgang von Ungern-Sternberg",
               "profile_path": null,
               "id": 1463981,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "56c3e6dac3a3687200000f99",
               "name": "Herbert Prasch",
               "profile_path": null,
               "id": 20555,
               "department": "Sound",
               "job": "Sound"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 2.724279,
      "production_countries": [{
         "iso_3166_1": "DE",
         "name": "Germany"
      }],
      "id": 11900,
      "vote_count": 37,
      "budget": 200000,
      "overview": "The inhabitants of an institution in a remote country rebel against their keepers. Their acts of rebellion are by turns humorous, boring and alarming. An allegory on the problematic nature of fully liberating the human spirit, as both commendable and disturbing elements of our nature come forward. The film shows how justifiable revolt may be empowering, but may also turn to chaos and depravity. The allegory is developed in part by the fact that the film is cast entirely with dwarfs",
      "similar": [
         52449,
         233063,
         437670,
         400928,
         1807,
         103663,
         22302,
         7340,
         9276,
         14069,
         35052,
         1075,
         10092,
         1259,
         13466,
         9424,
         18148,
         20178,
         1791,
         8841
      ],
      "original_title": "Auch Zwerge haben klein angefangen",
      "runtime": 96,
      "poster_path": "/yk9lfBzp4GXNMEtSLOZeh01sotU.jpg",
      "spoken_languages": [{
         "name": "Deutsch",
         "iso_639_1": "de"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Werner Herzog Filmproduktion",
         "id": 843,
         "origin_country": ""
      }],
      "release_date": "1970-09-16",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "West Germany",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Werner Herzog"],
      "runtime": 96,
      "synopsis": null,
      "writers": ["Werner Herzog"],
      "originalLanguage": "German",
      "imdbLink": "http://www.imdb.com/title/tt0065436/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM2ODIxODExNV5BMl5BanBnXkFtZTcwNzkwMjkxMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Helmut Döring, Paul Glauer, Gisela Hertwig | See full cast and crew »"],
      "reviews": [
         "Werner Herzog made his madman mark with this, his second feature film. Inmates at some sort of institution take over for hilarious and anarchic results. You laugh for a while until it sinks in. The haunting tone, other world locations and sympathy with those on the edge of society set the scene for Herzog's later and better-known masterpieces AGUIRRE and MYSTERY OF KASPAR HAUSER. The German director doesn't exploit outcasts; he loves and defends them, showing that normal people are the ones with something to prove. He insists that it is not the actors who are small, but \"the world that has gotten out of shape.\" Filming was rough: one actor was run over by the driver-less car in the film and another caught on fire. Herzog promised the actors that at the end of shooting he would jump into a spiny cactus to show his understanding. He still has some of the needles in his leg. But this won't appeal to a lot of the usual trash film hounds, as they really want the mainstream versions of \"edgy\".",
         "This film isn't just depraved and misanthropic, it's depraved and misanthropic with heart. Despite it's grotesqueness, it depicts a fantasy of rebellion and transgression that I've loved for years. The urge to break free and destroy the confining objects and circumstances of our lives is within all of us. The potential joy of trashing and rendering inoperable our cars, the implements of our work, even our foodstuffs and houses lurks somewhere on a subconcious level, wether we are able to admit it to ourselves or not. Herzog has made an archetypal statement, very simply and unambiguously. The exhilaration of watching these laughing little people dismantle, bludgeon and set fire to their surroundings is immense I find I have a weird empathy with the character Hombre, the small guy who happily follows the group and laughs while he watches all the destruction. He has a kind of humble nobility which is revealed at the beginning of the film when he refuses to talk to police.",
         "This film is hard going, true, but through the chaos and endless repetition can be glimpsed a kind of joy of existence. The dwarves are exaggerations of human behavior, and at the same time, human behavior distilled. Within the confines of the prison complex where the film plays, their actions become more and more outrageous, and through all this a kind of tenderness emerges in their very closeness and comeraderie. Herzog revels in pointing the mirror at his audience, making them take a closer look at themselves, and this film is as good as any example of his take on the human condition.",
         "This is Herzog's most telling film. The world he has created sees dwarfs confined in an un-named, oppressive system. When they finally revolt against the machine, they don't know what to do with themselves and ultimately resort to destroying the things around them (cars, trees, animals). Bizarre, beautiful, and horrifically engaging, this is a unique experience that demands your full attention. Give it a go (the ANCHOR BAY DVD even has audio commentary from Herzog!!) - you won't be disappointed.",
         "I'm almost ashamed to say it but...this film truly TERRIFIED me! Usually speaking, this is like one of the best compliments a movie can ever receive, but I'm afraid that in the case of \"Even Dwarfs Started Small\" this feeling is very misplaced. Werner Herzog's minor masterpiece is intended as an allegoric social portrait, hence I'm not very proud to admit that it haunted me all night long. As wrong and unsympathetic as it may come across, these little people look naturally eerie and their appearances made an impression on me that was even stronger than the mesmerizing story. \"Even Dwarfs Started Small\" is a revolutionary film, pretty much covering all the daily wars every human being wages, only the protagonists are all dwarfs. Since these people's position in society already are oppressed as it is, this film looks extra powerful and compelling. All the actors and actresses deliver amazing performances, even though none of them had any experience in cinema. Especially the 'main' character Hombre is a truly intriguing man. Other aspects that increase the depressing intensity of this film are the black and white cinematography, the extended sequences showing farm animals and \u0096 most of all \u0096 the raw, tribal music. This definitely was one of the toughest reviews I ever wrote, simply because this is such a multilateral classic and I regretfully can't get past my personal fear of small shapes...",
         "Werner Herzog's sophomore effort is probably his most bizarre to date. The whole cast is compromised of dwarfs who take over an institution and wreak havoc. This treat for Herzog fans is very entertaining. The film does have its problems though. The first half hour is hard to sit through but this is the type of film that gets better as it goes on. Also, I was expecting more of an ending. The ending, although funny, seems that it just does not fit and ended too abruptly. As I said in my title, I think this has Herozg's most powerful images. With the dwarfs wreaking havoc and celebrating with smiles on their while African tribe music is playing, the scenes are very bizarrely beautiful. The movie is very entertaining and very funny. Hombre has probably the best laugh I have ever heard in my life. He definitely brings real evil to the film. The cinematography is great (yeah, what else is new in a Herzog film?). The message of the film is also very profound. Although this is definitely not Herzog's best, it is one hell of a trip!",
         "I guess that I will never stop reviewing this wonderful picture. I was able to find it in a kind of obscure video/bookstore, and has continuosly gone back to it. And everytime I watch it it grows, even though I already thought that it was a great movie the first time I saw it. So why am I so compelled by it? Probably because of its originality, and not least, its actors (especially Helmut Döring, the littlest that also has a little role in \"Jeder für sich und Gott gegen alle\"). If I rembember it right Leonard Maltin described the film as \"truly disturbing\", and I guess that he ment that in a positive way, like in the films \"Man Bites Dog\", \"Henry-Portrait of a Serial Killer\" or \"Clean, Shaven\". You get disturbed, like when the mob throws chicken through their supervisors window, and you can clearly see how these chickens hurt themselves, break their wings and legs. But the movie, disturbing and in many scenes very funny, amusing, also includes a social comment (my opinion). Them small dwarfes rages agains the civilization that mocks them, locks them in, and decides to get even by treating animals bad, and by destroying all symbols of western civilization. Think of it, those of you who have seen this film, all they destroy is cars, typewriters, etc, and gross in food and wine. Although social comment wasn't Herzog's first though when making this film it, as in Stroszek, is there. All said, this is one of the best films I have said, by its scenes, music, dialogue, actors. Bizarre, disturbing, funny, wonderful. I find it great that I can see Herzogian style/form in new directors, as in Harmony Korine's Gummo (remember that scene where a dumb couple 'shouts' at eachother). In this scene, and many more, I can find an Herzog influence. Have a great time/ Ola Lundin",
         "Director Werner Herzog created a bizarre revolutionary world made up of dwarfs. Every actor in the film is a dwarf, not to mention angry and German too. They all decide to rebel against the system, but a revolution is tough when you can't even reach the door handle. One of their friends is held hostage for interrogation by a rich authority figure. It's dwarfs to the rescue! Watch in shock as dwarfs try to drive a car, look at porn, set fires, break things and even torture animals. The film even includes a brutal cock fight and the crucifixion of a monkey. \"Even Dwarfs Started Small\" may be to disturbing for some. To me, it was challenging but worth watching; it shows viewers that your never too small to fight the system!",
         "Werner Herzog's upsetting, black and white, documentary-like EVEN DWARFS STARTED SMALL concerns the rebellion of a handful of dwarves against the institution in which they are inmates. No average-sized actors appear - just the buildings, furniture and accessories that have been constructed for (and seemingly abandoned by) them. Herzog pulls a double whammy by getting his audience to identify with his performers - indeed, they are shown to express great sensitivity and pain - but doesn't cop out by suggesting that the dwarves will be happy now that they've smashed some windows. A difficult film to watch - and certainly not for the easily-offended.",
         "I actually admire what writer/director Werner Herzog was going for with Even Dwarfs Started Small even if I think he didn't quite execute it in a manner that involved me enough. It's got a great idea behind it- inmates at a mental institution, on one of the Canary Islands pre-tourism, create an anarchic uprising with practically no one else in sight, and the headmaster locks himself in with a retarded patient while the others go wild and crazy, albeit still staying in the confines of the grounds of the area. I also liked when Herzog went for an interesting route in the picture psychologically and in mood, which was to show how chaos and disarray, even if among little people, can actually become rather aimless and uncanny. There is no plot, it's just a series of interconnected segments that seem to be happening in real time, where they do things like ogle at naked girls in magazines, kill a pig randomly, give constant torture to a couple of blind dwarfs, circle around a constantly 360 degree spinning car, and with Herzog sometimes just as interested in the animals (chickens, a camel, the pig, a monkey) on the premises as he is with his whacked out little folk. But the problem arises then with the work that since it is plot less- even if it ends with the headmaster, talking to a branch outside, as a metaphor for human control and what is and what isn't a free will or spirit perhaps- there's the danger of becoming tedious with what goes on, and that's exactly the trap that I think Herzog falls into here. It's not that he is out blatantly to mock them (although, like with Stroszek, the tendency to laugh is hard to avoid at times, especially with its documentary-style anything-goes approach), but there isn't any grand metaphor I could really obtain from the material, at least from a first viewing, and Herzog seemed to be having too much fun getting the dwarfs to do both the mundane and whatever to get something consistently interesting. While he does have one character who ends up being quite memorable, the freaky-laughing, hilarious Hombre (all one-note, of course, but then again isn't everyone here), there's nothing to tie the parts together that are worth watching for to make it good enough for the whole. There's surrealism of course (the fate of the monkey and the car), and an image or two that strikes greatly (when the headmaster or whomever tries to get the attention of the one-passerby on the island), but it just didn't compel me or surprise me in ways that Herzog at his best can do. Not that I'm telling you to not see the film, as a fan I mean. The title alone should be a calling card to anyone who might have a bit of interest in the subject matter, and I'm sure a work like this has inspired a few avant-garde director's out there (I saw it as a possible fore-father for Korine's Gummo). Yet it's own lackadaisical use of narrative and Herzog's insistence on ambiguity and derangement, makes it a kind of schizophrenic work that makes it a fun yet flawed trip."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": ["Werner Herzog Filmproduktion"],
      "summaries": ["The inhabitants of an institution in a remote country rebel against their keepers. Their acts of rebellion are by turns humorous, boring and alarming. An allegory on the problematic nature of fully liberating the human spirit, as both commendable and disturbing elements of our nature come forward. The film shows how justifiable revolt may be empowering, but may also turn to chaos and depravity. The allegory is developed in part by the fact that the film is cast entirely with dwarfs."],
      "budget": 200000
   },
   "movielensId": 3202,
   "movielens": {
      "languages": ["Deutsch"],
      "releaseDate": "1970-09-16",
      "dvdReleaseDate": "1999-12-14",
      "directors": ["Werner Herzog"],
      "runtime": 96,
      "movieId": 3202,
      "title": "Even Dwarfs Started Small",
      "mpaa": "",
      "actors": [
         "Helmut Döring",
         "Paul Glauer",
         "Gisela Hertwig",
         "Hertel Minkner",
         "Gertrud Piccini",
         "Marianne Saar",
         "Brigitte Saar",
         "Gerd Gickel",
         "Erna Gschwendtner",
         "Gerhard Maerz",
         "Alfredo Piccini",
         "Erna Smollarz",
         "Lajos Zsarnoczay",
         "Pepi Hermine"
      ],
      "imdbMovieId": "0065436",
      "originalTitle": "Auch Zwerge haben klein angefangen",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["Yu8L1J9GvOU"],
      "plotSummary": "The inhabitants of an institution in a remote country rebel against their keepers. Their acts of rebellion are by turns humorous, boring and alarming. An allegory on the problematic nature of fully liberating the human spirit, as both commendable and disturbing elements of our nature come forward. The film shows how justifiable revolt may be empowering, but may also turn to chaos and depravity. The allegory is developed in part by the fact that the film is cast entirely with dwarfs",
      "tmdbMovieId": 11900,
      "avgRating": 3.59236,
      "releaseYear": "1970",
      "numRatings": 157,
      "posterPath": "/yk9lfBzp4GXNMEtSLOZeh01sotU.jpg"
   }
}