{
   "tmdb": {
      "original_language": "it",
      "keywords": [
         {
            "name": "witch",
            "id": 616
         },
         {
            "name": "vampire",
            "id": 3133
         },
         {
            "name": "crypt",
            "id": 10560
         },
         {
            "name": "gothic horror",
            "id": 15032
         },
         {
            "name": "iron mask",
            "id": 204352
         }
      ],
      "imdb_id": "tt0054067",
      "video": false,
      "title": "Black Sunday",
      "recommendations": [
         28043,
         28055,
         24106,
         31417,
         27130,
         16372,
         28049,
         49361,
         3031,
         5486,
         3763,
         20345,
         20115,
         25508,
         28942,
         11772,
         229,
         20367,
         25504,
         13666
      ],
      "backdrop_path": "/d6ePxz5DR8pw5H3RNhl5ASzYwZ1.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "talisencrw",
         "id": "57ae1271925141678b00017f",
         "content": "This was just great. My first Bava experience--hopefully I'll eventually take in his entire oeuvre.",
         "url": "https://www.themoviedb.org/review/57ae1271925141678b00017f"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "Katia Vajda / Princess Asa Vajda",
               "gender": 1,
               "credit_id": "52fe455cc3a368484e05571f",
               "name": "Barbara Steele",
               "profile_path": "/vhRuGp59lX3rB8h3k2zCS6ZC95w.jpg",
               "id": 5685,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "Dr. Andre Gorobec",
               "gender": 2,
               "credit_id": "52fe455cc3a368484e055723",
               "name": "John Richardson",
               "profile_path": "/esmjGJyeVTNyYu39utLcGRSf2fK.jpg",
               "id": 31545,
               "order": 1
            },
            {
               "cast_id": 13,
               "character": "Prince Vajda",
               "gender": 0,
               "credit_id": "52fe455cc3a368484e055727",
               "name": "Ivo Garrani",
               "profile_path": "/qpDEJjGAeUExV3LbyW2Vjsu2N8r.jpg",
               "id": 84251,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Igor Javutich / Javuto",
               "gender": 0,
               "credit_id": "52fe455cc3a368484e05572b",
               "name": "Arturo Dominici",
               "profile_path": "/cT6Uxe1cE7taVXpUCbhhYD6BbkE.jpg",
               "id": 98485,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Prince Constantine Vajda",
               "gender": 2,
               "credit_id": "52fe455cc3a368484e05572f",
               "name": "Enrico Olivieri",
               "profile_path": null,
               "id": 98486,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Dr. Thomas Kruvajan",
               "gender": 0,
               "credit_id": "52fe455cc3a368484e055733",
               "name": "Andrea Checchi",
               "profile_path": "/3iErNlZjlyRgyMLnBOyoWBkumMP.jpg",
               "id": 45036,
               "order": 6
            },
            {
               "cast_id": 20,
               "character": "Priest",
               "gender": 0,
               "credit_id": "58cb14289251415e44003fc1",
               "name": "Antonio Pierfederici",
               "profile_path": null,
               "id": 47141,
               "order": 7
            },
            {
               "cast_id": 21,
               "character": "Ivan",
               "gender": 2,
               "credit_id": "58cb14639251415e2f004027",
               "name": "Tino Bianchi",
               "profile_path": null,
               "id": 980399,
               "order": 8
            },
            {
               "cast_id": 22,
               "character": "Inn Keeper",
               "gender": 0,
               "credit_id": "58cb148ec3a36828aa003a70",
               "name": "Clara Bindi",
               "profile_path": "/lLEMQT79ExO5JNzeBR38sEp3mGt.jpg",
               "id": 229261,
               "order": 9
            },
            {
               "cast_id": 23,
               "character": "Nikita, the Coachman",
               "gender": 0,
               "credit_id": "58cb14a89251415e57003ba3",
               "name": "Mario Passante",
               "profile_path": null,
               "id": 5409,
               "order": 10
            },
            {
               "cast_id": 24,
               "character": "Boris",
               "gender": 2,
               "credit_id": "58cb156bc3a368287d004311",
               "name": "Renato Terra",
               "profile_path": null,
               "id": 24708,
               "order": 11
            },
            {
               "cast_id": 25,
               "character": "Sonya, the Innkeeper's Daughter",
               "gender": 0,
               "credit_id": "58cb15899251415e44004080",
               "name": "Germana Dominici",
               "profile_path": "/eivq9anCbujgB0ayAW2tPAowM3I.jpg",
               "id": 1335061,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe455cc3a368484e0556eb",
               "name": "Mario Bava",
               "profile_path": "/7IAC3ab2HeveW537a3bymiDrVce.jpg",
               "id": 25826,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe455cc3a368484e0556f1",
               "name": "Ennio De Concini",
               "profile_path": null,
               "id": 25316,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe455cc3a368484e0556f7",
               "name": "Massimo De Rita",
               "profile_path": null,
               "id": 98482,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe455cc3a368484e0556fd",
               "name": "Marcello Coscia",
               "profile_path": null,
               "id": 23359,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe455cc3a368484e055703",
               "name": "Mario Bava",
               "profile_path": "/7IAC3ab2HeveW537a3bymiDrVce.jpg",
               "id": 25826,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe455cc3a368484e055709",
               "name": "Mario Serandrei",
               "profile_path": null,
               "id": 15132,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe455cc3a368484e05570f",
               "name": "Ubaldo Terzano",
               "profile_path": null,
               "id": 98483,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe455cc3a368484e055715",
               "name": "Mario Bava",
               "profile_path": "/7IAC3ab2HeveW537a3bymiDrVce.jpg",
               "id": 25826,
               "department": "Crew",
               "job": "Special Effects"
            },
            {
               "gender": 0,
               "credit_id": "52fe455cc3a368484e05571b",
               "name": "Mario Serandrei",
               "profile_path": null,
               "id": 15132,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "547bab959251412d73000cfc",
               "name": "Mario Bava",
               "profile_path": "/7IAC3ab2HeveW537a3bymiDrVce.jpg",
               "id": 25826,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "547babb5c3a3685af6000b49",
               "name": "Roberto Nicolosi",
               "profile_path": null,
               "id": 50788,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "58cb138f9251415e6f003eab",
               "name": "Tina Grani",
               "profile_path": null,
               "id": 99489,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "58cb1783c3a3682889003ad4",
               "name": "Vana Caruso",
               "profile_path": null,
               "id": 1763213,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 2,
               "credit_id": "58f4b0c8c3a3680867023fbb",
               "name": "Nikolai Gogol",
               "profile_path": "/mPCb6xYWu9okwdzPOiy22Pz6VVd.jpg",
               "id": 1097807,
               "department": "Writing",
               "job": "Short Story"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 7.071201,
      "production_countries": [{
         "iso_3166_1": "IT",
         "name": "Italy"
      }],
      "id": 27632,
      "vote_count": 108,
      "budget": 0,
      "overview": "A vengeful witch and her fiendish servant return from the grave and begin a bloody campaign to possess the body of the witch's beautiful look-alike descendant. Only the girl's brother and a handsome doctor stand in her way.",
      "similar": [
         7131,
         36647,
         36648,
         49017,
         138,
         6404,
         277,
         12437,
         76492,
         24021,
         17102,
         2907,
         52520,
         60304,
         6114,
         628,
         755,
         346672,
         766,
         252171
      ],
      "original_title": "La maschera del demonio",
      "runtime": 87,
      "poster_path": "/rYsXRKUOdQW8xSy5heWzaO7N4nL.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Alta Vista Productions",
            "id": 4820,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Galatea Film",
            "id": 12240,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Jolly Film",
            "id": 10481,
            "origin_country": ""
         }
      ],
      "release_date": "1960-08-11",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "STARE INTO THESE EYES... discover deep within them the unspeakable terrifying secret of BLACK SUNDAY... it will paralyze you with fright!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Mario Bava"],
      "runtime": 87,
      "synopsis": "In 1630 Russia, Princess Asa (Barbara Steele), a beautiful, dark-haired, young woman is condemned for practicing witchcraft. The grand inquisitor is none other then her estranged brother, Prince Vajda, who renounces his ties to his sister. As the executioner ties her down to the stake, Asa defiantly swears retribution by returning from the dead one day. The executioner positions a spike-lined metal mask over her face. On her brother's command, a swift hammer blow drives the mask into her skull, killing her instantly. She is then interred in the family crypt in a coffin equipped with a window, thought which the sign of the cross is visible. With the cross forever visible to her lifeless body, it is said that the witch will never return to life. 200 years later, Doctors Kruvejan (Andrea Checchi) and Gorovek (John Richardson) are riding in a carriage from St. Petersburg to Moscow on their way to a medical conference. A wheel on the carriage slips out of its socket. Leaving the driver to repair the damage, the pair decide to investigate an old ruined chapel nearby, where they discover the witch's coffin in the crypt below. Kruvejan is suddenly attacked by a large bat, and when he beats it to death in his cane, he accidentally smashes the stone cross position over the window. The fragments from the cross smash the glass, enabling Kruvejan to pull away the witch's mask. Her face is sunken and decayed, but is otherwise intact. Gorovek convinces his friend to leave before the driver becomes overly anxious, but unbeknownst to both, blood from a small cut on Kruvejans hand is already working to revive Asa. Outside the chapel, the two doctors are startled by Princess Katia (Barbara Steele in a dual role), the daughter of Prince Vajda (Ivo Garrani). Gorovek is immediately smitten with her. The sad, seemingly fixed expression she wears tells of an unhappy nature, which is bourn out by her saying that the chapel is her father's property and he refuses to fix it up. The men continue their journey, stopping for the night at a small inn not far from the Vaja estate. Meanwhile in the castle, Prince Vajda is uneasy. He reminds her servant Ivan (Tino Bianchi), that this day marks the 200th anniversary of Asas execution. On this same day, every 100 years, mysterious events have happened in the area and the nearby village. The prince fears for Katia's safety, particularly since her resemblance to Asa seems to mark her for a very special fate. Ivan puts his master at ease, reminding him that so long as he wears a cross, no harm can befall him. In the crypt, the witch completes her resurrection. Using her special powers, she calls her lover, the vampire Javutich (Arturo Dominici) from his grave in the village cemetery. The vampire slowly crawls out of the earth and proceeds to act on Asa's instructions. Javutich arrives at the inn and fetches Dr. Kruvejan, claiming that the prince has called for a physician. Upon arrival at the castle, the doctor is led to a downstairs chamber. To Kruvejans astonishment, the chamber leads directly to the old crypt, where he is locked in. Kruvejans fear turns to hysteria when Asa emerges from her coffin and calls out to him. She places him under her power saying that a few drops of his blood brought her back to life. All of it will give her the strength to accomplice her vengeance. She bites him on the neck and begins to feed off his blood. Back at the castle, the prince sleeps fitfully. He is awakened by the intrusion of Javutich, who makes his way slowly to the old mans bed. The prince wakes up and is saved by the crucifix necklace he has around his neck. As Javutich retreats, Katia and her older brother Constantine (Enrico Oliveri) arrive in the bedroom responding the princes cries. But when he tells them about an intruder, Katia and Constantine think his delirious and send out for a doctor. It is Kruvejan who arrives to help him. The doctor's appearance is changed for his hair is grayer, and expression and attitude much crueler. Kruvejan successfully puts the prince into a deep sleep with some sedatives, and persuades Katia and Constantine to go to bed for the night, but persuades them to remove the crucifix from the prince's neck. Afterwards, Kruvejan reenters the prince's bedroom, and kills the old man by biting his neck and feeding on his blood. The next morning, Katia and Constantine are grief-stricken when they find their father dead. Finding that Kruvejan has disappeared, they send out for Gorovek. Yet Prince Vajda is not the only person to die mysteriously. That same morning, some village children find the dead body of one of the prince's servants on a river bank. When local people soon learn about this, they become convinced that the witch has finally returned from the grave. Meanwhile, Gorovek is amazed to learn that Kruvejan has disappeared, and refuses to believe that he would have willingly left a sick man unattended. Together with Constantine, he sets out to discover the truth. At the same time, his infatuation with Katia blooms into a full-blown romance. In the village, talk begins to circulate about the return of the witch Asa and her vampire lover. Gorovek becomes intrigued by the talk and seeks the aid of the parish priest, who assures the young man that such creatures do exist. Gorovek and the priest go to the old cemetery where Javutich is reputed to be buried, only to discover his half-buried coffin, and Kruvejan lying asleep in it. The priest slays Kruvejan by driving a wooden stake into his right eye. Gorovek hurries back to the castle to see if Katia is all right. At the castle, Javutich murders both Ivan, and then Constantine with little difficulty, leaving Katia all alone in the castle. When the princess goes to visit her father's coffin in their living room, the prince rises up from it as a vampire and advances towards her. But Javutich shows up and hurls the undead prince into the fireplace where he burns to death. Javutich then grabs Katia and takes her down into the crypt where Asa is waiting for them. Asa is still very weak and in need of more blood, grabs Katia and begins to feed off her. It is Asa's intention to murder Katia and to assume her identity in the process. Gorovek finally arrives at the castle and immediately engages in a drawn-out fight with Javuitch. Eventually the doctor dispatches the vampire the throwing him though a trap door in the floor of the path to the crypt and the vampire lands on wooden stakes at the bottom. Gorovek makes his way into the crypt, interrupting Asas rejuvenation. However, he believes the witch's claims that Katia, who is lying unconscious on the coffin, is the witch because of her pail appearance by her loss of blood. As Gorvoek prepares to drive a wooden stake into her heart, he suddenly notices that the 'witch' is wearing Katia's crucifix necklace, something impossible for an evil entity to wear a holy symbol. Immediately, Gorovek turns to Asa and tears away at her robe, revealing that her body, still undeveloped, is a putrid mass of flesh and exposed bone. Just then the priest arrives with a mob of townsfolk where they grab Asa, and they finally put the witch to death by tying her to a stake, setting it afire and she finally burns to death. As the witch finally dies, Katia arises with her life energy restored.",
      "writers": [
         "Ennio De Concini",
         "Mario Serandrei"
      ],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0054067/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNDgxNjI0MzM1NV5BMl5BanBnXkFtZTgwODU2MDkwMzE@._V1._CR34,23,340,476_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Barbara Steele, John Richardson, Andrea Checchi | See full cast and crew »"],
      "reviews": [
         "For some unknown reason, here recently I've been in the mood to watch a lot of vintage 1960s-70s Italian horror movies. Hardly any other film comes as highly recommended as Black Sunday and after viewing this incredibly moody effort, I can easily see why. It's by far one of the most beautifully photographed films I've seen of any genre. It's also one of the most atmospheric; a sense of horror and dread hang over every frame, and yet it is a film whose power does not lie entirely in the narrative. It's hidden somewhere, pretty much everywhere... in dark corners, in secret crypts, in fog, in shadows... The shots in this film are brilliantly composed. It is a true triumph for director and cinematographer Mario Bava, who provides such rich, dream-like technical depth that (pardon the cliché) this film truly does transport viewers somewhere else in time. Even though this movie is best appreciated as an exercise in style and technique, the plot line (witch who is executed and returns centuries later to get revenge on the descendants of her executioners) is also enjoyable. So is Barbara Steele, who is ideally cast in a dual role as both the evil witch and the pure heroine. She's an actress who can switch from innocent and ravishing to hideous and horrific with the flick of an eyelash. No wonder she's considered the queen of horror. She deserves to be.",
         "BLACK Sunday (Mario Bava - Italy 1960). Mario Bava's first feature as a director (although he did uncredited directorial work before), this classic and extremely influential piece of Gothic horror really showed his cinematographic talent in creating a haunting and stylishly shot film. \"Black Sunday\" also catapulted Barbara Steele to horror stardom and would make her into the undisputed horror queen of the sixties. Bava based \"Mask of Satan\", as the film was originally titled, on the short story \"Vij\" by the Russian author Gogol, which he adapted into a homage to the early Universal horror pictures he loved so much. Barbara Steele is the beautiful 17th century witch princess Asa, who is a vampire, and her lover Juvato (Arturo Dominici), are put to death by her vengeful brother. He has iron masks with spikes on the inside placed on both their faces and then sledgehammered home (the brutal opening scene). Two hundred years later, blood is accidentally spilled on Asa's face and she rises from the dead along with Juvato to wreak revenge on the descendants of those who executed her - including her look-alike Katia, also played by Barbara Steele. Beautifully shot in black and white by Bava himself, \"Black Sunday\" is a perfect showcase of his masterful control of light and shade, of colour and movement (yes, one can play with \"shades of colour\" in black and white) and playful camera angles, it's a feast for the eye. At heart Bava would always remain the cinematographer he always was and in all his films he took an active role in the design of each image by setting up the lighting, the optical effects, the filters etc. The film abounds in old-fashioned horror atmosphere and in that department, it even manages to top the atmosphere of the Universal horror classics it was based on with gnarled tree branches, fogbound sets, a decaying castle, a dark foreboding crypt and much more. Of course, Bava's is well known for letting stylistic innovations take precedent over storytelling and most other things involved, like acting. Much of the script was reworked during shooting and even in post-production. Barbara Steele reportedly never even saw a script and got some pages every day of shooting. Variations of the story has been told many times in one way or another and there are more than a few echoes of Murnau's Nosferatu here. Much of the story is too derivative to begin with, and has become too formularised in subsequent years to retain much of its original power, just as the film's capacity to scare or excite audiences has probably worn out a little over the years. It doesn't really matter, because the film was chopped to pieces for over four decades and the habit of Italian filmmakers of post-synchronizing all the voices (even for Italian versions) made anything in that department a pretty dire affair anyway. What Bava added however was some substantially more explicit violence and gore, laced with sexual connotations. The opening scene in which the mask is sledgehammered to Barbara Steele's face still packs quite a wallop, not to mention the effect it must have had on audiences back then. Still, horror fans can't really afford to miss this quintessential Bava piece, but watch it for the splendid cinematography and Bava's unique ways of visual wizardry. Camera Obscura --- 7/10",
         "La Maschera del Demonio/The Mask of Satan(1960) is the film that introduced audiences around the world to the cinema of Mario Bava. Responsible for being the first horror film to have a formidable evil female villain. Its about a dead witch who returns from the dead with her lover to terrorize the descendents of their executioners. Translitional picture that predates the broodish and moody style of Night of the Living Dead(1968). Tim Burton has cited this movie as one of his favorites. After years as Assistent Director and Director of Photography, Bava was rewarded with his first full directorial assignment and the results are impressive. Mario Bava was a talented filmmaker with a love for the fine arts of Europe and Russian literature. He didn't direct full time until he was in his late 40s. Mario Bava's influences as a film director were Riccardo Freda and Freda and Fritz Lang. Nikolai Gogol is a writer that along with Edgar Allen Poe played a major influence on Bava's supernatural tales. One theme that is present in The Mask of Satan(1960) is the decay and decline of a once happy and powerful family{more fully explored in Bava's later films of Black Sabbath(1963), Whip and the Body(1964), Lisa and the Devil(1974), and Shock(1977)}. Deals with the notion of the inescapability of fate that is an important theme in Bava's work. An example of this motif comes from Barbara Stelle with her line:\"Here is the Very image of my life\". Mario Bava was a fatalistic filmmaker who used imagery to convey his beliefs in destiny or fate. Part of his fatalistic style comes from him experiences and memories of WW2. Some of the special effects are amazing for a film of this caliber. Mario Bava was a genius in creating special effects with only his creative soul and imagination. Makes one wonder what great special effects he could create with a modest budget. The gore effects although spread out in small pieces are gruesome for 1960. Proves that great special effects don't necessarily have to be done with mega dollars. The opening scene of the execution of Asa is a stunning combination of atmosphere and violent imagery. Barbara Stelle along with Christopher Lee, Peter Cushing, and Vincent Price are some of the greatest icons in 1960s to 1970s horror films. Many movie makers in horror films were influenced by the opening scene. Certain parts of the atmospheric opening can be seen as one inspiration for the prologue of Lucio Fulci's L'Aldila/The Beyond(1981). A special moment in horror cinema. The Mask of Satan(1960) came about as a result of the success of the Curse of Frankenstein(1957) and Horror of Dracula(1958) in Italy. Mixes the old fashion horror of Univerisal Studios with the graphic violence of Hammer horror. The Hammer and Universal horror films are responsible for the birth of horror in Post war Italian cinema. There are a couple of scenes that are obviously influenced by Horror of Dracula(1958). The fact that Mario Bava did this based on the success of Horror of Dracula(1958) must have influenced Terence Fisher to respond to directing Dracula:Prince of Darkness(1966). The Mask of Satan(1960) isn't interested in plot and story as much as atmosphere and painting style visuals. Mario Bava took the barebones material of the film and turned it into something magnificent. Mario Bava's direction has the look of a great artist. Setting up atmosphere, dread, mood, and terror were some of Bava's strengths. His experiences as a cinematographer really pays dividends in Bava's direction. A significant influence was placed on La Maschera del Demonio by the first Italian horror film of the sound era, I Vamipri(1956). A few references are made to I Vampiri(1956) especially in the discovery of a dead body near the river bank. Also, the aging effect in Mask of Satan(1960) comes from Bava's work on I Vampiri. Italian filmmaker, Riccardo Freda was the major influence behind Bava's films and the main directorial mentor of Mario Bava. The romantic subplot of The Mask of Satan(1960) also derieves from I Vampiri(1956). Has some of the best set designs in a low budget horror film. Mario Bava would use some of the set for his late 1960s horror classic Kill Baby Kill(1967). Amazing that Mario Bava could put together grandeur looking art and set designs with so little. He also contributed to the dazzling cinematography. Mario Bava used many of the film's motifs and themes for The Whip and the Body(1964). La Maschera del Demonio/The Mask of Satan(1960) is based loosely on a short story by Gogol called the Viy. An interesting note on the making of The Mask of Satan(1960) is that Bava made changes thoughout production because of uncertainities about the screenplay. Its one of the best horror films of the last fifty years. The camera moves with a smooth feel typical of a Mario Bava phtographed feature. This is an item that many aspiring horror filmmakers should watch in order to see how a great horror film should be done.",
         "\"The sound that you hear is dripping blood. This...is the beginning of Black Sunday !!\" ...These two very atmospheric and mood-setting sentences are heard when the Black Sunday DVD is put into the player. No need to tell you that a better and more tense opening has yet to be created. This movie is an undeniable masterpiece in its kind. A powerful and terrifying experience that was way ahead of its time back in 1960 and now - almost 45 years later - it still stands for an hour and a half of pure terror, devlish fun and sinister fascination. I respect the opinion and dislikes of everyone but not when it comes to this movie...you either admit that Black Sunday is a masterpiece or you're wrong !! I could give you a thousand reasons why this movie should be seen as the most important horror movie ever made but I'll just stick to the most important ones. Black Sunday ( or The Mask of Satan, as you prefer ) is the debut of Italian genius Mario Bava...Well, not really his debut but the first full length movie after a series of short films and project he didn't get credit for. In it, Bava presents us on a stylish and visually stunning story with an extremely macabre and dark topic. It contains passages of torturement, curses, witchburning, vampirism, massacres and resurrection but it's all brought to us in a very artistic fashion. Bava's profesionalism and style reminds me about the true masterpieces from Universal...Maybe also because the whole movie is filmed in beautiful black and white but merely because of the creepy atmosphere and the morbid topics. Black Sunday does contain rather many violent and sadistic scenes, but it becomes unwatchable or disgusting. Actually, when you look closer at it...it's a fairy tale !! Think about it...: evil witch, ominous castles, dark forests and - on top of it all - a tale of true love at first sight ! Barbara Steele should get as least as much credit and praise though. This stunning beauty can easily considered \"Queen of Horror\" if it were only for her performance here. Steele has a double role here ( the evil, vampiric Prinses Asa and the virgin Katia ) and her appearance can only be seen as on of beauty and pureness. Barbara Steele - once spit out by the glory of Hollywood - succeeds in convincing the audience that she stars as both an innocent virgin as well as a demonic ancient witch. The cinematic value attached to her character comes extremely close to Karloff's Frankenstein and Lugosi's Count Dracula. After all, Princess Asa was the first true female monster and she has - literally - become immortal. You're not a horror fan if you haven't seen the perfection of Black Sunday...I give this movie a very well deserved rating 10 out of 10.",
         "Be sure and watch the uncut version with the title \"The Mask of Satan,\" not the censored \"Black Sunday\" copy, to get the full effect of this living dead masterpiece of Italian cinema. More a movie of the undead than a vampire flick, it reminds the horror aficionado of a Val Lewton film from the 1940's, especially \"The Leopard Man,\" not that \"The Mask of Satan\" is about leopards, but the mood and atmosphere are similar. The film is about a woman of darkness and her mate who were executed for witchcraft two centuries before the Napoleonic period of European history. The most gruesome feature of the execution involved nailing a mask of Satan to their faces by means of a giant sledgehammer before they were entombed. By accident two hundred years later a doctor and his assistant while journeying through the region by coach on a dark stormy night filled with eerie devilish sounds, the doctor removes the mask from Princess Asa Vajda supposed corpse. Now Princess Vajda and her fiendish companion become free to seek their revenge. Their evil is released on the world and must be stopped. This is undoubtedly director Mario Bava best film. The marvelous camera work draws the viewer into the maelstrom of darkness and evil through innovative movements and angles. The shadowy settings where the actors are posed in ominous fashion are unforgettable. One obvious inspiration for Bava was the contemporary British Hammer horror film popular in America, especially with the drive-in crowd. The arrival of Katia Vajda with what appear to be the dogs of Hell, standing like a silhouette of damnation, reminds one of a Caspar David Friedrich painting from the German Romantic art movement of the Napoleonic era. One wonders if the director of \"The Omen,\" Richard Donner, patterned his creepy scene in the cemetery with the Rottweilers after this scene in \"The Mask of Satan.\" This movie remains a must see for horror fans, somewhat of a lost treasure.",
         "'Black Sunday's reputation grows with every year that passes, and watching it it's no wonder why! It is not only one of the three or four best horror movies ever made, it is one of the most extraordinary movies of any genre I've ever seen. Mario Bava went on to direct several movies of note after this, but if he hadn't and this was the only movie he made, he would still be a legend. On a relatively small budget, but with buckets of talent, style and originality, Bava conjured up one of the most atmospheric and haunting movies of all time. He may not be the household name he deserves to be, but he is a film makers film maker with an enormous influence on not only subsequent Italian horror giants Dario Argento and Lucio Fulci, but directors as diverse as Tim Burton (who rates this as an all time favourite) and even Martin Scorsese. 'Black Sunday' will also be remembered as one of Barbara Steele's most memorable roles. Steele is best known for her work in 60s European horror movies, but in her career worked with everyone from Fellini to Cronenberg. If she is to be remembered for only one movie it will be this one. Steele was one of the most beautiful actresses to ever set foot in front of a camera, and it is impossible to imagine anyone else in the lead (duel) role. The supporting cast is fine, and includes the fondly remembered John Richardson ('One Million Years B.C.'), but this is Steele's show all the way. 'Black Sunday' is still fresh and exciting over forty years after it was originally released. A landmark movie that deserves to be watched again and again!",
         "\"La Maschera del Demonio\" aka \"Black Sunday\" is an excellent Gothic chiller with plenty of uncanny atmosphere,a good script and an okay cast.Princess Asa Vajda(lovely Barbara Steele)is executed as a witch.200 years later,she is revived and plots to take over the body of Katia(also Barbara Steele).\"Black Sunday\" is a perfect combination of Expressionist lighting and set designs and graphic bursts of gore and sensuality.The film is full of striking visuals and is truly one of the most beautiful black and white films I have ever seen.A must-see for fans of Italian horror.10 out of 10.",
         "La Maschera Del Demonio/The Mask of Satan(1960) is the film that introduced audiences around the world to the cinema of Mario Bava. After years as Assistent Director and Director of Photography, Bava was rewarded with his first full directorial assignment and the results are impressive. He didn't direct full time until he was in his late 40's. Its interesting to note that two other directors named Lucio Fulci and Terence Fisher didn't get international recognization until their big breaks(Zombie[1979] + Curse of Frankenstein[1957]) when they were in their early to mid 50's. Its about a dead witch who returns from the dead with her lover to terrorize the descendents of their executioners. It was done due to the success of Horror of Dracula(1958). The opening scene of the execution of Asa is a stunning combination of atmosphere and violent imagery. The Mask of Satan(1960) is based on a short story by Nikolai Gogol. Gogol is a writer that would play together with Edgar Allen Poe as a major influence in Bava's Supernatural tales. Its one of the best horror films of the last fifty years. Asa is resurrected when the blood of a doctor is accidently dropped on her corpse(this is played homage to in Lamberto Bava's Demons 2{1986}). Tim Burton has cited this movie as one of his favorites. The film was pratically butchered in the states when first released, but has since been released on Home Video in uncut form(longest print in existence). This is an item that many aspiring Horror Filmmakers should watch in order to see how a great horror film should be done. The Mask of Satan(1960) isn't interested in plot and story as much as atmosphere and painting style visuals. Barbara Steele emerges as the first horror queen of the modern era. Barbara Steele has a macabre beauty that bewitches the viewer and gives her presence. Barbara Steele along with Christopher Lee, Peter Cushing, and Vincent Price were some of the greatest icons in 1960's-1970's horror films. Barbara Steele does outstanding work as the witch Asa and her descendent Katia. Mario Bava's direction has the look of a great artist. Bava also contributes to the great cinematography. La Maschera Del Demonio is a well made mixture of the Universal Horror features of the 30's-40's and the violence of Hammer Horror of the 50's-60's. The fact that Mario Bava did this based on the success of Horror of Dracula(1958) must have influenced Terence Fisher to respond by directing Dracula:Prince of Darkness(1965). One theme that is present in The Mask of Satan(1960) is the decay and decline of a once happy and powerful family(more fully explored in Bava's later films of Black Sabbath{1963}, The Whip & the Body{1964}, Lisa and the Devil{1974}, and Shock{1977}).",
         "BLACK SUNDAY is not merely equal to the best of Murnau, Whale, Freund and the Universal Pictures canon but surpasses all contenders with M.C. Escheresque visuals informed with the dark poetry of stylish sadism. Barbara Steele imbues her portrayal of the vampire/witch with a demonic majesty never before brought to the screen. Indeed, her visage a landscape of puncture wounds bearing forth wild, burning eyes and thick, cruel lips (promising the joys of eternal Hell) evokes the very standard of Italian fantascienza of the Sixties. The genius of Mario Bava is celebrated in highest form in this flagship effort, his directorial debut. This film enshrines Italian horror at its best, and Arturo Dominici's performance as vampire/sorcerer is nothing less than stellar. A chiaroscuro Black Mass.",
         "Mario Bava directed horror film about a witch killed by the Inquisition returning to get revenge on the families of those who wronged her. Moody black and white film is probably the one Bava directed title that most people know. It has creepy black and white photography, a creepy story and the radiant Barbra Steele (who can probably put this as her best known role). This is for many people the hight of Italian horror of the late 1950's and early 1960's. For me this is a very good but not particularly great film. Sure it looks good, and sure its filled with any number of iconic images in the first part of the film, the problem for me is that once the film starts to actually deal with revenge the film becomes less interesting then the early entombment. Yea it picks up at the end but the middle part plays out rather by the numbers. I know I'm in the minority on this but I wouldn't call it any real classic. Still its a very good film thats probably been over sold and over hyped by those who love Bava and his work. Worth a look."
      ],
      "genres": ["Horror"],
      "productionCompanies": [
         "Galatea Film",
         "Jolly Film",
         "Alta Vista Productions"
      ],
      "summaries": ["A vengeful witch and her fiendish servant return from the grave and begin a bloody campaign to possess the body of the witch's beautiful look-alike descendant. Only the girl's brother and a handsome doctor stand in her way."],
      "budget": 0
   },
   "movielensId": 3205,
   "movielens": {
      "languages": [
         "English",
         "Italiano"
      ],
      "releaseDate": "1960-08-11",
      "dvdReleaseDate": "1999-12-14",
      "directors": ["Mario Bava"],
      "runtime": 87,
      "movieId": 3205,
      "title": "Black Sunday",
      "mpaa": "NR",
      "actors": [
         "Barbara Steele",
         "John Richardson",
         "Ivo Garrani",
         "Arturo Dominici",
         "Enrico Olivieri",
         "Andrea Checchi",
         "Antonio Pierfederici",
         "Tino Bianchi",
         "Clara Bindi",
         "Mario Passante",
         "Renato Terra",
         "Germana Dominici"
      ],
      "imdbMovieId": "0054067",
      "originalTitle": "La maschera del demonio",
      "genres": ["Horror"],
      "youtubeTrailerIds": [
         "1Q5nV12AgVc",
         "7D7IF9fYh6Q"
      ],
      "plotSummary": "A vengeful witch and her fiendish servant return from the grave and begin a bloody campaign to possess the body of the witch's beautiful look-alike descendant. Only the girl's brother and a handsome doctor stand in her way.",
      "tmdbMovieId": 27632,
      "avgRating": 3.41699,
      "releaseYear": "1960",
      "numRatings": 259,
      "posterPath": "/rYsXRKUOdQW8xSy5heWzaO7N4nL.jpg"
   }
}