{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "adventure",
            "id": 4414
         },
         {
            "name": "american football player",
            "id": 155791
         },
         {
            "name": "film noir",
            "id": 195402
         }
      ],
      "imdb_id": "tt0086859",
      "video": false,
      "title": "Against All Odds",
      "recommendations": [
         42597,
         41971,
         3515,
         4988,
         42176,
         4639,
         8289,
         46027,
         74241,
         115039,
         114442,
         20858,
         49782,
         20416,
         24111,
         67307,
         3575,
         25501,
         31618,
         22828
      ],
      "backdrop_path": "/bXM3y7eW0MSljDwjhdoToaxDNtA.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Terry Brogan",
               "gender": 2,
               "credit_id": "52fe4436c3a368484e015fc9",
               "name": "Jeff Bridges",
               "profile_path": "/xms1RAY6q7Lzp7wNeRCB0kzhucn.jpg",
               "id": 1229,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Jessie Wyler",
               "gender": 1,
               "credit_id": "52fe4436c3a368484e015fcd",
               "name": "Rachel Ward",
               "profile_path": "/9X0KvALPyz1pg7jmxK1omjJ3l88.jpg",
               "id": 36042,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Jake Wise",
               "gender": 2,
               "credit_id": "52fe4436c3a368484e015fd7",
               "name": "James Woods",
               "profile_path": "/fl5Jx1WFvBcg1b9VZRfXTH6LPUE.jpg",
               "id": 4512,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Hank Sully",
               "gender": 2,
               "credit_id": "52fe4436c3a368484e015fdb",
               "name": "Alex Karras",
               "profile_path": "/y2E9CI3lja7TP219CZXr3XiELxp.jpg",
               "id": 73234,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Mrs. Wyler",
               "gender": 1,
               "credit_id": "52fe4436c3a368484e015fdf",
               "name": "Jane Greer",
               "profile_path": "/5naE6TElBR8mR4yG38ys0fpmoqi.jpg",
               "id": 10159,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Ben Caxton",
               "gender": 2,
               "credit_id": "52fe4436c3a368484e015fe3",
               "name": "Richard Widmark",
               "profile_path": "/whrZ2aEg3FghVaDJf0JRrEhFLWl.jpg",
               "id": 12149,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Tommy",
               "gender": 2,
               "credit_id": "52fe4436c3a368484e015fe7",
               "name": "Dorian Harewood",
               "profile_path": "/qSHAaRlh8yjTHtYReU0CUWgSFt5.jpg",
               "id": 8656,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Edie",
               "gender": 1,
               "credit_id": "52fe4436c3a368484e015feb",
               "name": "Swoosie Kurtz",
               "profile_path": "/sISOxpV6zn3EfC5uKVsX7s9xLBf.jpg",
               "id": 12967,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Steve Kirsch",
               "gender": 2,
               "credit_id": "52fe4436c3a368484e015fef",
               "name": "Saul Rubinek",
               "profile_path": "/1gsXmCmJIegqK0U8dwLz005UM0.jpg",
               "id": 3712,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4436c3a368484e015fd3",
               "name": "Taylor Hackford",
               "profile_path": "/heZfdghufTV3t3ayrWvIuiP1jvb.jpg",
               "id": 18596,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "530397eb92514121955cdb20",
               "name": "Eric Hughes",
               "profile_path": null,
               "id": 1294154,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "530397f892514121a1615aa0",
               "name": "Daniel Mainwaring",
               "profile_path": null,
               "id": 10147,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 3.536547,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 22160,
      "vote_count": 47,
      "budget": 0,
      "overview": "She was a beautiful fugitive. Fleeing from corruption. From power. He was a professional athlete past his prime. Hired to find her, he grew to love her. Love turned to obsession. Obsession turned to murder. And now the price of freedom might be nothing less than their lives.",
      "similar": [
         996,
         513285,
         14638,
         247,
         402,
         426,
         289,
         1092,
         417859,
         62206,
         256591,
         44115,
         10637,
         866,
         950,
         22881,
         599,
         9352,
         46195,
         76285
      ],
      "original_title": "Against All Odds",
      "runtime": 128,
      "poster_path": "/vhAWYo9ao2INJaLXDRbK7bVzLcX.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
         "name": "Columbia Pictures",
         "id": 5,
         "origin_country": "US"
      }],
      "release_date": "1984-03-02",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Taylor Hackford"],
      "runtime": 128,
      "synopsis": null,
      "writers": [
         "Eric Hughes",
         "Daniel Mainwaring"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0086859/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTAyNjQ3MzI3MDFeQTJeQWpwZ15BbWU3MDAwMDIwMzE@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Rachel Ward, Jeff Bridges, James Woods | See full cast and crew »"],
      "reviews": [
         "Just recently discovering this on dvd, I'm actually suprised I haven't heard much about it before. A modern film noir that's a very loose remake of \"Out of the Past\" with Robert Mitchum and Kirk Douglas. The film instead focuses on gorgeous, sunny locations like Mexico and the finer locations of L.A. instead of the dark and grungy look that most film noir's follow. Jeff Bridges stars as a pro L.A. football player that gets cut because of a mild injury. Upset because he has some good years left in him, he attempts to sue the team to no avail. Broke and looking for a job, a shady past friend played by James Woods shows up with a job offer: find his girlfriend who split on him and headed to Mexico. This girlfriend also happens to be the daughter of the woman who owns the L.A. pro football team, a ruthless business woman who is primarily interested in real estate and inherited the team from her late husband. When he decides he needs a vacation and the money, he takes Woods up on his offer. After a couple days of useless searching, he finally finds her...and immediately falls in love. The femme fatale is played by Rachel Ward, a hot commodity back then, coming off of The Thornbirds. A spoiled rich princess-type, she eventually succumbs to him and the following scenes are some of the most beautiful sequences put on film. The only commercial movie that has filmed scenes in the gorgeous ancient ruins of Chichen Itza and Tulum, these sequences make the film. The sex scene is one of the best I've seen, really putting a passion on the screen without becoming too...late night cinemax. Unfortunately, from here, the film plummets into a convuluted mess trying to deal with issues that seem out of place with the film: The L.A. business elite, gambling, real estate, etc. I think the film is definitely worth a watch for the first two-thirds alone. Also, dvd fans are encouraged to listen to the cast commentary. One of the better commentaries I've heard, there is a lot of great anecdotes from a rare track by Jeff Bridges and James Woods. The two leads really seem to come off as real friends joking and ribbing each other, unlike some of the stuffy professional actor commentaries that are usually the case.",
         "Ex football player Terry Brogran (Jeff Bridges) takes a job from sleazy friend Jake Wise (James Woods)--find his ex girlfriend Jessie Wyler (Rachel Ward) who shot him and ran away with a large amount of his cash. Terry tracks Jessie to Mexico...and immediately they fall in love. That's the first hour--the second hour becomes very convoluted with murders and double crosses all over the place. Interesting movie which is a semi-remake of \"Out of the Past\". In fact Jane Greer from the original plays the mother of her character here! The original was a strong, well-written film noir. This is not film noir--it's a combination romance/mystery/melodrama. Also Greer played a totally amoral woman in the original--here Ward isn't amoral, just misunderstood. Also Bridges is all pumped up and him and Ward work wonderfully together. Their frequent very R rated sex scenes really work. And it looks great--a portion of the film takes place in Mexico. Still there are definite problems here. One character, Edie (Swoosie Kurtz) is introduced to provide some REAL clumsy exposition...and doesn't pop up again until a HOUR later. I had forgotten who she was! Alex Karras is incredibly bad in his role. The plot gets way too confused. And the movie isn't sure what it wants to be. It switches gears so much I thought I was gonna get whiplash! The best part of the movie--an incredible car race down Sunset Blvd. has NOTHING to do with anything in the movie! The acting is pretty good. Bridges (in one of his few commercial films) and Ward LOOK fantastic, have great bodies and are both good in their roles. Woods is, surprisingly, pretty wooden. Greer isn't in much but she IS very good. And Richard Widmark hams it up in his small role. Also the film has a surprisingly somewhat downbeat ending. And there's a wonderful title song by Phil Collins (nominated for an Academy Award). A very interesting movie. I give it a 6. A sizable hit in its day--but that's because of the steamy sex scenes between Ward and Bridges.",
         "If I could tidily sum up \"Against All Odds\" in a witty or clever review I surely would, but it's not that kind of film. If you read the other user reviews you'll see that everyone has their own different opinion, loving the movie or hating it for their own personal reasons. And now I'll share my personal reasons with you... I was just a kid when the movie was released, and far too young to see it. I was, however, aware at the time that every man in America was in love with Rachel Ward and that the Phil Collins title song (and video) was played incessantly. From what I had heard and seen of the movie it seemed very adult, even taboo... unusual in the (mostly) family-friendly 1980's. Flash forward twenty years... I finally saw the movie on cable... it was great, not just as a film but because I'd been waiting so long to see it. It's an adult movie, a loose remake of an old film noir but \"Against All Odds\" never gets too heavy. The mistake so many noir-wannabes make is to have the characters so dark, so doomed, so DAMNED, that you lose all sympathy for them. This film avoids that, carefully showing how decent people can do terrible things and still remain... decent people. Jake Wise (James Woods, great as always)- is the skunky, understated gangster who hires his footballer buddy Terry Brogan (Jeff Bridges) to find his missing girlfriend Jess (Rachel Ward). Terry finds the sultry, irresistible girl in South America but decides not to tell Jake, opting instead to take her to bed and spend two weeks with her in paradise. Trouble finds them, as it always does, and the rest of the film is spent unraveling the web in which all three find themselves, with enough surprises to keep you guessing. This film also fits nicely into my favorite sub-genre: The 80's Cocaine Nightmare. Such films- including \"Bright Lights, Big City,\" \"American Psycho,\" \"Tequila Sunrise,\" and \"Less Than Zero\"- feature successful, beautiful people whose greed, ambition, and love of the flake eventually bring them to their sticky end. You may love it, you may hate it, but \"Against All Odds\" to me is a definitive 80's movie. It just works. And the final scene- scored by Phil Collins' title song- is perfection.",
         "Just bought and watched this DVD. This is the first time I've watched this film for many years. I've always loved this film and its great to finally own it on DVD. Its hard to believe this film is 20 years old now but it hasn't dated and is one of the best films to come out of the 80's. Its a cracking thriller that goes along at a fast pace. it does get a bit muddled in the middle as the plot unfolds but builds up to a dramatic ending. Rachel Ward is totally stunning in this film and has a fantastic body though sadly we don't get to see all of her body thanks to some pretty remarkable camera work!! The scenes between her and Jeff Bridges are very hot. James Woods is great in this film as well. Its a real tear jerking end with the end credits rolling to Phil Collins greatest ever song 'Against all Odds' with our two stars of the film unable to be with each other thanks to Rachel Ward's powerful family. If ever a film needed a sequel it was this one but sadly it was never made. This film is well worth owning on DVD and can be bought at a pretty cheap price and comes with quite a few deleted scenes which do add to the film. I must check out the Directors commentary with James Wood and Jeff Bridges. On the whole this is a very watchable film with some very steamy scenes. I give it 8 1/2 out of 10. A little known fact is that the song 'Against All Odds' was a reject song from one of Phil Collin's albums which he deemed wasn't good enough for the album!!!!",
         "Loosely based on Out Of The Past, this updating brings some new elements, many of which work, a few of which don't. Neat use of Jane Greer, heroine of the first film, as heroine's mother. So many new twists and turns, knowing the original will not spoil this thriller's conclusion. Only thing as per usual with Taylor Hackford, the film goes on a bit too long, but most of it is so good, you won't mind.",
         "The single thing that stand out most for me in this film is the very last shot of Rachel Ward looking at the camera while Phil Collins, singing the title song, says \"How can I just watch you walk away, when all I can do is watch you leave\". If you've ever been part of a couple where 2 people loved each other so very much, but it had to end because circumstances like jobs, school, parents, etc. made it impossible to continue, this movie is for you. If you've lived through a time in your life when you and your friends/lovers were immortal-young lions-with the world at your feet, but one day you sense a change of seasons in the air... a change that for shadows the coming of the real world you always knew was there but that you had hoped against hope to avoid, you'll love this movie. Great characters, solid performances, top notch script, beautiful natural scenery in Mexico, great soundtrack and a real \"LA in the 80's\" feel. For the most part the film holds up well today and the \"look\" is timeless. Very few holes in the plot, if any, and a fine supporting cast.",
         "Parts of \"Against All Odds\" are absolutely magnificent. The Mexican location photography is terrific. Rachel Ward looks great as does Jeff Bridges. The chemistry between them is mostly believable. I liked James Wood's smarmy, pompous, character. Alex Karras seemed miscast, as did Richard Widmark. The story piles on a thickening plot that occasionally wanders off course, and is probably more complex than necessary. No police are involved, and bodies too conveniently disappear. The ending seems especially forced, with an outcome that is less than satisfying. The film is beautiful, however the characters are mostly unlikeable, including Rachel Ward's. Nevertheless, I still enjoyed this partially flawed movie. - MERK",
         "I expected a cringefest, but actually ended up liking this movie a lot. Befitting its era, it has a sleazy \"Miami Vice\" atmosphere, complete with Porsches, Ferraris, casual jackets, big hair and a great soundtrack including a live show by the one and only Kid Creole. But there's more. Nice location shoots in Mexico - Cozumel, Tulum and Chichen Itza. Jeff Bridges and James Woods, who play fairly complex characters well. A dark script that delivers some good moments, especially during the final 30 minutes. Yes, it's a B-movie, and at times it feels like a protracted episode of Knight Rider, the A-Team or the aforementioned Miami Vice. But is that a bad thing? If you're looking for a real 80s experience, find \"Against All Odds\" on VHS, pop it in your VCR and soak it in.",
         "Anyone who has ever read Daniel Mainwaring's 1947 novel 'Out of the Past' will quickly see the connection to Hollywood's newest remake called \" Against All Odds.\" In the 47' version it was Robert Mitchum against Kirk Douglas, the new release star's Jeff Bridges and James Woods. In the original Mainwaring story, the hero plays a detective, the second transforms him into a football player. Both are essentially hired to travel South, searching for a run-away girlfriend with stolen cash. Both find the girl and then the story becomes more convoluted than a Bavarian pretzel. The movie is fraught with twists and turns and once inside the story-line, it becomes difficult to follow who is doing what to whom. Following closely, the audience is privy to the hot-off-the-griddle love triangle between the principals. At the same time, we try as hard as we can to Follow the Money. Those who have it want more and those who ignore it, willingly trade it for personal interest. In the end, this is a particular film which warns audience members, don't take your eyes and ears off the screen or else you'll lose your place. Interesting novel, but loses something when transfered to the screen. Alex Karras, Sal Rubinek and the late great Richard Widmark, add to the re-make. But, personally, I like the original movie as the re-make will steam up your glasses. ****",
         "I give this movie a 10. I'm a longtime fan of Jeff Bridges, and this is one of his best. Jeff is the only good guy surrounded by bad guys and worse guys. Even the women are treacherous, except Swoosie Kurtz, who plays a kind of pathetic, lonely secretary. \"Against All Odds\" is a remake of an older film, but they've done a nice job updating it. There are so many twists and turns in the plot, it will keep you guessing right up to the end. I don't want to give anything away, but there's a great car chase scene that will have you on the edge of your seat. There are some nice scenes of the ruins at Chichen Itza (in Mexico) and the beautiful island of Cozumel before it became a tourist trap. The soundtrack is great too. I've seen this movie at least 10 times on video, maybe more. When I first saw it in the theater in 1984 I hadn't even heard of James Woods before. He is truly a plus in this picture, in fact all the cast is really good. Even though this is in the category of \"Romance\" it's not a chick-flick. Guys will like it too."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Crime",
         "Drama",
         "Romance",
         "Thriller"
      ],
      "productionCompanies": [
         "Columbia Pictures Corporation",
         "New Visions Pictures"
      ],
      "summaries": [
         "Terry Brogan, an aging football player in L.A., is cut early in the season; he needs money, so he takes a job from a shady friend of his, Jake Wise, to track down Wise's girlfriend, Jessie, who's somewhere in Mexico. She's also the daughter of a very wealthy land developer, who owns Terry's team. He heads for Cozumel, finds Jessie, and promptly falls in love with her. He thinks it's mutual, then without warning, she heads back to L.A. and Jake. What's going on with her, and what's the connection between Jake's hold on Jessie and the various politicians, lawyers, and environmentalists who seem to be converging on some sort of land deal? Terry keeps looking for answers.",
         "Los Angeles Outlaws receiver Terry Brogan is cut from the team because of a shoulder injury. Needing work, money and a sense of purpose, Terry gets a lucrative short term job with an old acquaintance, nightclub owner Jake Wise. The job is to locate his girlfriend who is hiding out somewhere in the Mayan Riviera. The girlfriend, Jessie Wyler, just happens to be the adoptive daughter of the Outlaws' ruthless owner, Grace Wyler. Jessie doesn't much like her mother, who in turn doesn't like that Jessie's in a relationship with Jake, a man known to be on the wrong side of the law. Once Terry finds Jessie, she is waiting for him, or at least someone sent by Jake. But without telling Jake, Terry decides to quit his job as he is falling in love with Jessie, who seems also to be falling in love with him. But it isn't until they get back to Los Angeles that Terry slowly sees the big picture of where he fits into Jake's life and to what extent Jake will go to get Jessie back.",
         "A gangster hires an ex-football player to find his girlfriend. When he finds her, they fall in love, and the twists start to appear."
      ],
      "budget": 13000000
   },
   "movielensId": 3206,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1984-03-02",
      "dvdReleaseDate": "1999-12-14",
      "directors": ["Taylor Hackford"],
      "runtime": 128,
      "movieId": 3206,
      "title": "Against All Odds",
      "mpaa": "R",
      "actors": [
         "Jeff Bridges",
         "Rachel Ward",
         "James Woods",
         "Alex Karras",
         "Jane Greer",
         "Richard Widmark",
         "Dorian Harewood",
         "Swoosie Kurtz",
         "Saul Rubinek"
      ],
      "imdbMovieId": "0086859",
      "originalTitle": "Against All Odds",
      "genres": [
         "Action",
         "Adventure",
         "Crime",
         "Drama",
         "Mystery",
         "Romance",
         "Thriller"
      ],
      "youtubeTrailerIds": ["7SvYYPHyuAI"],
      "plotSummary": "She was a beautiful fugitive. Fleeing from corruption. From power. He was a professional athlete past his prime. Hired to find her, he grew to love her. Love turned to obsession. Obsession turned to murder. And now the price of freedom might be nothing less than their lives.",
      "tmdbMovieId": 22160,
      "avgRating": 3.00122,
      "releaseYear": "1984",
      "numRatings": 818,
      "posterPath": "/vhAWYo9ao2INJaLXDRbK7bVzLcX.jpg"
   }
}