{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "gypsy",
            "id": 394
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "chestnut",
            "id": 231151
         }
      ],
      "imdb_id": "tt0040552",
      "video": false,
      "title": "The Loves of Carmen",
      "recommendations": [
         38705,
         4938
      ],
      "backdrop_path": "/oGJiuLr7nTfuOsiSnZs4kSdu41c.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Carmen",
               "gender": 1,
               "credit_id": "52fe4649c3a36847f80f67df",
               "name": "Rita Hayworth",
               "profile_path": "/oG6UWxpq552LN5re0TJESUGP0K7.jpg",
               "id": 33741,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Don José",
               "gender": 2,
               "credit_id": "52fe4649c3a36847f80f67e3",
               "name": "Glenn Ford",
               "profile_path": "/t6lpxAmhOrRJ22d2xnQ1uB0CJf6.jpg",
               "id": 3381,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Andrés",
               "gender": 2,
               "credit_id": "52fe4649c3a36847f80f67e7",
               "name": "Ron Randell",
               "profile_path": "/d0sDiC4bLh0xk7VI4C2DixeSB61.jpg",
               "id": 115308,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "García",
               "gender": 2,
               "credit_id": "52fe4649c3a36847f80f67eb",
               "name": "Victor Jory",
               "profile_path": "/4phylVED6xN2gFYeUQnywahstGG.jpg",
               "id": 15666,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Dancaire",
               "gender": 2,
               "credit_id": "52fe4649c3a36847f80f67fb",
               "name": "Luther Adler",
               "profile_path": "/xzA25GAYqL47tWN8r2z0HPOOitv.jpg",
               "id": 55821,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Colonel",
               "gender": 2,
               "credit_id": "52fe4649c3a36847f80f67ff",
               "name": "Arnold Moss",
               "profile_path": "/dzYW3sJFzM15zHlhb3PeHRxPPkI.jpg",
               "id": 15676,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Remendado",
               "gender": 2,
               "credit_id": "52fe4649c3a36847f80f6803",
               "name": "Joseph Buloff",
               "profile_path": "/1rUtzjm3U95cocBLVzTxPbctMsI.jpg",
               "id": 987050,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Old Crone",
               "gender": 1,
               "credit_id": "52fe4649c3a36847f80f6807",
               "name": "Margaret Wycherly",
               "profile_path": "/yKKrlALusigfwNRyZeMH1Pfuar1.jpg",
               "id": 78791,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Pablo",
               "gender": 2,
               "credit_id": "52fe4649c3a36847f80f680b",
               "name": "Bernard Nedell",
               "profile_path": "/nk34BsDof6fWeBtBvpAZRJTbedh.jpg",
               "id": 118257,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Lucas",
               "gender": 2,
               "credit_id": "52fe4649c3a36847f80f680f",
               "name": "John Baragrey",
               "profile_path": "/ltv3MppZyeFOD6Wbz9BXoB0FRdB.jpg",
               "id": 94339,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4649c3a36847f80f67db",
               "name": "Charles Vidor",
               "profile_path": "/pE9oZbia0o9MlwD914sgWYooePl.jpg",
               "id": 32134,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe4649c3a36847f80f67f1",
               "name": "Helen Deutsch",
               "profile_path": null,
               "id": 31068,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4649c3a36847f80f67f7",
               "name": "Prosper Mérimée",
               "profile_path": "/dPcCeYiSprRNJMx1rwzwBJyeFea.jpg",
               "id": 148059,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "5542b83a92514158680004d2",
               "name": "Mario Castelnuovo-Tedesco",
               "profile_path": null,
               "id": 29621,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5542b8509251415863000581",
               "name": "Charles Vidor",
               "profile_path": "/pE9oZbia0o9MlwD914sgWYooePl.jpg",
               "id": 32134,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5542b860925141586d000595",
               "name": "William E. Snyder",
               "profile_path": null,
               "id": 41709,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5542b86fc3a3680cd9000557",
               "name": "Stephen Goosson",
               "profile_path": null,
               "id": 29345,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "5542b879925141587600050b",
               "name": "Cary Odell",
               "profile_path": null,
               "id": 13864,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "5542b88792514158680004da",
               "name": "Jean Louis",
               "profile_path": "/uJ2hQZlHtrMJpcigGtM6KP7svBz.jpg",
               "id": 12145,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "5542b896c3a3680ce8000534",
               "name": "William Kiernan",
               "profile_path": null,
               "id": 34436,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "5542b8a2c3a3680cdf000517",
               "name": "Wilbur Menefee",
               "profile_path": null,
               "id": 34467,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "5542b8c4c3a3680cd9000560",
               "name": "Charles Nelson",
               "profile_path": null,
               "id": 20601,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5542b8d6c3a3680cdf00051d",
               "name": "Clay Campbell",
               "profile_path": null,
               "id": 31206,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 1,
               "credit_id": "5542b8e5925141586f0004fb",
               "name": "Helen Hunt",
               "profile_path": null,
               "id": 31207,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.943663,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 43455,
      "vote_count": 3,
      "budget": 0,
      "overview": "Gypsy Carmen drives men wild in 1820s Spain, especially the dragoon Don Jose.",
      "similar": [
         15069,
         11423,
         357096,
         4771,
         979,
         281,
         75780,
         281957,
         395834,
         445954,
         25376,
         21484,
         3134,
         12143,
         984,
         18587,
         26390,
         12150,
         8456,
         1949
      ],
      "original_title": "The Loves of Carmen",
      "runtime": 99,
      "poster_path": "/scHdX9YXbkPeU6X3PRNNi0RFpbV.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
         "name": "Columbia Pictures",
         "id": 5,
         "origin_country": "US"
      }],
      "release_date": "1948-08-23",
      "vote_average": 7.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Charles Vidor"],
      "runtime": 99,
      "synopsis": null,
      "writers": [
         "Helen Deutsch",
         "Prosper Mérimée"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0040552/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU3MjMyNjEyOF5BMl5BanBnXkFtZTcwODU5MDAzMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Rita Hayworth, Glenn Ford, Ron Randell | See full cast and crew »"],
      "reviews": [
         "A movie that far outdoes its meager reputation. It reunites Gilda's stars, Glenn Ford and Rita Hayworth, in a Spanish adventure based on the original novel Carmen, on which Bizet's opera is based. The story is extremely melodramatic, of course, but it's endlessly entertaining. Glenn Ford is pretty good as a nobleman who throws everything away for the love of his gypsy woman, Carmen. And Hayworth is as scorching as ever, even though her hair is brown. For those who love classic Hollywood opulence, this is definitely your movie. The film is in truly glorious Technicolor, some of the most beautiful cinematography of its era. The costumes, art direction, and music (none of it based on Bizet) are exceptional. The Loves of Carmen deserves better than it has gotten. 9/10.",
         "The casting of Rita Hayworth as Carmen, the passionate Spanish gypsy who rolls her own cigarettes and picks her own men, was inspired; \"The Loves of Carmen,\" was not... Making lavish use of her considerable charms, physical assets and whatever acting ability was necessary, Rita made her Carmen the most colorful, heartless and hot-blooded screen heroine of the year... Although by this time Rita's mind was on the Riviera, where she was about to embark on the great romantic adventure of her life... Ford was not able to make audiences believe in him as the Spaniard with spoiled love life since his acting forte usually followed a much different romantic approach\u0097Offer the heroine yourself, the prospects of a happy future and a direct sexual approach, open and above-board... And if that fails, a few fast slaps across the chops would usually bring any reluctant heroine to her senses...",
         "...And at the zenith of her 'love goddess' period. This films is a literal (and completely non-musical) version of the Carmen story. When Rita dances in the film (and she does dance!)-- she is always hidden from the camera/audience--as a way of saying: love goddess at work--no frills necessary. Even so, she makes Carmen truly naughty--so much so that you wonder that she lives as long as she does. Carmen is a woman with more than the necessary number of tragic flaws. Rita makes her beautiful and vibrant--but tragic nevertheless.",
         "Ah, too bad they don't make like these anymore! Beautiful, much-missed (by me!) old Technicolor helps to create both romantic, pristine 19th century Spain which never was and romantic, enchanting beauty of Carmen. She is gorgeous, entertaining and artificial with red hair (shouldn't it be dark?), red flowers and black mantilla. There is also sometimes delicious 1940's dialogue (by Helen Deutsch who also wrote great 1955 Cinderella movie Glass slipper). Carmen is a gypsy version of Scarlett O'Hara, rotten apple with no compassion to anyone - and she really likes to spit! - although it is easy to sympathize her desire not to give her heart to any of the supposedly innocent but actually brain-between-legs admirers around her. They offer shallow, \"pure\" love while being sex-obsessed, abusive boors: general hits his servant, Carmen's charms make every man to follow her like dog in heat, Carmen tells that wife-beating is rampant in village... Don't get me me wrong, Carmen needed good tongue-lashing, but good and evil are really blurring in this extremely well-made (thanks to virtues of old studio system!) melodrama.",
         "Based on Bizet's tragic Spanish opera, this was Rita Hayworth's first film made by her production company, Beckworth (derived from her screen surname and from the name of her daughter, Rebecca). She decided on her close friend and favorite leading man, Glenn Ford, as Don Jose to her Carmen. The results are far better than some reviews would have you believe. The glorious, lush Techincolor is fabulous (studio-bound as most of the sets may be), while Hayworth's unforgettable screen presence, dancing and bewitching beauty, and the heat generated between her and Ford makes this movie memorable. The sequence in which she describes what virtues a lover should have (complete with putting her finger to his lips) sparkles with sensual static. Granted, Ford looks stiff and ill at ease in his uniform (after he sheds his soldier garb and dons his \"bandit clothing\", he appears much more relaxed). If it is deemed worthy enough to be released as part of the Columbia Classics collection, so should \"Affair In Trinidad\", another Hayworth/Ford collaboration. It's just great to look at, flaws aside. If you adore Rita and Glenn, even in a tempestuous, volatile romance, this movie will provide that for you. Was there ever a more enticing, tempestous gypsy with so many men in her life but only one true and ultimately tragic love?",
         "There are times when RITA HAYWORTH, with her flashing eyes, heady mane of tresses and way with castanets and Spanish dances, amply fills the role of Carmen in THE LOVES OF CARMEN. She captures the flirtatious moods and stormy temperament without any trouble at all, and yet somehow every ravishing close-up reminds us that she has just been all glammed up by the make-up artist, every brush on her lips and hair and brows just given the royal Hollywood glamor treatment. Her glamor is so distracting that it renders her Carmen unrealistic, even though she certainly has the temperament to go with the part. GLENN FORD is somber, stalwart and rugged enough as Don Jose but it doesn't seem like ideal casting. He looks uncomfortable in much of the early footage and only comes to life when he has killed a man and must spend the rest of the film on flight as a bandit and desperado in the rugged mountains. His performance strengthens and his love/hate relationship with Carmen is, for the most part, quite believable. But some pseudo-Spanish music in the background score with a hint of Bizet would have been a wise approach to scoring the film. And giving Rita more than a couple of fiery dances would have been a smarter idea. As it is, her dancing moments are when she most completely captures the spirit of Carmen. It's entertaining, in a lumbering sort of way--not exactly the most well paced version of the story. Hayworth is gorgeous to look at with a peaches and cream complexion that fairly glows in Technicolor, but all of her close-ups remind us that she is The Love Goddess being given the high gloss glamor treatment by the studio that made her a star. But, reservations aside, for fans of Hayworth and Ford, this is a must see.",
         "It may be Composer-Screenwriter-Author Helen Deutsh was too captivated by studying the work of \"Carmen\" librettists Henri Meilhac and Ludovic Halevy. Back in 1873 this leading team penned a text for Georges Bizet's opera, \"Carmen\" that would support an ultimately legendary work. But times have changed. Without Bizet's intoxicating score, this tale (from an 1845 novella by Prosper Merimee) now plays like something freshly removed from mothballs: stiled dialogue, cardboard characters and benign dramaturgy make for quite tepid viewing. True, it's a great role for Rita, but she must utter quite cliched lines, while posturing with \"Carmen mannerisms\" with no real heart or soul. Mr. Ford also looks most uncomfortable as the naive novice soldier, and behaves as though he's stuck with some stagnant contractual obligation at Columbia Pictures. Only when Ms. Hayworth is given an opportunity to dance does she truly come to life. Here she can really show off her vitality and the fruits of her long-term choreographic labours. So, we have here Bizet's opera without Bizet's music. The production design and costuming are most colorful as everyone struggles valiantly to breathe life into the proceedings. Deutsch probably should have glanced at the libretto and novella, then gone on to write an original script--which should was capable of doing, based on her record of a half dozen successful musical and dramatic screenplays she penned over the years. The recently released DVD on Columbia Classics should bring pleasure to film buffs in general and fans of Hayworth (and Ford) in particular.",
         "Rita Hayworth reached back to her portrayal of Dona Sol in Blood and Sand and even further back to her Spanish heritage for a riveting performance as Carmen, the fiery and seductive gypsy created by Prosper Merimee and immortalized by Bizet in his opera. The Loves of Carmen is Rita's co-production with Columbia Pictures and this would be her last film for several years as right after this film came out, she married Aly Khan. She became a Princess and lived one wild jet setting life. She was queen of the tabloids back then. Carmen as done by Hayworth is beautiful, fascinating, and frightening. Scary in the way she just uses, abuses, and discards the male of the species. It's the perfect Rita Hayworth role for those demanding to see in my opinion the greatest sex goddess the cinema ever produced. The reason that The Loves of Carmen is not a classic is the horrible miscasting of Glenn Ford as Don Jose. Try as he might Glenn Ford comes off about as Latin as Curt Jurgens. Ford had the same problem when he was cast in Rudolph Valentino's role in the remake of The Four Horseman of the Apocalypse. Tyrone Power worked well opposite Rita in Blood and Sand, but he was at the wrong studio. And it would have to have been the pre World War II Power. Someone like Farley Granger who could have suggested a callow youth might have been better. Rita cast Ford in the part, partly for reasons of friendship, partly because it cost nothing extra because Glenn was under contract to Columbia as she was, and partly due to the big box office they became because of Gilda two years earlier. When Rita did return to the screen after her marriage to Aly Khan was over, Ford appeared opposite her in Affair in Trinidad which was far better suited to his image. I won't go into the plot because the Bizet Opera and the musical Carmen Jones has made it all so familiar. Let's just say that between Hayworth's amorality and Ford's hormones it ends in tragedy for both. The rest of the cast does just fine. Note the good performances of Arnold Moss as Ford's commanding officer, Victor Jory as the gypsy bandit leader, Margaret Wycherly as the old gypsy woman who foretells the future for all. Most of all Luther Adler who is a cynical observer of all around him from Jory's band of thieves. But as in another Columbia classic, The Loves of Carmen could have been a contender.",
         "As stated elsewhere,this is a non-musical version of \"Carmen\", based not on the opera, but on Prosper Merimee's original story which inspired it. The movie doesn't use Bizet's music, not even as background, but the plot is essentially the same as in the opera, and the Merimee story. Without giving away the ending for those who don't know it, I will say the Production Code enforced at the time imposed an even harsher \"eye for an eye\" ending than in any previous or future version. The acting is sincere, if not great. Rita Hayworth is an excellent choice for Carmen; unfortunately,the producers were trying for a follow-up to the smash hit \"Gilda\",so they again paired her with Glenn Ford, hilariously miscast as Don Jose, her soldier-lover. (It doesn't work this time.)The sets are very obviously studio bound,and no one will ever be fooled into thinking this was really shot in Spain. The dialogue verges on typical \"B\" picture dialogue;in fact, if you didn't know this was \"Carmen\", you WOULD think it was just a trashy-but-fun-to-watch melodrama in gorgeous Technicolor.",
         "This movie tried to capitalize on the (deserved ) success of \"Gilda\" (same director,same actors).The screenplay is faithful to Prosper Merimée's novel (Preminger's \"Carmen Jones\" rather found its inspiration in the opera libretto) with a slight difference in the finale .Rita Hayworth is ideally cast as Carmen and her suggestive flamenco is the peak of a rather undistinguished work.Glenn Ford ,notably ,seems ill at ease in his uniform and anyway he is not \"latin\" enough to portray a Spanish officer successfully.Directing lacks madness and instead of using the beautiful Spanish landscapes,all seems to have been filmed in studio."
      ],
      "genres": [
         "Adventure",
         "Drama",
         "Music",
         "Romance"
      ],
      "productionCompanies": [
         "Columbia Pictures Corporation",
         "The Beckworth Corporation"
      ],
      "summaries": [
         "Following the plot of the opera, \"Carmen,\" this story follows the wild gypsy's adventures as a siren and bandit. Carmen lures an innocent soldier to his ruin, getting him expelled from the army. He then turns to banditry, killing Carmen's husband and others. All this makes for an unhappy ending with the innocent repenting his sins and dying for them.",
         "A beautiful but amoral gypsy girl entices a young dragoon to betray his honor and get cashiered from the service, and for her sake he soon turns to a life of crime."
      ],
      "budget": 0
   },
   "movielensId": 3209,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1948-08-23",
      "dvdReleaseDate": "1999-12-21",
      "directors": ["Charles Vidor"],
      "runtime": 99,
      "movieId": 3209,
      "title": "The Loves of Carmen",
      "mpaa": "",
      "actors": [
         "Rita Hayworth",
         "Glenn Ford",
         "Ron Randell",
         "Victor Jory",
         "Luther Adler",
         "Arnold Moss",
         "Joseph Buloff",
         "Margaret Wycherly",
         "Bernard Nedell",
         "John Baragrey"
      ],
      "imdbMovieId": "0040552",
      "originalTitle": "The Loves of Carmen",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Gypsy Carmen drives men wild in 1820s Spain, especially the dragoon Don Jose.",
      "tmdbMovieId": 43455,
      "avgRating": 2.6,
      "releaseYear": "1948",
      "numRatings": 15,
      "posterPath": "/scHdX9YXbkPeU6X3PRNNi0RFpbV.jpg"
   }
}