{
   "tmdb": {
      "original_language": "es",
      "keywords": [
         {
            "name": "gay",
            "id": 237
         },
         {
            "name": "cuba",
            "id": 701
         },
         {
            "name": "1970s",
            "id": 1228
         },
         {
            "name": "artist",
            "id": 2679
         },
         {
            "name": "male friendship",
            "id": 3230
         },
         {
            "name": "homosexuality",
            "id": 10180
         },
         {
            "name": "social commentary",
            "id": 11479
         },
         {
            "name": "student",
            "id": 12105
         },
         {
            "name": "lgbt",
            "id": 158718
         },
         {
            "name": "communism",
            "id": 173644
         },
         {
            "name": "havana",
            "id": 239161
         }
      ],
      "imdb_id": "tt0106966",
      "video": false,
      "title": "Strawberry and Chocolate",
      "recommendations": [
         284050,
         35847,
         12453,
         53701,
         19822,
         244009,
         152611,
         15727,
         123888,
         47452,
         47576
      ],
      "backdrop_path": "/cbKhLxUFn9T3sq9v6QFDky82xqh.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Diego",
               "gender": 2,
               "credit_id": "52fe44f49251416c75046b85",
               "name": "Jorge Perugorría",
               "profile_path": "/k12HtTuSZO5bxN48GDy9l9dTucS.jpg",
               "id": 64846,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "David",
               "gender": 2,
               "credit_id": "52fe44f49251416c75046b89",
               "name": "Vladimir Cruz",
               "profile_path": "/4XmawcHAbliGh8p5ALEHSvfn2hx.jpg",
               "id": 72642,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Nancy",
               "gender": 0,
               "credit_id": "52fe44f49251416c75046b8d",
               "name": "Mirta Ibarra",
               "profile_path": "/aqHpIjAK5wGhODK1QXwSB9cRaT0.jpg",
               "id": 72644,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Miguel",
               "gender": 0,
               "credit_id": "52fe44f49251416c75046b91",
               "name": "Francisco Gattorno",
               "profile_path": "/cRJkipLRz7uM68WI4Mwz3dyCOFB.jpg",
               "id": 72645,
               "order": 3
            },
            {
               "cast_id": 18,
               "character": "German",
               "gender": 0,
               "credit_id": "5909a022c3a368359d00bcc7",
               "name": "Joel Angelino",
               "profile_path": null,
               "id": 1809288,
               "order": 4
            },
            {
               "cast_id": 19,
               "character": "Vivian",
               "gender": 0,
               "credit_id": "5909a02e9251411cd900b7e2",
               "name": "Marilyn Solaya",
               "profile_path": null,
               "id": 1475682,
               "order": 5
            },
            {
               "cast_id": 20,
               "character": "Santero",
               "gender": 0,
               "credit_id": "5909a0399251411cef00b784",
               "name": "Andrés Cortina",
               "profile_path": null,
               "id": 1199993,
               "order": 6
            },
            {
               "cast_id": 21,
               "character": "Groom",
               "gender": 0,
               "credit_id": "5909a0449251411ce400b53f",
               "name": "Antonio Carmona",
               "profile_path": null,
               "id": 1378145,
               "order": 7
            },
            {
               "cast_id": 22,
               "character": "Taxi driver",
               "gender": 0,
               "credit_id": "5909a050c3a368357e00c177",
               "name": "Ricardo Ávila",
               "profile_path": null,
               "id": 1718930,
               "order": 8
            },
            {
               "cast_id": 23,
               "character": "Passenger 1",
               "gender": 0,
               "credit_id": "5909a05d9251411ce400b552",
               "name": "María Elena del Toro",
               "profile_path": null,
               "id": 1809289,
               "order": 9
            },
            {
               "cast_id": 24,
               "character": "Passenger 2",
               "gender": 0,
               "credit_id": "5909a06cc3a36835ee00b7c4",
               "name": "Zolanda Oña",
               "profile_path": null,
               "id": 1809290,
               "order": 10
            },
            {
               "cast_id": 25,
               "character": "Neighbor",
               "gender": 0,
               "credit_id": "5909a077c3a368354800ab6e",
               "name": "Diana Iris del Puerto",
               "profile_path": null,
               "id": 1809291,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe44f49251416c75046b97",
               "name": "Tomás Gutiérrez Alea",
               "profile_path": "/AuEg77qT2WwFB3ysDa2wX55epWd.jpg",
               "id": 72646,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f49251416c75046b9d",
               "name": "Juan Carlos Tabío",
               "profile_path": "/xnSwyVvLcpjytBEO9OVQd62biA2.jpg",
               "id": 72647,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f49251416c75046ba3",
               "name": "Senel Paz",
               "profile_path": null,
               "id": 72648,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f59251416c75046ba9",
               "name": "Georgina Balzaretti",
               "profile_path": null,
               "id": 72650,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f59251416c75046baf",
               "name": "Frank Cabrera",
               "profile_path": null,
               "id": 72651,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f59251416c75046bb5",
               "name": "Camilo Vives",
               "profile_path": null,
               "id": 72652,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f59251416c75046bbb",
               "name": "José María Vitier",
               "profile_path": null,
               "id": 72653,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f59251416c75046bc1",
               "name": "Mario García Joya",
               "profile_path": null,
               "id": 72654,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f59251416c75046bc7",
               "name": "Osvaldo Donatién",
               "profile_path": null,
               "id": 72655,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f59251416c75046bcd",
               "name": "Rolando Martínez",
               "profile_path": null,
               "id": 72656,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f59251416c75046bd3",
               "name": "Miriam Talavera",
               "profile_path": null,
               "id": 72657,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f59251416c75046bd9",
               "name": "Senel Paz",
               "profile_path": null,
               "id": 72648,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.500741,
      "production_countries": [
         {
            "iso_3166_1": "CU",
            "name": "Cuba"
         },
         {
            "iso_3166_1": "ES",
            "name": "Spain"
         }
      ],
      "id": 12527,
      "vote_count": 18,
      "budget": 0,
      "overview": "Havana, Cuba, 1979. Flamboyantly gay artist Diego (Jorge Perugorría) attempts to seduce the straight and strait-laced David, an idealistic young communist, and fails dismally. But David conspires to become friends with Diego so he can monitor the artist's subversive life for the state. As Diego and David discuss politics, individuality and personal expression in Castro's Cuba, a genuine friendship develops between the two. But can it last? Strawberry and Chocolate became an instant hit when it was released, and has become a classic of Cuban cinema due to its charming and authentic exploration of a connection between two people under historical circumstances that seem levelled against them.",
      "similar": [
         376867,
         449176,
         5001,
         1420,
         1213,
         1429,
         4995,
         306819,
         10139,
         338189,
         258480,
         1391,
         258034,
         184352,
         468,
         26280,
         11000,
         1378,
         113833,
         11386
      ],
      "original_title": "Fresa y chocolate",
      "runtime": 108,
      "poster_path": "/7NdKNNrONwbmCOJgTO4wYjWzQyW.jpg",
      "spoken_languages": [{
         "name": "Español",
         "iso_639_1": "es"
      }],
      "production_companies": [
         {
            "logo_path": "/sNhxHhbyJ0xo52nr9xI2cJKkWFO.png",
            "name": "Miramax Films",
            "id": 14,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Tabasco films",
            "id": 6647,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Instituto Mexicano de Cinematografía (IMCINE)",
            "id": 8861,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "TeleMadrid",
            "id": 10015,
            "origin_country": ""
         }
      ],
      "release_date": "1993-01-01",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Cuba",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": [
         "Tomás Gutiérrez Alea",
         "Juan Carlos Tabío"
      ],
      "runtime": 108,
      "synopsis": null,
      "writers": [
         "Tomás Gutiérrez Alea",
         "Senel Paz"
      ],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt0106966/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM5MTQ2NDU4OV5BMl5BanBnXkFtZTcwOTk0NDA1NA@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Jorge Perugorría, Vladimir Cruz, Mirta Ibarra | See full cast and crew »"],
      "reviews": [
         "The comment from the viewer in Norway who had to be forced to watch this lovely film is in dire need of just more than learning to speak Spanish. This film is not about two gay men, as one character is gay, the other is straight. It is a movie about how two people who seem to be very different are really very similar. Both love their country and they learn that love of man (or of woman) and of country can be expressed differently and still be valued and respected. It is a wonderful, charming, endearing and thoroughly well acted movie. It is extremely realistic and gives and shows a snapshot of Cuba we are not able to see or partake of. I thoroughly enjoyed this movie. It is funny, well acted and well written and directed. The two male leads are superior as is the female character. I have seen this movie many times and never tire of it. I most highly recommend it. It is not a gay film, so don't think of it that way or you will be very disappointed.",
         "STRAWBERRY AND CHOCOLATE (Fresa y Chocolate) Aspect ratio: 1.85:1 Sound format: Ultra-Stereo Used as an unwitting pawn by his pro-revolutionary colleagues, a naive student (Vladmir Cruz) is encouraged to develop a platonic relationship with a flamboyant gay artist (Jorge Perugorria), whose political allegiances have fallen under suspicion. But as their friendship deepens, Cruz is transformed by Perugorria's resistance to the Cuban regime, even as the forces of oppression begin to close around them. Based on a short story ('El Lobo, el Bosque y el Hombre Nuevo') by screenwriter Senel Paz, STRAWBERRY AND CHOCOLATE is a joyous celebration of life and non-conformity, distinguished by Perugorria's vivid performance as a self-proclaimed 'outsider' who rejects his friend's unquestioning loyalty to the Cuban political system that is stifling their beloved homeland. Their budding relationship is complicated by Perugorria's unrequited love for Cruz, depicted here with dignity and compassion, though it's their political differences which ultimately unite the two characters, even as Perugorria is forced to reap the whirlwind of his public defiance. Also starring Mirta Ibarra as Perugorria's flaky neighbor, who introduces virginal Cruz to the joys of sexual liberation! It isn't a terribly cinematic film, but production values are solid, and the characters are played with such integrity, it hardly matters; this is a movie in which ideas take precedence over action, and the emotional payoff is quite powerful indeed. Beautiful music score by Jose Maria Vitier, too. Directed by Tomás Gutiérrez Alea and Juan Carlos Tabío. NB. The original US version (released by Miramax) is missing approximately six minutes of footage. Absent material includes a brief conversation about racism during Cruz's first visit to Perugorria's apartment, and a sad little sequence in which the two characters pretend not to notice each other after meeting by accident in a bookstore. (Spanish dialogue)",
         "`Strawberry and Chocolate' (1993)is set in contemporary Havana. The luster of that city has dimmed after nearly four decades of Castro's rule. David (Vladimir Cruz), a student and avid Castro supporter, is on the rebound after losing his girlfriend. He had taken her to a cheap hotel to make love, but the place is so shabby it puts her off. Instead, he promises never to touch her until they marry. In the next scene, she marries someone else while David stands sullenly among the well wishers at the registry office. Then he meets Diego (Jorge Perugorría). Diego, who is flamboyantly gay, parks himself at David's table in an outdoor café to eat a dish of strawberry ice cream. For David, this is suspicious because chocolate is also available. Diego says some people like chocolate, some like strawberry, an innocuous line that gives the movie its title and also hints at the odd couple relationship to follow. Diego does not disguise his sexual interest in David, but is also interested in giving David an education the regime denies him. The older man is far more cultured than his new friend. Offers of books banned in Castro's Cuba, such as a novel by Mario Vargas Llosa or the poems of John Donne, lure David to his apartment for tea and talk. When David reports that Diego is involved with a forbidden art exhibit, he is directed to befriend Diego to find out more information. `Strawberry and Chocolate' thus sets their emerging friendship against the backdrop of two bleak themes: anti-gay prejudice in the Castro regime, and the betray-thy-neighbor expectation of a police state. But almost nobody conforms to type. A woman in Diego's building who is part of the neighborhood Vigilance Committee, on the watch for counter-revolutionary activities, turns out to be a good friend to Diego and then to David. Everyone plays one game with the government, but a different one in their private lives. This is a lesson David has to learn. Encounters with women along the way provide a few subplots, but the heart of the story lies in the hearts of the two men. `Strawberry and Chocolate' is credited to directors Tomás Gutiérrez Alea and Juan Carlos Tabío. The former was, until his death shortly after completing this film, the best known filmmaker in Cuba, winning an international reputation in the 1960's for titles such as `Memoirs of Underdevelopment,' a look at life in Cuba in the early Castro years that tempers criticism with prudence. `Strawberry' is smaller in scale and less overtly political. The film was nominated for an Oscar in 1995 and won awards at film festivals around the world (including the Sundance Festival). American viewers may instantly slot it with Hollywood features that show how straight characters learn life lessons from a wiser gay companion (`Boys on the Side,' `As Good As It Gets'). And at times Diego's excesses recall the worst performances of Harvey Fierstein. Yet superb performances by the two male leads eventually move beyond stereotypes they \u0096 and the audience \u0096 initially share about each other, transforming their unexpected friendship into a statement that puts the lie to official groupthink in a repressive regime.",
         "A beautiful movie for the heart. One of the most wonderful stories of friendship ever told. Jorge Perugorría as Diego is amazing. (I'd well like to see some of his other work.) It is most astonishing to see how his character develops from the limp-wristed cliché gay at the beginning to a fascinating man who gets in conflict with the regime because he is different on every level from what the system requires him to be: he is an independent spirit, a person with a genuine love for the arts, for literature, for music, he is disappointed by communist ideals - and he is also gay, by the way. Vladimir Cruz is also very fine as the young and naive David who discovers things through his friendship with Diego he'd never ever thought of: like discovering the beauty of things, of life, of poetry and music... And also being committed to another person, even though this person may seem very 'different' from oneself at first glance. The development of David's and Diego's friendship is fascinating (I wouldn't interpret anything more into it, not even in the final scene). This is also a \"coming of age\" tale, in a way: by his friendship with Diego, David begins to think, develops a maturity of spirit - and is also, at last, able to develop a loving and mature relationship with a woman. It is very sweet when he tells Diego: \"No-one will hurt her. She is with me.\" A true gem of a film. I recommend it to everyone.",
         "This movie is about accepting difference and learning to appreciate other points of view and other ways of life. It's not really a movie about gay men - get over that! It's about friendship, and about the love Cubans feel for their country. Jorge Perugorría is absolutely great in this role, as are all of the other characters. The scenes of Havana are beautiful and heartbreaking. This film conveys what it must feel like for Cubans to leave their country, and how difficult that is. It's also about learning to think for yourself and to have opinions and do things that others might not find \"politically correct.\" There's nothing subversive about this movie, and nothing that you need to hide from the kids. In fact, I recommend that people show the film to their teenagers and talk about it, because it sends such a great message about accepting people as they are. It's also tender and funny, and has just the right balance of humor and drama. Nancy (Mirta Ibarra) is wonderful.",
         "Any perceptive viewer of this film will recognize quickly what it does and does not represent. We can be easily misled by previews or trailers promising stereotypical characters or cheap thrills, designed only to attract attention. They can be a turn-off as well. In this case I was fortunate enough to get past the marketing and into what turned out to be a truly well-made and fascinating film of extraordinary literary dimensions. First, it is a profoundly anti-fascist and anti-totalitarian tale. Internal references to famous Cuban writers and musicians frame every scene, while the players entertain us with character sketches involving such mundane things as romantic urges, kitsch as art, and ice cream. The action is fast-paced. One bit resolves itself into another with ease. Musical scoring and editing are appropriate in every way -- always a hallmark of any good film. But it is great acting and great directing that put this one over the top into Oscar league contention. A true \"must-see.\"",
         "Strawberry and Chocolate -- Wow this was a wonderful surprise and one of the better movies I've seen of late. Set in 90's Havana, this is a very real, believable story of a young homophobes first friendship with a gay man. I found the movie touching and funny and it reminded so much of many men I knew during my years in El Paso. Diego, played wonderfully by Cuban actor Jorge Perugorria, is very attractive and yet easily the queeniest guy I've seen on film in years. I really enjoyed how comfortable he seemed in the role paying in between the male and female gender roles. This man has a passion for life that he expresses while being outside the mainstream. He does an excellent job of pulling off the crush in a believable way. He has a horrible crush on David, a young Communist party member who is lured to Diego's apartment with the promise of some photos of Diego took of him while David was acting. No pictures materialized and the two develop a solid, respectful, platonic relationship. This movie shows that gay and straight men can be friends. It also reminded me of many good times I had by making friends with people I normally wouldn't associate with. Queens are usually not my type...but then again, its a reminder to judge people by the content of their character rather than superficial appearances. The film also explores Cuban's acceptance of Communism and the country's desire to remain outside the influence of American commercialism. I was very interested to see where Diego's anti-government rhetoric would get him and if the movie would have a moralistic 'gotcha' message at the end. In reading about this movie it's pleasing to know that the director is a well-known and respected Cuban director (thus making it a bit easier to trust the movie) and the movie was well received in Cuba. Word is it helped to remove the stigma attached to homosexuality in Cuba. I heartily recommend this film in a way I so rarely do. Easily in the same class as Priscilla for humanity and believability. This one is absolutely worth whatever it takes to find it. Rating: 9 out of 10.",
         "Fresa y chocolate I liked to watch Fresa y Chocolate; this is first Cuban movie I've seen. Fresa y Chocolate is a product of two directors, Tomás Gutiérrez Alea and Juan Carlos Tabío in 1993. Fresa y Chocolate was nominated in 1995 the best foreign film. During the production of this film the director Alea had cancer and for this reason Tabío had to help him to complete the movie. Later 1996 Alea die. This movie expresses the oppression of Cuban government toward the homosexual and the conflict also the friendship within two different men. Around 1997 in Cuba,Diego (Jorge Perugorria ) the main character is a cultured gay and David (Vldimir Cruz) a young revolutionary college student. He is a naive and dogmatic. The story begins at a cheap hotel room where David and his sweetheart, Vivian tried to have first intimate experience together but ended up angry at each other, later Vivian marries to a much older man who is in the government office position. David, the wedding day feeling low come to an Ice cream shop near by school and over there David and Diego meet. At the begging, it was Diego's attempt to allure David but soon it change and in spite of their sexuality, these two different men establish a true friendship. Most of story take a place at Diego's apartment where full of things (art work, forbidden books, pictures...) for David's eye. It is a new and different world for David, a dogmatic and in a way an ignorant. Diego tells David about his anguish and problem toward the government. For him being homosexual hinder his work in Cuba and also his well being, too. However, David learns much about art and literature from Diego and moreover, he learn how to enjoy and savor life. The message of this movie is tolerance. No matter what is one's sexuality people have genuine heart. They have hope, dreams, and frustration that life brings us. I think this movie is worth to watch because Fresa y Chocolate gave me a chance to give a glance to Cuba, the country that I don't know yet. To me watching a good film lessens a tension of life.",
         "I agree with all the positive things already so well put forth by other reviewers and say that I liked this film a lot. Jorge Perugorria is incredible as the slightly \"queenie\" gay man. I have seen him in other films where is so different, as a very macho truck driver, for instance. Here he is the art and book lover and appreciator of good food and drink, as well as attractive young men. His \"education\" of the stern young Cuban Communist (an excellent Vladimir Cruz), a very straight man with intense emotional animosity toward gays, becomes a study in the resolution of human relationships triumphing over social and political obstacles.The comradely embrace of the two men , symbolizing their understanding and acceptance of each other despite superficial differences, was a masterstroke at the end of this fine film.",
         "This film isn't just an \"odd couple\" story, as it can appear at a first glance. This is a landmark Cuban film about the plight of homosexual artists in Communist Cuba. Being homosexual in Cuba in the 60's and 70's, maybe even the 80's, could mean incarceration or being sent to \"colonies\", often hard labour camps. What makes this film extraordinary is that it was made by a Cuban director who had been himself part of the Communist intelligenzia at the beginning, but could still be objective and therefore critical of the intolerance of real socialism. What also makes the film extraordinary is that the film itself was a box office success in Cuba and helped change attitudes towards homosexuality. Tomás Gutiérrez Alea, or Titón, as he was known in Cuba, is the greatest and best loved Cuban filmmaker, with a trademark black humour, best exemplified in his outstanding films Memorias del subdesarrollo (Memories of Underdevelopment) (1968) and La Muerte de un burócrata (Death of a Bureaucrat) (1966). His last film, Guantanamera (1994), which he made when ill with cancer, is a black comedy of \"funeral\" errors and criticism of Cuban bureaucracy. This is his legacy, the way he wanted his public to remember him, laughing at death."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Instituto Cubano del Arte e Industrias Cinematográficos (ICAIC)",
         "Instituto Mexicano de Cinematografía (IMCINE)",
         "TeleMadrid"
      ],
      "summaries": [
         "Diego, a cultivated, homosexual and skeptical young man, falls in love with a young heterosexual communist full of prejudices and doctrinal ideas. First come rejection and suspicion, but also fascination. Fresa y chocolate is a coming-of-age story, told through the development of a great friendship which overcomes incomprehension and intolerance.",
         "Diego, a cultivated, apolitical, sceptical young artist living in Havana initiates a friendship with fiercely communist homophobe David with the intention of seducing him. David, knowing this, allows the relationship to build so he can spy on a person he sees as aberrant and dangerous to the communist cause. Despite their conflicting sexualities and political ideologies the two slowly build a relationship out of their differences, proving that camaraderie and friendship can overcome the most divisive superficialities.",
         "This Oscar nominated film is the story of two men who are opposites, one gay, the other straight, one a fierce communist, the other a fierce individualist, one suspicious, the other accepting, and how they come to love each other."
      ],
      "budget": 0
   },
   "movielensId": 321,
   "movielens": {
      "languages": ["Español"],
      "releaseDate": "1993-01-01",
      "dvdReleaseDate": "2004-01-13",
      "directors": [
         "Tomás Gutiérrez Alea",
         "Juan Carlos Tabío"
      ],
      "runtime": 108,
      "movieId": 321,
      "title": "Strawberry and Chocolate",
      "mpaa": "",
      "actors": [
         "Jorge Perugorría",
         "Vladimir Cruz",
         "Mirta Ibarra",
         "Francisco Gattorno",
         "Joel Angelino",
         "Marilyn Solaya",
         "Andrés Cortina",
         "Antonio Carmona",
         "Ricardo Ávila",
         "María Elena del Toro",
         "Zolanda Oña",
         "Diana Iris del Puerto"
      ],
      "imdbMovieId": "0106966",
      "originalTitle": "Fresa y chocolate",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["neQX3mpG1j8"],
      "plotSummary": "Havana, Cuba, 1979. Flamboyantly gay artist Diego (Jorge Perugorría) attempts to seduce the straight and strait-laced David, an idealistic young communist, and fails dismally. But David conspires to become friends with Diego so he can monitor the artist's subversive life for the state. As Diego and David discuss politics, individuality and personal expression in Castro's Cuba, a genuine friendship develops between the two. But can it last? Strawberry and Chocolate became an instant hit when it was released, and has become a classic of Cuban cinema due to its charming and authentic exploration of a connection between two people under historical circumstances that seem levelled against them.",
      "tmdbMovieId": 12527,
      "avgRating": 3.76195,
      "releaseYear": "1993",
      "numRatings": 962,
      "posterPath": "/7NdKNNrONwbmCOJgTO4wYjWzQyW.jpg"
   }
}