{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "junkie",
         "id": 2375
      }],
      "imdb_id": "tt0066856",
      "video": false,
      "title": "Born to Win",
      "recommendations": [
         138595,
         113128,
         141822,
         184322,
         82667,
         95083,
         30489,
         150677,
         46260,
         163008,
         26484,
         54498,
         81720,
         48889,
         144676,
         194817,
         150839,
         128174,
         197788,
         212759
      ],
      "backdrop_path": "/Ar0PSIPPCEigjCMhhlSCnULpNqE.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "J(JJ)",
               "gender": 2,
               "credit_id": "52fe4412c3a368484e00db71",
               "name": "George Segal",
               "profile_path": "/oUUcGtlQYC0HMI3yMmO713kDdGT.jpg",
               "id": 18364,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Veronica",
               "gender": 1,
               "credit_id": "54a08f45925141312900be0d",
               "name": "Paula Prentiss",
               "profile_path": "/7KD1T9a3o14saRUFQZuf9Koe4hC.jpg",
               "id": 33644,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Parm",
               "gender": 1,
               "credit_id": "52fe4412c3a368484e00db75",
               "name": "Karen Black",
               "profile_path": "/xKtsATh6T64NJfE1io1AnofnFRi.jpg",
               "id": 8963,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Billy Dynamite",
               "gender": 0,
               "credit_id": "54a08f60c3a3680b27009d2b",
               "name": "Jay Fletcher",
               "profile_path": null,
               "id": 1405572,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Vivian",
               "gender": 2,
               "credit_id": "54a08f6f925141236b002510",
               "name": "Héctor Elizondo",
               "profile_path": "/48UNfVFZVr0jyMIlLPhzm8IIM7f.jpg",
               "id": 1210,
               "order": 4
            },
            {
               "cast_id": 1,
               "character": "Danny",
               "gender": 2,
               "credit_id": "52fe4412c3a368484e00db6d",
               "name": "Robert De Niro",
               "profile_path": "/lvTSwUcvJRLAJ2FB5qFaukel516.jpg",
               "id": 380,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Detective",
               "gender": 0,
               "credit_id": "54a08f87925141312300b5b8",
               "name": "Ed Madsen",
               "profile_path": null,
               "id": 1405573,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Marlene",
               "gender": 1,
               "credit_id": "54a08f94925141312900be16",
               "name": "Marcia Jean Kurtz",
               "profile_path": "/lzmW0hnVyyRUkU0tjtFvlfViG9K.jpg",
               "id": 14548,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4412c3a368484e00db7b",
               "name": "Ivan Passer",
               "profile_path": "/tcLsYMdE0asiEy738nWoLuEizG2.jpg",
               "id": 84736,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4412c3a368484e00db81",
               "name": "Ivan Passer",
               "profile_path": "/tcLsYMdE0asiEy738nWoLuEizG2.jpg",
               "id": 84736,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4412c3a368484e00db87",
               "name": "David Scott Milton",
               "profile_path": null,
               "id": 201454,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "54a08fd8925141236b00251a",
               "name": "Philip Langner",
               "profile_path": null,
               "id": 12141,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "54a08ff0925141312300b5c0",
               "name": "Richard C. Kratina",
               "profile_path": null,
               "id": 56874,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "54a08ffec3a368764f007961",
               "name": "Jack Priestley",
               "profile_path": null,
               "id": 1027513,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "59e13abc92514172b2003212",
               "name": "Jerry Tokofsky",
               "profile_path": null,
               "id": 57753,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "59e13ac492514172c10031cb",
               "name": "William Fischer",
               "profile_path": null,
               "id": 1905228,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "59e13acbc3a3680e01002e4c",
               "name": "Ralph Rosenblum",
               "profile_path": null,
               "id": 6848,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "59e13ad1c3a3680e2a0033ef",
               "name": "Murray P. Stern",
               "profile_path": null,
               "id": 1860434,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "59e13ad992514172b200323b",
               "name": "Albert Wolsky",
               "profile_path": null,
               "id": 8885,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 2.026339,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 21256,
      "vote_count": 7,
      "budget": 0,
      "overview": "The film follows Jay Jay, a former hair dresser who has become a drug addict. He lives his new life by doing deals for Vivian from time to time. One day he meets Parm, a free-spirited girl. The two fall in love. Jay Jay's drug habit grows, and he soon resorts to robbery. On the threat of arrest, he works alongside two dirty policemen by becoming a narc, and reports on his former fellow junkies. Yet, as the movie continues, Jay Jay sinks deeper into turmoil with feelings of self-hatred.",
      "similar": [
         476,
         627,
         4441,
         507,
         180863,
         524,
         641,
         20786,
         9589,
         19384,
         14205,
         3877,
         786,
         376867,
         86829,
         549,
         707,
         253,
         8978,
         10795
      ],
      "original_title": "Born to Win",
      "runtime": 88,
      "poster_path": "/yOnmSnEeLhTRx7Uz1TEs0a4atr4.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Segal-Tokofsky Productions Inc.",
            "id": 42347,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Edward Spector Productions Inc.",
            "id": 42348,
            "origin_country": ""
         }
      ],
      "release_date": "1971-12-01",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ivan Passer"],
      "runtime": 88,
      "synopsis": "The film starts with a thirty-old not-very-good-looking man preparing some joints. Days and nights are touch and go for JJ (George Segal) a petty thief and heroin addict who runs errands and commits robberies to support his habit. He met his girl friend Parm (Karen Black) one night while stealing her car. They have a sexy-kinda conversation and Parm lets him to sleep in her flat. They will stick together through everything JJ gets involved in. While delivering a package of illicit drugs for local drug dealer and pimp Vivian (Hector Elizondo), JJ decides to steal it but is caught by the police. He runs away and hides inside a laundramat dryer machine, but detective Danny (Robert DeNiro) puts the machine to work and waits for him to go out non-chalantly. Finally caught, the police agree to let him go if JJ turns \"narc\" and sets up the Geek in a sting operation with detective Danny (Robert De Niro), something Jay Jay doesn't want to do because he feels it will ensure his death. JJ arranges a meeting between himself and Vivian. Vivian tells him to go to Kennedy airport the following morning at 9 o'clock for a 800-dollar package. Before doing the \"deed\", he goes to sleep with Parm, and she says she loves another man during the fastfood dinner they share, but then she says it's a joke. The next morning, when JJ leaves for the airport, she wants to go with him as she is afraid that something dangerous is going to happen to him. JJ tries to convince her to stay at home, saying that it'll a twenty-year sentence for her if she gets caught. Parm threatens him to shout so much that the neighbours will call for the police, so he has to take her with him. A businessman-dressed man (Vic Ramos) gives JJ a briefcase with the drug in the parking of the airport. Parm and that man eye each other with distrust. The exchange happens at another parking, and when Parm asks whether the maffia is involved, the answer is \"no\". The police appear and they have to run away. Parm is taken by the police, but JJ is left free. The drug dealers hit him until they are convinced hes' telling the truth. The boss dealer tells JJ to undress, and that he'll get his clothes back when he is capable of returning the drugs. They give JJ a fancy and glamurous lady's nightgown and he is imprisoned in one of the rooms of their flat. From there, JJ tries to say something to his neighbrours. The two lady neighbours, a young girl (Jane Elder) and her mother (Diane Molneri), they finally call the police because they think he's a pervert of some kind. When the police arrive, the ensuing shooting gives an opportunity for JJ to escape, dressed in the women's nightgown. He goes to an exclusive executive clothing shop, and he dresses himself up with a pair of trousers and a nice shirt. The shop assistant (Max Brandt) realises that something weird is going on, but JJ asks him what he's gonna do about it and leaves with his new clothes on, with the price tags still on them. He goes to Parm once again. In the snowed freezing beach they are alone, hugging and kissing. He says he wants some payment for his twenty-year spenditure. Parm asks him what he really wants, if money is so important to him. She hummers a tune, a soft ballad. Parm ends up hugging him as if he were a baby. JJ feels the need, his habit kicking back in. He has to go to the diner which is the front for petty drug dealing business. There, in the back yard, JJ wakes his friend Billy (Jay Fletcher) from his drugged sopour. With some difficulty, they find somebody eager to sell them some drugs. They want to share them, so they go to a public restroom. While JJ is preparing his dose, Billy takes his dose first and they immediately make him feel sick. JJ tries to take Billy to hospital but as soon as they reach the lift Billy drops dead. JJ runs away leaving Billy's body in the lift, preventing the lift doors to close. JJ runs like a maniac through the streets until he gets to Parm's flat. JJ and Parm decide to leave New York and on the way they are stopped by the police who arrest Parm for possession of drugs. The police officer in civilian clothes accompanying Danny (Ed Madsen) says that Parm looks like a hooker. They search Parm's car without a warrant. JJ shouts so another police officer punckes him in his belly. She was driving and it was her car, so she is taken in the back seat of the police car. JJ is left alone, without anywhere to go to or lie down. The gossip has spread and nobody wants to sell shit to him. In a seedy bar, JJ has to beg for some drugs. Even Vivian's girlfriend Veronica (Paula Prentiss), feels sorry for him. She still feels some warmth towards him, but the harsh reality of life prevents her from trying to help him in any way. JJ is given some drugs by Geek, but the former feels sure they are bad and that they are designed to kill him. However, he is also so driven by his addiction and the film ends with JJ freezing while sitting in a park bench, tremble half because of the freezing cold and half because of his need for drugs. What will he decide?",
      "writers": [
         "David Scott Milton",
         "Ivan Passer"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0066856/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcwMzA5NzA3Nl5BMl5BanBnXkFtZTcwMDQzMTcyMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: George Segal, Paula Prentiss, Karen Black | See full cast and crew »"],
      "reviews": [
         "One of the great joys of being a movie addict is loving unreasonably. There's probably no rational way to convey my adoration for this 1971 Ivan Passer movie, which was made for nothing back in the day when movies like this actually could get made and released--today, it'd be shot on digital video in someone's basement and never see the light of day. George Segal gives one of the performances of his career as J, a hairdresser turned heroin addict who vamps his way through the day with a torrent of improvised Lenny Bruce hipsterisms. Karen Black is the \"straight,\" broken girl who falls in love with him for no good reason except that he's broken too--I can't think of a more haunting moment in a movie romance than the one where she drops him off in midtown Manhattan to score dope and implores, \"J--remember to come back home.\" The movie fleetly conveys the romance, the soft-edgedness and wombiness of heroin--and then in short order takes you all the way down to the bitterest consequences. And it reminds you of the beauties of hard-knuckle, dirty-formica naturalism--pleasures unavailable to more stylized or more conceptual pictures. Has there ever been an actress as free as Karen Black? The way she lifts up ten fingers, over and over again, to count off the number of men she's slept with; or the strange little hair-bite she does when she oaths her love to Segal on the beach--everything is as fresh and unaffected and right as if it were playing out in your living room right this minute. The locations, the smoky, salty, funereal-blues soundtrack--Ivan Passer can't put a foot wrong in this movie. Why is this guy not being given all the work in the world? And why is this movie not acclaimed a masterpiece in a world where rusty chestnuts by Rafelson and Bogdanovich are still held in high esteem?",
         "It's interesting to see something as grainy and badly lit as this still bubble to the surface once in a while, particularly in this age of independent films produced on multi-million dollar budgets. This one obviously wasn't; from the outset, with its dated music and hokey effects, you can be sure you're in for low-tech. What sets Born to Win apart is its solid writing and steady, well-thought out performances. George Seagal, who, strangely, might be best remembered as a cliche on the old Tonight Show, has his character down cold. Karen Black is winning, and with the two of them in the lead, the rest of the movie skims along well. I found myself ignoring the stiff camera work and the Sly and the Family Stone-styled soundtrack to actually watch actors act, to see them sometimes apparently ad-lib entire sequences and do it with gusto. De Niro is too young for the part in which he's cast, and it shows. He looks like a child and has none of the edge we associate with his later performances. By Taxi Driver he'd toughened up, lost the baby-fat and the boy-next-door haircut. Born to Win should be the movie that argues against Seagal and Black being marginalized in film history as also-rans--Robert Downey Jr. and Ben Stiller would both do well to take a look at this before they try another independent, just to see what people of their caliber were doing 30 years ago with nothing more than a cheap camera, a couple of lights and a boom mic. Well done.",
         "This TOTALLY, except for the cool critics (including Pauline Kael), was written off by a bad check, probably because it was another foreign director (like Milos Forman) cashing in on the real GOLDEN AGE of cinema (for America, for sure). That stuff doesn't matter. George Segal, one of the genius actors of the late 60's and 70's, gives an incredible performance as \"J\" the junkie, AFTER establishing himself as the comic everyman for five years. He's already done King Rat in 1965 and was nominated in 1966 for Who's Afraid of Virginia Woolf?, I won't even list this dude's accomplishments in a VERY timely era and film space and he was very good. Paula Prentiss (AS ALWAYS) is wonderful, Hector Elizondo, Karen Black and a host of New York unknown stage actors will blow you away with this film. They've changed the title. OH, I FORGOT, Robert DeNiro is GREAT in this in a small role (but a good one). Nobody cares about junkies ...and why should they? This film isn't about street fixers; it's about New York City in that time period. It's just a wonderful film. It has everything the other COOL films of the 70's had, except marketing - and it blows away Panic in Needle Park with Pacino and Kitty Wynn (a good film), but the message wasn't LEFT or RIGHT enough, even to the people who appreciated that great era of AMERICAN films and this one (like many) was directed by a FOREIGNER (a great director). I'm just babbling here now; Find this film; I found it on Video and I hope to God it's on DVD by now. It's a smooth trail of NYC hopeful desperation at the bottom of that barrel, but you won't regret the trip. An 8 out of 10. Best performance = George Segal. Find it, if you're interested in great movies of that era that didn't make a million bucks!",
         "I have a great interest in American movies of the 1970s, many of my all time favourites being made during that decade, both within and without Hollywood. Several movies from that period are so well known, and so discussed, especially those of Scorsese and Coppola, that many fine movies are overlooked - 'Hi Mom!', 'Scarecrow', 'The Panic In Needle Park', 'Tracks', 'Fingers',etc.etc. Add 'Born To Win' to that list. Director and co-writer Ivan Passer was a recent Czech immigrant, but he manages to conjure up a very realistic and believable look at the seedy underbelly of NYC. Only 'Midnight Cowboy' and 'The Panic In Needle Park' come close. This isn't the New York of Woody Allen, it's the New York of Lou Reed. Passer displays a lot of talent in this movie, but I know little about his subsequent work apart from his 80s sleeper starring John Heard and Jeff Bridges 'Cutter's Way', which I also highly recommend. George Segal will surprise a lot of people with his performance in 'Born To Win', especially those who only have a one dimensional idea of him from his comedy work. Segal plays JJ, a hairdresser turned junkie hipster, who is, well one has to say it, a born loser. Segal is both funny and cool and sad, and he's just as good in this as Pacino, De Niro or Keitel were in more celebrated roles from this period. De Niro in fact pops up in a small supporting role as a cop, something which is exploited on the DVD cover. He's okay but has a very small role, so fans beware. Hector Elizondo has a much more important part as a drug pusher, and Karen Black, hot off 'Five Easy Pieces', plays JJ's girlfriend, who he meets in a funny scene where he steals her car. Both Elizondo and Black give excellent performances. Also in the supporting cast are Paula Prentiss ('The Parallax View') who plays JJ's junkie wife, and one of the first jobs for character actor Burt Young, who plays a hood. I also liked JJ's pal Billy Dynamite played by Jay Fletcher. If you like gritty and realistic 1970s movies you'll love 'Born To Win', a film which doesn't deserve to languish in such obscurity.",
         "George Segal's career encompasses a large body of work, spanning decades. I've seen only a few of his movies. \"The Hot Rock\" was a great ensemble comedy. \"Terminal Man\", timely and dark, pegs the other end of the spectrum. It's safe to say the 1970s were about challenging the Old Guard. In Hollywood, this meant reinvention and the search for Truth begun anew. From industry insiders all the way down to you and me it's understood \"truth in film\" is synonymous with or defined as risky and unprofitable, something other than standard fare. And though overused, the phrase 'they don't make 'em like that anymore' is applicable here, because \"Born to Win\" was produced for reasons other than profit. Its story is roughly drawn and its characters hunger for a pure, painless resolution that you know will never come by the end of the first scene. George Segal is at the center as J, a heroin addict who spends his time visualizing new plans for his next fix. All other characters within his orbit advance his desparation. There's a very palpable truth in the uncertainty the characters feel. They live, but have no lives. Segal's character has never called a shot in his life, yet he knows from years of experience how it will turn out, with him behind the 8-ball. Karen Black plays the love interest who extends to him the hope of salvation, only to be swept under. Hector Elizondo, Robert De Niro, Paula Prentiss and JJ's main junkie pal Billy (Jay Fletcher) exist to keep the downward spiral swirling. A refreshing and enjoyable film for people who feel a nostalgia for challenging, resonant stories that strike a chord as pure as a tuning fork.",
         "this is a very good movie. it was very cheaply made and at first after i put it in i didn't think i'd like it all too good, but then something hooked me and i ended up enjoying it quite a bit. it's about a junky and although depressing there are some funny parts, ironically funny, and the acting is top notch even though the lighting is horrible and the look of the film isn't exactly top notch either but it doesn't really matter because the pace of the story and the story itself gets the viewer involved. also, warning for any hardcore Robert DeNiro fans. i bought this movie because he was on the cover and it turned out he's only in the movie for about a collected ten minutes, maybe less. he plays a cop, one of two, and is the second banana of the two. Karen Black is the love interest and does a fine job as usual for her, and beside Segal's buddy, a black junkie whose performance is exceptional, especially in the ending, the movie mostly belongs to George. but if you want to see a realistic and enjoyable film that wiles the time away nicely, pick this one up (the DVD is cheap!), just don't expect it to live up to the cover, that is, don't add it to your DeNiro collection till after you watch it. but i think if you like Mean Streets and Taxi Driver and movies of the like, you'll enjoy this one. and also look out for cameos from Jose Perez (Short Eyes) and the great Burt Young (Rocky, Chinatown).",
         "I'm a huge fan of Robert De Niro. I've made an effort to hunt down all of his older films (like Greetings and the awful \"Sam's Song\" a.k.a. \"The Swap\") and have done pretty well so far - I saw \"Born to Win\" at a grocery store for six bucks on DVD and since I'd seen it listed on IMDb as one of his early films (and after making sure it wasn't one of the countless \"other titles\" for \"Sam's Song\") I purchased it. Much to my surprise (well, not really, I kinda suspected as much) the cover was totally deceiving. It features Robert De Niro's face (from another film, mind you), his hand holding a gun. It says, \"ROBERT DE NIRO\" and \"George Segal\" in smaller print underneath his name. The tagline on the DVD is something like, \"A junkie goes against a cop trying to bring down Mr. Big.\" Now, mind you, no one in this film is named Mr. Big, and the junkie (Segal) doesn't \"go against\" the cop. De Niro the Cop is only in TWO scenes (count 'em, two) and has maybe a page's worth of dialogue, if that. The film relies on Segal and he really delivers a fine performance. The entire cast is good - Hector Elizondo and Karen Black in supporting roles, as well as a younger Burt Young (pre-\"Rocky\"). This isn't a great film and it isn't superbly directed. It's a bit hard to watch at times due to a grainy transfer and bad audio. But it's reminiscent of Al Pacino's \"Panic in Needle Park\" so far as it presents a realistic, gritty, depressing vision of junkies operating on the streets, and how miserable your life can become by resorting to drugs (mainly heroin). A good, rewarding picture - but don't be fooled by the title, nor Leonard Maltin's description of it as a \"very funny\" comedy.",
         "... not to direct - Ivan Passer's a master who ought to have steady employment and somehow doesn't. But can someone request Scorsese to get behind a restoration of this fine film? It may have been made on a low budget, but that's no reason why the only way to see it anymore is on disgracefully butchered videotapes that leave the story in fragments and turn the color photography into mush (I doubt it was quite this bad when originally released). I recall from Pauline Kael's review back when it came out that \"Born to Win\" was dumped on the market and hardly got an audience even then. Maybe with a decent restoration, and a nice DVD transfer, it can finally get some justice? And Ivan Passer can finally get some good projects to work on? On the critical note, and having seen both Born to Win and Midnight Cowboy again recently, I can say that Passer's film holds up a hell of a lot better than Schlesinger's rather more pretentious contraption. Less showboaty, but also far less sentimental and way more powerful. And a good job by the whole cast.",
         "'BORN TO WIN' Is a Downbeat, but Somewhat very funny look at drug addicts, in New York, The ever Excellent George Segal, plays JJ a former Hairdresser,Who is fixed on heroin,and with him on his quest for the perfect fix is his pal played by Jay Fletcer, One night on the streets JJ is attempting to steal a car,but is amusingly caught by the owner who is played by the free spirited Karen Black,who brings Segal home together the pair fall for each other despite Segal's, desperate Heroin ridden antics, Cult Favorite Paula Prentiss,(The Original Stepford Wives) plays JJ's former wife who is Highly strung, unfortunately she becomes property of the local pimp and supplier 'geek' played by Hector Elizondo, One scene in this classic that's worth mentioning is Segal's superb knack for physical comedy is the 'take your clothes off' scene, that see's Segal, at the mercy of the supplier's the scene where Segal attempts to get the attention of the teenager across at the adjacent apartment is a hoot! And Segal's subsequent chase clad only in a robe is hilarious! A Very Young Robert De' Niro, plays an undercover cop out to bust JJ, Don't be fooled by the many DVD's available of this classic with 'De Niro on the cover Segal is the Star!",
         "I would have to say this fine piece of drug-oriented cinema is the reason we have film festivals. Simply amazing. I am surprised Vincent Gallo has not stumbled across the idea of remaking \"Born To Win\", it would be his third film, furthermore third film in which the title begins with the letter \"B\". This is a classic picture. An ex-hairdresser gone junkie, walking the streets, doing petty jobs for just one more fix, a man who truly knows the blues, a man who has lost everything, and pulls it off with such style and grace. If Vincent Gallo doesn't do something, then there is a glitch in the system. This film is the reason I started taking movies seriously.. it is the reason I dropped out of school and wanted to be a drug-dealer when I grew up."
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Drama"
      ],
      "productionCompanies": [
         "Edward Spector Productions Inc.",
         "Segal-Tokofsky Productions Inc.",
         "Theater Guild"
      ],
      "summaries": ["A smart-mouthed junkie/loser known as J.J. (George Segal) spends his days looking for just \"one more fix\"."],
      "budget": 0
   },
   "movielensId": 3212,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1971-12-01",
      "dvdReleaseDate": "1999-12-21",
      "directors": ["Ivan Passer"],
      "runtime": 88,
      "movieId": 3212,
      "title": "Born to Win",
      "mpaa": "R",
      "actors": [
         "George Segal",
         "Paula Prentiss",
         "Karen Black",
         "Jay Fletcher",
         "Héctor Elizondo",
         "Robert De Niro",
         "Ed Madsen",
         "Marcia Jean Kurtz"
      ],
      "imdbMovieId": "0066856",
      "originalTitle": "Born to Win",
      "genres": [
         "Comedy",
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The film follows Jay Jay, a former hair dresser who has become a drug addict. He lives his new life by doing deals for Vivian from time to time. One day he meets Parm, a free-spirited girl. The two fall in love. Jay Jay's drug habit grows, and he soon resorts to robbery. On the threat of arrest, he works alongside two dirty policemen by becoming a narc, and reports on his former fellow junkies. Yet, as the movie continues, Jay Jay sinks deeper into turmoil with feelings of self-hatred.",
      "tmdbMovieId": 21256,
      "avgRating": 2.82609,
      "releaseYear": "1971",
      "numRatings": 23,
      "posterPath": "/yOnmSnEeLhTRx7Uz1TEs0a4atr4.jpg"
   }
}