{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "bicycle",
            "id": 3797
         },
         {
            "name": "sport",
            "id": 6075
         },
         {
            "name": "cycling",
            "id": 180491
         },
         {
            "name": "bicycle race",
            "id": 186360
         }
      ],
      "imdb_id": "tt0088707",
      "video": false,
      "title": "American Flyers",
      "recommendations": [
         34379,
         21332,
         52741,
         16370,
         294261,
         118887,
         46925,
         41971,
         30547,
         30069,
         18495,
         38982,
         41944,
         20053,
         46797,
         88818,
         34322,
         29973,
         10117,
         47045
      ],
      "backdrop_path": "/1zDvDOZSUw1nWLggz4G3VmC3PRm.jpg",
      "revenue": 1400000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Marcus Sommers",
               "gender": 2,
               "credit_id": "52fe45c69251416c75061fc9",
               "name": "Kevin Costner",
               "profile_path": "/ePo87kGyyY8JZ3z7Zm7Z2GYdmJ8.jpg",
               "id": 1269,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "David",
               "gender": 2,
               "credit_id": "52fe45c69251416c75061fcd",
               "name": "David Marshall Grant",
               "profile_path": "/tKe6LIoceX8738rIELToYMuefCH.jpg",
               "id": 24535,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Sarah",
               "gender": 1,
               "credit_id": "52fe45c69251416c75061fd1",
               "name": "Rae Dawn Chong",
               "profile_path": "/6mk5lSTIUav9T1M0VAdUP46FTSH.jpg",
               "id": 13312,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Becky",
               "gender": 1,
               "credit_id": "52fe45c69251416c75061fd5",
               "name": "Alexandra Paul",
               "profile_path": "/bTE5wVsPxRB5ZWPn8bSo5fE9hGR.jpg",
               "id": 55567,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45c69251416c75061fdb",
               "name": "John Badham",
               "profile_path": "/vWzb3cQz4qYtfXQ6qyCrSTw61xA.jpg",
               "id": 12840,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c69251416c75061fe1",
               "name": "Steve Tesich",
               "profile_path": null,
               "id": 69002,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 2.701784,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 14040,
      "vote_count": 37,
      "budget": 0,
      "overview": "When Dr. Marcus Sommers realizes that he and his troubled, estranged brother David may be prone a fatal brain disease that runs in their family, he decides to make peace with his sibling, and invites him on a trip to the Rockies. There, the brothers bond over their shared enthusiasm for cycling and decide to enter a grueling bike race through the mountains. However, Marcus' health soon begins to fail, and David must compete without his brother at his side.",
      "similar": [
         9655,
         9291,
         22881,
         8923,
         2300,
         10637,
         323677,
         10474,
         9563,
         2323,
         86130,
         13416,
         5925,
         1374,
         612,
         9390,
         8456,
         70,
         73,
         15070
      ],
      "original_title": "American Flyers",
      "runtime": 113,
      "poster_path": "/qf1L3nIyOW49kmxtWKN13VGz0Vv.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "WW Production",
            "id": 8779,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1985-08-16",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "Two brothers challenge the road. And life itself.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Badham"],
      "runtime": 113,
      "synopsis": null,
      "writers": ["Steve Tesich"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0088707/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU4MDU2OTk0MF5BMl5BanBnXkFtZTcwODQ0NzgxMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Kevin Costner, David Marshall Grant, Rae Dawn Chong | See full cast and crew »"],
      "reviews": [
         "This sentimental film which one reviewer terms a \"cult classic for cyclists...\" is disappointing. Yes, as a former cyclist who was racing at a time long before cycling was popular, it does have some scenes that bring back memories of the adrenaline rush of riding in the pack (I was usually well at the rear) and the long hours of training. The scene where they have to sprint past a pit bull is memorable too, but most cyclists can outsprint dogs. However, when you compare this film to the 1979 Breaking Away, it doesn't stand up. Frankly, I found the theme of an athlete with a potential life-threatening condition to be a bit over-wrought and excessive sentimental. David Marshall Grant has his day in the sun alongside Costner and gives less than a memorable performance. Rae Dawn Chong is, as always, charming but the rest of the cast fades away. This is not a bad film and is one that could have been outstanding, with a bit of work. It's too bad that Hollywood too often makes films based on sport stories which avail little about the sport itself. Indeed, their portrayal of the sport winds up being what they (Hollywood marketeers) think main stream America thinks the sport looks like. This film was made before cycling was brought into the public eye by such outstanding American athletes as Davis Phinney, Greg LeMond and Lance Armstrong. My impression that the reviewer who chose to deem this film a \"cult classic for cyclists\" did so because there wasn't much else out there to fill that bill.",
         "American Flyers should not be passed over by non-athletes just because bike racing is a central part of the movie. Sure, its a must-see for all cyclists due to the great racing sequences and thrilling ending(great movie to watch when you're cycling indoors!), but it's also a moving story of two brothers. Theirs is a complex relationship which never borders on sappiness. It may not be perfect, but American Flyers delivers great action and acting and a moving story of the inseparable bonds between brothers and their mother. Don't pass up the chance to see this forgotten gem",
         "It might be sad to sit back nowadays and reflect on the decline of Kevin Costner's career, but back in the '80s and even the early '90s he was a personable leading man whose films were generally enjoyable. Take this sporting drama from John (WarGames) Badham, for instance. American Flyers is an enjoyable cycling drama from the pen of Steve Teisch, in which the gruelling hardships of professional cycle-racing is combined with a story about two brothers rediscovering each other. There's also a key plot point about a hereditary disease which may or may not affect one of the brothers. The story is never hugely engrossing, but it serves its purpose insofar that it gets the audience interested in the relationship between the two siblings, and provides a fairly exciting climax in which one of them has the chance to win a gruelling race. Lazy David Sommers (David Marshall Grant) lives in St. Louis and spends his days watching kung fu movies, dating girls, and riding his bike. His brother Marcus (Kevin Costner) is a more successful and motivated type, who works in a high-tech gym as a sports physician. The brothers lost their father to a hereditary illness, and Marcus is quite worried that David may have the same problem. Marcus persuades David to come into the gym and undergo some medical and physical tests. The results seem OK, and a relieved Marcus invites David to join him in competing in a gruelling bike race in the Rocky Mountains, aptly named \"Hell Of The West\". The guys are joined by their respective girlfriends, in Marcus's case Sarah (Rae Dawn Chong) and in David's case Becky (Alexandra Paul). After a road trip to the Rockies, during which they bond quite closely, the Sommers brothers enter the cycle race. They're up against the likes of fiercely competitive Muzzin (Luca Bercovici) and Russian powerhouse Belov (John Garber). Then, halfway through the race, Marcus is unexpectedly struck by a haemorrhage \u0096 it turns out that he, not David as originally feared, is the one who has inherited the illness that killed their father\u0085. Costner gives a perfectly likable performance in this movie, but it is actually Grant who has both the stronger role and the more interesting character. It seems very strange indeed that Grant never became a big name, and spent the rest of his career as a supporting player in largely forgotten films. On this evidence, he has the looks, the personality and the acting ability to have been more successful. The story moves at a decent pace, the first third dealing with the medical tests carried out on David, the second third showing their road trip to the big event, and the final third dealing with the race itself. The last section of the film is probably the best, with a genuinely absorbing race sequence that undeniably ends on a predictable note, but manages some real excitement along the way. The cycling footage seems quite well done too (I'm a non-cyclist, but it looks convincing to me). All in all, American Flyers is an enjoyable sports drama about a sport rarely touched upon in the movies. It's no classic, but it passes the time very pleasantly indeed.",
         "As a few other reviews have stated, this is a different kind of costner. An earlier, less-famous costner. He was very good in this, i didn't see the end coming either. The fact that there isn't many well known faces in this film is what makes it so watchable, because you have no pre-conceived biases due to not knowing any of the actors. You just concentrate on the storyline & what they're doing, instead of thinking about all the other stuff they've been in. The music was brilliant as well. Some f*cking breathtaking cinematography on the mountain race scenes. A simple film, executed well and with a satisfying ending. Also took me a while to realise his teacher was the guard from \"lock up\" & the owner off McDowells restaurant from \" Coming To America\" LOL.",
         "I finally got to see this movie again after years. I remember it from childhood, a favorite of my mother. This movie is a wonderful example of the Human Spirit despite adversity. David's brother Marcus visits home for the first time in years. Their father died of a brain aneurysm and Marcus was outraged at his mothers behavior during the time. David a bit more sympathetic to his mother knowing she just couldn't deal with it. It's on this visit that Mrs. Sommers expresses concerns that she thinks David has the same disease. Marcus takes David back to Madison, WI where he lives and works, to run some tests on him. Despite Marcus and David being on decent terms you can see a clashing of heads when it comes to certain issues, mostly from lack of understanding of one another. Marcus pushes David to try harder out of love, of course David doesn't see it as such. We find out that David is actually free of the disease that killed his father, however, an overheard conversation between Marcus and a friend at the testing center leads David to believe that he's a time bomb waiting to go off. He decides he can deal with death, and takes up Marcus' offer to do the \"Hell of the West\" cycling race with him in Colorado. Along the way David finds love, a courage and strength within himself he didn't know was there, and new understanding for his brother. It's the crashing news that Marcus is actually the one who's ill, and the disease begins kicking in during the cycling race that finally pushes David into being all he can be. A bit sad and intense at times it's still a terrific and inspiring movie to watch. It also gives a new outlook on the world of Bicycle racing that most people will never know or see first hand. I give it a 9/10.",
         "Knockout photography and a winning performance from Costner stand out in this well made film about a school dropout who rivals his doctor brother in Rockies bicycle race.",
         "Not a frequently shown film, but a highly recommended one. A good chance to see Kevin Costner early in his career; you see the spark that made him into one of Hollywood's most prominent actors. Also an early chance to see an odd type of performance from Jennifer Grey, before \"Dirty Dancing.\" You don't have to be a cycling fan to enjoy this poignant movie.",
         "\"American Flyers\" stars Kevin Costner and David Marshall Grant as Marcus and David, two brothers who share a passion for cycling. It attempts to be both a drama and one of those inspirational sports movies that have been done to death. Right from the start, \"American Flyers\" is weak in its storytelling. There was some sort of family fallout regarding the death of the brothers' father. Marcus blames his mom for something or other and hasn't spoken to her or his little brother in a year and a half. The reasoning is never made very clear. Anyway, Marcus calls and lets his mom and brother know that he is coming for a visit. He shows up late for dinner and then announces he is already going home the very next morning. All the while, he is quite mean to his mom. Nice guy. It's made all the worse by not allowing us to get to know the mom at all. She is one dimensional and hardly has any dialogue. The \"story\" has two main topics. The father died of a cerebral aneurysm and the viewer is left wondering if one or both of the brothers is going to suffer the same fate. The film is also about a bicycle race. I would go more into detail but you can guess what is going to happen right from the start. There is no suspense whatsoever. Throw in what amounts to a McDonald's commercial part way through the movie and you have a real dud. Rae Dawn Chong and Alexandra Paul also star as the brothers' girlfriends. Both give decent performances but it's all for nothing. Writer Steve Tesich was trying to repeat the success he had with his other bicycling movie \"Breaking Away\". He had obviously run out of original ideas and this film pretty much ended his career in Hollywood. 2/10",
         "I thought maybe a movie about cyclists might be different, and entertaining, as many Kevin Costner movies are, but I didn't find much to like in this film. Constantly bickering brothers complaining about each other's past family sins, grew tiresome fast. I wanted to ground their \"fliers\" before they ever got airborne. I didn't much of the cast nor their characters and the story was basically somewhat boring and very much clichéd with the illness angle. In the end, this was a lot more of \"chick flick\" than a sports film. The only redeeming quality was the wonderful Colorado mountainous scenery. Speaking of 'redeeming,\" thankfully Costner redeemed himself, sports story-wise, with the classic \"Field Of Dreams\" a few years after this. This bike movie was like a flat tire: a pain in the butt to put up with.",
         "Plot When David Sommers (David Marshall Grant) is not struggling as a college student, he is an avid cyclist who routinely goes on long bike runs. Recently his father died of a brain aneurysm and his mother fears that David has inherited the same condition as her husband. One night David's brother, Marcus (Kevin Costner), comes over for a visit. Marcus is a seasoned cyclist who has competed in several big races. He is also a practicing doctor with a steady girlfriend named Sarah (Rae Dawn Chong). After a series of tests are performed by Marcus, David gets a clean bill of health, but when David overhears Marcus talking he believes he really is going to die. Little does David know that the one who is endangered of dying of a brain aneurysm is his brother Marcus. Marcus had intended to keep this piece of information a secret because he didn't want anything to stand in the way of the big race he had planned to enter with his younger brother. Only Sara and a trusted friend know he may die any day now. Soon Marcus, David and Sara are off to train on the way to Colorado. Along the way the trio finds their way to a fast food restaurant where David meets Becky (Alexandra Paul) awaiting her hamburger order. She agrees to join him on his journey and become a part of Team Sommers. Character Development Because events are moving so quickly there most likely wouldn't be time for character development, yet some characters are noticeable changed to a degree. It is a little more than a crack of light, but it is there. One character that comes along is the mother, yet this character only has a bit part so the overall effect is marginal at best. David becomes a little more worldly and Marcus seems more grounded and at peace with himself. They are all layers of degrees. Acting The acting was fairly solid with the lend actors and the surrounding cast, though there was one scene I found cringe-worthy every time I see it. Even though it is during an emotional moment I thought it was completely over the top. Thankfully the scene was short and there were no more scenes that display this similar type of awkwardness. The only other time where events reached near this point was at a dinner party that got out of hand, but I can forgive this because in comparison this was a slight imperfection. I think the lesson to be learned here is that oftentimes less is more because over acting is drawing too much attention to one performer and not letting the writing and the other actors pull their own weight. Overview This is an enjoyable film that I have seen a number of times. It has some nice shots early on during the opening and some outstanding ones during the big race. The producers really went all out with quite a few of them. I wouldn't be surprise to hear that riders were injured during the course of filming. Needless to say the \"Hell of the West\", the race the staring leads entered onto definitely looked dangerous, living up to the hype that the movie was trying to sell the viewer on and then some."
      ],
      "genres": [
         "Drama",
         "Sport"
      ],
      "productionCompanies": ["WW Production"],
      "summaries": ["Sports physician Marcus persuades his unstable brother David to come with him and train for a bicycle race across the Rocky Mountains. He doesn't tell him that he has a brain aneurysm which could render him paralyzed or dead at any given moment. While David powerfully heads for the victory, Marcus has to realize that the contest is now beyond his capabilities. / Features great views of the Rockies and an insight in the tactics of bicycle races."],
      "budget": 0
   },
   "movielensId": 3214,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1985-08-16",
      "dvdReleaseDate": "1999-12-21",
      "directors": ["John Badham"],
      "runtime": 113,
      "movieId": 3214,
      "title": "American Flyers",
      "mpaa": "PG-13",
      "actors": [
         "Kevin Costner",
         "David Marshall Grant",
         "Rae Dawn Chong",
         "Alexandra Paul"
      ],
      "imdbMovieId": "0088707",
      "originalTitle": "American Flyers",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["QxNWzbM7BjA"],
      "plotSummary": "When Dr. Marcus Sommers realizes that he and his troubled, estranged brother David may be prone a fatal brain disease that runs in their family, he decides to make peace with his sibling, and invites him on a trip to the Rockies. There, the brothers bond over their shared enthusiasm for cycling and decide to enter a grueling bike race through the mountains. However, Marcus' health soon begins to fail, and David must compete without his brother at his side.",
      "tmdbMovieId": 14040,
      "avgRating": 3.3406,
      "releaseYear": "1985",
      "numRatings": 436,
      "posterPath": "/qf1L3nIyOW49kmxtWKN13VGz0Vv.jpg"
   }
}