{
   "tmdb": {
      "original_language": "es",
      "keywords": [
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "vampire",
            "id": 3133
         },
         {
            "name": "seduction",
            "id": 3182
         },
         {
            "name": "bloodthirstiness",
            "id": 3302
         },
         {
            "name": "sexploitation",
            "id": 10053
         }
      ],
      "imdb_id": "tt0066380",
      "video": false,
      "title": "Vampyros Lesbos",
      "recommendations": [
         82576,
         83096,
         37994,
         39342,
         102699,
         44333,
         80739,
         148168,
         156316,
         214952,
         53408,
         151545,
         29860,
         42610,
         85535,
         180879,
         85747,
         127142,
         46175,
         76804
      ],
      "backdrop_path": "/8hyM38UVc1YMP0jZ5FTTy8TfkuW.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Countess Nadine Carody",
               "gender": 1,
               "credit_id": "52fe471e9251416c7508e4f5",
               "name": "Soledad Miranda",
               "profile_path": "/ju26Z9fV2W1JLiKyiXkfdqkrHSf.jpg",
               "id": 44409,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Linda Westinghouse",
               "gender": 0,
               "credit_id": "52fe471e9251416c7508e4f1",
               "name": "Ewa Strömberg",
               "profile_path": "/f45R2QLaZ5wf609gn6n0E53vMep.jpg",
               "id": 44423,
               "order": 1
            },
            {
               "cast_id": 19,
               "character": "Dr. Alwin Seward",
               "gender": 2,
               "credit_id": "52fe471e9251416c7508e551",
               "name": "Dennis Price",
               "profile_path": "/k29Y39ZPSERgbBCsD4b22GwwRNW.jpg",
               "id": 30766,
               "order": 2
            },
            {
               "cast_id": 25,
               "character": "Dr. Steiner",
               "gender": 2,
               "credit_id": "52fe471e9251416c7508e569",
               "name": "Paul Müller",
               "profile_path": "/v3tZduw1pzCx6eeoYO6eWkwB0cu.jpg",
               "id": 101549,
               "order": 3
            },
            {
               "cast_id": 20,
               "character": "Agra",
               "gender": 0,
               "credit_id": "52fe471e9251416c7508e555",
               "name": "Heidrun Kussin",
               "profile_path": null,
               "id": 100732,
               "order": 4
            },
            {
               "cast_id": 3,
               "character": "Omar",
               "gender": 0,
               "credit_id": "52fe471e9251416c7508e4f9",
               "name": "Andrés Monales",
               "profile_path": null,
               "id": 81716,
               "order": 5
            },
            {
               "cast_id": 21,
               "character": "Morpho",
               "gender": 0,
               "credit_id": "52fe471e9251416c7508e559",
               "name": "José Martínez Blanco",
               "profile_path": null,
               "id": 97726,
               "order": 6
            },
            {
               "cast_id": 22,
               "character": "Dr. Seward's Assistant",
               "gender": 0,
               "credit_id": "52fe471e9251416c7508e55d",
               "name": "Michael Berling",
               "profile_path": null,
               "id": 100733,
               "order": 7
            },
            {
               "cast_id": 23,
               "character": "Memmet",
               "gender": 2,
               "credit_id": "52fe471e9251416c7508e561",
               "name": "Jesús Franco",
               "profile_path": "/e7HQUKdeaX79ExNIJPrQSsPs4ig.jpg",
               "id": 30956,
               "order": 8
            },
            {
               "cast_id": 24,
               "character": "Dead Woman",
               "gender": 0,
               "credit_id": "52fe471e9251416c7508e565",
               "name": "Beni Cardoso",
               "profile_path": "/7KAXGn6JgB8I2X5cVwxhxx3iE2O.jpg",
               "id": 100321,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe471e9251416c7508e4ff",
               "name": "Jesús Franco",
               "profile_path": "/e7HQUKdeaX79ExNIJPrQSsPs4ig.jpg",
               "id": 30956,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe471e9251416c7508e505",
               "name": "Jesús Franco",
               "profile_path": "/e7HQUKdeaX79ExNIJPrQSsPs4ig.jpg",
               "id": 30956,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe471e9251416c7508e50b",
               "name": "Jesús Franco",
               "profile_path": "/e7HQUKdeaX79ExNIJPrQSsPs4ig.jpg",
               "id": 30956,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe471e9251416c7508e511",
               "name": "Jaime Chávarri",
               "profile_path": "/aagDrbECyEmxhDJsDpU1xtCZRfc.jpg",
               "id": 37613,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe471e9251416c7508e517",
               "name": "Anne Settimó",
               "profile_path": null,
               "id": 100729,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe471e9251416c7508e51d",
               "name": "Artur Brauner",
               "profile_path": null,
               "id": 12737,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe471e9251416c7508e523",
               "name": "Karl Heinz Mannchen",
               "profile_path": null,
               "id": 100320,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe471e9251416c7508e529",
               "name": "Clarissa Ambach",
               "profile_path": null,
               "id": 22626,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe471e9251416c7508e52f",
               "name": "Manuel Merino",
               "profile_path": null,
               "id": 32122,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe471e9251416c7508e535",
               "name": "Sigi Schwab",
               "profile_path": null,
               "id": 100730,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe471e9251416c7508e53b",
               "name": "Manfred Hübler",
               "profile_path": null,
               "id": 100731,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe471e9251416c7508e541",
               "name": "Jesús Franco",
               "profile_path": "/e7HQUKdeaX79ExNIJPrQSsPs4ig.jpg",
               "id": 30956,
               "department": "Crew",
               "job": "Makeup Effects"
            },
            {
               "gender": 0,
               "credit_id": "52fe471e9251416c7508e547",
               "name": "Rudolf Hertzog",
               "profile_path": null,
               "id": 100323,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "52fe471e9251416c7508e54d",
               "name": "Nicole Guettard",
               "profile_path": null,
               "id": 44410,
               "department": "Directing",
               "job": "Script Supervisor"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 3.062627,
      "production_countries": [
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "ES",
            "name": "Spain"
         }
      ],
      "id": 17343,
      "vote_count": 32,
      "budget": 0,
      "overview": "An erotic horror tale about a vixen vampiress seducing and killing women to appease her insatiable thirst for female blood.",
      "similar": [
         22705,
         80752,
         755,
         49017,
         9946,
         2149,
         252171,
         27066,
         979,
         28468,
         1948,
         1813,
         4247,
         4995,
         76492,
         627,
         122081,
         106646,
         263472,
         14174
      ],
      "original_title": "Vampyros Lesbos",
      "runtime": 89,
      "poster_path": "/frLQpIFAJZO9HzfojkVPN3ihfSI.jpg",
      "spoken_languages": [{
         "name": "Deutsch",
         "iso_639_1": "de"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Tele-Cine Film- und Fernsehproduktion",
            "id": 4785,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Fénix Cooperativa Cinematográfica",
            "id": 1354,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "CCC Filmkunst GmbH",
            "id": 1048,
            "origin_country": ""
         }
      ],
      "release_date": "1971-07-15",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "A Psycho-Sexadelic Horror Freakout!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "West Germany",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jesús Franco"],
      "runtime": 89,
      "synopsis": "Linda Westinghouse [Ewa Strömberg], a lawyer with the Istanbul firm of Simpson & Sons, is sent to Anatolia to handle the inheritance of Countess Nadine Carody, recipient of the entire estate of Count Dracula of Hungary. To Linda's surprise, Nadine [Soledad Miranda] is the strange woman who has been haunting her dreams for the past several weeks. Nadine is also a vampire and, after sharing a swim, a glass of wine, and some kisses, Nadine bites Linda's neck and drinks some of her blood. When Linda comes to and goes in search of Nadine, she finds her floating in the swimming pool, apparently dead. The next thing Linda knows, she is being treated at Dr Aldon Seward's clinic, bewildered as to how she got there and amnesic as to her name and address. Dr Seward [Dennis Price] puts a notice in the newspaper, which brings Linda's boyfriend Omar [Andrés Monales] looking for her. Linda remembers Omar but still remembers nothing that went on at Countess Carody's beachhouse. Her only memory is of the Countess lying dead in the swimming pool and then being alone at sea. She wonders if it was all a dream. However, Nadine is not dead. She is languishing on a couch, telling her renfield Morpho [José Martínez Blanco] how she became a vampire (Dracula saved her from being raped and initiated her into the secret of the vampires) and how she now hates men and is so infatuated with Linda that she must make Linda into a vampire, too. Hearing Nadine calling to her, Linda goes. Nadine drinks a bit more of Linda's blood. Later, Linda consults with Dr Seward who tells her that, if she wishes to extract herself from the spell of the vampire, she must either split the vampire's head with an axe or pierce it with a pole. Meanwhile, one of Dr Seward's patients, Agra [Heidrun Kussin], who has been alternately babbling about the Queen of the Night (Nadine) coming to see her and then abandoning her, now suddenly announces that the Queen is going to come to the sanitarium to meet Seward. Nadine shows up at the sanitarium, angry with Seward for trying to take Linda away from her. Seward admits that he only did it to get Nadine to come to him. He wants to become initiated into the world of the vampires. When Nadine refuses and Seward starts shouting Latin at her, Nadine gets Morpho to kill Seward while she pays a visit with Agra in order to tell her that she's going to leave her again. Meanwhile, Linda goes missing. Omar enlists the help of Linda's shrink, Dr Steiner [Paul Muller], in tracking down Nadine in hopes of finding Linda. Actually, Linda is being held by Memmet [Jesus Franco], the bellboy at her hotel. Turns out Memmet was Agra's husband before she became bewitched by Nadine. Memmet has fallen for Linda and wants to kill her, but Linda kills him first and then escapes. Steiner and Omar go to Nadine's house in Istanbul, but she and Morpho have returned to their beachhouse in Anatolia. Linda goes there, too. She finds Nadine lying in bed, dying. Nadine begs Linda for some blood, but Linda doesn't want to be under Nadine's power and stabs her through the eye. Nadine's body disappears. Morpho kills himself. Omar and Steiner arrive on a boat. Omar tries to convince Linda that it was all a dream, but Linda knows better. [Original Synopsis by bj_kuehl.]",
      "writers": [
         "Jaime Chávarri",
         "Jaime Chávarri"
      ],
      "originalLanguage": "German",
      "imdbLink": "http://www.imdb.com/title/tt0066380/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE1MjI1MzMzMF5BMl5BanBnXkFtZTcwMDcwNDMzMQ@@._V1_.jpg",
      "actors": ["Stars: Soledad Miranda, Dennis Price, Paul Muller | See full cast and crew »"],
      "reviews": [
         "I was very curious to see this film after having heard so many things about it! And indeed, \"Vampyros Lesbos\" even exceeded my expectations! Loaded with symbolic language, an almost dream-like atmosphere, unusual camera angles, a fantastic score and some Franco typical lesbian soft sex the Spanish director created an absolute masterpiece of Europe´s early 1970s sleazy cinema. Both main actresses Soledad Miranda and Ewa Strömberg are excellent in the lead and maybe one of the hottest lesbian couples ever brought on the screen. Some people may find it boring, cheap and eventless, but \"Las Vampiras\" is not a film you should watch about story or suspense! It is a brilliant mixture of art and trash, and I was truly surprised what great film it is after having seen so many different works of the director. This gem is a pure trip into surreality: Wonderful! Psychedelic! Watch it and LIVE!",
         "After missing it a couple of times on TV (one of them in the guise of the shorter and 'clothed' Spanish version) and thinking about picking up the DVD in either region on several occasions, I finally managed to sit down and watch (via the now-OOP R1 DVD from Synapse) what is perhaps Jess Franco's best-known film. Not having been particularly bowled over by either of the two Soledad Miranda films I had watched until now \u0096 EUGENIE DE SADE (1970; though this is one I need to watch again) and SHE KILLED IN ECSTASY (1970) \u0096 I was surprised by how much I actually enjoyed VAMPYROS LESBOS. The reasons for this are many and varied and, all in all, I'd say it is without a doubt one of Franco's most enduring \u0096 and impressive \u0096 works. As most of you probably know already, the film is based on nothing less than that vampiric chestnut \u0096 Bram Stoker's 'Dracula' \u0096 which Franco had already filmed a year before and in which VAMPYROS' leading lady, Soledad Miranda, had also appeared! Not having watched that particular adaptation, I cannot say which 'version' is the more successful \u0096 but, in the case of VAMPYROS LESBOS, Franco certainly imbues it with an overwhelming visual style (which goes hand in hand with a bizarre and intoxicating soundtrack) that almost encourages one to overlook its deficiencies which, being a Franco film, it could hardly fail to be without! From the very first shot, the film weaves a haunting and dream-like mood (which is, for the most part, effortlessly sustained throughout) that is as indescribable as it is hard to shake off. Frankly, this is what Franco is all about to me: counting Luis Bunuel as my favorite film-maker, I cannot but admire the ingenuity (coupled sometimes with naivete) with which Franco pulls off this surreal 'trip' of a film \u0096memorable images abound in VAMPYROS LESBOS, many of them allegorical, elliptical, or just plain weird \u0096 that, in its own way, also manages to be a remarkably effective spin on Stoker's 'old' vampire tale. In fact, the film's updating/jettisoning of the 'established' vampire myths (a modern beach-house replacing the old family castle and decked out with fish-nets rather than cobwebs; instead of sunlight having a deadly effect on the vampire, we get to admire her while sunbathing and skinny-dipping \u0096 though the method of disposing of her remains through incredibly violent means) is surely one of its most endearing aspects. Apart from this, not only is the vampire herself (like the nymphomaniac in SINNER [1972] driven through rape towards lesbianism) as much taken with her victim as one expects it to be the other way around, but also we have what passes for the traditional 'vampire hunter' (Dennis Price's Dr. Seward) actively wanting to go to 'the other side' (the confrontation scene between the two, which takes place in the lobby of his clinic, is masterfully handled \u0096 except for one embarrassingly amateurish moment when Price is made to slink down the stairs when he should be running for his life!), whereas the vampire's henchman (named Morpho, no less) is not the expected creepy-looking hulk \u0096 if still a mute \u0096 but rather a lanky thug in a suit, sporting cool shades and a pistol (not to mention being secretly enamored of his Mistress)! And then there's Jess Franco himself, in a quite revealing bit, as a crazed sadist (foreshadowing perhaps his Vogel of EXORCISM [1974])\u0085 Of course, the film would not have worked quite as well without the beguiling presence of Soledad Miranda who dominates every scene she's in, be it the various tantalizing night-club acts (surely among the finest set-pieces in a Franco film, and several of them feature this type of scene \u0096 though we are never told quite why she should be doing them, being a Countess and all!) that we see her perform or the utterly graceful and totally natural manner in which she lures our understandably confused heroine (Ewa Stroemberg) into her particular 'way of life', away from her boyfriend and the routine which governs her 'normal' existence. As has been promised by the title, we get to see a lot of female nudity \u0096 a Franco trademark, if ever there was one \u0096 but since the plot deals with an obsessive relationship (not only Miranda and Stroemberg's but also Heidrun Kussin's Renfield-like 'infatuation' with the former), it does not feel over-emphasized here and, in any case, is really quite tame considering the director's standards of even a few years later. The film's basic plot is wafer-thin ('padded' by numerous repeated actions and images) which, coupled with its necessarily languid pace, induces a sense of drowsiness in the viewer; this, however, is not a detriment to the film at all, as this quality is also to be found in the work of even the major art-house film-makers (I felt entranced in much the same way, for example, while watching Robert Bresson's A MAN ESCAPED [1956] recently \u0096 a film possibly admired by Franco himself, seeing that it's referenced at the start of THE DIABOLICAL DOCTOR Z [1965]). For those of you who are interested, I would like to point you in the direction of an excellent analytical study of the film \u0096 which lies at the heart of a lengthy article about five Jess Franco movies from the 1970s \u0096 written by Maximilian Le Cain that was published in the 'Senses of Cinema' online journal. Here's the relevant link: http://www.sensesofcinema.com/contents/03/27/jess_franco.html Immediately after watching the DVD, to my horror I discovered that both VAMPYROS LESBOS and SHE KILLED IN ECSTASY are to be re-issued next year (by a different company, Image) and that these will most probably use the reportedly superior transfers that were available for Second Sight's impossibly expensive (for my tastes, being blind purchases and all) R2 discs. Well, I'm actually thankful I paid less than $12 (shipping included) for VAMPYROS whereas I managed to acquire ECSTASY in a perfectly acceptable VHS dub. Depending on the extras \u0096 not that Image has shown itself too generous in this department thus far, at least where Franco is concerned \u0096 I may eventually upgrade these two fun Franco flicks featuring the lovely, talented (and ultimately tragic) legend that was Soledad Miranda!",
         "Jesus Franco's 1970 VAMPYROS LESBOS (inexplicably titled above \"El Signo del vampiro\") is the masterpiece of all Euro-exploitation genres. You can swoon over the Greenaway lighting in SUSPIRIA; you can thrill to the comic-book metaphysics of THE BEYOND; a few solitary freaks might smack their chops over CANNIBAL FEROX. But the Big Mama, the 2001 or INTOLERANCE of the litter, is Franco's fever-dreamy Z movie, a dusted-out collage of St. Tropez glamour, poisonous softcore sex, platter-party lounge music gone Satanic, and more crazy zooms than the entire body of martial-arts movies combined. Franco has made more movies than probably any other living filmmaker, and there's something intuitive and inspired in each of them. But in none of his other works did he so perfectly combine what he learned, in his zonked-out way, from his masters (Resnais, Antonioni and especially Welles), and his own lurid, kick-addicted, grade-Z technique. This movie isn't just for B-movie weirdos; hardcore Tarkovsky fiends might find themselves after fifteen minute saying, \"God...I kind of like this...what's happening to me?\"",
         "'Vampyros Lesbos' is one of the high points of 1970s exploitation movies. This movie has something for everybody! Vampires, gratuitous nudity (especially memorable from the stunningly beautiful and ill fated Soledad Miranda), violence, pretentious symbolism, some aesthetically pleasing scenery and camera work, all bound together by one of the most unique genre-busting rock scores ever, chock full of fuzz guitars and electric sitar. The legendary Jess Franco has made more cult movies than the mind can conceive of, but this must surely stand out as one of the most artistically successful of his career. 'Vampyros Lesbos' manages to juggle sex, art, trash and horror, and impresses on every level. A truly wondrous movie! Don't miss this one (uncut, natch) if you get the chance!",
         "This has got to be one of the most surreal films ever made. The film brilliantly combines weird art-house imagery with sexadelic soft-core to create a genuinly original film, full of strange gothic colours and futuristic, freefall visuals. The eerie soundtrack of spacey synths and sexy piano sleeze brilliantly captures Linda's confusion as she enters the world of the mysterious Countess. This film is quite unlike anything else you have seen before.",
         "This eurohorror classic by Jess Franco stars Soledad Miranda as Countess Nadine Carody, a wealthy recluse who strips at a club in Istanbul. Ewa Strömberg plays a woman who is strangely drawn to the Countess. Nadine appears in Linda's dreams, beckoning her. Linda is then sent to the Nadine's island on a business assignment. The film follows the course of the strange romance between Linda and Nadine. Linda falls under Nadine's spell and a living nightmare soon begins. This film mixes dream and reality in a terrific way. Franco appears as Memmet, a sadistic killer. Soledad is absolutely fantastic in this movie. She's very low-key, yet totally captivating all the same. You'll wish you could be possessed by her! Franco's direction involves crazy zoom shots, interspersed footage of insects (with a scorpion that perhaps is meant to mirror the Countess), and a funky pop-art style. The psychedelic music used throughout the movie was written by Manfred Hübler and Siegfried Schwab. Despite its European success, Vampyros Lesbos never received distribution in the United States. It was long considered the Holy Grail of the European lesbian vampire genre. It was a renaissance in interest in Jess Franco, as well as the chart-topping success of the soundtrack in the '90s, that brought the film back into attention. A must-see for anyone into Soledad Miranda, Jess Franco, or vampire movies!",
         "Vampyros Lesbos is actually my first Jes(u)s Franco film. And I was stunned, very surprised. I was like expecting a cheesy European sex-horror film, and o'boy was I wrong, and thanks for that! For Vampyros Lesbos is actually a weird little art-house film, whit a lot of surrealism. And that's maybe why this film has such a bad rating on IMDb, people (like me) thought that it was a horror vampire flick, but get a art-house film instead. For this film probably won't appeal to most hardcore horror fanatics. It's all about soul and atmosphere, like the Hammer films, so if you like them, than Vampyros Lesbos is gold. The stars of Vampyros Lesbos Soledad Miranda and Ewa Strömberg are both great, and plays theirs roles with big credibility. And it's really not hard to see why Soledad became such cult star either, she is phenomenal. I also have to mention the ultra cool soundtrack made by the groovy German duo Manfred Hubler and Sigfried Schwab. Really great soundtrack, one of the music segments in the film were actually used by Tarantino in Jackie Brown. I liked this film, and I will give it a 8 out of 10. I also looking forward to see more from Franco in the nearest future.",
         "Linda Westinghouse(Ewa Stromberg)travels to a small island in Turkey to help Countess Nadine Carody(beautiful Soledad Miranda)complete an inheritance from Dracula's.The Countess turns out to be someone appearing in her dreams.But the Countess is a vampire and seduces Linda and drinks her blood.\"Las Vampiras\"/\"Vampyros Lesbos\" is really a soft-core lesbian take on \"Dracula\".The film is filled with hallucinatory atmosphere and sensuality,so fans of violent exploitation may be disappointed.Jesus Franco plays a creepy hotel worker who likes to take women down into the basement.The soundtrack is pretty groovy-I liked it a lot.Overall,\"Vampyros Lesbos\" is a masterpiece and a must-see for fans of sleazy horror.",
         "it's not only another sleazy sexploitation horror of the 70's. it's much more, with its eerie soundtrack and stunning visuals, edited in the manner that would become a trademark in the 80's and later for such visual masters as kubrick and scott, or maybe lynch rather. the plot may be a bit cheesy, but i think it's not the plot that matters - the main language fraco speaks here is the visual pop-art-esque language (today might be rather regarded as 'post-modern'). and the hypnotic performance by soledad miranda is worth remembering forever as well. it's a franco masterpiece, way ahead of its time. a must see!",
         "In Istanbul, the lawyer of Simpson & Simpson Linda Westinghouse (Ewa Stromberg) has erotic dreams with a strange woman every night and her analyst Dr. Alwin Seward (Denis Price) suggests her to find another lover. Linda is assigned to resolve an inheritance issue with the Hungarian Countess Nadine Oskudar (Soledad Miranda) that has inherited a real estate from Count Dracula. Linda leaves her boyfriend Omar (Victor Feliman) in the Istanbul Hilton and travels to the Kadidados Island. While waiting for transportation in the continent, Linda is advised by a local that the island would be a place of death and insanity and she should not travel to there. However, she does not pay attention to the man and meets Countess Oskudar that is a lesbian vampire fascinated by Linda. The Countess drinks the blood of Linda and she has amnesia and is sent to a mental institution where Dr, Steiner (Paul Muller) who is also a vampire expert, treats her and puts an advertisement in the newspapers. Omar finds Linda and Dr. Steiner teaches her how to kill a vampire. Linda has to be very powerful to resist the spell of Countess Oskudar that has a crush on her and destroy the vampire. \"Vampiros Lesbos\" is an erotic and cult version of Bram Stoker's Dracula by Jesus Franco. The story is very similar to the classic novel of 1897, but instead of Count Dracula, the vampire is a sexy female that was raped by Dracula centuries ago and does not like man. The lead actresses Ewa Stromberg and Soledad Miranda are very beautiful and undress practically in every scene. The film is very entertaining and funny. My vote is six. Title (Brazil): \"Vampiras Lésbicas\" (\"Lesbian Vampires\")"
      ],
      "genres": ["Horror"],
      "productionCompanies": [
         "CCC Telecine",
         "Central Cinema Company Film (CCC)",
         "Fénix Cooperativa Cinematográfica"
      ],
      "summaries": [
         "In Istanbul, the lawyer of Simpson & Simpson Linda Westinghouse has erotic dreams with a strange woman every night and her analyst Dr. Alwin Seward suggests her to find another lover. Linda is assigned to resolve an inheritance issue with the Hungarian Countess Nadine Oskudar that has inherited a real estate from Count Dracula. Linda leaves her boyfriend Omar in the Istanbul Hilton and travels to the Kadidados Island. While waiting for transportation in the continent, Linda is advised by a local that the island would be a place of death and insanity and she should not travel to there. However, she does not pay attention to the man and meets Countess Oskudar that is a lesbian vampire fascinated by Linda. The Countess drinks the blood of Linda and she has amnesia and is sent to a mental institution where Dr, Steiner, who is also a vampire expert, treats her and puts an advertisement in the newspapers. Omar finds Linda and Dr. Steiner teaches her how to kill a vampire. Linda has to be very powerful to resist the spell of Countess Oskudar that has a crush on her and destroy the vampire.",
         "Linda is a young American lawyer, working in a law office in Istanbul. During the night, she has passionate dreams in which a sexy brunette harasses, and makes love to her, from which she's unable to defend herself. A minor case about an inheritance forces her to travel to one of the small islands off the Turkish coast. Then, her nightmares come upon her - in a lively manner.",
         "An erotic horror tale about a vixen vampiress seducing and killing women to appease her insatiable thirst for female blood."
      ],
      "budget": 0
   },
   "movielensId": 3216,
   "movielens": {
      "languages": ["Deutsch"],
      "releaseDate": "1971-07-15",
      "dvdReleaseDate": "1999-12-28",
      "directors": ["Jesús Franco"],
      "runtime": 89,
      "movieId": 3216,
      "title": "Vampyros Lesbos",
      "mpaa": "",
      "actors": [
         "Soledad Miranda",
         "Ewa Strömberg",
         "Dennis Price",
         "Paul Müller",
         "Heidrun Kussin",
         "Andrés Monales",
         "José Martínez Blanco",
         "Michael Berling",
         "Jesús Franco",
         "Beni Cardoso"
      ],
      "imdbMovieId": "0066380",
      "originalTitle": "Vampyros Lesbos",
      "genres": ["Horror"],
      "youtubeTrailerIds": [],
      "plotSummary": "An erotic horror tale about a vixen vampiress seducing and killing women to appease her insatiable thirst for female blood.",
      "tmdbMovieId": 17343,
      "avgRating": 2.91304,
      "releaseYear": "1971",
      "numRatings": 138,
      "posterPath": "/vAYXf7wOKSD6iovPt8tFVDNScsJ.jpg"
   }
}