{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "prison",
            "id": 378
         },
         {
            "name": "sexuality",
            "id": 738
         },
         {
            "name": "drama",
            "id": 8029
         },
         {
            "name": "horror",
            "id": 8087
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "science fiction",
            "id": 10568
         },
         {
            "name": "punishment",
            "id": 10886
         },
         {
            "name": "blood",
            "id": 11221
         },
         {
            "name": "scientist",
            "id": 14760
         }
      ],
      "imdb_id": "tt0102687",
      "video": false,
      "title": "Poison",
      "recommendations": [
         40985,
         68528,
         48691,
         112822,
         48883,
         107426,
         50696,
         73455,
         32934,
         108634,
         42720,
         57251,
         98636,
         29268,
         42502,
         69906,
         223042,
         56653,
         35206,
         48834
      ],
      "backdrop_path": "/pKHgnnWAxTj3QrHZ0zVCNDxfNgx.jpg",
      "revenue": 609524,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Felicia Beacon",
               "gender": 0,
               "credit_id": "52fe473cc3a36847f812a9df",
               "name": "Edith Meeks",
               "profile_path": null,
               "id": 139211,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Millie Sklar",
               "gender": 0,
               "credit_id": "52fe473cc3a36847f812a9e3",
               "name": "Millie White",
               "profile_path": null,
               "id": 139212,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Gregory Lazar",
               "gender": 0,
               "credit_id": "52fe473cc3a36847f812a9e7",
               "name": "Buck Smith",
               "profile_path": null,
               "id": 139213,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Evelyn McAlpert",
               "gender": 0,
               "credit_id": "52fe473cc3a36847f812a9eb",
               "name": "Anne Giotta ",
               "profile_path": null,
               "id": 550672,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Chancho",
               "gender": 2,
               "credit_id": "5654b753c3a368177300043d",
               "name": "John Leguizamo",
               "profile_path": "/rbq24AzthnwRXUYcVfUnP5bKN50.jpg",
               "id": 5723,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe473cc3a36847f812a9cf",
               "name": "Todd Haynes",
               "profile_path": "/wBDazO2j49uoquoHTEDxcniyGGC.jpg",
               "id": 16863,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe473cc3a36847f812a9d5",
               "name": "Todd Haynes",
               "profile_path": "/wBDazO2j49uoquoHTEDxcniyGGC.jpg",
               "id": 16863,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe473cc3a36847f812a9db",
               "name": "Jean Genet",
               "profile_path": "/iiBPxocxFiPZpCsyud7fyeY8mn2.jpg",
               "id": 115467,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "58920f059251412dcd0092fb",
               "name": "Kelly Reichardt",
               "profile_path": "/7pZjIomEh70Dkhr52aKpAqhx3mQ.jpg",
               "id": 56383,
               "department": "Art",
               "job": "Property Master"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 2.378209,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 47620,
      "vote_count": 21,
      "budget": 250000,
      "overview": "Three intercut stories about outsiders, sex and violence. In \"Hero,\" Richie, at age 7, kills his father and flies away. After the event, a documentary in cheesy lurid colors asks what Richie was like and what led up to the shooting. In the black and white \"Horror,\" a scientist isolates the elixir of human sexuality, drinks it, and becomes a festering, contagious murderer; a female colleague who loves him tries to help, to her peril. In \"Homo,\" a prisoner in Fontenal prison is drawn to an inmate whom he knew some years before, at Baton juvenile institute, and whose humiliations he witnessed. This story is told in dim light, except for the bright flashbacks.",
      "similar": [
         9538,
         29425,
         6075,
         769,
         1690,
         185,
         14869,
         112160,
         86331,
         201085,
         11615,
         948,
         339692,
         101299,
         298312,
         452507,
         449176,
         336843,
         10585,
         3600
      ],
      "original_title": "Poison",
      "runtime": 85,
      "poster_path": "/1TlQu3bzXfX0RFQO48pNuZTtkC3.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Poison L.P.",
         "id": 7269,
         "origin_country": ""
      }],
      "release_date": "1991-04-05",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Todd Haynes"],
      "runtime": 85,
      "synopsis": null,
      "writers": [
         "Jean Genet",
         "Todd Haynes"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0102687/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNjY1Njk3MTA4Ml5BMl5BanBnXkFtZTcwMzQ2Mzk2NQ@@._V1_SY317_CR7,0,214,317_AL_.jpg",
      "actors": ["Stars: Edith Meeks, Larry Maxwell, Susan Norman | See full cast and crew »"],
      "reviews": [
         "Filmed in 1990, POISON was an extremely obscure art house film--until Senator Jessie Helms, a hysterical homophobe, threw a public temper tantrum over the fact that it had been financed in part by a grant from the National Endowment for the Arts. Helm's tirade had the effect of piquing public curiosity, and while it never played mainstream cinemas POISON did indeed go on to a wider release on the art house circuit, winning the Grand Jury Prize at the 1991 Sundance Film Festival and receiving an unexpectedly rapid release to the homemarket as well. Thereafter it rapidly returned to the same obscurity from which came. In a general sense, the film is inspired by the writings of Jean Genet (1910-1986), a French author associated with the existentialist movement. A deliberate outsider, Genet spent so much of his youth in and out of prison that he was ultimately threatened with a life sentence as a habitual criminal. In his writings, Genet fused his homosexual, criminal, and prison adventures into a consistent point of view--one that championed freedom of choice (no matter how unattractive the choice), self-determination (no matter how unfortunate the result), and generally gave the finger to any form of authority (no matter how necessary.) POISON specifically references three of his most celebrated works: OUR LADY OF THE FLOWERS, THE MIRACLE OF THE ROSE, and THE THIEF'S JOURNAL, all of which were to some extent autobiographical. At the same time, the film also references a host of other films--so many that it is sometimes difficult to know whether a single reference is deliberate or simply a fluke, an effect that Genet himself would have likely admired. The most obvious of these references is D.W. Griffith's 1916 silent masterpiece INTOLERANCE, for like that film POISON tells three distinctly stories, cross-cutting between them that they might heighten each other. Unlike INTOLERANCE, however, each story is also told in a distinctly different cinematic style, and these too seem to reference various other films. The first of these stories, HOMO, is very specifically drawn from Genet. It tells the story of a constant criminal and homosexual who, while in prison, meets a man whose repeated sexual humiliation he witnessed when both were children in a reformatory. He forces the man, who is unwilling mainly due to fear than from morality, into an emotional relationship and later rapes him. The \"present\" sequences are shot in a murky half-light, the prison presented as a labyrinth of potential sexual destruction. When the prisoner recalls his youthful past, however, the tone changes to a surrealistic and extremely artificial beauty--not unlike that seen in such films as James Bidgood's PINK NARCISSUS and Fassbinder's QUERELLE. It is worth pointing out that these different styles are ironic in use: although shot darkly, the events of the \"present\" sequence are only mildly shocking in comparison with the events of the \"past\" sequence, which is shot in a bright and rather romantic style. HORROR references the 1950s and early 1960s cinematic style of such \"B\" directors as William Castle and Roger Corman, and it frequently borrows cinematic ideas from Rod Sterling's television series THE TWILIGHT ZONE. In this particular tale, a scientist has labored to isolate the essence of the human sex drive--and succeeds only to ingest the element by accident. With human sex drive raging out of control in his body, he develops oozing sores, and his physical contacts with others spread the condition. It is difficult not to read this as a reference to the AIDS epidemic. The third story, HERO, is actually presented very much like a modern television news story and is told through a series of interviews. Here, a young boy has shot his father--and then, according to his mother, leaps from the window sill and simply flies away. Neighbors comment: the boy exposed himself. School teachers comment: the boy was unnatural, the boy was normal, the boy was creative, the boy was a liar. A doctor comments: it is possible the boy had a, er, disease of the genitals. As the story progresses the layers add up--but it leaves us without clearcut answers, much less a clearcut response, and in this last respect it is exactly like the other two stories. It is extremely, extremely difficult to know how to react to POISON. It has moments of remarkable beauty, but these are coupled with moments of equally remarkably off-putting disgust. It is often an erotic film, but the eroticism is tinged and occasionally saturated with revulsion. And in all of this it is remarkably true to its original source: Genet, whose works typically provoke exactly the same sense of beauty, disgust, sensuality, revulsion, and uncertainty of response. I cannot say that I like POISON, which was the directorial debut of Todd Haynes, presently best known for FAR FROM HEAVEN--but then, it is not that sort of film; it does not invite you like it, but rather to consider it both in whole and in part. It strives to be interesting, and in that it is often quite successful. Unfortunately, it may also be a little too interesting for its own good. While it certainly has its visceral moments, occasionally to the gag point, it asks us to solve a puzzle from which pieces are missing. This not a necessarily a bad thing, but in the case of POISON too many pieces have gone astray; it seems deliberately unsolvable. This may actually be intentional, but if so it was a mistake. A sense of mystery is one thing, but mystification is another, and given its overall strangeness--not to mention the subject matter--I think it very, very unlikely that it will ever have more than curiosity appeal outside an art house audience. GFT, Amazon Reviewer",
         "After reading a bit about Todd Haynes' \"Poison\" and the homosexual comparisons that people seem to only be drawing from it, I've come to the conclusion that it doesn't deserve to just be tagged as a seminal film of the \"new queer cinema\". It's so much more than that. First of all, I found \"Homo\" to be the least intriguing of the 3 stories. \"Hero\" is actually more disturbing, showing the sudden disappearance of a mentally-inflicted, patricidal child who, according to his mother, was sent from the angels. I was particularly impressed by Haynes' creative use of layering in the adultery and spanking scenes. But, in blending three prominent aspects (color, black and white, documentary) of the film medium into his film, the beautiful b&w \"Horror\" is the most notable, showing the sudden downfall of a scientist's prosperity. Haynes conveys the scientist's hysteria to his audience by using slanted, extreme close-up camera techniques and spastic editing, not to mention a haunting soundtrack. The film is a bizarre one, indeed... but undeniably artful, and it certainly doesn't deserve to simply be pigeonholed into nothing more than a cornerstone for homosexual cinema.",
         "Despite this film receiving a lot of negative feed back from a lot of its viewers, I think the film is a truly provocative experience. Granted this film is definitely not everyones cup of tea to say the least, but it operates beyond entertainment. It is not there to be liked or disliked, it is there to be analysed and that is where the enjoyment comes into play. The film is constructed of 3 stories; the homo, the horror and the hero. Spread out over three different time periods. If any one is thinking The Hours or 21grams think again, its not. This is a much slower paced film and for want of a better word, 'duller' than the two previously mentioned films. Upon first viewing of the film, it appears that the three characters share no apparent link. However, each story acts as a metaphor for a wider issue, which does connect them all. I wont say what it is, thats your job! Overall poison is a very clever work of art, which belongs to the sub genres of expose and art-house. So if you enjoy those types of films and are interested in queer cinema go watch it! Finally I think Todd Haynes is a genius, a true auteur.",
         "Todd Haynes became well known with his film \"Poison\", which was successful at the Sundance film festival. What I like about \"Poison\" is that is not another stereotypical gay film. It contains three separate stories, all shown out of sequence. So it's like watching three bizarre surrealist films within one movie. One story \"Hero\" is a mockumentary which deals with a young boy and his abusive father. After killing his dad, he mysteriously flies away. Another story deals with a disease like epidemic, which seems to be symbolic of aids. This part is filmed in a style of a campy 50's sci-fi film. The man drinks some sort of potion and is given the disease. A colleague still loves him even though he's infected. Then the last story \"Homo\" deals with two men in prison and their homosexual relationship. These two guys have known each other from their youth and the one has flashbacks of the torment he has faced. \"Poison\" is a unique experimental masterpiece of queer cinema, reminiscent of Derek Jarmon. The film went through much controversy with its NC-17 rating. But really, there's R-rated films which are much worse. \"Poison\" is definitely not a film for everyone, but if your looking for something strange and different you'll probably enjoy it.",
         "Poison, the first theatrical film of Todd Haynes, is a grotesque, pessimistic, and extremely disturbing picture that is both celebration of misery and cruelty and a reflection of human tenderness and sexual freedom. The film interweaves three very different stories together into one narrative line. The film goes back and forth between each story, and each story is completely different from one another in theme, content, style, musical choice, genre, and tone. One story, titled 'Horror', is shot in the style of a 50s B-horror film and is about a scientist who manages to alienate the human sex drive into a vial of fluid. Unfortunately, he accidentally drinks the fluid and mutates into a blistering pile of pus and proceeds to go on an infectious rampage, spreading his disease to all he comes into contact with. Another story, titled 'Homo', is a sinister, gritty, muddy, and emotionally tender love story set in an underground prison of some kind in which two male prisoners slowly descend into an obsessive and violent S&M relationship. The story contains flashbacks to their traumatic youth. The remaining story, titled 'Hero', is shot in what appears to be a documentary format in which several members of a distraught community are interviewed about a recent bizarre tragedy involving a disturbed family. A little boy named Richard shoots his sexually abusive father and then flies out the window, and the entire incident was witnessed by his mother who considers her son to be an angel sent from God to watch over her. Poison is a rather strangely enchanting film. One of the most enchanting things about it is that it never quite gives you any time to breathe. From frame one, the film plunges you into a world full of cruelty and chaotic confusion and you're left on your own to pretty much sort through the images. It's all rather elegantly pulled off. Haynes manages to capture a lot of the charm and the overall structure from each film medium his stories represent. With 'Hero' he manages to present that optimistic 50s family sitcom outlook gone slightly wrong found in David Lynch's Blue Velvet. He does this by using a lot of bright colors and simplistic architecture. The effect is unsettling, but it is also strangely hypnotic in it's own weird way. By using mostly mastershots and by allowing a little more time for talking heads, he's able to create a real creepy sense of foreboding fury that fits really well with the other two stories. With 'Homo', he uses a lot of low angles and close-ups. He also uses more natural lighting, at least in the scenes that aren't flashbacks. It's a much more testosterone driven story, and so the dark look really helps to highlight a lot of the sweatier, more vulnerable aspects of the bodies of these characters. This adds a much more psychological aspect of male sexuality to the film that carries over to the other two stories, making 'Hero' seem ever so slightly more perverted to the average viewer and making 'Horror' seem a lot more metaphorical and realistic in some ways. With 'Horror', we get the bleakest and most disturbing tale of the three. In order to create that classic horror movie feel, Todd Haynes uses a lot more fade-outs, more specific music cues, and noticeably melodramatic narration. He allows us to really feel sorry for this disturbed character, and that feeling of uncleanliness pervades the rest of the film as a result. It seems to me that Haynes wanted to create this film in order to develop an intricate puzzle of how genre pictures can manipulate other genre pictures, the viewing experience of each picture, how watching one sort of theme in one picture can invisibly affect a separate viewing of another picture, and to recreate the style of multiple viewing itself. His personal reasons for making this film, however, seem to be much more complicated. Poison is what I would consider the quintessential gay picture. It has everything I love and hate about most gay themed films (the depressing endings, the perverted camera-work, the abundant strange behavior, the gratuitous sex), but it's self-awareness is so fun to watch that it rises above all the schlock and finds it's own path toward narrative freedom. Above all, Poison is a masterpiece. Along with In a Glass Cage, If...., My Own Private Idaho, Mysterious Skin, and the films of Derek Jarman, it's one of the more challenging gay themed films that you're likely to see. Even if the subject matter disturbs you, there is still so much to digest in terms of imagery and in the wonderful music score. Even if you put aside all that, however, you still have one of the most unusual storytelling structures you will likely see for this kind of film. You can spend the entire film just studying the structure and you will learn so much about scene and theme composition. Even putting aside THAT, however, the ambition of the film is enough to admire. I find that there is way too much going on here that can simply be written off. The things I've noticed upon re-watching this film have chilled me to the bone, and watching it only makes me want to watch it again. It's one of those films that really hit the right notes with me. I will admit that the first time I watched it I couldn't quite comprehend it. It is a dizzying film in that sense, and I don't expect most viewers to digest a lot of the imagery on their first viewing. However, it's a film that I think really says a lot about human progress in terms of sex, imagination, violence, and physical desire. It's a powerful film with a lot of quiet emotion with an ending that left me feeling very polarized. Watching it once is simply not enough. *to read more, go to cuddercityfilmchronicles.blogspot.com*",
         "Make sure that you are not tired when watching this film. Although this film introduces some outstanding performances by some little known actors, the film falls short. One of the three short stories of the film is shot in black and white and is strangely reminiscient of David Lynch's masterpiece \"The Elephant Man.\" When Dr. Graves is ordered out to the fire-escape, I was just waiting for him to shout, \"I'm not an animal; I'm a human being.\" The prisoner story, unlike the black and white story, is full of emotion and intensity. Issues such as homosexuality, abuse, and longing for love are enmeshed in this tale. The third story is shot documentary style. An unseen interviewer questions neighbors, family, and friends about the events leading up to the shooting and death of an abusive father. This movie will intrigue you, confuse you, and bother you. It's worth a watch.",
         "This ambitious art-house paragon is an amalgam of three separate and unrelated delineations, each story being presented in a style distinct from the others. The vignettes at hand are each sliced apart in varying degrees and shuffled together in sequence(an unusual approach which exerts considerable influence at first, but becomes a tad disengaging as the isochronal pace gradually increases in momentum). Story number one is a surreal pseudo-documentary piece concerning a masochistic little boy disappearing into the sky after killing his father. This I found to be the most absorbing story in the film, one which could have easily worked as a stand-alone short subject. The second vignette is a B/W homage to McCarthy-era science fiction cinema, pitting a doctor against a sterile middle-class American community when he is fingered as \"Patient Zero\" in a bizarre contagion. This chapter is nicely done, though the least original of the three. The third segment is a testosterone-fueled homoerotic love tragedy which finds two men with an uncustomary childhood history reuniting within an atavistic penal institution. This is a gripping foray into the womanless world, a hyperbolic mixture of distressing nightmare and celestial daydream which is visually arresting and charged with rough sexual voltage. POISON is certainly going to be labeled a \"difficult\" film by the median casual viewer, and for multifarious reasons. Regardless, it is a laudable effort, and, despite some minor misgivings, a fairly ingenious and well executed experiment. It is notable as well that POISON has become something of a unique historical marker...quite telling of its time, most specifically for its overt AIDS paranoia allegories. 8/10",
         "Todd Haynes is one of those directors whom I've come across with due to his more recent works (FAR FROM HEAVEN) but with whose earlier work I was totally unfamiliar with. If anyone would have told me that POISON was part of his filmography, I wouldn't have known -- that's how obscure this movie is. At a brief 85 minutes, it tells the three separate vignettes, all of them loosely based on the writings of Jean Genet: \"Hero\" presents a mockumentary of a boy who shoots his father and then flies away. Of course, we later learn out why. \"Horror\" ventures into science-fiction territory and has a 1950s feel (down to the cheap-looking make-up, wooden acting, and bad dialogue), in which a scientist extracts a hormone that not only unleashes his sexual desires, but turns him into a monster and thus sets free a mutating virus not unlike AIDS. The third installment is the one which most closely resembles the writing of Genet: \"Homo\" is a gay love story complete with male rituals and lots of repression set in prison and is the only one of the three to feature actual homoerotic content -- but has one very nauseating sequence in which one character's demons come to light in a flashback sequence in a juvenile detention that involves spitting into one of the character's mouth (and John Leguizamo, as excellent as he is as an actor, portrays sheer nastiness as one of the inmates who is enjoying himself a little too much). It is the most disturbing of the three and the one I least connected with, mainly because for obvious reasons it was fetishistic and implausible as well as humiliating. It's the only one of the three to make me feel like an outsider when venturing into gay-themed stories: for some reason I find that this sort of tale, where games of extreme humiliation seem to be rampant in gay erotica. Even so, POISON might be of some interest to those interested in gay-themed cinema, but it should be approached with a caveat for anyone a little sensitive to the degrading behavior that \"Homo\" offers.",
         "Poison is a film by that Velvet Goldmine guy, Todd Haynes. It's made up of three mostly homo-themed shorts that are all sorts of intermingled. One short is the corny 50s sci-fi allegory \"Horror\" wherein a young doctor mixes up a batch of sex-something serum and accidentally drinks it all. He starts looking like crap and then everybody he comes in contact with gets to look like crap, too. 5/10. Next! \"Homo\" is about this guy in prison, John Broom. Broom spots a newbie and recognizes him as a a kid he picked on when he was young. Now, that dorky kid is all growed up and Broom jerks him off. This is the best one to watch while spanking it. It's kind of disturbing, if that sort of thing helps you keep your rod. 7.5/10. \"Hero\" is a twisted little pseudo-doc on this kid who shot his dad to protect his mother from him. Li'l Richie was the tyke's name and he was universally hated by everyone because he just had a way of pissing people off. They fake interview this one kid who was suspended for spanking him and he said Richie \"forced\" him to do it because they were playing a game. Li'l bit f ucked up. 8/10. Did I mention these were all incredibly gay?",
         "The first film I have ever seen that is three different genre's of film in one. Three stories that only abstractly connect in theme are weaved together, one is mockumentary about a boy who shot his father and then flew out of the window, the other is a black and white Roger Cormanesque science fiction horror film about a mad scientist who distills the sex drive and becomes an infectious leperous monster, while the other is about an obsessive abusive sexual relationship between two prison inmantes. The latter plot almost got the film banned after the complaints of religious groups, because it shows an erect penis. If you likewise are afraid or made uncomfortable by explicit sexuality you will be ruffled by this. If not you may find this fascinating, challenging, and provacotive. A one of a kind film, about the awesome and divergent power of human sexuality."
      ],
      "genres": [
         "Drama",
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Bronze Eye Productions",
         "Killer Films",
         "Poison L.P."
      ],
      "summaries": ["Three intercut stories about outsiders, sex and violence. In \"Hero,\" Richie, at age 7, kills his father and flies away. After the event, a documentary in cheesy lurid colors asks what Richie was like and what led up to the shooting. In the black and white \"Horror,\" a scientist isolates the elixir of human sexuality, drinks it, and becomes a festering, contagious murderer; a female colleague who loves him tries to help, to her peril. In \"Homo,\" a prisoner in Fontenal prison is drawn to an inmate whom he knew some years before, at Baton juvenile institute, and whose humiliations he witnessed. This story is told in dim light, except for the bright flashbacks."],
      "budget": 250000
   },
   "movielensId": 3218,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1991-04-05",
      "dvdReleaseDate": "1999-12-28",
      "directors": ["Todd Haynes"],
      "runtime": 85,
      "movieId": 3218,
      "title": "Poison",
      "mpaa": "R",
      "actors": [
         "Edith Meeks",
         "Millie White",
         "Buck Smith",
         "Anne Giotta ",
         "John Leguizamo"
      ],
      "imdbMovieId": "0102687",
      "originalTitle": "Poison",
      "genres": [
         "Drama",
         "Horror",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [
         "akY2RcPYhos",
         "kXrE79sXnkQ"
      ],
      "plotSummary": "Three intercut stories about outsiders, sex and violence. In \"Hero,\" Richie, at age 7, kills his father and flies away. After the event, a documentary in cheesy lurid colors asks what Richie was like and what led up to the shooting. In the black and white \"Horror,\" a scientist isolates the elixir of human sexuality, drinks it, and becomes a festering, contagious murderer; a female colleague who loves him tries to help, to her peril. In \"Homo,\" a prisoner in Fontenal prison is drawn to an inmate whom he knew some years before, at Baton juvenile institute, and whose humiliations he witnessed. This story is told in dim light, except for the bright flashbacks.",
      "tmdbMovieId": 47620,
      "avgRating": 3.16757,
      "releaseYear": "1991",
      "numRatings": 185,
      "posterPath": "/1TlQu3bzXfX0RFQO48pNuZTtkC3.jpg"
   }
}