{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "san francisco",
            "id": 582
         },
         {
            "name": "cheating",
            "id": 1332
         },
         {
            "name": "staircase",
            "id": 1816
         },
         {
            "name": "attempted murder",
            "id": 2013
         },
         {
            "name": "con man",
            "id": 3202
         },
         {
            "name": "ladder",
            "id": 6198
         },
         {
            "name": "psychopath",
            "id": 6259
         },
         {
            "name": "lodger",
            "id": 6623
         },
         {
            "name": "suspense",
            "id": 9937
         },
         {
            "name": "extreme violence",
            "id": 14687
         },
         {
            "name": "home ownership",
            "id": 155724
         },
         {
            "name": "vecino",
            "id": 215306
         }
      ],
      "imdb_id": "tt0100318",
      "video": false,
      "title": "Pacific Heights",
      "recommendations": [
         11060,
         10859,
         14550,
         10905,
         10396,
         19380,
         17494,
         15771,
         2246,
         10551,
         9491,
         9605,
         11092,
         31597,
         1552,
         11002,
         1644,
         9409,
         11896,
         11851
      ],
      "backdrop_path": "/zCl081sPvO997mll5zJD43C97f1.jpg",
      "revenue": 29381956,
      "reviews": [{
         "author": "John Chard",
         "id": "54675761eaeb817286001acc",
         "content": "Pacific Heights – Low Human.\r\n\r\nPacific Heights is directed by John Schlesinger and written by Daniel Pyne. It stars Michael Keaton, Melanie Griffith, Matthew Modine, Laurie Metcalf and Mako. Music is by Hans Zimmer and cinematography by Amir M. Mokri.\r\n\r\nYoung couple Patty and Drake plough all their resources into buying a large house in the affluent Pacific Heights area of San Francisco. With two apartments to rent they think their numbers have come in when they manage to find tenants for both. But one man, the mysterious Carter Hayes (Keaton), soon proves to be anything but the perfect tenant…\r\n\r\nThere are twin terrors at work here, one is the tenant from hell, the other is the laws that protect him as he manipulates the system to its very stupid core. The makers do a very good job of making the film unsettling throughout, the ghastly menace who invades someone’s home and holds all the ace cards is a constant terrifying presence.\r\n\r\nSchlesinger for two thirds of the piece crafts a tightly wound thriller, unfortunately it just gets too daft for its own good as the cat and mousery reaches the culmination of plotting. Keaton is great, expanding upon the dark part of Bruce Wayne portrayal to be scarily smooth and convincing. Griffith is good value as well, and it’s great to see a female character showing great resourcefulness, but both actors are let down by Pyne’s screenplay in the last third where the psycho versus good lady section is too far fetched. Whilst Modine isn’t a good enough actor to pull off the furious husband act.\r\n\r\nA mixed bag, but mostly it beats a good thriller heart to keep it above average. 6.5/10",
         "url": "https://www.themoviedb.org/review/54675761eaeb817286001acc"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Patty Palmer",
               "gender": 1,
               "credit_id": "52fe437ac3a36847f80570cd",
               "name": "Melanie Griffith",
               "profile_path": "/rdRjFsPQDQqPE8JlDQcuT5JDpED.jpg",
               "id": 29369,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Drake Goodman",
               "gender": 2,
               "credit_id": "52fe437ac3a36847f80570d1",
               "name": "Matthew Modine",
               "profile_path": "/tEQG1Us5IuoKYtufZe6waWtxfeg.jpg",
               "id": 8654,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Carter Hayes",
               "gender": 2,
               "credit_id": "52fe437ac3a36847f80570d5",
               "name": "Michael Keaton",
               "profile_path": "/myVdrYNGTgqunLfUSaM8DuVD7DL.jpg",
               "id": 2232,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Toshio Watanabe",
               "gender": 2,
               "credit_id": "52fe437ac3a36847f80570d9",
               "name": "Mako",
               "profile_path": "/gU3eoZP8OQZLFMPZ9MYWa6pajvT.jpg",
               "id": 10134,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Mira Watanabe",
               "gender": 1,
               "credit_id": "52fe437ac3a36847f80570dd",
               "name": "Nobu McCarthy",
               "profile_path": "/h5LOqYVtaPsDQ62GkFnCkjL1ak.jpg",
               "id": 29381,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Stephanie MacDonald",
               "gender": 1,
               "credit_id": "52fe437ac3a36847f80570e1",
               "name": "Laurie Metcalf",
               "profile_path": "/oHhTbuv9eNJV4YlgizhCkZsPV0N.jpg",
               "id": 12133,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Lou Baker",
               "gender": 2,
               "credit_id": "52fe437ac3a36847f80570e5",
               "name": "Carl Lumbly",
               "profile_path": "/u6zmYwEWmCsVjrSsE6e5MUVtGHI.jpg",
               "id": 29382,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Dennis",
               "gender": 2,
               "credit_id": "52fe437ac3a36847f80570e9",
               "name": "Dorian Harewood",
               "profile_path": "/qSHAaRlh8yjTHtYReU0CUWgSFt5.jpg",
               "id": 8656,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Greg",
               "gender": 2,
               "credit_id": "52fe437ac3a36847f80570ed",
               "name": "Luca Bercovici",
               "profile_path": "/6iEWQqsNTarMHLYbM1HPXSYoBk3.jpg",
               "id": 29383,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Florence Peters",
               "gender": 1,
               "credit_id": "52fe437ac3a36847f80570f1",
               "name": "Tippi Hedren",
               "profile_path": "/5piyjLaNRESJZ2Q8comMEjXqZBW.jpg",
               "id": 6929,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Liz Hamilton",
               "gender": 1,
               "credit_id": "52fe437ac3a36847f80570f5",
               "name": "Sheila McCarthy",
               "profile_path": "/dc68JQ2D9mIOxHAgJxjLGv0nJbq.jpg",
               "id": 29384,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Ann Miller",
               "gender": 1,
               "credit_id": "52fe437ac3a36847f80570f9",
               "name": "Beverly D'Angelo",
               "profile_path": "/8fYQIA8dAaA4GOTxOFSKIvTqzi.jpg",
               "id": 821,
               "order": 11
            },
            {
               "cast_id": 21,
               "character": "Warning Cop",
               "gender": 2,
               "credit_id": "52fe437ac3a36847f80570fd",
               "name": "Guy Boyd",
               "profile_path": "/ahvU3lBt1Ydauz8qOyWdz4RGnXa.jpg",
               "id": 19752,
               "order": 12
            },
            {
               "cast_id": 22,
               "character": "Loan Officer",
               "gender": 2,
               "credit_id": "52fe437ac3a36847f8057101",
               "name": "Dan Hedaya",
               "profile_path": "/5E4SUVfLMUKNCiP0dMhyOv3XHVZ.jpg",
               "id": 6486,
               "order": 13
            },
            {
               "cast_id": 23,
               "character": "Realtor",
               "gender": 1,
               "credit_id": "52fe437ac3a36847f8057105",
               "name": "Miriam Margolyes",
               "profile_path": "/7Fijg5sZ7gKbooq6tId3MUS5sDY.jpg",
               "id": 6199,
               "order": 14
            },
            {
               "cast_id": 24,
               "character": "District Attorney",
               "gender": 2,
               "credit_id": "52fe437ac3a36847f8057109",
               "name": "James Staley",
               "profile_path": "/nwMsUCjnJESoSJr946rtnd7Hw5P.jpg",
               "id": 29385,
               "order": 15
            },
            {
               "cast_id": 25,
               "character": "Bank Teller",
               "gender": 1,
               "credit_id": "52fe437ac3a36847f805710d",
               "name": "Takayo Fischer",
               "profile_path": "/gNIFc8rWnFzplkisEonefyxjmG1.jpg",
               "id": 33500,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe437ac3a36847f805709f",
               "name": "John Schlesinger",
               "profile_path": "/vFCJ4RxvHysxeiwcFsiSGg7Tgre.jpg",
               "id": 19304,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe437ac3a36847f80570a5",
               "name": "Daniel Pyne",
               "profile_path": null,
               "id": 29378,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe437ac3a36847f80570ab",
               "name": "Hans Zimmer",
               "profile_path": "/7IjJpvGtCfY0DsritmfCh2iX9I4.jpg",
               "id": 947,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe437ac3a36847f80570b7",
               "name": "Mark Warner",
               "profile_path": null,
               "id": 1732,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe437ac3a36847f80570bd",
               "name": "Steven Ramirez",
               "profile_path": null,
               "id": 29380,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe437ac3a36847f80570c3",
               "name": "Mali Finn",
               "profile_path": null,
               "id": 1262,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "52fe437ac3a36847f80570c9",
               "name": "Neil Spisak",
               "profile_path": null,
               "id": 11411,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "55780c3fc3a3684370001686",
               "name": "Amir Mokri",
               "profile_path": "/g8cqAlhr0o5iRESxrUuS5ahlFpr.jpg",
               "id": 1043831,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Thriller",
         "id": 53
      }],
      "popularity": 7.10558,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 2990,
      "vote_count": 106,
      "budget": 0,
      "overview": "A couple works hard to renovate their dream house and become landlords to pay for it. Unfortunately one of their tenants has plans of his own.",
      "similar": [
         274,
         123109,
         49797,
         2832,
         1949,
         10692,
         984,
         9272,
         1645,
         5486,
         10285,
         1359,
         189,
         402,
         275,
         949,
         336843,
         238636,
         181283,
         158011
      ],
      "original_title": "Pacific Heights",
      "runtime": 102,
      "poster_path": "/dAkfUZz0nuG2M7wPAnYwSENuJNe.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Morgan Creek Entertainment Group",
            "id": 101020,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Morgan Creek Productions",
            "id": 10210,
            "origin_country": ""
         }
      ],
      "release_date": "1990-09-28",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "Where terror lives.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Schlesinger"],
      "runtime": 102,
      "synopsis": "Carter Hayes (Michael Keaton) makes love to a woman (Beverly D'Angelo) in a nice house as 2 men enter and attack him with a bat. He talks about leaving. Drake (Matthew Modine) and girlfriend Patty (Melanie Griffith) are house hunting in San Francisco. They purchase a house with rooms that can be rented, and set about remodelling. Several people look at the units, and Toshio (Mako) and Mira (Nobu McCarthy) Watanabe rent one. Another potential renter, Lou Baker (Carl Lumbly), wants to rent the other, but his application is lost during move-in. Carter arrives and pays for 2 month's rent, but refuses to fill out a credit application. Drake calls Carter's references and speaks to Carter's lover Ann, who asks for the house address. Carter seems shifty, but covers smoothly when questioned. His down payment never arrives, but he's already moved in. Construction work seems to be going on in his unit, and Carter has changed the locks. He also seems to be fixated with phone books. Drake tries to sue for eviction; Drake and Patty are short on money, and tempers flare. Drake witnesses a fight between Carter and his roommate, and realizes Carter has been breeding cockroaches to drive off the other tenants. The courts rule against Drake, and Carter continues to annoy him. Patty has a miscarriage. Carter comes by the next morning, and Drake attacks him. The police, tipped off by Carter prior, arrest Drake. Carter files for a restraining order and begins stalking Patty. Drake tries to see Patty and Carter shoots him and places a tire iron in his hand, faming him for assault. The courts finally evict Carter, but he has stripped the place bare. Patty files a police report with, of all people, Detective Baker, the original rent applicant. Patty discovers Carter's name is James Danforth, and that he is legally severed from his family trust. Patty begins tracking Carter's previous scams, questioning Ann and learning where Carter is. She tails him, watching him scam other people. She sneaks into his hotel room and charges up a huge room service bill. She also tells Drake to cancel his credit cards, as Carter has been using them. Carter is arrested. Patty and Drake start to rebuild their house. Carter sneaks in and attacks Drake. He comes after Patty, and she and Drake fight him, killing him. Months later, Drake and Patty are selling this house - for a profit. ==================================================================== At an upscale Palm Springs resort, a man, Carter Hayes and his lover, Ann, are enjoying an evening of sex. Suddenly, the door bursts open and two men with baseball bats enter and beat him severely. Ann is mildly injured herself. She holds Carter, who talks about leaving. In San Francisco Drake Goodman and his girlfriend Patty Palmer are house hunting in the city's upscale Pacific Heights neighborhood. They find a large, Victorian fixer-upper comprised of three apartments. Patty and Drake look upon the house as an investment and know they can make their mortgage payments by renting out two of the apartments: one is a small studio, the other is a one-bedroom. Patty and Drake fix them up to look more modern, handling almost all the work themselves. Among the first applicants are a pleasant Japanese couple, Toshio and Mira Watanabe, who agree to rent the one-bedroom. Another applicant, Lou Baker, talks about how he and his wife are divorcing and he needs a place to live. He's reluctant to fill out a credit application but Patty insists and Baker finally agrees, saying that he's been nervous because of the trouble with his wife. He returns the application, slipping it under the front door, however it becomes lost when the Watanabe's move in. While screening applicants for the studio, Drake meets Carter Hayes. Hayes is also reluctant to fill out an application for credit & references and also flashes a large amount of money in front of Drake, promising he'll pay for the security deposit and six months rent in advance, however he also says that he's unexpectedly short. Drake agrees, believing that Hayes will wire the money to his bank account but is also firm about Hayes filling out the application. The woman that Hayes was in bed with when he was beaten acts as a reference for Hayes and tells Drake that he was a model tenant when he rented from her. Patty finds Hayes in the apartment one day, asking who he is and seeing that Hayes has brought dozens of out-of-town phone books with him and has stacked them around. Hayes explains that he'd talked to Drake, who'd said weeks prior that he could move in. Patty wonders why Drake wouldn't tell her; Drake tells her that Hayes should not be occupying the apartment because they haven't received his security deposit. Drake becomes increasingly frustrated and angry when the bank tells him the money hasn't arrived. When he tries to talk to Hayes, a strange man, Greg, answers the door and tells Drake that Hayes is out of town. Just then Ann arrives, demanding to speak to Carter. Greg lets her in & the two begin to argue, ignoring Drake. One night Toshio complains to Drake that there is loud pounding and other noise coming from Hayes' apartment. When Drake tries to enter the apartment to investigate, he finds that Hayes has changed the locks. The noise continues. In a fury, Drake illegally turns off the electricity and heat to the unit. Hayes calls the police who, though they understand Drake's plight, order him to turn on the utilities. They also inform Drake that tenant's laws protect Hayes as much as his landlord. Patty and Drake are then forced to hire an exterminator when roaches appear under Toshio and Mira's sink. The expense will be high and the couple are already in debt, creating further tension between them. To evict Hayes, Drake and Patty retain a lawyer, Stephanie MacDonald, who tells them that cases like this are common: a con-artist who knows the laws and the system will act the same way that Hayes has & even try to drive out the owners of the property. The case will take several months and the possibility of getting any money from Hayes is near zero, however, Drake and Patty simply want Hayes gone. Patty also tells Drake that she's pregnant. Another night Hayes makes even more noise in his apartment and Drake enters the crawlspace under the studio and, through an air duct, witnesses an argument between Greg and Hayes, which escalates into a physical fight. A jar falls on the air duct and shatters, spilling large roaches onto Drake's face. Later, in their apartment, Drake surmises correctly that Hayes is somehow breeding roaches in his apartment in an attempt to drive out the Watanabes. Drake also discovers that Hayes has kidnapped the stray cat Drake and Patty took in when they moved into the house. Patty starts to feel ill, having morning sickness. Drake comes home one night to find Patty weak and crying in the bathroom. She has miscarried the pregnancy and ends up hospitalized for a few days. When she returns, Hayes shows up at their door, offering flowers in sympathy for Patty and to make peace between him and Drake. Drake is infuriated and tackles Hayes. The two fall down the stairs and Drake beats Hayes severely. Just then, the police arrive an arrest Drake -- Hayes had phoned the police and reported a physical altercation in the house prior to talking to Patty and Drake. Drake is charged with assault and Hayes obtains a restraining order that keeps Drake from coming within 500 yards of the house. Drake stays with a friend. Patty, spooked when Hayes places a harassing phone call to her, calls Drake at their friend's house. Drake goes to his house immediately and enters in violation of the restraining order. Hayes finds him in the main hallway of the house and shoots him in the arm and shoulder with a pistol. He places a crowbar in Drake's hand, again framing him for assault. With Drake in the hospital, Patty oversees the house and the final eviction of Hayes. A city sheriff has the door opened and Patty finds that the apartment has been completely stripped. Hayes and his partner had everything removed and probably sold. At the police station Patty meets with Baker, the man that had applied first for the studio apartment, who turns out to be an SFPD detective. He says he'll do what he can to retrieve the stolen property but cases like this are hard to solve. He suggests that Patty let it go and consider herself and Drake lucky that Hayes didn't seize the house from them. Among the ruins in the studio, Patty finds a photograph that has a name on it: James Danforth. Patty begins to investigate the name and finds that Hayes had once been a member of an affluent family and the recipient of a private trust, however his family now pays him to stay away from them. Patty tracks Hayes to Palm Springs and finds Ann, who tells Patty she loves Drake but tolerates his games and even partners with him to con others -- the house she currently lives in was awarded to her and Hayes when the landlord tried to evict them by force. She shows Patty a postcard she'd gotten from Hayes with a picture of a Los Angeles hotel on it. Patty goes to LA looking for Hayes at the hotel. She follows him and finds out he's spending a large amount of his time with a rich widow. Patty is able to gain entry to Hayes' room at the hotel and discovers that he has been staying there under the name of Drake Goodman. He has even had identification cards forged with Drake's name and has set up credit accounts and an identical bank account in Drake's name. Patty craftily begins to turn the tide against Hayes by posing as Carter's wife and then charging an huge amount of hotel services to Hayes' room, reporting the fake credit cards and Hayes' traveler's checks as stolen, reporting his stolen Porsche to the police and stealing a large amount of petty cash for herself. She has Drake call the customer service number for the duplicate bank account and cancel it. When Hayes returns to the hotel, the hotel manager tells him that there are problems with his credit. The manager also tells Hayes that his \"wife\" is responsible for the charges to his room. The manager allows Hayes to go to his room to find answers; he and Patty pass in the hallway and Patty narrowly escapes. Hayes is arrested but doesn't stay in jail for long; he convinces the widow he's been sweet-talking to post bail for him. At home, Drake rests upstairs from his hospital stay and Patty performs a few touch-ups on the studio. She uses a pneumatic nail gun to put pieces of plywood over the holes Hayes left in the floor. Hayes returns to the house and beats Drake with a golf-club. Hayes tricks Patty into re-entering the apartment by imitating their cat, locks the door and threatens her with the nail gun. Drake, unable to enter because of the latched door, tries to enter through the hole in the floor. Patty is able to temporarily force Hayes off her and Drake grabs his leg from below the hole, causing Hayes to pitch backwards and fall on the sharpened ends of the piping to the sink he stole. Hayes twitches and dies. Several months later, Patty and Drake sell the house to another yuppie couple. When asked why they want to walk away from such a beautiful home, Patty says \"it was just an investment.\"",
      "writers": ["Daniel Pyne"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0100318/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA5MzcxOTE0MV5BMl5BanBnXkFtZTcwNTU3MTYxMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Melanie Griffith, Matthew Modine, Michael Keaton | See full cast and crew »"],
      "reviews": [
         "Pacific Heights is required viewing in all Apartment Management courses in San Diego County. It is a chilling tale of decent but uneducated and unprepared new owners with a dream unknowingly up against a seasoned player in the professional renter game. This viewing requirement is one of the tools used to introduce starry-eyed management newcomers to the harsh and not-so-easily apparent world of the sick, the dangerous and the sue-happy portion of the rental market who will try to get the management stripped of all their personal assets and possessions, fired and possibly jailed, who work diligently to get the owner's property away from him/her, and who have no objection to going down as long as they can take others with them. Great movie.",
         "Prior to this film,we only saw Michael Keaton in comedic,and good guy roles.In Pacific Heights,he proves to us that he is not afraid to turn on us and be the bad guy.Keaton is excellent as Carter Hayes,the worst kind of no account,as he knows how to stay just out of reach of the law. The character is very similar to that of Max Cady in Cape Fear,though Cady is the far more memorable of the two.Carter Hayes is a nightmarish tenant wreaking havoc on the lives of his helpless landlords,wonderfully played by Melanie Griffith and Matthew Modine.I consider this film to be an overlooked classic that never really got the attention it deserved,perhaps because no one wanted to see Keaton,particularly after his Batman success,as a villain.Those looking for a modern day \"Hitchcock-esque\" thriller will find a winner here.Thumbs up!",
         "I saw this movie again recently, and I have to say that upon reconsideration I think this film is a bit underrated. There are a few deeper sociological issues being explored here that I perceive but are quite subtle in their appearance in the film. It is a study about the law to some degree, and it has some critical things to say about the ability for one who knows the law and its loopholes and thus exploits others with tools that were originally intended to preserve civil society. Keaton plays a psycho, but one who is highly educated and quite adept at his craft of fraud and deceit. Further, Modine's character is irrational, befuddled, and ultimately marginalized. I wonder if the director took some liberties with him (as this is a true story, I don't know everything about the real person he portrays) to bring out a few of his close-minded tendencies that may have contributed to the awful situation in which he finds himself. Obviously, there is the closet racism which keeps him from renting to a black man (this is thrown in the viewer's face later and is quite obvious), but there is also the way he perceives a man's role as the solver of problems and his wife as nothing more than a spectator. That she ends up being the one to calmly and coolly affect a search for and investigate Keaton's character, assaults the traditional notions of a man's role as a protector. Her temperament is ultimately more appropriate for the solution to the problem, and I think it is no accident that the director portrays it in this way.",
         "William Goldman says that the last 15 minutes are the most important of any movie and that's what saves what is otherwise a sometimes fascinating but often dull film in \"Pacific Heights.\" The plot line is fairly interesting but feels rather drawn out through most of the film, until the fantastic ending pulls out all the stops and turns the film into something good. The writing in general is a bit contrived and the dialogue fairly wooden, but it isn't quite enough to destroy the film even early. The acting is very uneven, led by a terrible Melanie Griffith and a middling performance by Matthew Modine in terms of screen time, but certainly controlled by the fantastic performance of Michael Keaton, one of the world's greatest actors. Keaton is especially fantastic in the final sequence, from his charming act with the old woman to his harrowing, venemous final scene there is a complete change in who he is and it is all the more frightening and powerful for the juxtaposition. Schlesinger's direction, besides Keaton's performance, is probably the saving grace of the film. He manages to inject a beautiful dark style to the film that the script rather lacks but seems to want while also keeping us in a blunt reality with the plain, simple outdoor shots. His use of lighting and well-chosen camera angles wonderfully play up the situation. Overall, \"Pacific Heights\" is a middling film with a fantastic performance by Michael Keaton and good direction by John Schlesinger that turns into something better with its fantastic, surprising, venemously satisfying ending. If you watch it, though, don't give up on it 'til it's over.",
         "This is a carefully programmed yuppie nightmare, something to titillate the emotions betwixt the sushi and the creme de mint, something to remind the upwardly mobile that you have to keep your guard up at all times because there are animals out there waiting to take it all away from you. Clever plot premise: Yuppie couple, stylishly unmarried, possibly for tax purposes, buy a painted lady in the Pacific Heights district of San Francisco, a Victorian fixer upper for $750,000. It's the 1980's and everybody is getting rich in California real estate. They are now in yuppie heaven since there are two rentals on the property which take care of $2300 of the $3700 monthly mortgage, which leaves them responsible for only $1400, which is less then they were paying before, and now they have a huge tax write-off and hopefully an appreciating property. Of course they are margined to the gills, but what can go wrong? How about the tenant from hell? Forget about your wild parties and your late-with-the-rent dead beats. This guy (Michael Keaton as a slimy, upper crust psycho genius) doesn't even pay the deposit. He just moves in, squats, and our yuppie couple is helpless to get rid of him since by law he now has possession. He changes the locks, cultivates big ugly oriental cockroaches, and pounds away at all hours of the night, and chases off the other tenant. Seems he has done this before. Seems it is an elaborate scam to gain total possession of the entire property. Next to go are the owners. Naturally the cops and the law seem to work for him, not our adorable couple. (This is a little fictional reality to further excite the passions of the audience, call it poetic license, since we all know that the tenant/landlord laws in California are written by and for the propertied class, as they are anywhere else, as is only right.) But this is a morality play. Could it be that our yuppies are undeserving of their wealth and are easy prey in the econ jungle because of their naiveté? Could be. But as this is a modern morality tale, you can be sure that the woman, played with worrisome lines under her eyes by the ever adorable Melanie Griffith, will turn the tables and kick some male butt despite the handicap of having a not too bright boyfriend, who is easily manipulated by our villain into some rather stupid male behavior that makes things worse for our heroine. Incidentally, he is played with such annoying exactitude by Matthew Modine that I can hear the rednecks in the audience screaming: \"Die yuppie scum!\" It should be noticed that the adversary of the yuppies is not your standard ghetto dweller, but a wayward member of the upper class, a fitting adversary in this yuppie trial by fire. I'll let you guess who wins. (Note: Over 500 of my movie reviews are now available in my book \"Cut to the Chaise Lounge or I Can't Believe I Swallowed the Remote!\" Get it at Amazon!)",
         "This film didn't completely win me over like I was hoping it would, but some solid acting, a good premise, and a few clever scenes made it worthwhile. There was never anything particularly suspenseful about the film, and you pretty much know who will win by the end, but the loathesome Michael Keaton character helped to keep me interested throughout. There were also a few things that especially annoyed me, including the terminally stupid Matthew Modine character, but this movie just has too many positives for me to dwell on the negatives. It's by no means perfect, but it's an effective thriller nonetheless.",
         "Pacific Heights is a great movie is you're in the mood for good suspense. It is the tale of two newlyweds (Melanie Griffith as Patty; Matt Modine as Drake), slightly short on reasonable income, who buy a hefty house in Pacific Heights. Being a larger house than they initially intended to buy, they rent out the floors. One goes to a polite Asian couple. The other, to a wealthy man (Michael Keaton as Carter Hayes) who is in the business of real estate scams. Carter is the worst case scenario of a tenant. Short of murdering the landlords and fellow tenants, he moves in rather quickly and bypasses much of the background checks by telling the impressionable young couple a bunch of lies (actually, it's pretty much Drake's fault for rushing into everything without adequately checking up on Hayes). Then, without every paying up the rent or deposit, he hangs around just long enough to get tenant's rights (or at least a presumption of rights, after which the already tight-budget couple would have to sue to claim misrepresentation and everything) and keep the couple from kicking him out. Gradually, terrorizing them as he had done so many times before. It's all part of his scam. Michael Keaton is terrific as the elusive and obviously strange and brutally eerie Carter Hayes. He is so creepy, I think that's what makes the movie so suspenseful like the scene when he's hanging out in the basement when the power goes out. Or the final revenge sequence in the hotel (perhaps the finale is one of the greatest revenge sequences ever in a movie!). The guy who's made it his purpose to raise as much hell as possible to get what he wants. But, this may well be the last time Carter gets away with it. Patty and Drake seem to fall apart when their tenant not only refuses to leave, but makes trouble for the other tenants (in a pretty gross way). Drake doesn't handle the situation too well. The couple immediately feel helpless when even the law fails to rid them of Carter Hayes. The viewer, too, gets on edge about Carter Hayes. How do you make a guy like this get the f*ck out of your home? (That's one of the great elements of suspense, in a way, we feel like the invasion of Patty and Drake's home is like an invasion of our own. That's just how powerful a character like Carter Hayes is). And Drake's form of vigilante justice isn't the smartest way of handling the situation, using fists of fury rather than intellect, which seems to only exacerbate the couple's problems. In fact, Patty is the one responsible for the fantastic events that create one of the best revenge scenes and really give Carter Hayes his own just deserts. Pacific Heights really is a fantastic thriller. Some might not appreciate Matthew Modine being cast as Drake here. A part like this might've called for someone less dorky, since Drake wasn't really a straggly guy, he was just a guy who wanted to get rid of Carter too fast without really thinking about the smartest way of going about it. However, Melanie Griffith works great in her role as Patty. Nonetheless, it is really good stuff, a thriller that you're sure to enjoy!",
         "\"Pacific Heights\" is based on a true story, about a couple who rent out an apartment to a crazy scam man, played by Michael Keaton in the film, who reak havoc. Needless to say, this is a very basic and very predictable \"thriller,\" if that is what you want to call it, but it's more of a character study, and despite its predictability it IS very watchable. 3/5 stars - John Ulmer",
         "Pacific Heights is unusual among psycho-thrillers because of its completely different approach to psychological terror. Instead of a Freddy Krueger or a Michael Myers we have Michael Keaton as a psychotic tenant who makes life hell for his landlords Melanie Griffith and Matthew Modine. Knowing every legal loophole in the book, his weapons of choice are restraining orders and civil suits, not butcher knives and chainsaws. Driving them to increasingly desperate measures to evict him, Keaton dreams up new and more sadistic methods to torment them. I've always thought Pacific Heights is rather underrated. It's got a mite more intelligence than you'd expect from Hollywood's hijacked psycho-stalker genre. John Schlesinger directs it all with confidence, but then he's an old hand in this area. And Michael Keaton is wonderfully malevolent. His presence makes the entire movie. I've always enjoyed the course the film takes us on. Even if it occasionally gets into some muddy areas along the way, Pacific Heights is compelling to the very end. Modine and Griffith play Drake Goodman and Patty Palmer. A young and naive yuppie couple, they renovate a Victorian house in San Francisco. Truthfully, the house is more than they can afford, but can (barely) make ends meet by renting out two downstairs apartments. One to a nice Japanese couple. And the other to businessman Carter Hayes (Keaton). Hayes moves in without permission, or even a down payment. He locks himself in, not paying any rent. He has a roommate, who hammers away to all hours of the night. He changes the locks. Breeds cockroaches. Drives away the other tenants. And because no money is coming in, Drake and Patty's legal status is becoming all the more shakier. As is they're relationship. Pacific Heights is a film that comes with a certain appeal when looked at closely enough. The idea of a tenant being able to have more power than a landlord is scary stuff. I didn't always believe some of the stunts the film pulls. Unleashing hordes of cockroaches is perhaps going a little too far. Even for a psycho-thriller. Even a tenant who knows how to manipulate the law for his own purposes would have to face culpability sometime. And yet at the same time, Pacific Heights is a constant source of fascination. Hayes leads Drake and Patty through a wonderfully complex legal minefield. Its surprisingly the film's threats of foreclosure and mounting bills that are more effective than its outright sinister approaches. This is a criminally overlooked performance on Michael Keaton's resume. In fact he's always been an actor long overdue recognition. Hot off the success of Batman, Keaton plunges right into the role of Carter Hayes with pure, unadulterated relish. Even though Hayes' motivations are never exactly made clear, its Keaton's performance that sells the character. This is a man with no redeeming qualities whatsoever. He apparently comes from a broken home. Shut out of the family fortune. Disowned. So now he takes a perverse pleasure in destroying the lives of those happier than his. Keaton is a powerful presence. All the more remarkable considering he spends most of the film behind closed doors. Whenever Keaton is around, you sit up and pay attention. But I can't really say the same for Modine and Griffith. Modine is annoying the way he stupidly plays into Hayes' hands time and again. And as for Griffith, she only really comes into her own towards the end. Melanie Griffith once showed signs of being a promising actress in the 80s. Witness her superb performance in Working Girl. But over the years her star has paled, and now she's nothing more than another face in the crowd. But towards the end, we finally see something of the promise she showed in Working Girl. She exacts a little revenge on Hayes by playing him at his own game. She tracks him down to a swanky hotel, has his bank account frozen, and charges hundreds of dollars worth of room service to his credit card. That's the Melanie I remember. But elsewhere, every shred of enjoyment to be had comes courtesy of Keaton. There is something wonderfully poetic to Pacific Heights at times. Not to mention unnerving. Like when Hayes calmly provokes Drake into beating the crap out of him, because the stress of all this causes a pregnant Patty to suffer a miscarriage. And best of all, Drake is legally restrained from entering his own home. Because of Hayes' presence there. The climax is pretty good too. That's the point when Schlesinger (and Keaton) forgets about being courteous, and launches into all out psycho mode. Complete with nail-guns and spikes. Pacific Heights is maddeningly vague at times about where its going to go next. But I think its a worthwhile film, and well worthy of reevaluation. Also look out for a fine turn from the underrated Laurie Metcalf as Drake and Patty's attorney. She lights up the screen just as much as Keaton does.",
         "The key to this movie is the viewer's ability to overlook technicalities and appreciate the story itself. Keaton is superb as sociopathic \"Carter Hayes\". Initially, he is charming and convincing as a well-heeled business guy. He talks his way into Patty and Drake's rental apartment and then takes it over, sans credit check or invitation by a series of lies and mild trickery. Once he's in, he's not getting out either. There are some excellent camera shots, especially one of Griffith (or Modine, can't recall which) in their garage, while the shape of Keaton appears from the shadows behind, staring blankly at the back of the protagonist. The power of the story lies in the long setup of frustration. Griffith and Modine represent the \"everyman\" middle class couple who don't really mean any harm and have a pretty good life together. When their life is more or less ruined by Keaton, completely unprovoked, and they are continually tormented and screwed over by the police and legal system, the viewer gets a blood lust for \"an eye for and eye\" revenge. The subsequent screwjob that Griffith unleashes on Keaton is thoroughly satisfying. SPOILERS There are some weak points in the plot. When Griffith is on her revenge quest, she walks up to the front desk at the hotel where Keaton (who has, by now, assumed the identity of Modine complete with personal documents and social security card) and asks out of the blue if there is a Drake Goodman staying there. The desk attendant readily complies. It seems extremely unlikely that any hotel, particularly one that caters to the obviously rich, would give out information to someone just in off the street. The weak explanation given is that she claims to be returning Keaton's wallet, however it seems like they would want more information and at least check the ID in the wallet. Also during the revenge sequence, Griffith gains access to Keaton's hotel room simply by claiming to be his wife and asking the cleaning woman to let her in. The cleaning woman readily complies, even though she has never seen this woman before in her life. A little later, when Griffith finds documents in Keaton's room that tell her that Keaton somehow obtained all of her's and Modine's personal information and has completely assumed Modine's identity, she throws a major fit screaming and throwing items around the room. The cleaning woman who unlocked the door for her knocks and mildly asks, \"Is everything okay?\" However, if you can overlook things like this, Pacific Heights is a great movie."
      ],
      "genres": [
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": ["Morgan Creek Productions"],
      "summaries": [
         "A yuppie couple buy a large house in an exclusive San Fransisco neighborhood. They renovate it and plan to rent two apartments on the first floor to cover the costs. A prosperous looking man moves in but is not the ideal tenant. He never pays any rent, drives the other tenants away and systematically ruins the lives of his landlords.",
         "A couple works hard to renovate their dream house and become landlords to pay for it. Unfortunately one of their tenants has plans of his own."
      ],
      "budget": 0
   },
   "movielensId": 3219,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1990-09-28",
      "dvdReleaseDate": "1999-12-28",
      "directors": ["John Schlesinger"],
      "runtime": 102,
      "movieId": 3219,
      "title": "Pacific Heights",
      "mpaa": "R",
      "actors": [
         "Melanie Griffith",
         "Matthew Modine",
         "Michael Keaton",
         "Mako",
         "Nobu McCarthy",
         "Laurie Metcalf",
         "Carl Lumbly",
         "Dorian Harewood",
         "Luca Bercovici",
         "Tippi Hedren",
         "Sheila McCarthy",
         "Beverly D'Angelo",
         "Guy Boyd",
         "Dan Hedaya",
         "Miriam Margolyes",
         "James Staley",
         "Takayo Fischer"
      ],
      "imdbMovieId": "0100318",
      "originalTitle": "Pacific Heights",
      "genres": [
         "Crime",
         "Thriller"
      ],
      "youtubeTrailerIds": ["PrVtU25MSqQ"],
      "plotSummary": "A couple works hard to renovate their dream house and become landlords to pay for it. Unfortunately one of their tenants has plans of his own.",
      "tmdbMovieId": 2990,
      "avgRating": 3.22852,
      "releaseYear": "1990",
      "numRatings": 2444,
      "posterPath": "/dAkfUZz0nuG2M7wPAnYwSENuJNe.jpg"
   }
}