{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "independent film",
         "id": 10183
      }],
      "imdb_id": "tt0114594",
      "video": false,
      "title": "Swimming with Sharks",
      "recommendations": [
         15745,
         10729,
         10388,
         11443,
         16148,
         29973,
         10608,
         29193,
         10872,
         10403,
         10279,
         26618,
         38718,
         9430,
         586,
         10410,
         18129,
         16297,
         12395,
         11896
      ],
      "backdrop_path": "/nN3tbgAGHzBFUEaRfDlsRsffhkC.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Buddy Ackerman",
               "gender": 2,
               "credit_id": "52fe43e0c3a368484e00353b",
               "name": "Kevin Spacey",
               "profile_path": "/x7wF050iuCASefLLG75s2uDPFUu.jpg",
               "id": 1979,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Guy",
               "gender": 2,
               "credit_id": "52fe43e0c3a368484e00353f",
               "name": "Frank Whaley",
               "profile_path": "/ma1lgPwUHUlgdt9BIcIbEPjdx0h.jpg",
               "id": 11805,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Dawn Lockard",
               "gender": 1,
               "credit_id": "52fe43e0c3a368484e003543",
               "name": "Michelle Forbes",
               "profile_path": "/6xjsXKZs23a1Vzdw4uSUiV64BFS.jpg",
               "id": 41820,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Rex",
               "gender": 2,
               "credit_id": "52fe43e0c3a368484e003547",
               "name": "Benicio del Toro",
               "profile_path": "/5TlC56RMfTeeBxhI6myQe4SDEEo.jpg",
               "id": 1121,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Foster Kane",
               "gender": 2,
               "credit_id": "52fe43e0c3a368484e003551",
               "name": "T.E. Russell",
               "profile_path": "/hYmP11j1f2Ib0nC7pOWFMX2mPP8.jpg",
               "id": 521717,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Cyrus Miles",
               "gender": 2,
               "credit_id": "52fe43e0c3a368484e003555",
               "name": "Roy Dotrice",
               "profile_path": "/aKcRRZhI3w1auIHsZU66S57YtYG.jpg",
               "id": 4002,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Manny",
               "gender": 2,
               "credit_id": "52fe43e0c3a368484e003559",
               "name": "Matthew Flint",
               "profile_path": null,
               "id": 58491,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Moe",
               "gender": 2,
               "credit_id": "52fe43e0c3a368484e00355d",
               "name": "Patrick Fischler",
               "profile_path": "/x7btvLV8RnW5dw9Of1uYRp86E7V.jpg",
               "id": 52801,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Jack",
               "gender": 2,
               "credit_id": "52fe43e0c3a368484e003561",
               "name": "Jerry Levine",
               "profile_path": "/6pNnyI19jquUa5dziLPZPsQn4WP.jpg",
               "id": 26470,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43e0c3a368484e00354d",
               "name": "George Huang",
               "profile_path": null,
               "id": 57028,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "555440909251416dd6001811",
               "name": "George Huang",
               "profile_path": null,
               "id": 57028,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 6.173862,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 20306,
      "vote_count": 124,
      "budget": 0,
      "overview": "A young, naive Hollywood studio assistant finally turns the tables on his incredibly abusive producer boss.",
      "similar": [
         3134,
         11564,
         281,
         2142,
         22323,
         298312,
         8810,
         948,
         1359,
         4771,
         8923,
         23483,
         101,
         339692,
         241,
         949,
         769,
         793,
         4638,
         395834
      ],
      "original_title": "Swimming with Sharks",
      "runtime": 101,
      "poster_path": "/jqsOhWIGccIJCe8zvHKQuWy5IJL.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Trimark Pictures",
            "id": 4063,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Cineville",
            "id": 2832,
            "origin_country": ""
         }
      ],
      "release_date": "1994-09-10",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "Life is not a movie",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["George Huang"],
      "runtime": 101,
      "synopsis": "Guy, an ambitious would-be screenwriter, works as an assistant to demanding boss Buddy Ackerman. Guy tries to cater to Buddy's ever-more capricious demands until he decides he's been pushed too far in what can best be described as an cynical if canny black comedy.",
      "writers": ["George Huang"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0114594/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYyNzQxMTY5NV5BMl5BanBnXkFtZTcwNjM2MDkyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Kevin Spacey, Frank Whaley, Michelle Forbes | See full cast and crew »"],
      "reviews": [
         "Powerful movie that shows the nastier, more foul-mouthed side of Hollywood. Guy, played by Whaley, is a Hollywood rookie with no real experience but some lofty goals. The movie charts his learning of the ways of Hollywood through becoming an assistant for fastidious big-shot producer Buddy Ackerman (Spacey), and his subsequent unlearning of the 'normal' moral values that apply almost anywhere else. A remarkable performance from Spacey who is by turns searingly offensive, scathingly funny and (funnily enough) vividly human. Making an audience feel for such a revolting character is a feat not many could accomplish, but Spacey's up to the task. Frank Whaley (possibly known to you through a bit part in 'Pulp Fiction') also turns in a very strong performance as the disillusioned young assistant who falls in love (or rather, in bed) with a female producer played by the sultry Michelle Forbes. Spacey and Whaley's interplay in key scenes is riveting, and for the most part, the younger Whaley manages to stay out of Spacey's shadow. The movie's ending is quite unforeseeable, and its message can be construed either as darkly humorous satire against Hollywood, or as a nihilistic comment on the ways of mankind. Judging by the not-so-humorous tone of the movie (though ludicrously enough it was marketed as a comedy), to me it feels like the latter applies. Definitely worth seeing, even if only for Spacey. 8/10",
         "\"Swimming with Sharks\" was made right around the time Kevin Spacey was becoming a rising star - his name was becoming well known enough that he could help finance low budget movies. Along with \"The Usual Suspects\" he helped \"Swimming with Sharks\" get off the ground, and now ten years later (it was given wide release in 1995) it still holds up well as a very, very dark comedy. In fact, comedy isn't the right word. This shouldn't really be classified as comedy. It's not that funny. It works better as a dark satire - I expected something like \"War of the Roses,\" but instead I got a Tarantino version of \"Office Space\" (complete with torture, violence, revenge and mayhem!). Frank Whaley stars as Guy, a typical nobody who dreams of being a somebody. (Even his name confines him to anonymity.) When he lands a job working for world-famous producer Buddy Ackerman (Spacey), his future looks bright...until he realizes what he's in for. Spacey delivers the best performance of the film, yelling, screaming, and throwing hissy fits practically every time he's on screen. But he never pushes the limits. He's always believable as a self-absorbed, ego-maniacal, ruthless producer; the director claims on the DVD commentary track and documentaries that he based the character and many scenes on actual things that happened to him while he worked for unnamed producers in Hollywood. Joel Silver is rumored to have been the basis for Ackerman. The movie isn't great and never really achieves the amount of laughs I wanted but if you view it as a very dark drama-comedy you're more likely to enjoy it. I still found myself quite entertained and taken aback by how daring and unique this movie actually is - no one can condemn it for resorting to clichés. The ending is a punch in the stomach, I never expected it. Whaley is good at playing the over/underwhelmed everyman and the direction is OK (if just so). The best aspects are the witty script and Kevin Spacey's scene-stealing performance; together he has good chemistry with Whaley and the movie succeeds based on the actors' success in their roles.",
         "Swimming with Sharks sees Guy (Frank Whaley) attempt to \"turn the tables\" on his abusive boss Buddy (Kevin Spacey), and while this makes the film simple and unoriginal in terms of plot, it is a cut above the rest thanks to the performances of its small cast. One would assume that we would root for Guy, the innocent graduate demeaned by his aggressive boss, but the way the film tells the story prevents us from empathizing with him (as does his awful haircut); knowing that he tortures Buddy physically for his mental abuse complicates our response, and puts us on Buddy's side, allowing us to enjoy the games Buddy plays with Guy. This is something that's made very easy to do by the acting. Kevin Spacey is typically excellent as Buddy Ackerman and is the most engaging character in the film, remaining funny and manipulative throughout, even while being tortured and held hostage, as well as handling the more serious emotional aspects of his character expertly. Frank Whaley is also brilliant, playing the overwhelmed lapdog who is eventually pushed over the edge by Buddy's abuse. Importantly however, despite his plans for revenge, he remains under Buddy's spell right up until the end, and is eventually broken. The film's conclusion further complicates our responses to both characters. The hostage situation revelations pull the audience between the impassioned-now-heartless Buddy and the desperate and confused Guy, but ultimately good does not prevail, and the shooting and Buddy's manipulation of the situation remove us from both characters as the film ends. All in all, Swimming with Sharks is an enjoyable film. The simple plot and small cast are compensated for by some fine performances; it's funny , well-acted, and definitely worth watching.",
         "This film would be worth watching just for Kevin Spacey's portrayal of the ultimate boss from hell, Buddy Ackerman, but there's also much more than that going on. Ostensibly a damning look at the inner workings of the film business, Swimming with Sharks just as accurately depicts any highly dysfunctional employer/employee/associate relationships, and that's a lot of them. But even more than that, there is a lot of mostly unstated philosophical material underpinning much of the film, some of it literal and some more metaphorical, such as the ending. One of the key lines of dialogue towards this end is Ackerman's, \"If you're not a rebel by 21, you've got no heart, and if you haven't gone establishment by 30, you've got no brain\". Ackerman obviously has problems or he wouldn't be acting quite in the way that he is, but director George Huang and Spacey are also careful to show that Ackerman has a lot more going on than surface behavior--he's acting the way that he is purposefully, both to get his due now as part of the establishment and to coyly manipulate his young, meek and abused underling, Guy (Frank Whaley), along with everyone else he comes into contact with. His aim is to mold Guy in a particular way--a way that works even though Guy thinks that he's severely breaking form in the extended penultimate scene that's intercut with Guy and Ackerman's history. Huang shows professional relationships as consisting mostly of politicking and manipulation. That's true at every level--certainly even Guy is doing this. There is very little authenticity to anyone in their working relationships. That seems pretty accurate to me, unfortunately. It's notable that the one dream of authenticity in the film--Guy talking about moving to Wyoming with Dawn (Michelle Forbes)--is treated and dispensed with as an unreachable fantasy, and it's also notable (and is fairly literally pointed out in the film) that Dawn, the one character who tries to demand being more authentic amidst the \"shark infested waters\" of the professional world, basically never gets anywhere. In the highly metaphorical ending of the film, things remain manipulative, political and backstabbing, and in that climate, at least two out of three characters \"win\". Huang seems to be suggesting that the professional world ain't likely to change any time soon, and that even if you try to change it or manipulate the game itself, you're likely to just get eaten up by it, processed by it and incorporated into it anyway. Again, I can't say I disagree with him.",
         "Kevin Spacey, perhaps the finest actor on the planet, is brilliant as usual in his hilarious turn as Buddy Ackerman, one of the nastiest characters that you'll ever see anywhere on film. Sure, the whole cast is great, but it is Spacey who really shines, and he is the reason that this film works so well. Watch this movie if you want to laugh your head off, or if you simply want to see a legend in the making at the top of his game, yet again.",
         "Today, when kevin spacey has enough recognition and reputation that won't be tampered even if he'll star on \"baywatch\" for the rest of his life - my praises won't mean much. spacey is a superb actor, no doubt about it. but for frank whaley, appearences in the \"right\" films (natural born killers, born in the 4th of july, pulp fiction) as well as a undisputable talent did not turn him to a reknowned actor - which only goes to show that no matter how good you are, in most cases success is a luck depandant variable. On with the movie, the story of an ambitious youngster who wishes to engage in a key role of the film industry and starts to work as an assistant for a completely manipulating, ungreatful, demeaning movie producer george huang (the writer and director) could come up with. the movie begins with guy (frank whaley) kidnapping buddy ackerman in his own house and concurrently whit guy's act of abuse to his hated boss, unfolds the story of a young kid with high hopes who was entangled both in the cynic world of his women loving, hair losing boss and in a relationship with a struggling movie producer - dawn (michelle forbes- now on \"homicide - life on the streets\"). the movie continues up to the point where guy has to decide which of those worlds to choose and now i won't add anything in fear of disclosing the end (and its unpredictable no matter which option you chose) the movie is a complete delight and all i can say is - this may not be the best film you ever seen but it will sure leave enough of an impression to more than justify the two hours of your leisure time. 9 out of 10 in my scale",
         "This film just sums up what it is to be a flunky in Hollywood. Buddy Ackerman is your normal high flying film producer, from the sharp suits down to the aggressive approach to anyone below him. Guy is flunky who has the job of dealing with Buddy's every whim, and then there's Dawn Lockard who is stuck in the middle. With an explosive relationship between all of them, the film is set at the home of Buddy. Guy has taken him hostage, and is annoyed that Buddy has fired him. Set with a series of flashbacks starting with an appearance with Benicio Del Toro, it tells the tale of what Guy has had to put up with in working for Buddy and all the hell he was put through to get to the place that he was before being fired over nothing. Very under-rated film and Spacey is amazing. Also applause to go to Frank Whaley for his great conflicting work with Spacey. A+",
         "From Sunset Boulevard (1950) through to The Player (1992), the dark side of Hollywood has given up juicy material for filmmakers looking to bite the hand that feeds. Not that there is any secret to be revealed here - pretty much everything you need to know about the soulless, spirit-crushing side of movie-making is contained in Raymond Chnadler's 1945 essay \"Writer's in Hollywood\", which contains more horror than any of the celluloid parodies it has since inspired. Swimming with Sharks is the tale of innocent Guy (a freshly scrubbed Frank Whaley), whose monster boss is tinsel town king-maker Buddy Ackerman, a screaming, mood-shifting bully who dangles just enough opportunity before Guy to keep him on his leash. But payback is due, and comes in spades. It is all very dark and delicious, and Spacey gets to rip loose as the psycho boss, the joke being that it is his very lack of sanity and compassion that allows him to thrive in the business. Love interest is supplied by producer Dawn (Michelle Forbes), who allows Guy to stay grounded as he negotiates his way to the top. Dawn and Guy show us that even in Hollywood true love can conquer all - or can it? It is received wisdom that movies about movies don't travel very well. Swimming with Sharks is about delusion and corruption, and how much the human spirit can take. It just happens to be set in Hollywood, but Buddy Ackerman could be Gordon Gecko in a different market. Worth watching to see Spacey enjoying himself in a role where he gets to say pretty much whatever he likes, and does so with relish.",
         "I was so depressed after watching \"The Men Who Stare At Goats\" that I actively sought out Kevin Spacey movies to help redeem my perceptions of him. I saw \"K-Pax\" last week, which was adequately engaging, then found \"Swimming with Sharks\" on the IFC. What a find! This low-cost(less than $1M) film must not have had a very big marketing budget -- it completely escaped me at the time -- but it's one of the best performances Kevin Spacey I've ever seen. An abusive, self-indulgent, arrogant boss in the film industry, his role easily translates into that of a recognizable evil boss in any field. Spacey nicely runs the gamut of expression from god-like to humbled. His once-idealistic assistant is played by Frank Whaley, who never really saw his full potential subsequently develop in his career but has had nice turns in Pulp Fiction and a number of high-production TV series. Whaley too should be commended for his ability to grow the character from a wide-eyed beginning his dream job, to a vengeful warrior out for blood. The film centers on the dysfunctional relationship between these two and is weak only when it attempts to introduce minor roles featuring Michelle Forbes (Maryann on \"True Blood\") and Benecio del Toro (though these actors perform well with what they've been given).",
         "While through the ages, many noteworthy motion pictures detailing the film industry itself have been made, the majority concentrated on a highly positive tone, portraying Hollywood as the organization which \"brought dreams to life\", or similar self serving platitudes. However, in the early 90s, a new trend began to emerge - films which delved below the glossy exterior of Hollywood and began to expose more negative aspects of the industry. One would be hard pressed to find as fitting an example of this Hollywood introspective neo- realism as writer/director George Huang's semi-autobiographical (but hopefully only to an extent...) Swimming With Sharks - a biting, cynical look at the interior of the film industry which challenges the preconceptions of the industry and its bleak aims. Like Robert Altman's The Player, Swimming with Sharks offers a harshly critical commentary on the corporate moneymaking machine that is Hollywood, but from the opposite end: the perspective of a low level assistant striving to rise in the ranks. However, similar to Altman's work, Huang's film dabbles with the notion of being a black comedy or darkly satirical take on the business end of the film industry, but ultimately lacks the acerbic wit needed to succeed on such a front. As such, while the occasional moment of darkly gleeful comedic insight may derived, for the most part, the film falters on attempted darkly ironic comedic moments which come across as too heavy handed to be truly funny. The film's main strength is in its strictly dramatic climax; its harrowing and powerful turn of events toying with notions of all consuming ambition and free will in a truly gripping fashion. Combined with a numbingly unexpected and chilling ending scene, the film's finale is easily its strongest point - enough so to carry the occasional botched comic moment from earlier in the film. However, Tom Heil's understated and affecting single piano score and the occasional moment of intriguing cinematography also add to the overall quality of the work. Kevin Spacey is the main pleasure to behold here as the film's main selling point, the \"boss from Hell\" figure Buddy Ackerman. Alternating between wryly funny, starkly powerful and disconcertingly human, Spacey, though disappointingly denied the ability to chew the scenery quite as much as one might hope for, easily walks away with the picture with his top notch work. Frank Whaley gives an adequate performance as the constantly put upon assistant who finally seeks revenge, though his character is given next to no development and Whaley lacks the engaging charisma needed to really sell the role. Michelle Forbes also comes across as disappointingly flat as an ambitious business woman caught between Spacey and Whaley, though she shines in certain scenes. Watch also for an early appearance by Benicio Del Toro in a tiny role as Whaley's predecessor. While it may falter as the black comedy it clearly wants to be throughout, the film excels as the harshly critical drama it becomes by the end. An undeniably maliciously enjoyable performance by Spacey keeps the film afloat, and while it may occasionally come across as lopsided or falling short of its potential, Swimming with Sharks keeps enough surprises up its proverbial sleeve to remain interesting throughout as a cynical treatise on ambition and the film industry which thrives upon it. -7/10"
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Cineville",
         "Keystone Studios",
         "Mama'Z Boy Entertainment"
      ],
      "summaries": [
         "A young Hollywood executive becomes the assistant to a big time movie producer who is the worst boss imaginable: abusive, abrasive and cruel. But soon things turn around when the young executive kidnaps his boss and visits all the cruelties back on him.",
         "Movie producer Buddy Ackerman is one of Hollywood's most powerful men whose quickly on the rise for someone else's higher profile job. But that doesn't make Buddy such a nice guy, which his very naive assistant Guy is just about to learn. As he barely endures and tolerates Buddy's daily rituals of constant abuse and humiliation in front of the office, Guy has his own agenda to rise within Hollywood's ranks and Buddy is his only ticket there. But when Guy learns a potentially explosive personal secret involving both he, his producer girlfriend and his boss, he's decided he's had just enough. Now Buddy is about to be on a much harsher receiving end of Guy's wrath when he's been kidnapped, held hostage, and relentlessly tortured in his own home, with both men having no idea how this night is going to end when the cards will finally be on the table.",
         "Buddy Ackerman (Kevin Spacey), a big time movie producer on the rise, hires young Guy (Frank Whaley) to be his assistant. Guy thinks he's finally hit the big time. But Buddy has other ideas. He torments Guy with petty requests and daily reamings for bringing him Equal instead of Sweet-N-Low. Guy decides that he is fed up with Buddy's torture and goes to Buddy's house and ties him up and begins on his revenge. Guy's lover, a script writer who has \"screwed\" her way to the top, is dragged into this. Guy tortures Buddy and then his lover arrives and the big ending occurs.",
         "A young, naive Hollywood studio assistant finally turns the tables on his incredibly abusive producer boss."
      ],
      "budget": 700000
   },
   "movielensId": 322,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-09-10",
      "dvdReleaseDate": "2001-01-22",
      "directors": ["George Huang"],
      "runtime": 101,
      "movieId": 322,
      "title": "Swimming with Sharks",
      "mpaa": "R",
      "actors": [
         "Kevin Spacey",
         "Frank Whaley",
         "Michelle Forbes",
         "Benicio del Toro",
         "T.E. Russell",
         "Roy Dotrice",
         "Matthew Flint",
         "Patrick Fischler",
         "Jerry Levine"
      ],
      "imdbMovieId": "0114594",
      "originalTitle": "Swimming with Sharks",
      "genres": [
         "Crime",
         "Comedy"
      ],
      "youtubeTrailerIds": ["UH9OLQh46FY"],
      "plotSummary": "A young, naive Hollywood studio assistant finally turns the tables on his incredibly abusive producer boss.",
      "tmdbMovieId": 20306,
      "avgRating": 3.68292,
      "releaseYear": "1994",
      "numRatings": 3138,
      "posterPath": "/jqsOhWIGccIJCe8zvHKQuWy5IJL.jpg"
   }
}