{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "opera",
            "id": 2199
         },
         {
            "name": "musical",
            "id": 4344
         }
      ],
      "imdb_id": "tt0087034",
      "video": false,
      "title": "Carmen",
      "recommendations": [],
      "backdrop_path": "/dBfKwoCWq1Ml8GbNEU4j6USoyF9.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Carmen",
               "gender": 1,
               "credit_id": "52fe440fc3a368484e00d239",
               "name": "Julia Migenes",
               "profile_path": "/8T5CSlYZbDdkb94cNVhjYNSpJfd.jpg",
               "id": 87268,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Escamillo",
               "gender": 2,
               "credit_id": "52fe440fc3a368484e00d23d",
               "name": "Ruggero Raimondi",
               "profile_path": "/upIpwGhtN4CVFl2UOtBWJEylupF.jpg",
               "id": 87269,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Micaëla",
               "gender": 0,
               "credit_id": "52fe440fc3a368484e00d241",
               "name": "Faith Esham",
               "profile_path": null,
               "id": 87270,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Don José",
               "gender": 2,
               "credit_id": "5693c3b992514115c2004d7d",
               "name": "Plácido Domingo",
               "profile_path": "/jDx1ZADldQNdvCW7gLqWvdZNyGp.jpg",
               "id": 77886,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Frasquita",
               "gender": 0,
               "credit_id": "57e63a38c3a3682269005600",
               "name": "Lillian Watson",
               "profile_path": "/fKNxeYzYPvn6DKd8lIsxImogCX5.jpg",
               "id": 1378394,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Mercédès",
               "gender": 0,
               "credit_id": "57e63a529251414146008203",
               "name": "Susan Daniel",
               "profile_path": null,
               "id": 1684213,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Zuniga",
               "gender": 2,
               "credit_id": "57e63a67c3a36835a200510b",
               "name": "John-Paul Bogart",
               "profile_path": null,
               "id": 1684214,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Le Dancaïre",
               "gender": 0,
               "credit_id": "57e63a87925141414600822c",
               "name": "Jean-Philippe Lafont",
               "profile_path": "/cD2ZEPdR7IwqOFqhaHGFmppRb6k.jpg",
               "id": 1429989,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Le Remendado",
               "gender": 0,
               "credit_id": "57e63aa3c3a368351e004c46",
               "name": "Gérard Garino",
               "profile_path": null,
               "id": 1684215,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Moralès",
               "gender": 0,
               "credit_id": "57e63ac0c3a368245a005188",
               "name": "François Le Roux",
               "profile_path": "/bKEONXmSzIzY0YPcoFVMbLn8C0S.jpg",
               "id": 1563179,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Lillas Pastia",
               "gender": 2,
               "credit_id": "57e63ae3925141414600824f",
               "name": "Julien Guiomar",
               "profile_path": "/p45oVySoVG2CGmafTlrplBAfBft.jpg",
               "id": 11216,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "The Guide",
               "gender": 0,
               "credit_id": "57e63af99251412b1e005653",
               "name": "Accursio Di Leo",
               "profile_path": null,
               "id": 1303569,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe440fc3a368484e00d229",
               "name": "Francesco Rosi",
               "profile_path": "/6o74waMKsDklMongVmDWEDMPETY.jpg",
               "id": 87267,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe440fc3a368484e00d22f",
               "name": "Patrice Ledoux",
               "profile_path": null,
               "id": 60,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "57e5608cc3a3684ca5006287",
               "name": "Georges Bizet",
               "profile_path": "/jN08cO7T6hIG5MaTkkklKBWCSKY.jpg",
               "id": 41633,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "57e63b24925141390b0052d6",
               "name": "Lorin Maazel",
               "profile_path": "/1RrOgCmjtveFw8cjgVgSlXu809H.jpg",
               "id": 1017374,
               "department": "Sound",
               "job": "Music Director"
            },
            {
               "gender": 0,
               "credit_id": "57e63b409251412ae30059af",
               "name": "Henri Meilhac",
               "profile_path": "/gRkLYxPLuZTO3LeVALm5xc6Td42.jpg",
               "id": 1371422,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "57e63b59c3a368351e004c9d",
               "name": "Ludovic Halévy",
               "profile_path": "/i5NncQroBPSn9Pp6KzGvn3jVm9R.jpg",
               "id": 587861,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "57e63b86c3a36822270054b1",
               "name": "Prosper Mérimée",
               "profile_path": "/dPcCeYiSprRNJMx1rwzwBJyeFea.jpg",
               "id": 148059,
               "department": "Writing",
               "job": "Original Story"
            },
            {
               "gender": 0,
               "credit_id": "584b1500c3a368397e00225a",
               "name": "Tonino Guerra",
               "profile_path": "/5fO9Jrbnp0LbvVisSXhLJiVvxaL.jpg",
               "id": 15191,
               "department": "Writing",
               "job": "Adaptation"
            }
         ]
      },
      "genres": [
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.658146,
      "production_countries": [
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 21193,
      "vote_count": 8,
      "budget": 0,
      "overview": "A film version of the famous Bizet opera, where a soldier (Don Jose) falls in love with a beautiful factory worker (Carmen), but she does not reciprocate his feelings.",
      "similar": [
         872,
         279,
         342473,
         824,
         3933,
         10545,
         18947,
         82695,
         194662,
         196867,
         10530,
         10020,
         41233,
         19404,
         254470,
         8587,
         252,
         703,
         15121,
         419478
      ],
      "original_title": "Carmen",
      "runtime": 152,
      "poster_path": "/g5nvP3twQyJYxfLknIOqFBlDaok.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Opera Film Produzione",
            "id": 1549,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Gaumont International",
            "id": 7961,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Production Marcel Dassault",
            "id": 28766,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Coproducción Italia-Francia",
            "id": 68432,
            "origin_country": ""
         }
      ],
      "release_date": "1984-03-14",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Francesco Rosi"],
      "runtime": 152,
      "synopsis": null,
      "writers": [
         "Henri Meilhac",
         "Ludovic Halévy"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0087034/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk2ODEzMTI2M15BMl5BanBnXkFtZTYwNjI5NDg4._V1_SX214_AL_.jpg",
      "actors": ["Stars: Julia Migenes, Plácido Domingo, Ruggero Raimondi | See full cast and crew »"],
      "reviews": [
         "This is one of the best opera films ever made. The singing and orchestral playing are superb. The acting, directing, and scene setting made the story credible and even moving. Domingo is rather old for the role of the soldier so besotted by the sexy Carmen that he defies military orders. No matter, it works - Julia Migenes is so alluring, sings and moves so seductively, that it's not hard to imagine a man old enough to know better ruining his life for an hour with her. A must for opera lovers, and an excellent introduction to opera for those who think it's just about fat ladies playing teenage geishas and consumptive seamstresses.",
         "It would appear I have seen a totally different film from the previous reviewer who thought this awful. Compared with the performances in most opera houses, this version of Bizet's masterpiece was a true revelation allowing one to get the genuine feel of Spain and to see the drama unfolding in realistic locations. Everyone performed very well indeed, the singing was magnificent, the scenery unbelievable and the atmosphere perfection. The only complaint is the inclusion of the appalling bullfight (slaughter) scene during the overture which was quite unnecessary and much to be deplored. Any other viewer who shares my sensitivities will do the same as I do and miss out the Overture (which is a pity) and go straight to chapter 2 of the DVD. A very silly and pointless move which does not give atmosphere, only repulsion. A shame to have spoilt the ship for a ha'p'orth of tar, as they say here in the UK.",
         "Musically, dramatically and operatically excellent. The leads indeed exhibit a chemistry that is hard to resist. Julia Migenes, in addition to her wonderful voice, is completely irrestible as Carmen. What fun it would have been to have seen this cast in a similar production live at the Paris Opera!",
         "I want to comment on the review of Mike. The fact that he writes: \"the vast armpit hair on Carmen\" and that he finds the subtitles annoying doesn't make a movie awful. He watched the movie against his will at school. But if you do enjoy opera, and realise that in the time this movie is shot or represents the ladies didn't shave there armpits this is a pretty good movie. Good sets, deep, classic story and the camera work is okay but what can you aspect from an opera that is written to be watched from just 1 angle, the audience in front of the stage. This movie is a French classic with all the good singing of an opera, good sets, average camerawork and good stage acting. (An opera is always more body language because of the fact it used to be in a hard language to be understanded from the \"normal\" people.). So, enjoy this movie!",
         "Julia M-G is amazing! Despite not being the most physically stunning of women, she radiates such fire that you cannot help but see how every man she walks by falls in love with her version of Carmen. Placido Domingo, of course, is superb (and it's cool to see him when he was young and relatively slender). The movie is shot beautifully, on location in Spain, and the little details of the setting add to the pleasure of watching this wonderful film. I'll admit up front that I'm not a real opera connoisseur. In fact, there are not that many operas I really like. This movie is pretty much the entire reason I started enjoying opera at all, and it has become for me the standard against which I judge all renditions of Carmen. Obviously, most Americans won't like this movie, but then again, it wasn't made for them.",
         "Julia M-J oozes sexuality. She is the most erotic Carmen I have ever seen at the Met, Statsoper, Covent Garden, La Scala, on TV or in flicks and I go back to the forties. The photography is superb, it gives a sun drenched washed out effect that takes you back in time when all that happens is where you want to be. People have trashed the opening Bullfight background to the overture, I don't agree but then I am not very PC and don't believe in a sanitized blood free world. In the context of a nineteenth century opera it's valid. So listen to a young Domingo and watch Julia Mi-J have her way with him. I wold rate this as an opera movie second only to the Domingo-Richiarelli Otello.",
         "Prosper Merimee wrote the novella from which French composer, Georges Bizet, got his inspiration for his opera \"Carmen\". His work has long been a favorite of opera lovers that see in it an exciting time because of its magnificent music. Who hasn't been enchanted in hearing some of the famous arias from this work? The quality of the music is the main asset for its popularity. Francesco Rosi, a talented Italian director, and his collaborator, Tonino Guerra, a distinguished writer, long involved with his country's cinema, seemed the natural choices for translating Bizet's opera to the screen. Both succeeded in the way the adapted the material and took it to real locations for this extraordinary production. Carmen was a sultry woman who enchanted men with her beauty and with her passion for life. It's easy to see how she charms Don Jose, the military man, who loses his head because he has not met another woman like this beautiful Andalucian beauty. Their love will consume them both, not before allowing them to bring all their fire into a doomed relationship. Placido Domingo, perhaps the best rounded tenor of his generation, makes a great Don Jose. Besides his virile presence, Mr. Domingo has a treasured voice that even age doesn't seem to put a dent to it. He is a prodigy of endurance in a long career in which Don Jose has been one of his best roles. Julia Migenes projects such fire and passion she smolders the screen with her mere presence as Carmen. It's no wonder Don Jose loses his head over her. Ruggiero Raimondi, another excellent singer plays Escamillo with his usual elegant style. Faith Esham is seen as Micaela, Don Jose's loyal fiancée, who has no chance with him as he loses his soul to Carmen. Pasqualino DeSantis' camera work enhances the vision of Mr. Rosi. The editing by Renzo Mastroianni and Collette Samprum makes one appreciate the way they blended the music and the acting into seamless performance. The music was conducted by Lorin Maazel and the Paris Opera orchestra and chorus. Francesco Rosi deserves credit for this lovely opera film.",
         "It was a wonderful way to welcome in 2006: TFO presented this classic opera-film for my complete enjoyment. Francesco Rosi made some classic films in Italy (Salvatore Giuliano, The Mattei Affair) and he knows how to mix violence and passion with ravishing music. If Placido Domingo's face doesn't show very much of the emotion that boils below the surface, his voice is sublime. He was the best Don Jose I have ever heard. Julia Migenes would not be called beautiful, but she knows how to portray the sluttish and irresponsible sides of Carmen. You know this woman is not going to achieve lasting happiness because of her volatile, impulsive nature. Ruggero Raimondi as Escamillo shows why he could get women with animal magnetism. The parting of Jose and Carmen outside the arena is wonderfully poignant, a triumph of direction and acting.",
         "I really liked this production of Carmen. Unlike many I have seen, Carmen and Don Jose had a real chemistry -- I could see why Don Jose would throw off his military career for her. The singing is great, as is the acting and the photography. When friends of mine have asked me about opera, I have played this tape for them.",
         "I'm not an opera fan ... mainly because the words usually seem so trite compared to the music which carries the real meaning of the story and actions. Anyway, after years of enjoying the music without ever seeing the Opera of Carmen I watched this video and am totally enthralled! Bravo! Encore! Francesco Rosi certainly brings the story to life in a most wonderful way using the medium of film ... Bravo! Encore!!! Bravo!!!"
      ],
      "genres": [
         "Drama",
         "Music"
      ],
      "productionCompanies": [
         "Gaumont",
         "Production Marcel Dassault",
         "Opera Film Produzione"
      ],
      "summaries": ["A film version of the famous Bizet opera, where a soldier (Don Jose) falls in love with a beautiful factory worker (Carmen), but she does not reciprocate his feelings."],
      "budget": 0
   },
   "movielensId": 3222,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1984-03-14",
      "dvdReleaseDate": "1999-12-28",
      "directors": ["Francesco Rosi"],
      "runtime": 152,
      "movieId": 3222,
      "title": "Carmen",
      "mpaa": null,
      "actors": [
         "Julia Migenes",
         "Ruggero Raimondi",
         "Faith Esham",
         "Plácido Domingo",
         "Lillian Watson",
         "Susan Daniel",
         "John-Paul Bogart",
         "Jean-Philippe Lafont",
         "Gérard Garino",
         "François Le Roux",
         "Julien Guiomar",
         "Accursio Di Leo"
      ],
      "imdbMovieId": "0087034",
      "originalTitle": "Carmen",
      "genres": [
         "Music",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A film version of the famous Bizet opera, where a soldier (Don Jose) falls in love with a beautiful factory worker (Carmen), but she does not reciprocate his feelings.",
      "tmdbMovieId": 21193,
      "avgRating": 3.68314,
      "releaseYear": "1984",
      "numRatings": 172,
      "posterPath": "/g5nvP3twQyJYxfLknIOqFBlDaok.jpg"
   }
}