{
   "tmdb": {
      "original_language": "ja",
      "keywords": [
         {
            "name": "insect",
            "id": 332
         },
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "art house",
            "id": 11130
         },
         {
            "name": "sand dune",
            "id": 178080
         },
         {
            "name": "japanese new wave",
            "id": 209998
         },
         {
            "name": "entomologist",
            "id": 214613
         },
         {
            "name": "sand pit",
            "id": 225471
         },
         {
            "name": "existential loneliness",
            "id": 231644
         }
      ],
      "imdb_id": "tt0058625",
      "video": false,
      "title": "Woman in the Dunes",
      "recommendations": [
         20532,
         29452,
         14696,
         31217,
         15244,
         20108,
         14537,
         30959,
         34528,
         216,
         54146,
         20530,
         690,
         31589,
         36265,
         34530,
         30368,
         38360,
         4495,
         34181
      ],
      "backdrop_path": "/5u6EuPA6G6zWjjMKqMWEWEcEegy.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Niki Jumpei",
               "gender": 2,
               "credit_id": "52fe46e49251416c7508706f",
               "name": "Eiji Okada",
               "profile_path": "/psadJTgSSEqaVKDpsk40tb5ypbg.jpg",
               "id": 25466,
               "order": 0
            },
            {
               "cast_id": 12,
               "character": "The Woman",
               "gender": 1,
               "credit_id": "52fe46e49251416c75087091",
               "name": "Kyoko Kishida",
               "profile_path": "/ng8o42sEIfz0enlAeVOPd7JiHdM.jpg",
               "id": 94188,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 0,
               "credit_id": "52fe46e49251416c7508707b",
               "name": "Ginzô Sekiguchi",
               "profile_path": null,
               "id": 96806,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 0,
               "credit_id": "52fe46e49251416c75087073",
               "name": "Kôji Mitsui",
               "profile_path": null,
               "id": 96804,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 0,
               "credit_id": "52fe46e49251416c75087077",
               "name": "Sen Yano",
               "profile_path": null,
               "id": 96805,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Entomologist's wife (in flashbacks)",
               "gender": 0,
               "credit_id": "52fe46e49251416c75087095",
               "name": "Hiroko Itô",
               "profile_path": null,
               "id": 555339,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46e49251416c7508706b",
               "name": "Hiroshi Teshigahara",
               "profile_path": "/vkQZsizTcw2msRw19zeVI2T36oZ.jpg",
               "id": 96801,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46e49251416c75087081",
               "name": "Hiroshi Segawa",
               "profile_path": null,
               "id": 96809,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe46e49251416c75087087",
               "name": "Fusako Shuzui",
               "profile_path": null,
               "id": 96810,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe46e49251416c7508709b",
               "name": "Kôbô Abe",
               "profile_path": null,
               "id": 96807,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe46e49251416c750870a1",
               "name": "Kôbô Abe",
               "profile_path": null,
               "id": 96807,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe46e49251416c750870a7",
               "name": "Kiichi Ichikawa",
               "profile_path": null,
               "id": 1089030,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46e49251416c750870ad",
               "name": "Tadashi Ôno",
               "profile_path": null,
               "id": 1089017,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "57171fb69251417a22006174",
               "name": "Toru Takemitsu",
               "profile_path": "/zarE9jriPIK3UnK52ySb2UeUJ6O.jpg",
               "id": 51808,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 6.928244,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 16672,
      "vote_count": 113,
      "budget": 0,
      "overview": "An entomologist suffers extreme psychological and sexual torture after being taken captive by the residents of a poor seaside village.",
      "similar": [
         281957,
         11121,
         521,
         4771,
         769,
         116,
         1586,
         320,
         279,
         581,
         13,
         562,
         51828,
         75780,
         207932,
         169917,
         392044,
         22971,
         181283,
         452507
      ],
      "original_title": "砂の女",
      "runtime": 147,
      "poster_path": "/dxAu4vdkBrUHoXuGT0ZbKh0weoQ.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Teshigahara Productions",
            "id": 3212,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Toho Film (Eiga) Co. Ltd.",
            "id": 622,
            "origin_country": ""
         }
      ],
      "release_date": "1964-02-15",
      "vote_average": 8.1,
      "belongs_to_collection": null,
      "tagline": "Haunting. Erotic. Unforgettable.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Hiroshi Teshigahara"],
      "runtime": 123,
      "synopsis": null,
      "writers": [
         "Kôbô Abe",
         "Kôbô Abe"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0058625/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjM4NzE1NzA1Nl5BMl5BanBnXkFtZTgwOTQxMTQ0MjE@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Eiji Okada, Kyôko Kishida, Hiroko Itô | See full cast and crew »"],
      "reviews": [
         "In early 1966, when the annual Oscar nominations for best director of the year were announced, Teshigahara might have even made a wry smile. What is surprising to me today is not that a Japanese filmmaker almost unknown in the US was nominated, but that the Motion Picture Academy in 1966 had such a keen aesthetic sense as to appreciate his radical work. \"Woman in the Dunes\" (Suna no onna) was far ahead of its time, radiating Absolute Beauty. An entomologist (Eiji Okada) seeks lodging for the night in the dunes, and is led by the villagers to the bottom of a sandpit where he finds a widow (Kyoko Kishida) living in a shack. Next morning he discovers he can no longer climb out. He is expected to remain there and to live with the woman, who needs a man's help. Because the sand drifts into the shack without cease, shoveling sand away from the sandpit is her primary daily routine. After all attempts to escape the situation fail, he becomes accustomed to it and finds another way of life. It is almost meaningless to try to ascertain any scientific or economic logic beneath the surface of this allegorical story (written by Kobo Abe). Such hairsplitting will only make you lose the merit of this work. The primary subject of the story seems to lie in a certain passive mentality to be called \"mental inertia,\" mental acclimation, conformity, or something like that. \"Mental inertia\" is caused by \"usualness\" (or \"dailiness\"), and comes to dominate the subconscious in due course. Abe and Teshigahara metaphorically depict such \"usualness\" as the character of sand -- usualness formed in an unusual situation. The woman has a strong mental attachment to the status quo around her; despite the cruel fact that the sand has killed her husband and daughter, she prefers to stay there and not to change her life. This is the \"mental inertia\" of the work. The entomologist, too. He at first thinks the whole situation surrounding the woman absurd, and tries to escape it. However, he becomes accustomed to the situation day by day, and accepts such absurdity after all. By whom is he forced to do so? The villagers? No. Himself! He chooses to return to the sandpit and stay there even when he becomes free to leave. He becomes a captive in the dunes by \"mental inertia\" just as he has been in the city. After seeing this work, I came to feel that many variants of \"invisible sand,\" which might dominate our \"free will,\" are drifting and accumulating around us without cease, whether or not we realize it. Pictures are great. The sand is living here, showing various expressions. Surely it \"acts\" as a main character in several impressive scenes, including an unforgettable love scene where the couple is caked with it. And, music! -- if we may call this incomparable sound work so. It not only enhances each scene fully, but also gives life to things that are not expressed in image alone. From barbaric drum music through sensual sound like the sand's \"breathing,\" Takemistu-sound is full of imagination and magic. A perfect fusion of Image, Sound, and Subject. See \"Woman in the Dunes\" and die.",
         "This classic film is one of the few to still live up to the name of \"perfect film\". Everything in the film is perfectly controlled and at the same time so natural. The story involves an amateur entomologist captured in a giant sand pit somewhere on the coast of a small Japanese island. He tries to escape but a mysterious woman and some nasty villagers keep pulling him back in. Despite being made in the early sixties this film still packs a dose of eroticism that most contemporary filmmakers pray to achieve. The black and white cinematography is absolutely haunting (watch out for poor video copies which are way too dark, there is a new DVD out which shows what the original print intended) This is about as close as you can get to a perfect film. There is nothing that could ever be improved upon.",
         "'Woman In The Dunes' is a superb film adaptation of a fascinating novel by Kobo Abe. Abe was heavily influenced by Kafka and wrote several very strange and unforgettable books, but this was his masterpiece. He scripted the movie himself, and the director Hiroshi Teshigahara obviously \"got\" the material, so the film is also a masterpiece. It includes some of the most striking visual imagery I've ever seen, and I would have to say this movie is among the very best I've watched. Yes, it's THAT good. The two leads (Eija Okada and Kyoko Kishida) both give superb performances and there are some genuinely erotic (though not explicit) scenes between them. Okada plays an insect collector on holiday who finds himself stranded overnight in the country. Kishida is a local woman who agrees to lodge him for the night. However she lives in most unusual circumstances - in a shack surrounded by sand dunes which continually invade her home. To say anything more about what happens would be to spoil the extraordinary movie that follows. You can read it as an allegory or take it as a filmed nightmare, it's up to you, but believe me you won't EVER forget 'Woman In The Dunes'!",
         "I'd wanted to see this movie for years, and finally got around to it, on DVD. What a treat! I was glad to discover that the erotic element, though important, is not the predominant draw here; typically, some references to the film make it sound as though it were some forbidden erotic romp, or full of perverse sexuality. Instead I found myself wrapped up in a creepy suspense-thriller sci-fi-fantasy carried off with wit, style, and extraordinarily interesting photography (including one scene that, at least on my set, was completely black for a couple of minutes). I voted \"nine\" for this wonderful film, in part because it left me with a lot to think about, in part just for how well it was made. The music by Toru Takemitsu is absolutely perfect for the task, too. This is just about my favorite kind of film: one that raises important questions about human life, but not at the expense of entertainment. It's as close as I'll probably ever come to having my cake and eating it, too. Update, January 2007: I finally obtained my own DVD of this film, one with much higher quality photographic reproduction. I now marvel even more at the extraordinarily creative photography. Be sure, if you view this on DVD, not to boost your set's brightness: I can assure you the film is very, very dark on purpose. If possible, see it on a high-definition monitor. Today, I'd vote \"ten.\"",
         "In my interpretation this movie is a reflection on Zen philosophy: Just like Zen monks that sweep the courtyards of monasteries and devote themselves to the most humble tasks to find inner harmony, Niki finds inner rest in the daily work of removing the sand, solving water supply problems and living a confined live. The movie suggests the modern lives we live in the big cities isolate us from our needs and ourselves. Just like a Zen garden, that is designed to mirror nature and men, the people in the dunes reflect our daily struggles and confinements. The surreal setting is a necessity to convey the message of the film. There is nothing goofy about the pits and how people behave in there. It is just hard for us western people to see the transcendence there. I watched this movie on a Japanese Film Festival in Berlin in 1993. I can't remember all the details but the movie really mesmerized me. It is a very unique work and I wonder why it doesn't have the cult status of other movies.",
         "Spoilers herein. Here is the rare example where knowledge of the filmmaker enhances the enjoyment of the work. At least that is true for this North American. Teshigahara was one of a now large class of intellectuals rooted in Japanese traditions but seriously exploring fusion with `western' ideas -- ideas about abstraction, narrative and perception. That class is large now, but was very small in the early sixties, the superficial intoxication with postwar, promiscuous exploration of western style having by then been abandoned. It borrows heavily from what Teshigahara thought was the Nabokov style: pervasive symbolism, floating perspectives on reality, self-imposed confinement. The notion of `bugs' and collecting is a bow to Nabokov himself who was rather famous in butterfly circles. (The few mazelike drawings in the title sequence almost certainly influenced Greenaway's `A Walk through H' which explores most of the same notions from the same perspective.) I saw this first in 1965 and was awed. This film is anti-Kurosawan -- the philosophy used for the camera eye is opposite from Kurosawa's. Kurosawa's notion revolved around a wholeness. Each shot was composed as a harmonious unit -- the action of a bystander in the background was as important (more!) than that of the foreground. No such differentiation was made between foreground and background. It was all of one whole. Teshigahara's eye is different. He makes a clear distinction between the two characters and the environment. (The villagers are part of the environment.) As much attention is given to the dynamics of each separately. Much is made of the annoyance each causes the other. Transitions between skin (usually the woman's) and the surface of the sand are not to note a symmetry, but a dis-symmetry. This is very much in line with the famous school of icheban (flower arrangement) that Teshigahara's father founded (and which Teshigahara himself later headed). Traditional icheban has always depended on the `missing center,' the implied elements whose absence is as important as those present. This new school makes that more explicit, with radical assymetries among placed elements. What is seen is made more important by what they imply, which is a quite different matter than implication by absence. Inference by presence rather than inference by absence. Radical in that day -- and it fits in a rough way with mature notions of western narrative symbolism, where certain things represent others, especially Nabokov's notion of frangible, constructed symbolism. That means that each symbol's meaning does not come from context and culture (as many would later and popularly claim) but from the mind of the narrator existing in the mind of the reader. Twenty years later Teshigahara made a documentary on the architect Gaudi. Gaudi is the one architect who exploits this same notion of inferred reality. This is worth watching. And Teshigahara is worth learning about.",
         "Harsh and beautiful analysis of existentionalism. All the Sartrean trappings along with an element of Camus are presented in this film better than any other I know. The realization that life is absurd leads the main character to venture towards trying to make meaning out of what is essentially meaninglessness. The intersubjective relationship between man and woman is examined both erotically and violently while the villagers play the crucial role of the everpresent Other. Disturbing ending only underlies the overpowering presence of the sand dunes. The sand being the strongest metaphor in the film, illustrating the belief that life is nothing but a giant and endless egg-timer flowing sand down upon us. Highly recommended.",
         "I get more and more impressed with the classics of Japanese cinema and this is def a highlight. Mesmerizing and artsy it portrays a etymologist and 'the woman of the dunes' trapped in sand. The trap itself obviously symbolizes the trap a certain desert beetle digs to lie in the midst of it waiting for prey which cannot help but sliding into it. Its the same for him, he cant climb the sand walls, the more he struggles the more the sand runs a little like the woman who in fear of the outside continues her sisyfosan existence. The psychology between the two is excellently depicted. The tension is intensified trough images of sweaty skin and running sand. The cinematographer is a master in filming this. Lots of black. Editing also is sharp and very well done. Sound is minimal and fits the images' bleak and deserted dunes. Much can be said about this movie, it is one for repeated viewings for sure.",
         "After watching this movie, my idea of what a good movie, had changed. The imagery is utterly beautiful, and the emotion of the relationship is intense. While other movies rely on acting, or emotion to capture the audience this movie is very special because how the director, and the screenwriter(kobe abe, also wrote a book by the same title), let the viewers develop their own ideas and perspectives. Having seen this movie with other people and looking at different comment about the movie, each person had a different opinion of the movie. In a complex world full of vice, and danger, it is sometimes the simplest things that can make a man beg for mercy. The everlasting sand, can bring you to love, or to destruction...",
         "Is there any meaning in the world? We see a man who has fled from his meaningless job in Tokyo to gather beetles in a remote desert. If he finds a unique beetle, he will get his name in the insect book. This will bring meaning to his life. Instead, he is tricked into spending the night with a woman in a sand pit. She lives in a slave labor village shoveling sand from the bottom of her pit to keep from being submerged in blowing sand. The most memorable scene of the film occurs near the end, after several escape attempts, he finds that the jailers have mistakenly left the rope ladder down into the pit. He climbs out and sees the ocean crashing onto the desert, the same ocean for which he has been begging to see for years. But he looks around, looks at the ocean for a few seconds, and calmly retreats to the pit. Where was he to go? His life in Tokyo was certainly not more fulfilling than that in the pit. He was lost in the desert, and the ocean had lost it's appeal. He had become his own jailer, for his pit was certainly no worse of a jail than the rest of his life had been. After seven years and repeated failed escape attempts, the man accepts his fate. He has brought new meaning to his life by discovering a way to pump water into a barrel from the sand. My friends and I debated for an hour whether his pride in his invention was pitiful or triumphant. Does one take pride in an interesting but mundane achievement in a world without meaning, or does one reject false salvation? After all, he's still stuck doing slave labor in the pit. Watch this movie with friends and you will have endless hours of discussion. A film that reinvents itself in each individual's mind, as great cinema should."
      ],
      "genres": [
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Toho Film (Eiga) Co. Ltd.",
         "Teshigahara Productions"
      ],
      "summaries": [
         "Jumpei Niki, a Tokyo based entomologist and educator, is in a poor seaside village collecting specimens of sand insects. As it is late in the day and as he has missed the last bus back to the city, some of the local villagers suggest that he spend the night there, they offering to find him a place to stay. That place is the home of a young woman, whose house is located at the bottom of a sand pit accessible only by ladder. He later learns that the woman's husband and child died in a sandstorm, their undiscovered bodies buried somewhere near the house. The next morning as he tries to leave, he finds that the ladder is gone - he realizing that the ladder he climbed down was a rope ladder which is anchored above the pit - meaning that he is trapped with the young woman as the walls of the pit are sand with no grip. He also realizes that this entrapment was the villagers and the young woman's plan for him to stay there permanently to be her helper in the never-ending task of digging out the sand, which if not done will swallow them alive. They are dependent upon the villagers to help remove the sand, but also for their rations including water. He learns that the sand is the young woman's life, and that she knows or wants no other life. Thus, it is no use either to blackmail or kill her as she is willing to live and die by this life, and as such he will surely die if she is dead. His life tasks become to figure out a way to escape while co-exist with the woman in what he considers their prison. As time goes on, he also learns that there are other tasks which will consume him.",
         "An amateur entomologist searching for insects by the sea is trapped by local villagers into living with a mysterious woman who spends almost all her time preventing her home from being swallowed up by advancing sand dunes. The woman and the trapped man begin a strange and erotic relationship that stretches over years, as the man's hope for escape dims.",
         "An entomologist searching for insects by the seaside is trapped by local villagers into living with a widow whose life task is digging up sand for them. He eventually develops strong feelings for her as his hope for escape dims."
      ],
      "budget": 0
   },
   "movielensId": 3224,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "1964-02-15",
      "dvdReleaseDate": "2007-07-10",
      "directors": ["Hiroshi Teshigahara"],
      "runtime": 147,
      "movieId": 3224,
      "title": "Woman in the Dunes",
      "mpaa": "",
      "actors": [
         "Eiji Okada",
         "Kyoko Kishida",
         "Ginzô Sekiguchi",
         "Kôji Mitsui",
         "Sen Yano",
         "Hiroko Itô"
      ],
      "imdbMovieId": "0058625",
      "originalTitle": "砂の女",
      "genres": [
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["WODbLjG4kzw"],
      "plotSummary": "Jumpei Niki, a Tokyo based entomologist and educator, is in a poor seaside village collecting specimens of sand insects. As it is late in the day and as he has missed the last bus back to the city, some of the local villagers suggest that he spend the night there, they offering to find him a place to stay.",
      "tmdbMovieId": 16672,
      "avgRating": 4.02934,
      "releaseYear": "1964",
      "numRatings": 784,
      "posterPath": "/dxAu4vdkBrUHoXuGT0ZbKh0weoQ.jpg"
   }
}