{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "lovesickness",
            "id": 725
         },
         {
            "name": "new love",
            "id": 1605
         },
         {
            "name": "love of one's life",
            "id": 2038
         },
         {
            "name": "relocation",
            "id": 3805
         },
         {
            "name": "man-woman relation",
            "id": 5756
         },
         {
            "name": "love",
            "id": 9673
         }
      ],
      "imdb_id": "tt0186975",
      "video": false,
      "title": "Down to You",
      "recommendations": [
         10571,
         8986,
         26602,
         2020,
         9424,
         9582,
         12771,
         35645,
         14330,
         1641,
         23570,
         21352,
         16172,
         13203,
         17813,
         13969,
         10342,
         12257,
         47608,
         10050
      ],
      "backdrop_path": "/qVSvHxnPvtbErWbHfeiwAb8lh1R.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Alfred 'Al' Connelly",
               "gender": 2,
               "credit_id": "52fe43769251416c750115b7",
               "name": "Freddie Prinze Jr.",
               "profile_path": "/xkbGC7tDwoKUwpNcOLsNUMjLjP4.jpg",
               "id": 33260,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Imogen",
               "gender": 1,
               "credit_id": "52fe43769251416c750115bb",
               "name": "Julia Stiles",
               "profile_path": "/qkCdQIHFDmbxCjp4F1x32qvaXeu.jpg",
               "id": 12041,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Cyrus",
               "gender": 1,
               "credit_id": "52fe43769251416c750115bf",
               "name": "Selma Blair",
               "profile_path": "/xltCuuG4xjACQ6vQm55iuR5LFJC.jpg",
               "id": 11826,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Eddie Hicks",
               "gender": 2,
               "credit_id": "52fe43769251416c750115c3",
               "name": "Shawn Hatosy",
               "profile_path": "/deVcvUyZEybTQuyBYiioVJ4Lyst.jpg",
               "id": 52647,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Monk Jablonski",
               "gender": 2,
               "credit_id": "52fe43769251416c750115eb",
               "name": "Zak Orth",
               "profile_path": "/rKupoahQ3pgeVVXS8EWd1WSnKEO.jpg",
               "id": 6212,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Jim Morrison",
               "gender": 2,
               "credit_id": "52fe43769251416c750115ef",
               "name": "Ashton Kutcher",
               "profile_path": "/cGEvhWHlJmSrYfkpfCtfZVeRVsP.jpg",
               "id": 18976,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Lana",
               "gender": 1,
               "credit_id": "52fe43769251416c750115f3",
               "name": "Rosario Dawson",
               "profile_path": "/dEK1rMmSJAPGdc2t1XWdbqBmvEq.jpg",
               "id": 5916,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Chef Ray",
               "gender": 2,
               "credit_id": "52fe43769251416c750115f7",
               "name": "Henry Winkler",
               "profile_path": "/bwRNFbcotcEeZcKzlbUia4juF6N.jpg",
               "id": 31903,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Judy Connelly",
               "gender": 1,
               "credit_id": "52fe43779251416c750115fb",
               "name": "Lucie Arnaz",
               "profile_path": "/xIU6Jm8M4kwMzvfJWPPaiiBCDhg.jpg",
               "id": 61880,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Lovestruck Woman",
               "gender": 1,
               "credit_id": "52fe43779251416c750115ff",
               "name": "Lauren German",
               "profile_path": "/qhHegRoOL7cZu6rMNRezHbIEj75.jpg",
               "id": 37014,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Lovestruck Man",
               "gender": 0,
               "credit_id": "52fe43779251416c75011603",
               "name": "Zay Harding",
               "profile_path": null,
               "id": 1189046,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43769251416c750115c9",
               "name": "Kris Isacsson",
               "profile_path": null,
               "id": 65627,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43769251416c750115cf",
               "name": "Kris Isacsson",
               "profile_path": null,
               "id": 65627,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe43769251416c750115d5",
               "name": "Kris Isacsson",
               "profile_path": null,
               "id": 65627,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43769251416c750115db",
               "name": "Jason Kliot",
               "profile_path": null,
               "id": 13233,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe43769251416c750115e1",
               "name": "Joana Vicente",
               "profile_path": null,
               "id": 13234,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43769251416c750115e7",
               "name": "Edmund Choi",
               "profile_path": null,
               "id": 42383,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5a86a1d60e0a26535a034aff",
               "name": "Harvey Weinstein",
               "profile_path": "/jonLOgQIZPBn650kLcsKOPois7U.jpg",
               "id": 59839,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 7.176809,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10472,
      "vote_count": 90,
      "budget": 9000000,
      "overview": "College coeds in New York City, Al, the son of a celebrity chef, and Imogen, a talented artist, become smitten the second they lay eyes on one another at a bar. However, the road to happiness is not a smooth one. Outside forces, including a predatory porn star who wants to lure Al into her bed, threaten to pull apart the young lovers before their romance has a chance to really flourish.",
      "similar": [
         24420,
         1259,
         858,
         1903,
         1643,
         10641,
         8390,
         1213,
         10571,
         11522,
         38,
         13,
         509,
         50546,
         86331,
         46705,
         272693,
         634,
         901,
         261470
      ],
      "original_title": "Down to You",
      "runtime": 91,
      "poster_path": "/qnT0Lf9ArebC4iGCAajVnWbbqKc.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [{
         "logo_path": "/sNhxHhbyJ0xo52nr9xI2cJKkWFO.png",
         "name": "Miramax Films",
         "id": 14,
         "origin_country": ""
      }],
      "release_date": "2000-01-21",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "A new comedy about giving first love a second chance.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Kris Isacsson"],
      "runtime": 91,
      "synopsis": null,
      "writers": ["Kris Isacsson"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0186975/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI3NDIxMTIwMF5BMl5BanBnXkFtZTcwNTQ3MTIyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Freddie Prinze Jr., Julia Stiles, Selma Blair | See full cast and crew »"],
      "reviews": [
         "Down to You: Boy meets girl, they fall in love, relationship cools, couple breaks up and each is tortured by thoughts of \"What if\u0085\" I decided to see this movie because I enjoyed Julia Stiles' performance in \"10 Things I Hate About You\". However, after seeing the marquee poster - a knockoff of \"The Very Thought of You\" - I scaled down my expectations and braced for a painful two hours. My prediction was partially correct. Unlike the typical teen oriented romantic comedy there was an attempt to infuse this movie with a bit of reality. Unfortunately, the writers apparently could not decide if they wanted to make a romantic comedy or a serious relationship movie. The result is a confused mess: a ludicrous subplot about a student's burgeoning career as a pornographer gets far more screen time than does the terrified couple trying to come to grips with a potential pregnancy. The second problem is the chemistry between Stiles and Freddie Prinze Jr - there is none (I blame the casting director for this). Although both actors have screen presence, they don't click as a duo, consequently, their interactions- especially the fight scenes -do not ring true. Their job is made doubly difficult by having to utter stupid lines. This movie has been targeted to a certain market, and will probably do well. Too bad.",
         "\"Down to You\" was slammed by critics when it was released, claiming it to be unoriginal, unfunny and really a waste of time. Pay no attention to them. It is rare for romantic comedies to be entirely original [they are after all dealing with love], but Down to You does have it's moments differing it from most of the recently released teen comedies [to which it has constantly been compared]. Through narration by both protagonists the audience is able to see the development of both characters in the long-term and how they ultimately react to each other. Freddie Prinze Jr and Julia Stiles were perfectly cast and behaved as mature young adults for the majority of the film [sparing the audience from cliched teen talk]. They leave the zaniness to their co-stars, which was a good move. The film is more of a \"love story\" then most recent teen flicks dealing mainly with \"physical attraction\" or \"opposites attract\". One problem with Down to You however is it's not presented well enough to keep the audience interested. Perhaps in the hands of a more capable director this would be achieved, as I got a bit bored with a few of the scenes and some jokes really fall flat. Because of this, it's not as memorable as other teen flicks such as \"10 Things\" or \"Scream\", even.. as it's pacing is quite slow. It's saving grace is the cast. Henry Winkler gives a comic performance as Prinze's celebrity-chef father and Zak Orth plays Prinze's \"friend turned porn- star-friend\" with gutso. Selma Blair gave a sultry performance but lacked development making her nothing more than \"the porn star girl\". Compared to the other three major teen romance flicks of the year (Loser, Whatever it Takes, Boys and Girls) Down to You is indeed one of the finest. It just needed more \"oomph\" to make it more memorable. 7/10",
         "Al and Imogen have both finished college and now live separately despite seeing each other throughout their college years. However it is clear that both have some degree of unresolved feelings for each other. In to-camera interviews they discuss their relationship and trace it's path from the first time they met in Imogen's freshman year. It is a device that I have grown accustom to because I have seen it done well quite often, but the direct-to-camera style is clearly difficult to do. First of all you need strong or likeable characters as the style is basically requiring some degree of interest of empathy from the first second. Without this it is pretty weak. This film stumbles at this point because even halfway through the film, I was still struggling to care less about the characters. Past this problem the plot is not the strongest \u0096 it has been done before regardless of superficial changes. It has little genuine humour and mostly is just the cinematic version of puppy love. When the problems come they are so poorly handled by the script that they fail to convince. Sadly the blame must be shared between script and actors for most of this. The script fails to create characters that convince. The dialogue rarely rings true and sounds like a weak teen drama at worst. However this doesn't totally excuse the actors as they don't bring much to the roles. Prinze Jr is so wishy-washy and lifeless that he is not someone I ever got behind as real. He is too idealistic and, as a result, any scenes where he has to show hurt or anger, are unbelievable. Stiles is OK but suffers from a poor script. The support cast are basically monkeys who are simply comedy characters. I know that sounds cruel but none have any effort put into them \u0096 the porn star (no type of porn I've ever seen), the geek etc. Henry Winkler gets the odd smile but is just a famous face to add colour. Selma Blair is the least convincing porn actress I've ever seen but the Biggest waste to me was Rosario Dawson, not only gorgeous but a real talent given the chance, her character was so pointless that I wondered why they even bothered creating it. It's not an awful film \u0096 it is simply mediocre and unremarkable to the point of monotony. Every part of it feels like you've seen it better somewhere else. The script is lazy \u0096 things are poorly thought out and the characters are thin and poorly developed. None of the cast really put their heart into it and the end result is a film that doesn't really do anything but still seems to take forever to finish! Although it will be remembered for things like Trainspotting and My Beautiful Laundrette, FilmFour folded partly because it produced things like this that were without spark, wit or invention.",
         "\"Down To You\" is yet another formulaic teen romance movie....boy meets girl, boy and girl date, break up and get back together. Very uninteresting,the cast (mostly) is forgettable and frankly, we've seen this movie before...... However, what sets \"Down\" apart is 3 wonderful performances, and 1 so bad it's gonna get special attention in this review... We'll start with the good....Julia Stiles is Imogen, a new freshman at an unnamed NYC college. She is a stellar artist, and wishes to persue that in some manner. Ms. Stiles delivers a performance above the drivel she has to work with, making Imogen a teen character with heart and feeling. She once again (as in \"10 Things\") dances in this one..and I personally think she needs a dance scene in each movie. Henry Winkler plays Ray Connelly...host of a nationwide cooking show, and father of Al, the lead male in the story. His character is well played and humorous, with grand visions for both himself and his son (he wants to do a cooking show take off of \"Cops\" with Al). A great performance from Mr. Winkler, and he is quickly putting the ghost of Fonzie behind him. Now to the bad before I surprise you and give you the last good.....Selma Blair plays Cyrus, a major flirt and porn actress. I hate to have to say this, but after \"Cruel Intentions\" and now this, I am truly convinced that she is either \"someone's\" daughter or is involved in a relationship with someone. This woman cannot act. I truly believe with every fiber of my being that she could not play dead convincingly. Hopefully her performance here will kill what little career she has. Now, for the last good review.......are you ready for this?? Freddie Prinze Jr. is Alfred..the film's lead male character. He spots Imogen across a crowded room and the two instantly hit it off. After forgetable turns in every movie he has done, he shows a never before seen maturity and makes Alfred a character that seems real and true. \"Down To You\" is more formulaic drivel aimed at the easily entertained teen audience. While the story is something we've all seen before, the performances of its lead characters make this movie worth a watch, regardless of how bad it really is. 1 out of 5",
         "Al Connelly (Freddie Prinze Jr.) is a college sophomore who meets the girl of his dreams, freshman Imogen (Julia Stiles). His father is famous TV Chef Ray (Henry Winkler) and he would love to be his own master chef. It's written poorly, and shot awkwardly. This is Kris Isacsson's first big film. The dialog is clunky. It starts right from love at first sight, then meanders with no drama until they break up after a pregnancy scare. There are things that don't make any sense, and things that's just isn't funny. It is being told by both Al and Imogen's point of view. They talk right into the camera at the audience which stops the movie every time and do a lot of narration. But the future star power of the cast is amazing. They got Selma Blair as a porno star, Ashton Kutcher as a weirdo musician, and Rosario Dawson as her best friend. It's fun to see them when they were lesser known actors.",
         "What was I thinking? I basically got drawn into seeing this because all my friends wanted to. I figured \"why not\" and while I was watching the \"film\" I found myself asking over and over \"Why me?\" Sure Freddie Prinze Jr. is nice to look at, but worth 7 bucks? I think not. Now, where have I seen this movie before? Oh yes...every other movie directed towards teens in the recent years. I'm sorry, I might just be a teenager but I know crap when it's crap and I know what I like, and this movie I did not. Where was the plot? Where was one spec of originality? And where were the actors? Selma Blair was the best of the bunch. I don't care how good looking Freddie is, he needs to take some acting classes, either that strive to make his characters have a little bit more difference then the name change. I like Julia Stiles, but normally when you have to play off a bad actor it reflects badly on you. I didn't see the chemistry this couple was supposed to have. Yes \"Down to You\" has it's cute moments, some funny moment, and few sweet moment, but worth 7 bucks? Not a snowball's chance in hell. Save your money and your time. Wait for video, or just don't see it at all.",
         "First of all, let me just say that after viewing this film, I seriously thought about writing my own screenplay, because I know I could write something ten times better. The fact that this movie was even made, and even more that some big name actors were in it shocked me. I have to say, before seeing this movie, I was excited that there was a \"teen\" movie that wasn't about high school coming out. But unfortunately, this movie has no plot. I've read some of the other user comments that said you would only be able to understand this movie if you were in college, and that the people who didn't like it must have been too young or too old. I could not disagree more. I am in college, and have had a relationship in college and this movie still didn't make sense. This is not about being able to relate, it's just the fact that this movie has no plot and is terribly confusing. For example, the wine scene. Maybe if the audience was let in on what was in each glass, we would be able to understand the importance, but unfortunately we aren't. And the car accident scene? What even happened there? The whole porno sub-plot? I could go on and on... Forget the excuses, this movie was just terrible. Don't waste your time.",
         "First off, you'll notice that in the title of my review nothing about \"great\" is mentioned. As to the good, Freddie Prinze, Jr., who is probably no great shakes as an actor, can pull of this type of movie and character pretty well. He's personable, he knew HOW to be \"cute\", and I'm sure that to many women he seemed very datable...which is perfect for what is, essentially, a \"date movie\". Julia Stiles was \"okay\" here, although -- and I know this is shallow -- her teeth bothered me when she smiled broadly. As to the bad, most of the actors who played supporting roles, with one exception. The exceptions first -- nice to see Henry Winkler here as the father (my good, has it been that long since Fonzie?). But the rest of the supporting actors and their performances here...well, just flush. As to the ugly, the characters that supported the main story line. Not a one to like. Deadbeats. And a movie with a lot of deadbeats doesn't go very far. The story itself is pretty standard -- boy meets girl, boy loses girl, boys wins girl back. The twist here is that the boy is the good one, the girl gets bitchy. The movie was \"cute\" enough to hold my attention...even though I'm 65...but I can hardly give it more than a substandard \"6\". Me thinks the director just just wasn't ready for prime time (and apparently still isn't, based on his credits).",
         "DOWN TO YOU (2000) **SPOILERS** THE GOOD: --There are some enjoyable moments in the film, that mostly come from when it tries to be a little bit different. I think some of the fantasy sequences were cute, like Imogen's baby nightmare and the little Man Show clip, which was actually pretty funny. --It was surprised to see that \"Down to You\" doesn't COMPLETELY follow the teen romcom formula. It was good to see for once that the guy isn't the wrong doer in the relationship that causes the split. Imogen is the one who makes a mistake and quite a shocking mistake at that. I was also surprised, and quite happy, to see that the characters didn't run to each other at the airport at the end of the film and have a kiss that ended the movie. They actually spend some time apart, quite a lengthy part too. It worked nicely, though otherwise \"Down to You\" is formulaic. THE BAD: --I felt nothing for the characters, and was not happy to see that the actors didn't really do much to change these uninteresting and unsympathetic people. Freddie Prinze Jr is annoying as the wimpy Al. Julia Stiles (who I loved in the great \"10 Things I Hate About You\") is surprisingly over-the-top for the most part, though she does have her moments. I just didn't really like her character all that much and it p***ed me off how Al forgave her so easily for all her mistakes. Also, Julia, you have some major talent and are a hottie! What the hell are you doing in Freddie Prinze Jr movies? Become a serious actress damnt! Selma Blair does the best she can with her character who is never paid off but ultimately tries a bit too hard to be sexy. Shawn Hatosy would have to the film's most annoying actor and character; his lame character was both pointless and majorly unfunny. I just kept wondering what the hell the talented Henry Winkler was doing here - he's majorly embarrassing his comedic career. And Ashton Kutcher? You have great comedic talent, but stop picking crap movies! What the hell are you doing in this movie, dude? Your part sucks major ass! --I was so angry to see that \"Down to You\" actually had some potential, sometimes it even looked like it was gonna take a different road and be original and daring. Unfortunately it rarely takes these roads and goes off being another dumb romantic comedy. Who else would've enjoyed seeing the unique aspect of a teenage relationship being cursed by a baby? Or perhaps the hardness of being apart while your partner is away in France? I can't believe how quickly and effortlessly the previous two things I mentioned were resolved, it was obvious the writer just wanted to get to the kiss-and-make-up ending. This movie suffers from an extremely obvious case of lazy writing; it passes up good opportunities for drama in exchange for being predictable and formulaic. --It was aggravating to say the least to see how many clichés were used in the film. This is especially noticeable in those high school date flashback scenes. The nerdy scientist, the hypo/stoner guy and there are many more that I can't really recall because this movie just wasn't at all memorable. But I do certainly remember that there were so many completely unfunny character clichés that seriously drag the film down. RATING: 4/10 - I'll go as far as saying this movie actually had potential in parts, but it throws it away and becomes another disposable teenage romantic comedy. IF YOU LIKED THIS MOVIE I RECOMMEND: 10 Things I Hate About You (8/10) Cruel Intentions (8/10) Drive Me Crazy (3/10) Just Married (5/10) O (9/10)",
         "WARNING: May contain spoilers... I guess I should say right off the bat that teen films are not my bag. I don't know why, its just that overly-sappy stories with 20-somethings playing teenagers has never been my thing. However, I do make exceptions (I'm a \"Breakfast Club\" and \"She's All That\" fan). This film is kind of a departure from teen love/teen comedy, because it focuses on a more adult topic: that's right, it deals with college kids. I only saw a few scenes towards the end first time I saw this, and then the next time it was on TV, I only saw the same scenes. I knew I needed to see this film, but it became rare on the pay-per-view channels I saw the ending on, so I went out and paid $29.99 for the DVD. It's ok--it was worth the price. I was almost single at the time as well (my 1st boyfriend and I were on the outs), and was just turning 18 when I bought this movie. It actually helped me through the break-up--I knew things could be worse. In this spirited 2000 retelling of \"Annie Hall,\" (which I've never seen), a young man and woman find out about love and relationships during their college years. Sophomore Al Connelly (Freddie Prinze Jr.), is a satisfied college sophomore who is studying liberal arts, but wants to be a chef. Freshman Imogen (Julia Stiles) worships artistry, but according to her mother, \"art should only be done on the weekends.\" The two meet in a bar one night (AL: I thought it was a cool place, but that's because they never checked IDs). Al falls for Imogen immediately, sort of like infatuation. The two begin a whirlwind courtship that includes a conversation over cake, psychoanalysis (I'll explain this one better, because its one of my favorite scenes), sleeping together, and just enjoying each other's company. But, the two become distant, and suddenly Al is floored when Imogen dumps him. He suddenly realizes that he needs her to live, and will do anything to get over her, even if it means going to extreme measures. While genuinely a sentimental flick, this is light-hearted and smart. The viewer comes away a little more knowledgable about the opposite sex after seeing this flick. You can see the chemistry between Al and Imogen, and Prinze and Stiles capture the romantic scenes perfectly. The story is told from both of their points of view, which is good, because the story would not work one-sided. Every now and then, the movie would flash forward to either Prinze of Stiles in present day talking about each other, giving their take on everything, as well as a great voice-over track from both during the film. Anyone who has ever experienced love lost could relate to Al, but I don't know (nor have I heard of) anyone who has ever tried to forget their lost love the way Al did (that was an interesting part). The reason this film works is the chemistry. Although I am completely over the moon for Prinze, he is not the only reason I enjoyed this film. It's funny but doesn't try to be silly. It's sentimental, but not too sappy. It's smart, but doesn't over kill us with too much intelligence. It's never stupid, and certainly never dull. This film works, simply put. My favorite scenes in this film are when Al goes to Imogen's dorm room with cake (\"Something sacred,\" he says). The two have a conversation over the cake, which leads to \"psychoanalysis,\" (\"You know, we're prime for psychoanalysis,\" Imogen comments). Al lays on her bed and Imogen asks him questions about his vices (sleeping, beer, wine), he asks about hers (smoking, chocolate, a few others), his past relationships (Faith Keenan--Clepto, Megan Brodski--Cheerleader, Haley Heller-- Scientist), her past relationships (Gabe Stiano--New Age, Ted McGurran--Allergic, and Ricky James--hated by the dog), what they love (him--fish), her (art). They also disclosed their first kisses (shown in humorous flashbacks--his was a woman who dropped a ring when he was 12, hers was her gym partner when she was 11 1/2, who knocked her down with a baksetball). In addition, I liked the opening scene in the coffee shop where Al is observing two young lovers while talking to the camera (\"Reminds me of my relationship, except Imogen never wore that much jewelry, and I wouldn't be caught dead in those shoes.\"), the flashback scenes, the narration, the scene where Al attempts to get over Imogen by drinking shampoo (this actually was the one scene I heard alot about before seeing this movie), and the concluding scene (which I will not give away--its too good). This movie is a must rent/buy for anyone who likes romantic comedies, Freddie Prinze Jr., or Julia Stiles. I'm disappointed that alot of people didn't like this film, nor did it get the box office success it deserved. This film is targeted at teenage and young adults girls, and probably wouldn't interest the general public under the age of 13 or over the age of 25-30. This was a good-intentions film, and a must see for those who are romantically involved, or for a girl's movie night. I've actually owned the DVD for 2 years (2 years as of today, I believe--it was sometime in late October), and the film holds up well with time. Definitely see this film, there's something for everyone!"
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": ["Open City Films"],
      "summaries": [
         "This light-hearted romantic comedy centers tells of love sought, found, lost, and found again, revolving around the lives of two college students in New York City. Sophomore Al Connelly meets the girl of his dreams, freshman Imogen, and true love abounds. The two engage on a whirlwind courtship--they pick a song, eat a cake together, even make love. But Imogen's fear of lost youth causes her to push away from Al, and they go their separate ways. Al attempts to rebound from the relationship, determined to forget Imogen, and he goes to desperate measures to do so. The story is told from the points of view of both Al and Imogen.",
         "Imogen and Al meet at college in New York City when she's a frosh and he's a sophomore. She's a talented artist; he wants to be a chef, following in his father's footsteps. They fall in love, she picks a song for them, they make love. But she fears losing her youth, committing too soon, having a child before she's ready. He's worried that this may be an illusion, not true love. She sleeps with someone else; he's hurt; the relationship ruptures. She leaves for San Francisco; he goes into an alcohol-assisted depression. He even drinks her shampoo, hoping to cure his obsession. Can anything help him recover?",
         "A young man wins and loses the first serious love of his life."
      ],
      "budget": 9000000
   },
   "movielensId": 3225,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "2000-01-21",
      "dvdReleaseDate": "2000-07-11",
      "directors": ["Kris Isacsson"],
      "runtime": 91,
      "movieId": 3225,
      "title": "Down to You",
      "mpaa": "PG-13",
      "actors": [
         "Freddie Prinze Jr.",
         "Julia Stiles",
         "Selma Blair",
         "Shawn Hatosy",
         "Zak Orth",
         "Ashton Kutcher",
         "Rosario Dawson",
         "Henry Winkler",
         "Lucie Arnaz",
         "Lauren German",
         "Zay Harding"
      ],
      "imdbMovieId": "0186975",
      "originalTitle": "Down to You",
      "genres": [
         "Comedy",
         "Drama",
         "Family",
         "Romance"
      ],
      "youtubeTrailerIds": ["tdnZYsDOxfI"],
      "plotSummary": "College coeds in New York City, Al, the son of a celebrity chef, and Imogen, a talented artist, become smitten the second they lay eyes on one another at a bar. However, the road to happiness is not a smooth one. Outside forces, including a predatory porn star who wants to lure Al into her bed, threaten to pull apart the young lovers before their romance has a chance to really flourish.",
      "tmdbMovieId": 10472,
      "avgRating": 2.69151,
      "releaseYear": "2000",
      "numRatings": 1013,
      "posterPath": "/qnT0Lf9ArebC4iGCAajVnWbbqKc.jpg"
   }
}