{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "suspense",
            "id": 9937
         },
         {
            "name": "novelist",
            "id": 155251
         }
      ],
      "imdb_id": "tt0044364",
      "video": false,
      "title": "Another Man's Poison",
      "recommendations": [
         114302,
         51476,
         37183,
         37352,
         33923,
         25550,
         45740,
         65637,
         51146,
         46042,
         73492,
         59101,
         43463,
         86667,
         36461,
         29470,
         35895,
         28490,
         92429,
         4926
      ],
      "backdrop_path": "/gV5Vk4dwiZD3kaFvZ1dfPz7og1c.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "536c26240e0a2647d400c8c3",
         "content": "The Dark Recesses of the Female Mind. \r\n\r\nAnother Man's Poison is directed by Irving Rapper and adapted to screenplay by Val Guest from the play \"Deadlock\" written by Leslie Sands. It stars Bette Davis, Gary Merrill, Emlyn Williams, Anthony Steel and Barbara Murray. Music is by John Greenwood and Paul Sawtell and cinematography by Robert Krasker. \r\n\r\nA whole bunch of fun if expectation levels are correctly set. Another Man's Poison is essentially a one set piece (confirming its stage origins), with primary focus on just five people and a horse. It's a tale of murder, deception and carnal desires, the latter of which is wrung out via Janet Frobisher's (Davis) affair with a much younger man who happens to be the intended of her secretary. \r\n\r\nFrobisher is quite frankly a bitch, something which Davis attacks with relish and no little amount of histrionic camp. She's the fulcrum of the story, but all the other key characters here are either stupid, ignorant, devious or all three in one go! Oh yes, this is a regular hot-bed of people you really wouldn't want to be hanging around with for too long. \r\n\r\nIt's these characterisations that along with Krasker's photography just about earns the pic its film noir badge. The script isn't up to much - where stories about changes being made by Williams and that Davis and Merrill (husband and wife at the time) being unhappy – are common place, but it never outstays its welcome by being boring, and ultimately Bette being batty is always good entertainment. 6.5/10",
         "url": "https://www.themoviedb.org/review/536c26240e0a2647d400c8c3"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Janet Frobisher",
               "gender": 1,
               "credit_id": "52fe4876c3a36847f8168439",
               "name": "Bette Davis",
               "profile_path": "/oWGPnjrIxmGHklOGimoPwvIxBgQ.jpg",
               "id": 3380,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "George Bates",
               "gender": 2,
               "credit_id": "52fe4876c3a36847f816843d",
               "name": "Gary Merrill",
               "profile_path": "/zmZqg96QgZgm5hOgpy627DFIiii.jpg",
               "id": 10608,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Dr. Henderson",
               "gender": 2,
               "credit_id": "52fe4876c3a36847f8168441",
               "name": "Emlyn Williams",
               "profile_path": "/d4FsEe87cEY1AQAeedVmSU7SarO.jpg",
               "id": 66884,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Larry Stevens",
               "gender": 2,
               "credit_id": "52fe4876c3a36847f8168445",
               "name": "Anthony Steel",
               "profile_path": "/o3ssUNAkfs223vu3aHYckZkDhlN.jpg",
               "id": 33547,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Chris Dale",
               "gender": 1,
               "credit_id": "52fe4876c3a36847f8168449",
               "name": "Barbara Murray",
               "profile_path": "/gJy8fzfNkxe9KJKR4mfh2mTT7S1.jpg",
               "id": 107432,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Mr. Bigley",
               "gender": 2,
               "credit_id": "52fe4876c3a36847f816844d",
               "name": "Reginald Beckwith",
               "profile_path": "/16w2j2DPVmWRxhXlap0hoh29pqH.jpg",
               "id": 93164,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Mrs. Bunting",
               "gender": 1,
               "credit_id": "52fe4876c3a36847f8168451",
               "name": "Edna Morris",
               "profile_path": null,
               "id": 148743,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4876c3a36847f8168457",
               "name": "Irving Rapper",
               "profile_path": null,
               "id": 93904,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4876c3a36847f816845d",
               "name": "Val Guest",
               "profile_path": "/99rZHWC9WKCyVgFLpBy1fKDkyLB.jpg",
               "id": 39853,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "556dfe12925141422a000f7f",
               "name": "Julie Harris",
               "profile_path": "/3GkMIV0cb3373xxd5eDba43T909.jpg",
               "id": 10221,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "565fdef0c3a36875e2001df8",
               "name": "Daniel M. Angel",
               "profile_path": null,
               "id": 88661,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "565fdf349251412204000f6c",
               "name": "Daniel M. Angel",
               "profile_path": null,
               "id": 88661,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "565fdf3dc3a36875f1001e0b",
               "name": "Paul Sawtell",
               "profile_path": null,
               "id": 4681,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "565fdf45925141790a001e3f",
               "name": "Robert Krasker",
               "profile_path": null,
               "id": 12720,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "565fdf4e9251417918001caa",
               "name": "Gordon Hales",
               "profile_path": null,
               "id": 29311,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "565fdf56c3a36875f90021b0",
               "name": "Henry Rackin",
               "profile_path": null,
               "id": 1544252,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "565fdf5d9251412204000f78",
               "name": "Cedric Dawe",
               "profile_path": null,
               "id": 24330,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "565fdf719251417904001da8",
               "name": "Cedric Dawe",
               "profile_path": null,
               "id": 24330,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "565fdf7b9251417906001d49",
               "name": "George Fowler",
               "profile_path": null,
               "id": 950393,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "565fdf84c3a36875e9002054",
               "name": "H.C. Pearson",
               "profile_path": null,
               "id": 1544253,
               "department": "Sound",
               "job": "Sound"
            },
            {
               "gender": 0,
               "credit_id": "565fdf8f925141790c001dba",
               "name": "Adrian D. Worker",
               "profile_path": null,
               "id": 932500,
               "department": "Production",
               "job": "Production Manager"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.393897,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 53714,
      "vote_count": 10,
      "budget": 0,
      "overview": "Novelist Janet Frobisher, lives in an isolated house, having been separated for years from her criminal husband. She has fallen in love with her secretary's fiancé and when her estranged husband unexpectedly appears, Janet poisons him, but just as she's about to dispose of the body, one of her husband's criminal cohorts also shows up.",
      "similar": [
         223,
         189,
         949,
         336843,
         910,
         996,
         654,
         1939,
         8834,
         10285,
         845,
         72784,
         9272,
         1923,
         2163,
         9411,
         1645,
         2252,
         2832,
         12162
      ],
      "original_title": "Another Man's Poison",
      "runtime": 90,
      "poster_path": "/vFesdMHDrBZ3XdKWILsbfDLhwpE.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Angel Productions",
         "id": 4079,
         "origin_country": ""
      }],
      "release_date": "1951-11-20",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "She Had Everything You Could Give A Woman To Torment A Man!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Irving Rapper"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Leslie Sands",
         "Val Guest"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0044364/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU0MTMwMDk3Nl5BMl5BanBnXkFtZTcwNjYzNjAwMQ@@._V1_SY317_CR10,0,214,317_AL_.jpg",
      "actors": ["Stars: Bette Davis, Gary Merrill, Emlyn Williams | See full cast and crew »"],
      "reviews": [
         "It's fascinating to watch the wife and husband duo go at each other playing anything but a loving married couple. What makes this, of all of Bette Davis' movies rich is that the set is her own home; and, what a place it is. Not a palace, but a very British type of country home. Davis' & Merrill's acting is superb; the plot is thick; the script worthy of Davis' fantastic articulation & conveyance of attitudes contrary enough to part the Red Sea. Everyone's got their favorite Bette Davis film, if they're a fan of the US classics from Warner Bros.. Mine is this \"Poison...,\" because it's the 4th time the dynamic duo act together but the first time they both have leading roles; it's filmed in their own home which reveals so much about Davis' tastes & I could feel her comfort with the set; the mystery.crime.drama is unsettling; and to the end, I watched wondering how Davis would get out of the ugly situation in which Merrill's held her. There's something very different about this movie because Davis put on the production herself outside of a domineering studio. Considering the year & women's social inferiority in the workplace, even in Hollywood, it's remarkable that Davis pulled \"Poison...\" off so well.",
         "I appreciate this terse movie's smart script, staging, and tight editing, especially upon second viewing. Of course the nosy neighbor veterinarian serves mainly as a plot vehicle, but the role is well acted. Gary Merrill's George Bates seems lacking some refinement of expression. He plays it like an open book, and makes Bates a totally sympathetic character. The story hinges on the power plays between Bates and devious Janet as, chained together by their crimes, they struggle for the upper hand via her scheming and his brute force. Their tortured relationship could have a plausible chance for success, given the plot circumstances, but the secretary's fiancé Larry is in the way, creating a tension that draws the characters to the unhappy climax. Davis is in good form, and this is an entertaining film. Since there is a finite number of Bette Davis films available for viewing in 2006, one has to value each for what it is. Although \"Poison\" may not be in her top 10, Davis is the master, and it is infinitely preferable to experience it than not.",
         "Okay, it's not an Oscar-winner, but this movie is a lot of fun, especially if you're a Bette Davis fan. The setting, a spooky, isolated British mansion, is strongly portrayed; by the end, you really feel like you've spent time some time within the oak-paneled walls. Bette looks just like she did in \"All About Eve\" -- same hairstyle and similar wardrobe, so it's easy to imagine that this could have been a Margo Channing movie. And of course her costar is Garry Merrill, with whom she also starred in \"Eve.\" This was adapted from a stage play, so I think it's interesting to pay attention to the structure and limited changes of location, which are an indicator of its stage pedigree. This one shows up on TCM once in a while; sit back and enjoy.",
         "Another in a long line of Davis' deliciously evil roles. This film has the same feel as \"The Little Foxes\", but with a bit more scenery chewing. I was a little puzzled as to some of the plot developments, but on the whole such things don't mean much when you're watching Davis and Merrill try to outmaneuver each other. I didn't care much for the rest of the cast, but what does it matter? Davis makes it a very satisfying experience.",
         "I'm sure it's all been done before, but if you are a Bette Davis fan like me, then you know that few do it better. A lovely-haired Davis and then-husband Gary Merrill play off of each other alternately uninterestingly or with fireworks, all in the same film. Merrill's performance is pretty uneven. I can't say I've seen too much of his work, but he's usually better than he is here, given the fact that his character is betrayed-angry-man-done-wrong. Here his performance lacks energy. The double-crosses come thick and fast in this one, so the viewer must pay attention to the (sometimes quite good) dialog, or confusion may strike. The other couple in the film, Larry and Chris (Anthony Steel and Barbara Murray) are bland to say the least. Steel is given more to do than Murray, and gives a semi-convincing performance as Bette's toy boy, but the character (as well as Murray's) is underwritten. The film is definitely a Davis vehicle, and she runs with the ball like the pro she is. Murray's lot is mostly stuck in reaction mode, but she does OK with what she has. Goofy-looking Emlyn Williams plays pesty-neighbor-from-hell Dr. Henderson decently, and looks as though he is having a ball doing so. The Mr. Bigley character, representing, I suppose, a colorful local type, comes across as dense and reprehensible. What were the writers thinking there, I wonder. The plot takes elements from various scenarios that we've all seen, and the result is not extremely coherent, yet very entertaining. The directing is great, with some wonderful shots. I enjoyed the film throughout. I especially like the ending, and its retribution \u0096 as Davis' character says (something along the lines of): `thanks, I hadn't thought of that idea, but it'll work out fine.' Oh, the irony. Bottom line: its strengths overcome its weaknesses \u0096 there are much worse ways to spend an hour and a half.",
         "I am getting more and more into Bette Davis' style, which is on fine display in this feature where she plays a mystery writer who gets tangled up in her own sordid tale. Davis kills her own estranged husband and then gets set up by his criminal friend who thinks he can successfully hide under the guise of Bette's unknown husband. This poor character has no idea who or what he is up against when he takes on Bette. For that matter, her poor secretary has no idea either when Bette suddenly decides that she wants her fiance. While I found most of the supporting cast to be quite bland and annoying (the neighbor), the movie does a great job highlighting Bette's talents and is quite enjoyable to watch.",
         "Still fresh from their success and newfound love in \"All About Eve,\" Bette Davis and Gary Merrill made this independent film, \"Another Man's Poison,\" based on a play by Leslie Sands. Davis is Janet Frobisher, a successful mystery writer living in a mausoleum of a house out on the moors. When her husband's partner in a bank robbery comes there looking for him, Frobisher announces that he's in the study - dead from the poison she gave him (medicine intended for her beloved horse, Fury). While they're attempting to dispose of the body, Frobisher's paramour, whom she summoned earlier, arrives with his fiancé (who is also Frobisher's secretary). The bank robber, named George Bates, introduces himself as Frobisher's estranged husband and settles in. This is a neat, atmospheric story with an edgy, vital performance by Davis. Merrill, ruggedly handsome, is appropriately gruff and sinister. Though his character thinks he and Frobisher might really have a chance at playing house, his competition is the very handsome, young Anthony Steel, a popular British matinée idol of the '40s. Emlyn Williams is marvelous as the nosy, annoying veterinarian who keeps stopping by. \"Another Man's Poison\" seems to have been made rather cheaply - the print I saw was not of great quality, and the lighting is on the dark side. Though the setting is somewhat static because it was originally a play, the film is very intriguing, and Davis always worth seeing. Highly recommended.",
         "Real life married couple Bette Davis and Gary Merrill went to the United Kingdom to do this feature film based on a play by Leslie Sands. Another Man's Poison had no run on Broadway so I had no cast in which to compare the movie cast with. I would dearly have loved to know who the original British cast was, that would prove interesting. With her clipped New England speech, Bette Davis like Katharine Hepburn had no trouble doing occasional English roles, Davis in fact did the best of them all, their good Queen Elizabeth on two occasions. Here she's something less than a Queen, she's a willful manipulator of people and events something I'm guessing she picked up in her profession as an Agatha Christie type mystery writer. Before the events of the film start we learn that Bette is estranged from her husband whom none of the villagers in the small hamlet in the United Kingdom have met. She says he's in Malaya growing rubber on a plantation, but in fact he's a bank robber and he came there looking for her to give him shelter and a hideout. Instead because she's got big eyes for Anthony Steel, the fiancé of her secretary Barbara Murray she kills her husband and hides the body. When to start the action in walks Gary Merrill her husband's accomplice in the robbery and also a wanted man. When the local veterinarian Emlyn Williams comes to call Merrill pretends he's long lost husband and Davis backs him up. Which starts a relationship of convenience for both Davis and Merrill both stuck with each other, but both needing each other to some degree. But with Bette manipulating to trap Steel at the same time the whole situation just simmers to a boil in the end. Best in the cast is Emlyn Williams. His veterinarian comes over like a country bumpkin, but he's really quite astute, almost like a rural English Columbo. Over here they would have the veterinarian the lead in a television series. Not top drawer Bette Davis, but in fact her bravura acting style carries this film over some rough patches. Another, a lesser actress might have not done as much with the material, but Bette Davis certainly could and did.",
         "In New Yorkshimore, the adulterous writer of mystery novels Janet Frobisher (Bette Davis) is surprised by the stranger George Bates (Gary Merrill) that is waiting for her inside her isolated house nearby a lake seeking out her husband George Preston. Bates tells Janet that her husband and he had robbed a bank; however her husband panicked in the heist and shot a guard. Janet tells that she is alone and surprisingly reveals that she had poisoned her husband and shows his body in the office. Out of the blue, her nosy next door neighbor Dr. Henderson (Emlyn Williams) pays a visit to her and George introduces himself as Janet's estranged husband that was traveling in Himalaya. Then they decide to dump the body in the lake, but Janet's secretary Chris Dale (Barbara Murray) and her fiancé and Janet's lover Larry Steven (Anthony Steel) arrive for the weekend and George dispose the corpse alone. Along the next days, the situation becomes tense with the quartet while Dr. Henderson snoops the house. When George kills Janet's horse Fury, the cynical writer plots a plan to gets rid of the inconvenient George. \"Another Man's Poison\" is a theatrical film shot practically in one location with a plot about murder and adultery that is indeed a witty mouse-and-cat game. The fantastic Bette Davis plays the role of a devilish selfish woman that only loves her horse Fury. Emlyn Williams performs an irritating character and only in the end there is an explanation for his annoying attitude. The conclusion is ironic and the black-humor is moralist in a certain viewpoint. My vote is seven. Title (Brazil): \"Mulher Maldita\" (\"Damned Woman\")",
         "Another Man's Poison is directed by Irving Rapper and adapted to screenplay by Val Guest from the play \"Deadlock\" written by Leslie Sands. It stars Bette Davis, Gary Merrill, Emlyn Williams, Anthony Steel and Barbara Murray. Music is by John Greenwood and Paul Sawtell and cinematography by Robert Krasker. A whole bunch of fun if expectation levels are correctly set. Another Man's Poison is essentially a one set piece (confirming its stage origins), with primary focus on just five people and a horse. It's a tale of murder, deception and carnal desires, the latter of which is wrung out via Janet Frobisher's (Davis) affair with a much younger man who happens to be the intended of her secretary. Frobisher is quite frankly a bitch, something which Davis attacks with relish and no little amount of histrionic camp. She's the fulcrum of the story, but all the other key characters here are either stupid, ignorant, devious or all three in one go! Oh yes, this is a regular hot- bed of people you really wouldn't want to be hanging around with for long. It's these characterisations that along with Krasker's photography just about earns the pic its film noir badge. The script isn't up to much - where stories about changes being made by Williams and Davis and Merrill (hubbie and wife) being unhappy \u0096 are common place, but it never outstays its welcome by being boring and Bette being batty is always good entertainment. 6.5/10"
      ],
      "genres": [
         "Crime",
         "Drama",
         "Film-Noir"
      ],
      "productionCompanies": ["Angel Productions"],
      "summaries": [
         "Mystery writer Janet Frobisher lives alone in a dark English country house, when she's not philandering with her secretary's fiancée. At an extremely awkward moment, she has an unwelcome visitor: George Bates, who claims to be the partner in crime of Janet's estranged husband. George insinuates himself into Janet's home and life despite her efforts to get rid of him; the tangled relationships develop into a macabre, murderous cat-and-mouse game.",
         "In an isolated house, mystery writer Janet Frobisher is involved in potentially murderous relationships."
      ],
      "budget": 0
   },
   "movielensId": 3229,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1951-11-20",
      "dvdReleaseDate": "2000-01-11",
      "directors": ["Irving Rapper"],
      "runtime": 90,
      "movieId": 3229,
      "title": "Another Man's Poison",
      "mpaa": null,
      "actors": [
         "Bette Davis",
         "Gary Merrill",
         "Emlyn Williams",
         "Anthony Steel",
         "Barbara Murray",
         "Reginald Beckwith",
         "Edna Morris"
      ],
      "imdbMovieId": "0044364",
      "originalTitle": "Another Man's Poison",
      "genres": [
         "Crime",
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Novelist Janet Frobisher, lives in an isolated house, having been separated for years from her criminal husband. She has fallen in love with her secretary's fiancé and when her estranged husband unexpectedly appears, Janet poisons him, but just as she's about to dispose of the body, one of her husband's criminal cohorts also shows up.",
      "tmdbMovieId": 53714,
      "avgRating": 3.23333,
      "releaseYear": "1951",
      "numRatings": 30,
      "posterPath": "/vFesdMHDrBZ3XdKWILsbfDLhwpE.jpg"
   }
}