{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0011652",
      "video": false,
      "title": "The Saphead",
      "recommendations": [
         61525,
         43601,
         33015,
         375282
      ],
      "backdrop_path": "/4jF2NsesfiiNj8tvmEWd9SdQbGi.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Reverend Murray Hilton",
               "gender": 0,
               "credit_id": "52fe47f1c3a36847f8150701",
               "name": "Edward Jobson",
               "profile_path": null,
               "id": 144048,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Agnes Gates",
               "gender": 0,
               "credit_id": "52fe47f1c3a36847f8150705",
               "name": "Beulah Booker",
               "profile_path": null,
               "id": 144049,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Mr. Musgrave",
               "gender": 2,
               "credit_id": "52fe47f1c3a36847f8150709",
               "name": "Edward Connelly",
               "profile_path": null,
               "id": 144050,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Watson Flint",
               "gender": 0,
               "credit_id": "52fe47f1c3a36847f815070d",
               "name": "Edward Alexander",
               "profile_path": null,
               "id": 144051,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Mark Turner",
               "gender": 2,
               "credit_id": "52fe47f1c3a36847f8150711",
               "name": "Irving Cummings",
               "profile_path": null,
               "id": 129422,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Bertie Van Alstyne",
               "gender": 2,
               "credit_id": "52fe47f1c3a36847f8150715",
               "name": "Buster Keaton",
               "profile_path": "/8weZnW4cxkbMxtFAtO1NhfTrM9D.jpg",
               "id": 8635,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47f1c3a36847f81506eb",
               "name": "Herbert Blaché",
               "profile_path": "/o3Q1YGXrfr9KTkxaMkaZUUEbs4A.jpg",
               "id": 144044,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe47f1c3a36847f81506f1",
               "name": "Winchell Smith",
               "profile_path": null,
               "id": 144045,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe47f1c3a36847f81506f7",
               "name": "Bronson Howard",
               "profile_path": null,
               "id": 144046,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 0,
               "credit_id": "52fe47f1c3a36847f81506fd",
               "name": "Victor Mapes",
               "profile_path": null,
               "id": 144047,
               "department": "Writing",
               "job": "Theatre Play"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 0.809817,
      "production_countries": [],
      "id": 51392,
      "vote_count": 8,
      "budget": 0,
      "overview": "Nick Van Alstyne owns the Henrietta silver mine and is very rich. His son Bertie is naive and spoiled. His daughter Rose is married to shady investor Mark. Mark wrecks Bertie's wedding plans by making him take the blame for Mark's illegitimate daughter. Mark also nearly ruins the family business by selling off Henrietta stock at too low a price. Bertie, of all people, must come to the rescue on the trading floor.",
      "similar": [],
      "original_title": "The Saphead",
      "runtime": 77,
      "poster_path": "/n1i7g4dGkV6oKxPpFJJYk2gVhh4.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1920-09-01",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": [
         "Herbert Blaché",
         "Winchell Smith"
      ],
      "runtime": 77,
      "synopsis": null,
      "writers": [
         "Bronson Howard",
         "Victor Mapes"
      ],
      "originalLanguage": null,
      "imdbLink": "http://www.imdb.com/title/tt0011652/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI5NTc0ODAzMF5BMl5BanBnXkFtZTYwNTU3NDg4._V1_SY317_CR9,0,214,317_AL_.jpg",
      "actors": ["Stars: Edward Jobson, Beulah Booker, Edward Connelly | See full cast and crew »"],
      "reviews": [
         "The problem with this film is that it not a slapstick comedy and was never intended to be one, so if you are going to watch it forget about Buster Keaton, the comedian and look at Buster Keaton, the actor. Keaton is a revelation in this film, his performance is restrained and excellent proving that he was an actor as well as a comedian, a fact that makes his middle years even more sadder, truly a talent wasted by the studio system of the 30's. I'd like to add that Keaton had no problems adjusting to talkies, as commonly assumed, he had a fine speaking voice and could deliver a comic line perfectly, the problem lay with him losing control of his productions and being given poor quality material to work with, he never lost his talent as widely believed. All the performances in this little gem of a movie are first class especially Irving Cummings and William H Crane as well as Keaton's. This is a nice way to spend an hour, but, the final twenty minutes are the best as it is plain to see Keaton's contribution in the scenes in the Stock Exchange as Bertie runs around manically saying \"I take it\", but, not really knowing why. For many people, their only experience of silent movies is slapstick comedy, so I would say broaden your horizons and start with this one.",
         "Keaton plays a character that is somewhat bewildered by life-he meets the wrong train, he asks permission to quit winning at gambling, he is even inept in getting arrested. All is done with his deadpan expression and his intense eyes. This combination of innocence adrift in a life of circumstances provides Keaton with ample humorous moments. At times, I found the comedy to be somewhat muted; yet the pacing was well done and the stock market scenes are thoroughly delightful. `The Saphead' is not on a par with `The General', \u0091Sherlock, Jr.', or `Seven Chances', but the film has its share of riches for the viewer.",
         "This isn't a Buster Keaton film; it's merely a film starring Keaton. Having Keaton star in this feature-length, supposedly more-serious film (as opposed to the short comedies Keaton himself made) was a shrewd business move by Joseph Schenck, to boost Keaton's popularity for his upcoming projects, especially among the critics. It's an ironic twist that today \"The Saphead\" is only as widely circulated as it is because of its association to Keaton. Keaton was one of the greatest screen comedians and, at times, was an innovative filmmaker. Sapheads, however, made this film. The light melodrama is worthless, and I think the comedy isn't funny. To have Keaton only act as a good-natured idiot is to limit and waste his talents. The film itself is a filmed play, with yappy intertitles and an awkward mix of melodrama and comedy, none of which works. Keaton understood comedy--the gags, timing and momentum. Watch Keaton's best films (even his lesser ones) and you can see the huge difference between them and this--how and why they are funny and this isn't. Keaton also knew that cinema isn't theatre, that intertitles should be used economically in silent film, and he knew how to parody melodrama to mix cohesively within a comedy. \"The Saphead\" can be, at least, instructive in demonstrating how good Keaton's films are. (Note: Some scenes are slightly damaged.)",
         "While it is certainly not up to the standard of the later films that Keaton would direct and/or write himself, \"The Saphead\" is still a nice little film, and the last part is excellent, a sign of things to come. It would be worth watching for the last 20 minutes alone, and the first part is not bad either, just old-fashioned and sometimes a bit slow. Keaton plays Bertie, the timid son of a rich businessman. Most of the film involves the business and romantic difficulties of Bertie, his sister, and his brother-in-law. It's slow at times, with some melodrama and a fair amount of mild humor but not a lot of really funny material. It's a decent story of the kind common to silent films, is usually pleasant to watch, and is important as the prelude and setup to the climax. In the last part of the film, Bertie joins the stock exchange, and all the story lines come together in a creative and very entertaining sequence that finally gives Keaton a chance to display his great variety of comic skills. If you enjoy Keaton's other films, this one is not up to their level, but it is still worth watching.",
         "If there is any humor in this movie, it is carefully concealed. Buster Keaton gives an energetic performance in what is otherwise a dubious attempt at self-effacing humor. Now, under certain circumstances self- effacing humor can be effective but not in this movie. The story is contrived, and Mr. Keaton's character is so shallow that one must wonder why anyone would pay him any attention at all. Irving Cummings and William Crane carry this movie. They give strong dramatic performances. Mr. Keaton's attempt at humor through deadpan is out of place in this movie. It simply is not funny. It does not generate laughs. Nor is his character particularly lovable. His character, Bertie, is spoiled and shallow. His love interest with the female lead is strained and entirely implausible. The plot is predictable. The movie does have some effective moments, such as when the Crane and Cummings characters confront each other and the frantic scenes of trading on the floor of the stock market, but otherwise the movie's value lies mostly in the its status as a quaint antique of movie making from a bygone era.",
         "He's rich, he's a bit lazy, he gets the girl in the first half-hour, he even smiles a bit. It's not the Buster Keaton you expect. But he's still Keaton, and even if his first feature film creaks a good deal, he keeps you entertained. \"The Saphead\" presents the story of Bertie Van Alstyne (Keaton), son of Wall Street tycoon Nicholas Van Alstyne (William H. Crane). Bertie lives a life of Manhattan luxury but secretly pines for the beautiful Agnes (Beulah Booker), who secretly pines for Bertie in turn. Happiness appears at hand until a strange turn of events shatters their union. A 1920 production of a hit stage play, \"The Saphead\" was designed to fit audience conventions of the day, not showcase Keaton's still-emerging comic persona. Sentiment and improbable coincidences run rampant here. Given that, it's impressive how well the Keaton we would come to know is presented. He is given many chances to present his clownish athleticism, as well as that expressionless-yet-not-emotionless manner that has beguiled film lovers for decades. Was Herbert Blaché, the credited director, preternaturally wise to Keaton's style? Or did Keaton just know how to get his way even before he enjoyed full control of his features? The problem with \"The Saphead\" is not Keaton, but its construction. In the first ten minutes, we are introduced to everyone in the film except Bertie, and given background about an adulterous affair that is then dropped for the Bertie story. Forty-five minutes in the two story lines come together, and in such a convoluted way as to beggar belief. Bertie is somehow pressed into taking the blame for the affair, even though it's obvious his brother-in-law is the guilty party. Cue violins. A lot of \"The Saphead\" works toward this kind of sentimental dithering, even the Keaton parts, which get a bit strange. Bertie confesses his love to Agnes accidentally, when he tells his sister Rose about it. (Since Nicholas Van Alstyne adopted Agnes, doesn't that make her Bertie's sister, too?) Agnes is standing right there, though, and gives Bertie a bit of a shock before he recovers and takes her hand. This is strictly Buster for the old ladies. The best way of watching \"The Saphead\" is as a couple of clever Keaton shorts with workmanlike connecting material. The first short would be Bertie's attempt to live a wastrel life, not because his heart is in it, but because he believes the modern woman \"prefers sports to saints\". To this end, in a great bit of physical comedy, Bertie tries to get arrested when his speakeasy is raided even though he successfully bribed a detective without knowing it. Every time he tries to enter the paddy wagon, someone pushes him back out. The second short would be Bertie making his way on Wall Street in the last 20 minutes, overdressed in top hat, frock coat, and spats, being razzed by the other brokers. This culminates in a scene of wild physical comedy where Keaton runs around the trading floor, jumping on people and unknowingly buying up shares in his father's precious mine. The Kino DVD I saw this on also has two shorts Keaton made at the same time, \"The High Sign\" and \"One Week\", which display Keaton as both director and star, and in much sharper form. \"The Saphead\" lacks the inventiveness of those shorts, but it works off-and-on as period entertainment thanks to Keaton and a good supporting cast. Booker is a typically shy Keaton-film beauty who delivers her scenes with grace. Crane has a fine comic moment sending his disgraced son off with a check for one million dollars \"and not a penny more!\" It's not great cinema, but it's the start of great cinema, showing some the conventions of the time Keaton would do his part to break, and other conventions he would observe, en route to glory.",
         "Something like The Saphead isn't what you would expect to be Buster Keaton's feature film debut. The whole thing seems too ordinary, too stagey and melodramatic to be so. This is due to the fact that The Saphead was not a Keaton-helmed project; he was suggested for the role of the rich young man Bertie by Douglas Fairbanks, who had previously played the role on Broadway. Bertie is the first of the spoiled, clueless young man types that Keaton would later return to in The Navigator and Battling Butler. He seeks to impress a sweet young woman named Agnes by coming across as a bad boy, gambling well into the morning hours and having breakfast in the afternoon. His father confronts him about this behavior and has him cut off until he can find a job. Bertie seeks out to do just that, in the meantime winning the hand of his girl-- well, almost. During the ceremony, his sister's slimy husband Mark receives letters from his recently deceased mistress Henrietta, asking him to take care of their illegitimate child. His secret about to be revealed, he presses the letters on Bertie, breaking Agnes' heart and bringing the union to an abrupt end. Fortunately, things manage to pick back up after Bertie unwittingly saves the family stock business. While there are a few Keaton-esque moments every now and then, for the most part The Saphead is just a typical stage to film adaptation of the period. Unlike the films Keaton would later star in and direct, this picture lacks spontaneity and laughs. The action on screen never comes alive until the climax, when Keaton finally gets to jump and be thrown around as he dashes through the trading floor and saves the day. The entire movie isn't a bore, however, and there are a few humorous inter-titles and gags, but it's just doesn't have a story that seems to suit the particular talents of its main star.",
         "Buying? Selling? No, I'm waiting for the crash----7/10 Although somewhat maligned by the multiple story lines and slow paced drama of the film, 'The Saphead' is saved from its own mediocrity by an incredible ending sequence that has Buster running, jumping and practically flying around the New York Stock Exchange. In defense of the film, the part that Buster plays, Bertie 'The Lamb' Van Alstyne, was not written with Buster, or his brand of comedy in mind. The Saphead is a remake of the Douglas Fairbanks film 'The Lamb', which was released roughly five years before. Having Buster come in to do 'his thing' makes this film unforgettable, but in no way nearly as good as the films he would go on to make independently. Besides the wonderful ending, the opening credits were very creative. But 'The Saphead' turns out to be nothing more than two bookends holding up some dated and dusty romance novels. 7/10. Clark Richards",
         "A bit old fashioned for today's standards this little gem manages to hold our interest for the very young but very talented comic genius Keaton. Before he would go on writing and/or directing his greatest movie Keaton acted in this role of the multimillionaire son of a Wall-Street broker, unprepared to meet the demands of the world but very good natured on the other hand. One of the first images that made me laugh was when we see his picture in which he appears as utterly confused of what's going on before him. What I always appreciated at Keaton was his talent to appear completely out of tune with the world surrounding him. For the rest of the world he seems \"goofy\" but it is seen at close analysis that it may be the world that is paradoxical and confused and so Buster's reaction to it seems justified. The cinematography and direction are nothing special and the story is just another nice and sweet romance with a touch of humor that was very common in the twenties. The best part of the movie is, arguably, the last twenty minutes or so when Keaton, who bought a seat on the floor with 100 thousand $ because \"furniture is expensive nowadays\", battles the lions on Wall-Street literally. This is a great episode, anticipation of great things to come with its use of physical humor and slapstick as metaphors for deeper ideas.",
         "As melodrama THE SAPHEAD is competent. It's surprising that Keaton was cast in it as he gets hardly any opportunity for inserting gags. It's almost a case of miscasting. This Metro 78 minute feature contains only a few inspired moments: the cast appearing before the film in cameo silhouettes which come to life; Buster meeting the wrong train; Buster failing to get arrested despite many attempts during a gambling raid; and his final acrobatic leaps, slides, runs on the floor of the New York Stock Exchange. The KINO video print is in pristine condition- sharp and without flaws. It is tinted and features a full orchestral score. The only value the film has is for die hard Keaton fans - and Kino's copy features two of his best shorts to guarantee the sale - THE HIGH SIGN and ONE WEEK."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Metro Pictures Corporation"],
      "summaries": [
         "Nick Van Alstyne owns the Henrietta silver mine and is very rich. His son Bertie is naive and spoiled. His daughter Rose is married to shady investor Mark. Mark wrecks Bertie's wedding plans by making him take the blame for Mark's illegitimate daughter. Mark also nearly ruins the family business by selling off Henrietta stock at too low a price. Bertie, of all people, must come to the rescue on the trading floor.",
         "The simple-minded son of a rich financier must find his own way in the world."
      ],
      "budget": 0
   },
   "movielensId": 3231,
   "movielens": {
      "languages": [""],
      "releaseDate": "1920-09-01",
      "dvdReleaseDate": "2000-01-11",
      "directors": [
         "Herbert Blaché",
         "Winchell Smith"
      ],
      "runtime": 77,
      "movieId": 3231,
      "title": "The Saphead",
      "mpaa": "",
      "actors": [
         "Edward Jobson",
         "Beulah Booker",
         "Edward Connelly",
         "Edward Alexander",
         "Irving Cummings",
         "Buster Keaton"
      ],
      "imdbMovieId": "0011652",
      "originalTitle": "The Saphead",
      "genres": [
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Nick Van Alstyne owns the Henrietta silver mine and is very rich. His son Bertie is naive and spoiled. His daughter Rose is married to shady investor Mark. Mark wrecks Bertie's wedding plans by making him take the blame for Mark's illegitimate daughter. Mark also nearly ruins the family business by selling off Henrietta stock at too low a price. Bertie, of all people, must come to the rescue on the trading floor.",
      "tmdbMovieId": 51392,
      "avgRating": 2.88462,
      "releaseYear": "1920",
      "numRatings": 26,
      "posterPath": "/n1i7g4dGkV6oKxPpFJJYk2gVhh4.jpg"
   }
}