{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "musical",
         "id": 4344
      }],
      "imdb_id": "tt0062281",
      "video": false,
      "title": "Smashing Time",
      "recommendations": [],
      "backdrop_path": "/7gTv3ZczdLdoTuO7SyY5vRSPArJ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Brenda",
               "gender": 1,
               "credit_id": "52fe4ad8c3a36847f81e4c01",
               "name": "Rita Tushingham",
               "profile_path": "/mXMfNP2gx26pww7D19zZdqaqi5g.jpg",
               "id": 47754,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Yvonne",
               "gender": 1,
               "credit_id": "52fe4ad8c3a36847f81e4c05",
               "name": "Lynn Redgrave",
               "profile_path": "/jnXKuScyfE4zZ5AqBpmrVBMKeVz.jpg",
               "id": 29791,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Tom Wabe",
               "gender": 2,
               "credit_id": "52fe4ad8c3a36847f81e4c09",
               "name": "Michael York",
               "profile_path": "/hW0uWJtsKWsWAQ9k7EYq9sn5YCH.jpg",
               "id": 13919,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Charlotte Brillig",
               "gender": 0,
               "credit_id": "59bc5023c3a3681b6e000eff",
               "name": "Anna Quayle",
               "profile_path": "/ssTCsy7bGlavOGQyGkLPYMrYRzc.jpg",
               "id": 10599,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Mrs Gimble",
               "gender": 1,
               "credit_id": "59bc5031c3a3681bc0000f4b",
               "name": "Irene Handl",
               "profile_path": "/ydgfpIXL3Abx8wf0qpJue9QztG1.jpg",
               "id": 79641,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Bobby Mome-Rath",
               "gender": 2,
               "credit_id": "59bc5044925141354a000fe0",
               "name": "Ian Carmichael",
               "profile_path": "/jmROtgYAT33XQnn5pXFuY8OibVU.jpg",
               "id": 39025,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Jeremy Tove",
               "gender": 2,
               "credit_id": "59bc505392514135610010bd",
               "name": "Jeremy Lloyd",
               "profile_path": null,
               "id": 91722,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Toni",
               "gender": 0,
               "credit_id": "59bc505fc3a3681b6e000f80",
               "name": "Toni Palmer",
               "profile_path": null,
               "id": 1343575,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Irishman",
               "gender": 0,
               "credit_id": "59bc506d925141350b00113c",
               "name": "George A. Cooper",
               "profile_path": null,
               "id": 101985,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Dominic",
               "gender": 2,
               "credit_id": "59bc50f99251413506001197",
               "name": "Peter Jones",
               "profile_path": "/ulhvhkxwHUWYnA8cd7NxAw6TFbq.jpg",
               "id": 95093,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Cafe Boss",
               "gender": 2,
               "credit_id": "59bc5106c3a3681bd4001168",
               "name": "Arthur Mullard",
               "profile_path": null,
               "id": 132102,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "1st Waiter",
               "gender": 0,
               "credit_id": "59bc511392514135060011c1",
               "name": "Ronnie Stevens",
               "profile_path": null,
               "id": 94837,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Sweeney Todd Manager",
               "gender": 0,
               "credit_id": "59bc5122925141356100122d",
               "name": "John Clive",
               "profile_path": null,
               "id": 117548,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Caretaker",
               "gender": 2,
               "credit_id": "59bc51a2c3a3681bae0011b5",
               "name": "David Lodge",
               "profile_path": "/bDpQN4iXuGRIhpFxmdkbBuLnTqQ.jpg",
               "id": 95125,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "1st Exquisite",
               "gender": 2,
               "credit_id": "59bc51b99251413561001334",
               "name": "Murray Melvin",
               "profile_path": "/qaCr8aNv6rHoWfonVjsAii5lNiM.jpg",
               "id": 31722,
               "order": 14
            },
            {
               "cast_id": 18,
               "character": "Tramp",
               "gender": 2,
               "credit_id": "59bc51cac3a3681bd40012c4",
               "name": "Sydney Bromley",
               "profile_path": "/3uUJyYHgedK6K7BLz5RtZ4xpCjg.jpg",
               "id": 12693,
               "order": 15
            },
            {
               "cast_id": 19,
               "character": "DJ",
               "gender": 0,
               "credit_id": "59bc51d4c3a3681b580011c8",
               "name": "Mike Lennox",
               "profile_path": null,
               "id": 1888679,
               "order": 16
            },
            {
               "cast_id": 20,
               "character": "Custard Pie Vicar",
               "gender": 2,
               "credit_id": "59bc51e3c3a3681b97001428",
               "name": "Cardew Robinson",
               "profile_path": null,
               "id": 95254,
               "order": 17
            },
            {
               "cast_id": 21,
               "character": "Demolished Old Lady",
               "gender": 0,
               "credit_id": "59bc51f6c3a3681bae001250",
               "name": "Amy Dalby",
               "profile_path": null,
               "id": 232655,
               "order": 18
            },
            {
               "cast_id": 22,
               "character": "Tove's Secretary",
               "gender": 1,
               "credit_id": "59bc5210c3a3681b6e001245",
               "name": "Valerie Leon",
               "profile_path": "/25R8c5NDN8nOAPHP0kLgQuoZMyX.jpg",
               "id": 95099,
               "order": 19
            },
            {
               "cast_id": 23,
               "character": "Builder",
               "gender": 0,
               "credit_id": "59bc521cc3a3681b5800123e",
               "name": "Geoffrey Hughes",
               "profile_path": "/2Ws1uPBrIGDmhn6QsvSyxbtUVcm.jpg",
               "id": 86107,
               "order": 20
            },
            {
               "cast_id": 24,
               "character": "Actress at Movie Premiere",
               "gender": 1,
               "credit_id": "59bc524f9251413506001419",
               "name": "Veronica Carlson",
               "profile_path": "/wxz4oycwo9pNio5LFJyM5qAQGod.jpg",
               "id": 30140,
               "order": 21
            },
            {
               "cast_id": 25,
               "character": "Beatnick (uncredited)",
               "gender": 2,
               "credit_id": "59bc525ec3a3681bd40013d0",
               "name": "David Essex",
               "profile_path": "/ujreHJ554MzuvqPV2StpSwRXWrf.jpg",
               "id": 96407,
               "order": 22
            },
            {
               "cast_id": 26,
               "character": "Hall Porter (uncredited)",
               "gender": 2,
               "credit_id": "59bc527e925141354a0013a5",
               "name": "Howard Marion-Crawford",
               "profile_path": "/aa4ybmdTFaOgDhtfzUbM1onE35k.jpg",
               "id": 32119,
               "order": 23
            },
            {
               "cast_id": 27,
               "character": "Beatnik (uncredited)",
               "gender": 2,
               "credit_id": "59bc5289925141350600147e",
               "name": "David Essex",
               "profile_path": "/ujreHJ554MzuvqPV2StpSwRXWrf.jpg",
               "id": 96407,
               "order": 24
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4ad8c3a36847f81e4bf7",
               "name": "Desmond Davis",
               "profile_path": null,
               "id": 64823,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4ad8c3a36847f81e4bfd",
               "name": "George Melly",
               "profile_path": null,
               "id": 1049433,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.499792,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 110479,
      "vote_count": 2,
      "budget": 0,
      "overview": "Two young women arrive in London to make it big in show business, and become corrupted by money and fame in the process.",
      "similar": [
         872,
         812,
         224141,
         38757,
         11224,
         10530,
         11970,
         11631,
         703,
         46195,
         196867,
         114,
         134,
         18947,
         19404,
         194662,
         254470,
         353616,
         342473,
         354912
      ],
      "original_title": "Smashing Time",
      "runtime": 96,
      "poster_path": "/zKv2QBtECfPfkvoanuFBP4kurGO.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1967-12-20",
      "vote_average": 4.8,
      "belongs_to_collection": null,
      "tagline": "Two Girls Go Stark Mod!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Desmond Davis"],
      "runtime": 96,
      "synopsis": null,
      "writers": ["George Melly"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0062281/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU4NzQwODAxN15BMl5BanBnXkFtZTcwNTMwNjkxMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Rita Tushingham, Lynn Redgrave, Michael York | See full cast and crew »"],
      "reviews": [
         "I was living in London when this film opened, and it now seems an oddly accurate time capsule of the period, somewhere between trendy and tatty. Critics hated the film for trying to create a female Laurel and Hardy, but now it's the colours, the clothes and the attitude that seems right (although it's hard to forgive those helium-voiced gay stereotypes). Trivia note; the character names and places, pieced together, form most of the first verse of 'Jabberwocky', suggesting the intention to create a new Alice in Wonderland.",
         "I can't believe Leonard Maltin dissed this picture -- it's a rare gem of trippy brilliance, influential as hell on arbiters of style like \"Absolutely Fabulous\" and the \"Austin Power\" series. Lynn Redgrave (!), fresh out of \"Georgy Girl\", bumbles through looking like a great big blonde lovable cow in a succession of astonishing wigs, while her costar Rita Tushingham (!!) veers back and forth from frumpy/frowny to slapstick/mime to The Face of the 60's. The humor is broad and scatological, but cutting when its satire -- sample song lyric: \"I can't sing, but I'm young!!\" If you can find it, grab it.",
         "Shortly after seeing this film in 1991 I was offered my 'dream' job and found myself heading down from the north to live in London for the first time. Just like the two girls in this crazy movie. I loved this when I first saw it. And when I watch it now, it also captures some of the excitement that I felt back in '91. London is a magical place with a unique feel. I was on a 'high' for the first few months, with a tingle down my spine whenever I walked around famous places. Even now I can't walk down Carnaby Street without visualising Lynn Redgrave skipping down it in the fast-cut musical sequence in Smashing Time. Many of the songs are, to be honest, quite bad. But they are also rather catchy and so stick in the mind. There are many satirical swipes at the culture of the time. The photographer (Michael York) is David Hemmings in Blow Up. Rita Tushingham is the model Twiggy and Lynn Redgrave is pop star Helen Shapiro. The TV show is Candid Camera. The '60's slang is also set up. The girls search for a 'switched on' pad and Anna Quayle runs a shop called 'Too Much'. When Rita Tushingham asks if customers won't be put off by the name (in the sense that the goods are 'too' expensive) the true meaning of the phrase is explained to her. The goods are just 'too much' (ie. mind blowing). John Clive is at his best as the rather camp and slightly Jewish owner of Sweeney Todd's pie restaurant. The pie fight itself is well executed with some neat comic touches, such as the 'queen' who shoots himself when his fashionable suit is hit by a flying pie. Indeed, Smashing Time is something of a gay cult classic. Murray Melvin appears as a gay character (as he did a few years earlier in A Taste of Honey, again with Rita Tushingham). Other familar faces of the period include Arthur Mullard, Irene Handl and Ian Carmichael and there are interesting glimpses of locations as they were 30 years ago -- including the railway station at St. Pancras. This is definitely a film you will want to watch again and again. You'll never tire of the musical and comic set pieces. Unfortunately it is very rarely shown on TV in Britain. I haven't seen it on terrestrial TV since 1991 and it is not currently available on either video or DVD in the UK. G.",
         "Swinging London produced more good music than film, if you ask me, but this anarchistic comedy falls among the better productions of the era. Writer George Melly (who apparently also appeared in Makaveyev's Sweet Movie) presents a wild series of episodes structured around a marginal narrative. Gum snapping Lynn Redgrave and big-eyed Rita Tushingham relocate from their small rural town to happening London and instantly their life savings get stolen. When they're unable to pay for their slap-up breakfast, Tushingham quickly secures a job washing dishes and just as quickly loses it after an impromptu paint and food fight. Meanwhile, Redgrave has secured jobs as nightclub hostesses. Seedy customer Ian Carmichael picks up Redgrave but Tushingham succeeds in saving her friends' chastity. Trendy fashion photographer Michael York somehow enters the scene by capitalizing off a humiliating picture of Redgrave, then instigating a pie fight at her new workplace (a restaurant that only serves pies, natch). When the girls return to their house, they find it has been destroyed as part of a TV prank and fortuitously receive 10,000 pounds in return. And this is when the story really explodes. Redgrave uses the money to sponsor her career as pop artist, which explodes overnight. There's a brilliant recording studio sequence that takes a hefty stab at prefabricated artistic product: Redgrave's song sounds terrible while recorded but excellent in playback. Concurrent to Redgrave's rise to stardom, awkward Tushingham achieves equal fame as a fashion model for new boyfriend York, and the two friends begin to despise one another. Smashing Time proceeds with a number of parties, destructive humor and a passable conclusion. Throughout the film, non-diagetic narrative songs document the characters' moods. This unusual device and other creative moments, including a dandy so distraught by getting pied that he commits suicide, evidence an adventurous force behind the script. Indeed, director Desmond Davis barely makes his presence felt. Unlike most films driven by the written word, this film's script would allow for a great finished product with any director with an adequate budget. Storytelling, after all, needs act as film's primary purpose and thus occasionally a film such as Smashing Time indicates that the director does not necessarily need to act as a film's primary author. This film also offers a valuable historic treatment of London during a particularly unique phase. Then well-known psych group Tomorrow show up all over the film, possibly as a stab at authenticity but effective if so. Nevertheless, their music does not actually appear in the movie; we're treated instead to a few songs by the undeservedly less famous group Skip Bifferty.",
         "look, if you are looking for deep meaning - or songs that make you want to sing along, then you're looking in the wrong place. but if you want a kitschy look (i bet even at the time of release!) at the mid-sixties, then look no further! come on! lynn redgrave as a pop-starlet? rita tushingham as a supermodel?? michael york as a photog???? what could be better??? the scenes of lynn belting out her \"hit\" song are worthy of admission alone! i was also grateful for some of the shots of carnaby street in it's hayday - god, i just wish i were there! this is a movie that mike myers very obviously borrowed from to create austin powers. it has a lot of the same sensibilities. see the original - maybe skim by most of the songs... but enjoy the ride!",
         "A 1966 article in Time magazine started what became known as the 'Swinging London' phenomenon, alleging young people were migrating southwards in droves, hoping to find an exciting new way of life. Movies leapt on the bandwagon. 'Smashing Time' teamed the stars of two of the decade's most iconic films - Lynn Redgrave from 'Georgy Girl' and Rita Tushingham from 'A Taste Of Honey'. They play 'Yvonne' and 'Brenda', a pair of Northern girls who travel to London in search of fame and fortune. They search for Carnaby Street, but a drunken Irishman ( George A.Cooper ) sends them instead to Camden Street where they are robbed by an old tramp ( Sydney Bromley ). Yvonne gets a job as a nightclub hostess, and is almost seduced by caddish Bobby Mame-Rath ( Ian Carmichael ). After winning a cash prize on a T.V. show, Yvonne gambles her winnings on a bid for the pop charts. The resulting single - 'I'm So Young' - makes it to the top. Brenda becomes a Jean Shrimpton-type model. Needless to say, their fame proves only fleeting, and the film ends with them going home. Had 'Smashing Time' been made five years earlier, it would probably have conformed to the 'kitchen sink' melodramas in vogue at the time. But, by 1967, 'with-it' comedies such as Richard Lester's 'The Knack' were wanted audiences wanted. Quick-fire dialogue exchanges, montages, jump-cuts, wipes, anything can happen and it does. 'Time' pays homage to 'Swinging London' while simultaneously deconstructing its myth. Pop stars, art, fashion, music, the sexual revolution, all are sent up rotten by writer George Melly and director Desmond Davis. In one of my favourite scenes, avant-garde exhibits ( designed and built by Bruce Lacey ) come to life in an art gallery and terrorise patrons ( Brenda being pursued by a kissing machine must be seen to be believed! ) while another has Yvonne on a 'Candid Camera'-style show entitled 'You Can't Help Laughing!'. Peter Jones' smirking host presides over a wholesale demolition of a sweet old lady's house while the owner is out, and it is not far removed from the kind of cruelty that passes for light entertainment nowadays. I would have preferred less slapstick and more satire. The fight in the café goes on forever, and is unnecessary to begin with. Arthur Mullard and Irene Handl pop up, along with Anna Quayle and Jeremy Lloyd ( the latter particularly good as a pop impresario ). Michael York plays 'Tom Wabe', a dig at David Bailey-type Cockney photographers. Murray Melvin and Paul Danquah, both of whom co-starred with Tushingham in 'A Taste Of Honey', appear in cameo roles. The finale is set in the revolving restaurant in the Post Office Tower. At a lavish showbiz party, Yvonne falls backwards into a cake, everyone laughs at her, and, to get revenge, Brenda causes the restaurant to spin faster and faster. Guests are pinned to the walls by centrifugal force. Power stations blow up. London is plunged into darkness. Our girls have had the last laugh. The music is fab, particularly 'I'm So Young' which really could have been a Top Ten hit had someone bothered to release it. Great, groovy fun, a museum piece but well worth tracking down. And Redgrave looks gear in that blonde wig!",
         "WARNING : This is a very silly film. :D . Therefore, watching it in the right state of mind will make you laugh a lot. You will be irritated if in the wrong mood. The story of two northern lasses, Yyvone and Brenda (Redgrave & Tushingham) who come to London to get down with the cool hepcats. The film documents in astonishing cinema-verite style the trials and tribulations of late 60's living and partying. There is fantastic irony in some sections of the film, particularly the Gauche perfume adverts that Brenda does..truly astonishing in fact - examples of post-modernism at it's finest. Michael York is wonderfully hammy as the swinging photographer who weaves in and out of Yyvone and Bren's lives on a regular basis with only thought of himself. Two fantastic restaurant sequences as well...you just can't beat a good food fight! I must admit I've always had a huge crush on Rita Tushingham, which helped me through some of the lamer comedy moments, but overall it's light enough to be enjoyable. Oh yeah, the music is absolutely awful, but I think that's intended. At least I hope so..please tell me it's meant to be a parody?? 6/10.",
         "As someone else has said regarding this film 'I could have done with less slapstick and more satire'. Yep. The satire is most definitely there and it's funny but the slapstick is lame warmed over nonsense and should just be fast forwarded through. Redgrave and Tushingham are great fun together and the supporting cast all pitch in nicely, ghastly stereotypes excepted. It's a film I have long been curious about and now that I've seen it I feel as if I've been rewarded with a bright and zippy laugh out loud at times comedy (somewhat of a rare commodity these days) and an affectionate look at what I suppose is now a lost world.",
         "I watched this film in its entirety on Youtube (May 2011) and am glad that I did. This film is a time capsule of the styles and faces of the mid-late 1960s and of 'groovy' London. The film offers a cornucopia of great faces of British comedy, all of which add to the mayhem of a loosely directed, pie-in-your-face slapstick comedy. This film presents you with several extended pie-fight sequences, sixties songs (none of which are famous) and lots and lots of London scenery, the film being shot entirely on location. None of the cast are taking this film seriously and the result is actually quite funny, and adequately entertaining to hold attention for 100 minutes. Rather than feel dated this film is more of a time capsule of an era some 45 years old. In short, the film is good humoured and worth seeking out. Play spot the actor and cringe at the naff songs which are interspersed throughout the movie. It's too much.",
         "'Smashing time' is a well-made English comedy, set in the famous Swinging London of the mid-Sixties. And shot in the same city in the same period, adding extra authenticity. This film is just fun, without any pretense. The hilarious interaction between Rita Tushingham and Lynn Redgrave, successfully coupled as girlfriends, makes it work. Some of its scenes are clearly inspired by Laurel and Hardy. 'Girlfriends', I said. This friendship between the two heterosexual female leads is devoid of any sex. Such a formula wouldn't probably sell today, but back in the Sixties it did. A friendship of this kind makes this film's core."
      ],
      "genres": [
         "Comedy",
         "Musical"
      ],
      "productionCompanies": [
         "Partisan Productions",
         "Selmur Productions"
      ],
      "summaries": [
         "Two young women from England's northern counties; the plain Brenda and the flamboyant Yvonne, arrive in London to find fame and fortune. Misdirected and separated, they strike out on their own with Yvonne becoming a model and Brenda a waitress. After Brenda sabotages Yvonne's date whom takes advantage of her, they lose their jobs and soon the roles are reversed with Brenda succeeding as a model and Yvonne becoming a waitress. With both of them competing with the other, they soon learn that they have to team up to take on their adversaries in order to succeed.",
         "Two young women arrive in London to make it big in show business, and become corrupted by money and fame in the process."
      ],
      "budget": 0
   },
   "movielensId": 3233,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1967-12-20",
      "dvdReleaseDate": "2000-01-11",
      "directors": ["Desmond Davis"],
      "runtime": 96,
      "movieId": 3233,
      "title": "Smashing Time",
      "mpaa": "",
      "actors": [
         "Rita Tushingham",
         "Lynn Redgrave",
         "Michael York",
         "Anna Quayle",
         "Irene Handl",
         "Ian Carmichael",
         "Jeremy Lloyd",
         "Toni Palmer",
         "George A. Cooper",
         "Peter Jones",
         "Arthur Mullard",
         "Ronnie Stevens",
         "John Clive",
         "David Lodge",
         "Murray Melvin",
         "Sydney Bromley",
         "Mike Lennox",
         "Cardew Robinson",
         "Amy Dalby",
         "Valerie Leon",
         "Geoffrey Hughes",
         "Veronica Carlson",
         "David Essex",
         "Howard Marion-Crawford",
         "David Essex"
      ],
      "imdbMovieId": "0062281",
      "originalTitle": "Smashing Time",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Two young women arrive in London to make it big in show business, and become corrupted by money and fame in the process.",
      "tmdbMovieId": 110479,
      "avgRating": 3.02632,
      "releaseYear": "1967",
      "numRatings": 19,
      "posterPath": "/zKv2QBtECfPfkvoanuFBP4kurGO.jpg"
   }
}