{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "musical",
            "id": 4344
         },
         {
            "name": "train",
            "id": 13008
         },
         {
            "name": "hollywood star",
            "id": 179418
         }
      ],
      "imdb_id": "tt0078412",
      "video": false,
      "title": "Train Ride to Hollywood",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 0,
            "credit_id": "544ce5750e0a2608d000216a",
            "name": "Charles R. Rondeau",
            "profile_path": null,
            "id": 1214587,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 0.120652,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 299121,
      "vote_count": 0,
      "budget": 0,
      "overview": "Harry Williams, member of the rhythm &amp; blues band, Bloodstone, is about to go onstage for a concert when he is hit on the head. The rest that follows is his dream. The four band members become conductors on a train filled with characters and (impersonated) actors from the 1930s, such as W.C. Fields, Dracula, and Scarlett O'Hara. Various songs are featured. The singing conductors are obliged to solve a mystery; Marlon Brando is murdering Nelson Eddy, Jeanette McDonald and others by suffocating them in his armpits. A wacky funeral, a fight with a gorilla, and the threat of being turned into a wax museum figure are all part of Harry's dream.",
      "similar": [
         872,
         11224,
         3933,
         11631,
         134,
         10882,
         18947,
         46195,
         194662,
         196867,
         11970,
         10020,
         19404,
         321612,
         254470,
         342473,
         9479,
         252,
         630,
         703
      ],
      "original_title": "Train Ride to Hollywood",
      "runtime": 89,
      "poster_path": "/5MM04G8JJtCNfNAqFNZfKeqYsW1.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Billy Jack Enterprises",
            "id": 36359,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Crystal Jukebox Film Corp.",
            "id": 36360,
            "origin_country": ""
         }
      ],
      "release_date": "1975-10-01",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Charles R. Rondeau"],
      "runtime": 89,
      "synopsis": null,
      "writers": ["Dan Gordon"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0078412/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk5MjgxNjU0NV5BMl5BanBnXkFtZTcwMzgyNDIyMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Willis Draffen Jr., Charles Love, Charles McCormick | See full cast and crew »"],
      "reviews": [
         "We saw this movie when it was released in 1978. It was one of the silliest movies that I had ever seen, but I go to the movies to escape from real life, to be entertained. This movie had great musical numbers (I've had the soundtrack for 15 years) and quite a few entertaining moments. If you're a 30s or 40s movie buff and a fan of the old Fred Astaire musicals, you'll like the dance numbers alone. If you can sit back and see the humor in life, just let yourself go, then you'll enjoy \"TRAINRIDE TO HOLLYWOOD\".",
         "Oddly enough, I remember seeing this movie back when it first came out. Maybe the fact I was young in age made it more memorable for me *shrug*. I liked it...to this day I find myself humming \"get your ticket, get your ticket, ya gotta have your ticket for the train ride\". Perhaps it's also in part that I grew up listening to the Sinceres aka Bloodstone on the Radio and Records at home. Granted it isn't on par with any Cinematic greats...but for a cheesy 70s film it isn't that bad..especially for a vehicle for a 70s Band. This movie is a tad better than Kiss Meets the Phantom of the Park (imho). If you want a thinking movie, yeah get something else..but for a fun look at a \"classic\" 70s cheesy movie there is far worse. Heck, I have to admit I've seen worse movies in the 2000s that were MEANT to be \"serious\"...at least this one was meant to be \"fun\".",
         "Members of the 70's pop/soul group Bloodstone (\"Natural High\") enter a dream sequence in which they disguise themselves as porters to get to Hollywood for an audition. Also on the train are cheap impersonators of Bogie, W.C. Fields, Rhett and Scarlet, Jeanette and Nelson, Bela Lugosi, plus a sheik and his harem. Some fine musical numbers liven up a rather hackneyed self-referential movie. Still an interesting trip for cinema fans, and more economical than the later star-laden failure \"Won Ton Ton, the Dog Who Saved Hollywood.\"",
         "Train Ride to Hollywood is a musical comedy. Bloodstone's Harry Williams is fascinated with Hollywood and its famous actors of old. He falls and hits his head just before going on stage, no thanks to their producer (Michael Payne) tugging on his leg. The movie is his dream, a goofy dream at that. There are auditions in Hollywood and they need to take a three-day train ride to get there. The only problem is they don't have the money for train tickets. So they trick real railway workers and steal their uniforms. The train's passengers consist of a Sheikh and his harem, W.C. Fields, Scarlett O'Hara and Rhett Butler, a loveable Dracula, The Godfather, Humphrey Bogart, Jean Harlow, Nelson Eddie and Jeanette MacDaonald and others. Bloodstone turns into detectives ala Sherlock Holmes following a double murder. Guess the killer couldn't stand Nelson Eddie and Jeanette MacDonald's continuous singing. A wacky funeral, fight with a gorilla, and threat of being turned into a wax museum figure are all part of Harry's dream. Dance numbers are good especially the memorable Train Ride number filmed in L.A's Union Station. (Funny thing is they start at Union station and end there). I've watched it over and over again. Charles McCormick and his falsetto voice are wonderful in the number with the Rhythm professor. Charles Love singing to Tracy Reed is also great to watch. Too bad there is no soundtrack for this film. The movie is overall fun.",
         "This is a fun, silly movie which takes very bizarre and unexpected turns. But I've watched the \"Train Ride\" musical number over and over again. It's worth the rental. As they say, \"Get your ticket get your ticket you gotta have a ticket for this train ride...\"",
         "This really is pathetic. Nothing to recommend it other than 2 good oldies. Bad acting, bad direction, bad script, bad music. How did this movie ever get made...and released by a major studio! You can buy the movie Letter-boxed, but why anyone would want to is beyond me (unless of course they're in it, but I'd be too embarrassed to admit to that).",
         "I'd be surprised if anyone ever reads this review. Judging by the 13 whole votes \"Train Ride To Hollywood\" had before mine, no one knows of this film or has ever seen it. Ignorance, my friends, is bliss. I stumbled across this...this...unholy THING on television one dark day, and it was so stunningly wretched I could not take my eyes off it for fear that I'd miss the literal lowpoint in the history of cinema. From the horrific, unfathomable beginning to the excruciating, vomit-inducing end, this waste of celluloid redefines -- nay, deconstructs -- the term \"bad movie.\" \"Bad\" doesn't even begin to describe it. Take every synonym for \"bad\" you can find, invent a few of your own, and you haven't even begun to scratch the surface of how truly putrid \"Train Ride To Hollywood\" is. First, there is zero story. Musicals don't always have the best plots, but COME ON!! This dung heap is so devoid of sense it makes the average porno look like a Merchant-Ivory production. Next, the acting. The homeless guy at my Seven-11 who drunkenly tap-dances for spare change has more talent in his pinkie than every \"actor\" in this schlockfest combined. The cast consists of people doing impressions of Hollywood greats so relentlessly awful you'd swear they're half-assing it out of spite. Not even half-assing. Maybe quarter-assing, or even eighth-assing. No one in this entire sorry spectacle even remotely sounds like who they're imitating, and if any of these people ever worked again, I'd be shocked and angry. Then there's the musical numbers. Apparently, the four African American gents in this fetid film belonged to the group Bloodstone. I can't possibly imagine who these guys p***ed off or what kind of financial/drug problems could compel them to take this gig, but every one of them should be ashamed, and they owe their entire race an apology. Folks, I'm not one of those people who finds racism everywhere or focuses on how bad things are for minorities in entertainment, but I simply could not believe how appallingly racist this movie is. Not only do the ONLY black guys in the movie do all the skip-and-shuffle musical bits, they are degraded beyond all belief. At one mind-numbing point in this abysmal flick, one of the black guys actually FIGHTS A GORILLA IN A BOXING RING!!! And to give him strength during the fight, THE OTHER THREE BLACK GUYS FEED HIM GRITS!!! Jar-Jar Binks would cringe at this. I mean, I half expected the Cream of Wheat guy to come dancing out juggling basketballs and watermelons. It is that bad. (By the way, I saw this film on the Black Starz channel. What on Earth were they thinking?) In summary, \"Train Ride To Hollywood\" is filmmaking at its absolute, rock-bottom worst. Satan could show this as an orientation video in Hell. I am a worse human being for having seen it. And despite everything I've said about it, I give it a 3/10. That's 0 for the film itself and 3 for whoever had the brass ones to foist this steaming pile of poo on the public. God help us all.",
         "For a blaxsploitation flick, this movie's sure got a lot of white people in it. I'd never heard of the R&B group \"Bloodstone\" before but apparently they were popular when they made this low-budget musical homage to Hollywood back in 1975. A \"Blackstone\" band member gets knocked out backstage at one of their concerts and dreams the group are porters on an Art Deco train bound for Hollywood with Bogie, W.C. Fields, Jean Harlow, Jeanette Macdonald & Nelson Eddy, Dracula, The Godfather & The Wild One, Rhett Butler & Scarlett O'Hara, Peter Lorre, and a sheik & his harem along for the ride. There's quick sketch romance, dance, and murder that the band interrupts often to flex their pipes singing pop tunes like \"Toot-Toot-Tootsie Good-Bye\", a du-wop ditty or two and, of course, original compositions (\"...There's nothing as scintillating, nothing so captivating as a train ride...\"). Unless there's some subliminal substance to this silliness, the stars' servant-like roles may be accidentally un-PC today but it's all in innocent, corny fun geared toward a kiddie mentality. The Godfather suffocating his victims with his armpit, all the stars getting stoned on the sheik's hookah pipe, and an obese boxing match with a gorilla are just some of the slap-happy shenanigans going on in a concussion-induced Hollywood hallucination not unlike Dorothy's in THE WIZARD OF OZ. The celebrity impersonators are pretty good and an authentic Art Deco L.A. train station was used for one song & dance number but the only actor I recognized was Phyllis Davis (who I think I remember from TV) as Charlotte O'Hara. Die-hard movie buffs may find this harmless nonsense mildly amusing but, even then, I'd recommend it only as a second feature for THE MAN WITH BOGART'S FACE (1980).",
         "This is not an overly serious movie. If you're in the mood for something silly a la a poor-man's Mel Brooks flick, this is one that is done by a tight soul group called Bloodstone. I gave it a 7. In addition to some original music, the group does good covers of a striking variety of song genres, and I think this is a particularly good quality of the film and music. Examples from the 40s-50s-60s: As Time Goes By (very good version!), Yackety-Yack, Money (yeah the one that the Beatles covered). These guys looked to me like they had a very good time making this movie, and that makes the movie better. This movie is not meant to be the experience of a century. It's just a deliberately ridiculous musical romp with some terrific music, some ok choreography and a villain or two and that's that. I liked it because of the music, the performances of individual group members, the soundtrack ages quite well in my collection and in the end it's an B-movie plot. On this last point, I'd say that, if you're in the mood for a silly musical, the plot-story is weak but ok, with a lot of referential characters (impersonated characters such as of Bogart, A Legosi-ish Vampire, Nelson Eddy+Jeanette MacDonald, I think maybe a James Dean-type, etc.) The group members are sufficiently ok in acting that one can like them. The DVD does not stand in well as a good-audiophile soundtrack (unless there's something I don't quite get about how to use a video DVD to play back sound). Since the music is what I wanted to re-listen to many times, I had to get the CD. But there's nothing wrong with the film. I'd have to give it higher than a 5, the average at the time of this writing, if only because an enjoyable musical is so hard to find. I had to wait about 20 years for them to come out with both the movie and the CD. Something has always been wrong with Bloodstone's music and film distribution. I saw this film in the 70's and here it is 2002 and finally it's available on VHS or DVD? What about the soundtrack? Why wasn't that available with other Bloodstone albums, until now? What the heck is up with that? This isn't the first time I've run into that trouble finding Bloodstone's work. There was also a problem with getting all the songs from the vinyl of Natural High on to the CD. To my knowledge, that hasn't been fixed.",
         "WARNING! This movie could HURT. Imagine a film musical FAR WORSE than \"At Long Last Love\", \"Sgt. Pepper's Lonely Hearts Club Band\" or \"Lost Horizon\" then multiply it by TEN, then you almost can conceptualize how heinous this thing is. A very, VERY small amount of the music and dance is vaguely enjoyable. The song in the railway station which ends up in laughable faux Busby Berkley-style kaleidescope formations is about the only thing that can be sat through without throwing an anvil at the TV set. Most of the rest is so painful it should be run on a continuous loop in high school detention halls. The \"lookalikes\" in this turkey are so way off that you have to strain to imagine who most of them are! Gable's voice is okay and WC Fields is so-so. The Bogart guy isn't too horrible, but ALL of the rest are incredibly lame. (The one playing Brando in \"The Wild One\" deserves some minor credit.) And anyway......the whole thing is so senseless and impossibly stupid that it doesn't even matter! Here's the kicker... The DVD comes with a little mini card of the original release poster. It boldly features the REAL faces of all the stars that the lame imposters are trying to impersonate! Imagine people's horror when they thought they might see something resembling these celebrities, but instead found Dan Tanna's casino hostess from \"Vegas\" flopping around with the most inappropriate Scarlett O'Hara accent imaginable and two perfectly ordinary-looking people acting like they're Nelson Eddy and Jeannette McDonald. The man playing Clark Gable is a particular insult when confronted with Gable's real face (as briefly shown in this turkey). The impersonator looks like Gable if Gable were an overweight used car salesman from Peoria. A MESS!!!!"
      ],
      "genres": [
         "Comedy",
         "Musical",
         "Fantasy"
      ],
      "productionCompanies": [
         "Billy Jack Enterprises",
         "Crystal Jukebox Film Corp."
      ],
      "summaries": ["Harry Williams, member of the rhythm & blues band, Bloodstone, is about to go onstage for a concert when he is hit on the head. The rest that follows is his dream. The four band members become conductors on a train filled with characters and (impersonated) actors from the 1930s, such as W.C. Fields, Dracula, and Scarlett O'Hara. Various songs are featured. The singing conductors are obliged to solve a mystery; Marlon Brando is murdering Nelson Eddy, Jeanette McDonald and others by suffocating them in his armpits. A wacky funeral, a fight with a gorilla, and the threat of being turned into a wax museum figure are all part of Harry's dream."],
      "budget": 0
   },
   "movielensId": 3234,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1975-10-01",
      "dvdReleaseDate": "2000-01-11",
      "directors": ["Charles R. Rondeau"],
      "runtime": 89,
      "movieId": 3234,
      "title": "Train Ride to Hollywood",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "0078412",
      "originalTitle": "Train Ride to Hollywood",
      "genres": [
         "Fantasy",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Harry Williams, member of the rhythm &amp; blues band, Bloodstone, is about to go onstage for a concert when he is hit on the head. The rest that follows is his dream. The four band members become conductors on a train filled with characters and (impersonated) actors from the 1930s, such as W.C. Fields, Dracula, and Scarlett O'Hara. Various songs are featured. The singing conductors are obliged to solve a mystery; Marlon Brando is murdering Nelson Eddy, Jeanette McDonald and others by suffocating them in his armpits. A wacky funeral, a fight with a gorilla, and the threat of being turned into a wax museum figure are all part of Harry's dream.",
      "tmdbMovieId": 299121,
      "avgRating": 3.2,
      "releaseYear": "1975",
      "numRatings": 5,
      "posterPath": "/5MM04G8JJtCNfNAqFNZfKeqYsW1.jpg"
   }
}