{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0183065",
      "video": false,
      "title": "Kestrel's Eye",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe4a6bc3a368484e1524bd",
            "name": "Mikael Kristersson",
            "profile_path": null,
            "id": 1074750,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.001201,
      "production_countries": [],
      "id": 121738,
      "vote_count": 0,
      "budget": 0,
      "overview": "Swedish filmmaker Mikael Kristersson directs this austere yet beautiful experimental documentary about two European falcons. Shot over the course of two years, Kristersson manages to fashion a narrative without the use of voice-overs or music, showing the falcons as they forage for food and tend to their eggs. Much of this film, though, is spent viewing the world from the falcons' vantage point -- high up on a 13th century church steeple, watching the groundskeeper tending to the village cemetery and the choir boys growing tired of a long religious procession. ~ Jonathan Crow, Rovi",
      "similar": [],
      "original_title": "Falkens öga",
      "runtime": 89,
      "poster_path": "/3dGNQnlCmRB4OXarf6CpOCHiaD0.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1998-12-25",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Sweden",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mikael Kristersson"],
      "runtime": 89,
      "synopsis": null,
      "writers": [],
      "originalLanguage": null,
      "imdbLink": "http://www.imdb.com/title/tt0183065/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg2NjA1MTE5OF5BMl5BanBnXkFtZTcwNDk0NzQyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Caisa Persson | See full cast and crew »"],
      "reviews": [
         "Beautiful and faschinating film! At first you might think it is about the birds, but after a 2nd thoughtm it is really about the life around the birds. Funerals, weddings, everyday life, the people who are seen by the bird who looks out from the tower of Sankt Olofs chrurch in Skanör in the very southwest Sweden. And by the way, it is my mother cykling by in one picture! THOMAZ RANSMYR",
         "Kestrel's Eye documents the life of a family of European Kestrels during a breeding season. All aspects of the birds' lives are filmed from pre-breeding and hunting, through copulation, to growth and fledging. A camera was even placed inside the nest area so as to capture the private moments of incubation, hatching, feeding, and growth (I read that Kristersson insured that the birds were not disturbed during filming). The film nicely contrasts the Kestrels' existence with that of humans by filming from the birds' perspective and using only ambient sound for the soundtrack. Thus the viewer witnesses human life as an observer rather than a participant. Although the direction is nice, some of the filming is a bit 'rough' due to the fact that following birds of prey is not easy. The result is a film that is a wonderful nature documentary and a statement of how far removed from nature humans can be. Highly recommendable for nature-lovers (especially birders) and anyone who has ever asked, \"Why would someone want to study birds?\"",
         "Narrationless nature documentary of several months in the lives of a pair of kestrels and their offspring living in a church tower, notable for the presence of a camera and microphone within the nest, but otherwise dull and unremarkable. I was drawn to this nature film by a curiosity about hawks bred of living in their habitat. There's nothing quite like the sight of a hawk afloat on a column of shimmering summer air suddenly furl its wings, forming itself into a fist and, with a screech, drop over a thousand feet out of the sky like a stone. Then there's the way swallows gang up on a hawk if it strays into their territory, a disproportion between combatants as striking as that between David and Goliath. (Binocular toting bird fanciers specializing in recording the area's hawks frequent our trails.) As much as I am against voice-over narration, as much as I favor a film telling its story strictly in image and sound, this film could have used a word or two of explanation. Specifically, not being a bird fancier and thus not being able to tell male from female, I would have appreciated being informed of the division of labor between the sexes. Also, there are gaps in the flow of the story: the brood (is that the right term for a nest of hawks?) goes from 5 to 6 without explanation--we never see one of the chicks expire; and near the end the parents just suddenly disappear--where did they go?--leaving their offspring, clinging clumsily to the church walls, to fend for themselves. Then the film ends, just like that; we never find out how the new birds learn to hunt, find a mate, etc. The film devotes almost as much attention to the events of the churchyard below as to the birds above, by way of commentary, I suppose, on the divergence of human and animal worlds. But nothing much comes of this. From a bird's eye view we witness graves being meticulously tended, a funeral, a wedding, and sundry other human activities, such as people walking their dogs or jogging, and a parade. In the meantime, the birds catch mice, breed, and nurture their young. Human activity, of course, seems trivial, ritualized, and symbolic compared to the spare functionality and instinctual simplicity of animal behavior. The birds, too, are remarkably peaceful and cooperative compared to what we know about the two-legged land animals below.",
         "I had high hopes going in to this film. I love nature documentaries and I love birds. This seemed like a great fit for me. Unfortunately this film does not deliver in the information department or the entertainment department. Some narration would go a long way in improving this movie. There are so many good wildlife films out there today. There is no reason to waste your time on this film. There is no discernible story, no discernible message. Go rent \"Winged Migration\" or any David Attenborough film to quench your thirst for wildlife. I would like to say more about this film, but it is really just 2 hours of footage of birds fling into and out of a small hole in the side of a church."
      ],
      "genres": ["Documentary"],
      "productionCompanies": [],
      "summaries": ["Filmed over several years, it is a wonder-filled portrait of a family of kestrels (European falcons) who live in a church tower above a small Swedish town. The amazing cinematography, nominated for a Swedish Oscar."],
      "budget": 0
   },
   "movielensId": 3237,
   "movielens": {
      "languages": [""],
      "releaseDate": "1998-12-25",
      "dvdReleaseDate": "2004-01-20",
      "directors": ["Mikael Kristersson"],
      "runtime": 89,
      "movieId": 3237,
      "title": "Kestrel's Eye",
      "mpaa": null,
      "actors": [""],
      "imdbMovieId": "0183065",
      "originalTitle": "Falkens öga",
      "genres": [
         "Documentary",
         "Foreign"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Swedish filmmaker Mikael Kristersson directs this austere yet beautiful experimental documentary about two European falcons. Shot over the course of two years, Kristersson manages to fashion a narrative without the use of voice-overs or music, showing the falcons as they forage for food and tend to their eggs. Much of this film, though, is spent viewing the world from the falcons' vantage point -- high up on a 13th century church steeple, watching the groundskeeper tending to the village cemetery and the choir boys growing tired of a long religious procession. ~ Jonathan Crow, Rovi",
      "tmdbMovieId": 121738,
      "avgRating": 2.75,
      "releaseYear": "1998",
      "numRatings": 10,
      "posterPath": "/3dGNQnlCmRB4OXarf6CpOCHiaD0.jpg"
   }
}