{
   "tmdb": {
      "original_language": "de",
      "keywords": [{
         "name": "autism",
         "id": 1646
      }],
      "imdb_id": "tt0141399",
      "video": false,
      "title": "Isn't She Great",
      "recommendations": [
         116014,
         91445,
         78051,
         15398,
         19809,
         45225,
         68665,
         27224,
         29098,
         66600,
         54087,
         14441,
         98130,
         79008,
         41971,
         71357,
         20468,
         74101,
         36859,
         34390
      ],
      "backdrop_path": "/xtM7NqIIjYvUBGSWdslBmH6r99c.jpg",
      "revenue": 3003296,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "Jacqueline Susann",
               "gender": 1,
               "credit_id": "52fe4904c3a368484e1166d7",
               "name": "Bette Midler",
               "profile_path": "/ylGKhmHKUa1fBvvbA0kvdn3eFNn.jpg",
               "id": 73931,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "Irving Mansfield",
               "gender": 2,
               "credit_id": "52fe4904c3a368484e1166db",
               "name": "Nathan Lane",
               "profile_path": "/2eB01W4VURqihttVdewfhfhhCwW.jpg",
               "id": 78729,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Florence Maybelle",
               "gender": 1,
               "credit_id": "52fe4904c3a368484e1166df",
               "name": "Stockard Channing",
               "profile_path": "/5UFMOfbzod42UiPUna59Ch1e37a.jpg",
               "id": 8893,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Michael Hastings",
               "gender": 2,
               "credit_id": "52fe4904c3a368484e1166e3",
               "name": "David Hyde Pierce",
               "profile_path": "/96qVGJhtV6tQkXmJVmbi6BBk1Ll.jpg",
               "id": 11076,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Henry Marcus",
               "gender": 0,
               "credit_id": "52fe4904c3a368484e1166e7",
               "name": "John Cleese",
               "profile_path": "/kg63gNYQtGPi2fSNIvCnVAclCbi.jpg",
               "id": 8930,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Maury Manning",
               "gender": 2,
               "credit_id": "52fe4904c3a368484e1166eb",
               "name": "John Larroquette",
               "profile_path": "/2JCgM1nqdxZUQv1qsE3BJu4fnRr.jpg",
               "id": 14101,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Debbie",
               "gender": 1,
               "credit_id": "52fe4904c3a368484e1166ef",
               "name": "Amanda Peet",
               "profile_path": "/81KzrntoeEztNpfhCYNgfOtI3kU.jpg",
               "id": 2956,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Bambi Madison",
               "gender": 0,
               "credit_id": "52fe4904c3a368484e1166f3",
               "name": "Dina Spybey-Waters",
               "profile_path": "/rA6gMWarWOpxUCFsfYFz4Gcok7o.jpg",
               "id": 56567,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4904c3a368484e1166a3",
               "name": "Andrew Bergman",
               "profile_path": "/gTx35MhqW8MlGv7JlYnCJQClebi.jpg",
               "id": 41550,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4904c3a368484e1166a9",
               "name": "Paul Rudnick",
               "profile_path": null,
               "id": 32588,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4904c3a368484e1166af",
               "name": "Mark Gordon",
               "profile_path": "/lATsud5NyaXaKE5p8H1kEkUsbWN.jpg",
               "id": 6048,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4904c3a368484e1166b5",
               "name": "Ted Kurdyla",
               "profile_path": null,
               "id": 37419,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4904c3a368484e1166bb",
               "name": "Gary Levinsohn",
               "profile_path": null,
               "id": 284,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4904c3a368484e1166c1",
               "name": "Mike Lobell",
               "profile_path": null,
               "id": 31143,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4904c3a368484e1166d3",
               "name": "Barry Malkin",
               "profile_path": null,
               "id": 2988,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "553d76119251416874006205",
               "name": "Burt Bacharach",
               "profile_path": "/nf90uVoQveWfDRd62qzur7lmSWf.jpg",
               "id": 9580,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "553d76229251416874006207",
               "name": "Karl Walter Lindenlaub",
               "profile_path": null,
               "id": 8677,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 2.059726,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 75531,
      "vote_count": 18,
      "budget": 36000000,
      "overview": "An unsuccessful over-the-top actress becomes a successful over-the-top authoress in this biography of Jacqueline Susann, the famed writer of \"The Valley Of The Dolls\" and other trashy novels. Facing a failing career, Susann meets a successful promoter who becomes her husband. After several failures to place her in commercials and a TV quiz show, he hits upon the idea for her to become a writer. In the pre-60's, her books were looked upon as trash and non-printable. But then the sexual revolution hit and an audience was born for her books. The story shows the hidden behind the scenes story of Susan's life, including her autistic son and her continuing bout with cancer that she hid up to her death",
      "similar": [
         24086,
         512192,
         302946,
         380,
         8838,
         64685,
         4104,
         278236,
         431,
         10391,
         39957,
         26466,
         15003,
         1945,
         33602,
         10322,
         313,
         369770,
         127501,
         23478
      ],
      "original_title": "Isn't She Great",
      "runtime": 95,
      "poster_path": "/gIEa3CRtNVul0JgTaHMvWrY65Ju.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
            "name": "Universal Pictures",
            "id": 33,
            "origin_country": "US"
         },
         {
            "logo_path": "/lYCOp17DBEjFD1UygdRor98PVWR.png",
            "name": "Toho Company",
            "id": 882,
            "origin_country": "JP"
         },
         {
            "logo_path": null,
            "name": "Mutual Film Company",
            "id": 762,
            "origin_country": ""
         },
         {
            "logo_path": "/16fY7pucCzn7WSOYxOGRHlAayL3.png",
            "name": "British Broadcasting Corporation (BBC)",
            "id": 3324,
            "origin_country": "GB"
         },
         {
            "logo_path": null,
            "name": "Lobell/Bergman Productions",
            "id": 10513,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Marubeni",
            "id": 4650,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Tele München Fernseh Produktionsgesellschaft (TMG)",
            "id": 7237,
            "origin_country": ""
         }
      ],
      "release_date": "2000-01-28",
      "vote_average": 4.4,
      "belongs_to_collection": null,
      "tagline": "Talent Isn't Everything...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Andrew Bergman"],
      "runtime": 95,
      "synopsis": null,
      "writers": [
         "Michael Korda",
         "Paul Rudnick"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0141399/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgyMTA3MTEwN15BMl5BanBnXkFtZTYwNTY4Njg5._V1_SY216_CR34,0,214,216_AL_.jpg",
      "actors": ["Stars: Bette Midler, Nathan Lane, Stockard Channing | See full cast and crew »"],
      "reviews": [
         "I've caught \"Isn't She Great\" several times now (It seems to be eternally running on the movie channels). This was a monster flop when it came out, barely released, but it does a fine job of capturing the era. The main attraction of this film is the acting of the leads. Both Nathan Lane and Bette Midler can come off incredibly stagy on film, but their style works well with these characters. Jackie Suzanne was larger than life. They both manage to bring a true sense of sweetness to their roles. Particular note must be made of David Hyde Pierce as her editor. This actor fits very well in this era. Also, John Cleese is a hoot as the publisher. Wish there were more of him in the movie. Give this one a chance. A period piece from a currently unhip period.",
         "Truly bad movies are a dime a dozen, but how often do they boast credits as outstanding as those found in \"Isn't She Great\"? What attracted such talents as Bette Midler, Nathan Lane, David Hyde Pierce, and Stockard Channing to this ludicrous script by the usually competent Paul Rudnick? What inspired director Andrew Bergman (\"The Freshman\") to add this piece of fluff and nonsense to his resume? It's no surprise that the film remained shelved for some time after its completion, and disappeared from screens soon after its release . . . unlike some movies that are so bad they're funny, this one is simply awful. Allegedly a bio of trash novelist Jacqueline Susann of \"Valley of the Dolls\" infamy, \"Isn't She Great\" plods along from Susann's (Midler) first meeting with the man she eventually married, Irving Mansfield (Lane, miscast as anyone's husband), until her death from cancer in 1974. Midler is forced to spend several scenes conversing with a tree she imagines to be God; moments the couple spend with their autistic son seem to have been included simply to keep the audience from asking, \"Whatever happened to the kid?;\" Channing, as Susann's gal pal, periodically flits in and out looking terrific but with absolutely nothing to do. Reality simply doesn't exist here. The newlywed Mansfields are apparently struggling to make it - publicist Irving's biggest client is Perry Como's ex-brother-in-law, a juggler, no less, and the highlight of Jackie's acting career is a one-time appearance on the \"celebrity\" panel of a TV quiz show called \"What's My Job?,\" yet they live in the lap of luxury in a highrise, have breakfast delivered, and eat at Lindy's on a regular basis - long before \"Dolls\" hits the best-seller lists. Rudnick's script promises drama, but never delivers - Mansfield's jealousy of his wife's success, for example, is suggested, but never developed. No one in the cast makes any effort to rise above the weak material - they either sleepwalk or bulldoze their way through scenes, as if they were resigned to this being a lost cause. Only one true moment is to be found in this disaster - during the premiere of the film version of \"Dolls,\" Susann turns to her husband and mutters, \"I HATE this movie!\" . . . so believably that Midler no doubt is describing this whole, sorry mess.",
         "This movie is supposedly about Jacqueline Susann (Bette Midler) and husband Irving Mansfield (Nathan Lane). It chronicles how they met, fell in love and how she got \"Valley of the Dolls\" published. But this movie is a mess...and completely inaccurate. For starters, Midler doesn't even remotely look like Susann or act like her. I've read at least 3 books on Susann as well as various articles - she was an ambitious, intelligent, driven woman. As Midler portrays her she is stupid, obnoxious, VERY loud and foul-mouthed. I'm no prude but there's way too much swearing from her in this--I have my doubts that Susann ever talked like that. Also they take actual events from Susann's life and fictionalizes them. When she is told in the movie to edit her book she acts like an idiot and refuses to help. In real life, Susann agreed to help make the book better with no fuss. And, Susann had a \"Wishing Hill\" (as she called it) in Central Park. It was basically a huge pile of rocks where she sat to clear her mind and relax. Here it's turned into a giant tree (????) and we have sequences with Lane and Midler talking, yelling and swearing at it. It's a wonder that those two managed to pull it off without looking like idiots. As you can see, this is a bad film--but just so much FUN to watch! The incredible costumes and set design are just great--colorful and very true to the period. Some of the lines are actually very funny. Nathan Lane is great as Mansfield and Stockard Channing (as her best friend) and David Hyde Pierce (as her publisher) are hysterical and offer strong support. And Christopher McDonald and John Larroquette throw in cameos. Also John Cleese is on hand but he's wasted. Then there's Midler....she's AWFUL! Loud, shrill and thoroughly unlikable. When she was dying at the end I could have cared less. If she had toned down her performance and not played every scene at full tilt this might have worked. But she doesn't. However, she is fun to watch--a textbook example of how NOT to play a role. The studio (understandably) threw this film away. It came and went VERY quickly and was a commercial disaster. Still, I'm giving it a 7--it's so incredibly bad that it's fun to watch! A must-see on that level.",
         "ISN'T SHE GREAT (2000) ** Bette Midler, Nathan Lane, Stockard Channing, David Hyde Pierce, John Cleese, Amanda Peet. Before there was Jackie Collins and Amazon.com there was Jacqueline Susann. That is prior to the subgenre of 'trashy romance' novels found in your neighborhood pharmacy and the glut that is now the conglomerate superbookstore \u0096i.e. marketing and focus groups for the masses! \u0096 there was Jacqueline Susann, whose bawdy, vulgar and tasteless novels were ultimately candy for the average American reader who gobbled her tomes faster than she could churn them out. In Andrew Bergman's look at the queen of the acquired taste, who else could portray a larger than life figurehead than the estimable Divine Miss M herself, Bette Midler. Midler gives it her all with her trademark ball-breaking brio as the celebrity craven author whose indefatigable image fashioning was only matched by par by her long-suffering but ever devoted husband and business partner Irving Mansfield (touché Lane, making their onscreen presence a once in a lifetime pairing to appreciative audiences), who used all his show biz savvy \u0096 no matter how gauche or seemingly stooping manners of barnstorming the country to every podunk backwater stationery store or spreading the word to a busload of school children \u0096 to make Susann a giantess among the mortals in the writing field. Based on a reminiscence by New Yorker's Michael Korda, the fact that the real Susann was no sweetheart and a real tough cookie with a few sad hurdles \u0096 her ongoing bout with cancer and the institutionalization of her only child who suffered from autism \u0096 are casually sugar-coated by Bergman (whose impeccable credits include a plethora of the comic pantheon including 'The In-Laws', 'The Freshman' and 'Blazing Saddles') and the sharply sticky screenplay by scathing scribe Paul Rudnick ('In & Out') wisely overlook her obvious flaws and instead center on the unlikely union of two borderline caricatures of the entertainment field, and their questionable romance. But Midler and Lane surpass the film's shortcomings with their theatrical overplaying, which is arguably suitable, as well as the always welcome Channing, one of our most underrated comic actresses, whose succor in her line readings are a stitch (when Susann belabors she doesn't know how to write a book, Channing says with aplomb, 'Talent isn't everything.'); she's like the salt in a margarita. Also lending able support is Hyde Pierce in another variation of his tv persona from 'Frasier' as Susann's stuffed shirt editor and Cleese as the Nehru jacketed publisher, both in their element here. The one thing that seems to be missing is it seems outdated and quite a lot to compress in a film that has the dubious distinction of telling the story of a woman who wasn't very nice nor well respected, but then again that hasn't been the case of celebrity history in this country, so I'm not even going to argue that!",
         "A good way to gauge the end results of this film disaster would be to temporarily resurrect the personage of Jacqueline Susann to get her reaction. I think she would have laughed it off the screen, but not amused laughter: aching, bitter, cynical laughter. I don't see it as a camp film (\"Valley of the Dolls\" was a camp film); this is a pure, unadulterated error in judgment by many talented people with honorable intentions. The picture looks good and has the nice addition of Burt Bacharach's music score (with the occasional Dionne Warwick vocal--natch), but it is unbearably miscast. When was the last time you can remember Bette Midler failing to ignite on screen (her TV sitcom not accepted)? Bette strains for a low-key effect in the serious moments, but it's just not in her to be pensive; her raucous scenes also derail, and this is due in part to poor direction, poor editing choices, and also poor judgment from Midler, who lets herself be seen on-camera struggling (a struggling comedienne is about as funny as a drowning one--here she does both). A sequence in the film that has hubby-to-be Irving Mansfield following Jackie into a NYC lake is both outrageous and deadening. The factually-incorrect script aside, \"Isn't She Great\" (no question mark?) is quite simply a beleaguered movie: vapid, colorless, unfocused, and out-of-touch. Susann might've asked what her 'cut' was and then forgot the entire thing. *1/2 from ****",
         "People have complained about how bad this is. They are right. People have noted how much they enjoyed it. They are right, too. Remember how bad the book and the movie 'Valley of the Dolls' were? Well, here ya go-- It's all in the same vein. They are obviously being over the top, campy, kitschy... If you are looking for Scorcese, this ain't it. But cheesy fun this IS! Unfortunately, because they felt they HAD to make it campy, the 'dramedy' doesn't work. So it goes between melodramatic and wiseacre, with neither hitting the mark. I have to say I enjoyed the movie the same way I would enjoy 'Mommie Dearest' or 'Showgirls'. Just mindless, guilty time-wasting. I'm also a sucker for period pieces when they get it right. The clothing, the celebrities, the zeitgeist of the time are pretty good. I'll take Bette Midler chewing the scenery in this over her deplorable 'Beaches' character any day!",
         "I wasn't a fan of Jackie Susann's books and didn't care for the movies based on them. But I LOVED this movie. It was done in a comedy format rather than totally serious, but it was wonderful. I loved her going to the park and facing up into the sky/tree to talk to God. And the bubbly Miss M brought a lot of excitement and energy to the role. As a wanna be writer, myself, I was impressed with Miss Susann's life story especially starting her writing career later in life and making herself into a best-seller and celebrity (with her husband's and publishers' help.) I am glad that she was able to get her books published and have the fame she craved. Everyone should be able to do that in whatever field they prefer. It is a very good book for writers to watch for education on marketing and publicity for your own books. Watch it. It would be a good movie even if it were based loosely on a real person and life.",
         "How did I ever miss this one when it was at the theater? Found it in the Video rental and picked it because of the dozen well know actors from John Creasy to Nathan Lane, Amanda, Peets, Stockard Channing, Bev Midler, \"Niles\" from Fraiser, John LaRoquette... Some were minor parts, but all did an excellent job. We laughed and laughed. If you can listen to the word F*CK used in many funny lines, you will too!",
         "Sleepy Midler-Lane vehicle about life of trash novelist Jacqueline Susann. Predictable and unfunny, even attempts at poignancy either get drowned out with self-absorbed dialogue or shtick. Bette Midler, known to put some life in films, seems totally tranquilized out. Nathan Lane's character seems almost robotic; only programmed to dote and serve. Flunkies are fun, but after awhile, they get dull. Especially the ones that try to live their life vicariously through yours. The only saving grace here was Stockard Channing, who always seems to churn out a good performance, even if the flick is lame, which brings me back to ISN'T SHE GREAT. The screenplay and the vapid absence of direction really hurt the film, as well. There's no verbal intercourse between the main protagonists. The lines seem to be uttered lines, and pretty hokey ones at that. The direction seems as if, the crew placed the camera on a stack of boxes and broke for lunch. It's not unwatchable. There's a couple of moments of enjoyment. However, when taking into consideration the amount of talent involved here, the fluff factor is pretty disappointing. Not recommended.",
         "Sorry to say, I was disappointed by this film. When it ended, I had the feeling that I had just watched a TV movie, (an activity I try to avoid.) I rented the DVD, not because of any great admiration of Jacqueline Suzann, but because the cast looked great. Admittedly, the cast did not disappoint. David Hyde Pierce and John Cleese make for several enjoyable scenes. I like Nathan Lane. He's a genuinely engaging personality, with real warmth and charm. Nevertheless, it was his narration that pulled the quality down a few notches for me. It wasn't his delivery of the narration, but the writing itself that was at fault. It's cliché and sentimental to a fault. Burt Bacharach's musical direction only made matters worse. I admire Bacharach tremendously, and rank his scores for Casino Royal and What's New Pussycat among my favorites. But it just didn't work here. * out of ****"
      ],
      "genres": [
         "Biography",
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "British Broadcasting Corporation (BBC)",
         "Lobell/Bergman Productions",
         "Marubeni"
      ],
      "summaries": ["An unsuccessful over-the-top actress becomes a successful over-the-top authoress in this biography of Jacqueline Susann, the famed writer of \"Valley of the Dolls\" and other trashy novels. Facing a failing career, Susann meets a successful promoter who becomes her husband. After several failures to place her in commercials and a TV quiz show, he hits upon the idea for her to become a writer. In the pre-1960s, her books were looked upon as trash and non-printable. But then the sexual revolution hit and an audience was born for her books. The story shows the hidden behind the scenes story of Susann's life, including her autistic son and her continuing bout with cancer that she hid up to her death."],
      "budget": 36000000
   },
   "movielensId": 3239,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-01-28",
      "dvdReleaseDate": "2000-07-18",
      "directors": ["Andrew Bergman"],
      "runtime": 95,
      "movieId": 3239,
      "title": "Isn't She Great",
      "mpaa": "R",
      "actors": [
         "Bette Midler",
         "Nathan Lane",
         "Stockard Channing",
         "David Hyde Pierce",
         "John Cleese",
         "John Larroquette",
         "Amanda Peet",
         "Dina Spybey-Waters"
      ],
      "imdbMovieId": "0141399",
      "originalTitle": "Isn't She Great",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["dxyRwPAjVXM"],
      "plotSummary": "An unsuccessful over-the-top actress becomes a successful over-the-top authoress in this biography of Jacqueline Susann, the famed writer of \"The Valley Of The Dolls\" and other trashy novels. Facing a failing career, Susann meets a successful promoter who becomes her husband. After several failures to place her in commercials and a TV quiz show, he hits upon the idea for her to become a writer. In the pre-60's, her books were looked upon as trash and non-printable. But then the sexual revolution hit and an audience was born for her books. The story shows the hidden behind the scenes story of Susan's life, including her autistic son and her continuing bout with cancer that she hid up to her death",
      "tmdbMovieId": 75531,
      "avgRating": 2.28972,
      "releaseYear": "2000",
      "numRatings": 214,
      "posterPath": "/gIEa3CRtNVul0JgTaHMvWrY65Ju.jpg"
   }
}