{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "gay",
            "id": 237
         },
         {
            "name": "parent child relationship",
            "id": 970
         },
         {
            "name": "sydney",
            "id": 5656
         },
         {
            "name": "australia",
            "id": 5657
         },
         {
            "name": "based on play or musical",
            "id": 10181
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "breaking the fourth wall",
            "id": 11687
         },
         {
            "name": "gay son",
            "id": 12342
         }
      ],
      "imdb_id": "tt0111309",
      "video": false,
      "title": "The Sum of Us",
      "recommendations": [
         19369,
         41922,
         79908,
         9098,
         19965,
         32519,
         36542,
         31978,
         41645,
         5591,
         20116,
         73252,
         4339,
         162234,
         17021,
         79926,
         15850,
         106837,
         16405,
         84337
      ],
      "backdrop_path": "/kl4hzeH7jCi18QzZyZm6Xb2PzVq.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Harry Mitchell",
               "gender": 2,
               "credit_id": "52fe45f99251416c91044cd9",
               "name": "Jack Thompson",
               "profile_path": "/l2NNfs9bd6qxqzIOahcz2hErrq8.jpg",
               "id": 12536,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Greg",
               "gender": 2,
               "credit_id": "52fe45f99251416c91044cdd",
               "name": "John Polson",
               "profile_path": "/rsjpQFAvQSo05HflPSCODCCbYFl.jpg",
               "id": 15337,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Joyce Johnson",
               "gender": 1,
               "credit_id": "52fe45f99251416c91044ce1",
               "name": "Deborah Kennedy",
               "profile_path": "/6gZtHDvmK4GbbVChvBraPpkC8fb.jpg",
               "id": 96460,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Young Jeff",
               "gender": 0,
               "credit_id": "52fe45f99251416c91044ce5",
               "name": "Joss Moroney",
               "profile_path": null,
               "id": 115713,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Gran",
               "gender": 2,
               "credit_id": "52fe45f99251416c91044ce9",
               "name": "Mitch Mathews",
               "profile_path": null,
               "id": 115714,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Mary",
               "gender": 1,
               "credit_id": "52fe45f99251416c91044ced",
               "name": "Julie Herbert",
               "profile_path": null,
               "id": 115715,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Football Coach",
               "gender": 0,
               "credit_id": "52fe45f99251416c91044cf1",
               "name": "Des James",
               "profile_path": null,
               "id": 115716,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Footballer",
               "gender": 0,
               "credit_id": "52fe45f99251416c91044cf5",
               "name": "Mick Campbell",
               "profile_path": null,
               "id": 115717,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Ferry Captain",
               "gender": 0,
               "credit_id": "52fe45f99251416c91044cf9",
               "name": "Donny Muntz",
               "profile_path": null,
               "id": 115718,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Barmaid",
               "gender": 1,
               "credit_id": "52fe45f99251416c91044cfd",
               "name": "Jan Adele",
               "profile_path": "/22JgZOVhJNKzhVdUuj4s8yp7pwC.jpg",
               "id": 115719,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Jenny Johnson",
               "gender": 0,
               "credit_id": "52fe45f99251416c91044d01",
               "name": "Rebekah Elmaloglou",
               "profile_path": null,
               "id": 115720,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Desiree",
               "gender": 0,
               "credit_id": "52fe45f99251416c91044d05",
               "name": "Lola Nixon",
               "profile_path": null,
               "id": 115721,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Greg's Mother",
               "gender": 1,
               "credit_id": "52fe45f99251416c91044d09",
               "name": "Sally Cahill",
               "profile_path": "/vruyGz7JY2iNxPqNhMkxhlOWlE9.jpg",
               "id": 115722,
               "order": 12
            },
            {
               "cast_id": 14,
               "character": "Greg's Father",
               "gender": 0,
               "credit_id": "52fe45f99251416c91044d0d",
               "name": "Bob Baines",
               "profile_path": "/mzlyNs3TwhfAWGhMhqYUXHVAAfW.jpg",
               "id": 115723,
               "order": 13
            },
            {
               "cast_id": 15,
               "character": "Jeff Mitchell",
               "gender": 2,
               "credit_id": "52fe45f99251416c91044d11",
               "name": "Russell Crowe",
               "profile_path": "/ktuOAyUHM2u2YPPChH8gAArxJ7b.jpg",
               "id": 934,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "545cb13c0e0a26042c003b2f",
               "name": "David Stevens",
               "profile_path": null,
               "id": 75429,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe45f99251416c91044d17",
               "name": "Kevin Dowling",
               "profile_path": "/nFdGJIq15hBSzgyfIiJOGIp3qJm.jpg",
               "id": 91499,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45f99251416c91044d1d",
               "name": "Geoff Burton",
               "profile_path": null,
               "id": 72629,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "545cb1430e0a261fbd003f19",
               "name": "David Stevens",
               "profile_path": null,
               "id": 75429,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.987845,
      "production_countries": [{
         "iso_3166_1": "AU",
         "name": "Australia"
      }],
      "id": 36614,
      "vote_count": 23,
      "budget": 32,
      "overview": "\"The Sum of Us\" is an Aussie story about a father and a son both searching for love and sharing an unconventional bond. Harry, the father, is the caring and open-minded \"mate\" that borders on annoyance. His son Jeff unsuccessfully searches for love, with the unwanted guidance of his father.",
      "similar": [
         449176,
         26280,
         11421,
         184352,
         376867,
         9261,
         338189,
         321,
         26371,
         258480,
         428493,
         413666,
         468,
         380874,
         10938,
         11000,
         47643,
         141,
         1966,
         14
      ],
      "original_title": "The Sum of Us",
      "runtime": 100,
      "poster_path": "/rAQAUf6HHUyoT2Ii6jUmzMu5Ppf.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Samuel Goldwyn Company",
         "id": 798,
         "origin_country": ""
      }],
      "release_date": "1994-07-12",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "We're all just . . . The Sum of Us.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Australia",
      "color": "Color",
      "budgetCurrency": "AUD ",
      "directors": [
         "Geoff Burton",
         "Kevin Dowling"
      ],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "David Stevens",
         "David Stevens"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0111309/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTA0NjExNjQ3NTdeQTJeQWpwZ15BbWU3MDczNjcyOTQ@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jack Thompson, Russell Crowe, John Polson | See full cast and crew »"],
      "reviews": [
         "I was coming out to myself.. I had this warped image of being gay that I had to develop a lisp and become high camp just to conform with being gay (I repeat I was 13 and living in the sticks.) I saw an ad for this movie TSOU and I just had to see it. With alot of precautions I caught a train for 2 hours to a movie theater that was far enough away so no one that I knew would see me going to a \"gay\" Film. Any way Sitting in the theater I was presented with an image of a gay man that didn't fall into the stereotypes I had been so used to, I guess the film taught me I could be gay with out being faggy. To simply label this as a gay movie is to miss the entire point its a Romance movie, both father and son looking for a partner of same/different gender. To make a tired point I love this movie Russell Crowe and Jack Thompson are brilliant.. I wish I had a dad like Henry.... or a boyfriend like Jeff :)",
         "This movie is the most delightful example of REAL family values ever made. Russell Crowe is adorable as the rugby-playing gay son of a charming Sydney widower played by Australia's favorite actor, Jack Thompson. This movie was number one at box offices across Australia when it came out, and it is a pity it never got wider showing in America, because it is brilliantly made, beautifully performed, and so important that it should be required viewing for all families. What goes around comes around. The gay son's dad is supportive of him and his search for love, so in the end, when the father has a stroke, the son is there to take care of him. The beautiful and true statement made by this film is enough reason to see it. But add to that some truly stunning views of Sydney, some great comedy, and a really charming romance between the father and a woman he met through a dating service, and you have one of the great cinematic delights of the 1990s. See this film and you will be glad you did.",
         "Saw this again for the first time for almost a decade, on the Sundance Channel during their Pride Festival. The character-to-camera (audience) device seems a lot stagier now than it did when I first saw it, but overall it doesn't mar any of the film's inherent bittersweet attraction. I've always been a sucker for good father/son relationship movies, and this ranks up there with the best, and not because of the twist: Harry's (Jack Thompson) almost too-willing acceptance of his son's gayness. What makes it ultimately work is the true love, respect and affection that they have for one another, a bond that is sorely tested in the film's third. Thompson is funny and engaging in a kind of role that he's not usually known for, (for that, see the excellent BREAKER MORANT.) And as for Russell...I saw this for the first time only weeks after seeing ROMPER STOMPER, and not only was it a startling contrast, but a sure-fire sign that this boyo was a talent to watch even in the early stages (now proven a thousand times over.) And here's another refreshing difference: nobody's in OTT drag, (you can rent TO WONG FOO for that), nobody gets AIDS, OD's, commits suicide or otherwise meets the Grim Reaper most tragically, as gay characters are wont to do in most big-budget Hollyweird \"gay-friendly\" dramas. David Stevens writing remains true to the joys of \"Australiana\" (a new word that I love, thanks to an earlier reviewer here), which means that some less-experienced viewers may find Harry's extremely tolerable demeanor and the turn from comedy to tragedy off-putting. (For other references to similar scenarios, see MURIEL'S WEDDING, SWEETIE and of course, MOULIN ROUGE.) But for me, it's a rare-look back at the kind of risk-taking that Russell may never again explore in his career. More than worth the cost of a rental or your time, if you can catch it.",
         "The approach taken to this gay-themed light-drama is so low-keyed and matter-of-fact, it makes the whole idea of homosexuality seem rather staid. And that's a nice change of pace, although it's not exactly invigorating for the picture! Young gay Australian plumber lives with his widower dad; they both want a serious commitment with a special someone, and both find the path to romance rather rocky, but dad is fully committed to seeing that his \"poof\" son finds a partner who won't break his heart. It's based on a play, with the two leads occasionally speaking into the camera--yet this is an idea that isn't intrusive or unpleasant. Just the opposite: the film is so good-hearted that it borders on bland. The most surprising thing you can say about it is not the (discreet) man-on-man make-out scenes, but rather the fact it's Russell Crowe acting in them. Crowe, young but not green, is very affable in this movie, shy and sweet and tender, however it's raffish Jack Thompson as his papa who steals the scenes. **1/2 from ****",
         "\"Aussie\" Film Stars Jack Thompson and Russell Crowe as father & son \"best friends\", looking for lasting love/companionship with a life partner. The aging \"dad\", who is a widower, habitually tries to play cupid for his gay 20-something son, seemingly spoiling all chances of \"success\", and eventually starts a search for his own second love. This film is hilarious, filled with great gags throughout. The deeper message of tolerance towards gays and lesbians, as well as loyalty to a loved one in need (when the father suffers a stroke, the son refuses to abandon him, caring for him like a parent would care for a small child) is not diminished by the brilliant humor which surrounds it. \"Sap-lovers\" will get their fill as well! Honored with many International Film Awards, \"The Sum Of Us\" adds up to a big winner! Highly recommended!",
         "The first time I saw this film I liked it for it's ability to reach such a wide audience. Male, female, gay, straight, young and old. With superior acting and a quiet, simple tone, it's stellar on so many levels. I like this movie more each time I see it. I usually hate when character's speak to the audience but this is one of the few occasions where it works well. One of Crowe's best performances. It was great to see a gay character that wasn't stereotypical in any way... just a guy but a guy that isn't afraid to be sensitive or tough without being wishy washy or macho. A great dead-on performance of an everyman who just happens to like men. Supporting cast is great. All performances feel natural. Directing is straightforward and the editing is lyrical. If you're heterosexual, don't be put off. The themes here are universal. A great slice of cinema no matter what your sexuality.",
         "I love this movie because it really adds another face to Russell Crowe's versatility. Everybody remembers him for Gladiator, L.A. Confidential and possibly Romper Stopmer, well, here he's an affectionate gay plumber with an eye for a boy at the bar. Within the first ten minutes you'll also be over run with Aussie-isms such as \"two ticks\" and \"Yonks\". When I first thought of the plot, I was thinking, \"Gee, this could be jazzed up a bit,\" but then I figured the simple unpolluted nature of the characters doesn't really require much more of a rollercoaster plot. After seeing this movie, I feel compelled to go to my local australian bar to find hopeless romance in a that boy across the counter. I recommend Breaking Up and Proof, if you liked this.",
         "This movie is very well-done, and you immediately care about the main characters. Father and son stories are usually a drag (\"Nothing in Common\"), but not this one. A couple of scenes will break your heart; I cried like a baby at one point. It is especially worthwhile if you are gay, and discovered that about yourself as a child.",
         "A very special Aussie film dealing with the strains of gay males and society issues in their path. Top performances by Russell Crowe and John Polson , with monumental support from legendary icon actor Jack Thompson as the understanding and supportive father. A must see film in my book , as reality meets society , with a realistic feel for todays cinema. Unlike many other of Crowes films , this one is very serious and addresses very real issues in todays multicultural society , and especially the gay movement of Sydney , Australia. This film hits the viewer head on with the unknown side of single sex relationships , and their effects on both family and friends.",
         "This movie took me by surprise, it is personable, sincere and utterly Australian. It explores its themes in a beautiful manner, through the relationships between family, especially father and son. Don't be put off by Russel Crowe. I myself almost didn't watch it because he was in it, but I have to say, he did a brilliant job. He took the character and made it his own, and I feel no one else could have played the part any better. Take into account that this movie was originally a stage play, so there are various monologues and direct engagement with the audience. This at first is a little surprising and perhaps even uncomfortable, as we are so used to being purely observers when watching a movie. After initial surprise however I found the technique refreshing, it gave the film a more personable and intimate quality. I revel in how Australian this film is, the fact that I use the same brands of mustard and soy sauce which at one point appeared at the dinner table, made me unusually delighted and also pulled me into the realism which the film tries and succeeds in conveying. At risk of sounding patriotic, it almost made me proud to be Australian. This is probably one of my favourite movies, in its exploration of love and how it should not be dictated by the limits of our society."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Australian Film Finance Corporation (AFFC)",
         "Great Sum Film Limited Partnership",
         "Samuel Goldwyn Company, The"
      ],
      "summaries": [
         "Set in Sydney, Australia. A (heterosexual) father and his gay son are trying to find Ms/Mr Right respectively. The film shows their relationships with one another and the objects of their affection as tradgedy strikes. There is no overt 'message' in the film, just a very natural, entertaining story-telling.",
         "\"The Sum of Us\" is an Aussie story about a father and a son both searching for love and sharing an unconventional bond. Harry, the father, is the caring and open-minded \"mate\" that borders on annoyance. His son Jeff unsucessfully searches for love, with the un-wanted guidance of his father.",
         "A widowed father has to deal with two complex issues: while he is searching for \"Miss Right,\" his son, who is in his 20s and gay, is searching for \"Mr. Right.\""
      ],
      "budget": 3465000
   },
   "movielensId": 324,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-07-12",
      "dvdReleaseDate": "2003-06-03",
      "directors": [
         "Kevin Dowling",
         "Geoff Burton"
      ],
      "runtime": 100,
      "movieId": 324,
      "title": "The Sum of Us",
      "mpaa": "R",
      "actors": [
         "Jack Thompson",
         "John Polson",
         "Deborah Kennedy",
         "Joss Moroney",
         "Mitch Mathews",
         "Julie Herbert",
         "Des James",
         "Mick Campbell",
         "Donny Muntz",
         "Jan Adele",
         "Rebekah Elmaloglou",
         "Lola Nixon",
         "Sally Cahill",
         "Bob Baines",
         "Russell Crowe"
      ],
      "imdbMovieId": "0111309",
      "originalTitle": "The Sum of Us",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["rBGjUQJ_1Dc"],
      "plotSummary": "\"The Sum of Us\" is an Aussie story about a father and a son both searching for love and sharing an unconventional bond. Harry, the father, is the caring and open-minded \"mate\" that borders on annoyance. His son Jeff unsuccessfully searches for love, with the unwanted guidance of his father.",
      "tmdbMovieId": 36614,
      "avgRating": 3.69507,
      "releaseYear": "1994",
      "numRatings": 487,
      "posterPath": "/rAQAUf6HHUyoT2Ii6jUmzMu5Ppf.jpg"
   }
}