{
   "tmdb": {
      "original_language": "bo",
      "keywords": [{
         "name": "sport",
         "id": 6075
      }],
      "imdb_id": "tt0201840",
      "video": false,
      "title": "The Cup",
      "recommendations": [
         50010,
         44807,
         67025,
         28632,
         62637,
         74799,
         38977,
         19362,
         48834,
         37691,
         199615,
         39784,
         40863,
         33251,
         142499,
         18290
      ],
      "backdrop_path": "/mH68O5bWnFGPcns6e8fxQ9zxQHh.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Geko",
               "gender": 0,
               "credit_id": "52fe45fb9251416c750691c1",
               "name": "Orgyen Tobgyal",
               "profile_path": null,
               "id": 116289,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Lodo",
               "gender": 0,
               "credit_id": "52fe45fb9251416c750691c5",
               "name": "Neten Chokling",
               "profile_path": null,
               "id": 233102,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Orgyen",
               "gender": 0,
               "credit_id": "52fe45fb9251416c750691c9",
               "name": "Jamyang Lodro",
               "profile_path": null,
               "id": 116291,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Abbot",
               "gender": 0,
               "credit_id": "52fe45fb9251416c750691cd",
               "name": "Lama Chonjor",
               "profile_path": null,
               "id": 1189229,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Old Lama",
               "gender": 0,
               "credit_id": "52fe45fb9251416c750691d1",
               "name": "Lama Godhi",
               "profile_path": null,
               "id": 1189230,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe45fb9251416c750691b7",
               "name": "Khyentse Norbu",
               "profile_path": "/sXxRF8YMx50WV4nL3DmyW8Ls3wR.jpg",
               "id": 115309,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45fb9251416c750691bd",
               "name": "Khyentse Norbu",
               "profile_path": "/sXxRF8YMx50WV4nL3DmyW8Ls3wR.jpg",
               "id": 115309,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "586791c29251413e3f0091c9",
               "name": "Paul J. Warren",
               "profile_path": null,
               "id": 1188041,
               "department": "Crew",
               "job": "Cinematography"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 1.386042,
      "production_countries": [
         {
            "iso_3166_1": "BT",
            "name": "Bhutan"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 14521,
      "vote_count": 13,
      "budget": 0,
      "overview": "While the soccer World Cup is being played in France, two young Tibetan refugees arrive at a monastery/boarding school in exile in India. Its atmosphere of serene contemplation is disrupted by soccer fever, the chief instigator being a young student, the soccer enthusiast Orgyen who desperately seeks a TV to watch the final.",
      "similar": [
         10393,
         2300,
         9655,
         9291,
         4942,
         11287,
         10637,
         8923,
         22881,
         13416,
         323677,
         86130,
         9614,
         42888,
         9472,
         11770,
         37136,
         9390,
         920,
         17108
      ],
      "original_title": "Phörpa",
      "runtime": 93,
      "poster_path": "/rvwfUAArjPtDjnYfhBDyxAh5UN1.jpg",
      "spoken_languages": [
         {
            "name": "हिन्दी",
            "iso_639_1": "hi"
         },
         {
            "name": "",
            "iso_639_1": "bo"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Palm Pictures",
            "id": 27934,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Coffee Stain Productions",
            "id": 93483,
            "origin_country": ""
         }
      ],
      "release_date": "1999-08-29",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "Buddhism is their philosophy. Soccer is their religion.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Bhutan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Khyentse Norbu"],
      "runtime": 93,
      "synopsis": null,
      "writers": ["Khyentse Norbu"],
      "originalLanguage": "Hindi",
      "imdbLink": "http://www.imdb.com/title/tt0201840/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI1NjUxODc3OV5BMl5BanBnXkFtZTcwODU2MDU1MQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Orgyen Tobgyal, Neten Chokling, Jamyang Lodro | See full cast and crew »"],
      "reviews": [
         "In the 1950s, the Chinese invaded Tibet, killing one fifth of the six million inhabitants and destroying over 10,000 Buddhist monasteries. Today, Buddhism is strictly forbidden in Tibet and even owning a picture of the Dalai Lama is a crime. Consequently, many families send their children to monasteries-in-exile in India and Bhutan in order to receive a traditional Buddhist education. The Cup is set in such a monastery, at the time of last World Cup. Orgyen (Jamyang Lodro) is a young monk who is obsessed with football. When he isn't pretending to be Ronaldo or discussing the World Cup in the middle of prayer, he is planning to see the next game in the local village without getting caught by Geko (Orgyen Tobgyal, Jamyang Lodro's father in real life), the father-figure disciplinarian of the monastery. With his friend Lodo (Neten Chokling), he quickly persuades new arrival Palden (Kunsang Nyima) to join them, while Geko and the Abbot (Lama Chonjor, real-life Abbot of Chokling Monastery, where The Cup was filmed) try to maintain discipline and fathom the rules of the game. Directed by Khyentse Norbu, a first time feature director and important Buddhist figure himself, The Cup features an all-monk cast, none of whom had any acting experience prior to filming. Essentially a documentary about monastic life, The Cup nevertheless shows the realities of the Tibetans' political situation and combines serious issues with a more light-hearted style. It is genuinely witty in places and with great performances from Jamyang Lodro and Orgyen Tobgyal, always a pleasure to watch. The foothills of the Himalayas are beautifully photographed and the score is appropriately inobtrusive. On what is usually described as a 'shoestring budget' ('sandal-strap' might be more appropriate) Khyentse Norbu has created a lovely little film that deserves all the success it can get.",
         "This is a delightful little film, and freshman effort from the little country of Bhutan. Had it not been based on true events, I would have found it hard to believe. Not claiming to know much about the life of a Bhuddist Monk, I didn't think they allowed themselves to be interested in more than chanting and karmic evolvement. This film acts as a great \"equalizer\", confirming my beliefs that we all are the same. We just tend to say it differently. The young monk who is the protaganist of this film reminds me so much of many young men I know. With his pushy, overbearing and sometimes irreverent behavior, you see a side of monkhood that is so often hidden in films. They are not perfect and they are prone to the same foibles we all have. Mainly, DESIRE. And desire no matter how innocent, or deviant, will get you everytime. The landscape appeared to be beautiful, the misty Himalayas, the rolling fields and saffron robes blowing in the wind beneath matching parasols. Unfortunately the cinematographer did not capitalize on all of this natural beauty, but merely glanced at the splendor as if it were merely coincidental. So all we get are mere glimpses at what should have been scenes lovingly caressed by the lens. This was a situation where the landscape and the camera should have clearly become lovers. But beyond that, I was swept away at the innocence of the director and it was a refreshing change to my jaded eyes. In my opinion, the more contrived Hollywood machine would not have been able to do more justice to this simple forthright piece of storytelling. And I am personally pushing for them to see the next World Cup games in person. Wanna take up a collection?",
         "Being that two of my many passions in life are soccer and movies I was very interested in seeing this film. Needless to say, I really enjoyed it. Sometimes a little slow but more than makes up for it. Besides having some VERY funny moments and wonderful characters (that kid was just a scream) the movie really de-mystefies the budhist monks that Westerners seem to sterotype as extremely devoted and mystical. In reality they are just like us. They have their passions, and joke about everything just like everyone else. They are shown in this film for what the truly are, 'human'. Sure the movie shows the practices which is interesting to see, but it then shows scenes of the devotees, talking about girls, fascinated by the outside world (soccer), not practing their studies, being lazy, and acting just like everyday people. Great fun film. Rating 8 out of 10 PS - Yes I'd try my darndest too to not miss the World Cup final.",
         "This film is an authentic look at the situation that many young Tibetan men and boys find themselves in following the Chinese occupation of Tibet. But the film doesn't dwell on Tibetan politics, it is a light-hearted and elegantly-simple film inspired by true events at a Tibetan monastery-in-exile in Bhutan, where young Buddhist monks develop an interest in the World Cup soccer final. The Abbot of the monastery and the older Lamas just have no idea what soccer is, and there is a humorous scene where the old Lama is sleeping in the sun and the young monk Orgyen comes up to him: Orgyen: \"Do a prediction for us Lama\"; Old Lama: \"Can't you see I'm busy!\"; Orgyen: \"At least say prayers for France\"; Old Lama: \"Are they sick?!!?\" And when everyone has seen the World Cup final, the serious Buddhist message comes home, in a beautiful way... \"If a problem can be solved, why be unhappy? And if it cannot, what is the use of being unhappy?\" 'The Cup' contrasts strongly with earlier big-budget, stylised, productions about Tibetan Buddhism such as 'Seven Years in Tibet' and 'Kundun'. It is in the same vein as 'Samsara', which is also a very good film. PS Director Khyentse Norbu (who is said to be a re-incarnate Lama) also has a new movie out -- 'Travellers and Magicians' (2003).",
         "i just finished watching this show on DVD. Generally a simple story with predictable plot. I always thought this movie is about some young monks trying hard to play football in their secular life. But, it turned out to be a world cup which changed the lives of these monks. More importantly, the show allows the public to see the hidden side of these monks. They can be playful and lazy. They are even capable of playing pranks and cracking good jokes. Orgyen is certainly a notable character in the show. A strong personality who display no religious qualities in the earlier parts of the film. i like him more and more as the show progressed. The film ties strongly to Buddhist teachings and gives you a new perspective to life and Buddhism. Expect to be exposed to some Tibetan culture and football.",
         "I first saw this movie in a theater several years ago, not knowing what to expect. I remember that the children's singing at the beginning of the movie sounded a little harsh (unlike anything I'd heard before) but, by the end, the same singing enchanted me, I heard its sweetness, and I left knowing I had to see the movie again to take it all in. Since then I've bought the movie and I'm delighted that my young soccer-loving nieces and nephews (from different countries) love the movie as well, and want to see it whenever they visit--a tiny little contribution towards cross-cultural awareness. Great movie for kids and adults.",
         "A quasi-documentary look at the daily lives of a bunch of Buddhist monks living in exile, in India. A thin plot line has some of the younger monks, soccer fans all, contriving to watch the 1998 World Cup by collecting enough money to rent a TV and satellite dish for the evening of the contest. A more interesting plot element has two young men spirited out of China and taken in by the monastery to become monks in training. We get to watch the daily lives of these monks, all or most of whom are evidently the real thing and not actors. The movie is absolutely fascinating as it shows Buddhist monks are no different than you and I in their wants and desires. The movie has a light, almost whimsical touch, but is not without its serious moments. By the end, we and the monks have learned an important lesson or two, without being hammered over the head with it. The storyline is punctuated by some breathtaking photography of the land in which these exiles are living.",
         "I like ''Phörpa'' for many reasons. One of them, is to see some of the Tibetan's culture,that I always found one of the most beautiful and interesting cultures from the East. Other, was the plot, because all the movies I already watched with Tibetan themes was to show Dalai Lama's life or Tibet's situation,what means that they were all serious movies with serious themes. I like serious plots and themes, but 'Phörpa' is very remarkable because it shows a funny side of the young monks and their disciplined life. The story passes during the World Cup, and the character Orgyen is very funny and full of life,removing the myth that the young monks who live in the monastery needs to have passive personality. We see that all the young monks are humans as we are, and they also like soccer!:) I liked a lot and I deeply recommend it!",
         "Similar to \"Kundun\" this film captures the charm and dignity of the oppressed Tibetan monks. It also captures the romance and addiction of football. You watch this film, and remember the ease and comfort with which you and I watched France '98. Many others are not so lucky. They do not deserve our pity, nor does this film seek it. Instead it champions life, and our inner-spirit and resolve. A charming little film. Free Tibet!",
         "Phorpa is a simple and beautiful movie..it deserves more star than it got. This simple movie does not contain any gimmick, car chasing, fighting, evil spirit, hero-anti hero ( the conventional movie subjects ), but contains feelings expressed by very common people ( who are also political victim and list their country ). Its superb direction, since there was enough reason to show battles between countries, hatred among people and religion..but nothing was shown...in stead , it says: \"Give up hatred, since you can't win over all the enemies..enemies are endless\"..What a message!!! I hope audience gets the above message since it comes directly from the sufferers who has lost their own country, yet you don't hear much against anything! This carefully drawn story teaches us lot while its objective was not teaching... Its superb, its terrific..gets a 10 out of 10 rating!"
      ],
      "genres": [
         "Comedy",
         "Sport"
      ],
      "productionCompanies": [
         "Coffee Stain Productions",
         "Palm Pictures"
      ],
      "summaries": [
         "While the soccer World Cup is being played in France, two young Tibetan refugees arrive at a monastery/boarding school in exile in India. Its atmosphere of serene contemplation is somewhat disrupted by soccer fever, the chief instigator being a young student, the soccer enthusiast Orgyen. Prevented by various circumstances from seeing the Cup finals on television in a nearby village, Orgyen sets out to organize the rental of a TV set for the monastery. The enterprise becomes a test of solidarity, resourcefulness and friendship for the students, while the Lama, head of the monastery, contemplates the challenges of teaching the word of Buddha in a rapidly changing world.",
         "Due bambini tibetani, Palden e Nyima, sono in fuga dal Tibet occupato dai cinesi per essere iniziati alla vita monacale in un monastero sull'Himalaya. Qui conoscono altri ragazzi, appassionati di calcio come loro : sono in svolgimento in mondiali in Francia. Un giorno decidono di effettuare una fuga per andare ad assistere alla semifinale. Scoperti dal monaco Geko, rischiano l'espulsione dal convento. Il saggio Kempo deve risolvere la questione morale : rinunciare alla futilità dell'incontro di calcio o accontentare i desideri dei ragazzi ? \"Se un problema può essere risolto, perché essere infelici ? E se non può essere risolto, a che serve essere infelici ?\" Umorismo sfrontato e saggezza tibetana si mescolano in questo delicato film, che ha più di un punto di interesse e di curiosità. E' il primo film in lingua tibetana ; è diretto da un autentico Lama, Khyentse Norbu, ovvero Sua Eminenza Dwongsar Jamyang Rinpoche (reincarnazione di Jamyang Khentse Wangpo, morto nel 1892) ; è girato a Chokling, in un autentico monastero buddista ; è interpretato in gran parte dagli stessi monaci tibetani ; è la prima produzione bhutanese (in coproduzione con l'Australia). Divertente, intelligente, originale."
      ],
      "budget": 0
   },
   "movielensId": 3241,
   "movielens": {
      "languages": [
         "हिन्दी",
         "",
         "Français"
      ],
      "releaseDate": "1999-08-29",
      "dvdReleaseDate": "2000-03-28",
      "directors": ["Khyentse Norbu"],
      "runtime": 93,
      "movieId": 3241,
      "title": "The Cup",
      "mpaa": "G",
      "actors": [
         "Orgyen Tobgyal",
         "Neten Chokling",
         "Jamyang Lodro",
         "Lama Chonjor",
         "Lama Godhi"
      ],
      "imdbMovieId": "0201840",
      "originalTitle": "Phörpa",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "While the soccer World Cup is being played in France, two young Tibetan refugees arrive at a monastery/boarding school in exile in India. Its atmosphere of serene contemplation is disrupted by soccer fever, the chief instigator being a young student, the soccer enthusiast Orgyen who desperately seeks a TV to watch the final.",
      "tmdbMovieId": 14521,
      "avgRating": 3.61968,
      "releaseYear": "1999",
      "numRatings": 376,
      "posterPath": "/rvwfUAArjPtDjnYfhBDyxAh5UN1.jpg"
   }
}