{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0126651",
      "video": false,
      "title": "Santitos",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "",
               "gender": 1,
               "credit_id": "52fe470fc3a36847f812128d",
               "name": "Dolores Heredia",
               "profile_path": "/iBDhc3pqreLpIoF8pSzcyBOYjt5.jpg",
               "id": 224507,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "",
               "gender": 2,
               "credit_id": "52fe470fc3a36847f8121291",
               "name": "Demián Bichir",
               "profile_path": "/hIldnp3pj3LeDq1rVfGgVy4a7cT.jpg",
               "id": 76961,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "",
               "gender": 2,
               "credit_id": "598a5712c3a368755f021b2e",
               "name": "Alberto Estrella",
               "profile_path": "/mbzQRSMSjGFl0CWdI9pG6fNn2L.jpg",
               "id": 940958,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 2,
               "credit_id": "52fe470fc3a36847f8121299",
               "name": "Pedro Altamirano",
               "profile_path": null,
               "id": 941030,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 2,
               "credit_id": "52fe470fc3a36847f812129d",
               "name": "Roberto Cobo",
               "profile_path": "/OvLu1CDAldY67LzqeUX5uc3iL6.jpg",
               "id": 11975,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 2,
               "credit_id": "53085aa1c3a3684208002106",
               "name": "Roger Cudney",
               "profile_path": "/pPUl0KJg5UgJ2bnbpxz2zzM80vx.jpg",
               "id": 78006,
               "order": 6
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe470fc3a36847f81212a7",
            "name": "Alejandro Springall",
            "profile_path": "/8aQkAmk8NbKeSz1I80wvHYLt6jT.jpg",
            "id": 943155,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.149152,
      "production_countries": [
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "MX",
            "name": "Mexico"
         },
         {
            "iso_3166_1": "ES",
            "name": "Spain"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 46835,
      "vote_count": 2,
      "budget": 0,
      "overview": "After St. Jude appears in Esperanza's oven, she sets out to find her daughter, who died under mysterious circumstances. The journey forces Esperanza to challenge her own beliefs and face her fears in order to be reunited with her beloved daughter.",
      "similar": [],
      "original_title": "Santitos",
      "runtime": 105,
      "poster_path": "/jwD6dboXVeGAa7CJ7cK4wRPo5VY.jpg",
      "spoken_languages": [{
         "name": "Español",
         "iso_639_1": "es"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Maite Argüelles",
            "id": 28553,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Instituto Mexicano de Cinematografía (IMCINE)",
            "id": 8861,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Coproducción México-Francia-España-Canadá-EEUU",
            "id": 28554,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Fondo para la Producción Cinematográfica de Calidad (FOPROCINE)",
            "id": 9980,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Tabasco films",
            "id": 6647,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Fondo de Fomento a la Calidad Cinematográfica",
            "id": 28555,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Springall Pictures",
            "id": 28556,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "José Pinto",
            "id": 28557,
            "origin_country": ""
         }
      ],
      "release_date": "1999-01-23",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Mexico",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Alejandro Springall"],
      "runtime": 105,
      "synopsis": "Based on the novel by María Amparo Escandón. After the widowed Esperanza loses her daughter, Blanca, to a rare virus, she searches her faith for an explanation. When St. Jude appears to her in her oven and tells her that her daughter is still alive, Esperanza convenes with her priest, who agrees that it must be a sign. Despite her roommate's protest, she continues to search for her daughter. The doctor who treated her daughter at the hospital disappears a day after Blanca dies. After being caught while trying to dig up her daughter's grave and being visited by St. Jude twice more, Esperanza becomes convinced her daughter was kidnapped and sold as a sex slave. She believes her daughter is at a brothel in Tijuana. She travels north across Mexico to find her daughter. After a long bus trip, during which she is robbed, she arrives in Tijuana. In order to find her daughter, Esperanza must become a a prostitute. After unveiling some unseemly secrets in the brothel in Tijuana, but failing to find her daughter, she sets out for Los Angeles. In Los Angeles, she continues the search for her daughter. She meets a masked wrestler and falls in love with him while trying to find her daughter. After a sign from the Virgin Mary, Esperanza decides to return home. Cartagena Film Festival, 2000: Golden India Catalina - Best Actress (Dolores Heredia); Best Production Design (Eugenio Caballero, Salvador Parra).",
      "writers": ["María Amparo Escandón"],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt0126651/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk0NDE1Nzg2OV5BMl5BanBnXkFtZTcwMDIxNTAzMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Dolores Heredia, Demian Bichir, Alberto Estrella | See full cast and crew »"],
      "reviews": [
         "It's a drama that slowly turns into a sharp comedy. Even though you never forget the seriousness of the situation, you start enjoying the sequence and the slight turns of the plot. It reflects the impacts of faith and some ways to pursue it, and it never fails to deliver a touch of reality in a subtle way, even if some situations are a little overacted ... it was a joy to see it",
         "After St. Jude appears in Esperanza's oven, she sets out to find her daughter, who died under mysterious circumstances. The journey forces Esperanza to challenge her own beliefs and face her fears in order to be reunited with her beloved daughter. The film is full of humor, sorrow, oddball characters, bizarre situations and danger. Through it all is an underlying message of the power that love has to change us all in the most unexpected ways. A visual treat too, \"Santitos\" paints a beautiful, funny and compassionate picture of Mexico. But director Springall doesn't isolate his message. We all know at least one of the characters, and have probably visited similar places. This connection to the world outside of Esperanza, Veracruz and Mexico is what manages to touch us all.",
         "In Mexico, the very religious woman Esperanza (Dolores Heredia) has just lost her teenager daughter Blanca (Maya Zapata) in a simple throat surgery. The girl contracted an unknown virus, and had to be buried in a sealed closed coffin. While cooking at home, Esperanza sees the image of São Judas Tadeu projected on the dirty oven of her stove, who tells her that she shall look for her daughter. Esperanza, in her mind, believes the doctor sold her virgin daughter to some brothel and decides to look for her in many whorehouses in her town, in Tijuana and in Los Angeles. She confesses every vision she had and what she did to Padre Salvador (Fernando Toree Laphame), who advises her about how to she should have proceeded. Her journey begins in Mexico and ends in Los Angeles, where she meets the fighter Ángel (Alberto Estrella). They fall in love for each other. The end of this funny story is not corny. This film is one of the most intelligent comedies I have ever seen. Beginning with the name of each character: Esperanza means `hope'; Blanca means `white', the symbol of purity; Padre Salvador means `priest who saves'; Los Angeles means `the angels'; Paloma means `dove', the symbol of peace; Ángel means `angel'. Further, there are many jokes with saints, but all of them very respectful. The confessions of Esperanza, always after some confusion, are also hilarious. However, the beliefs of Esperanza are very respected until the last scene. She begins very fragile, but in the end she finds love and accepts the death of her daughter, although keeping her faith. The story, although being a love and hope story, is not corny. I liked it a lot. My vote is eight.",
         "Consider Esperanza Diaz, a young widow who must deal with the death of her teen aged daughter Blanca. She is inconsolable, to say the least. Esperanza discovers one day the image of Saint Jude, the patron saint of impossible causes, in the door of her grimy oven, which she has neglected because she has no Easy-off cleaner. The saint speaks to her and tells her Blanca is alive. Esperanza runs to the church to tell it to Father Salvador, who goes along trying to appease the distraught woman. Esperanza, who shares a house with another woman, Soledad, knows Blanca's death doesn't make sense. The girl went into the hospital for a minor procedure and ends up dead, under mysterious circumstances. Her body is never released to Esperanza because supposedly it can spread a certain type of virus. In trying to see Blanca's doctor, Esperanza is told he no longer practices in the hospital. When St. Jude appears again, he tells her about a pink house where Blanca is kept against her wishes. The house happens to be in Tijuana, a far away place from her small town in Veracruz. Esperanza decides to follow her hunch and ends up in the northern border city. In Tijuana she gets a run around, and she ends up in a series of situations that involve prostitution, something that she does against he will because she is determined to find her daughter. Her quest takes her to Los Angeles, a city that proves to be not too friendly to Esperanza, but in which she ends up finding love when she meets a wrestling star that falls in love with her. Esperanza, who decides to go back to Veracruz finally gets a vision of Blanca in a mirror on a wall of her house. When the wrestler shows up in her town, she decides to take the chance, not before ripping the wall where she can see Blanca's image. Alejandro Springall, the director of this wonderfully entertaining film, shows a natural talent for bringing together all the elements and make it work. The film is based on a novel by Maria Amparo Escandon, who also appears briefly in the film. \"Santitos\" made quite an impression when it was presented at the Sundance Film Festival. The film mixes superstition with an adventure. The second half of the film is a road movie as Esperanza sets out to bring Blanca home. Dolores Heredia does a splendid job as Esperanza. She gives an inspired performance and holds the picture together. This sunny actress should be seen more often because she proves to be a natural in front of the camera. Others in the film include Damian Bichir, in a small role. Alberto Estrella, Roberto Cobo and Ana Berta Espin contribute to enhance the film. \"Santitos\" merits a view and it's a shame it didn't get a wider distribution in this country.",
         "Judging from the other negative comments left here, I guess you really have to have a little \"latin\" in your heart, to really appreciate, and understand, and love this gem of a movie... Not since \"El Norte\", have I enjoyed such a film about human trail, and self-realization. This is the first film I've ever seen that truly conveys a sense of a person's \"conviction\" in her faith, and the lengths she is willing to go, to find her daughter----so tragically lost, that the obvious seems to always elude her, as she proceeds in her mission amidst confusion and temptation, and dispair. As should be in real life, this innocent and naive woman prevails in the end, when her pain is replaced, with closure, and joy. I do not think westerners (Hollywood) can make such heart-felt and endearing movies like this. I am a Californian, U.S. born, and have seen about every Hollywood movie ever made, but the 2 BEST movies I have ever seen, just happen to be -----latin productions!",
         "I had lost my faith in national productions after \"El coronel no tiene quien le escriba\" and \"Un embrujo\". Santitos made me believe in mexican films again!It's a wonderful road movie about faith and sacrifice. Really funny, with great photography work and excellent actors. If you've watched mexican movies from the last decade, you'll know all of them are about poverty and misery, a depressing look at Mexico. But Santitos is like a ray of light in a dark national film industry. Don't miss it!",
         "This is really an excellent movie. I was very surprised to read the great reviews it got in the New York Times, Los Angeles Times, Chicago Sun-Times, Dallas Morning News, New York Daily News, Time Out, LA Weekly, Movie Maker, etc. Incredible reviews appeared on most newspapers in Spain as well. I highly reccomend to see this fun picture becauser the story is unique, the acting superb, and the light-hearted way of telling this story is unforgettable. Don't miss this classic",
         "Alejandro Springall's movie SANTITOS (LITTLE SAINTS) is a pure joy to watch. An allegory of a woman's search to find herself dressed in the symbolism of her religious faith, it's somewhat akin to Paolo Coelho's novella \"The Alchemist\" in spirit. Esperanza's plight to find her daughter Blanca (Maya Zapata) whom she believes is not dead is really a ruse to get her out of the strict confines of her home. The equivalent of a MacGuffin, we know at a gut level Blanca is clearly dead, but in Esperanza's mind, she is not because she has just seen the apparition of San Judas Tadeo within her oven. And in Latin-American culture, once a saint appears, you have to listen and act accordingly; after all, saints are all-knowing and have miracles to perform. For Esperanza, a miracle would be to be reunited with Blanca, but what she ignores is that saints and spirits work in special ways and put our love and devotion to the test. Visually a feast for the eyes, SANTITOS is equal parts magic realism, equal parts adventure, equal parts comedy, and equal parts visual surrealism, most notably in a sequence involving Esperanza walking into a brothel owned by a Doña Trini (Roberto Cobo) who has a surprise involving the worship of a cow. Dolores Heredia makes you believe in what otherwise would be madness. That she has to go so far away from home to find what was always there and come back a more complete person -- with a kind man in tow played by the masculine, regal Alberto Estrella -- is part of the fun this movie is.",
         "Santitos has many wonderful things: great photography by Xavier Perez Grobet, some good acting, particularly by Demian Bichir, and the supporting actors, excellent art direction, a nice sense of humor, a good music score by Carlo Nicolau. Its weaknesses are a wooden performance by the actress who plays Esperanza, the main character. With a better, more expressive actor, this movie could have soared, since she has to carry the bulk of it. She's lovely to look at, but her performance lacks character. The story drags on a little bit too long and doesn't really seem to have much of a point. As is typical in Mexico it seems that women can only be either saints or whores -- and the novel and screenplay were written by a woman! However, it's a promising first film by Alejandro Springall and will undoubtedly delight fans of the \"Like Water for Chocolate\" school of magical realism.",
         "I really wanted to like this film. The advertising really fooled me--I believed I was going to see another \"Como Agua Para Chocolate.\" Wrong! The movie starts wonderfully. Esperanza's refuses to believe her recently deceased daughter is really dead and starts to search for her. First in her beautiful little town in the Veracruz state of Mexico, then Tijuana, followed by LA, and back to her hometown. Her journey was supposed to show how Esperanza changes and becomes a stronger person, but the lead actress--Dolores Heredia--was unable to do so. This is not so much her fault as she is quite appealing: I believe that the directors development of side characters and subplots take the focus away from the character development of Esperanza. This film is not without merit. The cinematography by Xavier Perez Grobet is top-notch, as well as the art direction. This film is a step in the right direction for contemporary Mexican film, but it still has a way to go."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "C.O.R.E. Digital Pictures",
         "Cinematografica Tabasco S.A.",
         "Dr. José Pinto Mazal"
      ],
      "summaries": ["When St. Jude appears to her to tell her that her daughter is still alive, Esperanza goes on a search to find her daughter."],
      "budget": 0
   },
   "movielensId": 3242,
   "movielens": {
      "languages": ["Español"],
      "releaseDate": "1999-01-23",
      "dvdReleaseDate": "2003-09-16",
      "directors": ["Alejandro Springall"],
      "runtime": 105,
      "movieId": 3242,
      "title": "Santitos",
      "mpaa": "",
      "actors": [
         "Dolores Heredia",
         "Demián Bichir",
         "Alberto Estrella",
         "Pedro Altamirano",
         "Roberto Cobo",
         "Roger Cudney"
      ],
      "imdbMovieId": "0126651",
      "originalTitle": "Santitos",
      "genres": [
         "Drama",
         "Foreign",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "After St. Jude appears in Esperanza's oven, she sets out to find her daughter, who died under mysterious circumstances. The journey forces Esperanza to challenge her own beliefs and face her fears in order to be reunited with her beloved daughter.",
      "tmdbMovieId": 46835,
      "avgRating": 3.30508,
      "releaseYear": "1999",
      "numRatings": 59,
      "posterPath": "/jwD6dboXVeGAa7CJ7cK4wRPo5VY.jpg"
   }
}