{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "theatre play",
         "id": 4326
      }],
      "imdb_id": "tt0076095",
      "video": false,
      "title": "The Goodbye Girl",
      "recommendations": [
         19827,
         37296,
         34014,
         25113,
         31944,
         116857,
         42122,
         40509,
         69007,
         39787,
         42719,
         32077,
         32855,
         15720,
         13571,
         20242,
         31587,
         44181,
         61418,
         17450
      ],
      "backdrop_path": "/gOsM9tiecfRvz9XMMvJCjEC7c6A.jpg",
      "revenue": 102000000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Elliot Garfield",
               "gender": 2,
               "credit_id": "52fe46149251416c7506c6b3",
               "name": "Richard Dreyfuss",
               "profile_path": "/7JPMhXnfY5jgPbtByutwkHHZS3M.jpg",
               "id": 3037,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Paula McFadden",
               "gender": 1,
               "credit_id": "52fe46149251416c7506c6b7",
               "name": "Marsha Mason",
               "profile_path": "/1iTPM9ciKMFb5RzePlcKhfWO0Fb.jpg",
               "id": 19131,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Lucy McFadden",
               "gender": 1,
               "credit_id": "52fe46149251416c7506c6bb",
               "name": "Quinn Cummings",
               "profile_path": "/c1j57t0iR4ebypMcTdlkX4qJLo.jpg",
               "id": 77224,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Mark",
               "gender": 2,
               "credit_id": "52fe46149251416c7506c6bf",
               "name": "Paul Benedict",
               "profile_path": "/Al8zMhyw1EpWVySU0XONYGfXcvB.jpg",
               "id": 41243,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Donna",
               "gender": 1,
               "credit_id": "52fe46149251416c7506c6c3",
               "name": "Barbara Rhoades",
               "profile_path": "/4Fgbg4LvRZoahvKjEslfmx8tV7v.jpg",
               "id": 77225,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Mrs. Crosby",
               "gender": 1,
               "credit_id": "52fe46149251416c7506c6c7",
               "name": "Theresa Merritt",
               "profile_path": "/aTxceAux9NNaclxPJGOhMKvEruM.jpg",
               "id": 77226,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Ronnie",
               "gender": 2,
               "credit_id": "52fe46149251416c7506c6cb",
               "name": "Michael Shawn",
               "profile_path": null,
               "id": 77227,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Rhonda",
               "gender": 0,
               "credit_id": "52fe46149251416c7506c6cf",
               "name": "Patricia Pearcy",
               "profile_path": "/uS5RJUC8PqyN6b1upP52X5n6MKZ.jpg",
               "id": 77228,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Assistant Choreographer",
               "gender": 2,
               "credit_id": "52fe46149251416c7506c6d3",
               "name": "Gene Castle",
               "profile_path": null,
               "id": 77229,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Dance Instructor",
               "gender": 2,
               "credit_id": "52fe46149251416c7506c6d7",
               "name": "Daniel Levans",
               "profile_path": null,
               "id": 77230,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Linda",
               "gender": 1,
               "credit_id": "52fe46149251416c7506c6db",
               "name": "Marilyn Sokol",
               "profile_path": "/lRyHZYQ7Xa2IC7Jrk0RkmwgyGR.jpg",
               "id": 60142,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Mrs. Morganweiss",
               "gender": 1,
               "credit_id": "52fe46149251416c7506c6df",
               "name": "Anita Dangler",
               "profile_path": null,
               "id": 77231,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Mrs. Bodine",
               "gender": 0,
               "credit_id": "52fe46149251416c7506c6e3",
               "name": "Victoria Boothby",
               "profile_path": null,
               "id": 77232,
               "order": 12
            },
            {
               "cast_id": 14,
               "character": "Liquor Store Salesman",
               "gender": 2,
               "credit_id": "52fe46149251416c7506c6e7",
               "name": "Robert Costanzo",
               "profile_path": "/vyUeNk56Yv7xyHztgVa8UBEIasu.jpg",
               "id": 33492,
               "order": 13
            },
            {
               "cast_id": 15,
               "character": "Mugger",
               "gender": 0,
               "credit_id": "52fe46149251416c7506c6eb",
               "name": "Pancho González",
               "profile_path": null,
               "id": 77233,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe46149251416c7506c6f1",
               "name": "Herbert Ross",
               "profile_path": "/5bKYVnMfWhjAOmMHv7Y6boqnOja.jpg",
               "id": 18378,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46149251416c7506c6f7",
               "name": "Roger M. Rothstein",
               "profile_path": null,
               "id": 19128,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46149251416c7506c6fd",
               "name": "Dave Grusin",
               "profile_path": "/h6EgxJIsRpObohHdvlUGEAu6EqK.jpg",
               "id": 10771,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe46149251416c7506c703",
               "name": "David M. Walsh",
               "profile_path": "/iqzK0KjUbH5W2U5XwS3LQZ20RWH.jpg",
               "id": 19129,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe46149251416c7506c709",
               "name": "Jennifer Shull",
               "profile_path": null,
               "id": 8426,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "52fe46149251416c7506c70f",
               "name": "Albert Brenner",
               "profile_path": null,
               "id": 1222,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe46149251416c7506c715",
               "name": "Jerry Wunderlich",
               "profile_path": null,
               "id": 12848,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "52fe46149251416c7506c71b",
               "name": "Ann Roth",
               "profile_path": "/cT4EtdqvG0Yq4EQ3LASXiwyndYi.jpg",
               "id": 5493,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe46149251416c7506c721",
               "name": "John F. Burnett",
               "profile_path": null,
               "id": 8881,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe46149251416c7506c727",
               "name": "Ray Stark",
               "profile_path": null,
               "id": 32790,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "54e76d209251412eac000012",
               "name": "Neil Simon",
               "profile_path": "/qZ5iSAEcV7hCVYIOrOD4CI2J5Wi.jpg",
               "id": 584535,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 3.431569,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 14741,
      "vote_count": 45,
      "budget": 0,
      "overview": "Paula McFadden knows: In romance, actors all follow the same stage instruction: Exit. Without warning, her actor boyfriend split today for a movie role and sublet their Manhattan apartment. The new tenant's name: Elliot Garfield. Profession: actor. Richard Dreyfuss and Marsha Mason deliver comedy, zingy repartee and bitter-to-best romance in The Goodbye Girl.",
      "similar": [
         11545,
         1934,
         866,
         4951,
         810,
         10229,
         10050,
         207,
         45772,
         375315,
         61891,
         11971,
         1716,
         12524,
         91739,
         225728,
         10210,
         197082,
         91745,
         10549
      ],
      "original_title": "The Goodbye Girl",
      "runtime": 111,
      "poster_path": "/xdaPFRARLPJuSdQIfxKVJSCOsmD.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Rastar Pictures",
            "id": 2070,
            "origin_country": ""
         },
         {
            "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
            "name": "Metro-Goldwyn-Mayer",
            "id": 21,
            "origin_country": "US"
         }
      ],
      "release_date": "1977-11-30",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "Thank you Neil Simon for making us laugh at falling in love...again.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Herbert Ross"],
      "runtime": 111,
      "synopsis": null,
      "writers": ["Neil Simon"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0076095/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk0ODMzNzU1OF5BMl5BanBnXkFtZTcwMjQzMjk3OA@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Richard Dreyfuss, Marsha Mason, Quinn Cummings | See full cast and crew »"],
      "reviews": [
         "One of the best romantic comedies ever. Dreyfuss & Mason generate as much chemistry as I have ever seen on the screen from a couple that was never a couple. Quinn Cummings delivers one of the greatest child actress performance in cinema history -- always genuine and winning. The dialogue is witty and brittle. The direction never strikes a false note. And all the dualities of New York are well exploited. I simply LOVE this movie.",
         "Paula McFadden (Marsha Mason) and her 10 year old daughter Lucy (Quinn Cummings) are abandoned in NYC by her married boyfriend. He also sublets the apartment they share to a young actor, Eliot Garfield (Richard Dreyfuss). They agree to live together even though they hate each other. Naturally, they fall in love. Totally predictable but I really enjoyed it! I loved in back in 1977 and I still love it now! Neil Simon's script is basically just a series of one liners--but they ARE funny and Dreyfuss, Mason and Cummings deliver them perfectly. They come fast and furious and the movie moves very quickly--it doesn't seem like it's 110 minutes long. Dreyfuss deservedly won the Best Actor Award for this film--he's 'on' non-stop and is full of energy and fun. Mason was nominated for Best Actress and she's almost as good as Dreyfuss (she was a little too whiny for me). Cummings isn't that good--but she WAS only 10 when she did this. It's just that her character is one of those screen kids that talks and acts like an adult--I didn't think having her swear occasionally was cute or funny. Nonetheless she was nominated for Best Supporting Actress. The movie was also up for Best Original Screenplay and Best Picture. Also there's a GREAT title song written and performed by David Gates over the closing credits (it was also a big hit song back in '77). Also Nicol Williamson pops up (unbilled) in a short but VERY funny cameo. The only debit--the romance scenes were corny (but they do work) and some of the dramatic scenes were TERRIBLY written (Simon was always better at doing comedy). And he has two thunderstorms pop up out of NOWHERE in this movie during a big romantic and dramatic scene. That was pushing it a little too much! Still the acting carries those scenes through and it's a minor complaint. A sweet, very funny, enjoyable film. Just don't think about it TOO much. I give it a 9.",
         "Neil Simon is consistent. He loves to use and reuse the \"ODD COUPLE\" plot with variations in one play or another: in the original ODD COUPLE, it's female version (shown in the early 1990s), the sequel film with Walter Matthau and Jack Lemmon, the play (and movie) THE SUNSHINE BOYS - where the apartment is a lifelong comedy team partnership, and this one. Here it is Marcia Mason and her daughter, Quinn Cummings, who are always being deserted by Mason's husband or her series of boy-friends who usually are actors. Mason has become determined never again to trust or date an actor. But the apartment happens to be in the name of her last boyfriend, and he has made a subletting deal with out-of-town actor Richard Dreyfus. Dreyfus is determined to stay in the apartment while in New York (he is starring in a production within the city - off Broadway). He and Mason gradually agree to cease their hostilities and to share the apartment, but Mason finds Dreyfus weird: he is only eating special food, and he chants and plays the guitar at night. On the other hand Quinn Cummings finds he's not such a bad guy (he helps her when she has a headache, relaxing her to sleep). The play that Dreyfus is appearing in the lead role in is Shakespeare's RICHARD III. It is being produced by Paul Benedict (a rare big part for that good comic actor), but his ideas about the production are upsetting Dreyfus. Dreyfus is approaching the role in the classical, \"Olivier\" form - the master, evil Machiavellian monarch. Machiavellian to be sure in Benedict's version, but also gay. As Benedict pushes it, it is the story of \"the Queen who would be King\". Dreyfus's performance of the play within the film, following Benedict's direction, is an everlasting comic joy. The highs and lows of the two warring suite mates follows a romantic course, as they gradually fall in love with each other. Will this actor prove to be another one of those typically selfish actors that Mason resents, or will he prove to be different to her and Cummings - will he be the real love of her life? A first rate comedy, and Dreyfus' Oscar - a well earned one.",
         "Simply my favourite movie of all time. First saw it with my fiancee (at the time) and it was her favourite also. We saw it 3 times. Whenever it is on TV I watch, and I have two video copies (in case one gets lost or spoiled!). It stars Richard Dreyfuss at his best, and Marsha Mason and the \"kid\" are excellent too. Perhaps it is one of the best of films because it is able to make you laugh and cry, and sometimes at the same time. Neil Simon's writing is so comic and never allows the pathos to drown you. I believe it won a number of Oscars when first released yet almost no one I rave to about it has ever heard of it. Strange! This film is very much under-appreciated. It is a wonderful tale of of family, of career, of relationships and of love. The rooftop scene is just fantastic and leaves a knot in my stomach every time I see it. A warm glow and a feeling of \"this is how life should turn out\". Great movie, great script. Fantastic.",
         "Two decades have passed since I first viewed \"The Goodbye Girl\". I can think of few films that hold up like this Neil Simon comedy. I read in a previous review that the plot is \"unbelievable\". Am I wrong in recalling that the writer admitted that he got the concept complete from the life of an actor? Just another case of reality possessing more truth than fiction. Richard Dreyfus and Marsha Mason should be added to that rare list of actors whose performances will forever define the characters they portrayed. Elliot Garfield and Paula McFadden belong to them in perpetuity. Played by Quinn Cummings, Lucy McFadden simply made the film work as a sophisticated child who never uttered one cloying word. Bless you Quinn, wherever your are. For someone who has been a friend of actors, and who has adored dancers, every situation in the film rang true. Previous reviews havecovered all the cinematic aspects, so I will just add my accolade: This is a film that rates with the best of Hollywood.",
         "A gem of a picture with one of the most lovely endings I have ever seen. Dreyfuss is priceless as a die hard actor looking for his big break. Mason is wonderful as the women he has to share an apartment with, then fall in love with as well. Simon's script melts with humor and heart from start to finish. It's one that gets better with every viewing.",
         "If they think they can compete with the likes of The Goodbye Girl. It's definitely the best of it's genre, and I don't know why more people haven't seen it. The acting is superb, the jokes are (mostly) hilarious, however many times you see the film, and I have so many favourite scenes I could probably tell you the whole movie.Richard Dreyfuss is excellent as Elliott, the wet stranger that arrives at Paula's apartment, and Quinn Cummings (Lucy) is a perfect example of a 10 year old girl. For once, it's a film that isn't totally predictable and doesn't end with a kiss!",
         "I don't normally go in for Romantic comedies too much, but this was a very entertaining movie. Dreyfus is just mesmerizing and hilarious, and Marsha Mason was very good. A very enjoyable, uplifting movie.",
         "The greatest romantic comedy of all time, and you cannot even get a \"Vanilla\" DVD in the uk. This is a movie with a strange history. Originally started in 1976 by Mike Nichols, it was called \"Bogart slept here\" and starred Marsha Mason and Robert DeNiro.The great thespian is rumoured to of walked out of rehearsals after Mason said that he should respect Mike Nichols more. (Nichols had worked out that DeNiro could not \"Do Joy\".) No such problems for Dreyfuss. He is amazing as Elliot Garfield. The two leads capture each line to perfection, which is no mean feat as nearly every line in this movie is a gag. Even Quinn Cummings is that rare thing a child actor that does not make you reach for a revolver. Even the now dated Gay King Richard routine works still as it is done in such a sweet, good natured way. So many great lines (my personal favourite..... \"Capital P, Capital U, capital TRID\") The final shots of Mason are an echo of the final shots of (the vastly overrated) \"Breakfast at Tiffanys\". Also this is one of those rare Romances that men enjoy, possibly because Dreyfuss is not exactly George Clooney, is an incredible smart arse throughout. and unlike someone like Hugh Grant actually knows when to put the \"moves\" on (so to speak) Hope for all average looking guys everywhere. A Brilliant, Brilliant movie. Please can we have a DVD release with whistle and bells please Rastar and Sony.",
         "My favourite film of all time. Despite its academy awards at the time it remains largely unknown now which is sad. It makes you laugh, it makes you cry, it makes you feel good. What more can you expect from a movie?"
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Warner Bros.",
         "Metro-Goldwyn-Mayer (MGM)",
         "Rastar Pictures"
      ],
      "summaries": [
         "A divorced woman and her daughter come home to find that her boyfriend has left for an out of town job with no warning. This has happened before. The second surprise comes in the form of another actor who has sublet the apartment from her boyfriend (who did not mention the pair of females who would be in residence). After some negotiation the two decide to share the apartment even though she has vowed to stay away from actors.",
         "Ex-Broadway chorus dancer Paula McFadden lives with her eight year old precocious daughter, Lucy, and Paula's lover, actor Tony De Forrest. Paula has solely been playing \"wife\" and mother ever since she got married to Lucy's father. Paula comes home one day to find that Tony has left her. Not only will Paula have to start working again (as Tony was the household breadwinner), the only thing she knows being dancing, but she may have to look for another apartment. Unknown to Paula, Tony, whose name was on the apartment lease, has sublet it to Elliot Garfield, an actor from out of town who has come to New York to appear as the lead in an off off Broadway production of Richard III. Paula will not give up the apartment without a fight - she figures possession is nine tenths of the law - but an equally tenacious Elliot figures the law is on his side and he does have a key. So pragmatic Paula figures the easiest thing to do is to share the apartment with Elliot. Paula doesn't much like Elliot, solely because of what he represents to her, and thus Paula tries to make his life as miserable as she can there in hopes that he will leave. However Elliot and Lucy get along famously. As Paula and Elliot try to co-habitate, they each have their own professional problems, Paula's being that she is woefully out of shape to be a dancer, and Elliot's being that he doesn't see eye to eye with his Richard III director, who wants to take the production in a whole different and unconventional direction. As each tries to earn a living, they find that they are falling for each other. But Paula, a two time loser in love, is hesitant to get into a relationship with Elliot, who she sees will ultimately leave her like all the others have before.",
         "After being dumped by her live-in boyfriend, an unemployed dancer and her 10-year-old daughter are reluctantly forced to live with a struggling off-Broadway actor."
      ],
      "budget": 0
   },
   "movielensId": 3244,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1977-11-30",
      "dvdReleaseDate": "2000-01-18",
      "directors": ["Herbert Ross"],
      "runtime": 111,
      "movieId": 3244,
      "title": "The Goodbye Girl",
      "mpaa": "PG",
      "actors": [
         "Richard Dreyfuss",
         "Marsha Mason",
         "Quinn Cummings",
         "Paul Benedict",
         "Barbara Rhoades",
         "Theresa Merritt",
         "Michael Shawn",
         "Patricia Pearcy",
         "Gene Castle",
         "Daniel Levans",
         "Marilyn Sokol",
         "Anita Dangler",
         "Victoria Boothby",
         "Robert Costanzo",
         "Pancho González"
      ],
      "imdbMovieId": "0076095",
      "originalTitle": "The Goodbye Girl",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["_2vDT46nmMA"],
      "plotSummary": "Paula McFadden knows: In romance, actors all follow the same stage instruction: Exit. Without warning, her actor boyfriend split today for a movie role and sublet their Manhattan apartment. The new tenant's name: Elliot Garfield. Profession: actor. Richard Dreyfuss and Marsha Mason deliver comedy, zingy repartee and bitter-to-best romance in The Goodbye Girl.",
      "tmdbMovieId": 14741,
      "avgRating": 3.62869,
      "releaseYear": "1977",
      "numRatings": 1558,
      "posterPath": "/xdaPFRARLPJuSdQIfxKVJSCOsmD.jpg"
   }
}