{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "loss of loved one",
            "id": 697
         },
         {
            "name": "nanny",
            "id": 2341
         },
         {
            "name": "destroy",
            "id": 2535
         },
         {
            "name": "family's daily life",
            "id": 2783
         },
         {
            "name": "infant",
            "id": 3256
         },
         {
            "name": "rage and hate",
            "id": 3927
         },
         {
            "name": "malice",
            "id": 4914
         },
         {
            "name": "childlessness",
            "id": 5885
         },
         {
            "name": "child wish",
            "id": 168386
         },
         {
            "name": "child",
            "id": 208349
         }
      ],
      "imdb_id": "tt0104389",
      "video": false,
      "title": "The Hand that Rocks the Cradle",
      "recommendations": [
         9605,
         11495,
         10998,
         10631,
         1644,
         1710,
         9941,
         1073,
         8984,
         10493,
         11929,
         9095,
         10859,
         3525,
         867,
         11821,
         11584,
         10765,
         10130,
         12154
      ],
      "backdrop_path": "/lxsr2jhzXc6kWOnhkIGSMjslqZP.jpg",
      "revenue": 88036683,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Claire Bartel",
               "gender": 1,
               "credit_id": "52fe43f49251416c750241bf",
               "name": "Annabella Sciorra",
               "profile_path": "/2rhrUQbnRLI5hS0nZSvtmFHCf2M.jpg",
               "id": 18750,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Mrs. Mott / Peyton Flanders",
               "gender": 1,
               "credit_id": "52fe43f49251416c750241c3",
               "name": "Rebecca De Mornay",
               "profile_path": "/riQQkeijtaPIAVhPdCcJFPB4FOA.jpg",
               "id": 28412,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Michael Bartel",
               "gender": 2,
               "credit_id": "52fe43f49251416c750241c7",
               "name": "Matt McCoy",
               "profile_path": "/hBbrWq1WolrEG9kSxEASywFz5OK.jpg",
               "id": 42206,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Solomon",
               "gender": 2,
               "credit_id": "52fe43f49251416c750241cb",
               "name": "Ernie Hudson",
               "profile_path": "/h6hSUIuvJEjUih3wgMqYOZhNe57.jpg",
               "id": 8874,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Emma Bartel",
               "gender": 1,
               "credit_id": "52fe43f49251416c750241f9",
               "name": "Madeline Zima",
               "profile_path": "/72MtWTKvM0bjjvFWpjXpUrAQlpt.jpg",
               "id": 84613,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Marlene Craven",
               "gender": 1,
               "credit_id": "52fe43f49251416c750241fd",
               "name": "Julianne Moore",
               "profile_path": "/v2FcWGiiuvl6P7NV0966jNL09uh.jpg",
               "id": 1231,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43f49251416c750241d1",
               "name": "Curtis Hanson",
               "profile_path": "/e8o4pYzVjh4ier1n0bxD78HCbxg.jpg",
               "id": 323,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f49251416c750241d7",
               "name": "David Madden",
               "profile_path": null,
               "id": 24051,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe43f49251416c750241dd",
               "name": "Amanda Silver",
               "profile_path": "/dHsdH4SGpAqyIr4iCQ9JYjXcxX9.jpg",
               "id": 67803,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f49251416c750241e3",
               "name": "Robert Elswit",
               "profile_path": null,
               "id": 2950,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f49251416c750241ef",
               "name": "Graeme Revell",
               "profile_path": "/g2Nhv2OCV8ygLYxkeDbhlqnrv7Z.jpg",
               "id": 5912,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f49251416c750241f5",
               "name": "John F. Link",
               "profile_path": null,
               "id": 1099,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "5480ef3ec3a36829b5004c10",
               "name": "Junie Lowry-Johnson",
               "profile_path": "/1WIEz9uYLpsv28tcvnH97OgcYoF.jpg",
               "id": 2399,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "5480ef519251416e7b003c31",
               "name": "Edward Pisoni",
               "profile_path": null,
               "id": 20358,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "5480ef61c3a36829a30040f3",
               "name": "Jennifer von Mayrhauser",
               "profile_path": null,
               "id": 1394642,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "5480ef7ac3a36829a7004028",
               "name": "Sandy Reynolds-Wasco",
               "profile_path": null,
               "id": 11801,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "5480ef9a9251416e6c003b61",
               "name": "Mark Zuelzke",
               "profile_path": null,
               "id": 1319412,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "5480efafc3a36829a3004102",
               "name": "Robert W. Cort",
               "profile_path": null,
               "id": 18389,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "5480efc59251416e7e00411d",
               "name": "Ira Halberstadt",
               "profile_path": null,
               "id": 1394643,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 1,
               "credit_id": "5aa51baf0e0a26075101ddfe",
               "name": "Melissa Matthies",
               "profile_path": null,
               "id": 1995909,
               "department": "Art",
               "job": "Leadman"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 6.942269,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11087,
      "vote_count": 263,
      "budget": 11700000,
      "overview": "A suburban family chooses seemingly sweet Peyton Flanders as their newborn's nanny. Only much later does the infant's mother, Claire Bartel, realize Peyton's true intentions -- to destroy Claire and replace her in the family. The nail-biting suspense builds quickly in this chilling psychological thriller about deception and bitter revenge.",
      "similar": [
         745,
         1562,
         1374,
         334,
         613,
         637,
         1164,
         1368,
         470,
         335,
         675,
         744,
         425,
         10795,
         269,
         337,
         451,
         6023,
         903,
         321258
      ],
      "original_title": "The Hand that Rocks the Cradle",
      "runtime": 110,
      "poster_path": "/mKNDQjZ49UdkbH6SPC9wbxtcp39.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/xXojkyRWFZ0JTJyjiu13ThKeFbz.png",
            "name": "Hollywood Pictures",
            "id": 915,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Interscope Communications",
            "id": 10201,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Nomura Babcock & Brown",
            "id": 12883,
            "origin_country": ""
         }
      ],
      "release_date": "1992-01-10",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "Trust is her weapon. Innocence her opportunity. Revenge her only desire.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Curtis Hanson"],
      "runtime": 110,
      "synopsis": "Claire Bartel (Annabella Sciorra), her husband Michael (Matt McCoy), and their 6-year-old daughter Emma (Madeline Zima) live in a large house in Seattle, Washington. One sunny morning, there is a knock at the door. No one answers the door, because they're so busy that they don't hear the knocking. A few seconds later, Claire notices a black man at the kitchen window. This is the man who was knocking on the door, and Claire has been expecting him. The man is Solomon (Ernie Hudson), a mentally handicapped man who has been sent over by the Better Day Society, which finds jobs for the mentally challenged. Solomon was sent because Claire had asked for someone who could build a white picket fence for the house, and Solomon is the man for the job. Later that same day, Claire, who is three months pregnant, keeps an appointment with her new OB/GYN, Dr. Victor Mott (John de Lancie). This is Claire's first visit with Dr. Mott, because the doctor who delivered Emma has retired. Claire is called to an examination room, where a nurse tells her to take everything off and put on a robe that is opened in the front. After Claire does this, Dr. Mott enters the room and introduces himself to Claire, and he acknowledges that Claire's medical record says that she has chronic asthma. Dr. Mott starts the exam, doing the breast exam first, and when Dr. Mott starts doing the pelvic exam, he starts touching Claire in a way that she doesn't like. Frightened by that, a wheezing Claire gets out of there, and uses her inhalant to help her breathe better. (Note: Claire's severe chronic ashma is triggered by the slightest stress throughout the film). Claire then goes home and takes a shower, then she tells Michael what Dr. Mott did. Michael suggests filing a complaint against Dr. Mott, so Claire tells the state medical board what Dr. Mott did, and a week after Claire's visit with Dr. Mott, Dr. Mott is brought up on charges. By this time, four more women have accused Dr. Mott of the same thing he did to Claire. A few hours after Dr. Mott is brought up on charges, he grabs a gun at his home, puts the end of the barrel to his head, and pulls the trigger. On the next day, Claire and Michael read about Dr. Mott's suicide in the newspaper. Nine days later, in a meeting with lawyers, Dr. Mott's wife (Rebecca De Mornay) is told that his assets have been frozen by the state, which is normal procedure if the estate is probably going to be sued by a number of sources. Mrs. Mott, who is seven months pregnant, is free to stay in the Mott house until she gives birth to her baby, but that she may be made liable in the lawsuits. On her way out of the meeting, Mrs. Mott collapses and starts bleeding heavily. Mrs. Mott is rushed to the hospital, where she has a miscarriage. The baby was a boy. After an emergency hysterectomy, Mrs. Mott is in her hospital room, and she is watching the TV news, which says that Claire made the first accusation against Dr. Mott. Mrs. Mott stares at Claire's picture on the TV with an enraged look on her face. Mrs. Mott believes Claire is responsible for the deaths of Dr. Mott and her baby. Six months later. Solomon is still doing jobs for the Bartels, and he has become a friend to them. By this time, Claire has given birth to her baby, a boy named Joe (Eric Melander, Jennifer Melander, and Ashley Melander). The family's botanical garden is replacing its small greenhouses in the back yard, and Claire decides to see if she can get one of the frames so she can have her own small greenhouse. Michael wonders if Claire has been taking on too much lately, and he talks about hiring a nanny, a thought that Claire is not comfortable with. A few days later, Claire walks Emma outside and watches Emma get on a Puget Sound Elementary School bus. A few seconds after pulling away, the bus stops, and Mrs. Mott steps out from in front of it. Claire hurries to the bus and gives Emma a jacket that she forgot. Mrs. Mott asks Claire where the Bartels live, and Claire introduces herself, unaware that she's talking to Dr. Mott's widow. Mrs. Mott introduces herself as 'Peyton Flanders', and asks about the nanny position that the Bartels have offered. In the house, Claire interviews Peyton, then takes her upstairs to meet Joe, but before they get to the nursery, Solomon calls Claire outside. Peyton goes inside the nursery by herself, and meets Joe for the first time. Claire brings Solomon upstairs and introduces him to Peyton. After that, Solomon goes back downstairs. Claire then starts breast feeding Joe, and she invites Peyton to dinner. Later, when Peyton returns to the house for dinner, and she asks what Michael does for a living, Claire says that Michael is a genetic engineer at a place called Biotechnics. After the dinner, Claire and Michael decide to hire Peyton. Over the next few weeks, Peyton moves into a room in the basement, and spends some time settling in. One night, Peyton's alarm clock goes off at 3:00 am, and she goes to Joe's room, puts a pillow in Joe's crib, and starts breast-feeding Joe. On the next day, preparations for the new greenhouse continue. That night, Michael and Claire's friends Marlene Craven (Julianne Moore) and her husband Marty (Kevin Skousen) come over, because they'll all four be going out for dinner while Peyton stays home with Emma and Joe. After everyone leaves, Emma tells Peyton that before Michael met Claire, Marlene was Michael's girlfriend. Marlene and Michael grew up with each other. Emma also tells Peyton that at school, a bully named Roth (Justin Zaremby) has been terrorizing her. Later, Peyton breast-feeds Joe again. By this time, Joe is three months old. On the next day, Peyton heads to the school during recess and asks Emma which kid Roth is. Emma points to a boy in a blue and white shirt. Peyton, angry at Roth for terrorizing Emma, walks up to Roth and grabs him by the arm, pulling him into a well-deserved and very painful hold. While Peyton has Roth in this painful hold, Peyton furiously warns Roth that she'll tear his head off if he ever messes with Emma again. This has the rest of the kids laughing at Roth for a change, instead of Roth laughing at them all the time. On the next morning, Claire tries to breast feed Joe, but Joe resists, because he has secretly become used to Peyton breast-feeding him. As Michael goes to work, leaving a proposal for Claire to drop off at the Federal Express building, the greenhouse is delivered. Claire, Peyton, and Joe head to the botanical garden, where Claire has been a volunteer for about seven years. After talking to Clair, Peyton heads to the bathroom, gets out the proposal, which she secretly stole from Claire, and tears it up, then she grabs a plunger and angrily starts beating up the walls of the stall she's in. At the federal express building, they won't let Claire ship out what she thinks is the proposal. Stressed out, Claire is wheezing from another asthma attack as she returns to the car, and she tells Peyton that the proposal is missing from its pouch. Claire uses her inhalant, and that night, she tells Michael that the proposal disappeared. On the next morning, Claire tells Michael that Joe has, for the past couple of weeks, been refusing to breast feed, but the doctor said Joe will be okay as long as Joe gains weight. Peyton shows up at Michael's office while he's at work, and suggests that they throw Claire a surprise party for her birthday. Michael agrees, and he also likes the suggestion to let Marlene help. Later that day, Solomon is painting when he notices that Peyton is breast-feeding Joe. Peyton notices Solomon, and Solomon climbs down his ladder. Later, the school bus drops Emma off at the house, and after Emma goes inside, Peyton walks outside and confronts Solomon. Peyton slaps Solomon, and then she warns him not to mess with her or tell anyone what he saw. Solomon tells Peyton that he won't let her hurt the Bartels. A few days later, the Bartels surprise Solomon with a new bicycle. While Peyton and Claire are doing laundry, Peyton tells Claire that Solomon has been inappropriately touching Emma, but what Claire doesn't know is that Peyton is lying... Peyton wants Solomon out of the way because, despite being retarded, he knows too much. That night, Claire talks to Emma about Solomon to stay away from him. On the next day, Peyton tricks Claire into searching Solomon's toolbox for batteries, and Claire sees a pair of Emma's underwear in Solomon's toolbox. What Claire doesn't know is that Peyton planted the underwear in the toolbox. Solomon walks in and Claire hits him, starts wheezing, grabs Emma, and goes inside. Peyton gives Solomon an evil look as if to say that Solomon shouldn't have messed with her. Solomon is fired despite his protests of innocence and claims that Peyton set him up. Emma is devastated, because she knows Solomon never did anything to her, except be her friend. Claire refuses to belive Emma that Solomon abused her in any way. It clearly becomes obvious that Peyton is turning Emma against Claire, and Peyton, of course, is the only one who knows this. A few days later, Claire and Peyton take some boxes to the attic, where Claire mentions that Emma has been angry and guarded around Claire lately. A few days later, Peyton suggests to Michael that they prepare Claire's surprise birthday party. Later, Peyton tells Claire that she wonders why Michael is not home from work yet. What Claire doesn't know is that Michael and Marlene are working on plans for the birthday party. When Michael gets home, Claire grills him with a lot of questions. That night, Michael hears a noise and grabs a baseball bat, and then he goes to the kitchen where he sees Peyton picking ice up off the floor because she dropped an ice tray. Michael goes back to bed. On Claire's birthday, at Auditorium Cleaners, a dry-cleaning business, Claire finds evidence that leads her to go home and confront Michael, and she accuses Michael of having an affair with Marlene, unaware that Peyton planted the evidence. When Claire walks into the living room, she sees people assembled for the surprise birthday party, and Claire realizes that she was wrong to accuse Michael of cheating. Claire feels so guilty about the accusation, that she can't face Marlene, who overheard the accusation. Claire goes upstairs, where she breaks down in Michael's arms. Claire says that so many things have gone wrong since they hired Peyton, who overhears them discussing going away for a few days. A few hours later, at 4:45 am, Peyton gets up and rigs a booby trap the greenhouse to kill Claire by showering Claire with glass the next time Claire walks into the greenhouse. A few hours later, at Marlene's office, she notices something suspicious in a picture of Dr. Mott's house, which hasn't been sold. At the same time, Claire heads to the botanical garden, and Marlene looks over some back issues of a newspaper, and gets evidence that Peyton is Dr. Mott's widow. Marlene heads straight to the Bartel house with the intention of telling Claire what she has discovered. At the house, Marlene angrily wants to know where Claire is. Aware that Marlene on to her, Peyton tells Marlene that Claire is in the greenhouse, which is not true. Marlene goes out back to the greenhouse, where the booby trap causes the overhead frames to close shut which triggers a shower of glass that kills Marlene. After panicing for a minute over what to do next, Peyton then empties Claire's inhaler, so Claire won't recover from her next asthma attack. Later, Claire arrives home from the gardens while Peyton has Joe out for a walk. Claire goes to the greenhouse and sees Marlene's bloody body covered with glass impailed to her body. As expected, the sight causes Claire to have another severe asthma attack, which is the reason why Peyton emptied Claire's inhaler and left Marlene's body for Claire to see since sudden stress triggers Claire's asthma. When Claire goes inside, she tries to use her inhaler, which is useless because it's empty, and Claire grabs the phone and calls for help, then she collapses on the front porch. Claire is rushed to the hospital, and Marlene's body is removed from the greenhouse. At his apartment, Solomon is worried about the Bartels. At home, Peyton comes on to Michael, who turns her down. A few days later, Claire comes home from the hospital. In Joe's room, Claire notices that Peyton has put up some wall border with turtle designs on it. While going through some clothes in a hamper, Claire finds a piece of paper that says that Marlene called just before she was killed. Claire heads to Marlene's office, where she sees the picture of Dr. Mott's house. Claire then goes to Dr. Mott's house, where she sees the same wall border that's in Joe's room, with the turtle designs on it. It is where wher Claire sees a wedding photo of Dr. Mott with Peyton as his bride. Claire goes home, where she confronts Peyton, and she immediately punches Peyton in the face as hard as she can. Michael runs in after hearing the comotion where Claire tells him that Peyton is Dr. Mott's widow. With the gig up, Peyton finally reveals her true idenity ('Peyton Flanders' is actually her maiden name) and confesses that she set everything up to get hired as the nanny because wants revenge on Claire, because Peyton believes Claire is responsible for Dr. Mott's suicide and Peyton's miscarriage by reporting his sexual abuse of her. Peyton wants Claire to know how devastated this all made her feel, so Peyton has been trying to manipulate and take Michael, Emma, and Joe away from Claire so Peyton can have a family and leave Claire with nothing. Claire argues that Peyton has nobody to blame but her late unethical husband for sexually abusing Claire and all his other female patients that has led to all this in the first place. But the cleary warped Peyton continues to blame Claire for her husband's sucide and her miscarrage. When Michael asks Peyton what she would have done after suspecting or figuring out that her own husband was sexualy abusing his patients, Peyton replies that she would have protected her husband... clearly not caring about his crimes. Claire and Michael fire Peyton, and they force her to get out of the house immediately. After Peyton leaves, Claire then tells Michael to call the police, because she realizes that Peyton may have rigged the greenhouse to kill her instead of Marlene. Michael tells Claire to get Emma and Joe ready so the four of them can go to a hotel until Peyton is found. Michael apologizes to Claire about everything that has happened and how Peyton so easily fooled all of them. Michael even says that he even feels a little bit sorry for Peyton for the shock and stress of discovering her late husband's crimes and his suicide which has led to her miscarrage and her sanity breaking. Claire tells Michael that she thinks Peyton Mott was already insane and dangerously disturbed long before she ever met Dr. Mott because her indifference to her late husband's crimes suggests life-long untreated psychotic behavior. That same night, before they leave, Michael talks to the police on the phone to report Peyton and about the accusations of Marlene's death. After hanging up, Michael hears a noise coming from the basement. Michael goes downstairs and turns off Peyton's alarm clock, which is what was making the noise. When Michael reaches the top of the stairs on his way out of the basement, Peyton appears and hits Michael with a shovel, causing Michael to fall over the guardrail and land on the concrete floor below. Claire, who is upstairs with Emma, hears the noise of Peyton's attack on Michael. Claire goes out of the room and has Emma lock the room's door. Claire goes to the basement, where she finds Michael. Michael, who now has two broken legs, convinces Claire that he's okay, and then he tells Claire that Peyton is back in the house. Michael also tells Claire to call the police. Emma unlocks the door to the room she's in. Claire goes to the kitchen and picks up the phone. That's when Peyton appears and starts swinging the shovel at Claire. On the 8th swing, Peyton hits Claire on the head and knocks Claire out cold. Peyton goes upstairs and asks Emma where Joe is, because Peyton plans to leave town and take Emma and Joe with her. Emma points to Joe's room. Peyton goes inside of Joe's room, but doesn't see Joe. Thats when Emma shuts the room's door and locks it, trapping Peyton in the room. Emma then grabs Joe, and Peyton grabs a fireplace poker and uses it to break out of the room. Still carrying the poker, Peyton looks for Emma and Joe. Claire wakes up from being out cold. Peyton goes to the attic, where she sees Joe on a couch, and Solomon enters the attic through a window and grabs Joe to protect Joe from Peyton. Claire enters the attic with a large knife and attacks. Peyton swings the poker and knocks the knife out of Claire's hand, then she knocks Claire to the floor, and Claire starts wheezing from another ashma attack. Peyton angrily tells Solomon to hand the baby to her, but Solomon refuses. Peyton raises the poker to hit Solomon, and before Peyton can hit Solomon, Claire charges forward and slams Peyton against a wall and knocks Peyton to the floor, then slams Peyton's head against the floor two times. Peyton kicks Claire aside and grabs the poker, and just as Peyton is about to hit Claire with the poker, Solomon grabs Peyton's arm to stop her. Peyton pulls her arm free and hits Solomon two times with the poker. Claire charges forward again, and this time, she shoves Peyton through the attic window. Peyton falls downward, and she lands on the white picket fence below where she gets impaled on the wooden slat, killing her instantly. After the police arrive and remove Peyton's dead body, Claire and Michael welcome Solomon back into their lives.",
      "writers": ["Amanda Silver"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0104389/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg0ODczMjk0MV5BMl5BanBnXkFtZTcwMjE1NzgyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Annabella Sciorra, Rebecca De Mornay, Matt McCoy | See full cast and crew »"],
      "reviews": [
         "Just the opening scene turns off a lot of people, but that's too because all of the film - all of it - is interesting with Rebecca DeMornay excelling at a vengeful, psychotic killer nanny. This \"nanny\" does about everything you could do to ruin a family. Yes, she's the nanny from Hell. I always thought Annabella Sciorra had an interesting face with a knockout smile, at least back in late '80s, early '90s, so I enjoy watching her. Here, she plays a good woman who is married to a good man (Matt McCoy) - wow, there's an oddity in modern films: a happy and faithful husband and wife! This is an involving film. Once you are into it, you're hooked and the 100-plus minutes go by pretty fast. DeMornay is so effective in her role you just can't wait to see her exposed for who she is and justice done to her. I did think Sciorra's character would have needed more to go on to come to the right conclusion near the end, but, usually every film has some question marks regarding credibility. The violent, ending scene is very suspenseful and well- done.",
         "Long before the acclaim of \"L.A. Confidential\", director Curtis Hansen offered up this trim, effectively manipulative and suspenseful film. Sciorra is a pregnant woman whose doctor (magnificently slimy de Lancie) molests her during an office visit. The ramifications of her subsequent charges bring about the entrance of De Mornay into her life. De Mornay poses as a nanny and almost immediately wreaks havoc on Sciorra's household, taking charge of it and manipulating the family, all while smiling pleasantly. The story is almost completely implausible and the credibility of the script is stretched further and further as it goes along. However, it matters not because of the sure-handed, inventive direction and the dedicated performance of De Mornay. Taking a cue from Hitchcock, much of the dirty business occurs in daylight among stark white walls and bright outdoor settings. De Mornay insinuates herself into the household and into the minds of the viewer with an unsettling and fascinating malevolence. No one is safe as she meticulously works her dread. Aside from her plots against Sciorra, her shocking behavior includes calling a mentally challenged man a 'retard' and saying the 'F' word to a grade school child. This decidedly un-PC approach is at compelling odds with Sciorra and her yuppie husband who both represent everything annoying and stereotypical about their type and status ('talking' to their kids, 'processing' everything psychologically, et al) They are well off and think they're 'on to' life, yet he's a dim bulb and she overreacts to everything possible. This makes a certain faction of the audience delight in seeing them tormented. Cutting a swath through all the bull is the stunning, fire-breathing, no-nonsense Moore as Sciorra's friend. This is one of the greatest supporting turns of the '90's. She owns every scene she's in, yet ultimately can't beat De Mornay, thus creating a terrific onscreen rivalry right from the start. Moore has never looked this wonderful again, nor essayed this brittle a role, but at least it exists as a monument to her talents at playing a ball-breaking bitch goddess. The excitement leading up to her confrontation with De Mornay is palpable (thanks in part to some great editing.) The male cast is weak. McCoy is often just plain bad and Hudson is embarrassing as a 'slow' handyman. Sciorra does well in a part that does her no favors. The film was a massive (surprise) hit, but she wasn't able to ride it to anything much afterwards. At least De Mornay was briefly lifted to a higher position in the film industry. Moore has fared the best. Zima (in her film debut!) is exceptionally cute as the daughter and does a great job. She later won a role on \"The Nanny\". The film inspired a raft of imitators featuring killer-sitters, killer-temps, etc... but none found the wide audience that this enjoyed. It's a credit to De Mornay (and Hanson) that despite being petite and feminine, she comes across as chilling and dangerously strong and violent.",
         "You have to hand it to the makers of THE HAND THAT ROCKS THE CRADLE--once the story starts to unravel, you have to stay tuned to find out how this manipulative bitch will get her comeuppance. It's as simple as that. We know from the start that she has evil intentions, but we never know how evil they are until she starts a series of manipulative acts that demonstrate how cunning and remorseless she is. REBECCA de MORNAY is so convincingly evil that you have to wonder why her career didn't skyrocket after this. It's a performance worthy of award consideration, but both she and the film itself have been largely forgotten. None of the supporting players, with the exception of JULIANNE MOORE, have become household names but they're all quite effective. The ending may be somewhat predictable--and most welcome when it finally comes--but it's still stylishly done and a satisfying conclusion to a tale of household terror when a nanny's rage goes amok because of an incident in her past involving a woman whom she perceives as ruining her husband's life. Sure, it's been done before, but never quite so cunningly presented.",
         "This is a chilling movie to spend a day or night with. Mrs. Moss (Rebecca De Mornay) seeks revenge on Claire Bartel (Annabella Sciorra) for reporting her husband Dr. Moss for sexual harassment, which lead to the doctor's suicide and precipitating Moss' miscarriage. She poses as nanny Peyton for the Bartel family, with the intention of raising hell. Rebecca De Mornay gave an outrageously evil performance. The plot is solid and fast-paced; the only problem I have is the method Claire used to interview Peyton for the nanny position. She only asked Peyton, \"How did you become to be a nanny?\" leaving out relevant questions like health, personal background, prior jobs, resumes, way with kids, etc. Other than that, I enjoyed watching this movie and especially liked Julianne Moore's character, with her making smart, acid wit remarks. I especially liked her line \"You have a Harvard education, make something up.\" Overall, a great mystery movie with some good action mixed in. Grade A-",
         "The Hand that Rocks the Cradle is the cornerstone of the trashy chick flick sub-genre. Many films since have used the same formula that makes this one a success, and most have failed. The reason this film is almost a resounding success has nothing to do with the plot or characters, however, it's the way that director Curtis Hanson handles it. The man who would go on to find acclaim with the astounding L.A. Confidential directs with the utmost still, and while there are few absolutely shocking sequences in this film; you would be forgiven for thinking otherwise due to the way that Hanson handles every scene. The movie leaves a lot of room for suspense, and every instant is made the best of by the director. The plot seems rather routine these days (and it probably did back in 1992), as we see a good all-American family hire the 'perfect' babysitter. She's not quite so perfect, however, and as we watch her pull down the family she's supposed to be helping from within, this becomes abundantly clear. One thing that makes this film hard to like for some people is the fact that almost every motivation in the film is extremely unlikely. Would you hire a babysitter who apparently 'just knew' you wanted one? Wouldn't you become suspicious when everything started going wrong after you hired her? The list goes on, it really does, and it would seem that writer Amanda Silver just wanted to portray certain plots and didn't care too much how the characters fit into them. It's also obvious that the script was written by a woman throughout, with many of the sequences being more aimed towards women. None of these bad points really harm it though, because it's so well handled that it's hard not to just sit back and enjoy yourself. The centrepiece when it comes to the stagy set pieces is definitely the one with the greenhouse, which is both psychologically pleasing and suspense filled. The acting is just fine, with Rebecca De Mornay slotting into the deranged psycho role nicely. The best thing about this film for me is definitely the way that the babysitter manipulates the children and engineers situations to her advantage. This may be trash at the end of the day, but it's fiendishly done!",
         "The Hand That Rocks The Cradle is a very solid thriller thanks to naturalism and realism. This is one of the best thrillers ever made, and it's just too bad it did not get the attention and praise it deserves. For one thing, we've seen many thrillers that lacked realism while some were not thrilling at all. HTRTC has it all. A solid story, solid cast, good directing and best of all, a high level of realism. The story can actually happen to any family in America, or anywhere in the world. The cast is great, and even though there's basically no \"big name phenomenon\" (well, Julian Moore's now very popular but not yet here) in this film, the performances are very good. In fact, great! Rebecca De Mornay, who's young and very beautiful in this film, has the best performance as the smart-beautiful-deadly Peyton. She's very convincing as both wife and nanny, as well as temptress and killer! Take note of some of the \"sinful scenes\" in this movie. Some scenes can be very disturbing (not disgusting) but if you're matured enough, then you'll get over this movie well. The \"sinful scenes\" do make a wake-up call in your family life. Heck, better watch out for those evil nannies! I highly recommend watching this movie, even though it does not have any big superstardom at all. No special effects, no high tech gimmicks, no big super stars, just a great story to watch. What are you waiting for? Put your Hand on the Cradle and Rock!",
         "Rebecca De Mornay and Julianne Moore, is what Hollywood is all about-Stars who look like Stars and act like Stars. In fact Moore, went to fame and fortune after this movie. This is incredibly gripping movie with some fine acting by the cast including the actor playing the retarded handyman. The casting is superb and the direction by Hansen is near perfect But, it is Rebecca De Mornay (Peyton) with her ever conniving and double faced sweet talk that steals the show (even the red apple takes the brunt of her vengeance!) She thrives in her role and a role that is custom made for her. The \"Clair\" character does so well with her asthmatic attacks, that even a real patient could not have done better. This movie has it all, beautiful and glamorous actresses, suspense, thrill and one of the best movies that I had the pleasure to watch and watch I did eleven times!!",
         "Good thriller that tells the story of a vengeful woman who, by taking the position of nanny, seeks revenge on the family she holds responsible for the loss of her husband and her unborn child. Rebecca De Mornay is very convincing as Peyton, the widow whom we firmly believe is capable of anything, while Ernie Hudson is good as mentally disabled social worker Solomon. Graeme Revell's music is good too, even if it is reminiscent of Howard Shore's \"Silence of the Lambs\". The plot is predictable from the outset, and relies solely on suspense. Director Curtis Hanson makes this work well though, and keeps us on the edge of our seats. Friday, May 22, 1992 - Knox District Centre",
         "the hand that rocks the cradle was a very gripping psychological thriller, there is hardly any action or violence in the movie till the very end. the suspense and the thrills are at a very psychological level and this is what makes this movie rise above the ordinary, rebecca de mornay as the psychologically imbalanced nanny is terrific. the script was surprisingly good for a large part and the thrills were built up very convincingly. there is obviously a lot of situations that defy belief, but with a little suspension of disbelief, they can be accepted. the cast is ordinary, and the performances of the young couple was very amateurish, as also the performance of ernie hudson as the mentally challenged person. this movie would have been a lot more thrilling and dark and satisfying if it had not towards the end fallen in a whole deluge of cliches and predictable lame movie ending traps. call me sick, but i think the movie would have been far better with a darker ending. on the whole a thrilling 8!",
         "This domestic thriller was a box-office hit despite its mid-level marquee pull and is entertaining and delivers plenty of suspense and shocks along the way. A vengeful widow who has lost her husband to a suicide and suffers a miscarriage plans to get even with the woman who caused the trouble by filing a sexual molestation suit against her husband. Rebecca de Mornay is the evil nanny who plots her revenge with relish, her satisfaction obvious as her plans begin to bear fruit. The nanny is not swayed by the innocence of the young girl or the newborn baby she is hired to care for and intends to destroy the entire family. Naturally, the parents are clueless as to what is going on until much later, while de Mornay methodically turns the household into her own domain, holding it in a grip of fear. Annabella Sciorra is the wife and mother who confronts de Mornay in the final moments. Graeme Revell contributes a nice music score."
      ],
      "genres": [
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Hollywood Pictures",
         "Interscope Communications",
         "Nomura Babcock & Brown"
      ],
      "summaries": [
         "Peyton Flanders seemed to be the perfect nanny, but secretly she was out to wreck the lives of the family she was supposed to be helping. Before becoming the nanny, Peyton had a miscarriage, and blamed it on Claire (the mother). Claire suspects nothing, having never met Peyton before.",
         "Dr. Victor Mott is a respected and successful gynecologist, but his respect and success both come to a crashing halt when he is accused of sexually molesting his patients. When Claire Bartel accuses him of this crime, four other women come forward to corroborate the story and also accuse the doctor. Stripped of his license and on the verge of being sent to prison, Dr. Mott commits suicide. As if this were not enough of a blow to Dr. Mott's now-widowed wife, she suffers a miscarriage, losing her unborn baby as well, and is on the verge of losing her home to civil judgments against her husband's estate. Broken, alone and now near-penniless to boot, Mrs. Mott learns that Claire is seeking a nanny for her own young children, and sees this as the perfect tool to exact a bloody revenge on Claire Bartel, and take Claire's family for her own...",
         "Accused of sexually molesting several of his patients, Dr. Victor Mott kills himself. He leaves behind an expectant wife, who miscarries and loses the child, blames the victim, Claire Bartel, who initiated the criminal proceedings against her husband and decides to avenge his death. For this purpose she calls herself Peyton Flanders, gets herself hired as a nanny for Claire's two children, gains the trust of her employer and her husband, Michael, and sets about her gruesome task.",
         "A gynecologist commits suicide when he is accused of having sexually molested 5 of his patients, and his wife loses her unborn baby as a result of stress. She then takes on another name and applies to the nanny position that the first woman to make the accusation has announced. She gets the job and she's up for revenge in her sly ways.",
         "After her humiliated husband kills himself, an embittered pregnant widow loses her child, and embarks on a mission of vengeance against a woman and her family."
      ],
      "budget": 11700000
   },
   "movielensId": 3249,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1992-01-10",
      "dvdReleaseDate": "1998-12-08",
      "directors": ["Curtis Hanson"],
      "runtime": 110,
      "movieId": 3249,
      "title": "The Hand that Rocks the Cradle",
      "mpaa": "R",
      "actors": [
         "Annabella Sciorra",
         "Rebecca De Mornay",
         "Matt McCoy",
         "Ernie Hudson",
         "Madeline Zima",
         "Julianne Moore"
      ],
      "imdbMovieId": "0104389",
      "originalTitle": "The Hand that Rocks the Cradle",
      "genres": [
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["wjtfG8r14Uk"],
      "plotSummary": "A suburban family chooses seemingly sweet Peyton Flanders as their newborn's nanny. Only much later does the infant's mother, Claire Bartel, realize Peyton's true intentions -- to destroy Claire and replace her in the family. The nail-biting suspense builds quickly in this chilling psychological thriller about deception and bitter revenge.",
      "tmdbMovieId": 11087,
      "avgRating": 3.1083,
      "releaseYear": "1992",
      "numRatings": 2904,
      "posterPath": "/mKNDQjZ49UdkbH6SPC9wbxtcp39.jpg"
   }
}