{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0113936",
      "video": false,
      "title": "Senior Trip",
      "recommendations": [
         76297,
         161495,
         40688,
         18856,
         39964,
         34309,
         61418,
         333,
         19423,
         22317,
         20066,
         26626,
         14425,
         2162,
         55715,
         33374,
         16412,
         25576,
         157036,
         86231
      ],
      "backdrop_path": "/cRVSSgrfZb5wqsEz6Fmk5Kf73f0.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Principal Todd Moss",
               "gender": 2,
               "credit_id": "52fe4571c3a368484e05b65f",
               "name": "Matt Frewer",
               "profile_path": "/5yQeoDfwsSOnO8H2g8UjPLg6buG.jpg",
               "id": 40009,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Miss Tracy Milford",
               "gender": 1,
               "credit_id": "52fe4571c3a368484e05b663",
               "name": "Valerie Mahaffey",
               "profile_path": "/xO1RmcHQqagRlc4bUdhAKJJ8jEU.jpg",
               "id": 99351,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Senator John Lerman",
               "gender": 2,
               "credit_id": "52fe4571c3a368484e05b667",
               "name": "Lawrence Dane",
               "profile_path": "/rL5rkQbelz4zKUXbhfmH5rQ2AtM.jpg",
               "id": 36173,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Red",
               "gender": 2,
               "credit_id": "52fe4572c3a368484e05b66b",
               "name": "Tommy Chong",
               "profile_path": "/9wdlcc5JS36OYd05XBuo8r6F1aq.jpg",
               "id": 63208,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Mark 'Dags\" D'Agastino",
               "gender": 2,
               "credit_id": "52fe4572c3a368484e05b66f",
               "name": "Jeremy Renner",
               "profile_path": "/l6CxIOFCjF65298teEJd5mCnPDO.jpg",
               "id": 17604,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Reggie Barry",
               "gender": 2,
               "credit_id": "52fe4572c3a368484e05b673",
               "name": "Rob Moore",
               "profile_path": "/2cVOWs4xIfJrtewfIaVVzc09NOx.jpg",
               "id": 99352,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Travis Lindsey",
               "gender": 2,
               "credit_id": "52fe4572c3a368484e05b677",
               "name": "Kevin McDonald",
               "profile_path": "/vqLF8voWGTGxpMJ1wqhAovQuL94.jpg",
               "id": 58955,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Herbert Jones",
               "gender": 0,
               "credit_id": "52fe4572c3a368484e05b67b",
               "name": "Michael Blake",
               "profile_path": null,
               "id": 99353,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Carla Morgan",
               "gender": 1,
               "credit_id": "52fe4572c3a368484e05b67f",
               "name": "Tara Strong",
               "profile_path": "/rFUZnJ4BaSaQVKW734xnUHSN9pm.jpg",
               "id": 15762,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Meg Smith",
               "gender": 1,
               "credit_id": "52fe4572c3a368484e05b683",
               "name": "Nicole de Boer",
               "profile_path": "/2aEdXU5l5VAPfFpDV1Z1j0CbysI.jpg",
               "id": 5888,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Steve Nisser",
               "gender": 2,
               "credit_id": "52fe4572c3a368484e05b687",
               "name": "Sergio Di Zio",
               "profile_path": "/e5sQM8rEXQW1UiVgzYM5C4GHScF.jpg",
               "id": 54193,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Lisa Perkins",
               "gender": 1,
               "credit_id": "52fe4572c3a368484e05b68b",
               "name": "Fiona Loewi",
               "profile_path": "/V6F6CQtdT5dH5lMjCtwfcYJgMY.jpg",
               "id": 55153,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Wanda Baker",
               "gender": 0,
               "credit_id": "52fe4572c3a368484e05b68f",
               "name": "Kathryn Rose",
               "profile_path": null,
               "id": 94691,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Barry 'Virus' Kremmer",
               "gender": 2,
               "credit_id": "52fe4572c3a368484e05b693",
               "name": "Danny Smith",
               "profile_path": "/a0vI4PA7v2rwBBavBZWBkLGljJa.jpg",
               "id": 99354,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Mark 'Dags' D'Agastino",
               "gender": 2,
               "credit_id": "52fe4572c3a368484e05b697",
               "name": "Jeremy Renner",
               "profile_path": "/l6CxIOFCjF65298teEJd5mCnPDO.jpg",
               "id": 17604,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "President Davis",
               "gender": 2,
               "credit_id": "592c2b09c3a368780a06c970",
               "name": "George R. Robertson",
               "profile_path": "/by72qET7xsXONeJpuFkPCi4RBbg.jpg",
               "id": 553478,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4571c3a368484e05b64f",
               "name": "Kelly Makin",
               "profile_path": null,
               "id": 64030,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4571c3a368484e05b655",
               "name": "Roger Kumble",
               "profile_path": "/jshZUaEbibNUa818QBq72d54Fea.jpg",
               "id": 11873,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "52fe4571c3a368484e05b65b",
               "name": "I. Marlene King",
               "profile_path": null,
               "id": 57062,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 3.772695,
      "production_countries": [
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 27993,
      "vote_count": 29,
      "budget": 0,
      "overview": "While on detention, a group of misfits and slackers have to write a letter to the President explaining what is wrong with the education system. There is only one problem, the President loves it! Hence, the group must travel to Washington to meet the Main Man.",
      "similar": [],
      "original_title": "Senior Trip",
      "runtime": 91,
      "poster_path": "/qfMbFIGNIQ76FEu7Wg48aEbxFh1.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/iaYpEp3LQmb8AfAtmTvpqd4149c.png",
            "name": "New Line Cinema",
            "id": 12,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "1992 Number Four Limited Partnership",
            "id": 4733,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "MHA",
            "id": 4734,
            "origin_country": ""
         }
      ],
      "release_date": "1995-09-08",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "Stupid tricks. Outrageous chaos. Total destruction. They're taking it on the road.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Kelly Makin"],
      "runtime": 91,
      "synopsis": null,
      "writers": [
         "Roger Kumble",
         "I. Marlene King"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113936/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNjcxNDAxNDEzN15BMl5BanBnXkFtZTcwOTA0MjAwMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Matt Frewer, Valerie Mahaffey, Lawrence Dane | See full cast and crew »"],
      "reviews": [
         "One of Lampoon's last truly funny flicks, this borrows liberally from ANIMAL HOUSE to tell the story of a bunch of underachievers (to say the least) making a bus trip from Ohio to D.C. to meet with the president and tell him what is wrong with today's educational system. All the stereotyped characters are in place, and they are all funny as hell, particularly the fat brain-damaged slob standing in for John \"Bluto\" Blutarski, who was of course a senator, or a retired senator, or maybe even a dead senator by the time this story takes place. I may have written a previous review when I first bought this. I watched it today for the first time in quite awhile and was impressed on how well it was paced and put together. I suspect it cost a few bucks to make, just based on the many setups and sets, although the actors are for the most part unknown. And it smells like it was shot in Canada, which always saves money. As Leonard Maltin said of it, it is not funny every second but it sure keeps moving for its brief running time. I agree wholeheartedly, although I think it is funny every second -- as long as you put your brain on hold and are prepared to see a bunch of high school seniors drugging and chugging and fugging their way through the movie. I am just old enough that it somewhat shocked me the several times I have watched this. (By contrast, I was a late starter. I wasn't drugging and chugging until college, although I was certainly fugging in high school.) Ah well, I imagine this must have been R-rated just for the constant drug references, never mind all the beer and bourbon being sloshed down. Tommy Chong is their bus driver, for gosh sakes!",
         "This movie is one of my favorite comedies. One of the funniest I've ever seen. My favorite parts are where the psycho crossing guard guy who is obsessed with Star Trek is stalking Reggie. It's too bad they don't call movies like these classics, if they did, teenagers would rule the film industry. Check it out. 10/10",
         "I was overly joyed when I saw the trailers for Senior Trip. It appeared to be a very good no brainer for a 90 minute laugh. Unfortunately it wasn't well taken to by movie-goers which made its release to vhs very slow and limited. It hasn't even made it to dvd yet and I know of terribly worse comedies that have, and most are from the present Saturday Night Live Crew. The film does fulfill the area of not only certain high school hijenks, but also a human feeling for the kids of that specific time. It pushed through the ideas of free alcohol, drugs but not so much sex. There was the element of sex, in words and conversation, but no real nudity or fulfillment. Overall an excellent film that would have done better a few years later when teen flix came back with a vengeance. Senior Trip carries with it the National Lampoon feel of Animal House, but doesn't veer off into a demented spoof like Not Another Teen Movie. It filled the void where drama and action films had worn away movie goers in the mid 90s. Watch for Tommy Chong as the bus driver and the chemistry, whether electrified or jaded between the characters.",
         "As with most films of this type, the movie stands on the shoulders of it's supporting players. The slut, Carla, who immediately checks out the men whenever she walks into the room. The geek, Virus, who plays the piano with his erection. The assassin, Travis, Star Trek fan, manipulator of the young and all around comedy fall guy. These actors are the ones who make us laugh. Not a great film, but when you're drunk, even the principal looks kinda cute (especially tarted up, a la Carla).",
         "My friend reccomended this movie to me, so one night, we rented it, and let me tell you, i am soo glad we di This has gotta be one of the funniest I've ever seen. It's been over a year since we rented it and we still go around quoting it. It doesnt have any major important movments or anything, it's just funny. And I highly reccomend that if you and your freinds are crazy, that you all ge together and watch it cuz that is what we ddi, and it made it even funnier. I mean we go around on a regualr basis saying \"moss is in a coma, LETS PARTY!!\", and we will just be sitting in class talking and someone will just burst out \"people say that acid causes, ummm.. brain damage\". The movie is just extremely hilarious.",
         "This movie isn't bad. Lots of laughs, but no enlightening philosophy. It is a great movie for large gatherings. It's not as great as Animal House, but then, what is?",
         "I really wanted to like this movie, but I could only come up for 3 reasons to suggest anyone else endure this movie. Tommy Chong, Tara Strong and Nicole de Boer. Quite frankly, Chong isn't enough of a reason since he can be seen in better form in a dozen other choices and de Boer is a minor player at best. You are better off watching the last few seasons of Deep Space Nine to be mesmerized by Nicole. So that leaves us with Tara. Yes, Tara is enough of a reason to watch this movie... once. Only because it is the only movie in existence that she is in as a physical entity. If you don't know Tara is the voice behind 100s of cartoon characters you probably watch with your kids. The movie has a few funny moments, but they are rare and limited. Tara on the other hand is absolutely gorgeous.",
         "On one level, this is a really horrible movie that tries to make heroes out of slackers, potheads and social rejects, but on another more subliminal level, the kids in this movie are like the largest comedy team ever seen. They're not funny, they're interesting to watch. Jeremy Renner is the ringleader, an under-achiever who has accepted his limitations and blindly corrupts logic to break the rules. He should have been a break out star, but the direction doesn't explore his comedic chops and he is forced to mug, grimace and cow tow to the rest of the cast. The true funny presence to watch is character-actor Kevin MacDonald as the psycho Trekkie with a chip on his shoulder who wants to takeout Renner's character for years of psychological abuse; he's the one to watch here as he goes through abuse after abuse and realizes the things he learned from \"Star Trek\" don't help him in the real world. Matt Frewer is wasted as an exasperated, harried and frustrated principal stuck in one mode as the kids push him over the end; he's pretty much the kids patsy and victim from one end of the movie to the other. Eric Edwards plays a forced Belushi clone: an sleepy yet vice-driven imbecile without morals, but without any of the charm, humor or presence of John or Jim Belushi. (To see him now, you'd never expect he was the same actor!) Tommy Chong is stuck in the same one-joke cliché role he plays in every movie: a conspiracy-talking pothead who is his own worst enemy. It's a shame he's written off so early; investigating his life would have been more interesting. My favorite character is Carla Morgan played by Tara Charendoff; she oozes sex and kittenishly moves through the movie possessed by Marilyn Monroe showing off the full range of her acting ability. The plot is weak; it runs like a documentary of high school rejects attached to a loose sequence of comedic criminal events and unfunny disasters filled with a huge cast of unknowns. Only Charendoff and Nicole DeBoer would go on to any greater success. It lacks the spirit of \"Animal House,\" the humor of John Landis or the commentary of Harold Ramis, and yet, you wonder what sort of damage these kids could do somewhere else and there, there is the one saving point of this film that you wonder what happens to them next.",
         "Being someone who usually when he has the cash heads to the film theaters alone. I liked this film...the stuffy kid in the suit reminds me of what I possibly could ahve been like had I gone along with stuffy stupid republicans at a similar event. I was involved in the close up foundation and am so glad I lost. This film spoofs those functions. Naturally, this film was not about me or my situation in life (i am different than this character and excell at dressing like a slob and looking like one.) this is a film anyone tied in with student political groups in school could love. The film satires the political ssytem and student \"young\" party groups that are so green they have no concept of what the ssytemis actually like. Foolish kids breast fed on half truths in cirriculum books and the \"90's senastionalism\" news. A great satire on the gen x generation as well. Not as clever as ANIMAL HOUSE but clever enough..yet i am not a film maker and never will be one...who am I to judge. A fun night of viewing one of the few comedies I laughed at in the 1990's.",
         "I really don't care about what others think, but for me this movie is the best teen comedy ever. Maybe, it's just because I've not seen a lot of teen comedies. It was year 1996 in Russia, when I bought this movie on VHS in little shop near my house. At this time I was a little stupid kid. I think, I was 10 or 11 years old. This movie made a big impression on me. You know, it's kinda hard to explain my feelings in English, cause it's not my native language, but I'll try. Since I was a kid, I wanted to become a \"cool, mature guy\". I thought that being mature is like having parties all the time, drinking alcohol and so on. \"Senior trip\" had it all in it. It was really funny, it had all this \"cool\" music, that I tried to like. At this time I got my first \"Nirvana\" CD. I liked to be the one I was. I liked being bad, talking in bad language, joking about sex. Yes, I was a bad kid. A really bad one. After years of life such as this I get to hospital, I was really depressed, but it has nothing to do with the movie. It was very cool to listen to grunge music in 1996, though it was not so popular in the US. And the movie felt like a \"grunge\" movie for me. Yeah, I know it's a very stupid movie, it has a lot of crap in it, but I still like it, cause it was like a Bible at my teenage. It showed me another, alternative life, not the stupid life I was living. My best friend liked this movie, too. He is the only one whom I showed it to this day. For me it's very personal movie, though it's neither about my life nor about my country. I think, it's very hard to understand, why I think it's great. Cause it's just my feeling, which I can't explain in Russian, too. After this movie I saw some teen comedies like \"American pie\", \"Road trip\", \"Not another teen movie\", \"Scary movie\", but all of them are a much more badder than \"Senior trip\". Yes, I laughed when I watched first parts of \"American pie\" and \"Scary movie\", but I've never wanted to re-watch them again. I don't think that this movie will be a hit, if it gets re-published today. The world has changed, the teenagers have changed. This movie is a history now. Nothing else. But in my heart it is a classic."
      ],
      "genres": [
         "Adventure",
         "Comedy"
      ],
      "productionCompanies": [
         "1992 Number Four Limited Partnership",
         "Alliance Communications Corporation",
         "New Line Cinema"
      ],
      "summaries": [
         "While on detention, a group of misfits and slackers have to write a letter to the President explaining what is wrong with the education system. There is only one problem, the President loves it! Hence, the group must travel to Washington to meet the Main Man.",
         "At Fairmount High School in Columbus, Ohio, a debauched group of kids rule over the school, led by stoners Mark 'Dags' D'Agastino and Reggie Barry, who preach partying over education. When Dags and Reggie, along with a small assorted group of kids are caught cutting school and throwing a house party in the whiny and incompetent Principal Moss' house, they are put into detention where they are asked to write a letter to the President of the USA on the problems with education. Yet, only the school 'brainiac' Lisa Perkins writes it and mails it where it's a hit with the President who invites them to Washington on a field trip to speak for education reforms. With Principal Moss and the new keyboarding teacher, Miss Milford, chaperoning them, Dags and Reggie, along with Lisa, shy stoner Wanda, school tramp Carla, king geek Virus, biker chick Meg, quiet poet Herbert, narc Steve, and the 'stupid fat kid' Miosky, take an eventual bus trip to Washington... if they can ever get there."
      ],
      "budget": 0
   },
   "movielensId": 325,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "1995-09-08",
      "dvdReleaseDate": "2004-06-01",
      "directors": ["Kelly Makin"],
      "runtime": 91,
      "movieId": 325,
      "title": "Senior Trip",
      "mpaa": "R",
      "actors": [
         "Matt Frewer",
         "Valerie Mahaffey",
         "Lawrence Dane",
         "Tommy Chong",
         "Jeremy Renner",
         "Rob Moore",
         "Kevin McDonald",
         "Michael Blake",
         "Tara Strong",
         "Nicole de Boer",
         "Sergio Di Zio",
         "Fiona Loewi",
         "Kathryn Rose",
         "Danny Smith",
         "Jeremy Renner",
         "George R. Robertson"
      ],
      "imdbMovieId": "0113936",
      "originalTitle": "Senior Trip",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["NEMpSSOutfg"],
      "plotSummary": "While on detention, a group of misfits and slackers have to write a letter to the President explaining what is wrong with the education system. There is only one problem, the President loves it! Hence, the group must travel to Washington to meet the Main Man.",
      "tmdbMovieId": 27993,
      "avgRating": 2.65237,
      "releaseYear": "1995",
      "numRatings": 1096,
      "posterPath": "/qfMbFIGNIQ76FEu7Wg48aEbxFh1.jpg"
   }
}