{
   "tmdb": {
      "original_language": "zh",
      "keywords": [
         {
            "name": "gambling",
            "id": 395
         },
         {
            "name": "china",
            "id": 478
         },
         {
            "name": "child abuse",
            "id": 516
         },
         {
            "name": "communist",
            "id": 2109
         },
         {
            "name": "cultural revolution",
            "id": 4004
         },
         {
            "name": "chinese civil war",
            "id": 4355
         },
         {
            "name": "epic",
            "id": 6917
         },
         {
            "name": "shadow puppet",
            "id": 177329
         },
         {
            "name": "1940s",
            "id": 207883
         },
         {
            "name": "1950s",
            "id": 208611
         },
         {
            "name": "1960s",
            "id": 208992
         }
      ],
      "imdb_id": "tt0110081",
      "video": false,
      "title": "To Live",
      "recommendations": [
         42006,
         14226,
         10997,
         10404,
         41821,
         38143,
         12276,
         101908,
         45935,
         36210,
         2912,
         27031,
         69599,
         51885,
         25838,
         12659,
         52103,
         18302,
         18232,
         11599
      ],
      "backdrop_path": "/peZyq9WQgTjTaWXV2gC0FcZomLN.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Xu Fugui",
               "gender": 2,
               "credit_id": "52fe447d9251416c91012969",
               "name": "Ge You",
               "profile_path": "/ehtM3p1M3AexKdzxh5llWVCZmqm.jpg",
               "id": 76913,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Jiazhen",
               "gender": 1,
               "credit_id": "52fe447d9251416c9101296d",
               "name": "Gong Li",
               "profile_path": "/dgGWKMAP5vbgACkXTazZXt3JQoT.jpg",
               "id": 643,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Town Chief",
               "gender": 2,
               "credit_id": "52fe447d9251416c91012977",
               "name": "Niu Ben",
               "profile_path": "/oQmPKUtfVvu0xhv0oNaro1fxaVE.jpg",
               "id": 146044,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Wan Erxi",
               "gender": 2,
               "credit_id": "545bd6b6c3a3685368001bd5",
               "name": "Jiang Wu",
               "profile_path": "/ndQCjuXjwlJxq7PF7TNYYlGAXJX.jpg",
               "id": 15170,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Fugui's father",
               "gender": 2,
               "credit_id": "54c2282ac3a3687929003938",
               "name": "Huang Zong Luo",
               "profile_path": "/hpOKY3A87GfOPDTqNcEHGo0YChm.jpg",
               "id": 1417404,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Chunsheng",
               "gender": 2,
               "credit_id": "58e333ccc3a3684a7900afc9",
               "name": "Guo Tao",
               "profile_path": "/eb6MoYwQ1XfqtTJ4PKDixAmlyXA.jpg",
               "id": 548608,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Long'er",
               "gender": 2,
               "credit_id": "58e3340292514128100189fa",
               "name": "Ni Dahong",
               "profile_path": "/28m2VML1UolILxdhHNLHf0m2tIX.jpg",
               "id": 17382,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Xu Fengxia (adult)",
               "gender": 1,
               "credit_id": "58e3345c92514127e801a306",
               "name": "Liu Tianchi",
               "profile_path": "/g5FZLLBpm9q9BZtP8R36kym9uru.jpg",
               "id": 1789263,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Xu Fengxia (child)",
               "gender": 0,
               "credit_id": "58e33497c3a3684a7900b228",
               "name": "Zhang Lu",
               "profile_path": null,
               "id": 1789265,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Xu Fengxia (youth)",
               "gender": 0,
               "credit_id": "58e334bb92514179de00ba5c",
               "name": "Xiao Cong",
               "profile_path": null,
               "id": 1789267,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Xu Youqing",
               "gender": 0,
               "credit_id": "58e334e792514127e801a542",
               "name": "Dong Fei",
               "profile_path": null,
               "id": 1789268,
               "order": 11
            },
            {
               "cast_id": 19,
               "character": "Fugui's mother",
               "gender": 0,
               "credit_id": "58e33539c3a36872ee01a3d4",
               "name": "Liu Yanjin",
               "profile_path": null,
               "id": 1789269,
               "order": 12
            },
            {
               "cast_id": 20,
               "character": "Lao Quan",
               "gender": 2,
               "credit_id": "58e3358bc3a3684aa400af03",
               "name": "Li Lianyi",
               "profile_path": "/g5x3gwjuQnTL7RvF7QxJ0XwATva.jpg",
               "id": 1789270,
               "order": 13
            },
            {
               "cast_id": 22,
               "character": "Mantou",
               "gender": 0,
               "credit_id": "58e336aa9251412819019647",
               "name": "Zhang Kang",
               "profile_path": null,
               "id": 1789274,
               "order": 15
            },
            {
               "cast_id": 23,
               "character": "Physician Wang",
               "gender": 2,
               "credit_id": "58e344bf92514127f001bfbf",
               "name": "Zhao Yuxiu",
               "profile_path": "/7VTQbCwIWdmJyZcWXWK797kvNCn.jpg",
               "id": 1789285,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe447d9251416c9101295f",
               "name": "Lu Wei",
               "profile_path": null,
               "id": 27074,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe447d9251416c91012965",
               "name": "Hua Yu",
               "profile_path": null,
               "id": 126520,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe447d9251416c91012973",
               "name": "Zhang Yimou",
               "profile_path": "/uU5vECl94jDQYjiRk4eOpVRMEi9.jpg",
               "id": 607,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "589612e7c3a368627c008811",
               "name": "Lü Yue",
               "profile_path": null,
               "id": 72204,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "War",
            "id": 10752
         }
      ],
      "popularity": 5.597081,
      "production_countries": [
         {
            "iso_3166_1": "CN",
            "name": "China"
         },
         {
            "iso_3166_1": "HK",
            "name": "Hong Kong"
         }
      ],
      "id": 31439,
      "vote_count": 74,
      "budget": 0,
      "overview": "Fugui and Jiazhen endure tumultuous events in China as their personal fortunes move from wealthy landownership to peasantry.",
      "similar": [
         403,
         746,
         238,
         2604,
         294016,
         377447,
         10236,
         1941,
         5967,
         15677,
         42984,
         19259,
         45999,
         117486,
         41799,
         2111,
         44162,
         80427,
         4890,
         73132
      ],
      "original_title": "活着",
      "runtime": 125,
      "poster_path": "/kKZYobKNLPGoOt7p2pfTRggelgP.jpg",
      "spoken_languages": [{
         "name": "普通话",
         "iso_639_1": "zh"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Shanghai Film Studios",
            "id": 1078,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Era International Ltd",
            "id": 25299,
            "origin_country": ""
         }
      ],
      "release_date": "1994-06-30",
      "vote_average": 7.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "China",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Yimou Zhang"],
      "runtime": 125,
      "synopsis": "The story begins some time in the 1940s. Xu Fugui (Ge You) is a local rich man's son and compulsive gambler, who loses his family property to a man named Long'er. His behaviour also causes his long-suffering wife Jiazhen (Gong Li) to leave him, along with their daughter, Fengxia and their unborn son, Youqing. After he loses his entire family fortune, Fugui eventually reunites with his wife and children, but is forced to start a shadow puppet troupe with a partner named Chunsheng to support his family. The Chinese Civil War is occurring at the time, and both Fugui and Chunsheng are forcibly enlisted into the Kuomintang during a performance. After a heavy battle, Fugui and Chunsheng are captured by the forces of the Communist Party of China, where they quickly become entertainers for the troops. Eventually Fugui is able to return home and finds out that Fengxia has become dumb and lost most of her hearing due to a fever. After the CCP's victory, Fugui attends a local public trial where the new communist authority convicts Long'er of sabotaging the revolution. Long'er recognises Fugui, and tries to break free from the executioners, but he is brought back and shot. It turns out that Long'er did not want to donate any of his wealth to the \"people's government\", and when they tried to pressure him to do so, they only enraged him further so that he decided to burn all of his property instead of giving it away. No one helped to extinguish the fire due to Long'er's bad reputation, and he was designated a reactionary. The story moves forward a decade into the future, to the time of the Great Leap Forward. The local town chief enlists Fugui and Jiazhen to donate all scrap iron in their possession to the national drive to produce steel and make weaponry for invading Taiwan. As an entertainer, Fugui performs for the entire town, which has been devoted entirely to producing steel. Later, the district head, who turns out to be Chunsheng, inadvertently crushes and kills Youqing. At the gravesite of the boy, his mother leaves for him a lunchbox of 20 stale dumplings, which were intended as his lunch for school that day, plus 20 newly made dumplings. Chunsheng arrives at the grave, but his attempts to apologize and compensate the family are rebuffed. The story moves forward again another decade, to the Cultural Revolution. The village chief advises Fugui's family to burn their shadow puppet drama props, which have been deemed as counter-revolutionary as they are traditional cultural elements. Fengxia is now grown up. Her family arranges for her to meet Wan Erxi, a local leader of the Red Guards. They fall in love and marry. It is then revealed that Chunsheng, the district chief, has been branded a reactionary. He arrives late at night to inform Fugui and Jiazhen that his wife has committed suicide and he plans to do so also. Chunsheng wanted to give all of his money to Fugui's family as a form of his final apology and wished that they accept the money before his death. Jiazhen, who up to that point refused to talk to Chunsheng, tells him to keep living, because \"you still owe us a life!\" During Fengxia's childbirth, her parents and husband accompany her to the county hospital, where they find out that nurses are in charge as all doctors have been sent to do hard labor for being \"reactionary academic authorities\". The nurses tell the family that both the child and mother will be fine, but the family is skeptical, and manages to retrieve a doctor from confinement to oversee the birth. As the doctor has not eaten for several days, Fugui purchases seven steamed buns (mantou) for him and the family decides to name the son Mantou, after the buns. However, Fengxia begins to hemorrhage, and the nurses panic, admitting that they do not know what to do. The family and nurses seek the advice of the doctor, but find that he has overeaten and is semiconscious. The family is helpless, and Fengxia dies from hypovolemia. The point is made that the doctor ate 7 buns, but that by drinking too much water at the same time, each bun expanded to the size of 7 buns: therefore Fengxia's death is a result of the doctor's having the equivalent of 49 buns in his belly. (1949 was the year that the Chinese Communist Party cemented its hold on modern China.) The movie ends several years later, with the family now consisting of Fugui, Jiazhen, their son-in-law Erxi, and grandson Mantou. The family visits the graves of Youqing and Fengxia, where Jiazhen, as per tradition, leaves dumplings for her son. Erxi buys a box full of young chicks for his son, which they decide to keep in the chest formerly used for the shadow puppet props. When Mantou inquires how long it will take for the chicks to grow up, Fugui's response is a more tempered version of something he said earlier in the film, which shows that he no longer possesses the blind faith in communism he once had. However, in spite of all of his personal hardships, he expresses optimism for his grandson's future, and the film ends with his statement, \"and life will get better and better\" as the whole family sits down to eat.",
      "writers": [
         "Wei Lu",
         "Hua Yu"
      ],
      "originalLanguage": "Mandarin",
      "imdbLink": "http://www.imdb.com/title/tt0110081/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ0NDAyMzYwMV5BMl5BanBnXkFtZTYwMTQwNzk5._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: You Ge, Li Gong, Ben Niu | See full cast and crew »"],
      "reviews": [
         "It's a shame that not more people have seen this movie, judging by the amount of user comments and ratings. Now that director Yimou Zhang ('Hero' & 'House of Flying Daggers') has become more popular, I'm hoping this will change. 'Huozhe' or 'To Live' takes us on a trip in China that will last us from the 40's through the 70's. Through that time, we will see life through the eyes of Fugui and Jiazhen, a husband and wife with 2 children, as well as Fugui's mother. Fugui, the husband, has a gambling problem which will set off a chain of events that will have them lose the house, and eventually separate the family. Jiazhen, his wife, is forced to take a job which will put a strain on her children. Communist and nationalist armies battle each other, and the rise of Chairman Mao will affect them as well. Fugui will go through layers of mishaps that will change him forever. I don't want to detail anything more about the plot, it's much more worth viewing it and experiencing it then anything I can ever say here. Not once is this movie boring, effectively placing us there, with the family. The acting seems so natural that it feels like you are there, traveling with them, rather then viewing them through a camera. This of course shows the strength of Zhang's directing. You Ge plays Fugui, a popular actor in China, won the award for the Cannes Film Festival. Li Gong is beautiful, and portrays her character with such passion, it's no wonder she has been nominated nearly a dozen times, winning most. Emotional without being sappy, honest, & historically accurate, the film does have a black shroud covering it. In times of sadness, it's lifted a bit to allow us to see happiness, indeed, life, pull this family together. It even has bits of humor in it, at times, I laughed along with the family as much as I felt their pain. Little details, such paintings in the background that chip away as time goes by, shows how much care went into making this film. Characters that seem unimportant become part of the story later. What a wonderful film. When I saw it 10 years ago, it not only changed the way I saw foreign movies, it also changed the way I see life and people. Any movie that can do that is one I highly recommend to anyone. A perfect 10 out of 10.",
         "When I re-watched FAREWELL MY CONCUBINE recently I was surprised that it was much less political than I remembered it being. Turns out that's because I'd somehow merged together that film and TO LIVE together in my poor muddled brain. Both have some similarities, beyond the common appearance of Gong Li in front and Zhang Yimou behind the camera, but TO LIVE definitely confronts the political (I should really say \"social\") aspects of the decades they cover much more directly and forcefully. TO LIVE (aka LIFETIMES - I dunno what the Chinese name is) basically covers 3 or 4 decades of one family's life in China, in a period that saw not one but two revolutions, and looks at the effect the social upheaval had on ordinary people's lives. The film rarely criticises the political movements instigated by Mao Tse Tung, but does an effective job of showing the hellishness of a society that has been turned on its head, where the people are forced to change not just the way they live but the way they think, and people are forced into social relationships that are new, and quite possibly against human nature. I hope I won't jeapordise my visa if I admit that I had strong leanings towards Communism when I was younger, having read Marx in philosophy classes. His picture of a society without private possessions or social hierarchy did seem very appealing, but Marx acknowledged that the only way for such a society to work was if every member saw the value of it and willingly took part in it, and admitted that the only way that was likely to happen was via massive revolution - i.e. killing everyone that didn't agree with the plan. As a teenager, that didn't seem like such a big price or problem Certainly I'm not the only person to have considered this price worth paying, and a couple of people have actually put the plan into practice - lamentably with less than stellar results. Mao Tse Tung is, I guess, the undisputed king of Communist revolution, having led TWO of them in China, and probably disrupting more peoples' lives than anybody else in history in the process. TO LIVE gives those of us that haven't had to live through such conditions some idea of what it might have been like. People used to the cushy capitalist western lifestyle might wonder just how on earth people can live through conditions like that, but that's the what the film wants to say... life might deal you some crappy hands, but people are remarkably adaptable and resilient, and you've just got to try to live the best you can. It sounds remarkably trite put like that, but the film does a good job of expressing it. The film is based on a novel, with the author co-writing the screenplay as well. Zhang Yimou directs brilliantly as usual, which in this case is to recognise the strength of the story and characters and to back off a little, giving them space to live their lives. Although the film looks great throughout, the cinematography is quite unobtrusive. He once more elicits a great performance from Gong Li and the rest of the cast, with leading man Ge You giving the best one of all. The film has occasionally been criticised for throwing piling too much tragedy on, but this is never done in an exploitative/manipulative way, and Zhang Yimou avoids turning to melodrama to evoke an audience reaction... which makes him all the more likely to get one (and without the audience feeling used afterwards). In a career full of magnificent films, TO LIVE stands as one of Zhang Yimou's finest moments. The film is epic yet remarkably simple, and the execution is as near to flawless as I've seen. I doubt that even Akira Kurosawa could have handled the material better, which is to say that Zhang Yimou surely ranks in the world's top echelon of film-makers. Long may his life and career continue Highest recommendation!",
         "This is Zhang Yimou's and Gong Li's crowning triumph -- a top candidate for the greatest Chinese film of all time. Splendidly photographed and composed, consumately acted and faithfully scored, \"To Live\" is a three or four hour film novel lovingly packed into two hours and fifteen minutes. For a long time, Ingmar Bergman's \"Fanny and Alexander\" stood by itself as the greatest family epic in my moviegoing experience. \"The Best Years of Our Lives\" ran a distant second. But since 1995 \"To Live\" has moved into a very close second. Most Chinese who lived through Mao's Revolution say this film tells it like it was at the simple townsperson level. Though it can serve as an overview of Chinese history 1944 to 1970 or so, unlike Lean's \"Gandhi\" or \"Lawrence of Arabia\", this is not a hero's biopic. Instead we see a foolish, once rich but now fallen heir and his wife blown about by the winds of fortune for three decades and challenged as parents trying to raise two children under increasingly harsh and punitive communist tyranny. What you sense in this film, that I've never seen before in any Chinese film, is how the ethical and moral principles that have prevailed in Chinese culture for 2500 years - a mix of transcendence and pragmatism, humility and grit, cosmic harmonic balance and social duty - allows an ordinary couple to accept unbearable tragedy and keep going. It also shows what this survival strategy costs them in their Communist context. The screenplay is full of cosmic irony. It makes us aware, without shouting, that this is just one family among millions. As Yimou's transitional screen message says: \"...leaving no family unaffected\". It is to that extent, a tribute film. Maybe ten hours of Kieslowski's \"Decalogue\" might accomplish the same broad survey of of human happenstance and emotion. Maybe Kurosawa in three or four hours. But never in two plus hours have I seen the scope Zhang Yimou achieves here. \"To Live\" also contains as wise a moral lesson as any film I've seen, and it's a gentle one despite the surrounding violence. I couldn't paraphrase the lesson for you. I wouldn't try. Just watch. It will reach you non-verbally in about 90 minutes. Just know, this isn't Shakespeare, Hollywood or soap opera. It's something else. Gong Li's work is as powerful as anything Streep or Sarandon have ever done in the west - which is all the more inspiring since the camera doesn't lavish star-level attention on her. As her husband, Ge You turns in an emotionally riveting, charming, sometimes funny and devastatingly honest performance. The direction is sure handed, the shooting unfailingly gorgeous. Zhang Yimou's cinematic canvass has never been so big or his palette so colorful and controlled. Full of spectacle, great sweeps of time and onrushing tides of humanity, \"To Live\" is still, in the end, a sweet and poignant epic with an intimate, observant heart. Great story telling. Do not miss! Try to view a letterbox version on a big screen.",
         "I think most of us can watch Freddy Krueger rip people apart and barely flinch. Not that Nightmare on Elm Street is a bad film, it never inflicts pain on the viewer. But this film is so beautiful and so real, that it's unbearably heartbreaking at times. Every time I watch it, and I know a particular heartbreaking scene is coming up, I almost want to turn it off, but I'm just frozen in place, forced to experience the pain of the people on screen, that I've traveled three decades with. Zhang's understanding of the people of China, and the tragedy of history is full of empathy, respect, and adoration. In every scene, Gong Li embodies strength and beauty. Zhang's study of communism and of the Chinese government, isn't a villifying one sided argument, but one with complete understanding of the tragedy of this huge social experiment, that effected not only China, but the whole world. As a Korean American, I draw some appreciation at the parallel effects on Communism on Korea. Mao-Kim, Taiwan-SouthKorea. But this is a truly universal movie, and anyone would enjoy it.",
         "Not. What I think Zhang Yimou's message here is that the will of the people \"to live,\" as in the title, to survive and overcome obstacles is what defines the Chinese people. They ride the ox of communism as a boat rides a wave. They adapt. Consider that tall and thin Fugui (played with consummate skill by You Ge) says that a chick will become a chicken when it grows up, and then a sheep and then an ox and then the Communist Party. But as the film ends he tells his grandson only that the chick will become a chicken and then a sheep and then an ox. He doesn't mention communism. In this way we know that the people have tamed the ox. Zhang's film is an epic parable of life in China in the 20th century. It opens before the communist revolution with protagonist Fugui as a wayward son who is gambling the family fortune away. His wife, Jiazhen (Gong Li) pleads with him to stop, but he cannot. He is addicted to vice. Symbolically he represents the old regime. He loses everything, wife included and goes to live in the streets. After some time the revolutionary war begins and he and his friends find it convenient to switch sides and join the revolutionary army--he as an entertainer for the troops, a puppeteer. He and wife reunite and become loyal and even enthusiastic communists. He is lucky to have lost his fortune for now he is recognized as a hero of the revolution, while the man who won his family's house at dice is declared a counter-revolutionary and meets a bad end. As in every Zhang Yimou film I have seen, everything is beautifully and exquisitely done. His work is characterized by an artist's sense of color and form, by an engaging simplicity in the telling, and by a subtle sense of what is going on politically, and especially by a deep and abiding sense of humanity. Here the transformation of Chinese society from feudalism to communism to the capitalist/communism hybrid that exists today is shown through the eyes and experiences of the people; and what is emphasized is the endurance and the will of the people to survive, adapt and finally to flourish regardless of who might be in power. I would compare Zhang Yimou to the very greatest directors, say, to Stanley Kubrick, to Francis Ford Coppola, to Louis Malle, to Krzysztof Kieslowski in sheer artistic talent. Like Malle he is warm and honest about human beings and what they do without being maudlin or sentimental. Like Coppola he has an epic-maker's vision, and like the Coppola of the Godfather films, a strong sense of family. Like Kubrick he is creative and always aware of the needs of the audience, and like Kieslowski he is clever. This is in some respects Zhang Yimou's finest achievement because of the way he tells the story of communism in China. I am reminded of the way Louis Malle tells the truth about human sexuality without inciting the censors. Here Zhang Yimou tells the truth about the communist experience in China, subtly demonstrating its cruelties and stupidities without, amazing enough, incurring the wrath of the authorities. (Some of his films have been banned in China, but I understand they are readily available nonetheless.) Here the kids are smiling and happy as they work in the steel mill. The accident that kills Fugui's son is seen as just that, an accident and not the fault of the \"Great Leap Forward.\" The members of the educated class, who are ridiculed, beaten and banished (and worse) during the \"Cultural Revolution,\" accept their fate as their just deserts--the doctor who insists that it is better to wear the placard shaming him that is hung from around his neck than it is to take it off. The local official who has preached and practiced the communist line faithfully, who finds himself being labeled a capitalist, also accepts his fate as though in doing so he is furthering a cause larger than himself. In a way Zhang Yimou's international celebrity and reputation as one of the world's greatest film makers protects him. In another sense his depictions of the sins and excesses of the old regime before communism are so well done and appreciated by all, that such an expression also protects him. Nonetheless, I do not personally consider this Zhang Yimou's best film. I prefer the startling beauty of Raise the Red Lantern (1991) and Red Sorghum (1987) as well as the charming Not One Less (1999) or the simple but powerful, The Story of Qiu Ju. However, this is an outstanding film. Notable in a supporting role is Wu Jiang as Wan Erxi the strong young man with the limp who marries the mute daughter. I have seen him in Shower (1999) in which his personal charisma and strength of character are shown more fully. He is the younger brother of Wan Jiang who starred in Zhang Yimou's first film, Red Sorghum. Of course Gong Li, one of the finest actresses of our time, who is often featured in Zhang Yimou's films, is outstanding as always. (Note: Over 500 of my movie reviews are now available in my book \"Cut to the Chaise Lounge or I Can't Believe I Swallowed the Remote!\" Get it at Amazon!)",
         "Yimou Zhang's \"To Live\" begins in the late 1940s and covers several decades in the life of Fugui (You Ge), his wife Jiazhen (Li Gong), and their two children. It is an excellent family drama, provoking both laughter and tears, and distinguishing itself from similar movies because of its commitment to showing how China's changing society affects the family. It takes the huge subject of \"the first twenty years of Communism in China,\" and brings it down to a human scale. Both leading actors nicely portray the way their characters change over the years. At first, Fugui is the stereotypical \"callow young man\" and Jiazhen the even more stereotypical \"long- suffering wife,\" but the screenplay and actors eventually deepen the characterizations. The best sequence of the film covers the Chinese Civil War. Wisely, Yimou Zhang resists the temptation to make the movie too epic, and instead focuses on Fugui's personal experiences. The result is a very moving depiction of the human cost of war. In another striking touch, Fugui's hobby is singing with a shadow-puppet troupe. The puppets not only provide an interesting glimpse into traditional Chinese culture, they also take on a symbolic meaning. After watching \"To Live,\" it's easy to see why the Chinese authorities banned it: there's a lot of tragedy in the film, and in most cases, Communism is to blame. Remarkably, though, Zhang also makes many of the Communist characters sympathetic. For instance, Fugui and Jiazhen's daughter marries an officer in the Red Guards, who is a little ridiculous in his devotion to Mao Zedong, but not a villain. This is in keeping with the overall spirit of \"To Live\"--humanistic and subtle, instead of bombastic or propagandistic. It's both an important examination of recent Chinese history, and a universal story about how individual human beings manage \"to live\" in times of hardship. A rare combination, and one well worth seeing.",
         "Impressive observational film about mid-20th-century China, which is brought into focus through the tribulations of one family over a thirty-plus-year period. Others here have called it a Chinese `Gone with the Wind,' but in this respect it's more like a Chinese `Les Misérables,' albeit on a smaller scale. What's most remarkable about it is how it manages to be both a political film, and an objective one--it judges the political happenings that serve as its backdrop, yes, but we never get the sense that it is PRE-judging them. `Huozhe' is no propaganda film--it allows its events to unfold organically, and allows us to infer its meaning on our own. The fact that director Zhang Yimou's approach is so delicate makes what happened after the film's release even more sad, and more telling--the film was banned, and Zhang and one of his stars, Gong Li, were barred from filmmaking for two years. Casual viewers may find that shocking, as the overall tone is one of affection and optimism for one's country, and the characters are more interested in simply staying together (and alive) than in declaring any kind of political allegiance. Technically, the film is lovely as well, with beautiful cinematography and fine performances by Ge You and Gong making it as satisfying aesthetically as it is intellectually. 8 out of 10.",
         "Reasonably well off, Fugui loses all his money due to his gambling addiction. Eventually he loses his house in a game of dice with Long'er. Fugui's pregnant wife Jiazhen leaves him when it is clear he wants his vice over her. With poverty, Fugui comes to his senses and starts work with his own puppet troupe. On the birth of their son Jiazhen returns to the reformed Fugui, but civil war breaks out and Fugui leaves to fight. With things difficult already, the rise of the Maoist regime makes things ever more difficult and the Xu family suffer fortune and misfortune as Communism is formed. I watched this movie because it had won the top award at Cannes. I hadn't high hopes for some reason, but I figured it was worth a look. I am very glad I did because it is a wonderful little piece that can be enjoyed with little knowledge of the regime against which it is set. The story follows the family's misfortunes and how they are affected by the rise of Chairman Mao. Their plight is touching as they suffer wrongs but also show compassion on others \u0096 all the while trying to do the right thing by the system that is impacting on them. Even when tragedy occurs they never blame Communism but heap it on themselves instead. This unfolds over many years with the rise of Mao as the backdrop. The parrellel between the two things is clear without being forced or rammed down our throats \u0096 it's a wonderful bit of handling. Even better is the infusion of comic touches all the way through, the dialogue (even in subtitle form) is great and is witty and touching \u0096 I laughed out loud many times. Not having seen any other films by Zhang, I can only hope they are as good as this one. The cast, too, do a great job with the film. You Ge's Fugui is fabulous \u0096 he is a draw from the start on, and his ageing is so convincing that credit must go not only to the makeup but also to Ge for doing so well with potentially tragic figure. Likewise Gong is superb but ages less convincingly. The support cast are all good from the children through to the figures of Mao like Jiang and Niu. The only thing that saddened me about the two great leads is to think that Western cinema will never care to have them in any films \u0096 I guess that when it comes to Hong Kong cinema Hollywood only are interested if it has slow-motion and guns! (and they think they're cutting edge!) Overall I find it very hard to fault this film as it has so much going for it on so many levels. Just as a human story it is excellent, and the historical context only serves to make it better. Comic and touching right to it's perfectly pitched close, this should be searched out by anyone who wants a genuinely moving human tale with political comment sown into each frame without intrusion.",
         "This is a beautiful story of one family as they cope with the changing times in revolutionary China. Through their eyes, we get a glimpse of what life must have been like for an average person in those days. The story begins with Fugui gambling away his family's home. Urbane and self-confident, he is quickly broken by the loss of his home and his father, who dies from shame. Having to leave his mother in the care of the new owner, he goes off with some puppets that have been loaned to him, making a living putting on shows around the countryside. He gets caught up in the revolution, helps the communist army, and eventually returns to find the wife and family he left behind. Nearly the entire story takes place in the city where he lives, a small side street in particular - no more than an alley by western standards. Fugui's wife, Jiazhen, lovingly played by the great actress, Gong Li, has been given a job by the local committee hauling hot water to local families. Fugui settles in and begins entertaining the neighborhood with his puppet shows. They have a mute daughter, Fengxia, and a precocious son, Youging. We see the family grow up and undergo changes, most of them tragic. Much of the action is tied to the political climate that evolves from the revolution through the period of the Red Guards (50's, 60's, early 70's). The son is killed by accident when a party official backs his jeep into a wall and crushes him. The father is told that his puppets are now considered counter-revolutionary, so he has to give up that pleasure. The daughter marries a kindly party official from a local factory, but dies in childbirth after the nursing students have expelled the doctors from the maternity ward for not being politically pure enough. Through it all the family perseveres, not with any great histrionics, but with acceptance and love. The parents are simple people who just want what's best for their children, but because of the circumstances set in action by the communists, they lose their daughter and son. This isn't an overly political film. The communist officials aren't depicted as evil, but neither are they particularly heroic. The local party leader is friendly and helpful to the family, as is the son-in-law. But apparently the depiction of the party in less than glowing terms during this period was offensive enough for the Chinese government to ban this film. Which is too bad because it's a tribute to the strength of the Chinese people and not a slam at communism per se. This is a beautiful film with a haunting musical theme running through it. I highly recommend it.",
         "This movie, which was banned in mainland China for \"Questionable\" outlooks on the communist party, is one of the best movies I have seen thus far. It is easy to dismiss this movie as a \"Sad period piece,\" but with another look, one sees that this is a story about triumph... of taking heart in the fact that one lives. The title, \"To Live,\" is very apt, as we see the rises and falls of one small family living through the ups and downs of China during the pre-revolutionary era, the civil war, the Great Leap Forward, the Proletariat Cultural Revolution, and beyond. This movie is at turns dramatic, humorous, touching, chilling, heart-wrenching, and triumphant. A true roller coaster of emotions, played out in the subtle tones only Chinese film can truly capture."
      ],
      "genres": [
         "Drama",
         "War"
      ],
      "productionCompanies": [
         "ERA International",
         "Shanghai Film Studios"
      ],
      "summaries": ["Fugui and Jiazhen endure tumultuous events in China as their personal fortunes move from wealthy landownership to peasantry. Addicted to gambling, Fugui loses everything. In the years that follow he is pressed into both the nationalist and communist armies, while Jiazhen is forced into menial work. They raise a family and survive, managing \"to live\" from the 40's to the 70's in this epic, but personal, story of life through an amazing period."],
      "budget": 0
   },
   "movielensId": 326,
   "movielens": {
      "languages": ["普通话"],
      "releaseDate": "1994-06-30",
      "dvdReleaseDate": "2003-07-01",
      "directors": ["Zhang Yimou"],
      "runtime": 125,
      "movieId": 326,
      "title": "To Live",
      "mpaa": "",
      "actors": [
         "Ge You",
         "Gong Li",
         "Niu Ben",
         "Jiang Wu",
         "Huang Zong Luo",
         "Guo Tao",
         "Ni Dahong",
         "Liu Tianchi",
         "Zhang Lu",
         "Xiao Cong",
         "Dong Fei",
         "Liu Yanjin",
         "Li Lianyi",
         "Zhang Kang",
         "Zhao Yuxiu"
      ],
      "imdbMovieId": "0110081",
      "originalTitle": "活着",
      "genres": [
         "Drama",
         "Romance",
         "War"
      ],
      "youtubeTrailerIds": ["GAZUbjttUPc"],
      "plotSummary": "Fugui and Jiazhen endure tumultuous events in China as their personal fortunes move from wealthy landownership to peasantry.",
      "tmdbMovieId": 31439,
      "avgRating": 4.08496,
      "releaseYear": "1994",
      "numRatings": 1489,
      "posterPath": "/kKZYobKNLPGoOt7p2pfTRggelgP.jpg"
   }
}