{
   "tmdb": {
      "original_language": "es",
      "keywords": [
         {
            "name": "united states–mexico barrier",
            "id": 5616
         },
         {
            "name": "killer",
            "id": 15127
         },
         {
            "name": "legs",
            "id": 33649
         },
         {
            "name": "cult film",
            "id": 34117
         },
         {
            "name": "arms",
            "id": 162740
         },
         {
            "name": "guitar case",
            "id": 206558
         }
      ],
      "imdb_id": "tt0104815",
      "video": false,
      "title": "El Mariachi",
      "recommendations": [
         1428,
         8068,
         10835,
         11782,
         8012,
         9333,
         12143,
         11368,
         9604,
         379,
         2019,
         11412,
         319,
         3595,
         2142,
         11022,
         2293,
         9208,
         9945,
         16608
      ],
      "backdrop_path": "/8gzZWRibpRQAA2ZPk0VhKtwHNhw.jpg",
      "revenue": 2040920,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "El Mariachi",
               "gender": 2,
               "credit_id": "52fe44eec3a36847f80b27f9",
               "name": "Carlos Gallardo",
               "profile_path": "/sW2n8SICpA4mHFBR29ZUbzfD3lX.jpg",
               "id": 20498,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Bigotón",
               "gender": 0,
               "credit_id": "52fe44eec3a36847f80b2801",
               "name": "Jaime de Hoyos",
               "profile_path": null,
               "id": 57470,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Mauricio (Moco)",
               "gender": 2,
               "credit_id": "52fe44eec3a36847f80b2805",
               "name": "Peter Marquardt",
               "profile_path": null,
               "id": 57471,
               "order": 3
            },
            {
               "cast_id": 18,
               "character": "Azul",
               "gender": 0,
               "credit_id": "52fe44eec3a36847f80b2851",
               "name": "Reinol Martinez",
               "profile_path": "/dJ6cz0KBlOyVLpaEHU2Z4eOOgXN.jpg",
               "id": 1192733,
               "order": 4
            },
            {
               "cast_id": 19,
               "character": "Cantinero",
               "gender": 0,
               "credit_id": "52fe44eec3a36847f80b2855",
               "name": "Ramiro Gomez",
               "profile_path": null,
               "id": 1192734,
               "order": 5
            },
            {
               "cast_id": 20,
               "character": "Domino",
               "gender": 0,
               "credit_id": "5300df549251416ae738b1f4",
               "name": "Consuelo Gómez",
               "profile_path": null,
               "id": 1293343,
               "order": 6
            },
            {
               "cast_id": 21,
               "character": "Moco's Men",
               "gender": 2,
               "credit_id": "58f41b409251413da7019f90",
               "name": "Juan García",
               "profile_path": "/10oxI8zCWatmXHF6IGeduYRKesF.jpg",
               "id": 1066358,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44eec3a36847f80b280b",
               "name": "Robert Rodriguez",
               "profile_path": "/bPqRdLWWwpOT8sBdj9PWOzNgwou.jpg",
               "id": 2294,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44eec3a36847f80b2811",
               "name": "Robert Rodriguez",
               "profile_path": "/bPqRdLWWwpOT8sBdj9PWOzNgwou.jpg",
               "id": 2294,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe44eec3a36847f80b2817",
               "name": "Carlos Gallardo",
               "profile_path": "/sW2n8SICpA4mHFBR29ZUbzfD3lX.jpg",
               "id": 20498,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44eec3a36847f80b281d",
               "name": "Robert Rodriguez",
               "profile_path": "/bPqRdLWWwpOT8sBdj9PWOzNgwou.jpg",
               "id": 2294,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44eec3a36847f80b2829",
               "name": "Eric Guthrie",
               "profile_path": null,
               "id": 57473,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe44eec3a36847f80b282f",
               "name": "Chris Knudson",
               "profile_path": null,
               "id": 57474,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe44eec3a36847f80b2835",
               "name": "Álvaro Rodríguez",
               "profile_path": null,
               "id": 57475,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe44eec3a36847f80b283b",
               "name": "Cecilio Rodríguez",
               "profile_path": null,
               "id": 57478,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe44eec3a36847f80b2841",
               "name": "Mark Trujillo",
               "profile_path": null,
               "id": 57479,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe44eec3a36847f80b2847",
               "name": "Robert Rodriguez",
               "profile_path": "/bPqRdLWWwpOT8sBdj9PWOzNgwou.jpg",
               "id": 2294,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44eec3a36847f80b284d",
               "name": "Robert Rodriguez",
               "profile_path": "/bPqRdLWWwpOT8sBdj9PWOzNgwou.jpg",
               "id": 2294,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 10.019782,
      "production_countries": [
         {
            "iso_3166_1": "MX",
            "name": "Mexico"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 9367,
      "vote_count": 321,
      "budget": 220000,
      "overview": "El Mariachi just wants to play his guitar and carry on the family tradition. Unfortunately, the town he tries to find work in has another visitor...a killer who carries his guns in a guitar case. The drug lord and his henchmen mistake El Mariachi for the killer, Azul, and chase him around town trying to kill him and get his guitar case.",
      "similar": [
         1359,
         10585,
         3597,
         3600,
         12521,
         12662,
         1991,
         2832,
         9659,
         111,
         101,
         627,
         948,
         949,
         8810,
         9355,
         4638,
         238636,
         245891,
         346364
      ],
      "original_title": "El Mariachi",
      "runtime": 81,
      "poster_path": "/4S47gyKZI5aLiawwc45e4gnPlPx.jpg",
      "spoken_languages": [{
         "name": "Español",
         "iso_639_1": "es"
      }],
      "production_companies": [{
         "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
         "name": "Columbia Pictures",
         "id": 5,
         "origin_country": "US"
      }],
      "release_date": "1992-09-04",
      "vote_average": 6.7,
      "belongs_to_collection": {
         "backdrop_path": "/6p1OzuIKWnTDfDea7IpB9xra5J.jpg",
         "name": "Mexico Trilogy",
         "id": 9649,
         "poster_path": "/qmPhILSFQKaRyc81mVJWl05tHai.jpg"
      },
      "tagline": "He didn't come looking for trouble, but trouble came looking for him.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Robert Rodriguez"],
      "runtime": 81,
      "synopsis": "In a small Mexican town, a ruthless criminal, nicknamed Azul, breaks out of jail and vows revenge on the local drug lord, Moco, who put him there in the first place, by using a guitar case which carries a small arsenal of guns. At the same time, a young mariachi arrives in the town looking for work, carrying his guitar case with his signature guitar. From the confines of his heavily guarded villa on the outskirts of town, Moco sends a large group of hitmen to kill Azul, but because both men are dressed in black and carrying guitar cases, the hitmen mistake the mariachi for the criminal. Only Moco knows what Azul looks like. The mariachi kills four of Moco's men in self-defense. As the mariachi seeks refuge in a bar owned by a woman, named Dominó, he falls in love with her. Unfortunately, her bar is financed by Moco. When Azul visits the bar for a beer and information about Moco, he accidentally leaves with the mariachi's guitar case. Moco's thugs capture Azul on the street but let him go when they learn that the case he is carrying contains only a guitar. A short time later, the mariachi is captured and taken to Moco, who identifies him as the wrong man and sets him free. Meanwhile, Azul, who has no directions to Moco's home, takes Dominó with him and orders her to take him to Moco's, or he will kill the mariachi. Dominó agrees in order to save the mariachi's life. When they arrive at Moco's gated compound, Azul pretends to take Dominó hostage in order to gain entry. Moco soon realizes that Dominó has fallen for the mariachi and, in a rage, shoots both her and Azul. Suddenly, the mariachi arrives to find the woman he loves gunned down. Moco then shoots the mariachi's left hand, rendering him useless as a guitar player. However, overcome with grief and rage, the mariachi picks up Azul's gun and kills Moco, taking revenge for Dominó's death. Moco's surviving henchmen, seeing their leader dead, walk off and leave Moco's body and the wounded mariachi behind. In the final scene, the mariachi leaves the town on Dominó's motorbike, taking her dog and her letter-opener to remember her by. His dreams to become a mariachi have been shattered, and his only protection for his future are the weapons of Azul, which he took along in the guitar case.",
      "writers": ["Robert Rodriguez"],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt0104815/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzc1MTYxMzYyN15BMl5BanBnXkFtZTcwOTMwOTM4OA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Carlos Gallardo, Consuelo Gómez, Jaime de Hoyos | See full cast and crew »"],
      "reviews": [
         "'El Mariachi' should still be regarded as an inspiration to wanna be movie makers around the world. For around US$7,000 Robert Rodriguez created one of the most enjoyable action movies to hit Hollywood since Peckinpah's 'The Getaway'. Once again Rodriguez proves the point that creativity and imagination beat million dollar budgets every time. An obvious concept to most people one would think, but going by the overblown CGI infested crapola at a theatre near you something that mainstream Hollywood STILL doesn't get! Carlos Gallardo played El Mariachi and co-produced with Rodriguez who did just about everything else - writer, director, cinematographer, editor, special effects,etc.etc. I first saw this movie not long after it hit video and I enjoyed it a lot. I recently watched it on DVD for the first time, ten years after I first saw it, and to me it really stands up. (Rodriguez' commentary is also highly recommended to any aspiring director) Personally my favourite Rodriguez movie is 'From Dusk Til Dawn', but 'El Mariachi' comes a close second. It's sequel cum remake 'Desperado' is a better known to most people but despite a budget 1000 times bigger(!) and some \"name\" actors involved I don't think it has half the energy and fun of the original, one of the greatest low budget movies of the last twenty years.",
         "It is so well-established now in other comments, I won't repeat that Robert Rodriguez made this debut film of his for a mere $7,000. Regardless how much he did or didn't spend, this is a very well-written and photographed story of a nice young man who only wants to be a Mariachi singer, but is inadvertently caught up in a manhunt and several gunfights. The movie is not intended to be taken seriously. The crook with the guitar case full of guns is supposed to be part of the joke of the movie. Many people get shot and killed, and of course that isn't funny in real life, but this film is not intended to reflect real life. It is just an entertaining film. Sort of a cartoon come to life. I saw this on DVD, which is real nice because the extra features contain a great insight into how Rodriguez shot and edited this movie. For example, all the filming was done \"silently\". Then, armed with a tape recorder and Radio Shack microphone, he had the actors re-do the scene while he recorded the dialog and other sounds. Music was done the same way. Then, when Rodriguez edited the movie, he matched the tape-recorded sound to the filmed action for the final cut. Watching the film you can notice some non-synchronization, and that's the reason why. It is certainly not distracting. He made the film with no crew, no fancy equipment, vrtally no lighting other than natural. Most of the actors were local Mexican businessmen, bartenders, or TV news men. Quite an achievement in movie-making, because it is a very entertaining movie on its own. I give it 9 of 10, partly because of the novelty of its origin. The other side of the DVD contains Rodriguez's followup movie, \"Desperado\", which is actually a sequel to \"El Mariachi.\" So, if you rent or buy this DVD, you are getting 2 movies for one price. Quite a deal!!",
         "Through the heart of independent cinema comes the bold and expressive first film by Robert Rodriguez. While he would go on later to give us some modern day classics, this is the film that jump-started his career. Set in a gritty town of Mexico, a drifter arrives ready to restart a new life and concentrate on his music. He soon learns that this will be a very difficult dream since the moment he steps foot in town he is mistaken for a murderous criminal named Azul. Azul is after his money that Moco (the head boss) has failed to pay him. Moco tries to have Azul killed, but finds it difficult when he carries with him a guitar case filled with guns. After several gun battles, explosions, and a love story with a woman that gives the guitar player his first real gig, our hero finds his life in the mercy of others. It is at this time our Mariachi is reborn. Rodriguez gives his best direction to date. Perhaps it was the lack of funds or the intensely gritty scenes, but this film helped me realize why cinema is so amazing. It is the perfect story of the small fish making his big mark on a big pond. Rodriguez takes every resource he can and rebuilds the classic concept of mistaken identity. With the fast-framed photography and interesting choice of camera angles, he takes a straightforward story and builds a legend. I enjoyed watching this film because although it was made for just a simple $7,000, the production doesn't look cheap. I have seen Hollywood blockbusters that have looked like they squandered their money more than Rodriguez did. I was just impressed with the quality of the film and the story that I suddenly felt myself totally immersed into the story. Oddly, it is the story that never falters throughout this picture. Normally, when you have a lower cost on budget, a segment of a film will suffer. Sometimes it is the character development, other times it is the story. Nothing is forgotten about in this film. There is plenty of violence (for all you action fans out there), some powerful drama (dealing with his dreams), and some comedy that will keep you grinning from ear to ear. By having this strong balance, our hero emerges with the utmost confidence, our villain seems diabolically evil, and therefore leading into moments of sheer joy, constantly wondering what will happen next. I was rooting for everyone in this film because I felt something for each. Only through the careful eye and artistic direction of Rodriguez could such a feat be accomplished. I have nothing negative to say about this film. From the moment the first turtle walked across the screen until the very end, I enjoyed every aspect of this picture. I suggest this movie to anyone that has ever thought about making a film, but was concerned about budget. I also suggest this film to anyone who loves a good story, amazing action, and characters that literally jump out of the screen like comic book heroes. Grade: ***** out of *****",
         "I just did myself a big favor and bought \"El Mariachi/Desperado\" double DVD and even though I've seen both of these timeless classics before especially this one keeps on amazing me. Obviously it's rather easy to make a good, solid action movie when you got the talent and huge quantities of money to spend on it but it's a lot harder to do it without the cash and only with your talent and creativity. That's why \"El Mariachi\" is in many ways still the best movie of Robert Rodriguez. The fact that someone can come up with something as gripping, cool, stylish and suspenseful as this with only a 7000 dollar budget is miraculous. \"El Mariachi\" is certainly one of the best action flicks I've ever seen, it's an incredible work of art from a 20+ year old lad. It doesn't have a single dull moment, every scene is a pure genius. Just look at the extremely vivid and highly clever way film has been photographed and edited to make it more exciting. One of the biggest low budget masterpieces of the movie history. Definitely 10 out of 10.",
         "I know the budget for this film was somewhere between 5000 and 7000 dollars, but I would like to comment more on the pacing and frenetic film style Rodriguez bestows upon us. Low budget or not,this film has energy. It never lets down for more than a few minutes and the editing is amazing. Robert Rodriguez has such a knowledge of film-making that he makes this movie look like a million bucks easy. The film isn't perfect, but on sheer energy alone it will entertain you more than most over-blown Hollywood action films.",
         "This movie put director Robert Rodriguez \"on the map.\" He followed up with two sequels: \"Desperado\" and \"Once Upon A Time In Mexico.\" Not surprising, the best of the three was this low-budget opening film. As Rodriquez had more and more money to spend on the sequels, the stories got more and more carried away with too many explosions and special-effects, losing the charm of this first effort. Unlike the sequels, this Mexican-made, so it is in Spanish with English subtitles. Don't let that scare you away. There isn't a great deal of dialog so keeping up with the subtitles is very easy. The movie has very interesting camera closeups and angles as Rodriquez showed he was going to be a stylish director. The story is simple but effective, suspenseful and even with some humor. Unnlike his subsequent films in this trilogy, the action is not overdone here. The length is also is a plus. At 80 minutes you can be thoroughly entertained in less than an hour-and-a half. The only disappointment to me was the print quality on th DVD, but I got an early edition. There might be better editions out since. It's not fuzzy but it's not sharp, either. Anyway: highly recommend for actions/crime buffs who like style in their photography, or saw the sequels and would like to know the history of this particular \"Mariachi.\"",
         "El Mariachi (1992) was a fine debut for film maker Robert Rodriguez. He makes the most of his minuscule budget and makes a very entertaining action film. The story behind the making of the film is even more interesting than the movie itself. You can tell from this movie that Robert Rodriguez had a bright future in the movie business. The story is about a musician who's trying to find work in a Mexican border town. None of the places he visits wants to hire a guitar player for their business. Meanwhile another man comes to town carrying a guitar case, he's no musician. He's a notorious hit man for a local gangster. When their paths cross, nothing but trouble lies ahead for the El Mariachi. Can the poor dude survive the week without being killed? Who is this guitar carrying killer? Why is he in town? What are the local crime boss' motives? To find out you'll have to watch EL MARIACHI!!! An interesting debut that showed lots of promise. The movie was followed by a pseudo-sequel/remake a few years later with a bigger budget and a cast filled with a lot of named actors. Highly recommended.",
         "Robert Rodriguez has his first little/big film here that is by no means big money wise. The book written by Rodriguez, Rebel Without a Crew, illustrates this point very well, but to see the film in its present form you might wonder if it really cost more than he says. But it's this same grit that adds to its rough charm, like a slightly more cartoonish, crazy and action-packed film in the vein of Night of the Living Dead (shoe-string done with a level of truth for what the genre material needs). The budget for this film was 7000. That is the cheapest price for a film given wide release I've still heard of, and probably is. And watching this film I noticed that a lot the big hundreds of millions of dollars spent on other films, while usually bankrolled with high-powered Hollywood casts and immense crews working on special effects, they lost an intensity that this film has even in its brief quiet scenes. Plus, as in the rest of the Mariachi films, it's often got a slick, quick sense of humor where Rodriguez's compositions say almost all there needs to be said. The story shows a singing musician (El Mariachi) who is not looking for trouble, but everyone is wanting to kill a man carrying a guitar case, which he has. It's a nifty little classic of exploitation/action that was meant for video markets but doesn't compromise. It's even got OK acting.",
         "Jaded, perhaps, by years of toiling in the Public Access field (and having sat through scores of first, foundering efforts by scores of foundering aspiring filmmakers), I was taken completely by surprise by the remarkable Robert Rodriguez's first film. As sure and as \"polished\" as any feature, EL MARIACHI belies its no-budget roots and stands as a testament to determination- and talent. If you're one of those whose attention span precludes sitting down and actually reading Rodriguez's book REBEL WITHOUT A CREW, I recommend obtaining a DVD featuring his \"ten-minute film school.\" And pay very close attention: There'll be a quiz afterward.",
         "I have always wanted to see this movie because I thought it would be a Spanish low-budget version of Desperado. But even though there are similarities, such as the guitar-case full of guns and the mariachi, those two movies don't have much in common. I don't care that this is Rodriguez first film and if it cost almost nothing to make. It is too cheap looking, too many weird scenes where nothing happens such as: the main-character walking into an empty room almost in slow motion looking at the furniture and figurines, the weird nightmares he has which are never explained, his love for a woman that he is never even romantically involved with and yet risks his life for. And the professional assassins that chase the mariachi are apparently no match for him as he easily kills most of them, including their leader, Moco. There is not much action and what little there is, is done really badly. The villain Moco is pathetic and so is the other villain Azul. A fat little Mexican who is as about as dangerous as a Guinea pig."
      ],
      "genres": [
         "Action",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Columbia Pictures Corporation",
         "Los Hooligans Productions"
      ],
      "summaries": [
         "El Mariachi just wants to play his guitar and carry on the family tradition. Unfortunately, the town he tries to find work in has another visitor...a killer who carries his guns in a guitar case. The drug lord and his henchmen mistake El Mariachi for the killer, Azul, and chase him around town trying to kill him and get his guitar case.",
         "El Mariachi just simply wants to play his guitar, no harm done, no questions asked. Unfortunately, he makes the mistake of attempting to find work in a local town, just when an assassin who keeps his guns in a guitar case hits town. El Mariachi is mistaken for the assassin. Not good.",
         "American crime lord Moco has set up a lucrative business in Mexico. He tries to rub out his imprisoned employee Azul. However, Azul overcomes the hit-men and escapes, determined to get his revenge. Meanwhile, a wandering mariachi comes to the same town looking for work. As Azul's trademark is his guitar case filled with weapons, the Mariachi is mistaken for him and finds himself a hunted man. Everyone looking for him likes to shoot first and ask questions later, so correcting the misunderstanding will not be easy.",
         "A traveling mariachi is mistaken for a murderous criminal and must hide from a gang bent on killing him."
      ],
      "budget": 7000
   },
   "movielensId": 3267,
   "movielens": {
      "languages": ["Español"],
      "releaseDate": "1992-09-04",
      "dvdReleaseDate": "2003-08-26",
      "directors": ["Robert Rodriguez"],
      "runtime": 81,
      "movieId": 3267,
      "title": "El Mariachi",
      "mpaa": "R",
      "actors": [
         "Carlos Gallardo",
         "Jaime de Hoyos",
         "Peter Marquardt",
         "Reinol Martinez",
         "Ramiro Gomez",
         "Consuelo Gómez",
         "Juan García"
      ],
      "imdbMovieId": "0104815",
      "originalTitle": "El Mariachi",
      "genres": [
         "Action",
         "Crime",
         "Thriller"
      ],
      "youtubeTrailerIds": ["75ra46x7FA4"],
      "plotSummary": "El Mariachi just wants to play his guitar and carry on the family tradition. Unfortunately, the town he tries to find work in has another visitor...a killer who carries his guns in a guitar case. The drug lord and his henchmen mistake El Mariachi for the killer, Azul, and chase him around town trying to kill him and get his guitar case.",
      "tmdbMovieId": 9367,
      "avgRating": 3.61861,
      "releaseYear": "1992",
      "numRatings": 5063,
      "posterPath": "/4S47gyKZI5aLiawwc45e4gnPlPx.jpg"
   }
}