{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "submachine gun",
            "id": 1375
         },
         {
            "name": "police",
            "id": 6149
         },
         {
            "name": "los angeles",
            "id": 12670
         },
         {
            "name": "criminal",
            "id": 15009
         }
      ],
      "imdb_id": "tt0105477",
      "video": false,
      "title": "Stop! Or My Mom Will Shoot",
      "recommendations": [
         2636,
         11890,
         9972,
         9874,
         9618,
         6280,
         9091,
         9604,
         9594,
         9691,
         11228,
         9405,
         9350,
         10861,
         2019,
         8860,
         1825,
         9349,
         11517,
         3513
      ],
      "backdrop_path": "/3H6R5JRn5x13UHFHTH8mrDFaAUY.jpg",
      "revenue": 70611210,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 15,
               "character": "Sgt. Joe Bomowski",
               "gender": 2,
               "credit_id": "52fe453dc3a36847f80c37e7",
               "name": "Sylvester Stallone",
               "profile_path": "/gnmwOa46C2TP35N7ARSzboTdx2u.jpg",
               "id": 16483,
               "order": 0
            },
            {
               "cast_id": 16,
               "character": "Tutti Bomowski",
               "gender": 1,
               "credit_id": "52fe453dc3a36847f80c37eb",
               "name": "Estelle Getty",
               "profile_path": "/w8tqnWzWa41FyQQb3PvPiVaPtep.jpg",
               "id": 59956,
               "order": 1
            },
            {
               "cast_id": 17,
               "character": "Lt. Gwen Harper",
               "gender": 1,
               "credit_id": "52fe453dc3a36847f80c37ef",
               "name": "JoBeth Williams",
               "profile_path": "/9kmPUDqZIZw7aYeKYm3gy1xr94s.jpg",
               "id": 10080,
               "order": 2
            },
            {
               "cast_id": 18,
               "character": "Parnell",
               "gender": 2,
               "credit_id": "52fe453dc3a36847f80c37f3",
               "name": "Roger Rees",
               "profile_path": "/gOUeYKeHwYeFULO5SXFN8BSUjaW.jpg",
               "id": 16407,
               "order": 3
            },
            {
               "cast_id": 19,
               "character": "Paulie",
               "gender": 2,
               "credit_id": "52fe453dc3a36847f80c37f7",
               "name": "Martin Ferrero",
               "profile_path": "/gTIclBDE9q6TFmOx7JIn32zTaVk.jpg",
               "id": 4790,
               "order": 4
            },
            {
               "cast_id": 20,
               "character": "Munroe",
               "gender": 2,
               "credit_id": "52fe453dc3a36847f80c37fb",
               "name": "Gailard Sartain",
               "profile_path": "/QFQlZdsM0QEUDWll19fgnxALYq.jpg",
               "id": 2886,
               "order": 5
            },
            {
               "cast_id": 21,
               "character": "Tony",
               "gender": 2,
               "credit_id": "52fe453dc3a36847f80c37ff",
               "name": "John Wesley",
               "profile_path": "/iMMsvD94NQ9Le3v3AfmFhhb5wsO.jpg",
               "id": 73586,
               "order": 6
            },
            {
               "cast_id": 22,
               "character": "Lou",
               "gender": 2,
               "credit_id": "52fe453dc3a36847f80c3803",
               "name": "Al Fann",
               "profile_path": null,
               "id": 33833,
               "order": 7
            },
            {
               "cast_id": 23,
               "character": "Mr. Stereo",
               "gender": 2,
               "credit_id": "597e3339c3a368539701efc6",
               "name": "Ving Rhames",
               "profile_path": "/8nS83GOu0iqxjL2Oj2DgwkAceFQ.jpg",
               "id": 10182,
               "order": 8
            },
            {
               "cast_id": 24,
               "character": "Mitchell",
               "gender": 2,
               "credit_id": "597e43389251415dba01da3f",
               "name": "Dennis Burkley",
               "profile_path": "/cCmRR9saqVLLmYqlBGTEcom8Lfq.jpg",
               "id": 83362,
               "order": 9
            },
            {
               "cast_id": 25,
               "character": "",
               "gender": 2,
               "credit_id": "5a16af70c3a368705200a0c1",
               "name": "Nicholas Sadler",
               "profile_path": "/97hL5ECPZONeQtVBYEgj4osqfgx.jpg",
               "id": 50402,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe453dc3a36847f80c3795",
               "name": "Roger Spottiswoode",
               "profile_path": "/hH8tIBh0RI7VwI4jQgphtB0qABR.jpg",
               "id": 1724,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe453dc3a36847f80c379b",
               "name": "Blake Snyder",
               "profile_path": null,
               "id": 59954,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe453dc3a36847f80c37a1",
               "name": "William Osborne",
               "profile_path": null,
               "id": 57341,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe453dc3a36847f80c37a7",
               "name": "William Davies",
               "profile_path": null,
               "id": 21075,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe453dc3a36847f80c37ad",
               "name": "Todd Black",
               "profile_path": null,
               "id": 51612,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe453dc3a36847f80c37b3",
               "name": "Joe Wizan",
               "profile_path": null,
               "id": 21024,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe453dc3a36847f80c37b9",
               "name": "Michael C. Gross",
               "profile_path": null,
               "id": 8860,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe453dc3a36847f80c37c5",
               "name": "Joe Medjuck",
               "profile_path": null,
               "id": 57601,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe453dc3a36847f80c37cb",
               "name": "Ivan Reitman",
               "profile_path": "/vYT8xpWCzKZc9F02Oqihxx1GFyg.jpg",
               "id": 8858,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe453dc3a36847f80c37d1",
               "name": "Alan Silvestri",
               "profile_path": "/chEsfnDEtRmv1bfOaNAoVEzhCc6.jpg",
               "id": 37,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe453dc3a36847f80c37d7",
               "name": "Frank Tidy",
               "profile_path": "/8IHxkjqkL4UOGUCrADCG0w3g0kj.jpg",
               "id": 59955,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe453dc3a36847f80c37dd",
               "name": "Mark Conte",
               "profile_path": null,
               "id": 53008,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe453dc3a36847f80c37e3",
               "name": "Lois Freeman-Fox",
               "profile_path": null,
               "id": 53009,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 7.121403,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9876,
      "vote_count": 272,
      "budget": 0,
      "overview": "A tough cop's (Sylvester Stallone) seemingly frail mother (Estelle Getty) comes to stay with him and progressively interferes in his life. She buys him an illegal MAC-10 machine pistol and starts poking around in his police cases. Eventually, the film draws to a denouement involving the title of the film and the revelation that even though she seems frail and weak she is capable of strong actions in some circumstances, i.e. when her son is threatened by thugs and she shoots herself in the shoulder.",
      "similar": [
         96,
         193893,
         984,
         306,
         1266,
         429733,
         4771,
         281,
         10651,
         2749,
         20676,
         949,
         1572,
         59967,
         562,
         395990,
         357096,
         90,
         75780,
         339692
      ],
      "original_title": "Stop! Or My Mom Will Shoot",
      "runtime": 87,
      "poster_path": "/sQXdlCaX6demEdOgI1FbV9fX8aO.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
         "name": "Universal Pictures",
         "id": 33,
         "origin_country": "US"
      }],
      "release_date": "1992-02-21",
      "vote_average": 4.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Roger Spottiswoode"],
      "runtime": 87,
      "synopsis": null,
      "writers": [
         "Blake Snyder",
         "William Osborne"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0105477/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAwNTY5MjE2M15BMl5BanBnXkFtZTcwNTEzOTQyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Sylvester Stallone, Estelle Getty, JoBeth Williams | See full cast and crew »"],
      "reviews": [
         "I had to give this movie a 6 out of 10. The story was corny, the plot was predictable. The supporting cast was lacking. This is not a thriller or an intelligent movie. It is a B comedy., at best. But the interaction between Stallone and Getty was fantastic. They play their roles to perfection as anyone from the Northern New Jersey area can attest. They were believable. They were hysterical. I would watch this again, just to watch Stallone and Getty play the mom and son role so true to life. They made us cringe. We really felt for Stallone as the son. They made us laugh non stop.",
         "I have little to say about this movie other than it is nowhere near as bad as I'd been led to believe. Actually quite amusing in places, it will strike a chord with anyone who has an interfering mother (and God knows I have!) as Estelle Getty invades Stallone's life. I fail to see the reason for all the bad spirit directed at this film. The incidental music is a little repetitive and it's admittedly a one-joke plot. But it is a fairly good joke, and would have made for a superb hour-length TV movie. Unfortunately it's a 90 minute cinema film and so doesn't maintain its momentum all the way through. I've seen people criticise the film for Stallone not getting to be \"funny\" in this movie. I mean, have you heard of a straight man?? Sylvester's contribution to the comedy is his underplayed reaction to his mother's obsessive behaviour. What do you expect him to do, dress up and tell jokes? Admittedly, the surprisingly violent aspects of the film don't sit well, and it's hard to laugh at Getty when she's just shot a man and splattered his blood all over an airplane runway. Another problem is that her chemistry with Stallone isn't as pin-sharp as it could be; the two leave notable pauses in between lines. Maybe a few more takes could have honed up the reaction time, but generally it's fine, and Stallone really makes an effort to make it work. Not an all-time classic, certainly, but a pleasant enough film to pass a Sunday afternoon. Just don't listen to the nay-sayers, watch it yourself and make up your own mind. 5/10.",
         "Very few people make bad films on purpose.Mr Stallone is nobody's fool. These statements should be self-evident.Therefore if SOMMWS is so bad why did a reputable director and a canny star have anything to do with it?The answer is that it isn't a bad film at all,when I saw it the cinema audience gave every appearance of huge enjoyment,many of Miss Getty's one - liners induced such laughter that Mr Stallone's rueful responses were often inaudible.I believe the trouble lies in the fact that many critics refuse to accept that Mr Stallone is in fact quite an accomplished light comedian as well as being an action star of proved bankability. As an LA detective having his mother over for a visit he is able to play against type in this fish out of water comedy.As mother,Miss Estelle Getty seizes a rare big screen opportunity and makes every line count.She is an innocent abroad in big bad LA,blithely going where wise men fear to tread. SOMMWS is not ground - breaking stuff,but it is old - fashioned funny. You could take your mother to see it - but don't ask her to stay over.",
         "Los Angeles police detective Joe Bomowski isn't as tough as he looks. He's actually quite vulnerable, if you look at his romantic relationship with Lt. Gwen Harper. And his mother is coming from Newark for a visit. This time, she didn't answer the phone, figuring it would be Joe telling her why she couldn't come. So when Joe arrives at the airport to pick her up, everyone is laughing at him. Even flight attendants. They've all seen the photos and heard the embarrassing stories. And on the way to his house, Joe has to help a man who is threatening to jump from a tall building. Don't worry--one of the classic moments in the history of comedy movies guarantees a happy outcome here. And Joe's mom witnesses a murder. This is after she has cleaned his apartment, pleaded with him not to do anything dangerous, and done everything else possible to make him feel like a second-grader. But she won't let anyone work on the case except her son--which also means she has to be his partner! How is this possible? She's so tough she won't let anyone scare her with threats of arrest for providing false information to the police. And Joe's mom can do it all! Watch her drive the car in a chase scene. And the movie's title is a line spoken by her son to a suspect. The amazing thing is that when he was 13, Joe was the strong one when his father died. So his mom knows what he is capable of. Her explanation of how he handled the situation gives the movie one of its several tender moments. I shouldn't have listened when people said this film was bad. I would have seen it so much sooner. Estelle Getty was great, and while Sylvester Stallone didn't seem quite suited to this type of role, he was good enough. I liked the character. But, yes, he can do comedy. Remember \"Oscar\"? I remember I liked him in that. I liked several other performances. Dennis Burkley as the big tough gun salesman (the one with the van), and Nicholas Sadler as the man on the ledge (I thought he was one of the Lawrence brothers!). And as always, Gailard Sartain as a big buffoon of a bad guy. And JoBeth Williams as Gwen. I can't forget her. This is my kind of movie, and while it's obviously not Oscar material, it's quite entertaining.",
         "This movie is fun to watch with the kids. Stallone CAN do comedy - we liked OSCAR, too. If you've never had an Italian \"mama\" you might miss some of the humor!",
         "I think Stop! Or My Mom Will Shoot is a very good movie. What the heck is so bad and wrong with it? It has a very good cast which includes Sylvester Stallone, Estelle Getty, JoBeth Williams, Roger Rees, Martin Ferrero, Gailard Sartain, J. Kenneth Campbell, Richard Schiff, and Ving Rhames! I thought it was weird that Martin Ferrero and Richard Schiff were in this film together because later on they would be in two Jurassic Park films only not together. Why is this film on the IMDb Bottom 100 List #64? The film is produced by Ivan Reitman and is directed by Roger Spottiswoode! The music is very good by excellent composer Alan Silvestri! I think this movie is so hilarious. Sylvester Stallone and Estelle Getty worked so good together. I think this film is really funny plus this film reminded Me a bit of the classic movie Kindergarten Cop! I strongly recommend this movie so do yourself a favor and ignore all of the bad comments and watch this extremely funny film today!",
         "90 minutes of pure entertainment. I mean .. i'm in the middle of it right now, and i just know this is about becoming on of my favorites. The dialogues and the cast are just outstanding. Sylvesters best so far.",
         "I think the movie is funny, despite Sly says it's the worst movie he has ever made! It's the first Stallone movie I've seen, so I am emotionally devoted to it! Estelle Getty is so cheerful, full of life and energy and Sly is sexy! If only it was 1992 and he was my man:) It's not fair that the film won Razzie for worst actor, screenplay and supporting actress! Well, maybe it didn't deserve Oscar, but it didn't deserve Razzie either! Besides, compared to movies of today Stop... is just genius! Turned me back in time when music and cinema were just another! Rest in peace, Estelle Getty! And Sylvester is one of the greatest actors of all time!",
         "Every living person on earth should see this movie. Not because its good and worth watching, but because it is so awful. The reason why everyone should watch this movie is so that you have a measuring stick for judging just how bad a movie is. For example, your buddy says \"Man that Jim Carey movie 'The Majestic,' was the worst movie ever made!\" And you can be like, \"No man, have you ever seen 'Stop or My Mom Will Shoot? I mean don't get me wrong 'The Majestic' sucked, but its no 'Stop or my Mom Will Shoot.'\" Then your friend will be like \"Oh yeah man, your right. I totally forgot about 'Stop or My Mom Will Shoot!' I guess I had blocked out that painful memory.\" Also you can be telling your friend like \"Hey, 'The Core' sucked.\" They can be like \"No surprise there. How bad did it suck?\" You can be like \"I'd say its about one 'Majestic' above 'Stop or my Mom Will Shoot!'\" Your friend, \"Man, thats pretty bad.\"",
         "Let me start by saying I own this movie. I didn't rent it on VHS or catch it late night on cable, I own the 2003 Universal DVD released on 1.85:1 Widescreen with 2.0 Stereo, so I can watch this anytime the mood strikes me, and also watch an 'exclusive behind-the-scenes featurette' if I didn't get enough of the story after 80 minutes. The mother-son slapstick formula is nothing new, but the character combination of Stallone attempting lighthearted comedy (or more accurately, attempting to play the 'befuttled straight-man'), and a painfully annoying performance of unprecedented levels by Estelle Getty make this movie particularly unenjoyable. Yet for all the flak this film rightly gets, personally I feel it's better than Rhinestone...I feel it's better because whereas Rhinestone had an awful cast and awful story, this film simply has awful casting and tolerably bad story. Furthermore, Stallone is not the biggest black mark on this movie, it is unquestionably Estelle Getty. Why? Because Stallone is not attempting full on comedy here like he did in Rhinestone, he is more playing a standard cop who is at a loss to deal with the stupidity of his mother. Estelle Getty's performance is like a one-dimensional character gag that would barely work as a 5 minute sketch comedy bit, and dragging it out for 80 minutes in a multi-million dollar project leaves me questioning big studio production judgment. The main story is sleepwalking action fare; some guns are stolen and being sold by a corrupt business man, but not without a couple red herrings to try and confuse the poor audience. Of course by chance, Tutti (the mom) witnesses a murder that could help lead to the very source of the stolen weapons, and she insists on tagging along on the following police investigation with the information she knows (moms know best, etc). There is also the obligatory romantic side-plot; Stallone has an in-office relationship on the rocks with his Lieutenant boss (played by JoBeth Williams), complicated by the arrival of his mother obviously. Basically these two plots had me alternating between irritation and boredom. Particularly atrocious scenes are when Tutti washes her sons handgun with the dishes and the following breakfast segment, the entire ending scene at the airbase when a gun wielding Tutti essentially 'saves the day', and in general whenever Tutti is on screen interacting with the tattooed Biker. One more thing, this PG-13 film isn't really a kids movie as some people think, as there is way too much sappy relationship humor. This police story is probably a borderline 4, but i'm a generous Stallone fan so 5 out of 10"
      ],
      "genres": [
         "Action",
         "Comedy"
      ],
      "productionCompanies": [
         "Northern Lights Entertainment",
         "Universal Pictures"
      ],
      "summaries": [
         "A tough detective's mother comes to visit him, and promptly starts trying to fix up his life, much to his embarrassment. For his birthday she buys him a machine gun out of the back of a van, and begins to further interfere with his job and love life, eventually helping him with a case he's on.",
         "A tough cop's seemingly frail mother comes to stay with him and progressively interferes in his life. She buys him an illegal MAC-10 machine pistol and starts poking around in his police case. Eventually the film draws to a denouement involving the title of the film and a revelation that even though she may seem frail and nosy but she is capable of strong actions in some circumstances, i.e. when her offspring is threatened. And now a cop teams up with his mother to catch the killer from a murder she witnessed.",
         "A tough detective's mother comes to visit him and begins to meddle in his life and career."
      ],
      "budget": 0
   },
   "movielensId": 3268,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1992-02-21",
      "dvdReleaseDate": "2004-01-20",
      "directors": ["Roger Spottiswoode"],
      "runtime": 87,
      "movieId": 3268,
      "title": "Stop! Or My Mom Will Shoot",
      "mpaa": "PG-13",
      "actors": [
         "Sylvester Stallone",
         "Estelle Getty",
         "JoBeth Williams",
         "Roger Rees",
         "Martin Ferrero",
         "Gailard Sartain",
         "John Wesley",
         "Al Fann",
         "Ving Rhames",
         "Dennis Burkley",
         "Nicholas Sadler"
      ],
      "imdbMovieId": "0105477",
      "originalTitle": "Stop! Or My Mom Will Shoot",
      "genres": [
         "Action",
         "Comedy"
      ],
      "youtubeTrailerIds": ["oMQ-RoCKa6o"],
      "plotSummary": "A tough cop's (Sylvester Stallone) seemingly frail mother (Estelle Getty) comes to stay with him and progressively interferes in his life. She buys him an illegal MAC-10 machine pistol and starts poking around in his police cases. Eventually, the film draws to a denouement involving the title of the film and the revelation that even though she seems frail and weak she is capable of strong actions in some circumstances, i.e. when her son is threatened by thugs and she shoots herself in the shoulder.",
      "tmdbMovieId": 9876,
      "avgRating": 1.80926,
      "releaseYear": "1992",
      "numRatings": 2063,
      "posterPath": "/sQXdlCaX6demEdOgI1FbV9fX8aO.jpg"
   }
}