{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "dream",
            "id": 1566
         },
         {
            "name": "worker",
            "id": 2346
         },
         {
            "name": "country life",
            "id": 2755
         },
         {
            "name": "farm worker",
            "id": 3009
         },
         {
            "name": "farm",
            "id": 4932
         },
         {
            "name": "error",
            "id": 4966
         },
         {
            "name": "great depression",
            "id": 5571
         }
      ],
      "imdb_id": "tt0105046",
      "video": false,
      "title": "Of Mice and Men",
      "recommendations": [
         12395,
         1365,
         18129,
         11386,
         5693,
         12498,
         10388,
         14621,
         16769,
         26748,
         13554,
         19382,
         10276,
         15745,
         8012,
         29973,
         8545,
         10323,
         10909,
         16297
      ],
      "backdrop_path": "/zjMhVh1Q0UtsnCqLjr0QQpu8Xve.jpg",
      "revenue": 5471088,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Lennie Small",
               "gender": 2,
               "credit_id": "52fe4510c3a36847f80ba5c5",
               "name": "John Malkovich",
               "profile_path": "/tCtiWZbKKRgHhLxFCIPfveYAsdc.jpg",
               "id": 6949,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "George Milton",
               "gender": 2,
               "credit_id": "52fe4510c3a36847f80ba5c9",
               "name": "Gary Sinise",
               "profile_path": "/n5AbjoNfONICaggp2f1QhYAjAoZ.jpg",
               "id": 33,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Candy",
               "gender": 2,
               "credit_id": "52fe4510c3a36847f80ba5cd",
               "name": "Ray Walston",
               "profile_path": "/5N6AVWIJCBD71uZtxSTTE8ZNfkB.jpg",
               "id": 4093,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Curley",
               "gender": 2,
               "credit_id": "52fe4510c3a36847f80ba5d1",
               "name": "Casey Siemaszko",
               "profile_path": "/kW2A2OrOMnlU7FoVDFbFmZJIUa8.jpg",
               "id": 1953,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Curley's Wife",
               "gender": 1,
               "credit_id": "52fe4510c3a36847f80ba5d5",
               "name": "Sherilyn Fenn",
               "profile_path": "/1AKZocU6gfD1udBPUxYH6Vez8Ll.jpg",
               "id": 6681,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Slim",
               "gender": 2,
               "credit_id": "52fe4510c3a36847f80ba5d9",
               "name": "John Terry",
               "profile_path": "/wESDSPXZXmXLp9vEfdtNKguwV3o.jpg",
               "id": 8659,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Carlson",
               "gender": 2,
               "credit_id": "5497fde9c3a3686ae90081c8",
               "name": "Richard Riehle",
               "profile_path": "/fFFjfOX7BUsfBQQP54K8QEkkEC2.jpg",
               "id": 18262,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Whitt",
               "gender": 1,
               "credit_id": "5497fe0ac3a36802a9000f8e",
               "name": "Alexis Arquette",
               "profile_path": "/jNRBwGKXOZFWLI2ceff1sMUdxcE.jpg",
               "id": 19578,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Crooks",
               "gender": 2,
               "credit_id": "5497fe289251417315002fa9",
               "name": "Joe Morton",
               "profile_path": "/5adJxjbFX2GeuTTCNqc9dg4Twgx.jpg",
               "id": 3977,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "The Boss",
               "gender": 2,
               "credit_id": "5497fe469251416e1e00752d",
               "name": "Noble Willingham",
               "profile_path": "/wJcquiMa4IVlJZBr7gvJXrbPsI0.jpg",
               "id": 31005,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Jack",
               "gender": 2,
               "credit_id": "5497fe649251417a8100595c",
               "name": "Joe D'Angerio",
               "profile_path": "/8zcExZhgtCfRG8xQpmkCa9TkuiN.jpg",
               "id": 120257,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Mike",
               "gender": 2,
               "credit_id": "5497fe8ac3a368054b00130b",
               "name": "Tuck Milligan",
               "profile_path": "/1R4G3cYSi4mMep89Y2HnaWkKcLM.jpg",
               "id": 130744,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4510c3a36847f80ba5df",
               "name": "Gary Sinise",
               "profile_path": "/n5AbjoNfONICaggp2f1QhYAjAoZ.jpg",
               "id": 33,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4510c3a36847f80ba5e5",
               "name": "John Steinbeck",
               "profile_path": "/mhzi6DAOsdFcqlED59NV0T2KHAG.jpg",
               "id": 2747,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe4510c3a36847f80ba5eb",
               "name": "Horton Foote",
               "profile_path": null,
               "id": 8483,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4510c3a36847f80ba5f1",
               "name": "Gary Sinise",
               "profile_path": "/n5AbjoNfONICaggp2f1QhYAjAoZ.jpg",
               "id": 33,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4510c3a36847f80ba5f7",
               "name": "Russell Smith",
               "profile_path": null,
               "id": 52897,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4510c3a36847f80ba5fd",
               "name": "Alan C. Blomquist",
               "profile_path": "/gfHo83GSUZv8XiMWvBGlKnzKdjO.jpg",
               "id": 414,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4510c3a36847f80ba603",
               "name": "Mark Isham",
               "profile_path": "/juP82LbS9chU3VXgelb7CICBN2Q.jpg",
               "id": 4140,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4510c3a36847f80ba609",
               "name": "Kenneth MacMillan",
               "profile_path": null,
               "id": 43624,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4511c3a36847f80ba60f",
               "name": "Robert L. Sinise",
               "profile_path": null,
               "id": 58177,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 8.710008,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9609,
      "vote_count": 191,
      "budget": 0,
      "overview": "Two drifters, one a gentle but slow giant, try to make money working the fields during the Depression so they can fulfill their dreams.",
      "similar": [
         1903,
         258230,
         81188,
         11360,
         638,
         596,
         301804,
         193687,
         10836,
         614,
         4593,
         2259,
         5172,
         300,
         9022,
         33016,
         3511,
         291865,
         28891,
         13501
      ],
      "original_title": "Of Mice and Men",
      "runtime": 110,
      "poster_path": "/jBRcO6XrNZdWpQOVzkVpN7eJO4Q.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1992-09-16",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "We have a dream. Someday, we'll have a little house and a couple of acres. A place to call home.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Gary Sinise"],
      "runtime": 115,
      "synopsis": null,
      "writers": [
         "John Steinbeck",
         "Horton Foote"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0105046/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg0ODE2MTg2OF5BMl5BanBnXkFtZTcwNTI5MDQ2NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: John Malkovich, Gary Sinise, Ray Walston | See full cast and crew »"],
      "reviews": [
         "How often are we forced to endure the uninsightful changes that are made to American classics in the process of turning them into feature films? The 1939 version of this movie is a prime example. It, very simply, was not the story that Steinbeck wrote. The changes that were made were too sweeping to be seen as anything other than some ego thinking that Steinbeck could be improved upon. Now, anyone who is truly familiar with Steinbeck knows that this is just not true. Gary Sinise has proven this familiarity. I have rarely had the pleasure of watching a movie that stayed so completely true to the original text. Not only does this movie not add or subtract from the book, the characters themselves are almost exactly how I had pictured them when I read this story for the first time. If you are looking for overblown sex and violence, for spectacular special effects, or for unbelievable demonstrations raw physical strength, move on. This movie will not interest you in the slightest. However, if you are looking for a story of true love and true courage, if you are looking for a movie whose beauty stems from a raw sense of humanity, then find yourself a quiet place, where you won't be interrupted and watch this. You won't be let down.",
         "I put off watching this movie for many years. I figured, what was the point? I had read the book \"Of Mice and Men\", watched earlier movie versions and seen it performed on stage. Why sit through yet another version? Finally one day at the video rental store I decided to take a chance and rent it. I am very, very glad I did. So why sit through another version? Because it is extremely well done. Gary Sinise and John Malkovich are powerful in the leads, Sherilyn Fenn has never been more appealing and Ray Walston will break your heart. This is just plain good storytelling and good movie making. I guess like Lennie never getting tired of hearing George talk about the rabbits, I'll never get tired of seeing a good version of this classic story.",
         "If ever a movie lived up to a standard of literature for the contemporary American art form, this is it. When you watch this you'll be stunned at how easy it should be to adapt a novel .. but it's seldom done right. You'll NEVER find a truer adaptation than this.. in fact you'll swear it's not \"adapted\" at all. Everyone else in this group has already given the accolades. I second them.",
         "It took me forever to get ahold of this movie. I had waited 2 weeks for it to be returned to the movie store. I waited four hours until the man brought it back to make sure I got it. Wow was it worth waiting for! I have not seen any movies lately that were so full of heart and love. Sinise and Malkovich BOTH play amazing roles in this film. I've seen it 5 times and everytime I cried at the dramatic ending. It shows how cruel and yet how loving people can be. This movie has a great mix of everything I think anyone could enjoy. I cannot believe I had never heard of this film before looking up info on Gary Sinise. This film should be a classic. The acting is superb and it holds your attention throughout the whole movie. I LOVE this movie incredibly!! Definitely a 10 out of 10!",
         "This is a masterful and faithful portrayal of Steinbeck's classic novel. The screenplay brings to life the tragic yet uplifting story of loyalty and the kind of bond that can grow between men that we are often reluctant to acknowledge, much less show. Aside from the story, the cast is what really makes this film. I have always held a soft spot for Gary Sinise after his role in Forrest Gump, wherein his character portrayed another facet of the bonding between men made brothers by cruel circumstance, yet can grow and flourish as the years and other circumstances come to pass. Here, as Lenny's friend and protector against a world that baffles and confuses him, he shows the kind of rough-edged tenderness and affection that both endears us to his plight, and fills us with the dread of what we know must come between the men. John Malkovich shows his depth as an actor by bringing to life the dull-witted but pure-hearted Lenny, in a way that will tug at your heartstrings. I found myself both laughing (in a sad way) at Lenny's ineptness in dealing with a world clearly more confusing than his limited wits can manage, and crying over his being targeted for taunting and abuse by cruel and crude men, and ultimately done in by his brute strength when it was lacking the direction and temper given by his friend George. A pleasant surprise was Ray Walston as the aged but gentle and good-hearted ranch hand Candy, who has no one in life to love but his old sheepdog, who, like him, he knows, must ultimately be \"put down\" because of age and the wear and tear that a life of hard labor has worn down. The scene of his finally surrendering his faithful canine companion to be euthanized by a gunshot to the back of the head by another well-meaning field hand is very heartbreaking. Having grown up with the \"Uncle Martin\" of \"My Favorite Martian\" Walston, seeing his adept performance in a dramatic role gave me a new appreciation for his versatility as a character actor. Those who watch this film should allow plenty of time alone to view it straight through with no interruptions. Swallow your pride and keep a box of tissues handy, and some time afterwards for quiet contemplation and \"recovery\".",
         "\"Of mice and men\" is one of these movies we definitely need in our times.Gary Sinise 's directing is classic in the noblest sense of the term.The cinematography recalls some of those Ford (who adapted \"Grapes of wrath\",another Steinbeck's novel for the screen) gems of the forties or fifties.It is heart-rending to see Malkovich and his portrayal of the half-wit is one of the finest you can see in a nineties movies and leaves,for instance Dustin Hoffman's \"rain man\" character far behind.It takes a lot of guts to play such demeaning parts !Gary Sinise should not be forgotten either,in a performance which offers all the subtleties of the heart. What moves me in the movie is the loneliness which frightens the characters .Everyone is searching for someone to rely on.Not only the two heroes (I think that ,actually, George needs more Lennie than the other way about)but also the old man -the scene with the old dog is almost unbearable;it will have an equivalent in a terrifying way at the end recalling Horace MacCoy's \"they shoot horses don't they?\"- Curley's wife;only the black guy has resigned himself to solitude.The scene when Candy and the two pals are talking of their future house -which we know from the very start they'll never have- is really heartwarming.At least,for one precious and fleeting moment,they could dream of a home,a fireplace and a hutch full of rabbits.",
         "I simply rented this movie to get a head start in my english class. I heard we are reading this book, so I rented the movie to have the edge over my classmates who know nothing of it yet. \"HA HA HA\" I thought now I will be smarter. However, going into the film thinking this was going to be a dull boring movie was not what happened. This is a great movie from beginning to powerful end and I would recommend it to anyone who is willing to give drama movies a chance. Gary Sinise directed John Stienbecks novel perfectly. The story is about two men, one not so bright, and their search for work in the depression. Simple but wonderful. 7.6 out of ten as an average seems too low for all the good comments about this movie. A Must See 9/10",
         "First off, the acting in this movie is incredible. It's funny how someone as intellectual and bright as Malkovich can pull his role off so well. Gary Sinese was great too, effectively portraying George. But if you really get into the book, the movie doesn't follow it too faithfully. Curely's wife is portrayed to be flirty, and a \"tart,\" when in the book, she was just as lonely as everyone else on the ranch. She wasn't looking for sex, she was looking for companionship. The screenwriter didn't interpret the book quite as well as I had hoped. Now I'm just nitpicking, but when when Lennie pulls the stunt by faking the puppy, it's just not like him. Lennie is not clever at all, and wouldn't think to do that. But all in all, great movie, definitely great for comparing to the book in a lit. class or anywhere. 8/10",
         "This movie has a good script, fine acting, and is beautifully photographed. Even though I had read the book and knew the plot, I was drawn into story and moved by the ending. Gary Sinise does a very good job of showing what a complicated and conflicted character George is. George seems to be a smart man, but he has not gotten far in life. He feels the need to watch out for his closest friend, Lenny. But, you sense that George sometimes thinks Lenny is a burden and George feels guilty about those thoughts. This might be Gary Sinise's best acting performance. I was disappointed in John Malkovich's over-the-top portrayal of Lenny. In the book, I felt that Lenny was just very simple minded, but in the movie version, Lenny seems to be seriously retarded. The Malkovich Lenny has too many odd facial expressions and a speaking style that is like a cartoon parody Lenny. That performance was distracting and irritating and made Lenny less sympathetic. It also changed the relationship with George. It makes George more of a nursemaid to seriously ill Lenny, instead of a helpful friend who watches out for Lenny.",
         "A gentle hand makes a powerful punch. And I'm not talking about Lenny, but Gary Sinise. I'm not quite sure why this one of the most powerful adaptations from a book. Perhaps the steps from book to play to screenplay gave it enough time to find it's pace and voice. I would have loved to have seen it on the stage with the same cast. Absolutely wonderful. I even have a new found respect for Ms. Finn. The two leads are exceptional, but I expected that, it was the easy grace of all the characters becoming alive that moved me. The book is a great book, but I always thought the other characters were just too shallow. Gary Sinise and the supporting cast breathe a life into these people. You've met them before. Been fishing with them. Fought with them. Just a Wonderful film. I hear a lot of talk about \"chick flicks\". Well, this very much may be a \"dick flick\" if they exist. Every real man should see this movie. Fantastic."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": [
         "Based on John Steinbeck's 1937 classic tale of two travelling companions, George and Lennie, who wander the country during the Depression, dreaming of a better life for themselves. Then, just as heaven is within their grasp, it is inevitably yanked away. The film follows Steinbeck's novel closely, exploring questions of strength, weakness, usefulness, reality and utopia, bringing Steinbeck's California vividly to life.",
         "The classic John Steinbeck tale of two friends - George and Lennie - who wander the country during the Depression. Lennie is mentally retarded and doesn't know his own strength causing frequent problems for his companion George. An incident with a young girl leads to a tragic end for this classic American tale.",
         "Two drifters, one a gentle but slow giant, try to make money working the fields during the Depression so they can fulfill their dreams."
      ],
      "budget": 0
   },
   "movielensId": 3271,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1992-09-16",
      "dvdReleaseDate": "2003-03-04",
      "directors": ["Gary Sinise"],
      "runtime": 110,
      "movieId": 3271,
      "title": "Of Mice and Men",
      "mpaa": "PG-13",
      "actors": [
         "John Malkovich",
         "Gary Sinise",
         "Ray Walston",
         "Casey Siemaszko",
         "Sherilyn Fenn",
         "John Terry",
         "Richard Riehle",
         "Alexis Arquette",
         "Joe Morton",
         "Noble Willingham",
         "Joe D'Angerio",
         "Tuck Milligan"
      ],
      "imdbMovieId": "0105046",
      "originalTitle": "Of Mice and Men",
      "genres": ["Drama"],
      "youtubeTrailerIds": [
         "3_8pU7mGd9g",
         "5itqq2QBUC8"
      ],
      "plotSummary": "Two drifters, one a gentle but slow giant, try to make money working the fields during the Depression so they can fulfill their dreams.",
      "tmdbMovieId": 9609,
      "avgRating": 3.68512,
      "releaseYear": "1992",
      "numRatings": 4073,
      "posterPath": "/jBRcO6XrNZdWpQOVzkVpN7eJO4Q.jpg"
   }
}