{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "stalker",
            "id": 6844
         },
         {
            "name": "remote control",
            "id": 8506
         },
         {
            "name": "puppy",
            "id": 8841
         },
         {
            "name": "lesbian relationship",
            "id": 9833
         },
         {
            "name": "basement",
            "id": 9866
         },
         {
            "name": "photograph",
            "id": 13094
         },
         {
            "name": "violence",
            "id": 14819
         },
         {
            "name": "surprise party",
            "id": 33979
         },
         {
            "name": "mental illness",
            "id": 41329
         },
         {
            "name": "business card",
            "id": 155955
         },
         {
            "name": "ice cream",
            "id": 156153
         },
         {
            "name": "stairway",
            "id": 165749
         },
         {
            "name": "software",
            "id": 176638
         }
      ],
      "imdb_id": "tt0105414",
      "video": false,
      "title": "Single White Female",
      "recommendations": [
         10859,
         1710,
         10498,
         9264,
         12518,
         11087,
         10998,
         11060,
         10868,
         11896,
         10424,
         12647,
         26255,
         2990,
         10699,
         10141,
         9941,
         11386,
         38718,
         8984
      ],
      "backdrop_path": "/oIrAtnRnQYA2elOZAOMXzimymGy.jpg",
      "revenue": 48017402,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Allison 'Allie' Jones",
               "gender": 1,
               "credit_id": "52fe4510c3a36847f80ba369",
               "name": "Bridget Fonda",
               "profile_path": "/yWxhdN59eksIqyBHdjUcLRgCIaI.jpg",
               "id": 2233,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Hedra 'Hedy' Carlson",
               "gender": 1,
               "credit_id": "52fe4510c3a36847f80ba36d",
               "name": "Jennifer Jason Leigh",
               "profile_path": "/3OlL9li7qmfXQYEtmpOm34V1huY.jpg",
               "id": 10431,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Sam Rawson",
               "gender": 2,
               "credit_id": "52fe4510c3a36847f80ba371",
               "name": "Steven Weber",
               "profile_path": "/ujINzDjLNtELBSUkRHQgExzP4Fb.jpg",
               "id": 6106,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Graham Knox",
               "gender": 2,
               "credit_id": "52fe4510c3a36847f80ba375",
               "name": "Peter Friedman",
               "profile_path": "/1plom5G0I425wj8l8xXhnvaFcPs.jpg",
               "id": 54246,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Mitch Myerson",
               "gender": 2,
               "credit_id": "52fe4510c3a36847f80ba379",
               "name": "Stephen Tobolowsky",
               "profile_path": "/fUodC7wMUZLAXnm4ONCxF5haCtC.jpg",
               "id": 537,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Elderly Neighbor",
               "gender": 0,
               "credit_id": "58d9b4f6c3a368126f06f1eb",
               "name": "Frances Bay",
               "profile_path": "/uaT5z1YQKZZ8WcYsnOnnI6DRWdW.jpg",
               "id": 11794,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Talkative Applicant",
               "gender": 1,
               "credit_id": "58d9b5119251411f8907922a",
               "name": "Jessica Lundy",
               "profile_path": "/fB5T3SG9Hmh2hh9uUHBjCJ2WNwx.jpg",
               "id": 83196,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Hedy's Date",
               "gender": 2,
               "credit_id": "58d9b532c3a368126f06f22b",
               "name": "Rob Steinberg",
               "profile_path": "/rAmTDlTibQQjF53THPHsleIAxDH.jpg",
               "id": 1002306,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4510c3a36847f80ba37f",
               "name": "Barbet Schroeder",
               "profile_path": "/jDMy62PR1pfD0dX5E0K3Q6SI1wm.jpg",
               "id": 23393,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4510c3a36847f80ba385",
               "name": "John Lutz",
               "profile_path": null,
               "id": 58153,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe4510c3a36847f80ba38b",
               "name": "Don Roos",
               "profile_path": "/xPnPpnylece1hzz2uUPbvbEHXZV.jpg",
               "id": 57579,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4510c3a36847f80ba391",
               "name": "Barbet Schroeder",
               "profile_path": "/jDMy62PR1pfD0dX5E0K3Q6SI1wm.jpg",
               "id": 23393,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4510c3a36847f80ba397",
               "name": "Howard Shore",
               "profile_path": "/4HbFF5o13GkO0rHi4OVXXMb7U5L.jpg",
               "id": 117,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4510c3a36847f80ba39d",
               "name": "Jack Baran",
               "profile_path": null,
               "id": 58154,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4510c3a36847f80ba3a3",
               "name": "Luciano Tovoli",
               "profile_path": null,
               "id": 49069,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4510c3a36847f80ba3a9",
               "name": "Lee Percy",
               "profile_path": null,
               "id": 2866,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "58a736999251417089000126",
               "name": "James Brown",
               "profile_path": null,
               "id": 1650545,
               "department": "Crew",
               "job": "Transportation Captain"
            }
         ]
      },
      "genres": [{
         "name": "Thriller",
         "id": 53
      }],
      "popularity": 6.839244,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9605,
      "vote_count": 175,
      "budget": 16000000,
      "overview": "Attractive Manhattanite Allison Jones has it all: a handsome beau, a rent-controlled apartment, and a promising career as a fashion designer. When boyfriend Sam proves unfaithful, Allison strikes out on her own but must use the classifieds to seek out a roommate in order to keep her spacious digs.",
      "similar": [
         2149,
         11826,
         979,
         339692,
         395834,
         22825,
         12662,
         10651,
         8012,
         353979,
         4771,
         17494,
         1433,
         1991,
         6075,
         1948,
         431,
         681,
         44214,
         59967
      ],
      "original_title": "Single White Female",
      "runtime": 107,
      "poster_path": "/3PH1tWrCAtAb7ws5BNYN9j0DnxN.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Português",
            "iso_639_1": "pt"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [{
         "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
         "name": "Columbia Pictures",
         "id": 5,
         "origin_country": "US"
      }],
      "release_date": "1992-08-14",
      "vote_average": 6.1,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Single White Female Collection",
         "id": 338282,
         "poster_path": "/fwufJlOGAI4JeuKeVmqmcUhYNW7.jpg"
      },
      "tagline": "Living with a roommate can be murder.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Barbet Schroeder"],
      "runtime": 107,
      "synopsis": "In the opening shot, two young twin girls, about 8-years old, are playing with their mother's make-up. Years later, an old apartment building in New-York on a quiet summer night. In her apartment, Allison \"Allie\" Jones (Bridget Fonda) is making love with her fiancé, Sam Rawson (Steven Weber), who has divorced his first wife. They are making plans for their wedding. Later in the night, the phone rings. It's Sam's former wife, Lisa. Because of a problem with the answering machine, Allison can hear everything Lisa is saying to Sam. And she learns that Sam visited Lisa in the afternoon and had sex with her. Sam hangs up the phone and starts a very heated argument with Allison. In the apartment above Allison's, Graham Knox (Peter Friedman), who is gay, and who is also Allison's best and only friend in the building, can hear the conversation between Allison and Sam through the old ventilation system of the building. A few minutes later, Allison rings Graham's doorbell. She has just kicked Sam out of her apartment and out of her life, and she is crying. She asks Graham to let her sleep in his spare bedroom. In the morning, Graham wakes Allison around 10 a.m., which means she is late for her appointment. This appointment is with Mitchell Myerson (Stephen Tobolowsky) in a restaurant. Allison expects to sell Mitchell her new computer program for designing woman's dresses. But Mitchell wants to buy it cheaper than what Allison expected. Back home, Allison has a long conversation with Graham in the building's laundry room. She informs him of her decision to find a room-mate. Allison puts an ad in a newspaper to find a room mate. The ad starts with: \"Single White Female seeks female to share apartment\", which explains the title of the film. Because the apartment is a rent-stabilized one, the room-mate would never be able to come on the lease. Several applicants answer the newspaper ad. A very butch girl, who wants to starts redecorating the place. A lesbian, who tries to seduce Allison. A neurotic girl who doesn't stop talking. The last one seems to be the perfect applicant. Allison is ready to call this perfect applicant back, when she sees Sam's picture on the fridge door, and she start crying. The front door was still open and another applicant comes in: she introduces herself as Hedra \"Hedy\" Carlson (Jennifer Jason Leigh). When she sees Allison crying, she wants to make some tea, but the kitchen water faucet breaks and both girls get showered. While Hedra's clothes are drying, Allison gets to know her better, and decides to take her as a roommate. Allison shows Hedra the basement of the building, including the private locked \"cages\" where each tenant can stow his stuff, and the incinerator room, which is not supposed to be used by the tenants. She also explained how to use the old elevator, the inner door of which frequently gets stuck and needs the use of a screwdriver hanging on a chain in the elevator cabin. Hedra gets herself settled in Allison's apartment, and the two girls seem to like each other more and more. Allison even helps Hedra to buy nicer clothes. She also gives her a lampshade to put on the lamp in her room, and Hedra gives Allison a pair of earrings that Allison seemed to like. During a conversation between the two girls, Hedra mention she had a twin sister who was stillborn. Allison refuses to take Sam on the phone when he calls her. Hedra keeps a mysterious shoebox, which she is very cautious to hide out of Allison's view. Sam calls while Allison is away, and Hedra erases his message from the answering machine. Hedra buys a Labrador puppy, and pretends that it was given to her on the market. Allison wants Hedra to bring the puppy back to the people who gave it to her. But, during the night, the puppy, who is alone in the kitchen, starts yapping and crying, and Allison takes it with her in her room. Hedra, hidden behind her room's door, watches the whole scene. Allison works a lot on her computer program, and doesn't see Graham as much as she used to. Graham asks her to take care of his cat while he is away for the week-end and gives her his apartment keys. When Allison gets back home, she finds that Sam forced his way in her apartment. Hedra feels bad about it and leaves Sam and Allison alone in the apartment. From the bookshop where she works, Hedra tries to call Allison, but Allison doesn't answer because she is making love with Sam. The same evening, Hedra watches TV alone in the apartment and kicks the puppy away. Meanwhile, Sam and Allison are having sex in the Atherton Hotel, where Sam is staying. When Allison comes back home, she finds Hedra in her room with the puppy. Hedra is very upset, but suddenly she notices the engagement ring on Allison's finger. She understands she will have to move away from the apartment. In Mitchell's office, Allison asks him to set up a demo of her computer program for people who could be interested by it. Sam is sleeping with Allison in her bed and Allison gets up to fetch some water from the bathroom. When she comes back, she finds Hedra talking and laughing with Sam. Later in the night, Allison is awaken by a strange noise and she peeks in Hedra's room where Hedra is masturbating on her bed. Allison is forced to run back to her bed and jump in when she makes a noise. Hedra knows she has been watched by Allison. The next morning, Sam is fixing a broken piece of the balustrade on the balcony, while Hedra is cooking some eggs. When Allison comes out of her room, all dressed up, she is not very happy to find Sam and Hedra having breakfast together. When Hedra asks Allison what she wants her to fix for dinner, Allison answers that Sam and herself will be eating out. After Sam and Allison's departure, the puppy remains behind the front door yapping, and doesn't respond to Hedra's calls and offers of food. Sam and Allison visit a vacant apartment in New York. When they come back home, they find that the puppy has fallen from the balcony and is dead. Apparently, Sam had not fixed the balustrade very well and the puppy was able to squeeze itself through the gap in the balustrade. Hedra gives Allison some pills to help her go to sleep after the puppy's death. Allison asks Sam not to cancel the business trip he had planned. In the morning, Allison is still asleep when the phone rings. It's Mitchell who is waiting for her for the demo they had planned. While choosing what she is going to wear, Allison discovers that Hedra has bought exactly the same clothes as her. After the demo, Mitchell and Allison are alone in Mitchell's office, and Mitchell tries to rape Allison who hits him very hard with both fists in his private parts. She runs away while Mitchell is lying of the floor very much in pain. Back in her apartment, Allison tells Hedra what happened with Mitchell, and Hedra gives Allison some pills. Then she calls Mitchell in his home, pretending she is Allison, and warns him not to try anything against Allison or his family \"will get fucked\". Hedra takes Allison to her hair stylist and, without Allison knowing, asks the stylist to give her exactly the same red color and the same hairdo as Allison. Allison is not very happy about it. Back home, while Hedra is in the bathroom, Allison searches Hedra's bedroom and finds the shoebox. Inside the shoebox, she finds documents proving that Hedra's real name is Ellen Besch, and that her twin sister didn't die at birth, but drowned when she was nine. She also finds a love letter that Sam had written to Allison and that Hedra has intercepted without telling Allison about it. That evening, Allison wants to talk with Graham about what she has found, but Graham is out. While she is going back to her apartment, she sees Hedra leaving the building in a taxi cab. She follows her in another taxi cab. Still followed by Allison, Hedra enters a very strange nightclub, where some rich people are watching a private sex show, where a man is kept in a cage, and where Hedra is called \"Allison\" by the bartender. Later that night, Allison comes back to Graham's apartment, and explains the whole situation to him. Graham advises her to get rid of Hedra. But Hedra, back in Allison's apartment, hears the whole conversation through the ventilation system. While Allison and Graham are talking, Hedra enters Graham's apartment (apparently using the key Graham gave Allison to take care of his cat) without anyone noticing her. Back home, Allison puts duct tape on the air vents, because Graham has explained her the acoustic problem of the ventilation system. So she cannot hear what is going on in Graham's apartment. When Graham finds Hedra in his apartment, he tries to persuade her to listen to him, but she brutally attacks him with the metal safety bar of the front door, and leaves him apparently dead on the floor. Allison is trying to reach Hedra's father on the phone, but only gets an answering machine. When she hears Hedra coming back in the apartment, she puts the phone down. Hedra doesn't say a word and go straight into the bathroom. Worried by Hedra staying such a long time under the shower, Allison enters the bathroom and discovers Hedra's blood-stained clothes soaking in the basin. Hedra pretends she had unexpected menstruation. Back in her bedroom, Hedra tells Allison she is \"so fucking weak\" to go back with Sam. Allison is so shocked that she doesn't answer the phone. Hedra does it and hears her father (who calls her Ellen) asking her to come back home. She slams the phone down and pretends it was an obscene call. When she wants to keep the phone out of its hook, Allison tells her she is expecting a very late call from Sam, coming back to New-York. Later in the night (past 2:00 a.m.), Hedra, who has taken the phone set with her in her room, answers Sam's call from the Atherton Hotel. Sam tells her to tell Allison he has called but not to wake her up. Hedra enters Sam's hotel room in the night, just wearing a raincoat over her naked body. She comes into Sam's bed, and performs oral sex on him while he is still half-asleep. When he eventually wakes up and realizes who is in his bed, it is too late. He is too close from his orgasm and comes into Hedra's mouth. Hedra and Sam then start an argument. When eventually Sam wants to call Allison to tell her the truth, Hedra kills him by thrusting one of the heels of her stiletto-heeled shoes deep into his eye. The tip of the heel must have reached into Sam's brain, because he immediately falls unconscious on the floor. When Hedra goes out of the hotel, the night clerk says \"Goodnight, Miss Jones\" to her. The next morning, Hedra is getting ready to leave, cleaning the whole apartment spotless. She then takes a suitcase, a cardboard box and a large paper bag down in the basement to put them in Allison's private \"cage\". Actually she is going in the basement to burn, in the incinerator, all the clothes that makes her look like Allison. While Hedra is away, Allison starts cooking breakfast. She stops when she hears the morning news on TV : a white male has been found murdered in room 612 in the Atherton Hotel. After she got confirmation that Sam has been murdered by calling the hotel, she goes in the bathroom to vomit in the toilet bowl. Meanwhile, in the basement, Hedra is taking a gun out of the boot where she had hidden it, and puts it in her large paper bag. In the bathroom, Allison sees the blood on one of the heels of Hedra's shoes, and understands what happened. When Hedra comes back from the basement, Allison tells her she wants to go and see Graham, even though she in only wearing a very thin sleeveless night shirt over her naked body. Hedra persuades her to get properly dressed before she goes out of the apartment. While Allison is getting dressed, Hedra comes into her bedroom, wearing black gloves, and tells Allison that she is aware that she knows about Sam's death. Hedra confesses having killed Sam, but pretends it was just an accident. When Allison tells her to go to the police, Hedra reminds her that no one, in the building, knows she lives there, and that she is not even on the lease, and also that she has cleaned off all her potential fingerprints. The police will certainly think it is Allison who killed Sam. Threatening Allison with her gun, Hedra forces her to go to Graham's apartment. There she ties Allison on an armchair with duct tape, and gags her with a piece of tape. Then, she dyes her hair from red to her natural black, not too look like Allison anymore. She then switches the TV on and puts the remote control near Allison's tied hand on the armrest of the armchair. She explains she has to go and cash a check. As soon as Hedra is gone, Allison moves the TV sound up to its highest level, and she selects a channel showing a very noisy rock music concert (hoping to attract help). In the bank, while Hedra is cashing her check under her real name of Ellen Besch, a clerk tells her that her father called, and wants her to call him back. She runs away from the bank. Meanwhile, one of Graham's neighbor has been complaining about the TV loud volume to the building manager, who comes with his spare keys to open Graham's door. Hedra comes out of the elevator just in time to stop him from entering the apartment. After she has got rid of the building manager, Hedra switches the TV off and slaps Allison in the face for nearly getting caught. She goes out of the room and comes back with a big kitchen knife, which she puts on Allison throat. She tears the tape gag off Allison's mouth to listen to what Allison wants to tell her. Actually Allison just kisses her on the mouth. Hedra seems not to understand the situation anymore and starts crying on Allison's lap. While stroking Hedra's hair, Allison sees Graham's wallet lying on the floor close to her foot, and kicks it away. That evening in Mitchell's office, all the important data on the program installed by Allison are starting to erase themselves. A warning message explains that, if Allison is not paid within 24 hours, all the data will be irretrievably lost. Back in Graham's apartment, where Allison is making a plane reservation from New York to Los Angeles with Graham's computer over the Internet. She tells Hedra they will pay with Graham's credit card, and send her to get Graham's wallet in the living-room. In Mitchell's office, since he cannot reach any one of the phone number Allison gave him, Mitchell decides to go himself to Allison's place. At Graham's apartment, while Hedra is looking for Graham's wallet, Allison is typing an SOS message on the computer. But Hedra comes back in the room before the message is sent. She switches the computer off and points her gun on Allison's frightened face. Instead of shooting her (aware that Graham's neighbors will hear the gunshot), Hedra instead knocks Allison out by striking her on her forehead with the butt of the pistol. Hedra takes the elevator down to the basement, while Mitchell is waiting for it in the lobby. In Allison's private \"cage\" in the basement, Hedra selects a very large suitcase, inside which she can fit herself and brings it back to the elevator. On the 11th floor, Mitchell enters the elevator where Hedra is traveling back from the basement and they ride together to the 12th floor, Graham's floor. When Mitchell sees Hedra opening Graham's door, he explains he wants to see Graham's friend, Allison. Hedra tells him Graham is away on a cruise, but Mitchell recognizes Allison's suitcase, hears Allison's moaning coming from inside the apartment, brutally pushes Hedra out of his way, rushes into the apartment, and slams the door behind him. Mitchell finds Allison lying on the floor, all tied up and gagged with duct tape. He kneels down and starts by taking the gag off, but Hedra enters the room, pointing her gun towards him. Mitchell slowly stands up, and suddenly snatches the gun off Hedra's hands, and throws her across the room, where she remains unconscious on the floor. Mitchell then starts to untie Allison, but Hedra comes back behind him and hits him on the head with a heavy statuette. She gets her gun back, puts a cushion on Mitchell's head to use as a supressor and kills him by shooting him in the face, twice. In the bathroom, Graham, lying in the bathtub, slowly comes back to life. Meanwhile, Hedra is dictating a suicide note to Allison, who writes it on the computer. Hedra presses Allison's hand on the computer screen for her fingerprints to be found by the police. Then she gives her a glass of water and a handful of blue pills. Allison smashes the glass in Hedra's face, and the two girl start fighting. Eventually, Allison smashes Hedra's hand through the window pane, and Hedra drops her gun. Then Allison slashes Hedra's chest with a piece of broken glass from the window, and rushes out of the room. While Allison is fumbling with the locks and the safety bar of the front door, Hedra comes back behind her, pointing her gun towards her. But Graham jumps on Hedra and throws her on the floor. They start fighting, but Hedra is still holding her gun and trying to shoot Graham. Allison pulls her by the legs out of the apartment and on the landing, and slams the door behind her. Allison runs towards the elevator, but Hedra shoots her in the shoulder. It must be a minor injury because Allison keeps on running and reaches the elevator. She closes the inner door of the cabin, but Hedra points her gun through the vertical bars of the telescopic inner door. Allison squeezes Hedra's hand between the vertical bars, and Hedra drops her gun. Allison picks it up, but she cannot shoot Hedra, because the gun is either empty or has jammed. Hedra enters the cabin, and while the cabin moves slowly down to the basement, the two girls start brutally fighting with them punching, slaping and kicking each other in the small compartment. Eventually Hedra succeeds in strangling Allison unconscious. Hedra pulls the unconscious Allison by the legs out of the elevator, and across the basement empty corridors. She blocks the emergency staircase door with a heavy metal cabinet, and switches the elevator machinery off. Then she goes into the incinerator room to reactivate the fire. When Hedra comes back, with a wheelbarrow, to the place where she had left the unconscious Allison, she discovers that Allison woke up and is gone. She starts looking around for her. She finds a big metal hook in a closet and takes it. Allison is actually hiding in a large metal box, near the ceiling. This box is part of the ventilation system. A rat, frightened by the noise Hedra is making, walks along a pipe towards Allison's hiding place. Just as the rat reaches her, Allison throws it down on Hedra's shoulder. Hedra looks up at the ventilation metal box, but it seems empty. Hedra goes back into the incinerator room, and looks into the ventilation metal box there, thinking that this is where Allison is hiding. But actually Allison is watching her, hidden behind a wall. Hedra keeps looking around. She thinks Allison is hiding in a large closet, but Allison falls upside down, her legs hooked in the pipework running near the ceiling, and stabs Hedra in the back with the screwdriver from the elevator cabin. She gets down on her feet, and stabs her again. Hedra dies on the floor, and Allison closes her eyelids. Some weeks later. Allison has moved into the apartment she had visited with Sam just before the puppy's death. In voice over, she explains that she is trying to forgive Hedra for Sam's death, and also try to do what Hedra couldn't do, forgive herself. She puts Hedra's collection of photographs back in the shoebox, but she doesn't see a picture hidden by some wrapping paper. Actually this picture is a mixture of two pictures, joined together. The left half-side of the picture shows Allison's face, when the right half-side shows Hedra's face.",
      "writers": [
         "John Lutz",
         "Don Roos"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0105414/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUzNTEzOTQxNl5BMl5BanBnXkFtZTcwODg2MzkxMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Bridget Fonda, Jennifer Jason Leigh, Steven Weber | See full cast and crew »"],
      "reviews": [
         "I saw this movie in theater in 1992 and remember it being very entertaining and somewhat racy. Fourteen years later the film holds up well to the test of time. A major difference is in the level of nudity between this film and the thrillers of today. Bridget Fonda and Jennifer Jason Leigh are hot! lets see them naked and often. Barbet schroeder understands this, and we see them both naked from the onset of the film. The story and acting develop well, the dialog is well written and the camera work is adequate. Jennifer Jason Leigh steals the show in this film, she does a superb job handling the transition in the character of Heddy with her body language and shyness into the transition of a sexually charged woman, who is assertive and obviously losing her grip on reality. She takes more risks and becomes bold and violent. Overall much better and more entertaining than any of the crap you will find being made today in Hollywood. Don't expect Shakespeare and just enjoy the ride.",
         "A fairly engaging psychological thriller. Of course, there must be some suspension of disbelief, as in Hedy(Jennifer Jason Leigh) wielding a shoe. Also, there really are no truly sympathetic characters here. Hedy, of course, is what she is. And, Allie(Bridget Fonda), the supposed heroine, does kind of screw over Hedy. And Sam (Steven Webber) is basically a snake anyway. As for the actors, I thought Miss Leigh was by far the best, though she had the meatiest part, so it may be hard to compare. And what an amazing apartment for a young software designer in Manhattan. OK, they mentioned it was rent-controlled. What an insane economic policy. Grade: B-",
         "I have never seen such trite in my life! The film, has no solid storyline and is amazingly awful. Bridget Fonda is gorgeous but i think this film totally undermined her, her acting performances were not projected as like a true actors would and god! It is just RUBBISH! The way the brunette woman killed Bridget Fonda's fiancée, by accidentally throwing the heel of a silver stiletto shoe in his eye, just cracked me up. This film cannot be of the thriller genre more of the comedy genre. The emotions that were meant to have been portrayed were not such as when Fonda found out her fiancée had died, what did she do? Just whimper! Show some emotion, please! The ending, oh my god! What an awful ending, the ending could have either been explained in a lot more detail or just shot differently, it would have made all the more difference, trust me. If they could just go back to the storyboards and elaborate on the shot angles, this film would be a little better.",
         "I first saw this in the cinema many years ago and enjoyed it enough to buy it when it came out on video. While I don't rate it as highly as when I first saw it I still think it is a good film, mainly due to the quality of the two lead actresses, especially Jennifer Jason Leigh who seems to be excellent in everything I've seen her in. Bridget Fonda plays Allison Jones who learns that her fiancé has cheated on her with his ex-wife. She ends the relationship but doesn't want to live alone so puts an advert in the newspaper for a flatmate. Out of the applicants she chooses Hedra 'Hedy' Carlson a mousy girl played by Jennifer Jason Leigh, at first she seems like the ideal choice but things start to go wrong when it appears that Allie and her fiancé are getting back together. Hedy is determined to keep them apart, at the same time she starts to dress like Allie and even changes her hair style and colour to match. Things soon spiral out of control leading to a violent confrontation between Allie and Hedy. There is also a sub-plot about Allie's work involving a client who sexually harasses her then fails to pay for her services. Even though I ticked the \"Contains Spoilers\" box I have tried to keep them to a minimum as a thriller won't be very thrilling if you know too much. As mentioned before, the acting is good and the plot is fairly plausible till the climax when it becomes a fairly standard confrontation between the two protagonists. There isn't too much violence and what there is isn't all that graphic, there is however a fair amount of sexual content and nudity which I suppose some viewers might feel uncomfortable with.",
         "Another movie with great potential. The film unfolds almost perfectly and you find yourself in a tense and deep psychological thriller (no spoilers to the plot). But then, the director chooses the easy way and we have a usual ending with mostly unrealistic situations and splatter sequences (ouch this dragging scene with the head bump at the elevator step must have hurt!).",
         "Nothing new in this thriller which finds disturbed, possessive 'Hedra' (Jennifer Jason Leigh) moving in with career girl 'Alison' (Bridget Fonda), who has recently separated from her boyfriend. Barbet Schroeder creates his own style in a film which (with two effective lead performances) manages to elicit tension, even if it is not full of surprises. The plot line is not unlike that of the recent \"Poison Ivy\", and the style is a little akin to \"Basic Instinct\". However, \"Single White Female\" is a definite improvement on both of these films, though it is not as good as some other thrillers of late. Unnerving, but never outstanding. Saturday, October 10, 1992 - Knox District Centre",
         "It's a psychotic thriller about loss, human fragility and the twisted games that could come out of a disturbed mind. It all begins when Allison Jones (played by Brigit Fonda) rents a room in her apartment, after breaking up with her boyfriend, to a girl called Hedra Carlson (Jennifer Jason Leigh), someone she didn't know. In the beginning everything was being OK but suddenly she starts finding out some strange things about her... and the troubles begin... This thriller has some good suspense scenes and a nice plot, but I was expecting a little more of it. I had already seen it some years ago, and at that time I did like it, as I did now, but it seemed to be a little better at that first time. Today I enjoyed it but found it nothing special, nothing too much above average; especially if we take count on its final disclosure. I think it could have been much better. I was thinking score it 7/10, mainly because of the plot, but after remember that standard and unsatisfying ending I can't score it more than a 6/10.",
         "Formulaic, formulaic\u0085 yeah it's routine Hollywood psycho-thriller territory, but too visually well made by director Barbet Schroeder and comfortably performed in the shape of Bridget Fonda and Jennifer Jason Leigh to not get something out of it. The story (adapted off John Lutz's novel \"SWF Seeks Same\") plays its cards quite early, and goes about the subject in a too convenient manner to make it entirely effective. Quite a slow build-up and many sub-plots stem off the central plot, as we watch Leigh's character's twitchy transformation suddenly grow and form the basis of the early groundwork that would eventually unsettle Fonda's fragile character. A resourceful Schroeder sure does a brilliant job with many artistic flourishes, and inspired gimmick set-pieces where you just can't help but admire Luciano Tovoli's lyrically smooth cinematography. However trying to register the suspense, became hard due to leading us down the same old path of cheap clichéd jolts and shinny techniques. Although the potent climax goes over-board, it's particularly heart-pounding and downright exciting. There's nothing overtly tame about it, with its seamless nudity and tantalizing sex, and a wicked death here and there. But it's all tastefully done. Howard Shore's sumptuously airy musical score feeds off the well used location and compact sets (especially that of the stark Victorian apartment building) that are very ideal to the film's progression. In the two leads, a gorgeous Fonda is terrific and Leigh's needly attachable turn is one of confidence. The chemistry works, and when it comes to it they sure do look like each other. Talk about eerie. There's also solid support by Steven Weber, Peter Friedman and Stephen Tobolowsky.",
         "After her partner moves out Allie Jones (Fonda) invites Hedra Carlson (Leigh) to move in, only Hedra has a few dark secrets and soon causes problems for her roommate. The 1990's was a big step towards engaging actresses into more notable lead roles. Kathy Bates in Misery, Susan Sarandon and Gena Davis in Thelma and Louise and Jodie Foster in Silence of the Lambs turned many memorable Oscar winners and nominees in some fantastic pictures and the playing field seemed to generate more female stars who are still remembered today. So a year after Ridley Scott's dramatic Thelma and Louise picture in 1991 could Fonda and Leigh generate the same level of press attention and accolade? The premise was definitely there. The claustrophobic feel of the plot with a stalker of a room mate and obsession reflects the nature of Kathy Bates' character in Misery and the whole love and cheating concepts could easily merit those reflected in Scott's picture but this never materialized. We are left with some, what can only be described as dull and boring soap styled concepts. The whole 'my partner has left me and now I'm depressed' is as flat as a pancake and Leigh's inclusion, whilst initially spicing things up became equally dull. What follows is a collection of mad antics by Leigh's awkward character and Fonda's struggling Allie. The pairing isn't too bad. There are some spicy moments that generate good drama and tension between the pair. The whole dog thing is a good reflection, as is the already mentioned stunning climax. The direction by Schroeder is frequently muddled. From high shots to low shots and the inclusion of the odd tracking shots there is never a settling momentum to carry the picture through its dramatic stages. The final half an hour is well handled as the script notches up a gear into flowing momentum with a good final ending. If you feel inclined to turn off after ten minutes then you can be forgiven as there is little to match your enthusiasm for this picture. But if you get up to the inclusion of the dog then you may as well carry on as the final stages generate some stunning tension. Single White Female is what you may call a wonderful promise that was horribly muddled. It's described as a dramatic thriller and the whole 'drama' part is evident throughout being soapier than a Dove product, but the thriller tag never is evident still the stunning climax that is great, but simply not justification of what we saw, and we are simply rolling our heads and imagining what could have been.",
         "If I didn't know this was written by a man I'd swear it was written by a woman because it's got the female interactional style down pat. Don't blame me for this observation. It's straight out of Deborah Tannen, your major feminist. We have a friendship between two women, one very plain (Jennifer Jason Lee) with an ugly name, Hedra, and the other glamorous (Bridget Fonda) and with a suitably post-modern name, Allyson (\"Ally\"). (The plain one is nurturing and definitely non-threatening to the glamorous one.) They eat ice cream cones together, like the same movies. They swap presents. When one is upset, the other offers to make tea. And not just tea. CHAMOMILE TEA. Can you imagine John Wayne delivering Fonda's line -- \"I'll make some tea. Chamomile. And then we can TALK.\" No, you can't imagine John Wayne ever uttering such a suggestion. Don't kid yourself. \"Talkin' words is fer wimmin.\" Then the relationship begins to get a little twisted. Lee begins to delete phone messages from Fonda's estranged boyfriend, Sam. They begin going through each others' closets, drawers, secret shoeboxes, and other forbidden information preserves. There are intrigues, sexual and otherwise. Lee adopts Fonda's style of grooming and actually looks like her, which displeases Fonda and fools Fonda's boyfriend Sam. Lee murders a puppy. Then she evidently kills Graham, the gay upstairs neighbor, gives Sam an intraorbital prefrontal lobotomy with a stiletto heel, and puts two or three holes through the face of Fonda's libidinous scuzzbag of a boss. Lee, a complete fruitcake by now, ties Fonda to a chair with duct tape from which Fonda tries desperately to escape, only to find, when successful, that she is pursued by a deranged Lee down to the basement of the huge apartment building. It is all supposed to have something to do with Lee's twin sister who died at nine, but that's psychobabble. I want to get back to Graham, the gay upstairs neighbor. He has a habit of listening to the conversations downstairs through the grating of a heater. (Cf., the same device in \"The Horse Soldiers.\") This prompted me to wonder what the hell kind heaters they have in this apartment building. But that's not what I wanted to get back to Graham for. I wanted to get back to him because of what happens to him about two-thirds of the way through. He's discovered something about Lee and when he confronts her in his apartment, she loses it, jabs him in the stomach with the iron prop bar from the door, then bashes his head in -- twice. The end of Graham, right? He is incommunicado and unable to help Fonda when things get bad for her because, after all, he's somewhat dead and must by now have assumed room temperature. Well, not exactly, because near the end we see that Lee has stashed his body under water in his own bathtub, his dead cat perched placidly on his chest. Graham has been feeling like this for hours. And yet, when Fonda is really IN EXTREMIS, and Lee is about to plug her with an automatic, Graham, ever the unflappable, ever the Mad Monk, springs to life, jumps out of the bathtub and temporarily disables Lee. And he's not even DRIPPING. The first two thirds of the movie are pretty well done. (I bought the DVD.) Nice photography and good performances from the two leads. The men are incompetent nincompoops as always, never there when you need them, and are easily forgotten. But the intricacy of the relationship between Fonda and Lee is nicely rendered. Lee has the splashier role and makes the most of it. She is thoroughly deglamorized to emphasize the contrast between her and Fonda, although to be sure Fonda can be made to look a little crummy too if the role calls for it. Barbet Schroeder, the director, certainly knows where the put the camera. Alas, he shrugs and throws away the story at the slasher climax. Just when someone is doing something a bit naughty, a figure appears in the background and looks over her shoulder. Fonda is hiding in an air vent from Lee, who is pursuing her with one of those lethal stevedore cargo-lifting hooks that can be found in every basement. Lee is creeping around, demented, eager to kill. Nevertheless, Fonda is so frightened of a mouse that she betrays her location. The film does have a good deal of redeeming social value though, in that it contains ample nudity and sex in various forms that should be familiar to any cultivated viewer. It's all quite impossible to take seriously but it is engaging."
      ],
      "genres": [
         "Drama",
         "Thriller"
      ],
      "productionCompanies": ["Columbia Pictures Corporation"],
      "summaries": [
         "When a 'Single White Female' places an ad in the press for a similar woman to rent a room (to replace the boyfriend she's just left), all the applicants seem weird. Then along comes a level headed woman who seems to be just right. The new lodger has a secret past which haunts her.",
         "Alison \"Allie\" Jones is a software designer in New York City. While her professional star is on the rise -- she has created a computer software package that will revolutionize the fashion world -- her personal life is a mess. Allie banishes her fiancé Sam Rawson from her rent-controlled apartment on Manhattan's Upper West Side, after discovering that he slept with his ex-wife. Allie finds platonic comfort in her neighbor Graham Knox, an aspiring actor with a sensitive shoulder to lean on. Realizing that the only way to hold on to her apartment is to find a roommate, Allie places an ad and interviews a succession of unsuitable candidates before settling on the shy Hedra \"Hedy\" Carlson, the ideal roomie in Allie's eyes. Hedy quickly fills the void left in Allie's life by Sam's departure. Allie is only too happy to allow Hedy to cook and clean for her. Their friendship deepens when Hedy brings home an adorable and -- unknown to Allie -- very expensive puppy. Allie later discovers the receipt and confronts Hedy, but Allie can't bring herself to part with the puppy. Unknown to Allie, Hedy erases Sam's phone messages when he calls to plead for a reconciliation. Before long, she's even begun dressing the same way Allie does. Allie passes off this strange behavior as that of an insecure but well-intentioned woman. When Allie reconciles with Sam about a month after Hedy moved into the apartment, Allie and Sam toy with the idea of Sam moving into the apartment with Allie. Hedy goes over the edge, knowing that this means that she would have to move out of the apartment. One afternoon, while Allie and Sam are out of the apartment, the puppy, which Allie has grown to love, plunges mysteriously to its death from a window. And before long, Hedy's closet contains the exact same clothes as Allie's, and Hedy has even had her hair cut and dyed to match Allie's look, resulting in a startling resemblance between Allie and Hedy, with height being virtually the only difference. More than a little unnerved, a suspicious Allie talks to Graham. Graham advises Allie to get Hedy to move out of the apartment. Allie begins to investigate Hedy's background. Allie goes into Hedra's room and looks through her possessions, and discovers that Hedy is not who she claims to be -- Hedy's real name is Ellen Besch. Years ago, when Ellen was 9-years-old, Ellen's twin sister Judy drowned at a family picnic. An absolutely devastated Ellen hasn't been the same since Judy's death. The bond between siblings can be strong, but it can be especially strong with twins. For years, Ellen's parents tried to explain to her that Judy's death was not her fault, but Ellen never forgave herself for living while Judy died. Ellen, who had undergone futile counseling, had been looking for a female companion so Ellen could have a friend to replace Judy. That's why Ellen tries to look exactly like whatever roommate she had at the moment...so it would be like Ellen still had a twin sister. Before moving in with Allie, Ellen had lived with a woman in Tampa. That didn't work out, so Ellen killed the woman and went to New York, later moving in with Allie. Now, as Ellen becomes progressively more dangerous, Allie must find a way to free herself from Ellen before Allie ends up like the woman in Tampa."
      ],
      "budget": 0
   },
   "movielensId": 3274,
   "movielens": {
      "languages": [
         "English",
         "Español"
      ],
      "releaseDate": "1992-08-14",
      "dvdReleaseDate": "1998-02-24",
      "directors": ["Barbet Schroeder"],
      "runtime": 107,
      "movieId": 3274,
      "title": "Single White Female",
      "mpaa": "R",
      "actors": [
         "Bridget Fonda",
         "Jennifer Jason Leigh",
         "Steven Weber",
         "Peter Friedman",
         "Stephen Tobolowsky",
         "Frances Bay",
         "Jessica Lundy",
         "Rob Steinberg"
      ],
      "imdbMovieId": "0105414",
      "originalTitle": "Single White Female",
      "genres": ["Thriller"],
      "youtubeTrailerIds": ["LclFf6HrDkI"],
      "plotSummary": "Attractive Manhattanite Allison Jones has it all: a handsome beau, a rent-controlled apartment, and a promising career as a fashion designer. When boyfriend Sam proves unfaithful, Allison strikes out on her own but must use the classifieds to seek out a roommate in order to keep her spacious digs.",
      "tmdbMovieId": 9605,
      "avgRating": 3.06729,
      "releaseYear": "1992",
      "numRatings": 3017,
      "posterPath": "/3PH1tWrCAtAb7ws5BNYN9j0DnxN.jpg"
   }
}