{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0185154",
      "video": false,
      "title": "Beloved/Friend",
      "recommendations": [
         64631,
         12806
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "",
               "gender": 2,
               "credit_id": "52fe47c29251416c91074cab",
               "name": "Josep Maria Pou",
               "profile_path": "/ePrrx8K3QVnkshvFE8RKacGlB1H.jpg",
               "id": 19909,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "",
               "gender": 0,
               "credit_id": "52fe47c29251416c91074caf",
               "name": "Rosa Maria Sardà",
               "profile_path": "/s2fMb2fRdAmxb9pYvmYERNhZKPp.jpg",
               "id": 962,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 0,
               "credit_id": "52fe47c29251416c91074cb3",
               "name": "Mario Gas",
               "profile_path": null,
               "id": 589542,
               "order": 2
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47c29251416c91074ca7",
               "name": "Ventura Pons",
               "profile_path": "/vbqAkW8C7nLONyz5gKDwVQQBtlU.jpg",
               "id": 43330,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe47c29251416c91074cb9",
               "name": "Josep Maria Benet i Jornet",
               "profile_path": null,
               "id": 1061980,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.248727,
      "production_countries": [],
      "id": 80471,
      "vote_count": 5,
      "budget": 0,
      "overview": "Based on a work of Josep Maria Benet i Jornet entitled \"Testament\", the film tells the story of an aging professor of medieval literature with the dilemma of deciding who will inherit his essay on \"The Book of friend and loved\" by Ramon Llull. Feeling near death as a result of illness, he discovers that the ideal person is a young and intelligent student he is in love with and who is dedicated to male prostitution.",
      "similar": [],
      "original_title": "Amic/Amat",
      "runtime": 90,
      "poster_path": "/kh2cw2ZsmGFf9gO2jSMP33Ql32X.jpg",
      "spoken_languages": [{
         "name": "Català",
         "iso_639_1": "ca"
      }],
      "production_companies": [],
      "release_date": "1999-01-29",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Spain",
      "color": "Color",
      "budgetCurrency": "ESP ",
      "directors": ["Ventura Pons"],
      "runtime": 87,
      "synopsis": null,
      "writers": [
         "Josep Maria Benet i Jornet",
         "Josep Maria Benet i Jornet"
      ],
      "originalLanguage": "Catalan",
      "imdbLink": "http://www.imdb.com/title/tt0185154/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM2NDgxNDU5NV5BMl5BanBnXkFtZTcwODU0MzMzMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Josep Maria Pou, Rosa Maria Sardà, Mario Gas | See full cast and crew »"],
      "reviews": [
         "Jaume, an older and ill medieval literature professor, has returned to Barcelona to die. He has been in love twice in his life: the first time, in his youth, with a fellow university friend Pere, now married with a daughter, and the second time with a student David, a rebel-without-a-cause type talent. Jaume wants to save David and turn him into some sort of spiritual heir. David has gotten Alba pregnant but has a rather special extra job . Alba doesn't know if she wants to carry the baby and talks it over with her mother Fanny. Fanny is afraid to get old with Pere as just being a wife. Five characters, in an almost race against the clock, argue, struggle and hurt each other. At the same time they discover that there's a fine line between wishes and making them possible with another person. BELOVED/FRIEND is a dense and dark film, that shows these 5 people in an almost sadistic, hard way. In a shattering final everything is resolved and at the same time nothing is accomplished. Or is it?",
         "AMIC AMAT (the original Catalan language, English subtitled version I just saw) is a touching portrait of friendship. It narrates different family, college, love and sex-for-money relationships all interwoven in a beautiful statement about friendship. With photogenic and vibrant Barcelona as its setting, AMIGO AMADO/Amic Amat takes great opportunity to showcase its location, and contemporary Catalan bourgeois culture, among other issues. But the one it is always addressing is the nature of true friendship and how it can triumph even in today's turbulent and complex society.",
         "Dealing with searching for meaning in the present with events in the past this incredible film features Award winning performances from Rosa Maria Sarda and Josep Maria Pou...it traces the stories of David and his self-destructive sexual urges which in a matter of hours destroys the perfect lives of the people that surround him.In this film everything has a price and even David who is a male hustler....must pay.",
         "I must admit that when homosexuality becomes part of the theme in a film I tend to get uncomfortable and prefer to watch something else. However this was not the case with this film from Catalunya: it held my interest from the beginning to the (predictable) end. Adapted from his own Catalan novel, Benet i Jornet has managed to maintain an almost theatre-like script and screenplay, except for the fact that there are many and frequent changes of scenario. The interweaving of the main characters is well accomplished, wonderful interpretations by both Josep María Pou and Mario Gas, as well as good work by David Selvas in the difficult rôle of a gay hustler, in all cases somewhat overshadowing the truly universal Rosa María Sardá. What she does is well done, but the architecture of the film does not allow her to portray what she is worth. Ventura Pons did not have to work too hard to make this film a success, given the performances of his actors. Definitely for adult audiences who are mature enough to understand the complications of delicate friendships with an aging and terminally sick homosexual as the centre point of conflicting aims, hopes, desires.. Try to see it in Catalan if you can: I had to see this one in the dubbed Spanish version on the national RTVE. I go along with the IMDb vote of 8 from 53 votes."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Els Films de la Rambla S.A.",
         "Televisión Española (TVE)",
         "Canal+ España"
      ],
      "summaries": [],
      "budget": 150000000
   },
   "movielensId": 3277,
   "movielens": {
      "languages": ["Català"],
      "releaseDate": "1999-01-29",
      "dvdReleaseDate": "2001-06-26",
      "directors": ["Ventura Pons"],
      "runtime": 90,
      "movieId": 3277,
      "title": "Beloved/Friend",
      "mpaa": "",
      "actors": [
         "Josep Maria Pou",
         "Rosa Maria Sardà",
         "Mario Gas"
      ],
      "imdbMovieId": "0185154",
      "originalTitle": "Amic/Amat",
      "genres": [
         "Drama",
         "Foreign"
      ],
      "youtubeTrailerIds": ["Zga61vcryLA"],
      "plotSummary": "Based on a work of Josep Maria Benet i Jornet entitled \"Testament\", the film tells the story of an aging professor of medieval literature with the dilemma of deciding who will inherit his essay on \"The Book of friend and loved\" by Ramon Llull. Feeling near death as a result of illness, he discovers that the ideal person is a young and intelligent student he is in love with and who is dedicated to male prostitution.",
      "tmdbMovieId": 80471,
      "avgRating": 2.875,
      "releaseYear": "1999",
      "numRatings": 12,
      "posterPath": "/kh2cw2ZsmGFf9gO2jSMP33Ql32X.jpg"
   }
}