{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "baby",
            "id": 1009
         },
         {
            "name": "social worker",
            "id": 2438
         }
      ],
      "imdb_id": "tt0069754",
      "video": false,
      "title": "The Baby",
      "recommendations": [
         78552,
         27495,
         124556,
         56702,
         85673,
         48885,
         77368,
         40158,
         42551,
         40973,
         17627,
         30996,
         79823,
         37358,
         32924,
         49332,
         33988,
         85236,
         88052,
         87894
      ],
      "backdrop_path": "/o7POUoIRDpDPobMDKB7EeXReqR1.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Ann Gentry",
               "gender": 1,
               "credit_id": "52fe457dc3a368484e05e5b5",
               "name": "Anjanette Comer",
               "profile_path": "/uZzyqM105TG7xvakbMwe2u8Nq4K.jpg",
               "id": 80253,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Mrs. Wadsworth",
               "gender": 1,
               "credit_id": "52fe457dc3a368484e05e5b9",
               "name": "Ruth Roman",
               "profile_path": "/lwfbybPwYRR3wy0jdnhS5jH5c4V.jpg",
               "id": 12498,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Germaine Wadsworth",
               "gender": 1,
               "credit_id": "52fe457dc3a368484e05e5bd",
               "name": "Marianna Hill",
               "profile_path": "/h3X58tFp2a7Tgt7gNW2sbM6N2EH.jpg",
               "id": 15659,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Alba Wadsworth",
               "gender": 0,
               "credit_id": "52fe457dc3a368484e05e5c1",
               "name": "Susanne Zenor",
               "profile_path": "/2ppMruL72FDz5Q0xIcGaFxwCDI6.jpg",
               "id": 99888,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Baby Wadsworth",
               "gender": 0,
               "credit_id": "52fe457dc3a368484e05e5c5",
               "name": "David Mooney",
               "profile_path": null,
               "id": 16978,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Judith",
               "gender": 1,
               "credit_id": "52fe457dc3a368484e05e5c9",
               "name": "Beatrice Manley",
               "profile_path": null,
               "id": 99889,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Doctor",
               "gender": 2,
               "credit_id": "52fe457dc3a368484e05e5cd",
               "name": "Tod Andrews",
               "profile_path": "/noIGXslu61uT0NR4Wf1k6gvklbL.jpg",
               "id": 99890,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Dennis",
               "gender": 2,
               "credit_id": "52fe457dc3a368484e05e5d1",
               "name": "Michael Pataki",
               "profile_path": "/bwkT9HQr1HkGBToA1Mz4ej2F6Ra.jpg",
               "id": 15993,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe457dc3a368484e05e59f",
               "name": "Ted Post",
               "profile_path": "/knADACiRl8Bn45BXNb0RDy3BfVf.jpg",
               "id": 18635,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe457dc3a368484e05e5a5",
               "name": "Abe Polsky",
               "profile_path": null,
               "id": 99886,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe457dc3a368484e05e5ab",
               "name": "Milton Polsky",
               "profile_path": null,
               "id": 99887,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe457dc3a368484e05e5b1",
               "name": "Abe Polsky",
               "profile_path": null,
               "id": 99886,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 3.677799,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 28156,
      "vote_count": 27,
      "budget": 0,
      "overview": "A social worker who recently lost her husband investigates the strange Wadsworth family. The Wadsworths might not seem too unusual to hear about them at first - consisting of the mother, two grown daughters and the diaper-clad, bottle-sucking baby. The problem is, the baby is twenty-one years old.",
      "similar": [
         10160,
         9381,
         9659,
         4141,
         206487,
         381283,
         929,
         37135,
         810,
         185,
         9732,
         2758,
         76494,
         110415,
         195589,
         95610,
         210479,
         169813,
         11249,
         332210
      ],
      "original_title": "The Baby",
      "runtime": 84,
      "poster_path": "/3J9fzHY2OVCYyV650opP8cnfEaS.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Quintet Productions",
         "id": 15292,
         "origin_country": ""
      }],
      "release_date": "1973-03-01",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "What goes on in this nursery isn't for kids!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ted Post"],
      "runtime": 84,
      "synopsis": "Ann Gentry (Anjanette Comer) is a social worker whose husband has been injured in a car crash. She takes on the case of the twisted, mysterious Wadsworth family, and takes a special interest in \"Baby\" (David Manzy), a mentally ill 21-year-old who still acts and is treated like an infant by his mother and sisters. The Wadsworth clan has abused and neglected Baby, but Mrs. Wadsworth (Ruth Roman) has been extremely protective since his father left shortly after his birth, and she isn't going to let another caregiver mess with her son. Ann tries to convince Mrs. Wadsworth that Baby can learn something, but he can't even pick up and return a ball. When his blonde sister Alba (Suzanne Zenor) hits him, frustrated by Baby's baby-like behavior, Mrs. Wadsworth defends him, beating Alba in turn. Physically, Baby is an attractive young man, and his other sister, Germaine (Marianna Hill), sleeps naked with him. Ann visits a school for \"extraordinary children\", sees several children play and interact together, compares it to Baby's isolation, and feels sad. The Wadsworth sisters throw a party for some friends. Baby runs around on the dance floor. None of the Wadsworth sisters' friends pay any attention to him. Mrs. Wadsworth talks about her runaway husband, and her relief that Baby will never suffer such disappointments. Ann gets dizzy after drinking a cup of punch. Alba and Germaine take her downstairs and tie her down. Baby has sex with Ann, but he doesn't seem to understand what happens. When Ann tries to release herself, he starts to cry. The sisters are making out with their loser boyfriends. Baby has to be bathed, and Ann dresses him up in a suit afterward. Ann takes photographs of Baby dressed as an adult, and shows them to his family. Eventually, Ann and her mother take Baby. His family comes after them, but Ann and her mother kill them. Finally, the film reveals why Ann is so interested in Baby. The car crash left Ann's husband with the mental capacity of an infant. Ann wanted Baby as a playmate for him.They play all day, and get along well.Two adult-size cradles appear in their decorated room. The film ends with Ann and her two \"babies\" swimming in their new pool, which was been built in the backyard over the site where the bodies of Baby's mother and sisters have been buried.",
      "writers": ["Abe Polsky"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0069754/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQyOTQzMjgwM15BMl5BanBnXkFtZTgwNTIxOTkzMTE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Anjanette Comer, Ruth Roman, Marianna Hill | See full cast and crew »"],
      "reviews": [
         "What arguments do you use to recommend \"The Baby\" to any fan of peculiar cult & horror cinema who's convinced that she/he has already seen everything before? Well, let's try this: \"The Baby\" is horrific without reverting to gory massacres or nauseating make-up effects, it's extremely disturbing even though the premise is far-fetched and totally implausible and \u0096 last but definitely not least \u0096 there's an unpredictable twist at the end that you simply have to see in order to believe it! This is one of the most original low-budget exploitation movies of the 70's, and it's truly remarkable how writer/director Ted Post managed to make such a fascinating film out of such a demented basic premise! \"The Baby\" starts out as the portrait of a dysfunctional family, but it gradually transforms into an atypical and thematic horror film with an uncanny atmosphere and frighteningly insane characters. Ann Gentry, a professional social worker in her mid-30's, takes an interest in the odd family situation of the Wadsworths. The mother lives alone with her two adult daughters and \u0085 Baby! Baby is a fully-grown 21-year-old male, but his mother and sisters treat him as an infant and claim that he's mentally unable to function as a mature human being. Ann is convinced that the crazy women deliberately prevent Baby from developing normally, presumably because they don't want him to grow like the careless and obnoxious men who abandoned them in the past. She quickly reverts to unorthodox methods in her attempts to rescue Baby and risks losing both her job and her life. Especially considering the cinematic era \"The Baby\" was made, and also the low-budget production values, the basic concept of the film easily could have resulted in a trashy and ultimately perverted B-movie. Imagine; a grown man in a diaper surrounded by overly protective and deranged women! In the hands of certain other directors, say, Doris Wishman or Russ Meyer, \"The Baby\" unquestionably would have been a non-stop series of sleazy images and shocking sex-rites, but Ted Post approaches the unusual subject matter very professionally and tasteful. There are only two controversially uncomfortable sequences, one involving a teenage babysitter and the other one being the fabulous climax. Ted Post maintains an ominous atmosphere, the Wadsworth women are downright creepy characters and the whole thing is just delightfully man-unfriendly! Fans of graphic bloodshed and gore may be a bit disappointed, but the horrific themes of the film are definitely unique enough to compensate. Literally ALL the acting performances are splendid, but David Mooney deserves extra praise for his credible and undoubtedly complex depiction of Baby. It may not be Citizen Kane, but I guarantee that The Baby will be one of the most unforgettable and curiously engaging films you'll ever see.",
         "They could never make a film like this today. If they did, it would have an all-star cast, a loud, obtrusive score, and dizzying, roller-coaster camera effects. Back in the 70s they had to get by on talent, imagination and audacity alone. Luckily, they had plenty of that back then. This is not a 'twisted\" film, at least anywhere nearly as twisted as say, \"Bad Boy Bubby\" or \"Sonny Boy\" (now those movies are reeeeally twisted!), but then what can one expect from Hollywood? This movie is like Diabolique made as a 1970s TV movie-of-the-week with a drive-in sleaze chaser. There's definitely a lack of credibility in this movie's plot - not that a woman couldn't keep her grown son in the mental state of a six-month infant. That's plausible and has happened before, but it's extremely unlikely that the authorities who knew about this kid all those years wouldn't have insisted on special schooling and therapy from day one. But who cares? Here we've got a film with two wicked Barbie Doll sisters who have venom in their veins and just looove to tease men. There's some great bad seventies fashion and a 'wild party' scene (well, wild for the suburbs. Ahh, Hollywood \u0096 so out of touch!). And what can you say about Ruth Roman? She's Joan Crawford, Bette Davis and Ernest Borgnine all rolled into one. They just don't make broads like that anymore! As mentioned by others, there are lots of twists and turns in the plot, but most anyone can figure them out very early on. But again, who cares? This movie works because of its audacity in the face of its conventionality and well, there is an intelligence at work somewhere in the midst of its drive-in movie formula. Take that whole scene with the babysitter for instance (for those who haven't seen this, you'll just have to see for yourself). I knew what was going to happen, but the way it built up so naturally seemed very honest and real. Which is why it freaked me out so much. Every now and then the film slips that comfort rug out from under you. Freak city! Then it relaxes safely in the realms of convention, but that's okay too because the whole movie has such charming camp appeal. Let's make that clear: this is a camp movie, NOT a horror movie! It's stupidly being marketed as horror, so it's understandable that the kiddies who are looking for lots of gore and boobies are feeling disappointed. Stick with Argento, kids! Oh yeah\u0085 huge kudos to David Mooney (Manzy \u0096 whatever) who played 'Baby'. He should have become a star.",
         "A movie sure to have you staring at the screen in shock, The Baby is guaranteed to turn out to be one of the stranger things you will ever see. Here's the deal: Ann is a social worker who stops by the house of a Mrs. Wadsworth, played by Ruth Roman (who was also in one of my favorite little movies, The Killing Kind, though I don't remember who she was there). Mrs. Wadsworth lives with her two daughters, Germaine and Alba, and her son, whom they all refer to as Baby. Baby is a 21-year-old man who has been in an infantile state apparently since birth. He can neither walk nor speak, or really concentrate on anything. His sisters are also, uh, quite something: Germaine, played with wonderful zest by Marianna Hill, is an extremely strange woman with this massive mane of hair, and tiny, evil eyes. If anyone ever had to cast a woman who is revealed to be a real, evil witch at the end, here's your woman. I actually want to see a lot more of her. She was awesome, and she can preen and glare like nobody's business. Which obviously wins her big points with me. So Ann the social worker shows up for a case visit, and makes it clear that she is \"quite intrigued\" by the case. The mother and sisters don't want to let her see Baby, but she insists, and we see him for the first time. He is a fairly cute 21-year-old (looked a little younger to me) guy. Ann the social worker continues to visit, and one is surprised how quickly she adjusts to the fact of this adult acting like a baby, and we start to feel a little freaky when she is almost immediately saying things like \"That's my baby! He's a good baby!\" It soon becomes apparent that Ann is a little more than just interested in this case, and is actually quite obsessed with Baby. This point is driven home by a scene with her supervisor asking her why she is spending so much time at the Wadsworth home and so little time with her other cases. There is a little discussion about some terrible accident that befell Ann's husband, implying that she's all lonely and sexually frustrated now, and one begins to wonder if her obsession with Baby had somewhat of a sexual edge to it. This is further reinforced when we see Germaine take off her clothes and climb in bed with her infantile brother! The sexual thing gets a further boost from a scene in which one of the babysitters is having a bit of trouble with Baby, and soon enough he is sucking her breast! The movie continues to pile on some disturbing suggestions about female sexuality as the woman is clearly aroused by this and lets it go on\u0097-until the mother comes home and beats the living crapout of her! I tell you, this one's a shock a minute! One of the big strengths of this movie is that you REALLY don't know direction it's going to take. There is tension from every direction. On the one hand you know that this is a horror movie and bad things are going to happen. You have this domineering mother and her creepy and violent daughters\u0097-are they going to start killing everyone who threatens to come between them and Baby? And Baby himself is a grown man\u0097-is he going to get angry and really hurt someone? And that Ann, too, does not seem to have all her screws in place, and seem really, REALLY obsessed with Baby\u0097-is she going to try to kidnap him, or what? It keeps you guessing, and that successfully delivers a lot of tension throughout its running time. I truly did not know what was going to happen\u0097and did not expect what DID happen. And how many movies can you say that for nowadays? In the middle of the film, things progress without really going anywhere, and we have somewhat repetitive scenes in which Ann visits and is obviously not welcome, she plays with Baby in a creepy way, and Mrs. Wadsworth gets ever more bitchy. Still, it's all so interesting that it never gets boring or feels like it's wasting your time. There are quite a few good bitchy lines, like when Ann threatens to turn Mrs. Wadsworth in, and she says \"You're a damn bitch!\" Also, consider this exchage between Ann and a guy who's coming on to her: \"Don't tell me you're a dermatologist?\" \"No, just a skin freak.\" This takes place during an awesome 70s party, footage of which, as surely you know, is always welcome. The other strength of this film is the complicated relationships of power and intricate series of compromises each character makes in order to stay close to baby or not get thrown in jail. Also, the score by Gerald Freed is, if not great, at least unusual. It contains a great deal of unusual instrumentation, including a lot of cello and acoustic guitar, and one long stalking scene seems to contain up to 10 minutes of pure music with no dialogue. There's no way I would even reveal part of the ending to you, but suffice to say that after the one hour mark there are twists and turns that will take you completely by surprise. As I said, it's unusual just for what the story itself is, and it's very unusual to really have no idea where the story is going to end up. If you like it weird, it's waiting right here for you. Hey, there are lot of other reviews of bad and cheesy movies on my website, Cinema de Merde, which you can find through the URL in my email address.",
         "Worthwhile,off beat, modern Gothic tale centering on a dysfunctional family that emasculates the only male in the family by keeping him a baby:even though he is fully grown. And lucky \"Baby\", all the women in the film want him for their own reasons. An unusual premise, with effective performances, efficient direction, and good use of location makes for an enjoyably twisted B movie. The movie drags a bit toward the end, and begins to seem a bit thin but, it remains compelling. A real find on budget DVD. Comer is well-cast in the lead and Roman's performance is classic. As Roman's daughters, cult figure Marianna Hill (Red Line 7000,Medium Cool, High Plains Drifter,Dead People) and Suzanne Zenor are convincingly creepy. And did I mention Beatrice Manley Blau as Comer's mother-in-law? Now, she's scary! Slick and sick little film that ends with a nice twist. Shelved by the studio;than given a limited theatrical release. A bit difficult to categorize but, definitely worth seeking out. The DVD, regrettably, has no extras but, the transfer looks good.",
         "Ruth Roman, once major Hollywood lead and survivor of the ANDREA DORIA disaster, pulls all the stops in the role of Mrs. Wadsworth, a hardened menopausal bitch who has characteristically stultified her adult son into perpetual infancy through cruel behavioral modification practices(with significant help from her two insane, but very foxy, daughters). A young social worker enters the scene, convinced that \"Baby\" is not the childlike imbecile his family insists that he is, and that there may be an unsettling explanation for his behavior. The Wadsworths, however, are not about to give up their precious \"baby\" without a fight. This one's a minor classic of its kind, and with far better performances and production values than anyone would ever expect of such niggling material. Drive-in hyperweirdness with an appropriately bizarre final curtain that must be seen to be believed. 6/10. Recommended.",
         "There were many 1970s horror films that gleefully deconstructed the family unit (IT'S ALIVE, THE Texas CHAINSAW MASSACRE, THE HILLS HAVE EYES and many others), but nothing quite like this! Compassionate social worker Ann Gentry (Anjanette Comer) is assigned the case of her career; paying frequent visits to \"Baby\" Wadsworth (David \"Manzy\"/ Mooney), a mentally regressed fully grown adult male who wears diapers, crawls around on the ground, cries in an infant voice, sleeps in a crib and sucks on baby bottles (and *cough* other things when he can get his hands on them). Baby lives at home with his domineering, husky-voiced, ball-busting, man-hating mother (Ruth Roman), whose idea of child discipline incorporates an electric cattle prod, and two pretty, but equally strange, grown sisters; Germaine (Marianna Hill) and Alba (Suzanne Zenor). All the kids have different fathers but none of them are anywhere to be found. Neither is Ann's husband; by all indications she lives the life of a widow at the mansion home of her her wealthy mother-in-law Judith (Beatrice Manley Blau, who was the co-founded of the Actor's Workshop in San Francisco). The whole family claim Baby is simply retarded and incapable of improving, but Ann thinks otherwise and the case becomes a personal crusade for her. After frequent visits to the home, she becomes convinced that Baby is actually a fully functioning adult who has been kept in mentally adolescent state by three women who have some serious mental problems of their own. Beginning as a strange, engrossing, well-made melodrama of one woman's consuming infatuation with her charge and getting through to the family, it turns into a full blown horror movie by the end with multiple kidnappings, bloody knife and hatchet murders and a character being buried alive. Sure it sometimes feels like a mixed bag of silly, tasteless, campy and downright sick ideas, but the performances are good enough to bail it out when it needs it and compensate for the shortcomings. Ruth Roman is especially terrific here. She possesses the same exact effortless campy qualities that made Bette Davis and Joan Crawford seem so at home in the horror genre during their twilight years. There's a memorable scene when she stumbles into the room to see the teen babysitter, uh, doing something she shouldn't be doing with \"baby,\" and she proceeds to beat the living s--t out of her while screeching \"You lying bitch!\" in her great deep voice. I'm used to seeing Marianna Hill as the lady-in-distress in such films as MESSIAH OF EVIL and BLOOD BEACH, but she's way better here playing it all wide-eyed, aloof and unhinged. Comer does well as the offbeat heroine and David Mooney is excellent in a role that could have come off as a complete joke in someone else's hands. Michael Pataki shows up briefly as Dennis, \"one of\" Alba's boyfriends during an amusingly gaudily-colored birthday party scene, and Virginia Vincent (the mom from THE HILLS HAVE EYES) is in the movie somewhere. I kept my eyes peeled for her, so she was either cut out completely or was simply an extra during the party scene. Even though it's well worth checking out, it does go way overboard during the hard-to-swallow finale and note to future filmmakers - Do not put a platinum blonde wig on the stunt double of a redhead. There are no special features on the Geneon DVD I rented, not even scene selection. When you pop it in, it plays. Simple as that. But the quality of the print is excellent.",
         "This is a bizarre piece of southern gothic. It's a movie full of bright primary colors and very over-the-top performances. I can't really figure out what it's really about but it's fascinating, morbid, perverse and has one of the most shocking twists at the end of it.",
         "The Baby joins a select club of really flaky little films from the poofy-hair-on-guys era, early 70's to early 80's; the best of these was Night Warning, William Shatner's wigged-out Impulse is another, the MST'd Touch of Satan is another. The Baby and Impulse even share the services of the wondrous Ruth Roman, who in The Baby looks more than ever like Victor Mature in full drag. All these feature somebody driving around in a Dodge Dart or a Maverick and plot twists that make you ask, \"What were these people ON?\" Ted Post was already in his late fifties when he did The Baby, so the lame direction can't be written off as a young director learning his craft. It just plain sucks. Anjanette Comer stands around screeching and flapping her hands for emphasis like she's at a community-theater audition; it's hard to see any of the luminescent Aimee Thanatogenos from The Loved One, just eight years before. And Baby is a hoot - this was pretty much the entire career of the hard-working young actor trying to make us believe he's a teenager operating at a 9-month-old level, but somebody decided to dub in the sounds of a real baby coming from his adult voice-box, and you don't buy the bit for five seconds. But there's just enough here to make it worthwhile to stick it out for the snapper ending. Anybody who says they guessed where this was going is lying like a red dog. It's no Night Warning, but if you've seen Night Warning and you need another sip from the same bucket, it'll do.",
         "I just love horror psychodramas from the early seventies, and this one's one of the best. The story concerns Ann Gentry(Anjanette Comer), a young social worker and recent widow who lives with her mother-in-law. Ann is given the case of the Wadsworth family: raspy-voiced Mrs. Wadsworth(Ruth Roman),her two weird adult daughters(Suzanne Zenor and Mariana Hill), and Baby, an adult man who is literally an infant mentally and developmentally. As Ann comes to know more about the Wadsworths, she decides to rescue Baby from his negligent and abusive family, and the initial battle between this upstanding young woman and these depraved women is underway! After several verbal sparrings with Mrs. Wadsworth, Ann accepts an invitation to Baby's birthday party, unaware that the crazy women have a plan to take her out of the picture! The deranged three give Ann drug-lace punch and attempt to tie her up in the basement, planning to dispose of her later. However, Ann escapes with Baby in tow. But Mama Wadsworth and her girls aren't giving up that easy, and decide to find Ann and take Baby back . . . The great thing about this film is that there are clues to the ending which, in retrospect, obviously hint at the outcome. What we have here is a battle of wits between two sets of psychos. Mrs. Wadsworth and her daughters are fruitcakes, to be sure, but the ending casts Ann's attempt to rescue Baby--and her reasons behind it--in a disturbing new light . .. A weird little film with a sick ending that distroys everything you assumed at the beginning. Reccommended.",
         "I first saw \"The Baby\" on a late night horror show called \"Grimsley\". It was on TV so of course they had to edit the very few graphic scenes, but it is still nonetheless disturbing. But as a 9 year old kid, watching a man-child in diapers didn't scare me a bit. Monsters scared me. So this movie was just goofy and at the same time interesting. Why would anyone be interested in such a warped conceit as \"The Baby\". It's just weird and intriguing. But it also has a sweetness to it. The outcome of course is a very eerie twist and touching outlook on love and compassion. Whether or not this film intentionally tried to freak you out or just paint a strangely humanistic picture, it succeeds on the freakish level. But its played with total seriousness. Serious and corny. Don't be surprised if you catch find yourself shaking your head repeatedly at this movie, you will also be surprised at how much it will mesmerize you."
      ],
      "genres": [
         "Horror",
         "Thriller"
      ],
      "productionCompanies": ["Quintet Productions"],
      "summaries": ["A social worker who recently lost her husband investigates the strange Wadsworth family. The Wadsworths might not seem too unusual to hear about them at first - consisting of the mother, two grown daughters and the diaper-clad, bottle-sucking baby. The problem is, the baby is twenty-one years old."],
      "budget": 0
   },
   "movielensId": 3280,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1973-03-01",
      "dvdReleaseDate": "2000-01-25",
      "directors": ["Ted Post"],
      "runtime": 84,
      "movieId": 3280,
      "title": "The Baby",
      "mpaa": "PG",
      "actors": [
         "Anjanette Comer",
         "Ruth Roman",
         "Marianna Hill",
         "Susanne Zenor",
         "David Mooney",
         "Beatrice Manley",
         "Tod Andrews",
         "Michael Pataki"
      ],
      "imdbMovieId": "0069754",
      "originalTitle": "The Baby",
      "genres": [
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "sAb3J7WONhE",
         "smpgNQKSRO0"
      ],
      "plotSummary": "A social worker who recently lost her husband investigates the strange Wadsworth family. The Wadsworths might not seem too unusual to hear about them at first - consisting of the mother, two grown daughters and the diaper-clad, bottle-sucking baby. The problem is, the baby is twenty-one years old.",
      "tmdbMovieId": 28156,
      "avgRating": 2.84722,
      "releaseYear": "1973",
      "numRatings": 36,
      "posterPath": "/3J9fzHY2OVCYyV650opP8cnfEaS.jpg"
   }
}