{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0144801",
      "video": false,
      "title": "The Brandon Teena Story",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4b2ac3a36847f81f5dff",
               "name": "Susan Muska",
               "profile_path": null,
               "id": 1038645,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b2ac3a36847f81f5e05",
               "name": "Gréta Olafsdóttir",
               "profile_path": null,
               "id": 1038646,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.142354,
      "production_countries": [],
      "id": 113096,
      "vote_count": 4,
      "budget": 0,
      "overview": "Documentary about Brandon Teena (aka Teena Brandon), a transgendered person, who was murdered along with two others in 1993 in rural Nebraska.",
      "similar": [
         258480,
         27586,
         244772,
         401898,
         3981,
         112160,
         858,
         141,
         634,
         437557,
         297762,
         242224,
         376867,
         394117,
         370663,
         10735,
         43923,
         540,
         152532,
         340485
      ],
      "original_title": "The Brandon Teena Story",
      "runtime": 89,
      "poster_path": "/wzXOq82bZ6JkH7XNOYkDQPM5mO7.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1998-09-23",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "All Brandon wanted was to be one of the guys; unfortunately he was a girl.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Susan Muska",
         "Gréta Olafsdóttir"
      ],
      "runtime": 89,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0144801/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI2NTAzMTQ5OV5BMl5BanBnXkFtZTcwNTgxNDkxMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Daphne, Reanna, Gina | See full cast and crew »"],
      "reviews": [
         "Although we do get to hear the voice of Brandon Teena because of her taped interview with the police, The Brandon Teena Story is essentially the plot of Boys Don't Cry without the central protagonist. Hilary Swank filled the void that Brandon's absence created with her Academy Award winning performance. What we have here is a documentary of the events leading up to his murder and what happened to his killers. When dealing with a transgender individual to properly tell the story we have to go back to the cradle to those very first questioning that something is not right with the body I'm in. So it was with Tina Brandon born in Nebraska and raised in a time where she would have had limited access to literature about being transgender. She also was raised in a redneck culture and her male role models were the redneck boys she grew up with. This was to her what it meant to be a man. Before he was murdered at the end of 1993, Tina Brandon reversed her name and started living as Brandon Teena in a nearby town where no one knew him from a previous identity as a woman. As a man Brandon did pretty good with the woman by the accounts in the film and that aroused suspicion that eventually led to tragedy. There were two crimes involving Brandon Teena. The first was a brutal rape when her physical privacy was violated on Christmas Eve and then her murder along with two other people to silence them as witnesses after Brandon Teena brought the complaint of rape on New Year's Eve. Two things I guarantee you will disturb you for all time to come. The first was the total lack of remorse by Brandon's killers, John Lotter and Tom Nissen. They still truly believe that in their heart of hearts they were somehow defending the barriers of male sexuality from unwanted invasion. Secondly it's the total lack of compassion and understanding of transgender issues by the sheriff's department when you hear the sheriff questioning Brandon about the rape. Both these things sad to say aren't a new story for me. I worked 23 years for NYS Crime Victims Board and even today the approach some police take regarding gay/lesbian/bisexual/transgender crime victims is appalling. It's far worse where I live now in Buffalo than in New York City where I'm originally from. That it's not a new a revelatory story for me is another frightening thing. To get the facts as Joe Friday used to say on Dragnet, I suggest you watch the Brandon Teena Story documentary. To flesh out who was Brandon Teena than don't miss Hilary Swank's performance in Boys Don't Cry. This review is dedicated to all the Transgender support groups out there in the world, especially to the Buffalo Belles and Spectrum in my area. They provide an incalculable service to those transgender folks at various stages of their journey. Due to the insurance regulations most will die in the bodies they feel wrongly trapped in. Hopefully that will change and the Brandon Teenas don't have to stay Tina Brandon if that's not who they were meant to be.",
         "_The Brandon Teena Story_ is a shocker. I, a travelled New Yorker, sat in the theater slack-jawed at how narrow minded and ignorant people of my own country (and therefore of my own \"culture,\" presumably) could be. The true story, which takes place in Nebraska, USA, is of a person, born a girl, who lives her life as a boy. People, even girlfriends, believe in her sexuality; however, she is eventually exposed, raped, and then murdered (along with 2 other people who happened to be with her that night). The documentary focuses on her friends and girlfriends, as well as her killers and the people who knew her in Nebraska. There is a general sense of disapproval and confusion, as well as love and acceptance from those who knew her well. Maybe it's my more globally-minded perception, but I simply cannot imagine committing a hate-crime towards a person who is different, a person I simply don't understand. I cannot fathom denying that person's right to live as a human being. I immediately judge those people in that part of the country as ignorant and bigoted. But I do this without giving them a chance, just like they didn't give Brandon one. Is it right to impose my values onto them, just as they did theirs to Brandon? It may not be \"right\" but I choose to do it anyhow, just as they chose to judge Brandon. Or ... is it the same? What the movie does is challenge the morals and values of the world outside the society in which Brandon lived. I believe that if I had seen the movie in Fall City Nebraska, I would not have heard the gasps in the audience throughout the film. I would have been appalled, but the rest of the audience would have identified with the people on the screen. Do I have to live with that \"ignorance\" in my own country? To them, I may seem like the \"ignorant\" one, the \"liberal without VALUES.\" I, of course, see it in the opposite light. But this will not soon be reconciled. The closest thing we can get to is understanding, and we reach understanding through exposure, through sources such as _The Brandon Teena Story_.",
         "Just a note of clarification. Brandon, did not lie about his gender. Brandon lived his short troubled life trying to express his gender the way he saw it and wanted others to see it. What he did however cover up was the truth of his biological sex. I tend to agree that full disclosure of these facts to his sexual partners would have been just. However, people are often not understanding of issues of gender nonconformity. Nor, have many people been equipped with the language, self-understanding, support, safe-space, and confidence to speak about these things without fear of being met with fear, ignorance and hatred. Our society has a strictly enforced binary gender system that is extraordinarily hard on those who do not conform. This is so entrenched in the sub-conscious of most everyone from such an early age that sometimes it seems that only those of us who do not fit in that system know that it is there and has been constructed by a society built on easy answers and small thinking that limits so many of us in numerous ways. It is so ingrained in people to believe that woman = feminine / man = masculine and all the stereotypes and behaviors that go with these two choices that they think these unwritten (and sometimes written) rules are natural. Therefore those who do not, nay, cannot play by these rules are unnatural, sick, sinful .. etc. So while I was disgusted by the behavior of the local authorities (including the civil court judge) I was not shocked. Serious deep changes need to be made to the way we as the human race see sex and gender or this type of appalling hatred will continue.",
         "This video holds nothing back, giving viewers actual footage of the town and neighborhoods where the victim and killers had once walked, drove and partied in. It also takes you up the country road to the talked about farmhouse where three people were murdered in the dead of winter night. There are actual crime scene photos of Teena Brandon and the inside of the broken-into farmhouse. I found those particularly disturbing, but I guess that is how to try capturing the essence of what it was like so viewers may learn from it. The video also includes interviews from friends and family of the killers and the victims. There are even interviews from inside the prisons from the killers themselves, trying to appear wrongly accused and failing miserably. The clueless sheriff is also seen praising their law enforcement, even after botching the rape and murder case in front of the world. This is not for children or the squeamish, and it really makes a strong impact.",
         "I just wanted to acknowledge the fact that if we are going to talk about how people are closed- minded and how society's views must be altered to include transgendered individuals as people of value and importance in our culture, then we must first begin with the little things: If Brandon felt that he identified as a male then we should give him the respect he deserves as someone who served as a lesson for us all. This means referring to him as male. If Brandon saw himself as male then we should refer to him accordingly. I suggest that whoever designed this IMDb movie profile should re-evaluate the way this profile is set up and change the cast description to Brandon Teena...himself (not herself). This is the first step to achieving what I'm sure Brandon would have wanted: to have transgendered people be accepted as how they see themselves- not how someone else sees them.",
         "Low-budget but fairly comprehensive documentary on tortured Nebraskan youth Teena Brandon, who in 1993 nearly fooled a group of rebellious, alienated kids she'd befriended into believing she was a young male named Brandon Teena. When her secret was exposed, two men, angry and freaked-out, raped and murdered her. Offers a more clear-eyed take on the murder scene (which included two other victims) than the Oscar-winning theatrical film \"Boys Don't Cry\". However, solely on an entertainment basis, \"Boys Don't Cry\" obviously packs more of an emotional punch. In either case, this is an exceptionally downbeat story which can be difficult to watch, and the folks who knew Teena Brandon seem spookily detached from the ramifications of the entire incident. ** from ****",
         "The documentary about Brandon Teena retells a horrific story about a murder of a peculiar young girl who believed she was born the wrong sex. Adopting the name Brandon, we learn that he went through life at his small town befriending many people and even finding partners in relationships successfully and happily. Recounting the details after the death of Brandon, there is some interesting on screen titles to give information about certain dates, court hearings and accounts from Brandon however this can only hold the audience for so long and doesn't really make up for the cheap, distractingly poor cinematography. In one scene there is a camera device where there is a dutch tilt from a travelling car looking at houses and the sky above that has no relevance to the narrative whatsoever. The talking heads also, become boring in their blandness and the content of each interview slowly gets tiresome in it's repetitiveness concerning how people perceived Brandon from friends and family. Saying this, the first act of the film is highly polluted with people's accounts of who Brandon was, how he treated those around him and an eventually pieced puzzle about how he befriended the two who eventually killed him after all the same old content and narrative that the audience are subject to for a lengthy period of time. However, the interviews do give Brandon substance and makes him a very likable person giving him much sympathy to his tragic end. We learn that he had stole just to buy gifts for his loved ones and how he brought happiness to people in a town full of not too appealing people in a prejudice America. Once we find out exactly what happened in the tragic last Christmas/New Year period in Brandon's life, there are disturbing accounts of what happened and what Brandon was subject to by his so called 'Friends'. The most disturbing piece of film shows still information and audio over the image from the actually interview Brandon was in with a Police Officer concerning his bullying. It is almost laughable how moronic and insensitive the Officer is in his investigation forcefully questioning his sexual abuse to detail and unbelievably asking for a repeat of the statement in very unprofessional terms. I was disappointed that the film was so long, it became hard to concentrate on in the final act. New people were introduced in what seemed random talking heads and the Directors/Writers Susan Muska and Greta Olafsdottir seemed to lose their way in the narrative by concentrating on the two men who murdered Brandon and their court case. It seemed like a whole different film and purpose in studying their prosecution and the pace suggested that possibly they could have (and in my opinion, should have) in fact made another documentary into their story and the possibility of looking at their motives and Southern Americas discriminatory motives today.",
         "OK. I spent the last fifteen minutes reading the comments written about this film. Out of the twenty some I've read thus far, only about four users seemingly understood the film's content and message. Brandon Teena was male. Yes, he was born in a female body, but he was transgender, therefore ONLY male pronouns should be used in reference to him. He/his/boy/man/etc. HE WAS NOT A GIRL. The fact that all of the users who have commented have presumably seen the film, and especially those of you who claim the ignorance of others, but then continue to use wrong pronouns for Brandon disgusts me. Do your research, and have some more respect.",
         "I live in the UK and last night (Friday 28th July 2006) I turned over my TV to find a film called 'Boys don't cry' on, an hour and a half later and I had cried 3 times and felt sick, disturbed and so overwhelmed by emotions that I couldn't separate one from the other. I felt as if I wished I had been there to shelter Brandon/Teena from her tortured end. I read some other comments posted and one suggested that the violence towards Brandon was not that of a hate crime because of her sexuality, to be frank, thats total bullshit!! Those two sick, deluded individuals who call themselves men (!) bullied a person who, OK didn't have the cleanest of backgrounds and had lied about her gender, but I don't think that he should have broad casted it to the entire town, he wanted to live he's life as a man, and be treated as a man. Admittedly he should not have deceived girls once they were a couple but does that really justify murder?? The one person who had a right to be annoyed was Lana but the sorry excuses of men that brutally raped him, both anally and vaginally deserve to be tortured and tested on instead of animals, Brandon had done nothing wrong that justified a murder and after seeking help from the police-people who he trusted, they chose to do nothing and let tom and john wander free to seek revenge. You do ask yourself why Brandon chose to stay around for as long as he did, or why he didn't flee back to Lincoln after the rape, or why he's mother didn't go to he's rescue?? I'm a mum and would walk over hot coal to get to my son. The police are responsible for Brandon's death, they allowed those sick bastrds to carry out a cold hearted murder to save themselves being convicted of rape. They were proud of what they did and should rot in hell. They abused and tortured another human being for not being able to understand, they are ignorant bastards who i hope never walk free again, They tool away someone's daughter, sister niece, friend and lover and they have to live with that every day for the rest of their lives. To Brandon's family, I wish to give my deepest sympathy, my thoughts are with you. The authorities, and us as a society need to ensure this will never happen to another human being again, the sad truth is, it probably already is.",
         "The Brandon Teena Story (1998) *** (out of 4) Good documentary taking a look at the female Teena Brandon who believed she was a man so she dressed that way, dated women who thought she was a man and eventually was brutally murdered with two other people. You're probably more familiar with the film BOYS DON'T CRY, which told this story but this documentary, while incredibly flawed, also offers a look at the real people involved in the crimes. I was pretty shocked to see how many of the real people attached to the story were willing to talk and this includes the two men who raped Teena and eventually murdered here. We also hear from everyone's relatives as well as several females who dated Teena, under the name of Brandon of course. As I said in my review for BOYS DON'T CRY, I don't agree with what Teena did. As a straight man I wouldn't want to be dating a female who was keeping it from me that she was an actual man. I understand the outrage that would be gleamed towards Teena but at the same time you can't condone what happened to her with the rapes and eventual murder. Watching this documentary just made me realize that those people we laugh at on Jerry Springer are really in this world and the \"white trash\" on display in this movie makes you understand why Teena could be raped and nothing be done about it until after she was dead. It's pretty shocking to hear some of the questions that was asked of her during the rape investigation and it's even more shocking to hear that many people probably felt it was okay what happened to her. THE BRANDON TEENA STORY has some major flaws including some really stupid attempts at emotions by using songs throughout the picture. Still, it's pretty fascinating getting to hear from all the actual people and this here is reason enough to see the film."
      ],
      "genres": [
         "Documentary",
         "Biography"
      ],
      "productionCompanies": ["Bless Bless Productions"],
      "summaries": [
         "Documentary about Brandon Teena (aka Teena Brandon), a transgendered person, who was murdered along with two others in 1993 in rural Nebraska. The story is told through interviews with people who knew Brandon, recorded interrogation and trial transcripts, and photographs and file film footage.",
         "Documentary about a multiple murder in rural Nebraska in 1993."
      ],
      "budget": 0
   },
   "movielensId": 3281,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-09-23",
      "dvdReleaseDate": "2000-01-25",
      "directors": [
         "Susan Muska",
         "Gréta Olafsdóttir"
      ],
      "runtime": 89,
      "movieId": 3281,
      "title": "The Brandon Teena Story",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "0144801",
      "originalTitle": "The Brandon Teena Story",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "Documentary about Brandon Teena (aka Teena Brandon), a transgendered person, who was murdered along with two others in 1993 in rural Nebraska.",
      "tmdbMovieId": 113096,
      "avgRating": 3.65247,
      "releaseYear": "1998",
      "numRatings": 364,
      "posterPath": "/wzXOq82bZ6JkH7XNOYkDQPM5mO7.jpg"
   }
}