{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0116102",
      "video": false,
      "title": "Different for Girls",
      "recommendations": [
         94725,
         47889,
         111605,
         12453,
         33766,
         33247,
         84278,
         47866,
         93946,
         16659
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Paul Prentice",
               "gender": 2,
               "credit_id": "52fe4a72c3a36847f81ce6e5",
               "name": "Rupert Graves",
               "profile_path": "/erhJMyO6Cuh95TmSTAfQHNfCAi9.jpg",
               "id": 11278,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Karl / Kim Foyle",
               "gender": 2,
               "credit_id": "52fe4a72c3a36847f81ce6e9",
               "name": "Steven Mackintosh",
               "profile_path": "/3TQVLNfMiiBAcoaCbmWckxXqagN.jpg",
               "id": 978,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Pamela",
               "gender": 1,
               "credit_id": "52fe4a72c3a36847f81ce6ed",
               "name": "Miriam Margolyes",
               "profile_path": "/7Fijg5sZ7gKbooq6tId3MUS5sDY.jpg",
               "id": 6199,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Alison",
               "gender": 1,
               "credit_id": "52fe4a72c3a36847f81ce6f1",
               "name": "Charlotte Coleman",
               "profile_path": "/tMJLpQaCeoqa4taaPpXpL8TS6b.jpg",
               "id": 10729,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Jean",
               "gender": 1,
               "credit_id": "54eb67e5c3a3685c37000097",
               "name": "Saskia Reeves",
               "profile_path": "/jeWnNkiHr2RlsoShaHtaxwuXpRv.jpg",
               "id": 13363,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Angela",
               "gender": 0,
               "credit_id": "54eb67fbc3a3685c62000097",
               "name": "Nisha Nayar",
               "profile_path": null,
               "id": 1229068,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Neil Payne",
               "gender": 2,
               "credit_id": "54eb680dc3a3685c4900007f",
               "name": "Neil Dudgeon",
               "profile_path": "/uf8IjOiWa8JMrS8pz0heSuDOdEG.jpg",
               "id": 87097,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Mike",
               "gender": 2,
               "credit_id": "54eb6819925141290a000076",
               "name": "Adrian Rawlins",
               "profile_path": "/bqUlzzI0PrnJxvVbnxV86ORkoEY.jpg",
               "id": 1643,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "CID Detective",
               "gender": 2,
               "credit_id": "54eb682bc3a3685c6200009c",
               "name": "Robert Pugh",
               "profile_path": "/vnqBCADoEnxQBD5e0GOCbUGrLeM.jpg",
               "id": 47643,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Policeman",
               "gender": 2,
               "credit_id": "54eb6837c3a36856b50000c4",
               "name": "Kevin Allen",
               "profile_path": "/be76iefw66VcgYUkWmHUCypM0PM.jpg",
               "id": 36083,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Police Sergeant",
               "gender": 2,
               "credit_id": "54eb6842c3a36836ed0072fd",
               "name": "Gerard Horan",
               "profile_path": "/fsF6Ruuf9DrTllqMaDx5aJpFiaX.jpg",
               "id": 56101,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Cabbie",
               "gender": 2,
               "credit_id": "54eb6896925141292b0000c8",
               "name": "Phil Davis",
               "profile_path": "/znnB0M3mdPiiXZHjl9zUEP9MTiu.jpg",
               "id": 26854,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Bailiff",
               "gender": 2,
               "credit_id": "54eb68a0c3a3685c5e0000a8",
               "name": "Ian Dury",
               "profile_path": "/au8MMm9IDpRw7IrBlxlVfpX8MYm.jpg",
               "id": 113908,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "DS Cole",
               "gender": 2,
               "credit_id": "54eb68c8c3a36836ed007313",
               "name": "Robert Pugh",
               "profile_path": "/vnqBCADoEnxQBD5e0GOCbUGrLeM.jpg",
               "id": 47643,
               "order": 14
            },
            {
               "cast_id": 18,
               "character": "PC Alan",
               "gender": 2,
               "credit_id": "54eb68d1c3a3685c5b00008a",
               "name": "Kevin Allen",
               "profile_path": "/be76iefw66VcgYUkWmHUCypM0PM.jpg",
               "id": 36083,
               "order": 15
            },
            {
               "cast_id": 19,
               "character": "PC Ken",
               "gender": 2,
               "credit_id": "54eb68ddc3a3685c4900009e",
               "name": "Rick Warden",
               "profile_path": "/aFeEZvGZ5zO6CpYemwL2w2L9iJm.jpg",
               "id": 83137,
               "order": 16
            },
            {
               "cast_id": 20,
               "character": "Prosecuting Solicitor",
               "gender": 2,
               "credit_id": "54eb68fd925141250a0000c6",
               "name": "Edward Tudor-Pole",
               "profile_path": null,
               "id": 79638,
               "order": 17
            },
            {
               "cast_id": 21,
               "character": "Defending Solicitor",
               "gender": 1,
               "credit_id": "54eb6911925141250a0000cf",
               "name": "Lia Williams",
               "profile_path": "/wcyJr3hBkh1FxbmyX4EDWTfgxYL.jpg",
               "id": 65890,
               "order": 18
            },
            {
               "cast_id": 22,
               "character": "Young Prentice",
               "gender": 2,
               "credit_id": "54eb6927925141290d00008e",
               "name": "Blake Ritson",
               "profile_path": "/7rz9BggnbghnAcqL0LtEUlElsSS.jpg",
               "id": 80154,
               "order": 19
            },
            {
               "cast_id": 23,
               "character": "Young Karl",
               "gender": 2,
               "credit_id": "54eb697dc3a36856920000f0",
               "name": "Stephen Walker",
               "profile_path": null,
               "id": 608580,
               "order": 20
            },
            {
               "cast_id": 24,
               "character": "Dispatch Manager",
               "gender": 2,
               "credit_id": "54eb6989925141292800009b",
               "name": "Graham Fellows",
               "profile_path": "/qD7YJ2jy1DmsBseXZLsgFK2NWRT.jpg",
               "id": 932958,
               "order": 21
            },
            {
               "cast_id": 25,
               "character": "Barry",
               "gender": 2,
               "credit_id": "54eb69a6925141292800009d",
               "name": "Peter-Hugo Daly",
               "profile_path": "/tUGdH72ziQCZh3Ke4ZdncJuQjGu.jpg",
               "id": 27641,
               "order": 22
            },
            {
               "cast_id": 26,
               "character": "Jim",
               "gender": 0,
               "credit_id": "54eb69aec3a36856b50000fc",
               "name": "Shend",
               "profile_path": null,
               "id": 67210,
               "order": 23
            },
            {
               "cast_id": 27,
               "character": "Nosy neighbour",
               "gender": 1,
               "credit_id": "54eb69be925141292d0000e9",
               "name": "Ruth Sheen",
               "profile_path": "/1A8sHqgO7vkzcaHAnGr0Ya4Dxte.jpg",
               "id": 53367,
               "order": 24
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "57b49bb39251410aa8000976",
            "name": "Richard Spence",
            "profile_path": null,
            "id": 179616,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.839536,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 106837,
      "vote_count": 6,
      "budget": 0,
      "overview": "Karl Foyle and Paul Prentice were best mates at school in the Seventies. But when they meet again in present-day London things are definitely not the same. Karl is now Kim, a transsexual, and she has no desire to stir up the past while she's busy forging a neat and orderly new life. Prentice, on the other hand, has charm but is a social disaster stuck in a dead-end job. His main talent is for getting them both into trouble. Amid the squabbles, they start to fall in love. One night, Kim invites Prentice to a romantic dinner at her flat. Prentice, finding the seduction unexpectedly effective, freaks out. He proceeds to make a public display of both of them and winds up in court. Humiliated and angry, Kim runs away. Only she can save Prentice now, but will true love triumph for a new made woman and an aging punk?",
      "similar": [],
      "original_title": "Different for Girls",
      "runtime": 97,
      "poster_path": "/fPbbhgKLq1CL6B9PMjzO99cRZJ3.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1996-10-01",
      "vote_average": 5.2,
      "belongs_to_collection": null,
      "tagline": "Expect the Unexpected",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Richard Spence"],
      "runtime": 97,
      "synopsis": null,
      "writers": ["Tony Marchant"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116102/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc2NDc0NzcwNV5BMl5BanBnXkFtZTcwMjEyNDQzMQ@@._V1_.jpg",
      "actors": ["Stars: Steven Mackintosh, Rupert Graves, Miriam Margolyes | See full cast and crew »"],
      "reviews": [
         "Simple (if that's the right word) British tale of a hot headed rebel who meets up with an old school chum who's now a transsexual. The script as filmed is almost (but not quite) as cloying as a Meg Ryan-Tom Hanks vehicle: it never really panders to the love story and it sacks trite 'witticisms' for honest language but it has just as faux-romantic of an ending as You've Got Mail or some other bit of schmaltz. However, the riveting performances by its leads help lift this film high above any mainstream pandering mush. Rupert Graves has a high-voltage sexuality and never slips in his characterization of Paul; it's so common for actors to give some kind of Kabuki-like performance when playing volatility but he's amazingly real. Steven Mackintosh is a revelation as Kim and his heartbreaking nuances capture an inner struggle between the mind and the heart with wonderful simplicity. Saskia Reeves (perfect in Antonia & Jane) and Neil Dudgeon also stand out as the married couple who Kim turns to for support. While far from being a great film, it trumps many, many, MANY other movies that try to be honest and believable in their depiction of gay or transsexual romance.",
         "I am a male to female transsexual, and all I can say is this is the first and ONLY film I have seen handle this subject matter with taste and tact. It sat on my shelf for two years before I watched it. I have seen this theme abused and twisted too many times, and I had assumed the worst. I'm very happy to say I got a very pleasant surprise. Steven Makintosh did a wonderful job of playing Kim, and the fact that Kim's body is not \"perfect\" is a touch of reality seldom shown when movies or television fictionalize transition. It was an honest approach, as opposed to the the usual \"and far less realistic\" sexy female actress that a Hollywood would have insisted on using. Kim does not live as a \"transgendered person\" as is implied in some reviews but as a normal white collar woman in London, her old school friend comes into her structured and very low profile life and turns it upside down from emotional outbursts in restaurants, to a confrontation with the police. His growing acceptance of Kim as a woman, and their growing relationship are wonderful to behold. I don't want to give anything away, but from yet another person who's \"been there\" the film went between having me on the edge of my seat to having me in tears. I cannot rate this film too highly. \"For people who NEED a nitpick, I think seeing Pauls girl friends reaction to goings on would have been good, she sort of just drops out of the plot and you never really know why\"",
         "This film hit me like a lightning bolt. It brought tears to my face and almost restored my faith in the human race. It tries to tell us that even the unthinkable can be done if we accept the combined power of feelings and imagination. We see people struggle with age old morals, their youth and upbringing. We can almost taste the bitter loneliness of the adapted transsexual as we can actually feel the pain of the struggling rebel that (almost) cannot accept the discrepancies between memory and perception, between love, lust and friendship, between what's done and not done. The actors make it all believable and enjoyable. They live the parts that show true bravery in crossing holy borders.",
         "I began to watch this film thinking that it would be about the usual prejudice and queer bashing....... What I realized is that it was a very touching drama about a post-op male to female transsexual and a former male schoolfriend. I thoroughly enjoyed this and have watched it 8 times in 3 days. It is so touching and tender and at the end, concentrates on the nice side of life. It makes me feel so humble. It has given me a lot to think about how I was maybe a little more judgemental than I thought I was. Brilliant acting. I have fallen for Rupert Graves, who plays the male schoolfriend,- I have visited his website and am going home to find the film, 'Damage', which I already have - and I have ordered 'Room With A View'. Rupert and Steven are such a brilliant actors. I can't believe that Steven Mackintosh, who played the very gentle and very ladylike, Kim, could be the same horrible guy who is 'The Street', thug and bullyboy from Prime Suspect 5. Both excellent main actors, as well as a well known supporting cast, which included Charlotte Coleman, (who has sadly since died, aged 33, from an asthma attack), Saskia Reeves, Miriam Margolyes and Neil Dudgeon. I have looked for the DVD on region 2 in this country, but I can only find it NTSC, Region 1. Can anyone help ? Enjoy, Best Wishes, Indigopussycat2. xx",
         "In the opening scene of Different for Girls, Karl's boarding-school classmates are tormenting him for his effeminate nature. To his rescue comes friend and protector, Paul. Roll the opening credits, and flash to the next scene, 16 years in the future. It's the scene of a minor traffic accident and two of the individuals involved appear familiar to one another, but something is amiss. Paul, now a punkish motorcycle courier is one, but the other is demure, stylish, female.... its Karl. Paul and Karl (now Kim thanks to sex-change surgery) finally recognize one another and begin a relationship that slowly evolves to romance. The movie essentially chronicles the emotional journey of this odd-couple; and it's done with the proper mix of humor and drama. Well worth the rental.",
         "Aside from any psycho-analytical considerations (in which I have no competence), this film really worked for me. I typically give a wide berth to pictures of this ilk, but I was really captivated by the sense that these characters were really living the circumstances in which they found themselves. I'm not going to blather on about how relevant blah blah, but the fact is that Nobody is immune from the possibility that an experience like this might present itself in real life, and it is thought-provoking to reflect on how it might affect ME. This is a complex subject, uncomfortable to many, but explored here in a way that was good sociology, good psychology, and damned fine cinema. Whatever your hang-ups are (or aren't), enjoy this film.",
         "Missed this first time round, but unintentionally caught a late night/early hours TV airing in the UK. Steve Mackintosh sustains a serious dramatic presence and role as Kim against the heavily scripted comedic/stereotype 'unreformed male' buffoonery of the friend/partner Paul Prentice played by Rupert Graves. Although at times the dynamic of the two styles gives an uneven feel to the whole narrative, the underlying point of apparent complete contrasts, but underlying and overlapping commonality of involvement and feeling is well made. Some of the scenes are intensely moving, particularly those in the police station when Kim is facing arrest and conviction and is placed alone in a cell, uncertain of whether she will face the immediate unwelcome company of another unknown male cellmate, and/or eventual consignment to a male prison. This is hardly comedy, certainly real life drama, and contains the essence of real tragedy. Other scenes in the film evoke similar high tensions in emotional colour and reading. Overall delivery was a little uneven, but well worth viewing again. Would be worth a full 'in-line drama' remake of the theme, as other commentators have also hinted. A good attempt at a very difficult subject which manages to hit the right emotional responses without actually falling off the tightrope between banality and exploitation.",
         "Alright...maybe this is too psychoanalytical an approach for the film, but here goes. Completely intrigued by the development of the principal characters and their evolving relationship, I took in 2 screenings of this film, as this movie is like an onion -which to get to the core of its subject and to understand its mystery, you have to peel off the multiple layers. A shower scene, a school picture, and a tabloid article are crucial clues that mold the dependency and sexual confusion that bonds the Prentice and Karl/Kim characters together. Their relationship has endured since highschool. We see a young man, who has subtly hidden his sex is embracing his feminine side in the schoolshower. Just before he gets the sh-- kicked out of him by homophobic schoolmates, another boy gallantly rescues the pretty boy from the mob. The audience immediately assumes that it is Karl who was questioning his sex in the shower--but disclosed in later pics, we discover that it is actually Prentice who was doing the introspection! Karl/Kim who could relate to the scene was the actual rescuer. Portrayed as cool, bold, logical, and independent Karl/Kim presents him/herself with the unflappable reserve of a male personality, who feels dysfunctional with exterior male genitalia. Changing Karl to Kim remedies his/her warped body image, so that he can obtain the feminine exterior which appears so desirable. Expression of the dual conflicting natures can be seen throughout the film as she tries to overcompensate for this masculine interior of herself, by dressing in conservative woman's clothing and finding a feminine career as a Greeting card composer. Even her condo is done up in overtly feminine hues. Prentice is the antithesis of Kim. He is flighty, emotional, dependent and vulnerable. Contrasting Kim, he has an interior feminine nature that is contained in a masculine exterior that is repressed and hidden in a major bravado of masculinity. This is demonstrated with his embracing the fury of punk music, playing the leather-clad macho biker messenger, and keeping up an affront of being a boozer and rebel-rouser. Even Prentice's studio apt seems an exercise in testosterone proving, looking much like an uncleaned dormroom. Peeks at his interior femininity however do come through subtly- he fems up in a ruffled shirt for Kim, and wears a purple T-shirt under his workgarb. Look at Prentices enchanted glance to Kim, versus her patriarchial look back at him in the school pic. His eventual assertion that men are women with an added chromosone. In summation, Prentice completes Kim in that his feminine interior desires her masculine interior, while alternately his masculine exterior fulfills her (now) feminine exterior. If you don't look at Kim's Before/After photo in the tabloid, you don't realize that the character's gender roles were reversed in the school scenes. Kim becomes Prentice's rescuer once again when he emotionally loses it after their first date, and she must stand up again for him (this time it's police bullies) in court! When Kim strips for Prentice, It is like a mirror to the inside of his soul. Complex Film indeed!!!",
         "What a brave and unusual romantic comedy. Thank God the BBC is still open-minded enough for such projects, which are not only important, but ultimately wonderfully entertaining. At the core of the boy-meets-girl, who used to be one of his mates at school, now transsexual, love story is Steven Mackintosh, who portrays Karl-now-Kim with such dignity and style that this film never feels sticky or cumbersome, as one might fear going into it. Rupert Graves plays the bad-boy \"Prentice\" with such charm that one thoroughly understands why Kim allows her new-found, quiet life to be turned upside down. He shows Kim that finding the right gender doesn't necessarily make you a whole person...That comes from conviction and caring. It requires passion - something he's full of and is able to rekindle in his old schoolmate. And who knows...maybe she'll get him to change his socks daily! Thoroughly charming!",
         "Having seen both Soldiers Girl and Different for Girls I wouldn't even compare the 2. There are 2 different circumstances. #1 Justin Fisher and Calvin Glover are still serving time for their part in Barry Winchell's murder as this one was based on a true story. The other being that Different for Girls is fictional and the only problem Prentiss had was struggling with the fact that he now wanted his best mate from school for his love interest (after she was post-op). This is an excellent film and I have watched it 4 times in 2 days and it is not a bit boring. In fact there is some excitement in it as I find Prentiss needs Kim to help him grow up. I am not going to pick this film apart as to who is in what picture or the makeup wardrobe or prosthetics used or how Karl became Kim etc. I just thought it was an excellent and enjoyable film"
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "British Broadcasting Corporation (BBC)",
         "CiBy 2000"
      ],
      "summaries": ["Karl Foyle and Paul Prentice were best mates at school in the Seventies. But when they meet again in present-day London things are definitely not the same. Karl is now Kim, a transsexual, and she has no desire to stir up the past while she's busy forging a neat and orderly new life. Prentice, on the other hand, has charm but is a social disaster stuck in a dead-end job. His main talent is for getting them both into trouble. Amid the squabbles, they start to fall in love. One night, Kim invites Prentice to a romantic dinner at her flat. Prentice, finding the seduction unexpectedly effective, freaks out. He proceeds to make a public display of both of them and winds up in court. Humiliated and angry, Kim runs away. Only she can save Prentice now, but will true love triumph for a new made woman and an aging punk?"],
      "budget": 0
   },
   "movielensId": 3282,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-10-01",
      "dvdReleaseDate": "2000-01-25",
      "directors": ["Richard Spence"],
      "runtime": 97,
      "movieId": 3282,
      "title": "Different for Girls",
      "mpaa": "",
      "actors": [
         "Rupert Graves",
         "Steven Mackintosh",
         "Miriam Margolyes",
         "Charlotte Coleman",
         "Saskia Reeves",
         "Nisha Nayar",
         "Neil Dudgeon",
         "Adrian Rawlins",
         "Robert Pugh",
         "Kevin Allen",
         "Gerard Horan",
         "Phil Davis",
         "Ian Dury",
         "Robert Pugh",
         "Kevin Allen",
         "Rick Warden",
         "Edward Tudor-Pole",
         "Lia Williams",
         "Blake Ritson",
         "Stephen Walker",
         "Graham Fellows",
         "Peter-Hugo Daly",
         "Shend",
         "Ruth Sheen"
      ],
      "imdbMovieId": "0116102",
      "originalTitle": "Different for Girls",
      "genres": [
         "Comedy",
         "Foreign"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Karl Foyle and Paul Prentice were best mates at school in the Seventies. But when they meet again in present-day London things are definitely not the same. Karl is now Kim, a transsexual, and she has no desire to stir up the past while she's busy forging a neat and orderly new life. Prentice, on the other hand, has charm but is a social disaster stuck in a dead-end job. His main talent is for getting them both into trouble. Amid the squabbles, they start to fall in love. One night, Kim invites Prentice to a romantic dinner at her flat. Prentice, finding the seduction unexpectedly effective, freaks out. He proceeds to make a public display of both of them and winds up in court. Humiliated and angry, Kim runs away. Only she can save Prentice now, but will true love triumph for a new made woman and an aging punk?",
      "tmdbMovieId": 106837,
      "avgRating": 3.51754,
      "releaseYear": "1996",
      "numRatings": 114,
      "posterPath": "/fPbbhgKLq1CL6B9PMjzO99cRZJ3.jpg"
   }
}