{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "independent film",
         "id": 10183
      }],
      "imdb_id": "tt0067433",
      "video": false,
      "title": "Minnie and Moskowitz",
      "recommendations": [
         104343,
         33802,
         52105,
         91067,
         123648,
         86282,
         122683,
         98914,
         82576,
         32040,
         33665,
         51141,
         250278,
         67451,
         125276,
         37239,
         33356,
         56801,
         215407,
         71068
      ],
      "backdrop_path": "/1pQ6JptBasIe8nlSsq9zVXVDXLd.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Minnie Moore",
               "gender": 1,
               "credit_id": "52fe4491c3a368484e02a2f7",
               "name": "Gena Rowlands",
               "profile_path": "/kRHNvkcJlwBr1Xb9XREiZob29NX.jpg",
               "id": 4800,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Seymour Moskowitz",
               "gender": 2,
               "credit_id": "52fe4491c3a368484e02a2fb",
               "name": "Seymour Cassel",
               "profile_path": "/atWyQvsLNjmXP5dxsOiaf5Qg9j.jpg",
               "id": 5950,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Zelmo Swift",
               "gender": 2,
               "credit_id": "52fe4491c3a368484e02a2ff",
               "name": "Val Avery",
               "profile_path": "/jIBEZ5xoM7I5PxG3pW62VeWwYih.jpg",
               "id": 3014,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Morgan Morgan",
               "gender": 2,
               "credit_id": "52fe4491c3a368484e02a303",
               "name": "Timothy Carey",
               "profile_path": "/6wTL7aAjJflARVwR9giIIQSJhLs.jpg",
               "id": 2758,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Sheba Moskowitz",
               "gender": 1,
               "credit_id": "52fe4491c3a368484e02a307",
               "name": "Katherine Cassavetes",
               "profile_path": null,
               "id": 146710,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Jim (uncredited)",
               "gender": 2,
               "credit_id": "52fe4491c3a368484e02a30b",
               "name": "John Cassavetes",
               "profile_path": "/dvW9LHWNcgvRLqCom5jhx2T3aIG.jpg",
               "id": 11147,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4491c3a368484e02a2ed",
               "name": "John Cassavetes",
               "profile_path": "/dvW9LHWNcgvRLqCom5jhx2T3aIG.jpg",
               "id": 11147,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4491c3a368484e02a2f3",
               "name": "John Cassavetes",
               "profile_path": "/dvW9LHWNcgvRLqCom5jhx2T3aIG.jpg",
               "id": 11147,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "597146df9251411301001c61",
               "name": "Alric Edens",
               "profile_path": null,
               "id": 1116426,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "597146e6c3a3687c050025c5",
               "name": "Michael D. Margulies",
               "profile_path": null,
               "id": 57360,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "597146efc3a368159300b2ae",
               "name": "Arthur J. Ornitz",
               "profile_path": null,
               "id": 31501,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "597146f6c3a36813d7001a8b",
               "name": "Frederic L. Knudtson",
               "profile_path": null,
               "id": 1833978,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "597146fe9251414fde00a6c7",
               "name": "Al Ruban",
               "profile_path": null,
               "id": 11415,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 1.222641,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 24349,
      "vote_count": 21,
      "budget": 0,
      "overview": "Depressed and jaded after being dumped by her married boyfriend, aging beauty Minnie Moore (Gena Rowlands) wonders if she'll ever find love.  After shaggy-haired parking lot attendant Seymour Moskowitz (Seymour Cassel) comes to her defense from an angry and rebuffed blind date, he falls hopelessly in love with her despite their myriad differences.  Minnie reluctantly agrees to a date with Moskowitz, and, slowly but surely, an unlikely romance blossoms between the two.",
      "similar": [
         3134,
         11564,
         281,
         133805,
         2142,
         22323,
         298312,
         8810,
         948,
         14433,
         12162,
         1359,
         4771,
         8923,
         97630,
         101,
         205,
         141,
         339692,
         281957
      ],
      "original_title": "Minnie and Moskowitz",
      "runtime": 115,
      "poster_path": "/jmcwJSC33VmUnfavMcLZajNqCrM.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
         "name": "Universal Pictures",
         "id": 33,
         "origin_country": "US"
      }],
      "release_date": "1971-12-22",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["John Cassavetes"],
      "runtime": 114,
      "synopsis": null,
      "writers": ["John Cassavetes"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0067433/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgyMDk3NDIwNV5BMl5BanBnXkFtZTcwMDk2Mzc2NA@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Gena Rowlands, Seymour Cassel, Val Avery | See full cast and crew »"],
      "reviews": [
         "This is an incredible achievement for John Cassavetes. Not only has he made an outstanding screwball/romantic comedy, but he has also made a deep and biting attack on the way we let the movies(and also our culture) shape the way we see the world. For those of you who are seeking a love story, Cassavetes provides an extremely lovely one. The rules of the screwball genre are strictly followed. A man meets a woman, they are an impossible match in terms of personality, they try to fall in love, then comes the inevitable 'hiccups' in their relationship, and last but not least, the happy ending. But, as has always been the case with Cassavetes, that is only a very small fraction of what you'll get. He obviously has got a lot more to say. The 'surface' story is not the only story here. Beneath it lies another 'story'. And I don't think the other story will ever get past you unnoticed. The real story here is a 'cultural' one. It is a biting attack on the way we let movies and our culture influence our way of seeing the world. How does he present this attack? Well let me give you an example. The other day I watched this film with a friend. He made quite a few comments but the most striking one was when he complained about how is it that someone as unattractive as Seymour Moskowitz could get a woman as pretty as Minnie to like him(when you see the film you'll see). Now that is exactly the kind of attitude that Cassavetes is attacking. Why must everyone be 'handsome' or 'good looking' to be able to get a girl to like him? Minnie will constantly say to Seymour in the film that, \"That's not the right face. You're not the man I'm in love with.\" It's a subtle attack but no less powerful. There's even one instance where Minnie, while in conversation with her friend, talks about movies as being a conspiracy because \"They set you up. And no matter how bright you are you still believe it.\" This is a shining example of the fact that it is not enough to just recognise the problem, because it doesn't mean anything until you do something about it. There's a lot more, but I don't think it will be fun if I talked about everything. Part of the thrill of watching a movie like this is figuring it out. So I'll just talk about the 'surface' story a little bit more. A lot of people has called this movie 'earnestly real'. But don't be put off by that because like this world we live in, it's not all grim and grin. This isn't a Ken Loach film. While Cassavetes definitely does show us how ugly the world really is and can be, he has got enough insight to also show us that life can also be wonderful. I can give you a lot more examples, but I think it's best if you discover them for yourself. My comment here does not do justice to the movie. There's too much for me to say. And I don't think the space here allows it. So just go and see the movie. It'll be worth every minute.",
         "This light-heated (for Cassavetes)love story is pleasantly conveyed by two wonderful performances by Gena Rowlands and Seymour Cassell. Rowlands was never more beautiful as a repressed, damaged mid-30's woman who meets her match in Seymour. Cassell is a powderkeg of energy and romantic notions (on his terms). There is a great supporting performance by Val Avery as Zelmo Swift and an unusual (as always) Timothy Carey that's worth the price of admission. Made between Husbands and A Woman Under the Influence this is Cass' most accessible film that should touch the heart of anyone (especially the Cassavetes haters) who claim his films are too long and ponderously heavy at times. Made my Top Ten that year and not seen by enough people. An 8 out of 10.",
         "At times, you forget that you are watching a movie and not the lives of two average (but unique) people and the incomplete lives that they live. Searching for love, if not just acceptance, both live in a world where relationships are as confusing as the people in the relationship. By the end of the movie you can't help but smile at the images Cassavetes captures in the last 30 seconds. Without any narrative, Cassavetes gives the conclusion to the two character's lives together. True happiness...",
         "Minnie and Moskowitz is the most pathetic and ungraceful love story I've ever seen. Between Minnie, a disillusioned museum curator whose abusive married boyfriend dumps her and leaves her even more uptight and confused than she already was, and Seymour Moskowitz, a parking attendant so desperate for attention that he spends his nights going to bars and restaurants aggravating people, there is a chaotic and disenchanted match from the start. Just like so many pairings that we see every day. In nearly every love story, there is a man and a woman, the man being confident, funny, either classically hot or attractive in his own way, whose shortcomings are charming, and the woman a wounded soul who could have any man she wants who chooses this guy because there's just something about him. These movies make everyone feel so good because the characters embody what every man and woman wants to be, not what they are. Minnie and Moskowitz, instead of indulging in any hint of fantasy in the realm of romance, depicts people who may just be more common than the attractive, confident people with so much experience playing the field. What's the story behind the love affairs of the ugly, alarmingly awkward man with no life and no job that we all run into, or the woman so crippled by insecurity that it's difficult to talk to her? This film is not as fascinating as Cassavetes's Faces or Opening Night, but it has that riveting quality that Cassavetes always fought so hard to render, which is an unbridled depiction of people underneath the ego that hides behind itself in nearly all other films. Gena Rowlands and Seymour Cassel, delivering startlingly pitiable people, are hardly likable. Moskowitz nearly drives us mad, let alone Minnie. He imposes himself so forcefully in her life, the dates are an explosion of the inner voices of ours that respond to the screamingly inept uneasiness on dates we've all been on, rejections we've all swallowed, and arguments we've all had that we know were our own faults. I admire a film like Minnie and Moskowitz because, as the trademark is with the films Cassavetes helmed himself, it identifies with us in 100% honesty. Our egos play no part in company with his characters, thus a tremendous achievement per performance by actor.",
         "I feel as though I know these people and have known people similar to them. These days, though, people are discouraged from showing such passion about anything especially love and loneliness. It has a slow beginning, but then look out! If you love romantic comedies, but would like to see one that had some basis in reality for a change {or at least did have back in the 70's}, then you should see this movie!",
         "Zelmo says \"people that listen continuously are much more interesting than people that talk continuously\" He doesn't get the girl. Seymour says \"I think about you so much I forget to go to the bathroom.\" He gets the girl. \"When I'm with someone I want to get away.\" This is the girl speaking. Her name is Minnie . She also says \"I don't like men. They smile too much. You see a lot of teeth.\" This is no ordinary love story. Correction this is an extraordinary love story where Minnie ultimately becomes a Moskowitz which is difficult to say with a straight face. But the ultimate romance is between John Cassavetes and the English language. Forget the popcorn, to eternally enjoy Minnie &Moskowitz, have a notepad and some shorthand and \"if you have bread, we can make toast.\"",
         "real love. true love. mad love. beautiful love. ugly love. dirty love. sad love. happy love. silly love. smart love. gorgeous love. dumb love. love love love. minnie moore understands that what she really needs is a man who trust her, trust her and love her madly. of course when this man comes along... she tries to run away but seymour, wonderful seymour, he trusts her, he believes in her so he is going to fight for her against her. i want to be like seymour moskowitz. i want to be that kind of man. a man willing to love without been afraid to fail but willing to fail. that's a kind of hero. that's my kind of hero... and minnie moore is my kind of woman. long live cassavetes and all his lovely bunch!",
         "This movie shares a lot with Heat, Paul Morrissey's third Warhol-produced film that came out a year after Minnie and Moscowitz. Both movies present, in fragmented editing with almost purposeful sound clipping and jump cuts, satires on Hollywood dream land as Morrissey goes all Sunset Boulevard on the dope show's act and Cassavetes gladly irritates spectators with the exagerration of boy-meets-girl melodrama. However, Cassavetes' work typically involves a little bit more care towards revealing more than just darker sides and relationships, but real moralistic questioning into the needs that support the relationship; here, that questioning is empty of significance as he pretty much just throws Rowlands and Cassel together and it's off on the wild romp of endless yelling from there. Cassavetes is no fool and this movie isn't mistaken misfire. He eagerly presents little if any real difference between one sad, lonely, messed up man and the man who saves her from him; he makes the classist, racist, and bigot views of many of his characters quite open; he throws jibes at Hollywood romance and twists their clichés--he knows what he's doing. A yarn about Cassavetes states that he would listen to peoples' comments about his movies and if they approved of any part of it, he'd cut that part out. Well in this case I approved with the cutting off of a few scenes mid-dialog, because it saved me the effort of sitting through it. However, I recognize that in one way, it could be said that Cassavetes is purposefully trying to bring discomfort. Ergo, success. However, in that same mode, he has simply done better and more engaging characters. In Woman under the Influence, the same continual stress of overtly dysfunctional and damaging relationships, and the ineffable way in which the characters still stay together, is still supported by a careful building of that relationship that gives true hints and bases for the motivations and processes that pull these nearly insane people together. Here, it feels much more non-sequitor. That's not to say these characters aren't realistic. I used to work at a video store where a regular customer entered who was quite a lot like Moscowitz and the man he saves Minnie from, as well as the man that Moscowitz meets in the diner at the beginning of the movie. He would as much as yell every thought that came to his brain and if he perceived anyone was put off by him (which inevitably everyone was), he would get angry and upset and lash out. However, he was an exception, even amongst all of the possible annoying and maddening customers in that job, I have not met anyone else like him and it's significant to me that so many of those characters populate and actually meet in this movie. I have the same basic problem with CSI, that it's not necessarily so wrong that individual characters are in real need of help and have emotional and mental problems, it's that the entire plot is driven entirely by them. Back to Morrissey's Heat, then... these messed up characters meet each other because they are in the same trashy, fleshy subculture of drug-addled existence, and the broken editing style matches their carelessness and complete lack of self-awareness. In Cassavetes', there's no real infrastructure to support all of these people running into each other but his own hand in leading the characters along. And Heat is, in its annoying and obnoxious character-laden way, still representative of a group of people who actually act out like that, whereas Cassavetes seems to purposefully remove the filter just to clash with taste. --PolarisDiB",
         "Gena Rowlands and Seymour Cassel star in this tale of love found among imperfect people. Gena tells a girlfriend of hers that all these old movies they see set the bar up too high for today's (the 1970s) generation. There are no heroes, no gentlemen on a white steed, no Bogies. Then, she chances to meet Seymour Cassel, who just moved to California. He is a parking-lot attendant and intercedes for her to get rid of an eccentric date and gets into a fight. Thus, their friendship and interest in each other begins. I must admit this was rather funny in an unusual way, with the viewer laughing almost nonstop at Seymour's unashamed passion for Gena, with such outrageous statements, like \"I can't think straight when I'm around you. I can't even remember to go the bathroom, when I'm around you.\" And, they seem to be constantly either yelling at each other or eating or asking each other, are you hungry. It's kind of haphazard in its pace. But at least it keeps you guessing and keeps the viewer interested. But the constant zigzag-ness of it makes me feel as if the script was thrown together. It's not inherently bad, but with so much of everything thrown in, it doesn't feel especially balanced. (And, Gena Rowlands is always good, and Seymour is memorable in probably his most energetic role of the 1970s.) But I do see what Cassavetes was saying, with its frantic approach to life: that we are all imperfect and we have to love and accept each other with all of our eccentric flaws. Having said that, I don't know that I needed to see this movie to realize that, and I don't know that I would see this again just to see Gena. That was Gena's mother as her mother at the end, by the way. And, to top it all off, Seymour's mother really put him down in the last few minutes of the movie, which makes the viewer appreciate even more Gena's ultimate acceptance of his proposal, and how did writer/director Cassavetes come up with names like Moskowitz and Minnie Moore? I guess by the end of the movie Gena is now Minnie Moore Moskowitz. On that note....",
         "Step the third in my journey through Cassavetes.. Here, he takes one of the most popular movie formats, the romance. Boy- meets-girl in LA, under the lights. But she is no cool femme fatale, she is fragile, unsure of herself. He is no Bogie himself; as the film starts he is watching The Maltese Falcon in a theater, a scene where Mary Astor throws herself crying on Bogie's feet. Trying to pick up women afterwards, he's chased out of bars, looked at as a weirdo and beaten up in an alley. The idea is that we are not going to see movie people, but real people on the street. That was the ambition anyway, a situation aggravated by Cassavetes' actorly Studio background\u0097as in Husbands, we have constant shouting matches, awkward intrusions, obnoxious pulling and nervousness. He seems to think the room inhabited by these characters won't feel real and lived, unless we have damage on the walls, a Greek sensibility, after all the main story recasts Zorba. So unlike a Bogart film, the actors here don't coolly glide off each other, they cut themselves on each other's edges. The same situation develops here as I described in my comment on Husbands. The edges, the damage are unusually pronounced, by this I mean a situation like when Moskowitz almost runs her over with his truck to get her to go with him takes me out of it. A softer next moment will pull me in again, until the next hysteric one and so on. Which brings me to my main discussion about presence. Moskowitz is the kind of character who can be likable once you get to know him, the sort of bond you form with coworkers that greatly depends on shared time. Minnie is warm when we first see her, but there's a haughty, nervous ghost in her. It is, let's say, a truer to life perception than the immediately charming Bogarts and Stanwycks of old. It requires work to take them in, giving space. That narrative room, that space where characters wreck themselves and things works the same way once you excise the shouty moments, simply wonderful. None of the individual visual moments are cool or typically beautiful. The locales are drab and mundane. The light and textures all natural, the whole is imperfect but breathes. In this, he equals Pasolini, another master of the living eye. So on a moment-by- moment basis, the space is like the characters, intensely present flow to undefined horizon. In a movie like the Maltese Falcon, the narrative horizon is immediately defined (get the bird), and again defined in every scene (get out of there, rough someone up, etc.) so we are at all times comfortably tethered, enjoying the play. What Cassavetes does matters in the long run in the sculpting of the overall effect, it doesn't leap to attention. Like Husbands, this slowly starts to work for me once I have a narrative shift that faintly, very faintly defines a certain horizon in the story\u0097here marriage. Cassavetes is work, because this happens so late in the movie, the bulk of it is like staring at a blank page waiting for inspiration, or waiting for musicians to tune their instruments. Here, that shift happens about 9/10ths in the film, and then we're through that and a new horizon opens, the closing shots of family life and then it's over. So it starts to work late but extends for me to long after it's over, it's one of the most haunting effects I know, but more on that in the next comment on Woman."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Universal Pictures"],
      "summaries": [
         "Minnie breaks up with her married boyfriend and becomes disillusioned. However, she begins to learn that there is hope for love and romance in a desperate world when she meets a crazy car-parker named Seymour.",
         "A museum curator falls in love with a crazy parking attendant."
      ],
      "budget": 900000
   },
   "movielensId": 3283,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1971-12-22",
      "dvdReleaseDate": "2000-01-25",
      "directors": ["John Cassavetes"],
      "runtime": 115,
      "movieId": 3283,
      "title": "Minnie and Moskowitz",
      "mpaa": "",
      "actors": [
         "Gena Rowlands",
         "Seymour Cassel",
         "Val Avery",
         "Timothy Carey",
         "Katherine Cassavetes",
         "John Cassavetes"
      ],
      "imdbMovieId": "0067433",
      "originalTitle": "Minnie and Moskowitz",
      "genres": [
         "Drama",
         "Romance",
         "Comedy"
      ],
      "youtubeTrailerIds": ["hIPoCwux0kI"],
      "plotSummary": "Depressed and jaded after being dumped by her married boyfriend, aging beauty Minnie Moore (Gena Rowlands) wonders if she'll ever find love.  After shaggy-haired parking lot attendant Seymour Moskowitz (Seymour Cassel) comes to her defense from an angry and rebuffed blind date, he falls hopelessly in love with her despite their myriad differences.  Minnie reluctantly agrees to a date with Moskowitz, and, slowly but surely, an unlikely romance blossoms between the two.",
      "tmdbMovieId": 24349,
      "avgRating": 3.40833,
      "releaseYear": "1971",
      "numRatings": 120,
      "posterPath": "/jmcwJSC33VmUnfavMcLZajNqCrM.jpg"
   }
}