{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "hippie",
            "id": 458
         },
         {
            "name": "exotic island",
            "id": 911
         },
         {
            "name": "beach",
            "id": 966
         },
         {
            "name": "map",
            "id": 1969
         },
         {
            "name": "group dynamics",
            "id": 2323
         },
         {
            "name": "shark attack",
            "id": 2988
         },
         {
            "name": "leader",
            "id": 3077
         },
         {
            "name": "thailand",
            "id": 3434
         },
         {
            "name": "community",
            "id": 5890
         },
         {
            "name": "backpacker",
            "id": 5891
         },
         {
            "name": "delusion",
            "id": 6262
         },
         {
            "name": "marijuana",
            "id": 10776
         },
         {
            "name": "youth",
            "id": 14751
         },
         {
            "name": "shark",
            "id": 15097
         },
         {
            "name": "extramarital affair",
            "id": 34094
         }
      ],
      "imdb_id": "tt0163978",
      "video": false,
      "title": "The Beach",
      "recommendations": [
         9313,
         2567,
         454,
         1903,
         4148,
         10474,
         12113,
         3131,
         819,
         6073,
         1372,
         9481,
         1813,
         1830,
         1213,
         664,
         1900,
         9383,
         2133,
         297
      ],
      "backdrop_path": "/uqseIBb0MH9dXic9RGmGaLvf56q.jpg",
      "revenue": 144056873,
      "reviews": [{
         "author": "John Chard",
         "id": "559194c7925141757a001c45",
         "content": "Getting away from it all may not be perfection paradise after all?\r\n\r\nI first viewed this film upon its release and felt that the final third did the film down - and that the voice-over took away from the essence of the story, thus it's average. My subsequent viewings over the years would see me lament about an arcade game sequence and bemoaning that Robert Carlyle wasn't given a more extended role, yet it has become a film that sees me totally on board with director Danny Boyle's production and it's now that I think it puts the story together with poignant precision.\r\n\r\nLeonardo DiCaprio is Richard, a backpacker searching for a bit more in life, after a meeting with pot smoking loony Daffy (the wonderful Robert Carlyle), he learns of an island paradise that is everything he has yearned for in his life. Getting there will give him the adventure and danger he craves, because once there it apparently will be the thing of dreams, the perfect paradise cut off from civilisation...\r\n\r\nThe film is very much split in two, the first half introduces us to Richard and the people he would convince to travel with him to this island paradise, we then follow their journey that is perfect in fleshing out the characters, they come up against obstacles and learn about each other on the way. The second half is well worth waiting for because it's here that the story kicks in to make the viewer think, it's idyllic, it's gorgeous, it's near perfect, but wherever there is a community, there will be personal hang ups, jealousies, power seekers and etc, in short, the surroundings may be perfect but the human condition is far from flawless.\r\n\r\nI love this film now, I love DiCaprio's performance, a cocky smart-arse thrill seeker about to get a wake up call is tailor made for him, and he delivers it with a  skillful array of emotions. Director Danny Boyle does a great job of juggling the joys of paradise with the uneasy distortion of the various characters in the community, and the cinematography from Darius Khondji is truly beautiful (Thailand locales). The film suffers with the inevitable comparisons to Lord Of The Flies & Hearts Of Darkness, and yes these are fair comparisons, but it doesn't take away from the fact that it's a fine film for the modern generation in its own right, with the core point of the story relevant to all and sundry.\r\n\r\nFans of the novel would prove to be very ambivalent towards this filmic adaptation, but in my book it gets better on repeat viewings. 8/10",
         "url": "https://www.themoviedb.org/review/559194c7925141757a001c45"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Richard",
               "gender": 2,
               "credit_id": "52fe4320c3a36847f803c4fb",
               "name": "Leonardo DiCaprio",
               "profile_path": "/A85WIRIKVsD2DeUSc8wQ4fOKc4e.jpg",
               "id": 6193,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Étienne",
               "gender": 2,
               "credit_id": "52fe4320c3a36847f803c4ff",
               "name": "Guillaume Canet",
               "profile_path": "/qnDVthzAPxJTKxkUWIRBhuuMI2x.jpg",
               "id": 19866,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Sal",
               "gender": 1,
               "credit_id": "52fe4320c3a36847f803c503",
               "name": "Tilda Swinton",
               "profile_path": "/eGNo9qwlunvAi4kCVUEFtQFM5X.jpg",
               "id": 3063,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Françoise",
               "gender": 1,
               "credit_id": "52fe4320c3a36847f803c50f",
               "name": "Virginie Ledoyen",
               "profile_path": "/t9TdJUerLsUD766Q2dN9tJ4dRCG.jpg",
               "id": 19163,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Christo",
               "gender": 0,
               "credit_id": "52fe4320c3a36847f803c507",
               "name": "Staffan Kihlbom",
               "profile_path": null,
               "id": 19867,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Keaty",
               "gender": 2,
               "credit_id": "52fe4320c3a36847f803c50b",
               "name": "Paterson Joseph",
               "profile_path": "/8UipvAExpG59oYeQ8LZ5xJD4VSq.jpg",
               "id": 19868,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Zeph",
               "gender": 2,
               "credit_id": "52fe4320c3a36847f803c513",
               "name": "Peter Youngblood Hills",
               "profile_path": "/gpuAUjccfnOu96Uk1crvZ5Rfk0j.jpg",
               "id": 19869,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Daffy",
               "gender": 2,
               "credit_id": "52fe4320c3a36847f803c517",
               "name": "Robert Carlyle",
               "profile_path": "/dLNeFPfJACiCiUz3oEdAjeKIwvZ.jpg",
               "id": 18023,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Sammy",
               "gender": 2,
               "credit_id": "52fe4320c3a36847f803c51b",
               "name": "Jerry Swindall",
               "profile_path": null,
               "id": 19870,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Bugs",
               "gender": 2,
               "credit_id": "52fe4320c3a36847f803c51f",
               "name": "Lars Arentz-Hansen",
               "profile_path": "/92IIow0oT5xeIpmNGYUDqanwTYs.jpg",
               "id": 19871,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "Karl",
               "gender": 0,
               "credit_id": "52fe4320c3a36847f803c559",
               "name": "Jukka Hiltunen",
               "profile_path": "/68JutMYqs0X7UNgr0ToGRbW4max.jpg",
               "id": 2063,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "Sten",
               "gender": 0,
               "credit_id": "52fe4320c3a36847f803c55d",
               "name": "Magnus Lindgren",
               "profile_path": null,
               "id": 19873,
               "order": 11
            },
            {
               "cast_id": 23,
               "character": "Hustler",
               "gender": 2,
               "credit_id": "52fe4320c3a36847f803c561",
               "name": "Daniel York",
               "profile_path": null,
               "id": 19874,
               "order": 12
            },
            {
               "cast_id": 24,
               "character": "Unhygienix",
               "gender": 0,
               "credit_id": "52fe4320c3a36847f803c565",
               "name": "Daniel Caltagirone",
               "profile_path": "/cnuEASgMkryLbTMZVNaGltibGFe.jpg",
               "id": 19875,
               "order": 13
            },
            {
               "cast_id": 25,
               "character": "Sonja",
               "gender": 1,
               "credit_id": "52fe4320c3a36847f803c569",
               "name": "Zelda Tinska",
               "profile_path": null,
               "id": 19876,
               "order": 14
            },
            {
               "cast_id": 26,
               "character": "",
               "gender": 1,
               "credit_id": "53b17e000e0a2659800082c3",
               "name": "Sian Martin",
               "profile_path": "/jOgKbjWNMtBuCKJdAjwRPh6DFeQ.jpg",
               "id": 1328285,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4320c3a36847f803c4f7",
               "name": "Danny Boyle",
               "profile_path": "/b5qQpFHmgNyvV1t81ou17Jt2fRj.jpg",
               "id": 2034,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4320c3a36847f803c525",
               "name": "Alex Garland",
               "profile_path": "/mijr9lMVIIc5Ts4rnc9tJNbQOux.jpg",
               "id": 2036,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe4320c3a36847f803c52b",
               "name": "John Hodge",
               "profile_path": null,
               "id": 8999,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4320c3a36847f803c531",
               "name": "Andrew Macdonald",
               "profile_path": null,
               "id": 2035,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4320c3a36847f803c537",
               "name": "Callum McDougall",
               "profile_path": null,
               "id": 10876,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4320c3a36847f803c53d",
               "name": "Angelo Badalamenti",
               "profile_path": "/n5euRajRHN2xSSq4MnGMfHEHkBZ.jpg",
               "id": 5628,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4320c3a36847f803c543",
               "name": "Darius Khondji",
               "profile_path": "/4UEPDPLbcvpkY2xG6PZM9D149dA.jpg",
               "id": 2240,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4320c3a36847f803c549",
               "name": "Andrew McAlpine",
               "profile_path": null,
               "id": 19872,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "52fe4320c3a36847f803c54f",
               "name": "Anna Pinnock",
               "profile_path": null,
               "id": 8384,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "52fe4320c3a36847f803c555",
               "name": "Rachael Fleming",
               "profile_path": null,
               "id": 9006,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 19.556077,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 1907,
      "vote_count": 1630,
      "budget": 40000000,
      "overview": "Twenty-something Richard travels to Thailand and finds himself in possession of a strange map. Rumours state that it leads to a solitary beach paradise, a tropical bliss - excited and intrigued, he sets out to find it.",
      "similar": [
         682,
         578,
         332567,
         403119,
         8914,
         580,
         396940,
         2661,
         15705,
         205321,
         13168,
         438970,
         65055,
         118957,
         40374,
         977,
         40383,
         46020,
         38577,
         74871
      ],
      "original_title": "The Beach",
      "runtime": 119,
      "poster_path": "/4VgPflOJMxlqOYpAqXCm5J6BkYm.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Hrvatski",
            "iso_639_1": "hr"
         },
         {
            "name": "svenska",
            "iso_639_1": "sv"
         },
         {
            "name": "ภาษาไทย",
            "iso_639_1": "th"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Figment Films",
         "id": 359,
         "origin_country": ""
      }],
      "release_date": "2000-02-11",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "Somewhere on this planet it must exist.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Danny Boyle"],
      "runtime": 119,
      "synopsis": "Richard (Leonardo DiCaprio), a backpacker in Thailand, goes to Southeast Asia with the intention of experiencing something radically different from his familiar life. He meets Daffy (Robert Carlyle), who is crazy and rants on about a beach paradise on a secret island and the parasites of civilization. Daffy later commits suicide but leaves Richard a map to the island, convincing him that it exists. Richard meets Françoise (Virginie Ledoyen) and her boyfriend, Étienne (Guillaume Canet), and convinces them to accompany him to the island, partly out of an infatuation for Françoise. They travel from Bangkok to the shores of Koh Samui in the Gulf of Thailand, where Richard befriends a pair of American surfers. They talk excitedly about the myth of the beach and how it has an almost unlimited supply of marijuana. Richard does not admit his knowledge, but copies his map and slides it under their door the next morning. To finally reach the island, Richard, Françoise, and Étienne must swim across to it. When they first arrive on the island, they come across an enormous marijuana plantation guarded by local farmers armed with AK-47 assault rifles, where they barely manage to evade detection. After jumping off cliff and landing in a lake below, they are seen by Keaty (Paterson Joseph), who takes them to the beach community. They are cautiously interrogated by the island's leader Sal (Tilda Swinton) regarding their knowledge of the island, but are accepted. The trio are introduced to everybody and over the next few days go on to become integrated into the community. One night while Richard and Françoise are walking down the beach, she tells him that she is falling in love with him. They swim out into the ocean to look at a swarm of bioluminescent plankton, where Françoise kisses Richard and has sex with him on the beach. Despite their attempts to keep the romance a secret, the whole island finds out about it, including Étienne. Although devastated, Étienne says he will not stand in their way if Francoise is happier with Richard. At first the island and its community seem to live up to their reputation. Richard swims out into the ocean to catch fish with a harpoon and is attacked by a young mako shark, but he stabs it to death, which gains him much admiration. Events take a turn for the worse when Richard is chosen to accompany Sal to the mainland to acquire supplies, where Richard is inadvertently reunited with the American surfers who are preparing to go to the beach with two girls. Sal overhears their conversation about the copy of the map and confronts Richard, who admits his \"guilt\". In exchange for Sal's silence and Richard's return to the island, Sal blackmails Richard into having sex with her that night. When they return to the island, everything returns to normal until the Swedes are attacked by a shark while fishing. Sten dies almost instantly and Christo is severely injured. The only options for Christo are to go to the mainland to get medical help or stay on the island and take his chances, as Sal refuses to allow a doctor to come to the island. Christo chooses to stay, not wanting to go near the water after his encounter with the shark. Christo's condition worsens, consistently lowering the morale of the whole community, so they take him out into the middle of the jungle and leave him to die. However, Étienne, disgusted by the group's decision, vows to stay with Christo. Later, Sal observes the American surfers on the neighboring island and charges Richard with the task of watching them so he can obtain the map and destroy it. While he's waiting for the surfers to arrive, Françoise shows up, furious and heartbroken, saying that Sal has told everybody about her affair with Richard at Koh Phangan. Richard cannot cope with his task and retreats into the forest, where he becomes temporarily insane, believing that he is communing with the long-dead Daffy. He evades the other islanders and sets lethal traps in an attempt to keep them at bay, at times hallucinating that he is a character in a video game. Meanwhile, the surfers reach the island but are discovered and killed by the marijuana farmers before they can get to the beach. Richard witnesses their executions and retreats to the community to convince Étienne and Françoise to leave the island, believing that all their lives are now in danger. Étienne refuses, not wanting to leave the emaciated Christo, whose leg has become gangrenous. When the other two briefly leave the tent, Richard tearfully smothers Christo to death in a mercy killing. When he leaves the tent, however, he is struck across the face by a farmer and knocked unconscious. He wakes up in a tent in pain, surrounded by the community and the farmers. The farmers approach Sal, with whom they had an agreement, and give her a gun loaded with a single bullet and an ultimatum: shoot Richard dead and be allowed to stay, or leave the island forever. Sal approaches Richard and fires an empty chamber, throwing the crowd into chaos. The lead farmer smiles as the community instantly disintegrates. Sal collapses in a flood of tears, as the crowd, now in hysterics, flees in droves to get away from the island. Together, they swim back to the mainland and go their separate ways. The film ends with Richard stopping by an Internet cafe to check his mail. He receives a letter from Françoise titled \"beach life\" containing a photograph of the beach community and an animated handwritten inscription over the image: 'Parallel Universe. Love, Françoise x'.",
      "writers": [
         "John Hodge",
         "Alex Garland"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0163978/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM3MDE0MzQwMF5BMl5BanBnXkFtZTYwNjk4Mjk5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Leonardo DiCaprio, Daniel York, Patcharawan Patarakijjanon | See full cast and crew »"],
      "reviews": [
         "Recently a friend of mine watched \"The Beach\" after I told him my favorite quote (i.e. \"Never refuse an invitation, never resist the unfamiliar, never cease to be polite, and never outstay your welcome\"). He enjoyed the movie a whole lot and told me he hadn't watched it before because of it's low IMDb rating. That's when I decided to register here and post a comment - I hope I help someone else to watch the movie because it is worth a watch. What I personally like so much about this movie is that it is not just plain vanilla. It actually makes sense and can be a starting point for new thoughts and ideas - something I truly appreciate in a movie.",
         "The Beach is interesting in that some people feel that its terrible while there are others who feel that it is an unsung hero of a movie. When I first saw The Beach, back in 2000, I thought it was OK, not as bad as most people said it was. But, just like with A Life Less Ordinary, The Beach grew on me and I had to watch it again. After seeing it a few more times I really started to pick up on what was going on and realized that at the end of the film the viewer has gone through quite an adventure with Dicaprio and co. The acting, cinematography, music, and story are great and hold up after repeat viewings. The Beach is one of those movies that I watch once a year as its enjoyability never decreases. This is a very solid film that will no doubt only increase in its popularity as time goes by as fans of The Beach are quite hardcore. Even though Dany Boyle has said that he is not very proud of The Beach I believe that he's made a gross error and misjudged his work because even after all these years The Beach still has a freshness to it that most films lose while they are still in the theaters. Because of these reasons The Beach will not die today.",
         "Here is another of those films that got panned by critics all over the place, but I liked the movie and thought it was unfairly criticized. Two things are not up for debate: the film is entertaining and the cinematography is gorgeous. Leonardo DiCaprio's lead character is not particularly likable, but that's nothing new for him. He's good at playing the boyish, cocky immature type. He's also good at narration, which he provides here, as he has in a number of other films. In fact, I wish there were more of it in here. French actress Virginie Ledoyen is a new face to me, and a pretty one. I found her intriguing, and not just because of her face Actually, all the characters were pretty darn interesting in this film and you get a varied group. The scenery from Thailand is magnificent. By the way, \"the beach\" that's in this film really exists, just as it's seen here. The story is interesting, too, for the full two hours. My only complaint was that they might have toned down the language, particularly with all the f-words. Don't listen to those national critics who blasted this. I think you'll be entertained.",
         "I went to this one, knowing that it could be crap, but hey, I do not care what others think and once again this way of thinking did not prove me wrong. This flick is basically about a young twenty who goes away on a trip to Thailand by himself, because he wants to forget his past. There he meets a loony (Robert Carlyle) who gives him a map to a secret paradise. He asks two strangers, Françoise (Virginie Ledoyen who was really great in her first big American Film and good looking too by the way) and Etienne (Guillaume Canet) to come and join them. After they have found the island they meet an alternative group who lives there and they join them, but after a while problems evolve and a minor 'hell' breaks loose. This is the plain story-line of the movie, but there is so much more to it, it has a message and that really is what fascinated me a lot in the beginning and at the end. There was a good story there, but the way it was brought over, never really losing the actual message out of sight. Now believe me the direction, the soundtrack and the cast are good. There also is a bit gore, but it fits good in the movie and is not unnecessary. Yet this film is not flawless, it was good entertainment over all, yes and it was very good in the beginning and in the end, but in the middle when Richard (Leonardo DiCaprio) loses it, so does the film and that is a shame. It is just too weird, too long and too incomprehensible (in the sense that the viewer himself doesn't know if it is real or not). It could have been so much better, but I guess it had to be. NO MUST SEE BUT DEFINATELY WORTH A TRIP TO THE VIDEOSTORE OR TO THE CINEMA AT A DISCOUNT!!!!!!!! 7 out of 10 P.S. Don't agree?????, sue me!!!!!!!!!!! or mail me (see above)",
         "American back packer Richard is one of millions of travellers all looking for an unique experience. When in Bangkok he meets the slightly deranged Daffy who leaves him with stories and a map to a beach on a remote island that can't be seen from the sea. Taking with him 2 French travellers, Richard sets out to reach the island and finds it inhabited by a mix of people living as a small ideallic community. However internal conflicts rise up with their arrival and a copy of the map that he gave to some friends threaten to expose the paradise community for it's darker roots. While I know that the critics were a little hard on this film when it came out, my main reason for not going to see it was a feeling of total apathy towards it. I wasn't interested in the story, have never read the book and didn't feel I had to see it because of either the big name star or the famous British team behind it. On television (for free) though, is a different matter and I gave it a go. Firstly the film does look great; I know there are tales of environmental damage to the area but it does look like paradise and is very lush. Director Boyle's direction is visually good too � whether it be drawing style from scenes or contrasting the city with the island or doing imaginative things like computer game style images, he does work well. The plot is good on paper but isn't as well brought through. Richard's journey and initial settling into the island is involving and interesting but the main plot is really in the second half which is also where it becomes a weaker film. The film clearly is building into a teenage Hearts of Darkness type story where the DIY civilisation leads to cruelty and madness � this aim can be seen in an early scene where tourists sit watching Apocalypse Now in a waiting area. However his descent into madness is less well done and less convincing than Brando's. It all happens to quickly and, although with brutal consequences, it really needed to be seen to be more of a gradual distancing from the norm rather than a sudden leap into an abyss. DiCaprio is not an actor that I particularly like or enjoy to watch but he is pretty good here. The fact that this film did as well as it did (in terms of box office) is probably mostly down to his star power, but he also gives a good performance. His madness is well portrayed and it's not his fault the film requires him to suddenly switch the way he does. Swinton is better as Sal, her `madness' is more subtle and is continual rather than sudden. The mix of multinational unknowns in the support roles are all good � even if, with so many good looking young people, it does feel a little like a music video shoot at times. Overall I enjoyed the film even if it never got as involving as I hoped it would. The story lacks punch and point � a fact that can be seen in a very weak ending which was a real wash out in my opinion � but it is still good enough to watch once. The whole thing looks great and DiCaprio's star power and charisma helps keep the audience with him, it's just that the actual story doesn't quite have the rich feeling or depth that the tourist-film location does.",
         "Danny Boyle did an exquisite job on this film. When I first learned that it was indeed a Danny Boyle film I was a bit disappointed that it didn't have any of his \"original\" cast members... the people that he always works with. When I learned that Robert Carlyle was in this, I was ecstatic. This film has so many wonderful points, I can't list them all. I'm just going to say that \"enjoy your dinner Richard\" was a classic cinematic moment. A great thing about this film is that it's a wonderful representation of a microcosm of todays society. It shows that no matter how hard you try to escape all the wrongs in life, and all of your daily annoyances, they'll still be there no matter where you escape to. This film doesn't go from beginning to end. It circles. There is no ending because their lives didn't end. Truly a supreme film. It is what one should expect from a man like Danny Boyle. Leonardo DiCaprio gives another amazing performance. It takes a wonderful actor to be able to portray an emotion such as insanity just with his eyes, and he did so wonderfully!",
         "I'll be brief. I didn't want to watch 'The Beach' because of the bad reviews, but when I accidentally came across it while surfing through the channels, I couldn't stop watching. If you're young and have a thing for interesting stories, you'll love this one. 10/10",
         "On a rating scale of 0 to 100; I gave The Beach a score of 72. Many people have stopped themselves from seeing The Beach because of bad reviews from critics and the story of the crew wrecking an entire island to make the movie. One of those things, in my book, is a fact. They did wreck an island, and for pure entertainment, it's not worth it. Still, the bad reviews from the critics I disagree with, I found this quite a little gem, and if you agree with some of my other reviews, I recommend you don't hesitate when you see The Beach sitting on the drama shelf of your video store. The wonders of modern technology, like computers, video games, cell phones, pagers and the internet, were designed to make our lives more enjoyable and facilitate communications. Yet for many, the complexity of the digital world is overwhelming, leading to a feeling of unreality�of being discconected. The desire to find something real � to connect with something or someone � is what drives Richard (Leonardo DiCaprio), a young American backpacker who arrives in Thailand with adventure on his mind. Travel, he asserts, is the search for experience, the quest for something different. Richard and two friends (Virginie Ledoyen and Guillaume Canet) he meets in Thailand risk their lives travelling secret that is dubbed the beach resort for those who don't like beach resorts. At their destination, Richard and friends are welcomed into a community that lives on the beach. However, they soon discover that beneath this surface, this heaven on earth is less than perfect. Leonardo DiCaprio declared he was not anti-Titanic when he did this film. And he isn't. DiCaprio shows on his face how successful he is when he did the film, and he is a show-off. But, darn it all, DiCaprio is good because we know he has the potential. He went a long length to do this movie, even director's favourite Ewan McGregor was passed over for DiCaprio, and rightfully so. I just can't picture anyone else playing the role. The acting hotline is also boiling with such talents as Tilda Swinton, Virginie Ledoyen and the masterful Robert Carlyle. Danny Boyle's direction is solid and he paces the film nicely, and the script is adapted well from Alex Garland's better-than-movie book. The film certainly has flaws, some scenes � particularly the ones with the dope growers � are just plain stupid and the film really loses it's feet towards the end, going completely out of control. Still, The Beach is a film that is ripe for discussion. It features alluring scenery from the small island of Phuket, it has some striking visuals and an absorbing and intense message about finding your own paradise. It's not the best film of 2000, but The Beach remains a worthy attempt.",
         "When you travel, you are surrounded by people. Amidst all that foreign intrigue, you are truly alone - an opportunity to be truthful to your instincts. When you are young and you travel, recklessness and the need to experience drive almost all your decision, well other than budgetary constraints. It is therefore quite truthful at times to relate to the character who is in search of this ultimate freedom, a place where all your worldly obligations are suspended and irrelevant. The movie is an irony. Not only externally, that though it depicts the end purity of nature when fox's being sued for environmental damage, but also that any man-found paradise is not free, but with a price and in this case, could be the ultimate price. I truly enjoyed the movie especially at times the sparks of life's insight and moments of traveller's consciousness that when you are there, in that destination, IT becomes reality and no longer are you foreign and problems arise regardless. Though the romance is distracting, Etienne, Canet's portrayal is quite the eye candy. Definitely a watch, but may not appeal to all tastes.",
         "!!!!!!!!!!!!!!!!Warning! Contains spoilers!!!!!!!!!!!!!!!!!! The Beach is a Danny Boyle film. In it's first week of release, enough people paid to see The Beach to cover over ¾ of Leonardo DiCaprio's paycheque for his first major role since 1997's Titanic, and it would be safe to say that the majority of those paying customers were disappointed. I believe this is a safe guess because I was one of those people. I have yet to read a positive review of the film and the best my friends could come up with was `It wasn't as bad as I thought it would be'. Sadly, I had to agree. The thing is, I wanted so badly to love this film. I had read the book and loved it, I had seen Boyle's previous work and loved it (Yes, I even loved A Life Less Ordinary), and I wanted nothing more than to prove to all the nay-sayers that The Beach would rise above the stench of the usual February release crowd and be remembered as one of the best films of the year. I went to see The Beach for a second time. The film may not appear on any year-end top ten lists to vindicate my faith, but on second viewing The Beach became a Danny Boyle film. Those who are familiar with 1994's Trainspotting will understand that this is a compliment of the highest regard. Adapted from Alex Garland's 1997 first novel of the same name, The Beach follows Richard (DiCaprio) an admittedly brash, young American back-packer who escapes to Thailand to find� something. Richard is a fairly vague guy. In fact, all he gives us is his name: `�what else do you need to know?'. Is he looking for himself? For Love? What he does find is Daffy (a manic Robert Carlyle). He finds him on the floor of the neighboring hostel room, with his wrists slit � the blood covering the walls and bed in such a fashion as to leave no doubt that the act was committed with purpose (and joy?). The previous evening, Daffy tells Richard about a beach � a real paradise of mythical beauty. The following morning, Richard finds a map on his door. What is most immediately jarring to anyone who has read the book is the decision to make Richard an American instead of a Brit. This does change a couple of things: for one, we miss the joy of Zeph and Sammy � the two American tourists whom Richard unfortunately (or fortunately) invites to `paradise'.With Richard as an American, we Canadians are deprived of a well-needed slap in the face: In the film, Sammy and Zeph are our stereotypical, arrogant American surf dudes. In the book, the surf act was just that: `It's a protest against bigotry,' Zeph explained. `Europeans think all Americans are stupid, so we act stupid to confirm your prejudices. Then we reveal ourselves as intelligent and by doing so, subvert the prejudice more effectively than an immediate barrage of intellect � which only causes confusion and, ultimately, resentment.' (45) How pleasant it might have been to sit in a Canadian audience and listen as the trap is sprung. Still, the most important thing about Richard, Zeph and Sammy is intact. They are not the only things that lead to the end of paradise, but they are a symbol for all that shows us that paradise is not possible. They are Americans and they are a plague. In fact, the film is telling us that we all are, but for some it may be easier to keep the blame centered on our favourite target. The Beach is not an anti-American film. It is an anti-Consumerism film. And we are all targets. We see this in many telling scenes, not the least of which involves Richard preparing to leave the island for food , taking orders from the entire multi-cultural beach community of what to bring back from civilization to their `paradise'. Here's what's brought into `paradise': Bleach, for an Australian girl who doesn't like her dark hair; rubber gloves, for the Eastern European cook who is tired of smelling like fish and requests soap (`something toxic, something industrial') to solve the problem; and batteries, for those on the island (including Richard) who won't accept a paradise without Nintendo. `Paradise' has its problems. `Paradise' will not survive, because once it is found, it is lost. As Richard's time on the beach passes, he finds something again. The only thing he ever finds - he finds twice. Daffy begins to appear to Richard in the latter part of the film. Daffy knows why he left the beach and he tells Richard. He doesn't tell us. But we soon understand. Perhaps the most common complaint I've heard about The Beach includes some comment on the studio system and how it destroys the independent genius of someone like Danny Boyle. Maybe it does. It's quite possible that 20th Century Fox wanted Leo, they wanted Leo to be an American, they wanted Leo's character to sleep with no fewer than two beautiful female characters and they wanted a `happy ending'. It's possible that Boyle consented. It's possible that he subverted the whole process. On the recommendation of a friend, I went to see The Beach for a second time and what I saw was brave. What I saw was Danny Boyle winking at me from behind the guise of Leonardo DiCaprio as Richard sits in an internet café, looking at a photo from `paradise' - I saw Boyle's version of Zeph and Sammy. He sprung the trap on us. Upon first viewing, the ending is a cop-out: a flippantly stupid wrap-up that says `it's okay to fall to the absolute depths of self-imposed degridation, because we'll always have a few happy memories to cover the fall'. Richard's words tell us that he `still believes in paradise', but his eyes tell us something else. This is Boyle's triumph: Richard's eyes tell us what they now know� that there is no such thing. `God knows we're lonely souls' begin the lyrics to the song that plays over the closing credits, and we know that Richard is now the loneliest of them all. Danny Boyle's The Beach follows last year's The Matrix and Fight Club, showing us what we don't want to see: that there is no use looking for paradise because there is no paradise left - it's left us � we've repelled it. It is too late for Richard to save his beach because he believes it can be saved from Zeph and Sammy, he doesn't know that the reason it can't be saved is because he's already there � the poison has already begun to spread. But he learns, and we learn as The Beach reminds us of what we all too often are: `Cancers, parasites eating-up the whole ****ing world'."
      ],
      "genres": [
         "Adventure",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": ["Figment Films"],
      "summaries": [
         "Garland's novel centers on a young nicotine-addicted traveler named Richard, an avid pop-culture buff with a particular love for video games and Vietnam War movies. While at a hotel in Bangkok, he finds a map left by his strange, whacked-out neighbor, who just committed suicide. The map supposedly leads to a legendary island paradise where some other wayward souls have settled.",
         "Twenty-something Richard travels to Thailand and finds himself in possession of a strange map. Rumours state that it leads to a solitary beach paradise, a tropical bliss - excited and intrigued, he sets out to find it."
      ],
      "budget": 50000000
   },
   "movielensId": 3285,
   "movielens": {
      "languages": [
         "English",
         "Français",
         "Hrvatski",
         "svenska",
         "ภาษาไทย"
      ],
      "releaseDate": "2000-02-11",
      "dvdReleaseDate": "2000-07-25",
      "directors": ["Danny Boyle"],
      "runtime": 119,
      "movieId": 3285,
      "title": "The Beach",
      "mpaa": "R",
      "actors": [
         "Leonardo DiCaprio",
         "Guillaume Canet",
         "Tilda Swinton",
         "Virginie Ledoyen",
         "Staffan Kihlbom",
         "Paterson Joseph",
         "Peter Youngblood Hills",
         "Robert Carlyle",
         "Jerry Swindall",
         "Lars Arentz-Hansen",
         "Jukka Hiltunen",
         "Magnus Lindgren",
         "Daniel York",
         "Daniel Caltagirone",
         "Zelda Tinska",
         "Sian Martin"
      ],
      "imdbMovieId": "0163978",
      "originalTitle": "The Beach",
      "genres": [
         "Drama",
         "Adventure",
         "Romance",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "mwbLivFNZok",
         "uTDVnwwQNTw"
      ],
      "plotSummary": "Twenty-something Richard travels to Thailand and finds himself in possession of a strange map. Rumours state that it leads to a solitary beach paradise, a tropical bliss - excited and intrigued, he sets out to find it.",
      "tmdbMovieId": 1907,
      "avgRating": 3.07268,
      "releaseYear": "2000",
      "numRatings": 7334,
      "posterPath": "/4VgPflOJMxlqOYpAqXCm5J6BkYm.jpg"
   }
}