{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0159373",
      "video": false,
      "title": "Cotton Mary",
      "recommendations": [],
      "backdrop_path": "/z5L2uF6T96B3PDDLsONbyy996RV.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4797c3a368484e0cf731",
               "name": "Greta Scacchi",
               "profile_path": "/uHPHNwBnhBIs1z2sJcKQODtaY2n.jpg",
               "id": 21245,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4797c3a368484e0cf735",
               "name": "Madhur Jaffrey",
               "profile_path": "/6WXaJ42HWbqkWWrocVDDEIeAYnM.jpg",
               "id": 195399,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4797c3a368484e0cf739",
               "name": "James Wilby",
               "profile_path": "/vGwguIlASm4qs4xEymLJwFtLArt.jpg",
               "id": 42627,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4797c3a368484e0cf73d",
               "name": "Sarah Badel",
               "profile_path": "/pjgW0dWhbG0MMAdC4selNhsY6us.jpg",
               "id": 58079,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4797c3a368484e0cf741",
               "name": "Riju Bajaj",
               "profile_path": null,
               "id": 1290218,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4797c3a368484e0cf745",
               "name": "Gerson Da Cunha",
               "profile_path": null,
               "id": 1290219,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4797c3a368484e0cf749",
               "name": "Joanna David",
               "profile_path": "/biMyuAc9MvkHBSafqLD729aPfZ2.jpg",
               "id": 1217907,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4797c3a368484e0cf74d",
               "name": "Neena Gupta",
               "profile_path": "/782xRdSqkmrFnK0UnUu1JoJcckq.jpg",
               "id": 583509,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4797c3a368484e0cf751",
               "name": "Sakina Jaffrey",
               "profile_path": "/cljkdHCxyQm9mpm1Dijp3eOVHJs.jpg",
               "id": 34200,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4797c3a368484e0cf755",
               "name": "Gemma Jones",
               "profile_path": "/doDUez5AkN0bfqmZWB0bKO9mcJe.jpg",
               "id": 9138,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4797c3a368484e0cf715",
               "name": "Ismail Merchant",
               "profile_path": null,
               "id": 54448,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe4797c3a368484e0cf71b",
               "name": "Madhur Jaffrey",
               "profile_path": "/6WXaJ42HWbqkWWrocVDDEIeAYnM.jpg",
               "id": 195399,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4797c3a368484e0cf721",
               "name": "Alexandra Viets",
               "profile_path": null,
               "id": 1290216,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4797c3a368484e0cf727",
               "name": "Richard Robbins",
               "profile_path": null,
               "id": 54449,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4797c3a368484e0cf72d",
               "name": "Pierre Lhomme",
               "profile_path": null,
               "id": 17556,
               "department": "Crew",
               "job": "Cinematography"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.41413,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 68546,
      "vote_count": 3,
      "budget": 0,
      "overview": "A British family is trapped between culture, tradition, and the colonial sins of the past.",
      "similar": [],
      "original_title": "Cotton Mary",
      "runtime": 124,
      "poster_path": "/AeJkCzd61erKG8Xa5VvjxL7ctBu.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1999-01-01",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": [
         "Ismail Merchant",
         "Madhur Jaffrey"
      ],
      "runtime": 124,
      "synopsis": null,
      "writers": ["Alexandra Viets"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0159373/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYxMTQwMDkwNF5BMl5BanBnXkFtZTYwMzk3MTk5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Greta Scacchi, Madhur Jaffrey, James Wilby | See full cast and crew »"],
      "reviews": [
         "A sensitive look at the difficulties faced by a woman in colonial India, during the period when nationalism was starting to set in. The story opens with an India-born Englishwoman who goes into labour, is taken to the hospital, and gives birth to a sickly child. When it turns out that her milk doesn't come in, a nurse with mixed British/Indian heritage takes pity on her, finds a wet nurse, moves into her house, and begins to manipulate the situation to her own advantage. As the story progresses, the husband's infidelity and disassociation is presented, as is the blindness of the wife, and the racist superiority of the expatriate British community. The Englishwoman's preteen daughter turns out to be the voice of reason who opens the woman's eyes to the situation as it is. This is a slow-paced visually interesting story that focuses a great deal of attention on nurturing and nursing, and the complexity of a materially richer culture clashing and feeding on a materially poorer one.",
         "Don't get me wrong, there are Merchant-Ivory films I've really loved, like \"Room With A View\" and \"Remains of the Day.\" But M-I films either suck you in or they don't, and halfway through this one made me wish I had a 'relief video' handy, perhaps one with car chases and explosions. For one thing, the title character, a thieving, scheming servant, was completely unlikable. There was no attempt to draw humor from the situation. For another, the character played by Greta Scacchi, an actress I love, was a hopeless dupe. Not only did she seem unaware of the very existence of baby bottles and wet nurses, but one would think that an upper class British woman in India would have a well-developed radar for servant politics and shenanigans. Lastly, the film would have you believe that Cotton Mary could take a baby, ship it across the river to her sister's compound to nurse, ship it back - and still have time for her various plots? As I recall, the little buggers want to feed pretty often. If you want to see an allegory on British colonialism in south Asia, watch \"A Passage to India\" or \"The Man Who Would Be King,\" the latter having more action in any three minutes of its running time than \"Cotton\" had in its entire length.",
         "Thank Goodness Merchant and Ivory share some stuff. They are both masters of creating an intoxicating atmosphere ! The scenery of their movies are always breathtakingly beautiful. 'Cotton Mary' is no exception. And Ismael Merchant lured a leading lady into his picture that is even more gorgeous than all the scenery of the Merchant-Ivory films (in which she has shined so often) combined. Besides that, Greta Scacchi is an astonishing actress, and so she is again in this film. So fragile yet so present, what an enormous accomplishment !! Her performance alone deserves a (re)viewing of this film. The other principal actors give us very nice portrayals too. BUT... Somehow Merchant does not seem to be able to capture the excitement his partner Ivory finds so easily. Somehow this beautiful picture with good performances and a stunning Scacchi refuses to really fly after taking off nicely. The film is not as bad as some would like you to believe, far from it. Imagery and acting and the technical side of filming, together with the beautiful scenery, will make 'Cotton Mary' an agreable pastime for 2 hours. But surely it could have been so much more with all the talent and beauty assembled ? It was nice, where it could have been great. If the characters would have been given a bit more depth, this would have been a stunning film, instead of the nice one it is now...",
         "This has got to be the best movie I have ever seen that tackles the madness that self hatred can bring. Yes we have seen plenty of movies in which someone has a identity crisis. But this movie actually in a very understated way shows how self hatred is a psychological illness that I believe is serious problem that people tend It sweep under the rug. It shows that a person who has lived under colonialism in India slowly slips into darkness because no matter how she tried to assimilate and to act just like the British even to the detriment her own people. She will always remain a Indian no matter if her father was white She will always remain a person she hates a Indian, a \"blackie\". . As a black woman I have seen this behavior so many times. When I say that black people who act like Mary are sick white people say I am racist because to them the person I am referring to is a great person who never sees race or some other ridiculous reason. When in reality all they see is race, their race and they hate it. Cotton Mary personifies these people to a Tee. They will undermined their own people to the white man so perhaps the white man will think they are not like \"those people\", For example when Cotton Mary causes a lifelong servant Abraham to loose his job. She knew that the mistress of the house, Lily would not even question if this trusted person would steal, because of her self hatred to her all of \"those people, blackies\" steal so of course Lily would believe that too. The funny thing is that these people like Cotton Marry usually take on the characteristics of the negative stereotype, they hate so much. She was the one who was stealing. This man lived there for as long as she was alive and when she dismissed him he said \"this is my home\"\" , she did nothing. The little daughter was the only one in the family that had sense. So when they go back to look for him, he is gone. Disappeared, poof, just like that. Now Mary thinks she is one of them. So to show she is a big shot to her sister and friends she steals things from the household as if they were hers and gives it to her sister and friends as gifts. it is incredible how she takes the mistress's baby to the sister she she can feed it breast milk but in the same breath call her sister all types of demeaning names. To Mary those \"blackies\" are only good as long as she has use for them. Just like the Brits or any colonial power treated the natives of the country they colonized. I am not going to go into the ending but to me this his how it always ends. Reality sets in and they end up back home, ANd always for the same reason. Someone mentioned she slowly started living in the Land of Make Believe. But I will disagree and say she was always lived there. Her self hatred led her to deny who she was. She was always crazy. Only when reality sets in does she seem to break. But I say she was always broken., but she never realized it. Only when she realized reality did she herself look it, But she always was a nut.. I find this behavior is very much a reality within communities that have been traditionally oppressed. I am Jamaican and so many times I have seen remnants of Jamaicans that actually lived under colonialism acting more like the British then the British and treating their own people like dirt. I see it happens here in America. Where the black person or other people of color have been broken down so much that they actually believe they are garbage while aspiring to be a white person. Jewish people talk about self hatred all of the time. This is the first movie I ever saw that came right out and tackled this problem.. I read some reviews that were not crazy about this movie and some felt that Mary was annoying and a unsympathetic character.. I can understand how people would feel that way. They most likely do not fully understand the full depths of the psychological damage colonialism or oppression had on the oppressed. To me she was a sympathetic person because she she suffered form the illness of self hatred. Remember this movie took place in 1957. Today in the year 2006 I still see people like Cotton Mary because this illness is something that is brought down from generation to generation. All one has to do is look at the last scene with Cotton Mary and the little girl to understand what I mean.",
         "In India, in the 50s, an English housewife gives birth to a premature baby. An Anglo-Indian nurse looks after it from then on, using it to secure her position in the family sphere. This somewhat overlong portrait illustrates rather simply the quest for identity of an English - Indian community.",
         "I have seen Cotton Mary two or three times and I recommend it to my friends both Indian and American who have an interest in well directed and acted movies and who have an understanding of complex social issues around the world. Cotton Mary is an example of such a movie and it will stand as one of the best dealing with the subject of social class distinctions.As we know, the Merchant-Ivory team almost always makes excellent movies on historical and social issues and Cotton Mary is no exception. What one learns from this almost factual story is that people of mixed English and Indian race in India are shunned by the former because they are colored and by the caste Hindus as being the product of unclean union. Hindus may show outward respect for the English but in truth the English are viewed as meat eating,promiscuous out castes not fit for marriage or intimate relations. This aspect was not shown in this film although English contempt for the Anglo-Indian was clearly illustrated. The third part of the equation, namely the Anglo-Indian,tried hard to assimilate English ways perhaps for reasons of economic advancement in British India and tried to assume superiority over the Indian not realizing that their English ancestry was no advantage in India or England. I am sure at least some members of the current Anglo-Indian community in India would feel resentment when they view this film as it shows them in a bad light which they may disagree with but nevertheless is true. Another movie on the subject, Bhowani Junction,shows Ava Gardner as the Anglo-Indian suffering rejection in India. Madhur Jaffry's role as well as that of her daughter,Sakina Jaffry were exemplary but that of Greta Scacchi was lukewarm and unconvincing. On the whole it is one of Merchant's best movies.",
         "Ah the Malabar coast and India in the early 1950's. It seems it was a pretty boring place. And stereotypes abound both on the \"English\" and \"Indian\" sides. Ismail Merchant has created a visually beautiful film with an adequate cast....but where was the character development. The lead actress gets more and more annoying as she slips into the land of make-believe.",
         "This film suffers from the usual shortcomings of films about \"The British Raj\":it ignores the stories of a whole swathe of ordinary British and Anglo-Indians between the ruling Raj and the new Indians.I have the greatest respect for the two main actresses, Jaffrey and Scaatchi but it was a poor script and plot.The caricature of an Anglo-Indian woman was such a racial stereotype it is clear that Merchant/Ivory did little to acquaint themselves with the Anglo-Indian community either in India or in England.The idea that this community was such a self-hating hybrid of the British is short sighted in the extreme.Also the fact that the majority of Anglo-Indians didn't live in South India but in central India and the North which were \"British India\" is a glaring inaccuracy.Also another fact that by 1954 the majority of Anglo-Indians had emigrated to other parts of the old Empire including England to make a new life as they felt that they didn't have a future in an Independent India.Cotton Mary perpetuates an unpleasant stereotype projected on this community by British and Indians alike during the previous 200 years of Imperial rule.The film was eventually removed from circulation through the protests of Anglo-Indians worldwide.All in all this film was unworthy of Merchant/Ivory, a great disappointment.",
         "I rented this film because a few of my colleagues suggested this as interesting viewing. This was not a rave but a...once you see this film, you will have a better understanding of a fellow co-worker's oddities. I can't say that I enjoyed this film. Cotton Mary was just darn annoying. She interferes with people's lives, climbing aboard when she sees opportunity. The manipulation and the passive-aggressive nature of her personality struck me. She was just so desperate to rise from her station and be someone to be reckoned with. Her impending madness was predictable and sad nevertheless. An odd film but one that only Merchant-Ivory fanatics should see for the sake of completeness.",
         "First of all, the worst and most misrepresentational cover art for any video, ever. The characters and fleshy situation depicted are incidental to the film. A movie with an utterly unlikable protagonist, and no one to identify with or get behind as an audience member. It all ends up feeling as self-important as its title character. The only reason I didn't turn it off was that nothing was on television until after the tape ran out."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Merchant Ivory Productions"],
      "summaries": [
         "1954, the Malabar Coast. British and Anglo-Indian identities blur when an English-woman with a neglectful husband births a sickly baby. Cotton Mary, a hospital aide and moralizing Anglophile who claims her father was a British officer, takes over the infant's care and, without a word to the mother, takes the baby daily to her sister to nurse. Mary moves into the English household, taking over more and more duties as she plays on the mother's fatigue and lack of spousal counsel: in effect, Mary colonizes the English household while she pilfers its stores and tells tall tales to her own family. For how long can Mary sustain her rule before the Englishwoman stands on her own feet?",
         "After the crippling effects of World War II, the British were in no position to continue to rule over India, ended up annexing India, then quiting in 1947. Some of the British families stayed. One of these was the MacIntosh's, consisting of John, a BBC World Service Correspondent, his wife Lily and school-going daughter, Theresa. In addition there were several \"Anglo-Indian\" families as a result of several Britishers having affairs with their Indian counterparts, who are now shunned by the privileged British families as ones who have the worst possible attributes of both Indian and British. John stayed out for several days on end, purely on the pretext of \"work\", but was known to indulge in having affairs with several women, both Indian and British. He could not be present when Lily gave birth to a baby girl. A depressed Lily is unable to breast-feed her new-born, and a seemingly compassionate nurse, who claims that she is half-white, named Cotton Mary, comes to her aid. Under normal circumstances, the Hospital would let the baby perish, blaming the mother for this shortcoming, but since the mother was white, no stone is left unturned to keep the baby alive. Mary even accompanies her to the MacIntosh's palatial home and makes her presence known to everyone. John does not find any fault with Mary, and even gives her attractive young niece, Rosie, a former nurse, a job as a translator. John's world comes crashing down when Mary catches him with him in bed with Rosie, and also when John finds out that a crippled half-breed, Blossom, has been breast-feeding his daughter; that Mary has been helping herself to their belongings and distributing them amongst other Anglos. The stage is set for a confrontation between John and Lily on one hand, and Mary and Lily on the other, and it appears very likely that the sole casualty may turn out to be Lily's second-born.",
         "A British family is trapped between culture, tradition, and the colonial sins of the past."
      ],
      "budget": 3500000
   },
   "movielensId": 3288,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-01-01",
      "dvdReleaseDate": "2001-01-30",
      "directors": [
         "Ismail Merchant",
         "Madhur Jaffrey"
      ],
      "runtime": 124,
      "movieId": 3288,
      "title": "Cotton Mary",
      "mpaa": "",
      "actors": [
         "Greta Scacchi",
         "Madhur Jaffrey",
         "James Wilby",
         "Sarah Badel",
         "Riju Bajaj",
         "Gerson Da Cunha",
         "Joanna David",
         "Neena Gupta",
         "Sakina Jaffrey",
         "Gemma Jones"
      ],
      "imdbMovieId": "0159373",
      "originalTitle": "Cotton Mary",
      "genres": [
         "Drama",
         "Foreign"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A British family is trapped between culture, tradition, and the colonial sins of the past.",
      "tmdbMovieId": 68546,
      "avgRating": 2.63333,
      "releaseYear": "1999",
      "numRatings": 30,
      "posterPath": "/AeJkCzd61erKG8Xa5VvjxL7ctBu.jpg"
   }
}