{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "detective",
            "id": 703
         },
         {
            "name": "police corruption",
            "id": 11734
         }
      ],
      "imdb_id": "tt0047878",
      "video": false,
      "title": "The Big Combo",
      "recommendations": [
         26243,
         26167,
         30162,
         21454,
         25955,
         20362,
         20298,
         20025,
         21296,
         26174,
         30015,
         38964,
         35546,
         28120,
         14638,
         25680,
         20330,
         31556,
         29470,
         28007
      ],
      "backdrop_path": "/b7EYr1QYzThW3EERPLWINI2jIxD.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Leonard Diamond",
               "gender": 2,
               "credit_id": "52fe443cc3a368484e0177cf",
               "name": "Cornel Wilde",
               "profile_path": "/irvjqmXVMSoLmZ9Tcqa9bIpRf2H.jpg",
               "id": 35320,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Susan Lowell",
               "gender": 1,
               "credit_id": "52fe443cc3a368484e0177d3",
               "name": "Jean Wallace",
               "profile_path": "/k0GWVH9icadc6YVwPriLNT8Mzit.jpg",
               "id": 88617,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Joe McClure",
               "gender": 2,
               "credit_id": "52fe443cc3a368484e0177d7",
               "name": "Brian Donlevy",
               "profile_path": "/dJP0woESrhHQrPbTieZdE54OM2f.jpg",
               "id": 41755,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Mr. Brown",
               "gender": 2,
               "credit_id": "52fe443cc3a368484e0177db",
               "name": "Richard Conte",
               "profile_path": "/5682H8oxwIezxImi7HiFnBYLL4V.jpg",
               "id": 3090,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Fante",
               "gender": 2,
               "credit_id": "52fe443cc3a368484e0177df",
               "name": "Lee Van Cleef",
               "profile_path": "/oEEsdGCBjpyJyVZlx1X8PKvHe7S.jpg",
               "id": 4078,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Mingo",
               "gender": 2,
               "credit_id": "52fe443cc3a368484e0177e3",
               "name": "Earl Holliman",
               "profile_path": "/k1f9fUfeGt0cCbDWt8j2eK7JjPY.jpg",
               "id": 12313,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Police Capt. Peterson",
               "gender": 2,
               "credit_id": "52fe443cc3a368484e0177f3",
               "name": "Robert Middleton",
               "profile_path": "/qjEpwxigGaaf32cDbSNL143I4in.jpg",
               "id": 29363,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Alicia Brown",
               "gender": 1,
               "credit_id": "52fe443cc3a368484e0177f7",
               "name": "Helen Walker",
               "profile_path": "/jXLKPyAHN7YmkQIpnbQkmmCkyLM.jpg",
               "id": 83475,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Detective Sam Hill",
               "gender": 2,
               "credit_id": "52fe443cc3a368484e0177fb",
               "name": "Jay Adler",
               "profile_path": "/vBwdEXvk96OLlIiykTst6cgIl5y.jpg",
               "id": 3343,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Nils Dreyer",
               "gender": 2,
               "credit_id": "52fe443cc3a368484e0177ff",
               "name": "John Hoyt",
               "profile_path": "/m3NuX4YDtvvUSxUsR632SnSA1M5.jpg",
               "id": 14508,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Ralph Bettini",
               "gender": 2,
               "credit_id": "52fe443dc3a368484e017803",
               "name": "Ted de Corsia",
               "profile_path": "/63mhu9Qa62Viwy9tAdOFL9Spsf.jpg",
               "id": 2097,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Rita",
               "gender": 1,
               "credit_id": "52fe443dc3a368484e017807",
               "name": "Helene Stanton",
               "profile_path": null,
               "id": 93739,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Audubon",
               "gender": 0,
               "credit_id": "52fe443dc3a368484e01780b",
               "name": "Roy Gordon",
               "profile_path": "/wAnt4yusdtFLvCPrT0rq8j3gnmH.jpg",
               "id": 34211,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Young detective",
               "gender": 2,
               "credit_id": "52fe443dc3a368484e017813",
               "name": "Baynes Barron",
               "profile_path": null,
               "id": 93740,
               "order": 14
            },
            {
               "cast_id": 18,
               "character": "Frank - Lab technician",
               "gender": 2,
               "credit_id": "52fe443dc3a368484e017817",
               "name": "James McCallion",
               "profile_path": "/lklPqsRvCeoaHtgduNNZ7J0BYTq.jpg",
               "id": 93741,
               "order": 15
            },
            {
               "cast_id": 19,
               "character": "Photo technician",
               "gender": 2,
               "credit_id": "52fe443dc3a368484e01781b",
               "name": "Tony Michaels",
               "profile_path": null,
               "id": 93742,
               "order": 16
            },
            {
               "cast_id": 21,
               "character": "Nurse",
               "gender": 0,
               "credit_id": "52fe443dc3a368484e01781f",
               "name": "Rita Gould",
               "profile_path": null,
               "id": 93743,
               "order": 17
            },
            {
               "cast_id": 22,
               "character": "Detective",
               "gender": 0,
               "credit_id": "52fe443dc3a368484e017823",
               "name": "Bruce Sharpe",
               "profile_path": null,
               "id": 93744,
               "order": 18
            },
            {
               "cast_id": 23,
               "character": "Fred (hotel clerk)",
               "gender": 2,
               "credit_id": "52fe443dc3a368484e017827",
               "name": "Michael Mark",
               "profile_path": null,
               "id": 30163,
               "order": 19
            },
            {
               "cast_id": 24,
               "character": "Miss Hartleby",
               "gender": 0,
               "credit_id": "52fe443dc3a368484e01782b",
               "name": "Donna Drew",
               "profile_path": null,
               "id": 93745,
               "order": 20
            },
            {
               "cast_id": 29,
               "character": "Attorney Malloy",
               "gender": 0,
               "credit_id": "52fe443dc3a368484e017847",
               "name": "Brian O'Hara",
               "profile_path": null,
               "id": 568914,
               "order": 21
            },
            {
               "cast_id": 30,
               "character": "Bennie Smith, Boxer",
               "gender": 0,
               "credit_id": "551868139251412b6d002e87",
               "name": "Steve Mitchell",
               "profile_path": null,
               "id": 544425,
               "order": 22
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe443cc3a368484e0177e9",
               "name": "Joseph H. Lewis",
               "profile_path": "/lMwmKsspovp268RzuoWXmhuQRI9.jpg",
               "id": 86004,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe443cc3a368484e0177ef",
               "name": "Philip Yordan",
               "profile_path": null,
               "id": 85453,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe443dc3a368484e017831",
               "name": "Sidney Harmon",
               "profile_path": null,
               "id": 89816,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe443dc3a368484e017837",
               "name": "Sidney Harmon",
               "profile_path": null,
               "id": 89816,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe443dc3a368484e01783d",
               "name": "John Alton",
               "profile_path": "/2T1IJWguIJicQD2dw0SqzoVAYxa.jpg",
               "id": 96252,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe443dc3a368484e017843",
               "name": "Robert S. Eisen",
               "profile_path": null,
               "id": 69815,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 3.277882,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 22342,
      "vote_count": 34,
      "budget": 0,
      "overview": "Police Lt. Leonard Diamond vies to bring a clever, well connected, and sadistic gangster to justice all the while obsessing over the gangsters' girlfriend.",
      "similar": [
         11423,
         12150,
         4771,
         320,
         75780,
         984,
         25376,
         9411,
         10651,
         15069,
         26390,
         20676,
         96,
         949,
         1586,
         189,
         2832,
         807,
         1847,
         1939
      ],
      "original_title": "The Big Combo",
      "runtime": 84,
      "poster_path": "/8AeMWtMLZVeGeSGlhQXGMxJCqzo.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Security Pictures",
            "id": 4388,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Theodora Productions",
            "id": 4389,
            "origin_country": ""
         }
      ],
      "release_date": "1955-02-15",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "The Most Startling Story The Screen Has Ever Dared Reveal!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Joseph H. Lewis"],
      "runtime": 84,
      "synopsis": "Police captain Peterson (Robert Middleton) storms into the office of police Lt. Leonard Diamond (Cornel Wilde), critical of Diamond's spending exorbitant amounts of the city budget and his own personal money in an attempt to arrest a crime boss, Mr. Brown (Richard Conte). Peterson says it is a waste of time trying to find something incriminating to bring Mr. Brown to justice because his crime combo does business without accounting books, and furthermore Peterson says Diamond's actual motivation is Diamond's love for Brown's girlfriend Susan Lowell (Jean Wallace). Susan is attended to at all times by Brown's thugs Mingo (Earl Holliman) and Fante (Lee Van Cleef). Seemingly drawn to Brown through his ability to inflict pain, she seems kidnapped and yet willingly waits for Brown's brutal attentions. Attempting suicide, she overdoses on pills, and utters the name \"Alicia\" as Diamond attends to her in the hospital. Believing this may be Brown's wife, Diamond follows up on this new lead, but Brown captures and tortures Diamond and delivers him back to his boss Peterson, attempting to make Diamond appear drunk. Meanwhile, Joe McClure (Brian Donlevy), a deaf underling of Brown's, tries to overthrow him by enlisting Mingo and Fante to kill him, but they in turn stick with Mr. Brown and kill McClure instead. Diamond makes more headway by locating a former girlfriend of Brown's and Bettini (Ted De Corsia), the former First Mate of Brown's boat. When Brown tries to further kill off his hired thugs and escape, Diamond confronts him again, with new evidence to arrest him.",
      "writers": ["Philip Yordan"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0047878/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNDY4NzQ0MTg1MV5BMl5BanBnXkFtZTgwODQ3MTMyMDE@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Richard Conte, Jean Wallace, Cornel Wilde | See full cast and crew »"],
      "reviews": [
         "The Big Combo may be the only film noir ever plugged on the I Love Lucy show (Cornel Wilde guest-starred in the episode which aired April 18, 1955). Coming late in the noir cycle and directed by Joseph Lewis, it seized a position as one of its most innovative and stylish titles. And, with the wizardly John Alton behind the camera, it kicks film noir's distinctive look up into another, rarefied dimension (Alton must have been emulating the Dutch Masters \u0096 spare traceries of light limn almost abstract patterns on the screen's primordial blackness). The story, too, stays a primal one of obsession, lust and revenge. Ninety-six-fifty-a-week cop Wilde lives in a cheap flat across from a burlesque house, one of whose headliners (Helene Stanton) he occasionally `sees.' But his only passion is for nailing suave but savage crime boss Richard Conte. Iin a performance brimming with cool menace, Conte is fond of saying `First is first and second is nobody.' Wilde also harbors half-admitted fantasies of riding to the rescue of Conte's remote and unwilling mistress (Jean Wallace, Wilde's off-screen wife). Conte's so possessive that he assigns an intimate twosome of torpedoes (Lee Van Cleef and Earl Holliman) as her full-time bodyguards (since they're gay, he trusts them to serve as eunuchs). But when they fail to prevent her overdosing on pills, she falls into Wilde's hands at hospital and starts to babble about a woman called Alicia. Another wild card is Conte's lieutenant Brian Donleavy, over the hill and hard of hearing, who chafes at playing second fiddle; he saw himself as heir to the organization when unseen capo Grazzi `retired' to Sicily. His grudge against his boss makes him reckless, placing the whole `combination,' or combo, in jeopardy. Wilde, meantime, has tracked down elusive Alicia, Conte's supposedly murdered wife (Helen Walker, the duplicitous psychiatrist in Nightmare Alley, in her last screen appearance); only she knows where the bodies are buried and can write her husband's death warrant.... The Big Combo counts as one of the more sadistic instalments in the cycle, but the mayhem and executions are played as big set-pieces, as flourishes; Lewis draws on Alton's full fetch of tricks (and in one memorable instance, on the sound editor's) to highlight but at the same time soften their nastiness. There's a streak of sadism in the casting, too: Both Wallace's attempted suicide and Walker's dissipation bring to mind the actresses' private troubles. Innovative and striking, The Big Combo comes as close as any film in the noir cycle to being an art-house triumph; it consolidates Lewis' reputation as an erratic director who was nonetheless capable \u0096 here, and with his Gun Crazy \u0096 of pulling off something unexpected yet extraordinary.",
         "Now that DVD is fast becoming the medium of choice for many film enthusiasts, some lesser known, lower budget titles are finding their way to wider audiences. Joseph Lewis's \"The Big Combo\" has made this trip to digital, and thankfully none of the film's captivating sleaze has been stripped away in the transfer. What appears to be a fairly stock story of straight-arrow police detective Leonard Diamond (Cornel Wilde) obsessed with capturing a foreboding gangland chieftain, Mr. Brown, \"Combo\" is an unusually hardboiled, over the top tale of revenge and murder that will please and perhaps even surprise noir and crime-drama fans. Over the course of the protracted investigation, Diamond, who has nearly lost his badge because of his stubborn determination, has fallen for the boss's dame -- a society girl gone so wrong she figures suicide is the only way out. But Mr. Brown (Richard Conte, excellent as the 'last-name only' control freak) is as omnipotent and omniscient as a head pit boss in Vegas, taunting and manipulating every one around him with an unsettling equanimity. He tells Diamond, who is virtually powerless to do anything but temporarily hold the murderous Brown and his men on trivial charges, that \"the busboys in his hotel\" make more money than he does. Even Brown's right hand man, the hearing impaired McClure (Brian Donlevy)is mercilessly ridiculed for his second tier status. And Brown is obsessed with his prowess with women as Diamond is with capturing him and wooing his moll. The film is filled with risque sexual allusions as wild as anything from director Sam Fuller. In one scene, Brown manuevers around his girl, stopping briefly at her lips, but then dropping out of frame, seemingly down past her waist. And Diamond cavorts with a \"burlesque\" dancer (with a heart of gold, natch) who appears in a skimpy outfit that is titillating even by today's television standards. But the most ribald bits to make it past the censors involve Brown's bickering henchmen, Fante and Mingo. Fante, played by the aquiline Lee Van Cleef, appears to be a typical hood, but midway through the film the lights come up in a bedroom where the two men have been sleeping in remarkably close quarters. Later, sequestered in a mob-hideout, the two engage in thinly-veiled homoerotic banter that will leave you howling. As will some of the other scenes -- torture by drum solo, a Casablanca inspired finale. Throughout the picture Brown and Diamond dance around one another sans gene, to the sound of gunshots and acid-tongued banter. \"The Big Combo\" is taut, gutter entertainment, delivered in precise black and white. Even if you do watch it on DVD.",
         "Here is yet another gem from the forgotten noir vault. Director Joseph Lewis trades in the quasi-cinema verite style of his GUN CRAZY(1950) for strictly in-studio work and still hits the jackpot. Cinematographer John Alton works his customary chiaroscuro artistry on a fairly straightforward tale of one frustrated but determined police detective longing to collar one supremely confident crime boss. Cornel Wilde plays the cop with stolid righteousness (although the lawman isn't above trysting with a leggy striptease artist). But the filmmakers put the main focus on the calculating yet tortured (and torturing) mobster played by Richard Conte. Conte, spitting out many of his lines with measured bile, is brilliant: a smug, know-it-all killer backed by the ever-ready menace of Lee Van Cleef and the studied goofiness of Earl Holliman. (As written, these two bring a very special dynamic to post-World War II crime melodrama). Brian Donleavy is on hand as a washed up but still scheming mob kingpin. And Jean Wallace plays the high-falutin' moll who yearns to go back to her world of piano recitals and afternoon teas but who just can't get enough of Conte's sinister mojo. This low budget but highly effective noir makes an excellent double feature with another cheap but powerful film of the genre, BEHIND LOCKED DOORS. Both films are highly recommended.",
         "This is one of the finest of film noirs, unjustly forgotten. John Alton's black-and-white cinematography is brilliant, smoothly playing with light and darkness while dazzling our eyes. This might be Joseph Lewis' best film (it's a hard choice) and the cast is amazing. Fun to see Lee Van Cleef and Earl Holliman play (probably) gay hit men; Brian Donlevy in an unusual supporting role provides heft; Richard Conte is a great, great villain. And Jean Wallace is luminous in the femme-fatale-turned-good role. Catch it if you can.",
         "Cornel Wilde plays a police detective obsessed with bringing down crime lord Mr. Brown (Richard Conte), while hoping at the same time to win the affections of Conte's girl, Jean Wallace, in this tremendously atmospheric noir from 1955. The noir genre wouldn't last much longer (many contend that 1958's \"Touch of Evil\" is the last true noir), but it went out with a bang, giving us some of its best examples (this, \"Kiss Me Deadly,\" \"On Dangerous Ground\") in its last years. Wilde plays detective Leonard Diamond like a man coming apart at the seams. His determination to bring an end to Brown's reign feels as if it's fueled by personal motivations as much as by a sense of justice. This ambiguity in the hero's actions adds to the rotten atmosphere created by director Joseph Lewis, in which the bad guys often have more allure than the good ones. Richard Conte certainly has magnetism to spare; his monotone, machine-gun patter when belittling Diamond for being a \"little man\" nearly makes you forget that Wilde towers over Conte whenever they're in the frame together. And, despite his chauvinist treatment of her, one can understand why Jean Wallace's character would be drawn against her will to the more virile Conte than to the \"impotent\" Wilde. Indeed, the question of manhood -- who has it and who doesn't -- is central to \"The Big Combo.\" It's a theme common to the genre, but is given one of its most overt treatments here. In this twisted world, the ability to inflict pain -- be it mental, emotional, physical or sexual -- is a measure of one's ability to \"be a man\" and make it in the world. Those who aren't man enough, like Mr. Brown's gay henchmen or right-hand man, McClure (played with just the right amount of vulnerability by Brian Donlevy), are destroyed. \"The Big Combo\" boasts arresting black and white images, and a number of thrillingly memorable set pieces (let's just say that imaginative and recurring use is made of a hearing aid). It doesn't beat its kissing cousin from the same year, \"Kiss Me Deadly,\" in my book, but it's an awfully fun ride. Grade: A",
         "Police Lieutenant Leonard Diamond is a driven man; he has seen the Organisation grow in strength daily with Mr Brown at its head. He has seen innocents being sucked into crime by the syndicate and he has had enough. With his expenses spiralling out of control, he is put under pressure to close his investigation but his anger at Brown and his love for his girl, Susan, keeps him going. A chance discovery of a mysterious woman called Alicia starts a trail of information that offers Diamond the chance to cut off the head and kill the snake if, that is, he can stay alive long enough to do it. Although it has been many years since I first saw this film it has stayed with me ever since, a classic crime thriller with elements of noir and some very memorable moments. The basic plot is about a crime syndicate and the cop who is trying to bring it down and this is very well done throughout. The plot is a bit of a mystery in this regard as Diamond tries to build a puzzle with most of the pieces missing but the plot is only a part of this film working as well as it does. One of the main factors making it so good is the consistently tough tone of the material that can be seen in many ways. It has all the usual stuff in the tough characters spouting quotable dialogue with the rat-a-tat-tat rhythm of a tommy gun but also has many tough scenes of brutality, my favourite being the unforgettable execution that takes place in total silence \u0096 the perfect conclusion to a scene that had been built up with such tension. The film adds to this with elements more suited to noir than gangster movies. The \"hero\" is a deeply flawed man driven more by hate than righteousness, unable to get Brown's girl he turns to a low rent show girl (although it is clear that she is a prostitute) meanwhile we have corruption within the authorities hinted at \u0096 it is all nicely twisted, not quite a fully blown noir but it takes elements and blends them well to produce a superb mix. The cast match this with some great performances. Conte gets the headlines because he gets the cool character and the toughest dialogue but for me it is Wilde that makes the film his own with a convincing portrayal of a man who is driven by hate as much as love until, finding neither, he uses a \"lesser\" woman to satisfy his lust \u0096 only for it to sink him deeper into apparent self-loathing. He is a bit wild-eyed at times but generally he gets it spot on with a complex performance that says as much with his expressions as he does with his dialogue. Donlevy is good in a small role and the female characters are well done (for different reasons) by Wallace and Stanton. Lee Van Cleef was a surprise find in a minor role but really the film belongs to Wilde and Conte who really go to town with the chance. Overall this is not a normal crime syndicate thriller as the title suggests, but nor is it a traditional noir. Instead it is a fine blend of the two with the best elements of each working to produce a classic crime thriller with atmospheric direction, tough dialogue, brutally memorable scenes and great performances. Complex characters and a morally ambiguous hero only helps the film's impact making this one well worth hunting down (can you believe it has only had a few hundred votes on this site? I despair.)",
         "Allied Artists which was Monogram Studios and mostly noted for the Bowery Boys gave us The Big Combo and they put together a stylish cast for this noir thriller. The cast is so good they cover up a lot of holes in the story. The antagonists in this film are honest police lieutenant Cornel Wilde against ruthless syndicate chief Richard Conte. Wilde is doggedly determined to get Conte who's an article as slick as they come. His persistence reminds me a lot of Columbo without the humor. Conte took over from a former syndicate chief who took a Johnny Torrio like 'retirement' to Sicily. Or what exactly is the real story there and who's this mysterious Alicia that throws a scare into the normally unflappable Conte? Wilde also has a personal interest in another way as he's kind of crushing out on Jean Wallace who's Conte's main squeeze. There's a club stripper played by Carolyn Jones who's sweet on Wilde and pays for it with her life. The Big Combo has made the list for cinema of gay interest because of the roles of Earl Holliman and Lee Van Cleef as a pair of gay trigger men who work for Conte. It's something that during the Fifties only a small studio like Allied Artists would have on screen. Today their relationship is rather obvious. The parts are much greater than the whole and basically what Conte has done is pull a syndicate coup d'etat. But personally as the story unfolds he did a rather sloppy job in covering it up. Rounding out the cast is syndicate banker Brian Donlevy and Wilde's police superior Robert Middleton. It's a nice noir thriller, but it should have had a much tighter story.",
         "The storyline centers about a persistent cop(Cornel Wilde)who tracks down a mobster(Richard Conte) and his henchmen (Brian Donlevy,Lee Van Cleef and Earl Holliman). He's helped by the gangster's girlfriend and one deputy(Robert Middleton). The movie has likeness to noir cinema of the 40s and 50s that played Robert Mitchum, Kirk Douglas and Glenn Ford but here is B series. In the film there are action, raw drama ,suspense, murders and is very interesting. Interpretation by Cornel Wilde and Jean Wallace, marriage in real life, is magnificent, the evil racketeer Richard Conte is top notch and his underlings Donlevy, Van Cleef and Holliman are of first rate. Cinematography by John Alton is extraordinary ,setting of lights and shades depict this type of cinema and Alton and Nicholas Musuraca are the principal photographers. David Raskin music, being recently deceased, is nice and atmospheric. The motion picture is well directed by Joseph H. Lewis Rating : very good, 7,5/10. The flick will appeal to noir cinema fans. Well worth watching.",
         "A very good gangster flick and evocative film-noir directed by Joseph H. Lewis. A zealous cop(Cornel Wilde) seeks the aid of a gangster's(Richard Conte) ex-girlfriend(Jean Wallace)in bringing down a crime syndicate. Conte's character is relentless as he rules his corrupt world with murder, gunplay and torture. Lee Van Cleef and Earl Holliman are his minions and Brian Donlevy is a handicapped mentor of sorts. Supporting cast features Helen Walker and Robert Middleton. Terrific lighting and photography make this an exceptional crime drama where shades of gray makes THE BIG COMBO a notch above the ordinary. Note:off-screen Wilde and Wallace are Mr. & Mrs.",
         "It is surprising that the brilliance of this film has not been adequately recognised by the viewing public or the critics. Probably inspired by the prototypical rogue cop in Fritz Lang's \"The Big Heat\", this film features the crusade of one man - Lieutenant Diamond (Cornel Wilde in a super performance) to pin down Richard Conte's smooth-tongued gangster. Struggling to keep away the departmental bureaucracy, he battles singlehandedly against organised crime with a devotion to duty bordering on the obsessional (\"It's my sworn duty to push too far\"). Despite the absence of any big name in the cast, this film presents all the elements that we have come to love about American film noir - great lighting and photography, tight script (\"First is first, and second is nobody\"), a great storyline, and some superb performances (Susan Lowell as a society girl - the gangster's moll - is ravishing). Watch this film. It's time it got recognition amongst the greatest films to come out of Hollywood. Ever."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Film-Noir",
         "Thriller"
      ],
      "productionCompanies": [
         "Security Pictures",
         "Theodora Productions"
      ],
      "summaries": [
         "Police Lt. Diamond is told to close his surveillance of suspected mob boss Mr. Brown because it's costing the department too much money with no results. Diamond makes one last attempt to uncover evidence against Brown by going to Brown's girlfriend, Susan Lowell.",
         "The Police Lt. Leonard Diamond of the 93 Precinct is obsessed to find evidences against the hoodlum Mr. Brown and unsuccessfully exceeds the budget after four years of investigation with his partner, Detective Sam Hill. Police Capt. Peterson orders him to stop the investigation, telling that his obsession is personal since he has fallen in love with Brown's mistress Susan Lowell. But Susan tries to commit suicide and Diamond convinces his chief to follow one last lead, the name Alicia babbled by Susan in the hospital. The powerful Mr. Brown is mad with Diamond's investigation and sends his gangsters Joe McClure, Fante and Mingo to try to stop Diamond. But the reluctant lieutenant insists in his pursue and the criminals decide to kill him. However they murder Diamond's lover Rita by mistake. Now the obsession of Diamond becomes revenge and he will not stop until Mr. Brown is sent to justice.",
         "A police lt. is ordered to stop investigating deadly crime boss Mr. Brown, because he hasn't been able to get any hard evidence against him. He then goes after Brown's girlfriend who despises him, for information instead."
      ],
      "budget": 0
   },
   "movielensId": 3292,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1955-02-15",
      "dvdReleaseDate": "2000-02-01",
      "directors": ["Joseph H. Lewis"],
      "runtime": 84,
      "movieId": 3292,
      "title": "The Big Combo",
      "mpaa": "",
      "actors": [
         "Cornel Wilde",
         "Jean Wallace",
         "Brian Donlevy",
         "Richard Conte",
         "Lee Van Cleef",
         "Earl Holliman",
         "Robert Middleton",
         "Helen Walker",
         "Jay Adler",
         "John Hoyt",
         "Ted de Corsia",
         "Helene Stanton",
         "Roy Gordon",
         "Baynes Barron",
         "James McCallion",
         "Tony Michaels",
         "Rita Gould",
         "Bruce Sharpe",
         "Michael Mark",
         "Donna Drew",
         "Brian O'Hara",
         "Steve Mitchell"
      ],
      "imdbMovieId": "0047878",
      "originalTitle": "The Big Combo",
      "genres": [
         "Drama",
         "Action",
         "Thriller",
         "Crime",
         "Mystery"
      ],
      "youtubeTrailerIds": ["QShabLiL1lA"],
      "plotSummary": "Police Lt. Leonard Diamond vies to bring a clever, well connected, and sadistic gangster to justice all the while obsessing over the gangsters' girlfriend.",
      "tmdbMovieId": 22342,
      "avgRating": 3.65267,
      "releaseYear": "1955",
      "numRatings": 131,
      "posterPath": "/8AeMWtMLZVeGeSGlhQXGMxJCqzo.jpg"
   }
}