{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0118882",
      "video": false,
      "title": "Conceiving Ada",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Ada Augusta Byron King, Countess of Lovelace",
               "gender": 1,
               "credit_id": "52fe49b59251416c750d0c4d",
               "name": "Tilda Swinton",
               "profile_path": "/eGNo9qwlunvAi4kCVUEFtQFM5X.jpg",
               "id": 3063,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Emmy Coer",
               "gender": 0,
               "credit_id": "52fe49b59251416c750d0c51",
               "name": "Francesca Faridany",
               "profile_path": null,
               "id": 171733,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Sims",
               "gender": 2,
               "credit_id": "52fe49b59251416c750d0c55",
               "name": "Timothy Leary",
               "profile_path": "/m7Y9VOYEpqc1KUyhVbRJ8gEzGEF.jpg",
               "id": 91431,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Lady Byron / Mother Coer",
               "gender": 1,
               "credit_id": "52fe49b59251416c750d0c59",
               "name": "Karen Black",
               "profile_path": "/xKtsATh6T64NJfE1io1AnofnFRi.jpg",
               "id": 8963,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe49b59251416c750d0c5f",
               "name": "Lynn Hershman Leeson",
               "profile_path": "/jE1eBrttgiI6Hd21SkMRPaZ9K9v.jpg",
               "id": 213613,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe49b59251416c750d0c65",
               "name": "Lynn Hershman Leeson",
               "profile_path": "/jE1eBrttgiI6Hd21SkMRPaZ9K9v.jpg",
               "id": 213613,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe49b59251416c750d0c6b",
               "name": "Henry S. Rosenthal",
               "profile_path": null,
               "id": 381120,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "584c85d19251411e350036bf",
               "name": "The Residents",
               "profile_path": null,
               "id": 1316741,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 0.005797,
      "production_countries": [],
      "id": 96484,
      "vote_count": 0,
      "budget": 0,
      "overview": "Emmy Coer, a computer genius, devises a method of communicating with the past by tapping into undying information waves. She manages to reach the world of Ada Lovelace, founder of the idea of a computer language and proponent of the possibilities of the \"difference engine.\" Ada's ideas were stifled and unfulfilled because of the reality of life as a woman in the nineteenth century. Emmy has a plan to defeat death and the past using her own DNA as a communicative agent to the past, bringing Ada to the present. But what are the possible ramifications?",
      "similar": [
         258480,
         27586,
         370663,
         401898,
         244772,
         12793,
         858,
         112160,
         141,
         634,
         376867,
         394117,
         242224,
         17130,
         10818,
         11421,
         43923,
         152532,
         340485,
         250124
      ],
      "original_title": "Conceiving Ada",
      "runtime": 85,
      "poster_path": "/cOOwzpwb36rjJefkQStBu6frUQn.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1999-02-19",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.lynnhershman.com/ada/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Lynn Hershman-Leeson"],
      "runtime": 85,
      "synopsis": null,
      "writers": [
         "Lynn Hershman-Leeson",
         "Eileen Jones"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118882/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjI4NzQzMDM2NV5BMl5BanBnXkFtZTcwOTE5OTQyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Tilda Swinton, Francesca Faridany, Timothy Leary | See full cast and crew »"],
      "reviews": [
         "Many days after seeing Conceiving Ada, I am still in awe that any group of people would spend so much time to make such an atrocious film. No one ought see this film in hopes of learning anything of consequence about Ada Lovelock, her colleagues or the product of her endeavors. Likewise, no one ought to see this film in hopes of being entertained. As a sci-fi film, this would unquestionably be a horrendous failure. Somehow, the main character manages to bring the past to life and interact with it on her personal computer--with the advice and encouraging words of Timothy Leary. I doubt anyone could suspend their disbelief enough to keep this from seeming absolutely absurd. As a drama film, this would unquestionably be a horrendous failure. Somehow, the writer/director manages to fill eighty-five minutes with constant, unnecessary, annoying and trivial drama over essentially nothing. I doubt that anyone could feel that all the drama in the film serves only as an irritating distraction. I find it difficult to fully express my degree of contempt for Conceiving Ada. The circumstances under which I saw it forbid me from leaving the theater but there is no question that I would have otherwise. I am still angry that I wasted the time that it took to see it. Only that I might more effectively criticize this movie, I wish that I were more articulate.",
         "I'm the sort of person who went down to the local library and read books on Babbage's difference engine whilst my schoolmates were playing football etc.. So, if there is any such thing as a target audience for this film, then I guess I'd probably be included in that. Maybe I just need to watch it again. A previous reviewer mentioned not to watch this film whilst being tired. Maybe that was my mistake. I tried my best to enjoy this film, and there are aspects of it that I do like, but overall I found it amateurish and quite plodding. Being somewhat of a self confessed computer nerd, I just can't help but pick up on the exact time frame when the movie was actually made, and how the employed graphics reflect that time (i.e. 1997). Having played games of the era c.f. \"Mind Grind\" to cite one example, this film cannot escape that 16-bit colour low res multimedia explosion of that time. Now thankfully this has somewhat lessened in more recent years in the gaming world at least, in favour of actual game play. Having to resort to watching this movie via a German FTA satellite channel (as I don't think it's ever been aired on UK FTA TV, well not recently anyway), I was mildly amused to see the end credits note Gottdog (God dog) had 4 people working on it's design. Maybe it's mean spirited of me to be amused by this, given that ten years have elapsed since the movie was made, nevertheless the end result makes movie graphics from the eighties look good by comparison. But, as for the main story, I agree that the format isn't the best idea. Like others I agree that Ada deserves a film without the sci-fi angle, and a more straightforward biographical approach would perhaps be better suited to covering the life story of this remarkable lady. There are fundamental mistakes that undermine my enjoyment of this movie. First of all the underlying idea that somehow lost real-world information from the past can be accurately reconstructed through some sort of extrapolation via software based intelligent agents, seems somehow ludicrous. Also, the theme running through the movie that a computing device can indeed predict the mechanics of all things through the course of time (e.g. the winds) is now known not to be the case. OK, so the Victorians may have held this view, but the 20th century works of Gödel proving that no mathematical system can be complete, Turing's works on the limits of computability, not to mention chaos theory and quantum mechanics, have all completely undermined these ideas, which seem central to how the modern day researcher's software is supposed to work. Finally, the clicking of the mouse in the air to mean \"programming\" is also just plain wrong, as previously mentioned. This film maybe could have been OK, but at least some technical and scientific consultation would have given the film some much needed credit in the believability stakes. I won't forget the film though, as like \"Pi\", it is clearly a unique work, but with too many fatal mistakes for me to truly enjoy it, 3/10 from me.",
         "This textured and thoughtful film tells the story of Ada Lovelace whose 19th century work provided the foundation upon which computer language is built. Her genius thwarted by social convention, Ada gets a second chance at immortality when a 20th Century computer genius reaches back in time to communicate with her. Both the 19th and 20th Century female geniuses must find a way to be true to their work, the driving passion behind each of them and raise their children. As a working mother I found these issues well presented. As someone who is in awe of computers and genius, I found the intensity of the performances inspiring.",
         "The approach this film takes to storytelling is interesting, but somewhat confusing. I've never seen a cross between a science fiction film and a period film set in the Victorian era, so this was a refreshing change of pace; but many aspects of it were not handled well. The way that a person in the present can communicate with someone in the past isn't outlined very well, although I've only seen this movie once and maybe I need to see it again. Communicating with someone in the past has something to do with something called \"DNA memory\" which I don't quite understand. I consider myself to be fairly well-informed about the general concepts of computer science but the way that Emmy explained her interfacing with individuals and memories from the past seemed quite cryptic and unintuitive... I don't really mind the fact that this isn't explained well--plenty of unexplained, far-fetched science fiction premises can still yield a viewer's suspension of disbelief--but the contact between present and past seems to be taken in stride rather than as something utterly magnificent. If I suddenly found out how to talk to my favorite historical figure and see his or her memories on a screen, I would be quite a bit more excited than Emmy, her husband, or her strange mentor. This is one of the film's biggest incongruencies, and it destroyed my suspension of disbelief. Although I do appreciate the fact that the director attempted to integrate the digital technology (the uses of which Ada Byron predicted) into the film, it didn't seem to work that well at all. The backgrounds looked very two-dimensional (partially because no characters ever travelled much within a shot, and very little tracking and panning was done to give the environment a three dimensional feel, though such camera movements must be nearly impossible when the digital environments are two-dimensional to begin with). The fire effect in particular looked incredibly fake as the rest of the digital environment didn't respond properly to the flickering of the flames, so altogether the cinematography in the Victorian era was horrendous and reminded me of something from old CD-ROM adventure games like Phantasmagoria or Gabriel Knight II. The portrayal of Ada's character was very well-done, however, effectively displaying both Ada's desires and modern ideas as well as her imprisonment by social standards and the people around her. In particular, her final speech near the end of the film is very well done. One of my complaints about the film, however, is that none of the male characters really seem to be fleshed out at all; they're all very two-dimensional, without too much depth or personality, which really makes the film seem very gender biased. Although I did enjoy the film overall and I thought the blend of science fiction and period filmmaking was a novel idea, I really think that this could've been a much better experience if the science fiction premise had been dropped entirely and the movie had just been a period film. I actually like science fiction very much and I'm generally not interested in period films dealing with repression and social mores, but Ada's character is particularly interesting because her interests are so modern--they have so much application to today's world and today's ideas. I think that by adding the sci-fi premise to the film weakened it overall; with the ubiquitousness of the Internet, today's audiences generally know the ways in which computers can be used and this film's hasty, fleeting vision of someone in the present communicating with someone in the past only adds confusion to the film, not a sense of wonder about Ada's conceptions and the potential of virtual reality and artificial intelligence. I rather would've spent more time learning about the different kinds of ideas that Ada had from her point of view. As it is, the film spends so much time divided between the present world and Ada's world that it doesn't really have enough time to fully develop either of them.",
         "Sounds like an oxymoron right there. Contradictory as it may seem, it's literally that: Travels back in time, capturing a moment in history in \"real\" time -- \"Mo-memory\" captured and SAVE'd. Computer enthusiasts, come ye one and all -- this includes computer graphic artists, programming experts. Mind you, leisurely-paced is truly so -- nothing's really hurried. If you want action -- it's very much simply intellectual intercourse. It's not Hollywood intrigue -- it's mind game -- not tour de force like \"Brainstorm\" -- yes, L-E-I-S-U-R-E-L-Y-paced -- nothing really hits you over the head. It's intriguing -- but NFE (Not For Everyone). Some might think it's too slow or seemingly just chatters and undramatic -- 'less you're a computer literate, -enthusiast, ever-fascinated by Tilda Swinton (no matter how long or short her appearance is), or simply love a film however it may be delivered. See it with an open mind (Empty your cache before you go). There are nuances of little indications: a computer-minded person could very well be, at times, lacking in \"real\" emotions and feelings -- the human touches. E.g., Ada Byron King (Tilda Swinton) said to the main character Emmy, \"Can you save me?\" and Emmy (Francesca Faridany) said, \"yes\" and hit SAVE. Or, to take this further, one might see it as a comparison of then and now: what may seem difficult and impossible for a woman to break through barriers to be recognized (as the mathematical genius that Ada was) then, is fairly easy and accessible now, as Emmy hits a key and it's done -- she will be recognized for what she has researched, programmed and discovered! Ah, there's some insights into the life of a computer couple -- some diet suggestions: they're presented as a certain COLOR day of the week, e.g., bananas are included on Yellow day, then there's BLUE day menu, WHITE day entree. (Are you curious?) Written and directed by Lynn Hershmann-Leeson, it does feel like a story told from a woman's perspective. Definitely showed the \"obsessive\" pursuit of what the main character (perhaps autobiographical?) is after in her participation and wanting to succeed in this M.I.T. \"ALIVE project\". You may say this is a love story -- love in different angles juxtaposed on the computer grids. There's also a dog of an interest called Charlene. Its ultimate gist of the whole event could be summed up in what Ada said -- that we should not be hung up in what she, the past, thinks and tried to immortalize her memory -- we need to move beyond and be in touch with the present and feel ALIVE and continue to discover things\u0085 When Emmy was talking with her mentor (Timothy Leary portrays) who appeared on the wall size screen, it brought to mind Dennis Potter's \"Cold Lazarus\" -- a stylish scientific tale with also an advance techno challenge theme of capturing a specific person's memory and \"SAVE\" -- keeping the memory ALIVE and recallable. The specific person is namely Albert Finney's character in the prequel \"KARAOKE\". If you enjoy Albert Finney and relish Dennis Potter's amazing storytelling, you must not miss \"KARAOKE\" nor \"Cold Lazarus\". This film also reminds me of Douglas R. Hofstadter's books -- 1) \"Metamagical Themas: Questing for the Essence of the Mind and Pattern (An Interlocked Collection of Literary, Scientific, and Artistic Studies)\", and 2) his Pulitzer Prize winner \"Godel, Escher, Bach: An eternal Golden Braid (A Metaphorical Fugue on Minds and Machines in the Spirit of Lewis Carroll)\". There's also 3) Rudy Rucker's \"The Fourth dimension -- A Guided Tour of the Higher Universes\". All three are worthwhile books -- fun and intrigue -- if you're so like-mindedly disposed. A caveat: If you're tired -- unless you're a computer \"nerd\" -- you probably don't want to view this movie yet, as the seemingly flat tone and leisurely pace until Tilda appears may not pick you up. If you're curious and patient, and you love the idea of what computers can do, go for it, this can be enjoyable and insightful for you. Other Tilda Swinton gems that has more of her: \"Orlando\" 1992 written and directed by Sally Potter, and \"Female Perversions\" 1996 written and directed by Susan Streitfeld, both for mature audiences.",
         "Expecting a combination of scifi and period film about Ada Lovelace, Charles Babbage, the history of computers, etc, I was disappointed by this movies nonsensical pseudoscience and mixture of real and fabulous history. It gives the impression that its writer (Lynn Hershman-Leeson) has no real understanding of the Math, technology, or history constituting the film's subject, but is working instead from a sort of fuzzy artistic impression of them. This hits a sore spot with me, as I've long been irritated by the tendency of the arts to glom onto and awfully misuse science terms and ideas to the point of confusion, eg: Emmy Coer: \"information waves have a half-life\", Ada: \"I'm not at all certain that half a life is better than no life at all\". This movie does worse than fail to entertain - it misinforms. The only redeeming value I can imagine for it is that it might attract a viewer to learn about the subject it so badly distorts. It's more likely, I think, to promote a superstitious perception of science and technology of any degree of advancement as indistinguishable from magic.",
         "Spoilers herein. One can fault the dreary focus on women's victimization, as if something like that can be imposed on any past. And one can be annoyed at the very low production values, and goofy acting by all but Swinton. Also, everyone involved seems to have had multiple, profound misunderstandings about what constitutes software, concepts, coding and virtuality. Among the howlers are clicking as programming and photography as somehow capturing avatars. And code as resembling greek symbols. This is even worse than `Pi' in its pseudoscience. But if you can see through all those indications of ignorance, there is the kernel of something intelligent here. Some have criticized the modern story as a clumsy framing device. But I see it as a class of folding, something along the lines of `French Lieutenant's Woman,' as transformed by popular versions like `Possession.' At least I want to think so because Tilda is such an intelligent actress and the Ada story is so fascinating. What this petty filmmaker thinks is interesting is that a brilliant, energetic mind was exploited and ruined by the accident of gender \u0096 sort of an Alan Turing with breasts. What is more interesting in the story is how Ada conflated adventures in mental exploration in narrative with mathematics and extreme promiscuity. In fact, the story is much like John Nash's but without the bisexuality. Math as orgasmic, code as music, virtual projection as invented history, redheads as having the power to use lust to bend reality. Some clever ideas wrapped in stupid expression. Well, at least there's something. Ted's evaluation: 2 of 3 \u0096 Has some interesting elements.",
         "I found this movie important, enthralling, and maddening. Important, because Ada Byron King, Countess of Lovelace, deserves iconic status today. After all, she was the first computer programmer on record. Ada's character is well-portrayed by Tilda Swinton, who gives her both excellent clarity and a fascinating wild side. The backdrops on the past sections are recognizably digital, but lushly colorful. The maddening part comes from the modern sections, where we are given a modern programmer who contacts Ada through her computer. This narrative drags the movie down, because it's just not as interesting as Ada. The dragging bothered me, because I really wanted to love this movie. Throughout the movie, women are explored as complex characters, while men are rendered as arbitrarily cruel caricatures. Oh, well, turnabout is fair play, I suppose, but it didn't enhance my appreciation of the film. Overall, I'd say, see this film. Ada Lovelace is important to our generation. Grit your teeth and sit through whatever you don't like.",
         "Ok, first off *DO NOT* watch this movie if your idea of an independent film is something starring Johhny Depp or Hugh Grant. That said, *DO* watch this movie if you liked 'Pi,' or other movies that were shot on almost no budget, but still somehow manage to mix cinematic exploration of abstract concepts with elements of science fiction. Don't expect to understand this movie the first time you watch it, but after two weeks of mulling it over as you try to get to sleep at night, it'll come to have more meaning.",
         "Conceiving Ada is an odd, but ultimately somewhat rewarding film. I had picked it up largely based on the presence of Tilda Swinton, not expecting much from it beyond her performance. I was pleasantly surprised. The film has a somewhat awkward framing device of a modern computer scientist who discovers a means of communicating with the past. Through the eyes of the modern scientist, we see the life of Ada Lovelace, the world's first computer programmer. At times, the approach gives a feeling of nothing so much as a PBS or BBC low budget documentary on Lovelace's life, particularly the way in which it is divided up into snippets. Furthermore, the science behind the communication with the past is preposterous, and requires a serious suspension of disbelief. This is not hard science fiction, folks, despite the real world elements. The cameos by Timothy Leary are equally distracting, adding nothing to the plot. However, both the woman who plays the modern scientist and Tilda Swinton manage to be engaging. The film is definitely worth a look."
      ],
      "genres": [
         "Drama",
         "Fantasy",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Hotwire Productions",
         "Outpost Studios"
      ],
      "summaries": ["Emmy Coer, a computer genius, devises a method of communicating with the past by tapping into undying information waves. She manages to reach the world of Ada Lovelace, founder of the idea of a computer language and proponent of the possibilities of the \"difference engine.\" Ada's ideas were stifled and unfulfilled because of the reality of life as a woman in the nineteenth century. Emmy has a plan to defeat death and the past using her own DNA as a communicative agent to the past, bringing Ada to the present. But what are the possible ramifications?"],
      "budget": 0
   },
   "movielensId": 3293,
   "movielens": {
      "languages": [""],
      "releaseDate": "1999-02-19",
      "dvdReleaseDate": "2000-02-01",
      "directors": ["Lynn Hershman Leeson"],
      "runtime": 85,
      "movieId": 3293,
      "title": "Conceiving Ada",
      "mpaa": "NR",
      "actors": [
         "Tilda Swinton",
         "Francesca Faridany",
         "Timothy Leary",
         "Karen Black"
      ],
      "imdbMovieId": "0118882",
      "originalTitle": "Conceiving Ada",
      "genres": [
         "Science Fiction",
         "Drama",
         "Fantasy"
      ],
      "youtubeTrailerIds": ["_viX3XfalVk"],
      "plotSummary": "Emmy Coer, a computer genius, devises a method of communicating with the past by tapping into undying information waves. She manages to reach the world of Ada Lovelace, founder of the idea of a computer language and proponent of the possibilities of the \"difference engine.\" Ada's ideas were stifled and unfulfilled because of the reality of life as a woman in the nineteenth century. Emmy has a plan to defeat death and the past using her own DNA as a communicative agent to the past, bringing Ada to the present. But what are the possible ramifications?",
      "tmdbMovieId": 96484,
      "avgRating": 2.72727,
      "releaseYear": "1999",
      "numRatings": 33,
      "posterPath": "/cOOwzpwb36rjJefkQStBu6frUQn.jpg"
   }
}