{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "redneck",
            "id": 10250
         },
         {
            "name": "psychotic",
            "id": 157701
         },
         {
            "name": "video nasty",
            "id": 189921
         }
      ],
      "imdb_id": "tt0074455",
      "video": false,
      "title": "Eaten Alive",
      "recommendations": [
         27726,
         28177,
         13555,
         27346,
         24274,
         28172,
         39342,
         26680,
         29343,
         27813,
         44247,
         37936,
         40229,
         55538,
         26503,
         47957,
         27495,
         13553,
         39916,
         40969
      ],
      "backdrop_path": "/c3muvxHlVOh9Fic0zYT8YGizMPG.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Judd",
               "gender": 2,
               "credit_id": "52fe43f99251416c91000d59",
               "name": "Neville Brand",
               "profile_path": "/tTLqiCL0M4ni0fhlRh8353ynbXw.jpg",
               "id": 9112,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Harvey Wood",
               "gender": 2,
               "credit_id": "52fe43f99251416c91000d5d",
               "name": "Mel Ferrer",
               "profile_path": "/9vYGnxKzPFWiyKbLnjQ9GvgaV2g.jpg",
               "id": 3754,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Miss Hattie",
               "gender": 0,
               "credit_id": "52fe43f99251416c91000d61",
               "name": "Carolyn Jones",
               "profile_path": "/2MiUzB4xpwjFQhAq3aF5VNxsNA.jpg",
               "id": 19109,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Faye",
               "gender": 1,
               "credit_id": "52fe43f99251416c91000d69",
               "name": "Marilyn Burns",
               "profile_path": "/bEPYa5U36XHiTBdZqZkcRq3cdPP.jpg",
               "id": 27798,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Roy",
               "gender": 2,
               "credit_id": "52fe43f99251416c91000d6d",
               "name": "William Finley",
               "profile_path": "/eeJvY0Mz9TK97aZVF1HeOOX8yRh.jpg",
               "id": 97561,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Sheriff Martin",
               "gender": 2,
               "credit_id": "52fe43f99251416c91000d71",
               "name": "Stuart Whitman",
               "profile_path": "/bAtT3otGuwA8hG07lQSqTt7N1jq.jpg",
               "id": 38761,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Buck",
               "gender": 2,
               "credit_id": "52fe43f99251416c91000d65",
               "name": "Robert Englund",
               "profile_path": "/h4LEgXsvbfmIbwktkiGWNwwtr8q.jpg",
               "id": 5139,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Clara",
               "gender": 1,
               "credit_id": "52fe43f99251416c91000d79",
               "name": "Roberta Collins",
               "profile_path": "/px1c3CgpowpXFWKgFRIrnaT5mYM.jpg",
               "id": 74352,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Angie",
               "gender": 1,
               "credit_id": "52fe43f99251416c91000d75",
               "name": "Kyle Richards",
               "profile_path": "/hgtEhHKs0y6ymMQIwC7RGY1pff4.jpg",
               "id": 15503,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Libby Wood",
               "gender": 0,
               "credit_id": "52fe43f99251416c91000d7d",
               "name": "Crystin Sinclaire",
               "profile_path": "/sJWB43CASa4rMVqTrZBztPaeUg9.jpg",
               "id": 106773,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Lynette",
               "gender": 0,
               "credit_id": "52fe43f99251416c91000d81",
               "name": "Janus Blythe",
               "profile_path": null,
               "id": 99062,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "The Cowboy",
               "gender": 2,
               "credit_id": "52fe43f99251416c91000d85",
               "name": "David Hayward",
               "profile_path": "/jpXtgFQTmwyQt9lnWqYAQEfjWiS.jpg",
               "id": 30619,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43f99251416c91000d43",
               "name": "Tobe Hooper",
               "profile_path": "/rE5TqnAvgaKjWwWZ9AsoU9KcUGU.jpg",
               "id": 10051,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f99251416c91000d49",
               "name": "Kim Henkel",
               "profile_path": null,
               "id": 27797,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 0,
               "credit_id": "52fe43f99251416c91000d4f",
               "name": "Alvin L. Fast",
               "profile_path": null,
               "id": 102950,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f99251416c91000d55",
               "name": "Mardi Rustam",
               "profile_path": null,
               "id": 102965,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 4.22934,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 30062,
      "vote_count": 52,
      "budget": 520000,
      "overview": "A psychotic redneck who owns a dilapidated hotel in the backwater swamps of Louisiana kills various people who upset him or his business, and he feeds their bodies to a large crocodile that he keeps as a pet in the swamp beside his hotel.",
      "similar": [
         948,
         39844,
         9373,
         294963,
         10781,
         68146,
         10212,
         24124,
         8689,
         8692,
         7219,
         10285,
         36647,
         41439,
         36586,
         13885,
         60304,
         23823,
         19908,
         298312
      ],
      "original_title": "Eaten Alive",
      "runtime": 91,
      "poster_path": "/4sz1YFCtLxQJQ5yxsJsmiJRHcMs.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Mars Production Corporation",
         "id": 5017,
         "origin_country": ""
      }],
      "release_date": "1976-12-25",
      "vote_average": 5.1,
      "belongs_to_collection": null,
      "tagline": "Meet the maniac & his friend. Together they make the greatest team in the history of the mass slaughter in...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Tobe Hooper"],
      "runtime": 91,
      "synopsis": "After refusing a request from frisky customer named Buck (Robert Englund) who wants anal sex, the naive and inexperienced prostitute Clara Wood (Roberta Collins) is evicted from the town brothel by the madam, Miss Hattie (Carolyn Jones). Clara makes her way across the local swamp to a decrepit hotel, called the Starlight Hotel, to check into a room for the night where she encounters the scruffy and mentally disturbed proprietor Judd (Neville Brand) and his pet crocodile in the swamp beside the front porch. Upon realizing Clara was a prostitute, Judd attacks her while ranting and raving. When Clara tries to defend herself, Judd stabs her with a pitchfork and feeds her to the crocodile. Some days later, a fractious couple, the outgoing Faye (Marilyn Burns) and her mentally disturbed husband Roy (William Finley), along with their young daughter Angie (Kyle Richards) arrive at the hotel to check in since they are driving across country. They soon experience the trauma of the Angie's persistantly barking and overly curious pet dog being eaten by the crocodile. Faye and Roy take their daughter to their room to try and try to calm her down. The insane Roy decides to shoot the crocodile with a shotgun for eating their dog, but Judd intervenes. During the struggle, Roy shoots Judd in his right leg, but it is revealed that Judd's right leg is a wooden prostetic which he apparently lost years earlier when it was bitten off by his pet crocodile. Judd angrily stabs Roy with a scythe before he is attacked and devoured by the huge crocodile which breaks through the porch railing and swallows Roy whole. After getting Angie to sleep, Faye goes into the bathroom for a bath, however she is interrupted by Judd who begins to beat her. Angie wakes up and runs from the hotel. However, Angie gets trapped underneath the hotel by Judd, who proceeds to tie up Faye in a vacant room where he spends the rest of the movie sexually fondling her while Angie remains trapped under the floorboards of the hotel. That evening, Harvey Wood (Mel Ferrer) and his daughter Libby arrive at the Starlight Hotel seeking information on the whereabouts of Clara, Harvey's daughter who had run away from home several months earlier. Judd calmly denies having ever seen Clara when he is shown a photo of her. Never less, Harvey and Libby check into separate rooms and then leave to try and locate her at Miss Hattie's brothel. Accompanied by Sheriff Martin (Stuart Whitman), Harvey and Libby question Miss Hattie, who lies to them by denying ever seeing Clara (apparently still angry over Clara upsetting her business). Harvey returns to the hotel while Libby stays in town to eat dinner with Sheriff Martin. When Harvey hears Angie's crying underneath the floorboards of the porch, he begins to investigate and is attacked by Judd who stabs him in the neck with his scythe. Judd then drags his dead body to the swamp to be eaten by the crocodile. While Sheriff Martin and Libby are at the local bar having dinner and drinks, Martin kicks out Buck and his sluttish girlfriend Lynette (Janus Blythe) after a fight nearly breaks out between Buck and another local redneck barfly. The pair venture to the hotel, much to the annoyance of Judd who had already warned Buck to stay away from his land. While in their room to have sex, they hear Angie's cries for help. Buck goes to investigate and is pushed off the porch and into the swamp by Judd, where he is quickly eaten alive by Judd's crocodile. Lynette hears the commotion, and goes outside only to be chased by Judd and his scythe into the nearby swamps. She manages to get to a road where she flags down a passing car and gets away. At the same time, Libby arrives back at the hotel and goes up to her room. Judd arrives back also, and opens up the gate for the crocodile to get in under the house so it can eat Angie. Meanwhile, Libby discovers Faye tied up in the room. After freeing her, the two women attempt to leave, however Judd chases them back upstairs where he wounds Faye with the scythe. Libby escapes out a window and begins to help Angie out of the swamp she has managed to get into to evade the crocodile. Judd throws the severly wounded Faye off a balcony and then he attempts to push Angie back into the swamp while struggling with Libby. But at the last second, Faye arrives and pushes Judd over the fence into the swamp, where he is devoured by his pet crocodile. Sheriff Martin arrives at the hotel minutes later to arrest Judd after being alerted by Lynette only to find the bloodied but alive Faye, and the shaken but unwounded Libby and Angie. All that is left of Judd is his prostetic wooden leg floating in the swamp beside the hotel.",
      "writers": [
         "Alvin L. Fast",
         "Mohammed Rustam"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0074455/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU2OTk4OTcyMF5BMl5BanBnXkFtZTgwODQ5MTkzMjE@._V1._CR14.883331298828125,20.533340454101562,297,457_SX214_AL_.jpg",
      "actors": ["Stars: Neville Brand, Mel Ferrer, Carolyn Jones | See full cast and crew »"],
      "reviews": [
         "Tobe Hooper's much maligned follow up to 'The Texas Chainsaw Massacre' isn't half as bad as it's detractors claim. While it certainly isn't as good as TCM, if viewed in the right frame of mind it's probably his second best flick. 'Death Trap' reminds me of Dario Argento's movies. Not in the subject matter, or directorial style, but in the sense that what you're seeing is a filmed nightmare, devoid of logic, but full of memorable over the top images. The sets are cheap and nasty, the acting varies from quite good to plain silly, the \"plot\" can basically be summed up as: people check into a seedy motel and get fed to a pet crocodile by its nutty owner, but you know what? It's still a hell of an entertaining trashy horror movie. Neville Brand ('The Ninth Configuration') gives a gonzo, almost vintage Timothy Carey-like performance as psycho scythe wielding Judd, owner of the one place in town you really don't want to check in to. Horror legend Robert Englund appears as sodomy lovin' white trash local Buck. Also on board are scream queen Marilyn Burns ('TCM', 'Helter Skelter'), cult star Roberta Collins ('Death Race 2000'), the original Morticia (Carolyn Jones), the 'Phantom Of The Paradise' (William Finley), and veterans Mel Ferrer ('The Hands Of Orlac') and Stuart Whitman ('Crazy Mama'). All this and one of the most unconvincing looking killer crocodiles ever seen on screen! Highly recommended.",
         "Eaten Alive (1977) is one of the most overlooked and under-appreciated films. Maybe the critics and fans were disenchanted with it because they were probably expecting a film in the vein of first film Texas CHAINSAW MASSACRE. In many retrospects the films are similar. They both feature dying, old ways of life (privately owned slaughter houses, roadside motels with sideshow exhibits). The film's main character is Judd, the proprietor of the Starlight Hotel and Zoo. Judd is a crazed war vet with broken dreams who's haunted by ghosts from the past. Neville Brand portrays Judd with such an eerie, uncanny flair (his experiences as a decorated WWII vet gives his role an aura of authenticity). A true slice of dying Americana as only Tobe Hooper can tell. The support players are William Finley, Marylin Burns, Stuart Whitman, Mel Ferrer, Robert Englund and an unrecognizable Carolyn Jones (TV's Morticia Addams). This film has been restored for DVD by Elite. Beware of the cheaper DVDs because they are truly ghastly. Strongly recommended",
         "Delirious, surreal, and savage, Tobe Hooper's follow-up to his landmark debut (\"Chainsaw\" for those not in the know), is one of a kind while bearing the same signature stamp he left with his predecessor. A sheer unrelenting onslaught of pure madness, macabre and dark humor. Although not as entirely successful as Chainsaw, \"Eaten Alive\" is one messed up little drive in flick with good performances particularly by Brand as the psycho Inn keeper of \"Starlight Hotel\". Mumbling incoherently through most of his screen time and sputtering gibberish when audible, Neville Brand is eerily convincing. The beginning of this picture owes to Psycho in that you meet a character that you are led to believe is the (no pun intended) titular heroine but is quickly dispatched and we are left with the equally sleazy and\\or oddball residents of the locale like ole' country boy Buck (Englund, who's a hoot) or that oddball couple who's dog gets chomped by the gator that lives in the swamp behind the hotel. It's that kind of movie folks so be aware what you're getting into. Creepy, oddball fun.",
         "`The Texas Chainsaw Massacre' (of course) and `Death Trap' (less obvious already) are the only two films Tobe Hooper should be really remembered for as a horror director. They both are raw and chilling explorations of the angry rural America. The location of this film looks like a giant swampy area, homed by underdeveloped perverted rednecks and other freaks of society. Neville Brand terrifically portrays Judd, the isolated owner of the Starlight Hotel. Judd suffers a bit from the incapability to communicate with people and the guests at his hotel are doomed to die as soon as they enter his facility. He also has a pet crocodile swimming underneath the porch of his hotel, which is a pretty convenient method to get rid of human leftovers\u0085 A poor, rejected prostitute is the first to undergo Judd's murderous rituals. Her relatives soon come to search for her and are doomed as well. In the meantime, the croc feeds on some more unfortunate by passers. Although I regard this as Hooper's second best film, it doesn't come close to the power of TCM\u0085Which kind of gives you an idea of how great I think TCM was! The settings and photography of Horror Hotel (one of the film's a.k.a's) look nasty and utterly cheap. Just as it did in TCM, this actually increases the macabre atmosphere and you constantly feel something wicked is about to happen. The characters \u0096 although pretty imaginative \u0096 aren't as convincing as the Sawyer family but they too seem to come running straight out of a freakshow as well! There's Judd of course, but also a very memorable Robert Englund who plays a retarded yokel with an obsession for anal sex. The scream-queen prototype Marilyn Burns returns as well before disappearing into actress-oblivion forever. The crocodile as well as most other horror scenery looks really cheap, but to me, this only increases the trash-fun value of this film. Highly recommended viewing as far as I'm concerned.",
         "Eaten Alive is a truly bizarre film with an almost nightmarish quality to it. I can't say I particularly loved it, because the lack of lighting often makes it hard to see what is happening. Yet at the same time, the lack of lighting also adds to the murky atmosphere. The motel owners performance is slightly over the top and annoyed me a bit, although he does play his part very well. There are some tense and disturbing moments such as when he's chasing the two women, which are excellently done. However the claustrophobic feel of the film got a little boring in parts and made it slightly hard to follow. Overall, if you like your horror films creepy and bizarre, then this is for you. It has a similar grainy feel to The Texas Chainsaw Massacre, so if you loved that then this will be right up your street.",
         "Well, if you saw The Texas Chainsaw Massacre and were impressed with director Tobe Hooper, your next move might be to view his second film Eaten Alive. I searched all over for a print and finally was lucky enough to find one and see this somewhat forgotten picture. One reason for its seemingly firm place in the ranks of oblivion is its numerous title changes. Notwithstanding all this I found the film and watched it. The film is interesting, bizarre, unbelievable, and disturbing. The setting is just a trifle too unimaginative to be taken for real as is the central character of Judd (for the most part deftly played by Neville Brand). The plot too seems to be making its viewers accept too much for granted without really giving any knowledge of why Judd is the way he is, etc... Despite these shortcomings, the film has some of the truly most horrific scenes filmed. The scene in which Judd tries in vain to goad a young girl from under his hotel out is sheer terror. Other scenes in which he dispatches some of the hotel guests are equally effective. The film has a lot more going for it than its oblivious nature would suggest. It has fine performances, an eerier setting and score, and the taught, tuned terror Tobe Hooper realized in his first great film.",
         "\"Eaten Alive\"(1976),director Tobe Hooper's second and less successful stab at backwoods horror following the success/notoriety of his brilliant \"The Texas Chain Saw Massacre\"(1974)is one of the most bizarre horror movies ever made.The plot revolves around demented motel owner Judd(Neville Brand)who likes feeding his guests to his pet alligator in the swamp outside.With its gory set-pieces and gratuitous nudity,and Neville Brand's over-the-top performance as Judd \"Eaten Alive\" is a truly visceral experience.Great location sets:the dilapidated hotel at the edge of the swamp is so bizarre,that it may as well exist on another planet,or in some alternate insane reality.The acting is very good,Marilyn Burns once again proves that she can emote hysterically and Robert Englund is really convincing as a local-yokel Buck.The film is grainy,even ugly looking at times,so don't expect any polished crap from Hollywood.For me this the best(along with his debut of course!)Tobe Hooper's horror film.A must see for horror fans!",
         "Crazy old Judd (Neville Brand) is the owner of a run down hotel on the edge of a swamp that is home to a massive crocodile. The old coot, a few sandwiches short of a picnic, thinks nothing of feeding his guests to the old croc, after hacking them to death with his huge scythe. Eaten Alive, Tobe Hooper's follow up to The Texas Chainsaw Massacre, was co written by Chainsaw collaborator Kim Henkel, and stars Marilyn Burns, the damsel-in-distress from the '74 horror classic. It even features a scene in which a young woman is chased through the woods by a maniac wielding a large cutting tool. However, this movie fails to capture the intense feeling of terror that Hooper delivered so well with his incredible debut; only in the closing moments of Eaten Alive does he manage anything close to the absolute horror of his first and finest film. Before that, we get a rather dreary hour and a half of loopy old Judd muttering to himself and occasionally offing the odd guest\u0097tipping them into the water for his scaly friend to devour. The realism of Chainsaw is gone, replaced by an almost cartoonish atmosphere; the characters are mostly freakish caricatures, there is a smattering of gore, everything is swathed in garish primary-coloured light, and the old croc is as bad as one might expect from a low budget horror. Tobe also finds time to throw a few fit birds into the mix, and two of them obligingly flip their norks out (and very fine they are too). Eaten Alive is enjoyable on a trashy level, and if this had been directed by anyone other than the director of possibly the finest horror movie of all time, I wouldn't have felt quite so disappointed; but as a follow up to The Texas Chainsaw Massacre, Eaten Alive just didn't impress me enough.",
         "In Tobe Hooper's follow-up to THE Texas CHAIN SAW MASSACRE, Neville Brand is totally out of control! I could not believe my eyes seeing his twitching, nervous, maniacal, laughing psycho performance! He seems to be on some kind of high-powered drug from outer space! Thankfully, his acting is perfectly welcome in this film, where almost every bizarre character seems to be up to something devious. Neville runs a secluded Louisiana hotel on the Bayou where various people show up. He kills them off (with a scythe, pitchfork, etc.) and feeds their dead bodies to his pet crocodile. Marilyn Burns, William Finley and their daughter eventually show up in disguise and are tormented by Brand. Family members and cops show up to search for missing prostitute Roberta Collins and become victims, too. Brand hacks them up while hopping around uncontrollably and laughing with glee. Totally creepy. So is Wayne Bell's music score, which is similar to the one he did for TCM. Good make-up, lots of surprises, Hooper's direction and Brand give this film an edge over it's competition.",
         "A crazy homicidal man named Judd owns a shabby hotel in the Louisiana bayou and when he receives guests he goes out of his way to murder them and feed them to his pet crocodile. Some of these unexpected guests who face this horror that awaits them ranged from a reform hooker, an unfortunate family and the hooker's father and sister who are looking for the missing girl. Tobe Hooper (director) and Kim Henkel (co-writer) the two who brought us one of the most powerful and groundbreaking horror films of all time \"The Texas Chainsaw Massacre\" team up again for their next independent B-grade project: the crzay exploitation piece \"Eaten Alive\". The film's title has been renamed plenty of times by the distributors and also it's been labelled as Hooper's lost movie. It may lack the power, raw intensity and realism that made TCM so nerve wrecking, but this gruesome horror film doesn't hold back on the shocks and sleaze of the typical low-grade horror that filled the late seventies. There's a sheer amount of gore and flashes of nudity evident compared to his previous film. Though, it does come across as more of a comic book horror because of eccentric characters and outlandish setups. The absurd plot doesn't stand out as it's basically taken right off \"Psycho\" and doesn't make too much sense, but the look of the film is terrific and it's high on atmosphere. The cheap sets and swampy terrain with its blankets of fog and wildlife sounds capture such a horrifying and morbid awe and there are some rather uncomfortable scenes that are sick and twisted. It's filled with adrenaline packed scenes of graphic, if comical violence of crocodile munching and graceful blood splattering involving Judd's scythe. These thrilling sequences involve a chase through the swamp, girl under the house and a sudden burst to the climax that ends with a whirlwind of sheer chaos. Another element that stands out is the rusty colour scheme, which is rather murky and dull in tone because of the lighting. These under lit sets add to the disorientating and gritty feel. An eerie and high pitch music score is rather effective, as it really nags away and makes it quite unsettling. Frantic, edgy and encroaching camera-work is achieved to great effect. We get the usual sloppy and atrocious special effects that we see in cheap b-films and the massive rubber crocodile (looks real shoddy) is no exception. The cast gives mostly amateur performances. Though, there are some fine performances by Robert England (Freddy Kruger fame) in one of his first big screen roles as a horny local stud called Buck and when on screen he shines. Neville Brand as the mumbling and wandering Judd delivers it brilliantly. He totally captures the mentality of this crazed character. There are a lot of scenes where we just listen to the creepy Judd ramble on in a husky tone and meandering around the shadows that fill run-down hotel listening to country music and most of these sequences feel like they're dragging the pace. Marilyn Burns who also starred in \"The Texas Chainsaw Massacre\" plays Faye the mother of the annoying family who checks in and spends most of her time being gagged and then finishes off by screaming her lungs off. Good support by Mel Ferrer and Crystin Sinclaire as the prostitute's father and sister and Stuart Whitman as Sheriff Martin. Roberta Collins and Janus Blythe also appear. The dialogue is rather bad and inane at times, but there's some added tongue-in-cheek humour. It's definitely not in the same league of Hooper's previous effort \"The Texas Chainsaw Massacre\". Rather silly stuff, but amusing low-budget nastiness with good art direction and some sudden jolts of excitement."
      ],
      "genres": ["Horror"],
      "productionCompanies": ["Mars Productions Corporation"],
      "summaries": [
         "Judd runs the Starlight Hotel out in some sort of swampy place and is unfortunately a few slices short of a loaf. He has a crocodile conveniently placed on the other side of the hotel's front porch railing. The croc will eat just about anything, as the hapless guests of the hotel find out soon enough. A reformed hooker, an unlucky family, and the father and sister of the hooker all suffer various rates of attrition as Judd tries to implement damage control.",
         "A psychotic redneck who owns a dilapidated hotel in rural East Texas kills various people who upset him or his business, and he feeds their bodies to a large crocodile that he keeps as a pet in the swamp beside his hotel."
      ],
      "budget": 520000
   },
   "movielensId": 3294,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1976-12-25",
      "dvdReleaseDate": "2000-02-01",
      "directors": ["Tobe Hooper"],
      "runtime": 91,
      "movieId": 3294,
      "title": "Eaten Alive",
      "mpaa": "",
      "actors": [
         "Neville Brand",
         "Mel Ferrer",
         "Carolyn Jones",
         "Marilyn Burns",
         "William Finley",
         "Stuart Whitman",
         "Robert Englund",
         "Roberta Collins",
         "Kyle Richards",
         "Crystin Sinclaire",
         "Janus Blythe",
         "David Hayward"
      ],
      "imdbMovieId": "0074455",
      "originalTitle": "Eaten Alive",
      "genres": ["Horror"],
      "youtubeTrailerIds": [
         "9cQGA5VRj50",
         "8Bsu9AZGeCQ"
      ],
      "plotSummary": "A psychotic redneck who owns a dilapidated hotel in the backwater swamps of Louisiana kills various people who upset him or his business, and he feeds their bodies to a large crocodile that he keeps as a pet in the swamp beside his hotel.",
      "tmdbMovieId": 30062,
      "avgRating": 2.45402,
      "releaseYear": "1976",
      "numRatings": 87,
      "posterPath": "/4sz1YFCtLxQJQ5yxsJsmiJRHcMs.jpg"
   }
}