{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "communion dress",
            "id": 2293
         },
         {
            "name": "priest",
            "id": 10093
         },
         {
            "name": "working class",
            "id": 11935
         },
         {
            "name": "catholic",
            "id": 18396
         },
         {
            "name": "unemployment",
            "id": 156052
         },
         {
            "name": "manchester",
            "id": 208548
         },
         {
            "name": "cannes film festival",
            "id": 208632
         }
      ],
      "imdb_id": "tt0107920",
      "video": false,
      "title": "Raining Stones",
      "recommendations": [
         113936,
         151307,
         42724,
         59231,
         77955,
         8129,
         49980,
         80080,
         49966,
         107035,
         100052,
         180010,
         110771,
         36832,
         51929,
         36818,
         69040,
         121461,
         148353,
         54407
      ],
      "backdrop_path": "/cMStYBpyjyDvfvuHg32n5Scf1Ct.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Bob",
               "gender": 2,
               "credit_id": "52fe467fc3a368484e093da9",
               "name": "Bruce Jones",
               "profile_path": "/9HnvGUB263MoWVYyA45c6f8cr92.jpg",
               "id": 235361,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Anne",
               "gender": 0,
               "credit_id": "543baa730e0a2649a5005420",
               "name": "Julie Brown",
               "profile_path": null,
               "id": 1373457,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Coleen",
               "gender": 0,
               "credit_id": "52fe467fc3a368484e093db1",
               "name": "Gemma Phoenix",
               "profile_path": null,
               "id": 235362,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Tommy",
               "gender": 2,
               "credit_id": "52fe467fc3a368484e093db5",
               "name": "Ricky Tomlinson",
               "profile_path": "/oTU9U8AfbII10LaX02vccT8WyXD.jpg",
               "id": 29699,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Father Barry",
               "gender": 2,
               "credit_id": "58d0101dc3a3683f3a00048b",
               "name": "Tom Hickey",
               "profile_path": "/wmgEm09lbMS8ULcscHD7e9WJYhk.jpg",
               "id": 107729,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Jimmy",
               "gender": 0,
               "credit_id": "58d010289251415199000471",
               "name": "Mike Fallon",
               "profile_path": null,
               "id": 1780597,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Butcher",
               "gender": 0,
               "credit_id": "58d010379251415195000508",
               "name": "Ronnie Ravey",
               "profile_path": null,
               "id": 1780599,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Irishman",
               "gender": 0,
               "credit_id": "58d0104a92514151890004b1",
               "name": "Lee Brennan",
               "profile_path": null,
               "id": 1780601,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Young Mother",
               "gender": 0,
               "credit_id": "58d010599251415191000559",
               "name": "Karen Henthorn",
               "profile_path": null,
               "id": 1198661,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "May",
               "gender": 0,
               "credit_id": "58d01068c3a3683eb300053b",
               "name": "Christine Abbott",
               "profile_path": null,
               "id": 1780602,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Tracey",
               "gender": 0,
               "credit_id": "58d01078c3a3683efe0004b3",
               "name": "Geraldine Ward",
               "profile_path": null,
               "id": 1780603,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Joe",
               "gender": 2,
               "credit_id": "58d01083c3a3683f2b00049f",
               "name": "William Ash",
               "profile_path": "/pQgdzvRQVT3gDItNptsHhaCdRiU.jpg",
               "id": 86044,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Sean",
               "gender": 0,
               "credit_id": "58d0109a925141519d00050e",
               "name": "Matthew Clucas",
               "profile_path": null,
               "id": 1780604,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Shop Assistant",
               "gender": 0,
               "credit_id": "58d010acc3a3683eb300057f",
               "name": "Anna Jaskolka",
               "profile_path": null,
               "id": 1740170,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Tansey",
               "gender": 0,
               "credit_id": "58d010be9251415195000582",
               "name": "Jonathan James",
               "profile_path": null,
               "id": 1780606,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "Ted",
               "gender": 0,
               "credit_id": "58d010cdc3a3683f1b000569",
               "name": "Anthony Bodell",
               "profile_path": null,
               "id": 1780616,
               "order": 15
            },
            {
               "cast_id": 20,
               "character": "Ted's Mate",
               "gender": 0,
               "credit_id": "58d010d9925141518900053c",
               "name": "Bob Mullane",
               "profile_path": null,
               "id": 1780617,
               "order": 16
            },
            {
               "cast_id": 21,
               "character": "Mike",
               "gender": 0,
               "credit_id": "58d010e692514151da000557",
               "name": "Jack Marsden",
               "profile_path": null,
               "id": 1170886,
               "order": 17
            },
            {
               "cast_id": 22,
               "character": "Dixie",
               "gender": 0,
               "credit_id": "58d010f1c3a3683f2b00050f",
               "name": "Jim R. Coleman",
               "profile_path": null,
               "id": 1780580,
               "order": 18
            },
            {
               "cast_id": 23,
               "character": "Dean",
               "gender": 2,
               "credit_id": "58d010ff925141519900051a",
               "name": "George Moss",
               "profile_path": null,
               "id": 240450,
               "order": 19
            },
            {
               "cast_id": 24,
               "character": "Club Steward",
               "gender": 0,
               "credit_id": "58d01110c3a3683ee300057a",
               "name": "Jackie Richmond",
               "profile_path": null,
               "id": 1780618,
               "order": 20
            },
            {
               "cast_id": 25,
               "character": "Factory Boss",
               "gender": 0,
               "credit_id": "58d0114ac3a3683f1b0005be",
               "name": "Derek Alleyn",
               "profile_path": null,
               "id": 1780622,
               "order": 21
            },
            {
               "cast_id": 29,
               "character": "Drug Pusher",
               "gender": 2,
               "credit_id": "5909125bc3a368359d000996",
               "name": "Tony Audenshaw",
               "profile_path": "/sagAELbjyATKjf3ZeIHFGp3n5Q6.jpg",
               "id": 1231810,
               "order": 22
            },
            {
               "cast_id": 26,
               "character": "",
               "gender": 0,
               "credit_id": "58d01160c3a3683f3a000574",
               "name": "Tracey Adamson",
               "profile_path": null,
               "id": 1780624,
               "order": 23
            },
            {
               "cast_id": 27,
               "character": "",
               "gender": 0,
               "credit_id": "58d01168c3a3683eef000586",
               "name": "Susan Cookson",
               "profile_path": null,
               "id": 1220202,
               "order": 24
            },
            {
               "cast_id": 28,
               "character": "",
               "gender": 2,
               "credit_id": "58d0116f92514151890005f0",
               "name": "Stephen Lord",
               "profile_path": "/xhALKkQntbAIMBvtTcSxi6GKaIm.jpg",
               "id": 83674,
               "order": 25
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe467fc3a368484e093da5",
               "name": "Ken Loach",
               "profile_path": "/vGtkrPgNeK3xkbbKTQ4vWD1VsEm.jpg",
               "id": 15488,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "53bd3cd7c3a3684cec0013c9",
               "name": "Jim Allen",
               "profile_path": null,
               "id": 181945,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5918dbae925141061e04430f",
               "name": "Barry Ackroyd",
               "profile_path": "/mpdR2TB4gS5E3qzSuQ9p6eMxgYD.jpg",
               "id": 15493,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.281623,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 62463,
      "vote_count": 28,
      "budget": 0,
      "overview": "This Ken Loach film tells the story of a man devoted to his family and his religion. Proud, though poor, Bob wants his little girl to have a beautiful (and costly) brand-new dress for her First Communion. His stubbornness and determination get him into trouble as he turns to more and more questionable measures, in his desperation to raise the needed money. This tragic flaw leads him to risk all that he loves and values, his beloved family, indeed even his immortal soul and salvation, in blind pursuit of that goal.",
      "similar": [
         9552,
         314365,
         45054,
         154400,
         48171,
         9945,
         9946,
         30159,
         145,
         2959,
         184346,
         11026,
         157832,
         15659,
         8852,
         12700,
         293670,
         9843,
         9616,
         11586
      ],
      "original_title": "Raining Stones",
      "runtime": 90,
      "poster_path": "/eWUZT0vdQZLyeKpWtwheGY23TdW.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Parallax Pictures",
            "id": 983,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Channel Four Films",
            "id": 181,
            "origin_country": "GB"
         }
      ],
      "release_date": "1993-09-09",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ken Loach"],
      "runtime": 90,
      "synopsis": null,
      "writers": ["Jim Allen"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0107920/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg3MDYzOTY1OF5BMl5BanBnXkFtZTcwNDAxNjMyMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Bruce Jones, Julie Brown, Gemma Phoenix | See full cast and crew »"],
      "reviews": [
         "Yet another great Ken Loach film. It begins as a somewhat gritty comedy. Bob (Bruce Jones, aka Les Battersby) and his mate Tommy (Ricky Tomlinson) are out of work and desperate for money. They decide to capture a sheep, and sell the meat in the local pub. They also go and steal the turf from the local Conservative Party club grounds (if anyone deserved it then...!). The heart of the film, though, is Bob's desperation to get the money together to pay for his daughter's Catholic Communion outfit. He ends up borrowing money from the loan sharks, and things begin to go downhill. There is one scene, where a loan shark \"pays a visit\" after Bob misses his payments. Bob is out, but his wife and daughter are in. There is no serious physical violence in this scene, but plenty of verbal threats. For me, this is one of the most menacing scenes in film I have seen in years. Loach directs it to perfection. As often with Loach, behind an ostensible political message, lies a complex moral analysis of real people's lives, handled with great sensitivity.",
         "I watched this on Channel 4 late one night a few years ago. I had had a bad day at work, and was dog-tired. On the verge of turning off the TV, I caught the beginning, and I was immediately hooked. Ken Loach provides a hyper-realistic portrayal of life on the edge in the 1990`s. Bruce Jones (later to play the feckless Les Battersby on Coronation Street) displays a remarkable tenderness as the struggling father who desperately tries to obtain enough money to buy his daughter a communion dress. He, and Ken Loach,indicate that this poor man represents the best of the working class, only forced to crime,in order to feed and clothe his family.He is a true hero. The grim setting and subject matter (a disintegrating council estate, and dingy pubs) are not allowed to swamp the deeply human nature of the tale, and there are a number of moments (especially provided by Ricky Tomlinson), where the mood is lightened, allowing gritty humour to emerge. The opening, where the two heroes are unsuccessfully trying to steal a sheep is hysterical. I wouldn`t call myself a great Ken Loach fan, but this is his masterpiece. I would call it one on the best British films of all time.",
         "Christ this film is set in Middleton, pretty much where I live. I remember seeing this when I was about 10 years old and being taken aback at it's accuracy. Everything about it is working-class Manchester, portrayed objectively for the most part. Mancunians appreciate honesty, self mockery and self reflection. My dad and my brother both like this film and I can see why - they're part of it in a sense, as am I. It's not all about struggling to pay the rent, queueing up in the dole office and chugging through the drizzle ridden streets in a Ford Transit - it's about looking at your own life and your own culture being represented by a director who tries to keep things as organic as possible. It's about recognising your environment, where you have come from.",
         "Like many, I often found the accents hard to decipher. But I think it speaks to Loach's formidable talent that it's never really in question as to what's happening: we get the story in visible strokes, and we get the emotional feeling in the most minute, detailed way possible. To use a clichéd phrase, it has the drama of life, and Loach has a loving touch, even though the outer view of his work is rough and hard: he doesn't separate the funny bits from the painful bits, he lets it all run together. And despite the fact that some find him an \"uncinematic\" director, I think that's mostly baloney. No, he doesn't impress with his visuals, but that doesn't mean that they're uncinematic; he's working in a way that's more interested in recording emotions (and he still tells a story) and that is cinematic. The film espouses a wonderful philosophy -- love and prayer is enough. Yet while the film is sympathetic to the emphasis the family places on communion (getting into Heaven), at times it feels like a condemnation of Catholic greed and pie-in-the-sky fantasies of those relying on God to solve their earthly troubles -- after all, He doesn't buy communion dresses. I think that's why the film works so well. It never spells out how intelligent it is, because that's not Loach's intention. Yet what he does is incredibly smart. (Likewise, you can see the politics behind the film, and that's why they work, too: they're behind it, not in your face.) The ending might seem a little too cheery (though cheery is perhaps the wrong word), but I think it works in the tradition of great humanism: things WILL be alright in the end, if you just believe. And because it's humanism, it's true: everything else might be awful, but you're alive, you have a family, you're fighting to go on: that's wonderful. Loach makes a brilliant choice with the car crash, because it solves something and yet it makes the moral universe of the film more complex: Is he scott free now? Who is the bad guy here? And Loach of course includes the most pragmatic priest in the movies -- pray for the worthless soul as any good Christian would, but realize that he who causes fear in the hearts of good people is not a life worth wrecking yours over. Consider the car crash an act of God (which indirectly benefits God, by supporting a family of followers), rewarding he who believes yet still exists in the practical world trying to make things work (he who doesn't just lay around waiting for God to save him). THIS is Catholic cinema. I'm agnostic, and this touched my soul. It gets at the roots of what real religion does, or is supposed to do: heal, protect, love -- not preach, frighten, or intimidate. So I think even though he opts for a \"faith\" film (that is, he does not offer a text book on how to solve your problems), Loach's \"realism\" and pragmatic philosophy still suggests that the everyday is important -- keep at it. It's what leads to the faith, it's what's needed for the faith to work. 9/10",
         "Bob Williams is one of many unemployed in his area and faced with doing cash-in-hand work and odd jobs to keep his family's heads above water. Regardless of his and his wife's hardships they are both committed Catholics. His daughter is having her first communion and Bob wants her to fit in with the others \u0096 meaning a new dress and shoes which will total about £100. His attempts to raise the money mostly brings very small reward and frustration. Meanwhile his luck runs nothing but bad and his van is stolen \u0096 limiting his ability to pick up jobs and get around. As his debts rise, so do his troubles and his desperation. The type of film that Ken Loach made his name directing, this film is a touching and natural ode to the spirit of the poor man. The plot is not so much a typical day in the life as a dramatic piece that follows the downward spiral of Bob as a representation of how life on the breadline is one challenge after another. In Bob's life an one-off expense of £100 is a major incident to be gotten through rather than the inconvenience that it is for the majority of us. The film does a very good job of portraying it \u0096 it isn't a film noir descent into crime but rather just the spirit of a man fighting to pay the bills. Most of us will have had this at some point but few of us can relate to those that get by daily on odd-jobs and going door-to-door; however the script here lays it out convincingly and naturally, easily allowing me to get into the lives before me. In this regard it is impacting because the humour and desperation of the people is convincing and their day-to-day situation dire. The cast all take the material and run with it and there are few here that I didn't totally believe. Jones wears the character like a second skin and fits into it really well. His desperation is well complemented by Tomlinson who adds the comic spirit to the bottom classes. The rest of the cast are solid despite not having the limelight in the same way. Brown is good despite having the very occasional rare moment. Phoenix is sweet and natural and the rest of the cast feel mostly real. Loach's direction is grainy and fits the world his story is in. I hate to use the words over and over again but this is a convincing and natural story and it is touching and engaging as a result. It does a great job of capturing the spirit of the poor, making the best of what they have \u0096 but not ever ignoring the fact that Bob et al are the type of shifty people who you wouldn't want to mess with.",
         "Bob (Bruce Jones) is on the dole. With barely enough money to pay his rent, he is still determined to buy his daughter Coleen (Gemma Phoenix) a new dress for Communion, an investment of a few hundred pounds. The truth of the characters and an authentic script by Jim Allen lifts Ken Loach's 1993 drama Raining Stones out of the ordinary and makes it a human document of considerable strength. Bob's spirit propels the story and allows us to root for him as he tries to overcome his failure to find the means to fulfill his wishes for his daughter. As the film opens, Bob and his friend Tommy (Tomlinson) steal a sheep from the countryside but cannot bring themselves to kill it. Instead they bring it to the butcher who tells them that it is mutton, not lamb and it is worthless to him. When they attempt to sell it piece-by-piece at the local tavern, they leave the keys in the ignition and Bob's van is stolen. Bob goes from one misadventure to another, from stealing sod from a golf course for a landscape gardener to a one-night stand as a bouncer at a local pub that ends up with him getting beaten and losing his job in the process. One of the funniest scenes takes place at the local church where Bob is forced into donating his services to clean their drains and ends up only with thanks from the pastor and a bucket full of dirt on his clothes. Supporting Bob is a supportive pastor (Tom Hickey), who urges him to rent a dress at a reduced cost, and his wife Anne (Julie Brown) who stands with him in periods of distress. The second part of the film centers around Bob's efforts to raise the necessary cash to buy the dress and his unfortunate choice of borrowing the money and having to deal with a loan shark that gets him and his family into serious trouble. The script by Jim Allen rings true although, without subtitles, much of the dialogue is drowned in regional accents. Raining Stones builds to a powerful ending with an unforced naturalism that makes us feel for the characters as human beings, not as symbols of a society that has turned its back on its poorest members.",
         "\"Raining Stones\" is one of those films that initially looks like it is going to be painful to watch. The despair of the blue-collar English, working hard to make ends meet, the idea that religion is a part of the family, and a proud father willing to do anything for his daughter feels more like a Mike Leigh film than a Loach drama, but Loach stands up and demonstrates his ability to produce amazing cinema. It is a scene we have seen many times before, a father down on his luck with his family and life does anything (sewage, bounce, and sheep stealing) to provide a brand new dress for his daughter's first Communion. He is determined to give his daughter a memory she will always cherish, but he is also determined to prove his worth to his entire family. This is where the drama and real humanity of all Loach's characters begin to shine. This didn't initially seem like a film worth watching, hesitantly I worried this would be one of those over dramatic family dramas that pulled everything out of you only to leave you bored, desensitized, and counting the final minutes - within the first ten minutes of Loach's film, I knew that I was wrong. To begin, our main protagonist, completely full of flaws, but boiling over with pride, captures your attention. Our patriarch, Bob (played delicately by Bruce Jones), is immediately recognizable and relatable. Loach gives him that blue- collar, everyman appeal that isn't sugar-coated or fabricated. The instances may seem episodic at times, but what happens to Bob is real. Add to this mix his devotion to the Catholic faith, and we have a powerfully well-rounded character that leads us in and out of difficult times. With Bob is his conscious, or voice of future, the unemployed Tommy creates this very sad world, but it isn't bleak. Jobs are found, dresses are ordered, and money is used - it is the destination with this film, not the journey. Bruce Jones' ability to control each scene, whether it is getting a bitter or going door to door searching for work, he is someone that we stand proudly next to. Loach has crafted a man that screams sympathy. During every moment of this film, we root for Bob, we cheer when he finds work, and each downfall we feel as well. That is a great accomplishment as both a director and an actor if each scene can bring out such emotion. Not only is the acting Oscar worthy, but Loach's (with Jim Allen) story is outstanding. From that opening scene, he pulls you into this world that feels real, that seems plausible, that demonstrates the struggle without being vulgar or gross. It is a normal town, these are trying times, Bob wants to provide for his family, and what he goes through to accomplish this is breathtaking. As Loach introduces religion into this story, a very vital element to this film, it seems only natural that when in trouble, when you feel like you can turn to nobody, the Church is there, God is there, your local priest is there to talk you through the trouble. It isn't overbearing, it isn't preachy, it is a way of life for these characters and Loach doesn't force this down our throats. It is again, this feeling of realism that makes \"Raining Stones\" stand above other films of this nature. If there were a complaint about this film, it would be the sense of timing with Bob. In one moment he has no money, in another he is suddenly debt ridden. It happens rather quickly in a 90-minute film. Also, would a man with no money to his name really spend that much on beer during the week - wouldn't he save it? Or was this Loach's commentary on the blue-collar worker? Never enough money for things that count, but plenty of time for beer and religion. An odd twist... Overall, this was an impressive film from the beginning all the way to the final moment that put this smile on your face. It was dramatic, it was grounded, and it was passionate for all the right reasons. Loach has proved himself as a director with \"Raining Stones\", and this is a perfect example of a \"don't judge\" cover. Again, this wouldn't have been a typical film for me, but what came out of the DVD player was a cinematic dinner. Everything was in place, and you were satisfied by the end. I can only recommend this film to everyone excited about a low- budget, no CGI, drama that shows humanity at its best and worst. It will make you think, make you smile, and make you understand the struggles of life. Watch this film! Grade: **** 1/2 out of *****",
         "This film I saw when it first came out in 1993. It made such an impression that I can still recall many scenes and the whole story. Ken Loach creates really believable characters who might live next door. He builds and presents the story so the viewer really becomes involved in the cast's problems. It remains my favourite Ken Loach film. An excellent film in its category.",
         "Raining Stones is a gritty urban tale of life with no money or hope! Bob Williams(Bruce Jones) has to raise the cash for his daughters first communium dress! He's determined to get the best one, which is the dearest, ably followed with his long suffering wife(Julie Brown) and his best mate Tommy (Ricky Tomlinson). From gutting drains to stealing turf and sheep! He struggles to raise the cash and has to visit a loan shark- 'Tansey' , with devastating consequences! Bob's a survivor, but will it all come good in the end?! Another Brilliant film from Ken Loach! 8/10",
         "Filmed around the low unemployment and depressed \"overspill\" council estate of Langley in Middleton, Manchester. This was the perfect setting for Raining Stones ( the title speaks for itself, it means, nothing is easy, everything hurts or is hard ) True local rumour has it, that the villains of the film are loosely based on a notorious underworld family of the same area. One mans determination to have the very best for his daughters holy communion leads him into many escapades as he tries honestly and dishonestly to raise enough money for the apple of his eyes holy communion dress. From cleaning drains to sheep rustling on the local moor he eventually and without his partners knowledge borrows the money His inability to pay the lender the money back results in the local loan shark buying the debt (this is a common practice) the loan shark and his entourage then proceed to chase the unfortunate man for there money. Great stuff, realistic and treasure to watch."
      ],
      "genres": [
         "Drama",
         "Comedy"
      ],
      "productionCompanies": [
         "Channel Four Films",
         "Parallax Pictures"
      ],
      "summaries": ["This Ken Loach film tells the story of a man devoted to his family and his religion. Proud, though poor, Bob wants his little girl to have a beautiful (and costly) brand-new dress for her First Communion. His stubbornness and determination get him into trouble as he turns to more and more questionable measures, in his desperation to raise the needed money. This tragic flaw leads him to risk all that he loves and values, his beloved family, indeed even his immortal soul and salvation, in blind pursuit of that goal."],
      "budget": 0
   },
   "movielensId": 3295,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1993-09-09",
      "dvdReleaseDate": "2000-02-01",
      "directors": ["Ken Loach"],
      "runtime": 90,
      "movieId": 3295,
      "title": "Raining Stones",
      "mpaa": null,
      "actors": [
         "Bruce Jones",
         "Julie Brown",
         "Gemma Phoenix",
         "Ricky Tomlinson",
         "Tom Hickey",
         "Mike Fallon",
         "Ronnie Ravey",
         "Lee Brennan",
         "Karen Henthorn",
         "Christine Abbott",
         "Geraldine Ward",
         "William Ash",
         "Matthew Clucas",
         "Anna Jaskolka",
         "Jonathan James",
         "Anthony Bodell",
         "Bob Mullane",
         "Jack Marsden",
         "Jim R. Coleman",
         "George Moss",
         "Jackie Richmond",
         "Derek Alleyn",
         "Tony Audenshaw",
         "Tracey Adamson",
         "Susan Cookson",
         "Stephen Lord"
      ],
      "imdbMovieId": "0107920",
      "originalTitle": "Raining Stones",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["BIQgSLbf124"],
      "plotSummary": "This Ken Loach film tells the story of a man devoted to his family and his religion. Proud, though poor, Bob wants his little girl to have a beautiful (and costly) brand-new dress for her First Communion. His stubbornness and determination get him into trouble as he turns to more and more questionable measures, in his desperation to raise the needed money. This tragic flaw leads him to risk all that he loves and values, his beloved family, indeed even his immortal soul and salvation, in blind pursuit of that goal.",
      "tmdbMovieId": 62463,
      "avgRating": 3.68269,
      "releaseYear": "1993",
      "numRatings": 104,
      "posterPath": "/eWUZT0vdQZLyeKpWtwheGY23TdW.jpg"
   }
}