{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0020594",
      "video": false,
      "title": "With Byrd at the South Pole",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Himself - Narrator",
               "gender": 0,
               "credit_id": "52fe49f0c3a36847f81ae9f9",
               "name": "Floyd Gibbons",
               "profile_path": null,
               "id": 1027222,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe49f0c3a36847f81aea0f",
               "name": "Richard E. Byrd",
               "profile_path": null,
               "id": 1027226,
               "order": 1
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe49f0c3a36847f81ae9e3",
               "name": "Adolph Zukor",
               "profile_path": null,
               "id": 13335,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe49f0c3a36847f81ae9e9",
               "name": "Jesse L. Lasky",
               "profile_path": null,
               "id": 1004059,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe49f0c3a36847f81ae9ef",
               "name": "Emanuel Cohen",
               "profile_path": null,
               "id": 1027221,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe49f0c3a36847f81ae9f5",
               "name": "Julian Johnson",
               "profile_path": null,
               "id": 772490,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe49f0c3a36847f81ae9ff",
               "name": "Manny Baer",
               "profile_path": null,
               "id": 1027223,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe49f0c3a36847f81aea05",
               "name": "Joseph T. Rucker",
               "profile_path": null,
               "id": 1027224,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "52fe49f0c3a36847f81aea0b",
               "name": "Willard Van der Veer",
               "profile_path": null,
               "id": 1027225,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "57a7c43892514157980008ca",
               "name": "Julian Johnson",
               "profile_path": null,
               "id": 772490,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.113762,
      "production_countries": [],
      "id": 101383,
      "vote_count": 3,
      "budget": 0,
      "overview": "With Byrd at the South Pole (1930) is a documentary film about Rear Admiral Richard E. Byrd and his 1st quest to the South Pole beginning at the Little America-Exploration Base. The film's soundtrack consists mostly of music and sound effects, with narration read by Floyd Gibbons. The film won at the 3rd Academy Awards for Best Cinematography.",
      "similar": [],
      "original_title": "With Byrd at the South Pole",
      "runtime": 82,
      "poster_path": "/urqYdtCzUU45eRdzne4XDcqkq24.jpg",
      "spoken_languages": [],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1930-06-28",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": [],
      "runtime": 82,
      "synopsis": null,
      "writers": ["Julian Johnson"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0020594/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc2MDE1NTQyM15BMl5BanBnXkFtZTcwNzIyMDQyMQ@@._V1_SY317_CR9,0,214,317_AL_.jpg",
      "actors": ["Stars: Richard E. Byrd, Clair D. Alexander, Bernt Balchen | See full cast and crew »"],
      "reviews": [
         "A classic documentary in glorious black and white, the film is mostly silent, with a musical score added. There is a sound introduction by Byrd himself and a narrator describes the section showing the actual flight over the South Pole (though his narration is hurried). The film is beautifully photographed and won the Academy Award for cinematography in 1930. Helpfully, the print that I watched on Canadian TV was clear and crisp, making the film a visual treat to watch. I highly recommend this film over any newer versions of Byrd's story which would intercut the vintage film clips with modern material. This version gives a great feel for the immensity of the original expedition, with tidbits both momentous and minor.",
         "A few nights ago, my wife and I found ourselves talking about family problems at 3am. Sleep seemed impossible, so we went to the TV to find a more soothing mood. And there, on TCM, we found \"With Byrd at the South Pole. Byrd stood nervously before the camera, stiffly, nervously trying to communicate the scope and dangers of his mission. The nervousness was in stark contrast to his absolute sure-handed, calm planning and control in the most trying circumstances. We marveled at the thoroughness and foresight of his planning, his concern for the safety of his crew--no one died on the mission, despite blizzards, crevasses, 4 straight months of no sunlight,and icy , treacherous footing, with temperatures reaching -72 F. Most outstanding was the Oscar-winning cinematography, unself-consciously artistic and breathtaking. We often wonder, watching adventure films, how cameramen somehow manage to be on a mountain peak before the climbers, wrestling heavy, awkward burdens of cameras, film and tripods. In this documentary, the visual thrills are endless and revelatory. One of the most interesting aspects of the film is the quiet dignity, humanity and willing work of the 42 trekkers. There is no evidence of complaining,a quiet competency and absolute dedication to hard work.There is a moving episode as a lead dog, overcomes illness and infirmity in a heartbreaking attempt to stay with the sled dog teams. This film is less \"dramatic\" than Flaherty's epics, but totally involving in terms of our emotional involvement.Find this film gem if you can...it's unforgettable.",
         "Oscar winning documentary on Byrd at the Antarctic and his attempt to be the first to fly over it. This beautifully shot record of what Byrd had to do to be the first man to fly over the South Pole is the type of film that sucks you in and hold you for its entire running time. If you want to know what it was like to be one of the first people to explore the bottom of the world this is for you. To be certain others were there first Roald Amundsen, Scott and Shackleton were all there first, but Byrd was still there when there were no permanent facilities and a trip to the ice was a years long adventure. This is amazing stuff (even if some of it seems staged). If there is any real flaw its that the flight to the Pole is almost anti-climatic when compared with just trying to survive. It should noted that the film is mostly silent. Sound film was really just taking off when the expedition was taking off, and even so the sound equipment would never have passed the weight restrictions. What sound there is comes from an introduction by Byrd, sound effects, and some narration during the actual flight. Recommended. (More so if you've seen the footage of Ernest Shackleton and his ill fated trip since this adds to your knowledge of what it must have been like for them as well)",
         "With Byrd at the South Pole (1930) *** (out of 4) This documentary picked up a Best Cinematography Oscar and rightfully so as some of the shots are just downright breathtaking. The documentary covers the year-long journey of Rear Admiral Richard Byrd as he tracks down to the South Pole where he attempts to become the first person to fly over it. The documentary picks up as the ship leaves New York and we pretty much see their not so good life for the next year as they struggle to build up their shelters as well as having to deal with the low temperatures and of course actually building the plane to try and make it fly. I think history buffs are certainly going to get a kick out of seeing this footage as there's no question that it's pretty remarkable getting to see this historic event. The cinematography really puts you right there as there are some terrific shots of the wildlife and some footage showing how dangerous everything is. Just take a look at some of the shots during the two blizzards that are shown and you're really amazed that no one was killed. There's also quite a bit of humor added in the title cards (the film is silent) in regards to the low temperatures and there's a funny sequence where we see some spring cleaning and we get to see how they get a hot bath. The Aeriel footage is another major plus. The film starts off with a talking sequence with Byrd delivering a speech about his journey. This is probably the worst sequence because of how badly he struggles to read the cue cards. His eyes are constantly looking over to the cards and even worse is how he has to break sentences up to look over and see where to pick up again. Still, the actual images is what makes this film so special and worth viewing."
      ],
      "genres": [
         "Documentary",
         "Adventure"
      ],
      "productionCompanies": ["Paramount Pictures"],
      "summaries": [],
      "budget": 0
   },
   "movielensId": 3297,
   "movielens": {
      "languages": [""],
      "releaseDate": "1930-06-28",
      "dvdReleaseDate": "2000-02-01",
      "directors": ["Julian Johnson"],
      "runtime": 82,
      "movieId": 3297,
      "title": "With Byrd at the South Pole",
      "mpaa": "",
      "actors": [
         "Floyd Gibbons",
         "Richard E. Byrd"
      ],
      "imdbMovieId": "0020594",
      "originalTitle": "With Byrd at the South Pole",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "With Byrd at the South Pole (1930) is a documentary film about Rear Admiral Richard E. Byrd and his 1st quest to the South Pole beginning at the Little America-Exploration Base. The film's soundtrack consists mostly of music and sound effects, with narration read by Floyd Gibbons. The film won at the 3rd Academy Awards for Best Cinematography.",
      "tmdbMovieId": 101383,
      "avgRating": 2.22727,
      "releaseYear": "1930",
      "numRatings": 11,
      "posterPath": "/urqYdtCzUU45eRdzne4XDcqkq24.jpg"
   }
}