{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0221023",
      "video": false,
      "title": "Black Tar Heroin: The Dark End of the Street",
      "recommendations": [],
      "backdrop_path": "/2IEq9OkiL7rKSqvr7QWoK14g1tG.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 0,
            "credit_id": "54a97653c3a368077b0023a0",
            "name": "Steven Okazaki",
            "profile_path": "/wEk6MMrY3JDsDdLWbbLe5QOS4BJ.jpg",
            "id": 110962,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.423017,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 79515,
      "vote_count": 6,
      "budget": 0,
      "overview": "The film follows a simple structure, and shows the drug-related degradation of five youths (Jake, Tracey, Jessica, Alice, Oreo) during the course of three years. The film depicts drug-related crimes and diseases: prostitution, male prostitution, AIDS, and lethal overdoses.",
      "similar": [],
      "original_title": "Black Tar Heroin: The Dark End of the Street",
      "runtime": 75,
      "poster_path": "/uzLDUtdl5U4Oy2QRScfHeodBGP6.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2000-03-17",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Steven Okazaki"],
      "runtime": 75,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0221023/",
      "coverLink": null,
      "actors": [],
      "reviews": [
         "After seeing this documentary, I, like most people, wondered what the fate of those featured was. WELL, surprisingly enough, I was at the dog park today in Portland, Oregon and noticed a familiar face. It was none other than Alice, the punk rock girl from the movie! I found it hard to believe that it was really her, so I went up and talked to her and sure enough, it was! I guess she moved here 6 years ago and has been clean ever since! She told me that they were talking about doing a 'where are they now?' follow-up, but it never happened. I guess the lesbian girl who was working as a sex worker with HIV has since died, but most people are up to the same old. . .sad, but nice to know at the same time. People make choices, you know. Seeing her gave me hope. Thanks for taking the time to talk to me Alice, wherever u are. xo sigrun",
         "It was hard to watch the needles in the beginning. Needles in the arm. Neddles in the foot. In the neck. Then the needles stopped mattering. It got hard to watch the users. You end up realizing that these addicts are people, not just dirty bodies walking the streets. You can figure out why these people cannot stop. You see that they made a mistake a long time ago and that mistake held on. All of their friends are part of that mistake. Who do you go to when your trying to fix a mistake? Your friends. Notice how this won't work. This film makes you see these people as people. The types that have to sleep on sidewalks. Find this film and watch it.",
         "This documentary came on HBO at 3:45 in the morning, and having skipped it in the past when I had other things to do, I decided to forego sleep for the night in order to see this. I was expecting it to be depressing, but no one could really be prepared for the horrible stories and images of the lives these young people have lived and are currently living. They resort to prostitution, robbery, anything to get their costly daily fix(es), and we are right there watching them follow their downward spirals to what we sadly know will inevitably be a slow, lonely, painful death, whether it be on or off camera. I agree wholeheartedly that this movie is too disgusting to look at at points, yet one that everyone should see, just don't expect to come out of it in too good a mood. If you found yourself affected by the plight of the characters in Darren Aronofsky's Requiem for a Dream,check out the even more saddening (I know it's hard to believe) stories of some real, live addicts.",
         "I was flipping channels late one evening and I caught the last half of this film. It was horrifying and bleak yet absolutely fascinating, like watching a car accident in slow-motion. The filmmakers set out to tell the truth about the effects of heroin addiction by following the daily lives of a group of black tar heroin addicts in the San Francisco Bay area. We see them become progressively sicker, thinner, paler and even lose hope of going clean. Three of them (2 guys and a girl) work as prostitutes to support their habit (2 later test positive for HIV). All the while they remain remarkably candid about their condition and we learn all we'd ever want to know about this sad lifestyle. I recommend this film but people with delicate sensibilities might want to stay away. Schools and drug awareness programs should use this film!",
         "In an attempt to do the impossible, Black Tar Heroin... is an insiders look into the life of a Heroin addict. This commentary on youth in San Francisco which are involved with Heroin, among other things, is a graphic display of society's problems. Though the movie at some points is to grotesque to watch, it is necessary to show for the value. Every youth in society as they reach their teen years should be made to watch this movie. It is in the mind of this viewer that many of teenagers would be turned off enough, never to attempt this lifestyle.",
         "the video jacket for this movie says \"makes 'Trainspotting' look like an after school special, and they ain't lying. this is the best movie ever about hard drug use - unromantic, colorful, real. the first poster is correct that some gratuitously bad votes have pulled down this first-rate documentary, which should not be seen by squeamish viewers or people looking to have 'entertainment' with their popcorn and soda. no reliance on special effects, contrived whirlwind plots, just the real deal - interesting characters with life stories of a kind your typical middle-class film buff never comes across, parallel stories that develop organically. a great example that you can make a good flick on a small budget (and vice-versa)...",
         "The people in this documentary are the saddest, most pathetic group I've ever seen in my life. They shoot up, prostitute, then repeat. Unflinching, pretty hardcore. HBO makes really good documentaries, not trying to sugarcoat or alter society, they convey it to us with a style that is not added, but already there.",
         "I found the link for this doc on a fellow users blog. It broke my heart, I have been using heroin daily for almost 20 years, I have only 1 usable vein in my neck, I have had DVT in both legs and have lived a truly hectic life as a result of my addiction. That said, my life seems a picnic compared to these poor lost souls. This film really tugged at my heartstrings. These poor kids are living a life of self destruction in the extreme.( And you can bet your last dollar there is an awful underlying reason for it (like a 5 year old girl being raped by her own grandfather). Living in the UK I don't have to worry too much about aids and I think we get better quality heroin here.(The black tar verity has a high acetic acid content which can burn out the vein in double time). It really is an insight into the problems of addiction young people are facing in modern times. I would recommend watching it but be warned, if you have friends or loved ones with a heroin problem, it may open your eyes but will almost certainly break your heart, unless of course your heartless, or have a small minded hatred of addicts. 10/10.",
         "I have known a few people caught in the horror of heroin, this documentary is very accurate and done well. It is very depressing but very true. I only hope HBO will do a follow-up story (if any of the people featured are still alive).",
         "I did not see this documentary in its entirety, but what I did see definitely made an impact. The images are still with me today of those who were ravaged by heroin addiction. I caught the second half. One couple lived in a slummy hotel. The boyfriend was dealing and selling at the same time. He talked about how he once said he would never shoot up; once he began doing that he said he would never shoot through his neck. Sadly, we see him do that during this documentary. The others lives were just as depressing. Two of the addicts call their family members during the documentary. This was sad because it reminds viewers that they still have people who care about them. I would like to see a follow up on those featured. I hope they were able to get help. I agree with other posters that this is a good film to show young people."
      ],
      "genres": ["Documentary"],
      "productionCompanies": ["Tapestry International Productions"],
      "summaries": [],
      "budget": 0
   },
   "movielensId": 3303,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-03-17",
      "dvdReleaseDate": null,
      "directors": ["Steven Okazaki"],
      "runtime": 75,
      "movieId": 3303,
      "title": "Black Tar Heroin: The Dark End of the Street",
      "mpaa": "R",
      "actors": [""],
      "imdbMovieId": "0221023",
      "originalTitle": "Black Tar Heroin: The Dark End of the Street",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "The film follows a simple structure, and shows the drug-related degradation of five youths (Jake, Tracey, Jessica, Alice, Oreo) during the course of three years. The film depicts drug-related crimes and diseases: prostitution, male prostitution, AIDS, and lethal overdoses.",
      "tmdbMovieId": 79515,
      "avgRating": 3.51744,
      "releaseYear": "2000",
      "numRatings": 86,
      "posterPath": "/uzLDUtdl5U4Oy2QRScfHeodBGP6.jpg"
   }
}