{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "robbery",
            "id": 642
         },
         {
            "name": "bar",
            "id": 1010
         },
         {
            "name": "blackmail",
            "id": 1936
         },
         {
            "name": "drinking",
            "id": 15111
         },
         {
            "name": "union",
            "id": 15137
         },
         {
            "name": "blue collar worker",
            "id": 174099
         },
         {
            "name": "assembly line",
            "id": 216620
         }
      ],
      "imdb_id": "tt0077248",
      "video": false,
      "title": "Blue Collar",
      "recommendations": [
         147081,
         42836,
         50627,
         42134,
         42816,
         46212,
         162666,
         62839,
         163104,
         260609,
         144788,
         119767,
         21849,
         31993,
         24229,
         48169,
         21948,
         22828,
         17687,
         27658
      ],
      "backdrop_path": "/5aNfLlsRZWLEJBjWMc2vPkB7QDz.jpg",
      "revenue": 6521083,
      "reviews": [{
         "author": "Rossrevenge",
         "id": "5a7f659a0e0a262aa2012f69",
         "content": "A serious role for Pryor with a good cast and a message that should hit home for any ordinary working man. Well worth the watch.",
         "url": "https://www.themoviedb.org/review/5a7f659a0e0a262aa2012f69"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Zeke Brown",
               "gender": 2,
               "credit_id": "52fe461f9251416c7506dd33",
               "name": "Richard Pryor",
               "profile_path": "/hzJ3Q7wDLv4m82eMTbK2tzVzCHG.jpg",
               "id": 9309,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Jerry Bartowski",
               "gender": 2,
               "credit_id": "52fe461f9251416c7506dd37",
               "name": "Harvey Keitel",
               "profile_path": "/4IcHhp1SCKijRxb7kqnxZNJuKdn.jpg",
               "id": 1037,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Smokey James",
               "gender": 0,
               "credit_id": "52fe461f9251416c7506dd3b",
               "name": "Yaphet Kotto",
               "profile_path": "/qsaWzjzI41EXMldEn6sSp5fnsQ0.jpg",
               "id": 5050,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Bobby Joe",
               "gender": 2,
               "credit_id": "52fe461f9251416c7506dd3f",
               "name": "Ed Begley Jr.",
               "profile_path": "/au4qlxxeHitgPDHmt7WhWTA7Znb.jpg",
               "id": 42157,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Eddie Johnson Union President AAW Local 291",
               "gender": 2,
               "credit_id": "52fe461f9251416c7506dd43",
               "name": "Harry Bellaver",
               "profile_path": "/w5XJVOBvcnpsKQjHU7anvBLbsoz.jpg",
               "id": 69026,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Jenkins",
               "gender": 0,
               "credit_id": "52fe461f9251416c7506dd47",
               "name": "George Memmoli",
               "profile_path": "/1liphwhWaxrjWqgsxFhiNMTvUGY.jpg",
               "id": 2563,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Arlene Bartowski",
               "gender": 1,
               "credit_id": "52fe461f9251416c7506dd4b",
               "name": "Lucy Saroyan",
               "profile_path": "/avfE4GjcZIhmpfU1zGh2KF19ZDK.jpg",
               "id": 127735,
               "order": 6
            },
            {
               "cast_id": 20,
               "character": "Clarence Hill, Union Steward",
               "gender": 2,
               "credit_id": "53dca167c3a3684331000ecb",
               "name": "Lane Smith",
               "profile_path": "/js7GonfBVNHLYhaB0Xjtnm93DpH.jpg",
               "id": 65019,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "John Burrows",
               "gender": 0,
               "credit_id": "52fe461f9251416c7506dd53",
               "name": "Cliff DeYoung",
               "profile_path": "/twUWn2BMLqf8Cr1tlnZq5gKOb8A.jpg",
               "id": 44301,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Dogshit Miller, Foreman",
               "gender": 2,
               "credit_id": "52fe461f9251416c7506dd57",
               "name": "Borah Silver",
               "profile_path": null,
               "id": 127736,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Caroline Brown",
               "gender": 0,
               "credit_id": "52fe461f9251416c7506dd5b",
               "name": "Chip Fields",
               "profile_path": null,
               "id": 127737,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Hank",
               "gender": 2,
               "credit_id": "52fe461f9251416c7506dd5f",
               "name": "Harry Northup",
               "profile_path": "/l8Xgvu4iYGBcuHEPJYL5DmLS6FN.jpg",
               "id": 127738,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Sumabitch",
               "gender": 2,
               "credit_id": "52fe461f9251416c7506dd63",
               "name": "Milton Selzer",
               "profile_path": "/104NuoOSNK1pDgCgUjYqP2jsqNF.jpg",
               "id": 101901,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Barney",
               "gender": 0,
               "credit_id": "52fe461f9251416c7506dd67",
               "name": "Sammy Warren",
               "profile_path": null,
               "id": 127740,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Mr. Bird, I.R.S. Man",
               "gender": 2,
               "credit_id": "52fe461f9251416c7506dd6b",
               "name": "Leonard Gaines",
               "profile_path": null,
               "id": 16540,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe461f9251416c7506dd71",
               "name": "Paul Schrader",
               "profile_path": "/hLdjFQOtgnvgKVL73dH6CWluicy.jpg",
               "id": 1035,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe461f9251416c7506dd77",
               "name": "Paul Schrader",
               "profile_path": "/hLdjFQOtgnvgKVL73dH6CWluicy.jpg",
               "id": 1035,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe461f9251416c7506dd7d",
               "name": "Leonard Schrader",
               "profile_path": null,
               "id": 70280,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 3.530546,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 14839,
      "vote_count": 38,
      "budget": 0,
      "overview": "Fed up with mistreatment at the hands of both management and union brass, and coupled with financial hardships on each man's end, three auto assembly line workers hatch a plan to rob a safe at union headquarters.",
      "similar": [
         949,
         11958,
         4771,
         500,
         154400,
         1844,
         4597,
         294652,
         9679,
         320,
         298,
         9654,
         75656,
         180863,
         359412,
         654,
         445954,
         9472,
         562,
         433808
      ],
      "original_title": "Blue Collar",
      "runtime": 114,
      "poster_path": "/5V2dnvvuI813QqZVlMW10VmCWkw.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "TAT Communications Company",
            "id": 14109,
            "origin_country": ""
         },
         {
            "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
            "name": "Universal Pictures",
            "id": 33,
            "origin_country": "US"
         }
      ],
      "release_date": "1978-02-10",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "Whatever became of the American Dream?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Paul Schrader"],
      "runtime": 114,
      "synopsis": null,
      "writers": [
         "Paul Schrader",
         "Leonard Schrader"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0077248/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM1MDg4OTg5N15BMl5BanBnXkFtZTcwMzQyNDYyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Richard Pryor, Harvey Keitel, Yaphet Kotto | See full cast and crew »"],
      "reviews": [
         "Three workers in a car plant take it onto themselves to rob the safe of their Union office. They come away with only $600 but they find themselves with information that they can use to blackmail the union. However the union plans to kill the men and turn them against each other. From the writer of Taxi Driver comes this tough little social piece about how the working man is screwed by the `system'. The plot follows three men trying to make out (admittedly illegally) and the way the system uses them against each other etc to shut them up. The plot is very clever and the writing is superb. Pryor is great \u0096 he could have been his comedy self but his acting is really sublime. Likewise Keitel and Kotto are on top form and the support from Begley et al is really good. The film will engross you and the final shot and line will stay with you for years. Overall \u0096 an underrated classic that deserves as many viewers as possible.",
         "Paul Schrader is often overshadowed by his more famous collaborator Martin Scorsese, which is a shame, because despite Schrader's own movies being wildly uneven, when they are good they are very good indeed. 'Blue Collar' is one of his very best works. A funny, sad and powerful look at three working class guys in a Detroit car factory, it is one of the last Hollywood movies to seriously look at your average working joe and the problems he faces on a daily basis. The three leads are all wonderful, and despite rumoured off screen problems, show a lot of genuine rapport and comaraderie. Harvey Keitel ('Mean Streets', 'Bad Lieutenant') is one of the finest actors of his generation, and Yaphet Koto ('Alien', 'Live And Let Die') is a well respected character actor, but the revelation here is funny man Richard Pryor ('Silver Streak') who displays a depth of talent few would have thought him capable of. The three buddies are joined by a first class supporting cast including Lane Smith ('Over The Edge'), Cliff De Young ('The Hunger') and George Memmoli ('The Phantom Of The Paradise'). Also keep an eye out for a brief cameo by future 'Repo Man' star Tracey Walter, who Schrader also used in a bit part in his next movie 'Hardcore'. 'Blue Collar' is a fine movie, one of the most underrated of the 1970s, and still relevant and powerful twenty five years later. Don't miss it.",
         "Certain films remain at the back of one's mind for many years. The first time I saw the film, on television, I was impressed by the realism of the situation and honesty of acting. The film is enhanced by the driving power of the theme music. Years later, I again saw the film on television and was reminded of it and how good it is. The lead actors, Yaphet Koto, Harvey Keitel and Richard Prior, must have enjoyed much critical acclaim from fellow actors for their performances. I would recommend it to anyone who enjoys a good story without too obvious predictability and easy options, especially those who think that all American movies are romanticism floss.",
         "This is a great film. I knew little about it going in, other than it was supposed to be a very well done, searing drama (this according to several film books, including Leonard Maltin's yearly tomes). I was not disappointed. Paul Schrader - writer of \"Taxi Driver,\" \"Raging Bull,\" and writer/director of \"Affliction\" - delivers yet another gritty, working-class drama. But the film is not without liberal doses of humor, provided chiefly by Richard Pryor in what I consider to be the best performance of his career. C'mon, people! How can you go wrong with Pryor, Harvey Keitel, and Yaphet Kotto (answer: you can't). The films hooks you right from the great opening credit sequence and doesn't let go 'til the final freeze-frame. I won't give the twists and turns of the plot away, but the film centers on three desperate Detroit auto workers and their corrupt union. It's very disappointing this film is so overlooked today (it also flopped when released)... the level of acting and direction (this was Schrader's directorial debut) is astonishing. See this movie!",
         "Excellent urban drama depicting the lives of three friends who work at a car plant, and plan revenge on their boss. Pryor is great in the lead role, which is probably his best performance in a movie. Schrader does a fine job in his directorial debut and makes this film a pure enjoyment. Bravo for Keitel and Kotto in their supporting roles. A highly underrated film that deserves much better than it got. 4 out of 5",
         "I first caught sight of this at 1am, in the usual late night films that normally send you straight off to sleep. Not this film. I was still awake at 2.30 when it ended. Richard Pryor deserves more credit for this role than he has received. By that I mean he's received no credit for a great performance and just shows that the man had more talent than was given credit. I urge any person thinking of a union career to watch this and then do the opposite of the characters. A gritty union drama that you can't stop watching from beginning to end.",
         "I was extremely impressed with the acting of the 3 main characters(Pryor, Kotto, and Keitel). Since I grew up in Detroit and my Dad and uncles worked for the big 3 the Auto Industry angle caught me. In the scene where Keitel was on the Belle Isle Bridge, I spotted in the background the Uniroyal Tire Company, where my Grandad worked for over 40 years. Yet Pryor's performance was terrific. The scene with the IRS agent was CLASSIC and a perfect example of blending comedy into a not so funny situation for Zeke's somewhat straight character. I thoroughly enjoyed this movie and seeing some old landmarks and areas the way they were was a treat.",
         "\"Blue Collar\" opens with a masterful title sequence which introduces us, quickly and effectively, to the harsh world our characters reside in and to the nature of the conditions in the factory they work in. The opening sequence is set to Jack Nitzsche's \"Hard Workin' Man\", introducing blues music to us right off the bat, music that not only makes up basically all of the music in this film but can be seen as a motif or even a character in the film. It's amazing how confident and mature Paul Schrader is as a director at this point. Of course, Schrader had already written the massively acclaimed \"Taxi Driver\" by 1978, but contrary to what one might expect it's his confident and sure handling of the pace and mood in \"Blue Collar\" that is truly the highlight of the film, not the screenplay penned by Paul and Leonard Schrader, granted the screenplay is in itself quite terrific. Schrader is already a mature director who understands the rhythm of a film. Going back to the use of music in this film, it isn't so much the score itself by Jack Nitzsche (which is, don't get me wrong, solid blues) that's impressive, it's Schrader's handling of the music and sound in general in this film that makes it work so well. First off, the choice to go with a blues score is inspired in itself, as the nature of the music so perfectly captures what these characters are going through. In addition, the score is most noticeable during scenes where the film appears to be commenting on the futility of the characters' struggle and the misery of what they're going through. Where many films would use music to 'enhance' big, dramatic scenes, Schrader's \"Blue Collar\" makes the wise decision to use it during low-key scenes. There are several scenes that don't feature any music at all, these being some of the more important scenes. Note the scene where Smokey gets trapped in the paint room, absolutely no music, just the cold sound of the machinery (expertly mixed, might I add), which is far creepier and more effective than any score could be at that point. Similar use of sound occurs a few minutes before the end when Harvey Keitel's character Jerry is being chased. The acting here is uniformly superb with Keitel possibly giving his best performance (or at least one of them), and Richard Pryor offering what must be recognized as one of the finest performances of the 70's by anyone. Really, who knew Pryor had this sort of skill when it comes to dramatic acting? Yapphet Koto, a beloved character actor, does a fine job in rounding out the cast for the main three characters. Again, Schrader must be credited for directing his actors so well. It's well-known, of course, that the three leads hated each other and actually broke out in fistfights between takes on occasion. Perhaps that created a sort of demented chemistry between them. The screenplay by Schrader and Schrader (Paul and Leonard) is a fine, fine piece of writing, sort of the daytime factory-worker version of the crude-yet-poetic \"Taxi Driver\" screenplay. Oddly enough, it's also the source of the few major flaws in this film, as it can come across as fairly heavy-handed in certain scenes. If there's one thing I'd definitely do differently with this film, it's the final shot, which would have been terrific had this been a comedy. All in all, a great film in its own right and especially impressive as a directorial debut from Schrader. Very memorable. 9/10",
         "Blue Collar is a breakthrough for writer Paul Schrader as a director, but also for comedian/actor Richard Pryor. Before this, he was known for his stand-up, co-writing for Blazing Saddles and once in a while comic acting role, but here he shows his true colors of being an exceptional actor of talent. Here, he plays one of 3 auto workers (including great performances by Harvey Keitel and Yaphey Kotto) who are tired of getting ripped off by there company and (surprisingly) there union. So, they fight back, with some bad results. The plot is unfolding, which helps, but it is overall the performances by the 3 leads that give this film it's gigantic kick (and what a kick). Most likely filmaker Michael Moore's favorite film ever made, but for other people it is entertaining drama nevertheless. A+",
         "Ever worked in a sh***y car factory?Ever been on strike?Ever been f***ed over by your boss AND your union?No?Well,writing as someone who has experienced all the former,let me tell you that BLUE COLLAR is the truest story of car making,sweat drippin',metal bashing,production line workin' anger your gonna see.I'm writing this 28 years after its making,and I can honestly say that at no time before have I ever seen the frustration of working class men so accurately and painfully displayed.I find it hard to comment on this film objectively,because,as I have said,I've witnessed it for 11 years.From coffee machines stealing money and ball breaking foremen,to friendships destroyed over ambition and men pushed to breaking point,this film is a true reflection of life on \"the Track\". For most it will be gritty drama,for others it will be all too familiar..."
      ],
      "genres": [
         "Crime",
         "Drama"
      ],
      "productionCompanies": ["TAT Communications Company"],
      "summaries": ["Three workers, Zeke, Jerry and Smokey, are working at a car plant and drinking their beers together. One night when they steal away from their wives to have some fun they get the idea to rob the local union's bureau safe. First they think it is a flop, because they get only 600 dollars out of it, but then Zeke realizes that they also have gotten some 'hot' material. They decide to blackmail their union. The best reason for that is the union itself. All three are provoked by the fact that the union claims to have lost 10,000 dollars by their robbery."],
      "budget": 0
   },
   "movielensId": 3304,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1978-02-10",
      "dvdReleaseDate": "2000-02-08",
      "directors": ["Paul Schrader"],
      "runtime": 114,
      "movieId": 3304,
      "title": "Blue Collar",
      "mpaa": "R",
      "actors": [
         "Richard Pryor",
         "Harvey Keitel",
         "Yaphet Kotto",
         "Ed Begley Jr.",
         "Harry Bellaver",
         "George Memmoli",
         "Lucy Saroyan",
         "Lane Smith",
         "Cliff DeYoung",
         "Borah Silver",
         "Chip Fields",
         "Harry Northup",
         "Milton Selzer",
         "Sammy Warren",
         "Leonard Gaines"
      ],
      "imdbMovieId": "0077248",
      "originalTitle": "Blue Collar",
      "genres": [
         "Drama",
         "Crime"
      ],
      "youtubeTrailerIds": [
         "P1zuIEjgfzI",
         "ysKtky6FExM"
      ],
      "plotSummary": "Fed up with mistreatment at the hands of both management and union brass, and coupled with financial hardships on each man's end, three auto assembly line workers hatch a plan to rob a safe at union headquarters.",
      "tmdbMovieId": 14839,
      "avgRating": 3.67681,
      "releaseYear": "1978",
      "numRatings": 345,
      "posterPath": "/mvSgpNIRLotosfzwRdwM9GwwH8W.jpg"
   }
}