{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "suspense",
            "id": 9937
         },
         {
            "name": "b movie",
            "id": 11034
         }
      ],
      "imdb_id": "tt0036653",
      "video": false,
      "title": "Bluebeard",
      "recommendations": [
         45975,
         55601,
         25498,
         78146,
         34752,
         73595,
         74437,
         41553,
         41551,
         61501,
         44137,
         84364,
         47305,
         59165,
         28561,
         37485,
         42294,
         36461,
         44623,
         35546
      ],
      "backdrop_path": "/3uNb5Dhu2gnszdpzMZDCroeEErR.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Gaston Morrell",
               "gender": 2,
               "credit_id": "52fe45f2c3a36847f80e3b89",
               "name": "John Carradine",
               "profile_path": "/iv9pZ2JRddIUNe2RgYAKmUR55WO.jpg",
               "id": 8516,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Lucille",
               "gender": 1,
               "credit_id": "52fe45f2c3a36847f80e3b8d",
               "name": "Jean Parker",
               "profile_path": "/sAnclUs45jPwKIBM2mFViQkiV2H.jpg",
               "id": 81798,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Inspector Lefevre",
               "gender": 2,
               "credit_id": "52fe45f2c3a36847f80e3b91",
               "name": "Nils Asther",
               "profile_path": "/cdH44pecJTj7Md5N7wDYZD2A0CO.jpg",
               "id": 29036,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Jean Lamarte (as Ludwig Stossel)",
               "gender": 2,
               "credit_id": "52fe45f2c3a36847f80e3b95",
               "name": "Ludwig Stössel",
               "profile_path": "/7qFEZlL8vkrm4E3aJZy1rVWVK9m.jpg",
               "id": 31209,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Inspector Renard",
               "gender": 0,
               "credit_id": "52fe45f2c3a36847f80e3b99",
               "name": "George Pembroke",
               "profile_path": "/tCpEBbmXoDses6eyRSnp2taKZ8V.jpg",
               "id": 89253,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Francine",
               "gender": 1,
               "credit_id": "52fe45f2c3a36847f80e3b9d",
               "name": "Teala Loring",
               "profile_path": "/n86sSPZReNImz3AO630mGouivVO.jpg",
               "id": 103937,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Renee",
               "gender": 1,
               "credit_id": "52fe45f2c3a36847f80e3ba1",
               "name": "Sonia Sorel",
               "profile_path": null,
               "id": 6815,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Deschamps",
               "gender": 2,
               "credit_id": "52fe45f2c3a36847f80e3ba5",
               "name": "Henry Kolker",
               "profile_path": "/o1FLtKbhJEToYRpP7kMYNthdoLj.jpg",
               "id": 80236,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Le Soldat",
               "gender": 2,
               "credit_id": "52fe45f2c3a36847f80e3ba9",
               "name": "Emmett Lynn",
               "profile_path": "/arewiyVkTRryHwdKwi4g2hFMXXG.jpg",
               "id": 96710,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Mimi",
               "gender": 1,
               "credit_id": "52fe45f2c3a36847f80e3bad",
               "name": "Iris Adrian",
               "profile_path": "/lLZZYHBg14NJ9aUt7BqeCQri36q.jpg",
               "id": 34509,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Babette",
               "gender": 1,
               "credit_id": "52fe45f2c3a36847f80e3bb1",
               "name": "Patti McCarty",
               "profile_path": "/4nj5YTUKkb1dt1v0fpWMTq2uQMt.jpg",
               "id": 127549,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Constance",
               "gender": 0,
               "credit_id": "52fe45f2c3a36847f80e3bb5",
               "name": "Carrie Devan",
               "profile_path": null,
               "id": 127550,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "Jeanette",
               "gender": 1,
               "credit_id": "52fe45f2c3a36847f80e3bb9",
               "name": "Anne Sterling",
               "profile_path": null,
               "id": 127551,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe45f2c3a36847f80e3b61",
               "name": "Edgar G. Ulmer",
               "profile_path": "/PU5rCuIxOPcffvceRU4K2Y9smj.jpg",
               "id": 5030,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45f2c3a36847f80e3b67",
               "name": "Arnold Lipp",
               "profile_path": null,
               "id": 111281,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe45f2c3a36847f80e3b6d",
               "name": "Werner H. Furst",
               "profile_path": null,
               "id": 127546,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe45f2c3a36847f80e3b73",
               "name": "Pierre Gendron",
               "profile_path": null,
               "id": 127547,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe45f2c3a36847f80e3b79",
               "name": "Leon Fromkess",
               "profile_path": null,
               "id": 115450,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45f2c3a36847f80e3b7f",
               "name": "Leo Erdody",
               "profile_path": null,
               "id": 121235,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe45f2c3a36847f80e3b85",
               "name": "Jockey Arthur Feindel",
               "profile_path": null,
               "id": 127548,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.128623,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 42186,
      "vote_count": 10,
      "budget": 0,
      "overview": "Young female models are being strangled inexplicably. Will law enforcement be able to stop the crime wave before more women become victims?",
      "similar": [
         189,
         10285,
         949,
         336843,
         910,
         996,
         1939,
         8834,
         845,
         72784,
         9272,
         1923,
         2163,
         223,
         9411,
         1645,
         2252,
         2832,
         12162,
         1571
      ],
      "original_title": "Bluebeard",
      "runtime": 72,
      "poster_path": "/kB5sSfwYfGONxvnY97m61O0jqQT.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Producers Releasing Corporation (PRC)",
         "id": 16466,
         "origin_country": ""
      }],
      "release_date": "1944-11-11",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "The most sinister love story ever told!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Edgar G. Ulmer"],
      "runtime": 72,
      "synopsis": "In Paris a killer is strangling young women and dumping their dead bodies into the Seine and is nicknamed \"Bluebeard \"after the classic French story of the man who murdered his wives. As women group together to travel in the evening streets, the outdoor puppet theatre of Gaston (John Carradine) becomes a popular place for people to convene. When Lucille (Jean Parker) sees Gaston's puppets she is enthralled and an emotional bond is formed with the performance artist. When Gaston returns home waiting for him is a former love Renee (Sonia Sorel) who is jealous that Gaston is interested in Lucille. In a calculated cold act Gaston strangles Renee and dumps her body into the river. As Gaston's relationship with Lucille develops police Inspector Lefevre (Nils Asther) who is the fiancé of Lucille's sister Francine (Teala Loring) and when the investigation leads them to a suspicious art dealer Lamarte (Ludwig Stossel) who may be a front for a murderous painter, Francine agrees to model for the artist who turns out to be Gaston. The police believe they have their man and close in but can they catch the killer before he kills again?",
      "writers": [
         "Arnold Phillips",
         "Werner H. Furst"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0036653/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNjg5OTU0OTIyNV5BMl5BanBnXkFtZTcwMzIxNDgxMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: John Carradine, Jean Parker, Nils Asther | See full cast and crew »"],
      "reviews": [
         "John Carradine plays Blubeard--he paints women and then strangles them to death. He doesn't want to do it but is compelled to (we find out why at the end). Then he falls in love with beautiful Lucille (Jean Parker) and tries to fight his desire... John Carradine said this was his best performance--he's right! He's dead on target in the title role. He shows that Bluebeard is not evil and driven by impulses beyond his control. He uses body language and facial expressions perfectly. Also director Edgar G. Ulmer directs this beautifully with strange camera angles and lots of shadows making this very atmospheric. Also there are some beautifully done background paintings. But this was done over at PRC--a poverty row studio. Unfortunately it shows. The furnishings and costumes look pretty tacky and it just FEELS low budget. Also the biggest problem is constant background music. It's ALWAYS playing and very annoying. Half the time the music doesn't even match the mood of what's being acted! These prevent the film from becoming a true classic. As it stands I'm giving it an 8 for Carradine and Ulmer. It should be seen just for them. Also this is one of the few films that prove what a good actor Carradine actually was.",
         "This telling of French serial killer Bluebeard (why was he called Bluebeard?) is notable for two reasons - one is John Carradine's haunting yet believable portrayal of a madman's psyche, and the other is for Edgar G. Ulmer's ability to create mood and even grandeur on a tiny budget. While Carradine's acting skills have never been in question, his over-the-top scene stealing in many small roles would make one approach him with caution in a leading role. However, Carradine manages to restrain himself enough to never grow old or cumbersome in the role, while simultaneously delivering his lines memorably - leading to the excellent final crescendo. The plot never tires, the direction is masterful, the ensemble acting (especially the devious art dealer Lamarte) far better than expected, and the final feeling one of satisfaction. While all of this is unadulterated praise, the movie does appear a tad bit stagey (via budgetary concerns) at times, and also moves slowly at certain points. Despite this, Bluebeard is not merely an excellent time-waster, but a movie worthy of any viewer going out, renting, and popping in.",
         "Set in 19th Century France, Bluebeard in some ways resembles a French Jack the Ripper tale. It is centered on Gaston Morrell (John Carradine), an eccentric visual artist and owner of a marionette show. Although I remained perplexed as to why Morrell was referred to as Bluebeard, I can't say it bothered me much, as this is an excellent, captivating horror/thriller with fine performances, great direction, cinematography and set design, and a well written, taut script. It earned a 10 out of 10 from me. The Parisian setting worked well, with the Seine playing a crucial role throughout the film. Carradine was fantastic--twisted yet debonair ala Vincent Price's best work, and even the most minor cast members were a joy to watch. Another aspect that helped push the film up to a 10 for me was the score. Although consisting of various source-music, it made perfect, prominent usage of Mussorgsky's Pictures at an Exhibition. It enhanced the tension and atmosphere of the film, and the programmatic aspect of Mussorgsky's piece is appropriate. Also worth noting are the countless references to the German expressionistic style in Bluebeard's set design and cinematography. There are strong shadows throughout most of the film. At times, the angles in the sets are as exaggerated as those in The Cabinet of Dr. Caligari (1920), and the climactic chase across Parisian rooftops was particularly reminiscent of Caligari. But the film wouldn't succeed without a great script. Bluebeard has one. There are no loose threads. The story is economical yet satisfying, finely woven, suspenseful and complex. This is an underrated film that deserves more attention.",
         "I saw this on a cheap DVD copy, and the film may have lost a bit in translation, but time has not been kind to the soundtrack, the dialogue muffled, and the background music overbearing. Even so, this is clearly a very uneven production saved mainly by the two leads and the high notes of artistry within an overall muddy piece. Carradine is fantastic. This is a great role for him, displaying diverse talents. He is unfortunately not directed with any subtlety, and it is clear that he is the villain from the beginning, so this becomes more a story of \"will the villain be redeemed by love?\" That makes this film more interesting than a standard thriller. Jean Parker is really luminous and lovely, and is the only young female in the cast that captures the feeling of the time period. The actress playing her sister is arch and tart enough to be playing a film noir gun moll, and the other young actresses are just horrible, and horribly directed, and completely out of place in a period film... they must all have come from the local bar. The movie has elements that make it interesting and artistic, the focus on painting style, the accomplished and beautiful puppet show. It becomes fairly clear that this movie should have been called The Puppetmaster... that kind of \"just missed the mark\" moment mars many elements of this film. It starts with the title BLUEBEARD, which is bandied about, but never followed up on, and continues. THE PUPPETMASTER would have been a great premise and title for this film that could have unified it. Others have mentioned this being a poverty row film, and that does endear it to me... but being from 1944, this is not that early a film, and it is simply a grade B shocker - a precursor to Vincent Price's wonderful performances in many B thriller shockers. If this was an attempt to make a period film in film noir style, it was a mismarriage. Still, I give it a 4 - slightly below average, because in the overview of film history, we have much higher budget films that are infinitely worse on all levels. A similar, earlier film, but much better on all levels, is John Barrymore's SVENGALI. If you liked this, you will LOVE that.",
         "Once I found out why John Carradine's character, a Paris portrait artist of young women, strangles them after the paintings are finished, the reason didn't seem to make much sense. But it didn't matter anyway because this picture is full of great scenes and camera angles, and extraordinary acting by everyone, especially Carradine and the beautiful Jean Parker. Parker plays a dressmaker who attends Carradine's operatic outdoor puppet show production one night in one of the film's best scenes. The city is gripped by fear of a Bluebeard, a murderer of women apparently. Nils Asther has a marvelous part as the suave police inspector as does Ludwig Stossel as the murderous artist's agent who knows the truth and blackmails him to paint women because the portraits bring a nice price. And this little movie from poverty row near brilliantly brings out a complexity and subtlety that is in almost every weirdly and creatively shot scene.",
         "Bluebeard is probably most notable for the fact that its lead star, John Carradine, famously named his role here as his favourite across his lengthy list of film credits. It's easy to see why the man himself enjoyed playing this part so much too - Carradine's role in Bluebeard allows him to act at his most sinister, and the film really depends on him as this is very much a one-man story. Carradine has just the right look for this sort of role also, and all these elements combine nicely to ensure that Carradine's part in this film is a success. The base for the plot is one of cinema's most common and most prolific, but this film is notable for being one of the earlier films to use it. We follow a deranged madman who likes to paint girl's pictures before he strangles them to death. The man himself is famous for two completely different lives; in one, he is the notorious serial killer 'Bluebeard', who prays on beautiful young women - and in the other he's Gaston Morrell, a dapper up and coming young painter. This film's major problem is certainly not with the plot, stars, or style; it's with the plotting. Bluebeard falls down primarily because it moves at snail pace. The plot is intriguing, but the way it presents itself is the opposite, and it's a shame because, if handled with care, this film could have been really good instead of just being good. Director Edgar G. Ulmer is most famous for his directing credit on classic film 'The Black Cat', and is lesser known for his set design on films such as Fritz Lang's Die Nibelungen, M and Metropolis; as well as silent classics; Sunrise and Der Golem. Ulmer's previous experience helps him with Bluebeard, as the film is constantly atmospheric, and the director makes best use of his simple sets by way of his use of the camera and the murky black and white cinematography. The film is very bleak throughout, and this massively helps the plot as it gives the film just the right amount of foreboding. Plots like this have been turned into better films since the release of this film over sixty years ago; but Bluebeard is still well worth seeing. The film starts out slow, but it does pick up and not even an extremely overlong puppet sequence can fully degenerate the film into the realms of absolute boredom. It's not must see; but worth seeing if the chance presents itself.",
         "John Carradine is on record as stating \"Bluebeard\" was his favorite film role out of well over two hundred movie appearances. Truthfully, I was surprised by the rather intriguing tale coming out of this Publishers Releasing film, rising a few notches above it's humble Poverty Row origins. The film opens with a woman's body being retrieved from the Paris River Seine by uniformed French State Police, quickly cutting to a poster warning of a \"Bluebeard\" who strangles women, and putting all citizens on notice that it's not safe to travel the city streets alone, especially at night. With this backdrop, we are quickly introduced to puppeteer Gaston Morrell (Carradine), a rather soft spoken Parisian gentleman who manages to charm the ladies with his chosen craft. Morrell however is hiding an unfathomable secret, as an artist with an unattainable ideal, he winds up strangling his feminine subjects after they have posed for their portraits. Morrell's crimes would probably have gone unsolved forever if not for the greed of his agent Jean Lamarte (Ludwig Stossel). Lamarte knows of Morrell's deadly artistic passion, and in an attempt to secure one more generous payday, unwittingly plays into the hands of the local gendarme who sets a trap for the painter. Some rather lovely young ladies offer supporting roles in this edgy and atmospheric thriller; Jean Parker portrays socialite Lucille who becomes enchanted with Morrell and agrees to make costumes for his puppets. It's her sister Francine (Teal Loring) however, who meets her demise in the trap set by the French police. As Lucille confronts Morrell with her suspicion, and with the authorities closing in, Morrell attempts to flee atop Parisian rooftops, and loses his footing when a plank gives way, plunging to his death in the river below, a graveyard familiar to his prior victims. Had this picture been filmed the same way today, the ending fairly screams \"sequel\". If there is a flaw to be found in the film, it would be the total disconnect between the story and Gaston Morrell's title as the Parisian \"Bluebeard\". Clean shaven and well attired as Morrell was, the movie offers no hint as to the derivation of the unusual moniker, even though the police warnings and local citizenry use the term quite naturally.",
         "John Carradine had always considered his role as Gaston Morrell in Bluebeard as his favorite and since it's one of his few starring ones it's easy to see why. Director Edgar G. Ulmer makes the most of the low budget he had working for poverty row studio PRC in making one of the most atmospheric horror films of the '40s. Most of the supporting cast also do well here especially Jean Parker as Lucille who Gaston falls head over heels for and Ludwig Stossel as Jean Lamarte. The woman who played Renee, Sonia Sorel, would later marry Carradine and bear kids Keith and Robert with him. Iris Adrian lends some humor in a brief court sequence. Well worth seeking for old movie horror fans.",
         "This is a decent little film but more importantly it's a chance for the star (John Carradine) to show he COULD be a leading man and not just a cheesy supporting actor. In fact, I was THRILLED to see this film because only a couple weeks ago, I saw Carradine's worst film (BILLY THE KID VERSUS Dracula). This film helped to wash away the foul stench of failure from my mind--at least temporarily. The film is, not surprisingly, a low-budget movie. Carradine played in many of these type of films but this one is different because it is actually well written, acted and engaging. And while it is NOT going to change your life by watching it, it does deliver excellent B-movie thrills.",
         "Yes, there are many DVD editions of this film available out there and apart from this one, ALL of the other editions that I've seen are terrible quality products; too dark, too grainy, too much noise on the soundtrack, soundtrack too low, an edition which used a master of the film that has the charming puppet show sequence from Gounod's opera \"Faust\" sloppily cut in places, etc. The best DVD edition that I've seen is certainly this one and it's on a triple feature DVD called Black & Blue Collection which is available through the Roan Group.com. The other films on that DVD are \"Black Dragons\" and a nice, bright, clean version of \"The Black Raven\". This Roan Group presentation of \"Bluebeard\" is, without a doubt, the best way of seeing the film on DVD."
      ],
      "genres": [
         "Crime",
         "Film-Noir",
         "Horror",
         "Thriller"
      ],
      "productionCompanies": ["Producers Releasing Corporation (PRC)"],
      "summaries": [
         "A killer of young women, dubbed Bluebeard, is loose in Paris. Lucille and her friends meet Gaston Morrell, a puppeteer. He invites them to a show the next night; they go. Afterwards, he walks with Lucille; she offers to make costumes for his next show, he accepts, and feelings develop that may lead to love. She suspects he has a tragic past. Meanwhile, his leaving the show with Lucille prompts the jealousy of Renee, Gaston's sometime lover. Lucille's younger sister, Francine, comes back to Paris - her boyfriend is Inspector Lefebre, who's hunting for Bluebeard. Some clues point toward Lamart, a greedy art dealer. Who is in danger, and can Gaston be trusted?",
         "In Paris, an artist hires portrait models, and after he finishes their portraits, he strangles them."
      ],
      "budget": 0
   },
   "movielensId": 3305,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1944-11-11",
      "dvdReleaseDate": "2000-02-08",
      "directors": ["Edgar G. Ulmer"],
      "runtime": 72,
      "movieId": 3305,
      "title": "Bluebeard",
      "mpaa": "",
      "actors": [
         "John Carradine",
         "Jean Parker",
         "Nils Asther",
         "Ludwig Stössel",
         "George Pembroke",
         "Teala Loring",
         "Sonia Sorel",
         "Henry Kolker",
         "Emmett Lynn",
         "Iris Adrian",
         "Patti McCarty",
         "Carrie Devan",
         "Anne Sterling"
      ],
      "imdbMovieId": "0036653",
      "originalTitle": "Bluebeard",
      "genres": [
         "Horror",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": ["CEUqD5RdaLk"],
      "plotSummary": "Young female models are being strangled inexplicably. Will law enforcement be able to stop the crime wave before more women become victims?",
      "tmdbMovieId": 42186,
      "avgRating": 3.04717,
      "releaseYear": "1944",
      "numRatings": 53,
      "posterPath": "/njgfE8gGagLykjloy5DQa2ry3Z4.jpg"
   }
}