{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "circus",
            "id": 291
         },
         {
            "name": "charlie chaplin",
            "id": 182824
         }
      ],
      "imdb_id": "tt0018773",
      "video": false,
      "title": "The Circus",
      "recommendations": [
         962,
         30588,
         28971,
         10098,
         992,
         901,
         36208,
         32318,
         31411,
         25768,
         22596,
         47653,
         198,
         701,
         32600,
         14537,
         28973,
         643,
         777,
         961
      ],
      "backdrop_path": "/8zfRWaQuWRun0e9I1LlRN4J3JIB.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "talisencrw",
         "id": "570d946ec3a3680a3900070f",
         "content": "When I'm faced with challenges in my life, I am somewhat heartened by something I learned as a child, that an oyster has to be irritated by a grain of sand in order to eventually make a pearl. That knowledge always made the load I was carrying seem less significant, and helped me to see the light at the end of the tunnel, so to speak. Cinematically speaking, at least in the fine age of silent movies, one of the most difficult gestation periods for the birth of a great film was the highly traumatic 11 months of production for one of Sir Charles Chaplin's masterpieces, 'The Circus'.\r\n\r\nI love both silent cinema and early filmic comedies, and though I prefer Buster Keaton to Chaplin, I always enjoy his great works, up to and including 'The Great Dictator'. Particularly close to my heart is 'The Circus'. Considering all of the brutal disasters Sir Charles Chaplin was facing during the movie's elongated production (ruined film negative, studio burning down, Lita Grey's divorce papers [and the related sex-scandals hitting the papers], nervous breakdown, mother dying, IRS demanding a million in back taxes, one of the circus wagons being stolen, just to mention a few), it's miraculous that a film was released at all, let alone one as gracefully hilarious yet contemplatively mature as 'The Circus', and that he was able to both recover and rebound from this bad spell to have a superlative career as one of the greatest actor/directors ever to grace cinema. His life was basically a three-ring circus, and he was still able to retain his dignity and escape virtually unscathed.\r\n\r\nBecause of the aforementioned trials and tribulations he endured in those eleven months of the film's making (which IMHO would be worthy of a fine film itself, in its documentation and chronicling), though it may not be as side-splitting in its hilarity as 'The Gold Rush' or 'Modern Times', it will probably hold the closest place to my heart of Chaplin's films.",
         "url": "https://www.themoviedb.org/review/570d946ec3a3680a3900070f"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "A Tramp",
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06cae5",
               "name": "Charlie Chaplin",
               "profile_path": "/pcvSg2LqnyVFel9dPIwTRagpfur.jpg",
               "id": 13848,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "The Circus Proprietor and Ring Master (as Allan Garcia)",
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06cad5",
               "name": "Al Ernest Garcia",
               "profile_path": "/98wGaV0ibbtuvucy2wNLMXhdgqo.jpg",
               "id": 13855,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "His Step-daughter, A Circus Rider",
               "gender": 1,
               "credit_id": "52fe45bfc3a368484e06cae9",
               "name": "Merna Kennedy",
               "profile_path": "/z7a2thEyzbz2eFcwYEiDVH92Pxr.jpg",
               "id": 147962,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Rex, A Tight Rope Walker / Disgruntled Property Man / Clown",
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06caed",
               "name": "Harry Crocker",
               "profile_path": null,
               "id": 147963,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "A Magician",
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06caf1",
               "name": "George Davis",
               "profile_path": null,
               "id": 120701,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "An Old Clown",
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06caf5",
               "name": "Henry Bergman",
               "profile_path": "/lXhkLU19RhgFD95zx84jjXhhyE.jpg",
               "id": 14438,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "The Head Property Man",
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06caf9",
               "name": "Tiny Sandford",
               "profile_path": "/4Tw4KnA3S8dhl9tIs2v9aa0Va1c.jpg",
               "id": 30194,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "An Assistant Property Man / Clown",
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06cafd",
               "name": "John Rand",
               "profile_path": null,
               "id": 21310,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "A Pickpocket",
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06cb01",
               "name": "Steve Murphy",
               "profile_path": null,
               "id": 147964,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06cadb",
               "name": "Charlie Chaplin",
               "profile_path": "/pcvSg2LqnyVFel9dPIwTRagpfur.jpg",
               "id": 13848,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06cae1",
               "name": "Charlie Chaplin",
               "profile_path": "/pcvSg2LqnyVFel9dPIwTRagpfur.jpg",
               "id": 13848,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 6.450972,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 28978,
      "vote_count": 162,
      "budget": 9000000,
      "overview": "Charlie, a wandering tramp, becomes a circus handyman and falls in love with the circus owner's daughter. Unaware of Charlie's affection, the girl falls in love with a handsome young performer. Charlie's versatility makes him star of the show when he substitutes for an ailing tightwire walker. He is discharged from the company when he protects the girl from her father's abuse, but he returns and appeals to the handsome performer to marry the girl. After the wedding the father prevails upon them to rejoin the circus. Charlie is hired again, but he stays behind when the caravan moves on.",
      "similar": [
         11360,
         55787,
         700,
         136,
         1966,
         346364,
         278927,
         587,
         285783,
         316029,
         12222,
         87,
         68728,
         10679,
         8982,
         112454,
         1730,
         8054,
         14001,
         1688
      ],
      "original_title": "The Circus",
      "runtime": 71,
      "poster_path": "/awTf4Y6TGvgi3VYtGNINyyJJy9Q.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Charles Chaplin Productions",
         "id": 1315,
         "origin_country": ""
      }],
      "release_date": "1928-01-06",
      "vote_average": 8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Charles Chaplin"],
      "runtime": 71,
      "synopsis": null,
      "writers": ["Charles Chaplin"],
      "originalLanguage": null,
      "imdbLink": "http://www.imdb.com/title/tt0018773/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU3Mjg0NzUzMl5BMl5BanBnXkFtZTgwNDk5MTE3MzE@._V1_SY317_CR7,0,214,317_AL_.jpg",
      "actors": ["Stars: Charles Chaplin, Merna Kennedy, Al Ernest Garcia | See full cast and crew »"],
      "reviews": [
         "I enjoyed this a lot more the second time when I could see it on a very clear DVD print. I don't know why that would make a difference with the story, but it did as I found it very good for the entire distance, although that's just a scant 69 minutes. In the story, Charlie Chaplin does his normally-great physical slapstick so well that he accidentally becomes a hit at the circus, which is run by a nasty man (Allan Garcia) who regularly beats his sweet step-daughter, played by a very pretty Merna Kennedy. Charlie, of course, gets smitten by her and comes to her rescue. This movie has a different kind of ending that what you'd normally see for a comedy but it's inspiring as Chaplin performs a noble deed. (However, Kennedy's character is in question as she seems satisfied to marry either of two men. Huh?) Chaplin's timing and clever slapstick routines never fail to amaze me. Even though silent films aren't seen by many people these days, it's works of art like this that will endure forever. This is not of one of Chaplin's more famous movies.....but it should be. I think it's one of his best.",
         "The Circus is probably Chaplin's most underrated film. It is (easily) one of the funniest movies ever, and the inventiveness of such shots as the Mirror Maze scene and the closing sequence are nothing less than brilliant. What separates Chaplin from other comedian filmmakers is his ability to evoke a sense of pity and/or sympathy for his character. How can you watch the closing scenes of this film and, even after all of the laughter, NOT sense a bit of melancholia welling up in your heart? Truly one of the greats.",
         "Charlie Chaplin is a film-maker who isn't given enough credit, in my opinion: sure, people think he's funny, but few seem to recognize the underlying melancholy of his work. In The Circus, our favorite little tramp is running from the law and stumbles upon a carnival, unwittingly becoming the center act and falling in love with a beautiful trapeze artist (Merna Kennedy). Even though this seems like the recipe for a feel-good romantic comedy, in Chaplin's vision, the guy doesn't get the girl. We essentially find ourselves laughing at an unemployed homeless man who needs to make an ass out of himself in order to escape the police -- which is nothing worth laughing at, when you really think about it. Nevertheless, Chaplin created some of the most uproarious scenes in movie history, combining his ingenious slapstick with a genuine humanity that made his character feel like more than just an object of humiliation. The Circus is certainly one of his most under-rated features, showing a darker sense of love and longing than any of his other work: the film opens with a repeated shot of his object of desire swinging on the rings with a forlorn gaze drifting into space. The final shot has the little tramp walking away from the woman he loves, alone: never before (or since) have we so sensed Chaplin's true gloominess. But if I'm making The Circus sound like a serious film, then I've been deceiving you, for it is a very funny movie indeed: Chaplin's gags are innovative and perfectly timed, and he always managed to keep his running time perfectly suited to the audience's interest. Yet in spite of how funny this movie truly is, the parts I remember most are still those that reached a deeper level of human emotion: the scenes between Chaplin and his lover are meant to be comical, but I couldn't help but notice the honesty and poignancy he injected into each vignette. This is as much a romance as it is a comedy -- and a drama, for that matter. It has been said that, two thirds during the shoot of the film, Chaplin had a nervous breakdown; considering the mostly morose tone of the film, that doesn't surprise me. But when film-makers have personal struggles, it typically only increases the authenticity and greatness of their work (just look at Woody Allen's career). Quite simply, The Circus is an American classic: Chaplin not only directed and starred in, but he produced, edited, and even composed original music for his films. His direction is superb -- not only from a comical standpoint, but from a cinematic one as well; one particular scene comes to mind that takes place in a house of mirrors, in which Chaplin uses a repeated set-up to convey a feeling of simultaneous order and confusion. His acting is plain brilliant -- if you can call it acting: he's one of those performers that you watch and smack your head in awe of how extraordinary he is. In a way, The Circus isn't a masterpiece, nor a perfect film, nor even a particularly great one -- but in another way, it is all those things and more. It is a splendid example of just how much can be done within a simple genre movie, and modern film-makers would do themselves a favor by learning from it. Grade: A",
         "Do not be mislead by the ne'er do wells who claim this movie as Chaplin's weakest. The plot is not intricate, but Charlie doesn't need an intricate plot to make us laugh out loud. \"The Circus\" proves this. Saying that this film is boring is perfectly ridiculous: there are many moments of pure Chaplin genius and, if nothing else, you simply must see this film for the tightrope-walking scene. No, it's not trick photography: that's really Charlie tightrope walking with no stuntmen of any kind. If THAT'S not exciting, I don't know what is. Oh, and just as a side note, this film was made during a time when Charlie was going through a very dirty and very public divorce-- his ex successful at having his funds frozen during the divorce, he was sued for a million in back-taxes and faced possible jail time, AND the ENTIRE SET to the circus burned down in a fire. He most definitely deserved the special Oscar he received for this film. That's right: OSCAR.",
         "Although movie buffs seldom mention `The Circus' in the same breath as Charlie Chaplin's more touted masterpieces (`City Lights,' `Modern Times,' `The Gold Rush'), this film contains some of his best work manifested in a number of ingenious sequences. Chaplin once again dons the role of the tramp, this time having all sorts of adventures (and misadventures) under the big top. In order to evade the police who suspect him of being a thief, the tramp ducks into a circus tent and acts as if he is part of the show. The cops follow him into the tent and try to apprehend him, with comical results. The crowd goes wild, believing all this was planned ahead of time. The audience's reaction is so strong that the tyrannical circus owner hires him on the spot. When it is discovered that Chaplin cannot be funny intentionally, the owner gives him a job as a prop man, clumsily lugging equipment around the tent as part of the show. Again the crowd roars its approval at his inadvertent antics, and soon the tramp is the circus' main attraction. In the meantime, he falls in love with the owner's daughter, a bareback rider who herself loves the tightrope walker, and romantic complications ensue. `The Circus' is an all-around Chaplin effort. In addition to playing the lead role, he wrote, directed, produced and edited it, and composed the music as well. It is a meticulous production on all counts, with each sequence choreographed to elicit the maximum capacity of laughter from the audience. The scenes in which the tramp is pursued through a hall of mirrors, trapped inside the lion's cage, and forced to double for the missing tightrope walker stand alongside his finest achievements. The ending sequence is especially heartrending, as many are in his films. Here is a movie to be cherished by all fans of Chaplin, but appreciated even by casual viewers. This is because it achieves a rare blend of comedy and poignancy through appealing, sympathetic characters and with genuine honesty adding a note of realism to counterbalance the clowning.",
         "Perhaps this doesn't have quite the reputation of Charlie Chaplin's greatest movies, but it is very entertaining, and it's a good showcase both for his comic genius and also for his skill as a film-maker. It's full of very funny routines along with plenty of action, with enough of a story to make you care about the characters, too. The setting in \"The Circus\" certainly gives Chaplin a lot of ready-made material, and he makes the most of it, coming up with hilarious routines involving everything from a hall of mirrors to a lion. His 'Tramp' character gets involved in all kinds of amusing predicaments that involve several other interesting characters. Most of it keeps a pretty light tone, which makes the serious parts that much more effective. And there are several sequences which, though perhaps not as well known as some of the scenes from other Chaplin films, are quite funny and creative. With plenty of humor and Chaplin's trademark sympathetic characters, this is a very enjoyable feature for anyone who appreciates classic comedy.",
         "THE CIRCUS (United Artists, 1928) written, produced, directed and starring Charlie Chaplin, is a well-documented gem about circus life, mixing comedy and sentiment in the best Chaplin tradition, ranking this one of his finer yet neglected achievements of the 1920s. In it, Chaplin plays a tramp who drifts at the midway of the circus after being wrongly accused of a theft and chased by a policeman. His escapades are mistaken as part of the act, which stirs roars of laughter from its audience. Because his circus has not been earning any profits, the ringmaster/owner (Allan Garcia) decides in hiring Charlie as his top attraction. However it is learned that Charlie is only funny whenever he blunders to his viewing public. Charlie soon learns from the abused Merna (Merna Kennedy), how valuable he really is, thus, making demands of quitting to his employer unless he ceases mistreating his stepdaughter, and offers him a higher salary, which he does. All goes well until Rex (Henry Crocker), \"King of the High Wire,\" joins the circus and becomes attracted to Merna, causing Charlie to vie for her affections any which way he can. With the circus being one of the more famous backdrops of many movie comedians and/or comedy teams ranging from W.C. Fields to Laurel & Hardy, The Marx Brothers to Martin and Lewis, THE CIRCUS stands out more for its ingenious use of difficult gags, comic timing and the effort that went into it to make every gag funny as well as realistically done. Rarely seen since its original theatrical release, THE CIRCUS came into full view again shortly after Chaplin's death in 1977. Newly scored and restored by Chaplin himself in 1968 (as mentioned in the new opening titles), with his singing of \"Swing Little Girl\" recorded on the soundtrack during the opening credits, my first experience with THE CIRCUS was in 1980 at New York City's Regency Theater, 68th Street and Broadway, where the revival theater (which no longer exists, having been demolished in 1998) paid a tribute to Chaplin with a series of shorts and features, including THE KID (1921), MODERN TIMES (1936) and THE GREAT DICTATOR (1940). Being surrounded by an appreciative audience laughing at a silent film made long ago indicated d THE CIRCUS has stood the test of time and what a comic genius Chaplin was, especially when demonstrating how difficult performing comedy can be as his character finds he has to be funny and isn't, and at the same time showing how poor he is as a comic to the circus staff and how funny he is as a bad comedian to the movie audience. While sitting in the dark movie theater of all ages at the Regency, the biggest laughs occurred during the opening as Chaplin hides from the law inside a fun house surrounded by mirrors and later making a fool out of the rival pickpocket (Steve Murphy) as they each attempt to fool the policeman by pretending to be movable statues; Charlie's encounter with a lion while locked inside the cage; and the biggest topper of all being Charlie doing a tight rope wire act and trying to balance himself while loose monkeys crawl all over him, thus disrupting his act. These same gags obviously brought forth many laughs in 1980 as it did in 1928, and continue to do so today. In between these gags comes pathos, which Chaplin also succeeds without hurting the continuity. Chaplin staff players regulars such as Harry Bergman as the Clown, and Stanley Sanford as the Head Property lead fine support. Others in the cast include Betty Morrissey as The Vanishing Lady; George Davis as The Magician; John Rand, Albert Austin and Heinie Conklin in smaller roles. In spite of its true greatness, it's hard to believe how underrated THE CIRCUS has become, not having the appreciation as Chaplin's own masterpieces, THE GOLD RUSH (1925) and CITY LIGHTS (1931), even by Chaplin himself. It's been said that during the making of THE CIRCUS, Chaplin was going through personal problems of his own, including divorce and the passing of his mother. It's even more ironic the elimination of THE CIRCUS from Chaplin's own autobiography published in 1964 while his other works were profiled to great extent, regardless of his nomination as Best Actor and Best Comedy Director by the Academy for 1927-28 awards. At least this has been amended through its reissue throughout the years to a new generation of movie lovers. Distributed onto video cassette as part of the Chaplin centennial collection in 1989, THE CIRCUS, currently on DVD, made its presence known on television in the height of cable television, notably on the weekly series, \"Dead Comics Society\" on the Comedy Channel hosted by Kevin Kline around 1989-90, followed by American Movie Classics (1997-2000) and Turner Classic Movies where it made its debut in 2003. THE CIRCUS, a 70 minute comedy, is a fine study to film students and anyone appreciating and supporting the art of silent comedy. (****)",
         "The Little Tramp is chased into a circus tent during a performance; his antics prove funnier than those of the clowns, and the ringmaster hires him for the show. When a comedian plays a character who is inadvertently hilarious, it can seem narcissistic: just check out Jerry Lewis's \"The Errand Boy\" where Lewis has his supporting cast praise the comic genius of the character played by Jerry Lewis. Despite this danger, and despite Chaplin's off-screen egotism, the premise plays beautifully, especially since The Little Tramp (though not Chaplin) is such a terrible comedian when he's trying to be one. My favorite moment is when the ringmaster demands the auditioning Tramp to be funny right that instant: the Tramp grins and shyly dances around a bit, gingerly falls down, puts his cane between his legs and meekly lifts himself back up. \"Terrible!\" roars his would-be employer. This film has more self-awareness over comedy conventions that any other Chaplin I know of. The Tramp ineptly (but hilariously) performs a couple of standard comedy routines with the other circus clowns. Later, there's a funny twist to the old banana peel gag; and near the end he crashes into an old general store, looking as if he's thrust himself back into his old Keystone days. This is Chaplin's last true silent film, and the Keystone moment feels like a nostalgic farewell to the past. \"The Circus\" is funny throughout, but the opening scenes are probably the best. There's a marvelous funhouse sequence and a priceless routine where The Tramp pretends to be a motorized dummy. (Has anyone seen the Swiss clock routine from \"Your Show of Shows\"?) He also falls in love with the ringmaster's cruelly treated daughter, which leads to a poignant ending. I enjoyed the music, which Chaplin composed for this film in 1969. His scores are always repetitive; but they're also sweet and funny and they enhance the action. I could have done without the title-sequence song (which he sings himself)\u0097something about looking up at rainbows. Otherwise, this comedy is near-perfect and holds its own against Chaplin's even greater features, \"The Gold Rush,\" \"City Lights\" and \"Modern Times.\"",
         "Although I didn't actually see the whole movie, \"The Circus\" is a hoot nonetheless. Charlie Chaplin plays a guy who joins the circus and before too long gets his own act. You'll die laughing in the scenes where he's attached to the rope. I actually watched it on TV while living with a family in St. Petersburg, Russia, and they laughed their heads off just watching him perform his stunts. That shows why these silent comedies were so great: you can laugh even if you don't know what they're saying. It's truly movies like these that make life worth living, and Chaplin remains possibly the greatest comedian in all history. 10/10.",
         "The Circus (1928) Charlie Chaplin had a string of silent feature films in the 1920s that were and are his classics, ending with a couple of amazing capstones in the 1930s. And though he is famous for having carried on the silent tradition well beyond everyone else (understandably, given his style), this one finished shooting only three weeks after the first talkie, so this is a true cusp film. And it took two years to plan and film (starting in 1926). And in some ways this is the best of them all for the simple reason that it avoids that occasional cloying sentimentality that you either love or tolerate in his other classics. It's a pure, light, clever, cinematically sophisticated comedy. And the physical tricks, the timing of certain gags, is breathtaking. It also has a deeply satisfying ending, shot in 1927...which you might see echo of in the last moments of \"Being There\" with Peter Sellars, from 1999. \"The Circus\" is just over an hour and it never flags, never repeats, is never strained. Chaplin had the rare ability to do the most outrageous things and make them seem perfectly plausible--even though we know better. It's partly because he would do dozens of takes, \"perserverance to the point of madness,\" as he said, until it felt right. A note on the sound. This was a true silent film on its release. In the 1960s and 70s, Chaplin created musical soundtracks, composed by himself (and made edits, as well) for his earlier features. The song sung over the opening credits on the Warner Bros. DVD is Chaplin himself, as an old man, singing a song he composed. It's not really legit, in terms of period (1928), but it feels good. The music is fairly innocuous, but a bit too emphatic at times. Still, it's better than the add-on tracks most silent films get these days, and Chaplin was smart to have paid it attention. Most of all, this is funny, uncompromised Chaplin genius. Maybe the best way to get introducted to his large body of work. See it!!"
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": ["Charles Chaplin Productions"],
      "summaries": [
         "Charlie's Tramp character finds himself at a circus where he is promptly gets chased around by the police who think he is a pickpocket. Running into the bigtop, he is an accidental sensation with his hilarious efforts to elude the police. The ringmaster/owner immediately hires him, but discovers the Tramp cannot be funny on purpose, so he takes advantage of the situation by making the Tramp a janitor just happens to always in the Bigtop at showtime. Unaware of this exploitation, the Tramp falls for the owner's lovely acrobatic daughter, who is abused by her father. His chances seem good, until a dashing rival comes in and Charlies feels he has to compete with him.",
         "The Tramp finds work and the girl of his dreams at a circus."
      ],
      "budget": 900000
   },
   "movielensId": 3306,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1928-01-06",
      "dvdReleaseDate": "2000-02-08",
      "directors": ["Charlie Chaplin"],
      "runtime": 71,
      "movieId": 3306,
      "title": "The Circus",
      "mpaa": "G",
      "actors": [
         "Charlie Chaplin",
         "Al Ernest Garcia",
         "Merna Kennedy",
         "Harry Crocker",
         "George Davis",
         "Henry Bergman",
         "Tiny Sandford",
         "John Rand",
         "Steve Murphy"
      ],
      "imdbMovieId": "0018773",
      "originalTitle": "The Circus",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["YEIzkT1eFgc"],
      "plotSummary": "Charlie, a wandering tramp, becomes a circus handyman and falls in love with the circus owner's daughter. Unaware of Charlie's affection, the girl falls in love with a handsome young performer. Charlie's versatility makes him star of the show when he substitutes for an ailing tightwire walker. He is discharged from the company when he protects the girl from her father's abuse, but he returns and appeals to the handsome performer to marry the girl. After the wedding the father prevails upon them to rejoin the circus. Charlie is hired again, but he stays behind when the caravan moves on.",
      "tmdbMovieId": 28978,
      "avgRating": 3.9088,
      "releaseYear": "1928",
      "numRatings": 466,
      "posterPath": "/awTf4Y6TGvgi3VYtGNINyyJJy9Q.jpg"
   }
}