{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0087265",
      "video": false,
      "title": "The Flamingo Kid",
      "recommendations": [
         46688,
         30709,
         80572,
         69007,
         28528,
         14689,
         75759,
         52859,
         76297,
         45774,
         43439,
         110624,
         21332,
         54873,
         46018,
         42134,
         20301,
         61651,
         43232,
         24081
      ],
      "backdrop_path": "/xtvkZVekOAFkXeYv4o3IQT2hTuf.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Jeffrey Willis",
               "gender": 2,
               "credit_id": "52fe44b4c3a368484e032455",
               "name": "Matt Dillon",
               "profile_path": "/svj4JJmblkNUt9pSrchJEzx4VR3.jpg",
               "id": 2876,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Arthur Willis",
               "gender": 2,
               "credit_id": "52fe44b4c3a368484e032459",
               "name": "Héctor Elizondo",
               "profile_path": "/48UNfVFZVr0jyMIlLPhzm8IIM7f.jpg",
               "id": 1210,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Ruth Willis",
               "gender": 1,
               "credit_id": "52fe44b4c3a368484e03245d",
               "name": "Molly McCarthy",
               "profile_path": null,
               "id": 108729,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Nikki Willis",
               "gender": 1,
               "credit_id": "52fe44b4c3a368484e032461",
               "name": "Martha Gehman",
               "profile_path": null,
               "id": 79007,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Phil Brody",
               "gender": 2,
               "credit_id": "52fe44b4c3a368484e032465",
               "name": "Richard Crenna",
               "profile_path": "/nWtMvMnLqGjlIGWNXjshgxsHDih.jpg",
               "id": 16554,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Phyllis Brody",
               "gender": 1,
               "credit_id": "52fe44b4c3a368484e032469",
               "name": "Jessica Walter",
               "profile_path": "/zPHpjVlg6nTKnyXWq8rreW6q1x.jpg",
               "id": 41232,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Joyce Brody",
               "gender": 1,
               "credit_id": "52fe44b4c3a368484e03246d",
               "name": "Carole Davis",
               "profile_path": "/7G98bA6XaQVxeIfnfMFEzHnqlui.jpg",
               "id": 62042,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Carla Samson",
               "gender": 1,
               "credit_id": "52fe44b4c3a368484e032471",
               "name": "Janet Jones",
               "profile_path": "/vtSxLHwrv0GHWFoVuVePrluMOXM.jpg",
               "id": 19257,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Steve Dawkins",
               "gender": 2,
               "credit_id": "52fe44b4c3a368484e032475",
               "name": "Brian McNamara",
               "profile_path": "/aemVY13WmPKj3TOWSvtbWs7Vgzu.jpg",
               "id": 27238,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Hawk Ganz",
               "gender": 2,
               "credit_id": "52fe44b4c3a368484e032479",
               "name": "Fisher Stevens",
               "profile_path": "/TutpOyw0A6FF5hEoFDYseI2EVN.jpg",
               "id": 26473,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Mandy",
               "gender": 1,
               "credit_id": "533edfba0e0a261e900001dd",
               "name": "Marisa Tomei",
               "profile_path": "/l87UKhZ1ethWmn8lksmLZ2LcQJ1.jpg",
               "id": 3141,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Ted from Pinky's",
               "gender": 2,
               "credit_id": "533edfcf0e0a261e8d0001de",
               "name": "John Turturro",
               "profile_path": "/70V4hwvWN0J3aX2LzQg7eKCeq29.jpg",
               "id": 1241,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Turk (uncredited)",
               "gender": 2,
               "credit_id": "533edfeb0e0a261e8d0001e5",
               "name": "David Paul",
               "profile_path": "/nQLxbp58OJu7tpRL0WGYQUKPqKJ.jpg",
               "id": 98189,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Dirk (uncredited)",
               "gender": 2,
               "credit_id": "533edffe0e0a261e990001d4",
               "name": "Peter Paul",
               "profile_path": "/q9KG4aQ6TkdCD5HJYyFDAz47azl.jpg",
               "id": 98188,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "558d55edc3a3687bdb00035a",
               "name": "Michael Phillips",
               "profile_path": "/yZ3BTx9I0r5cd1ZEmykeOQ9HIdo.jpg",
               "id": 12433,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44b4c3a368484e032451",
               "name": "Garry Marshall",
               "profile_path": "/kx77E8p5rnEmKxIhFT0qWCEMEik.jpg",
               "id": 1201,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "553fc08792514132c20000f7",
               "name": "Garry Marshall",
               "profile_path": "/kx77E8p5rnEmKxIhFT0qWCEMEik.jpg",
               "id": 1201,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "558d560ec3a3687bfc00038e",
               "name": "Curt Sobel",
               "profile_path": null,
               "id": 63906,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "558d5621c3a36843cf001d5b",
               "name": "James A. Contner",
               "profile_path": null,
               "id": 104876,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "558d5634c3a3687bfc000391",
               "name": "Priscilla Nedd-Friendly",
               "profile_path": null,
               "id": 1217,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "558d5646c3a36834a100011e",
               "name": "Margery Simkin",
               "profile_path": "/dCyAWZGEaW1OlGgh5ALiqGfsbpb.jpg",
               "id": 6347,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "558d5659c3a36878d9000a38",
               "name": "Lawrence Miller",
               "profile_path": null,
               "id": 21614,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "558d566dc3a36834a1000121",
               "name": "Duke Durfee",
               "profile_path": null,
               "id": 1481653,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "558d567dc3a36843cf001d67",
               "name": "Frederic C. Weiler",
               "profile_path": null,
               "id": 137192,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "558d568ec3a36834fc000144",
               "name": "Ellen Mirojnick",
               "profile_path": null,
               "id": 7735,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "558d56a8c3a36878d9000a3f",
               "name": "Martha Pinson",
               "profile_path": null,
               "id": 1402039,
               "department": "Directing",
               "job": "Script Supervisor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 3.435925,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 25010,
      "vote_count": 24,
      "budget": 0,
      "overview": "Brooklyn teenager Jeffrey Willis, thoroughly unhappy with his modest homestead, embraces the other-world aspects of his summer job at the posh Flamingo Club. He spurns his father in favor of the patronage of smooth-talking Phil Brody and is seduced by the ample bikini charms of club member Carla Samson. But thanks to a couple of late-summer hard lessons, the teen eventually realizes that family should always come first.",
      "similar": [],
      "original_title": "The Flamingo Kid",
      "runtime": 100,
      "poster_path": "/wj6Df9ojtFi8v40Ipr2RuCxv9iC.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Mercury Productions",
            "id": 11447,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "American Broadcasting Company (ABC)",
            "id": 3065,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Edgewood Productions",
            "id": 5419,
            "origin_country": ""
         },
         {
            "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
            "name": "20th Century Fox",
            "id": 25,
            "origin_country": "US"
         }
      ],
      "release_date": "1984-12-21",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "A legend in his own neighborhood.",
      "adult": false,
      "homepage": "https://en.wikipedia.org/wiki/The_Flamingo_Kid",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Garry Marshall"],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "Neal Marshall",
         "Garry Marshall"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0087265/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ2ODIwODU2Nl5BMl5BanBnXkFtZTcwNDU4OTAyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Matt Dillon, Hector Elizondo, Molly McCarthy | See full cast and crew »"],
      "reviews": [
         "This movie was so great when it came out and is still great. I just watched it again 20 years later! Wow, has it been that long???? Charming story of a very bright young man Jeffrey Willis who has a bright future as an engineer. His father, a plumber wants to see his son become a success and wants him to stay on this path, but the summer before Jeffrey is to go off to college rather than working in an office he gets a job as first a parking lot attendant, and then quickly promoted to cabana boy at a fancy long island beach club. He is so enamoured with the lifestyle of these rich folks and especially impressed by Phil Brody, who made his fortune in luxury cars and feels he's found a new mentor. Despite the fact that he is merely the cabana boy he really feels this is the life he wants to live. He looks at his Brooklyn roots and feels somewhat ashamed, and wants this life of luxury to start right now. Mr. Brody is also impressed by Jeffrey who is very smart, and a go getter. He shows Jeffrey \"the ropes\" and a new way of life. He even offers him a job as a salesman at one of his shops. Jeffrey is all ready to say F college! He now wants to be like his hero, Phil Brody, who also is the reigning king of the gin games at the club. The movie is so old, but I won't spoil for you how it ends except to say that his illusions are pretty much shattered. Great film. Great performance by a very young, very cute Matt Dillon.",
         "Charming comedy from Garry Marshall starring Dillon as a Brooklyn teenager taken aback by the smooth lifestyles at a posh beach club. At the club he meets swift characters like car dealer Richard Crenna, in a wonderful role and the lovely Janet Jones, before the Gretzky. Hector Elizondo is also stand out as Dillon's father. Marshall also wrote the script for the film and it flows with heart and humor all the way through.",
         "Good movie, worth owning, part for the time it represents, and part because of all the good acting (understated and funny). Richard Crenna plays a great pompous jerk (are we sure he's acting?) Hector Elizondo plays one of his best parts ever as the DAD (\"Now he knows Kings!\"), and Gretzky's wife even does a half decent job. Fisher Stevens and Bronson Pinchot play good supporting roles as well. Matt Dillon does a great job as a kid who's enamored with Crenna's BS. (One actress who is hot as hell is Carole Davis, who plays Crenna's daughter, and who I am almost positive was a Penthouse Pet at one time. She was also in \"Mannequin\" and \"Shrimp on the Barbie\". Hotter than Gretzky's wife).......Anyway, good lines, good script, good ending, good movie.",
         "This Matt Dillon vehicle serves as the light-hearted equivalent to \"A Bronx Tale.\" Richard Crenna plays the Chazz Palmentieri role as the idolized kingpin and Hector Elizondo plays the Robert DeNiro role of the honorable working class father. There is some memorable dialogue, cute humor, and distinctive card playing (the upside down fan). But, best of all, are the coming of age lessons that are taught to Dillon's character about values, hard work, and summer romance. In the latter category, the movie is aided immensely by the refreshing debut of Janet Jones (now best known as Mrs. Wayne Gretsky). I recommend this without reservation!",
         "I always enjoy seeing something set in 1963 too; last year of that '50s era before everything kinda went to the 60's everyone knows and cringes at. Very well made, fine acting, Dillon, Crenna, Walter and Elizondo especially all at the top of their games. Watch out for the scene where Elizondo encounters Crenna for the first time and sez: 'I already know who you are' more or less to Crenna. He can tell this is the type that would screw his friends at card games or in anything just to get ahead. They don't beat you over the head with the 'coming of age life-lessons', but they are believably done and the movie does sink in as you watch it. No surprise that Janet Jones greatest fame was as Gretzky's wife--now BETTING wife(!) at that---not as an actress. She's just kinda flat. Very easy on the eyes certainly but....Baywatch gal level you know? Check it out, the DVD doesn't have any extras but the story itself is well worth watching. Fun cameos by Steven Weber (Wings) and Marisa Tomei(Cousin Vinny) etc. too. *** outta ****",
         "This is a wonderfully entertaining story chock full of lessons in life. The lessons, are pretty universal and most have to be learned the hard way. The \"kid\", played by Matt Dillon, enters the world of the well-to-do, more well to do than him anyway. He is from a blue-collar neighborhood in 1963 Brooklyn. His entry??? Employment at the \"El Flamingo\", an upper-middle class beach club. Richard Crenna, wonderful as the slick, gin rummy playing member, befriends the kid. The lessons of the world revolve around the \"big\" gin rummy game. Lots of laughs, lots of fun, and Janet Jones make this movie a must see. I've seen it dozens of times myself, and will probably watch it dozens more. One more thing. A special mention to Jessica Walter. She gave one of the most believe-able performances I've ever seen. I HATED HER.",
         "A great cast but the storyline is about a kid coming of age during a summer stint as a valet/cabana boy at a Long Island Beach Club. Matt Dillon does a fine job in this role as a lead. He holds his own against heavyweights like Richard Crenna and Hector Elizondo. There is Jessica Walter who played bored Mrs. Brody. The cast also featured Martha Gehman as the sister, Nikki, to Dillon's Jeffrey Willis in the role. While Jeffrey's father, Arthur, is not too happy that his son is working at the club, he deals with it and Mr. Brody's influence over him. Arthur Willis is a hard working plumber who lives with his family in a Brooklyn apartment and not a spacious mansion in Long Island like the club's crowd. I also recall seeing Fisher Stevens and Brian McNamara play his friends and Bronson Pinchot in a small role as well. It's a fine film with some comedic moments but not too many and a predictable ending.",
         "Matt Dillon stars as a Brooklyn kid who gets a job at a summer club as a cabana boy where he learns about life in this coming of age comedy directed by Garry Marshall..along the way he meets a stunning beauty (Janet Jones, angelic in her screen debut) and he begins to fall for the good life and forgets about the true value of life, work and family. A good cast and great music make this a very good movie..on a scale of one to ten.. 7",
         "The Flamingo Kid is a great coming of age film. I have viewed this film a lot and it gets better every time. Garry Mashall does a terrific job with the material and Matt Dillon holds it all together. Great movie.",
         "1963. Naive, earnest, and affable working class 18-year-old lad Jeffrey Willis (an excellent and engaging performance by Matt Dillon) gets a summer job working as a cabana boy at the posh El Flamingo Beach Club in Long Island. Will the amiable charisma and affluent lifestyle of slick car dealership owner and ace gin rummy cardsharp Phil Brody (marvelously played to smarmy perfection by Richard Crenna) as well as the allure of the enticing Carla Samson (flawlessly embodied by the delectable Janet Jones) cause Jeffrey to forget his humble blue collar Brooklyn roots and aspirations to attend college once summer is over? Director Gary Marshall, who also co-wrote the sweet and witty script with Neal Marshall, relates the enjoyable and engrossing story at a steady pace, offers a vivid and affectionate depiction of the nifty 60's period setting, maintains an ingratiatingly easy'n'breezy tone throughout, and delivers the usual life lessons about integrity and staying true to one's actual self in a pleasant and likable matter. The adroit acting by the sturdy cast helps a whole lot: Dillon astutely nails the morally conflicted nature of his character, Crenna shines as a smooth sleazeball, Hector Elizondo likewise does first-rate work as Jeffrey's proud, honest, and hard-working father Arthur, Jessica Walter brings genuine snap and bite to her juicy role as Brody's snippy fed-up wife Phyllis, Carole Davis makes the most out of a rather minor part as Brody's snobby and sexy vamp daughter Joyce, and Fisher Stevens has a ball as Jeffrey's fast-talking smartaleck buddy Hawk. The bouncy soundtrack of choice 60's golden oldies keeps things bubbling along. Popping up in neat bits are Bronson Pinchot, Marisa Tomei, Steve Weber, and John Turturro. James A. Conter's sunny cinematography gives the picture an attractive sparkling look. A real treat."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "American Broadcasting Company (ABC)",
         "Edgewood Productions",
         "Mercury Productions (II)"
      ],
      "summaries": [
         "Jeffrey Willis has just finished high school and isn't quite sure what the future holds. His parents expect him to go to college but he is starting to find his close-knit family stifling. He gets a summer job at the Flamingo club where he meets Phil Brody, a successful car dealer who fills Jeffrey's head with ideas about how to make his fortune. Phil is everything Jeffrey would like to be - popular, rich and the best gin rummy player the club has ever seen. Jeffrey's coming of age includes a romance with the very pretty Carla Samson, but the shine on Phil Brody's philosophy of life wears off when he uncovers a significant flaw in his character.",
         "Jeffrey feels boxed in; in his home, in his life, in his dreams. At the Flamingo beach club his eyes are opened to a world filled with what he sees as beautiful people and perfect lives. He turns his back on his family in pursuit of easy street. Jeffrey falls in love with pretty beach girl Carla, and appears to be on his way to a cushy job selling sports cars for the slick Mr. Brody. It all begins to fall apart when Jeffrey discovers that Mr. Brody misled him; and further disintegrates when he notices Mr. Brody cheating at cards. Jeffrey must finally choose between his dreams and honor. He returns to his family, which he now sees not as a box, but as a foundation."
      ],
      "budget": 0
   },
   "movielensId": 3308,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1984-12-21",
      "dvdReleaseDate": "2003-08-05",
      "directors": ["Garry Marshall"],
      "runtime": 100,
      "movieId": 3308,
      "title": "The Flamingo Kid",
      "mpaa": "PG-13",
      "actors": [
         "Matt Dillon",
         "Héctor Elizondo",
         "Molly McCarthy",
         "Martha Gehman",
         "Richard Crenna",
         "Jessica Walter",
         "Carole Davis",
         "Janet Jones",
         "Brian McNamara",
         "Fisher Stevens",
         "Marisa Tomei",
         "John Turturro",
         "David Paul",
         "Peter Paul"
      ],
      "imdbMovieId": "0087265",
      "originalTitle": "The Flamingo Kid",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["Kf6kjsSgd38"],
      "plotSummary": "Brooklyn teenager Jeffrey Willis, thoroughly unhappy with his modest homestead, embraces the other-world aspects of his summer job at the posh Flamingo Club. He spurns his father in favor of the patronage of smooth-talking Phil Brody and is seduced by the ample bikini charms of club member Carla Samson. But thanks to a couple of late-summer hard lessons, the teen eventually realizes that family should always come first.",
      "tmdbMovieId": 25010,
      "avgRating": 3.15939,
      "releaseYear": "1984",
      "numRatings": 1214,
      "posterPath": "/wj6Df9ojtFi8v40Ipr2RuCxv9iC.jpg"
   }
}