{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0111454",
      "video": false,
      "title": "Tom & Viv",
      "recommendations": [
         48249,
         73247,
         63020,
         51333,
         29786
      ],
      "backdrop_path": "/gRc9VSxXCpqAmYpePlEiP8X6aZa.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Tom Eliot",
               "gender": 2,
               "credit_id": "52fe470dc3a36847f8120cc5",
               "name": "Willem Dafoe",
               "profile_path": "/xM5lhOR5tWWdIlFpBDeZJx9opIP.jpg",
               "id": 5293,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Vivienne Haigh-Wood",
               "gender": 1,
               "credit_id": "52fe470dc3a36847f8120cc9",
               "name": "Miranda Richardson",
               "profile_path": "/kTs3t6pnO3zR7WYSVYzQfJ9yKMW.jpg",
               "id": 8436,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Rose Haigh-Wood",
               "gender": 1,
               "credit_id": "567b5d079251417dec00157c",
               "name": "Rosemary Harris",
               "profile_path": "/dd7DX4FJwLAfxBdWarYMcWuLyYO.jpg",
               "id": 18998,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Maurice Haigh-Wood",
               "gender": 2,
               "credit_id": "567b5d40c3a3684bdc0015d0",
               "name": "Tim Dutton",
               "profile_path": "/lYzAZgSn1dkZp7s9NXzO0ke9Nrn.jpg",
               "id": 49965,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Harwent",
               "gender": 2,
               "credit_id": "59dab577c3a36862270488e3",
               "name": "Geoffrey Bayldon",
               "profile_path": "/tG2ZnaS99LEuLMoG7P6wepT6AGk.jpg",
               "id": 123209,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Louise Purdon",
               "gender": 1,
               "credit_id": "59dab584c3a368620004d615",
               "name": "Clare Holman",
               "profile_path": "/kN40r2KsyuYX07C3GfhWQEfCC2b.jpg",
               "id": 47742,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Bishop of Oxford",
               "gender": 2,
               "credit_id": "59dab5b5c3a36861df051489",
               "name": "Joseph O'Conor",
               "profile_path": "/xdfiiYtYABddyJnZiSllIB8o3yB.jpg",
               "id": 88894,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Sir Frederick Lamb",
               "gender": 2,
               "credit_id": "59dab5c6925141251404dd41",
               "name": "John Savident",
               "profile_path": "/sbcvdi0JqC9KRUbyOJwZqVf0LeP.jpg",
               "id": 184881,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "W.I. Janes",
               "gender": 0,
               "credit_id": "59dab5d492514124cd04cce2",
               "name": "Michael Attwell",
               "profile_path": null,
               "id": 24598,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Ottoline Morrell",
               "gender": 1,
               "credit_id": "59dab5e2c3a368620d043b2d",
               "name": "Roberta Taylor",
               "profile_path": "/fzfhJoc5hpOHe1cExLbkSapcgJp.jpg",
               "id": 1252726,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Woman",
               "gender": 1,
               "credit_id": "59dab5ecc3a368620d043b3a",
               "name": "Anna Chancellor",
               "profile_path": "/iKfSkQNhajOMPZoDHHTFUad99e5.jpg",
               "id": 10731,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Second Man",
               "gender": 0,
               "credit_id": "59dab5fbc3a36861a304af48",
               "name": "John Clegg",
               "profile_path": null,
               "id": 1214091,
               "order": 11
            },
            {
               "cast_id": 19,
               "character": "Dr. Cyriax",
               "gender": 2,
               "credit_id": "59dab61292514124c904c777",
               "name": "James Greene",
               "profile_path": "/mQNSBTK93AXGGd5f0mbQqPhgBtY.jpg",
               "id": 1266585,
               "order": 12
            },
            {
               "cast_id": 20,
               "character": "Dr. Reginald Miller",
               "gender": 2,
               "credit_id": "59dab621c3a36861df051511",
               "name": "Simon McBurney",
               "profile_path": "/npYHdUV4IBy0YqmyxxcLQ3YouDt.jpg",
               "id": 16358,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe470dc3a36847f8120ca3",
               "name": "Brian Gilbert",
               "profile_path": null,
               "id": 58080,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe470dc3a36847f8120ca9",
               "name": "Harvey Kass",
               "profile_path": null,
               "id": 353604,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe470dc3a36847f8120caf",
               "name": "Michael Hastings",
               "profile_path": null,
               "id": 280248,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe470dc3a36847f8120cb5",
               "name": "Adrian Hodges",
               "profile_path": "/A1TwQ4GR4vj3eRW6xN9aGCzQw3A.jpg",
               "id": 29483,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5a862a97c3a3682dbf033dc8",
               "name": "Martin Fuhrer",
               "profile_path": null,
               "id": 47613,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "5a862a9ec3a36863e702c2b2",
               "name": "Debbie Wiseman",
               "profile_path": null,
               "id": 51064,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.163116,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 46797,
      "vote_count": 8,
      "budget": 0,
      "overview": "The story of the marriage of the poet TS Eliot to socialite Vivienne Haigh-Wood, which had to cope with her gynaeological and emotional problems and his growing fame.",
      "similar": [],
      "original_title": "Tom & Viv",
      "runtime": 115,
      "poster_path": "/vLh2r5QyIooLhmYNYEaSZ4Jxsav.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "British Screen Productions",
            "id": 12745,
            "origin_country": "GB"
         },
         {
            "logo_path": null,
            "name": "Harvey Kass",
            "id": 97244,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "IRS Media",
            "id": 1930,
            "origin_country": ""
         }
      ],
      "release_date": "1994-04-15",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "For better, for worse, forever.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Brian Gilbert"],
      "runtime": 125,
      "synopsis": null,
      "writers": [
         "Michael Hastings",
         "Michael Hastings"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0111454/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQyMDg2NjAwM15BMl5BanBnXkFtZTcwOTU1OTIyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Willem Dafoe, Miranda Richardson, Rosemary Harris | See full cast and crew »"],
      "reviews": [
         "The film starts with a passionate embrace between Tom and Viv on the innocent setting of an Oxford punt. For the next quarter of an hour you may think that this will be an ordinary, merchant ivory type film about an upper-crust gal and her american beau writing away their cares in the dreaming spires of Oxford. However the idyllic setting and the gentle breezes soon fade into nothingness and before long you are forced to comprehend the tortured soul of one suffering from mental hysteria and the immediate effects of that on those who are subjected to the outbursts. Miranda Richardson's performance as the highly strung wife of one of our most famous poets, takes this film to another level. Although the story is essentially a simple love story why it sits apart from the rest is purely down to the fact that Tom suffers Viv's neuroses silently like the true English gentleman he has become. Devotees of T.S. Elliot may find that the film is superficial in its reference to his work and that the focus is centered on Viv. Yet at the end of the film I was left with a heightened awareness of what and who might have propelled him to write the way he did. This bitter-sweet film tugs at the heart strings just so.",
         "Michael Hasting' play of the same title, was seen in New York at the Public theater in 1986. Edward Herrmann and Kate Nelligan played the leading roles. In a way, Mr. Herrmann bore a resemblance to Tom, something that in the film, William Dafoe, an excellent actor, stands in sharp contrast with what the real Eliot looked like. Having seen both the play and the film before, we took another look recently when it was shown on cable. Brian Gilbert, the director, showed a sensitivity to the material. He had the advantage of using locales where the real Tom and Viv lived in England, thus producing an immediacy and intimacy that serves the film well. Tom, was a man that loved his adopted country. He was a man in awe of the culture and traditions. In fact, he adopted them as they were his own. His entry into that world in which he wanted to belong came to him courtesy of Vivienne Haigh-Wood, an upper class young woman who had her share of physical problems that plays greatly in this story. Viv's problems exacerbated her marital problems with Tom, and her family. Evidently, her condition could have been helped if the doctors that treated her would have gone in another direction, as it's pointed out toward the end of the film by a physician that clearly understood her malady. The film is worth a look because of the excellent Miranda Richardson's portrayal of Viv, a woman she captures well for our benefit. This is one of the best appearances by Ms. Richardson on the screen. William Dafoe's Tom gives the impression of being a complicated man. Rosemary Harris is another joy in the film as Viv's mother Rose. Tim Dutton and Nickolas Grace have some good moments in the film. \"Tom and Viv\" will not disappoint because Brian Gilbert's fine direction.",
         "**SPOILER(S) ALERT!** I'm surprised that none of the comments seem to mention (unless I missed it) Eliot's awful behavior portrayed in the film. Not only does Viv apparently directly inspire some of the most famous lines (so much for the transcendent method) and indeed contribute through her own hard work and editorial efforts to his most successful poetry, when she is finally put away using an obviously archaic test for sanity practically no one could pass (a mathematical conundrum) that has nothing to do with modern notions of professional psychology, but after she is put away she is indeed truly \"put away\" as far as Eliot is concerned. He never came to visit her in the sanitarium - not once, nor did she hear from him. At least that's how the movie portrays him. What I wonder is how accurate it all is. Eliot here is portrayed not just as a suffering husband, but one who suffers through his affection for the social position his wife gives him, and then when she clearly becomes a social handicap she is put away and forgotten. A clear injustice given the final more professional, scientific modern diagnosis that her problems all along were hormonal - not psychological.",
         "This film demonstrates how easily the state uses the psychiatric profession to unjustly incarcerate citizens, with full permission of family members, and eventually the victim themselves. The scene of the \"mind police\" taking Viv (Miranda Richardson) out of a restaurant in broad daylight, and her struggle that ends with pushing her purse into the hands of a friend as she is brought into submission, is heart-wrenching.",
         "Spoiler Alert! This is a film that improves with subsequent viewings. It represents only a small, limited portion of Eliot's personal and artistic life, as other posters have said, but the performances make the movie worth it. All of the performances are well done, but Miranda Richardson is extraordinary as a woman who sometimes struggles to keep herself under control and often loses. The film seems muddled in its presentation of Viv, however. The script has all of the usual mentally-ill-person-as-victim-of-society rhetoric--she's brilliant, a creative free spirit, etc.--and it puts in Mrs. Haigh-Wood's mouth a long speech to Eliot implying her disappointment that he isn't taking care of Viv despite her faults. At the end, the audience is indeed dismayed by her treatment. (And would it have killed Maurice to pick up a pen and write during those long years of her confinement?) But Richardson has been so convincing in her portrayal of an unpredictable force that cannot be controlled, even by herself, that there's a genuine sense of menace. Viv does threaten violence to others as well as to herself, after all, and her breezy dismissal of it as \"well, we're alive--no harm done\" doesn't help. Although the scene of her being remanded to the institution is sad, there's also a palpable sigh of relief. In short, lots of convincing, no-easy-answers suffering all round.",
         "Anyone who has been captivated by the poetry of this great poet, and wondered about the man and the context in which such memorable verse was written, will want to see this film. It shows T S Eliot as a tormented man who is forced to make decisions about how to deal with the mental instability/illness of his wife. The performances are uniformly faultless, and the awful tragedy of mental illness in a marriage is chillingly depicted with deep sensitivity. The film challenges the viewer to judge Eliot as a man - Dafoe's performance brilliantly portrays the anguish of Eliot the man living in what apparently was an impossible marriage, and Eliot the public figure . The film also throws light on Eliot's fascination with the Church and the role it played in providing a still place in a world of personal mental turmoil. Highly recommended.",
         "Miranda Richardson does a first-rate job of portraying the high-spirited, slightly wacko Vivian. As time wears on, and Eliot achieves fame, her manic flights go higher and higher. Finally she is \"put away\" as an embarrassment. Even though her condition improves, neither her brother nor her husband appeal for her release. Someone would have to look after her then. They put in their years as her caretaker and now have other things to do. the exasperation one feels in the beginning of the movie toward Viv becomes a deep sympathy for the middle-aged woman planted in a gilded cage with nothing and no one of her own.",
         "Was she mentally ill or was she suffering from hormonal imbalances not unlike post-menstrual syndrome? The fact that she was bleeding 3 times a month and had erratic behavior certainly alludes to something other that mental illness. When the American doctor came to the institution to see her, he said that her condition could have been controlled with medication. I realize that the times did not allow her illness to be analyzed or researched -- women were really of no interest other than being an extension of their husbands. However, I think that knowing what we do now -- and because as she got older her outbreaks lessened -- it seems that this was not a case of a \"crazy\" person's rantings. She was merely a woman who was indeed outspoken and had a mind of her own and also suffered from depression brought on by PMS.",
         "I am not a doctor, but I I have been teaching psychology for 20 years,and what I think is that she had both a bi-poler disorder (manic depression) and also severe gynecological trouble. She mentions she was perfectly fine after she hit menopause, which says a lot. Remember Tom says she has manic highs and then bad depression? Maybe the bi-polar disorder was somehow caused by the hormone imbalance? What broke my heart is that he was so appalled by her bleeding on their wedding night, which in turn crushed and panicked her. Sorry fellas, sometimes we have no control over these things, and if you are married to a woman for any time at all-you just get used to the little jokes mother nature plays. We know that stress and loneliness only make mental illness worse, and hormonal problems worse too. She was very ill and violent, but I feel Tom turned cold and selfish toward her, which made all of her problems worse. Also remember she purposely misses the \"monkey on a greasy pole\" (catch the symbolism?) mental fitness question, after pleading at Tom with her eyes, but he just looks away.",
         "Unlike many biographical films this one doesn't alter things so much from the historical record. It doesn't make one person more sympathetic than they were in reality, and, as the ending shows, it reaches not a grand finale, but a whimper. (Apologies for the nod to Eliot's most famous line \u0096 which he found tiresome too) This is a very sad story because the principals in real life were devoted to each other, but for a range of almost mysterious reasons to contemporary audiences, Vivienne's various maladies, mental and gynecological, are shrouded. Richardson carries this role well, and she almost owned the canon of disturbed women for a while in her career. The stand out is Dafoe as Eliot. Dafoe has the solemn, dignified, presence; the accent of period Englishness of a certain class and his American accent suppressed in the voice but mingled nearly perfectly to sound like Eliot. In addition Eliot's life, especially during these turbulent chapters were smothered, and to see Dafoe incarnate Eliot gives life to a man who was often an abstracted mind. This is a fine production in almost all respects although it may not have a wide appeal."
      ],
      "genres": [
         "Biography",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "British Screen Productions",
         "Harvey Kass",
         "IRS Media"
      ],
      "summaries": ["In 1915, T.S. (Tom) Eliot and Vivienne Haigh-Wood elope, but her longstanding gynecological and emotional problems disrupt their planned honeymoon. Her father is angry because Tom's poetry doesn't bring in enough to live on, but her mother is happy Viv has found a tender and discreet husband."],
      "budget": 0
   },
   "movielensId": 331,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-04-15",
      "dvdReleaseDate": "2003-04-08",
      "directors": ["Brian Gilbert"],
      "runtime": 115,
      "movieId": 331,
      "title": "Tom & Viv",
      "mpaa": "",
      "actors": [
         "Willem Dafoe",
         "Miranda Richardson",
         "Rosemary Harris",
         "Tim Dutton",
         "Geoffrey Bayldon",
         "Clare Holman",
         "Joseph O'Conor",
         "John Savident",
         "Michael Attwell",
         "Roberta Taylor",
         "Anna Chancellor",
         "John Clegg",
         "James Greene",
         "Simon McBurney"
      ],
      "imdbMovieId": "0111454",
      "originalTitle": "Tom & Viv",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The story of the marriage of the poet TS Eliot to socialite Vivienne Haigh-Wood, which had to cope with her gynaeological and emotional problems and his growing fame.",
      "tmdbMovieId": 46797,
      "avgRating": 3.2867,
      "releaseYear": "1994",
      "numRatings": 579,
      "posterPath": "/vLh2r5QyIooLhmYNYEaSZ4Jxsav.jpg"
   }
}