{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "apache",
            "id": 4616
         },
         {
            "name": "rancher",
            "id": 14574
         },
         {
            "name": "cattle",
            "id": 15225
         },
         {
            "name": "smoke signal",
            "id": 187314
         },
         {
            "name": "storekeeper",
            "id": 187320
         }
      ],
      "imdb_id": "tt0048342",
      "video": false,
      "title": "The Man from Laramie",
      "recommendations": [
         20442,
         43329,
         14551,
         37292,
         44921,
         40630,
         44766,
         29244,
         37347,
         83099,
         15266,
         38732,
         43319,
         37412,
         42402,
         13909,
         18721,
         32634,
         22383,
         86608
      ],
      "backdrop_path": "/6v3KDYITvOPKDfy4KOPNG8ttPDI.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "592c65649251413b4a0787b3",
         "content": "You Scum!\r\n\r\nWill Lockhart (James Stewart) leaves his home in Laramie on a mission to find out who was responsible for selling repeating rifles to the Apaches who killed his brother. Landing in Coronado, New Mexico, he finds that most of the territory is owned and ruled by Alec Waggoman (Donald Crisp), a fierce patriarchal rancher with one loose cannon son, Dave (Alex Nicol) and another surrogate son, Vic Hansboro (Arthur Kennedy) running the Barb Ranch. As he digs deeper, Lockhart finds he is in the middle of two wars, one of which may eventually conclude his revenge fuelled mission.\r\n\r\nThe Man From Laramie is the last of the five Westerns that director Anthony Mann made with leading man James Stewart. The only one filmed in CinemaScope, it is a visually stylish picture that is full of brooding psychological themes and boasts great acting and a tight script. It's no secret that Mann, before his sad death, was looking to make a Western King Lear, The Man From Laramie serves as a delicious starter to what would have been the main course. With its family dilemmas and oedipal overtones, Mann's Western is very Shakespearian in tone. That its characters are sumptuously framed amongst a harsh dangerous landscape further fuels the psychological fire; with the landscapes (terrificly photographed by Charles Lang) providing a link to the characters emotional states. So many scenes linger long and hard in the memory (none of which I would dare to spoil for would be new viewers), so much so they each reward more upon subsequent revisits to the film. There's some minor quibbles down the pecking order; for instance Cathy O'Donnell as Barbara Waggoman is poor and contributes little to proceedings, but really it remains a quality piece of psychological work that barely gives us reason to scratch the itch. \r\n\r\nTaut, tight and tragic is The Man From Laramie, brought to us courtesy from the dynamite partnership of Mann & Stewart. 9/10",
         "url": "https://www.themoviedb.org/review/592c65649251413b4a0787b3"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Will Lockhart",
               "gender": 2,
               "credit_id": "52fe476f9251416c7509931b",
               "name": "James Stewart",
               "profile_path": "/aBLtt0Sl4AZVNclzFrXzbndRzux.jpg",
               "id": 854,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Vic Hansbro",
               "gender": 2,
               "credit_id": "52fe476f9251416c7509931f",
               "name": "Arthur Kennedy",
               "profile_path": "/k8ew7ZMRadQeDyteqt7ZicSySub.jpg",
               "id": 11128,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Alec Waggoman",
               "gender": 0,
               "credit_id": "52fe476f9251416c75099323",
               "name": "Donald Crisp",
               "profile_path": "/vESX6aAjaZlEgHYncLE1y76BFtD.jpg",
               "id": 8841,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Barbara Waggoman",
               "gender": 1,
               "credit_id": "52fe476f9251416c75099327",
               "name": "Cathy O'Donnell",
               "profile_path": "/lt1TFYtermchxnV4pbHbXPkQWAz.jpg",
               "id": 10023,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Dave Waggoman",
               "gender": 2,
               "credit_id": "52fe476f9251416c7509932b",
               "name": "Alex Nicol",
               "profile_path": "/26O7vrO7qwz2eDuEXAvXU5lDsrW.jpg",
               "id": 109846,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Charley O'Leary",
               "gender": 2,
               "credit_id": "52fe476f9251416c7509932f",
               "name": "Wallace Ford",
               "profile_path": "/nfXCJAU3ddSn2K6SjwxXt2h1yQU.jpg",
               "id": 35849,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Chris Boldt",
               "gender": 2,
               "credit_id": "52fe476f9251416c75099333",
               "name": "Jack Elam",
               "profile_path": "/nsPOk2xOj33fpsBj60mcxGcjyBW.jpg",
               "id": 4965,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Frank Darrah",
               "gender": 2,
               "credit_id": "52fe476f9251416c75099337",
               "name": "John War Eagle",
               "profile_path": "/rvJgFSSHGzWFnTIGE7NnU1PFUFV.jpg",
               "id": 137003,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Tom Quigby",
               "gender": 2,
               "credit_id": "52fe476f9251416c7509933b",
               "name": "James Millican",
               "profile_path": "/jRGu5a4dNfVYBty6UrlBgI81KFV.jpg",
               "id": 100945,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Fritz",
               "gender": 0,
               "credit_id": "52fe476f9251416c7509933f",
               "name": "Gregg Barton",
               "profile_path": "/aG0oUpHvtTarj0Vq3JmJi0wu8lC.jpg",
               "id": 137004,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Spud Oxton",
               "gender": 2,
               "credit_id": "52fe476f9251416c75099343",
               "name": "Boyd Stockman",
               "profile_path": "/oaWbiRVZu4hVOmwIEgsNlHgviiG.jpg",
               "id": 137005,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Padre",
               "gender": 2,
               "credit_id": "52fe476f9251416c75099347",
               "name": "Frank De Kova",
               "profile_path": "/4aXrw9N1VBv3XHSxFRcnhH1lW9T.jpg",
               "id": 50574,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe476f9251416c7509934d",
               "name": "Anthony Mann",
               "profile_path": "/9uc4d2GGoHBRLeAqsZJpwJX4S8x.jpg",
               "id": 40199,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe476f9251416c75099353",
               "name": "Philip Yordan",
               "profile_path": null,
               "id": 85453,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe476f9251416c75099359",
               "name": "Frank Burt",
               "profile_path": null,
               "id": 121398,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe476f9251416c7509935f",
               "name": "George Duning",
               "profile_path": null,
               "id": 16748,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe476f9251416c75099365",
               "name": "Charles Lang",
               "profile_path": "/1k74XckQqxOwdPYvhvhEdZ9jl4l.jpg",
               "id": 3148,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe476f9251416c7509936b",
               "name": "Thomas T. Flynn",
               "profile_path": null,
               "id": 1128261,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe476f9251416c75099371",
               "name": "William Goetz",
               "profile_path": null,
               "id": 113725,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe476f9251416c75099377",
               "name": "William A. Lyon",
               "profile_path": null,
               "id": 64118,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe476f9251416c7509937d",
               "name": "Cary Odell",
               "profile_path": null,
               "id": 13864,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [{
         "name": "Western",
         "id": 37
      }],
      "popularity": 3.602801,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 18264,
      "vote_count": 54,
      "budget": 0,
      "overview": "Will Lockhart (James Stewart) becomes entangled in the happenings of Coronado, an isolated western town, after delivering supplies there. He is especially involved with the Waggomans, an influential ranching family, and begins his search for someone selling rifles to the local Apaches, only to find out it is the son of the most powerful man in the area. It is at this point that his troubles begin.",
      "similar": [
         12501,
         6972,
         452507,
         15573,
         1406,
         9394,
         11697,
         3089,
         12690,
         1712,
         11966,
         6644,
         26515,
         12146,
         11617,
         14168,
         24748,
         43933,
         4929,
         18843
      ],
      "original_title": "The Man from Laramie",
      "runtime": 104,
      "poster_path": "/c5JbxVnLBy9bZWjconkU1ZThTEC.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "William Goetz Productions",
            "id": 3473,
            "origin_country": ""
         },
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         }
      ],
      "release_date": "1955-08-31",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "THE MAN You'll Never Forget!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Anthony Mann"],
      "runtime": 104,
      "synopsis": null,
      "writers": [
         "Philip Yordan",
         "Frank Burt"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0048342/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAxNDc1MTA2OF5BMl5BanBnXkFtZTcwNTE4ODYxMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: James Stewart, Arthur Kennedy, Donald Crisp | See full cast and crew »"],
      "reviews": [
         "Some of the best Westerns of the fifties were those directed by Anthony Mann and John Ford, straightforward and unpretentious, but each with an interesting approach to the requirements of the genre... Mann's films were the more prestigious, usually featuring James Stewart who, with John Wayne, was the fifties' biggest box-office draw... \"The Man From Laramie\" best known because of the Frankie Laine theme strong which accompanied it, is notable for (among other things) Alex Nicol's extraordinary projection of sadism, an element which dominated the best of Mann's movies... The motion picture was to be the last of the Mann-Stewart Westerns... Stewart is cast as a wagon handler from Laramie, Wyoming, but is, really, an army officer out to avenge the death of his younger brother, a U.S. Cavalryman, massacred by the Apaches who were buying guns from unknown persons... It is these persons that Stewart is looking for.. Soon Stewart gets involved in an area of New Mexico which is ruled by the iron hand of a cattle baron Donald Crisp, a strong authoritarian \"who can't live with a lie\"... Crisp's one weakness is his love and care for his spoiled son, Alex Nicol... Wild but feeble, yet vicious, Nicol - with extraordinary projection of sadism - accosts Stewart in several confrontations in which (among other outrages) Stewart is dragged through fire by horses, and has his hand held tight while Alex puts a bullet through it... Mann proceeds in this mood throughout the movie, growing even more sadistic... Arthur Kennedy, a hard-working heavy, plays the adopted son of Crisp... He is a son in disguise, jealous of Alex, pretending to be his brother's ally and protector... A lot of good supporting actors are cast including Cathy O'Donnell, the fragile beauty who has little to do but await patiently for an opportunity; Aline MacMahon, the fine 'ugly' woman who never leaves the old man, and Jack Elam who tries to knife James Stewart in the back... Anthony Mann adopted an altogether tougher approach to Western mythology than John Ford... His obsessive, neurotic characters and his emphasis on violence foretell the work of Peckinpah, Leone and Eastwood... Filmed in Technicolor, \"The Man From Laramie\" is a Western with new touches of brutality touching off the wide screen spectacle...",
         "This has got to be one of the best western plots ever filmed. Unlike so many others in the genre, \"The Man From Laramie\" has a complex and interesting conflict as its center. Many have compared it to \"King Lear\" and the main story line does resemble the subplot of Gloucester and his two sons. Whether the Shakespeare connection is intentional or not, it works extremely well. Partly responsible for the film´s success are its stars: James Stewart is good as usual, while Arthur Kennedy, Donald Crisp and Aline McMahon really stand out in their characterizations. Anthony Mann´s directing is tight and uncompromising. The picture never lags once and there are many strongly dramatic moments, some even a bit shocking for 1955. The film was photographed with artistry, and the DVD issue does it justice. Several scenes are beautifully balanced and dramatically expressive. There is a wonderful wide-screen, panoramic look that comes across quite well. The real surprise is the audio. This 1955 movie has a full-bodied stereo soundtrack! The musical score may not be one the all-time greats, but it is often very effective, and on this disc it fills the viewing space with excitement. Highly recommended, even to Western non-fans.",
         "Director Anthony Mann and actor James Stewart combined to make several westerns and they were all very good. Make that \"excellent.\" This is one of them and it gets high marks for an involving story. It also features what I call \"realistic dialog,\" along with interesting characters and a film noir feel to it. That's no surprise since Mann directed a few film noirs. Along that noir theme, be warned this is not an upbeat story, a feel-good Jimmy Stewart film that most people remember him by. In here, he's a vengeful guy here (but, yeah, still a good man at heart). Donald Crisp also demonstrates an overt double-edged sword, so to speak, being a very gruff but fair land owner. Some of the best lines in the movie are delivered by Ailine MacMahon, an older woman friend who helps Stewart. Cathy O'Donnell plays the female romantic lead but is a bit on the bland side, frankly. Good story.....solid western.....deserves to be better known. Buy the DVD. It''s cheap. You won't be sorry.",
         "Each association of Mann and Stewart had excellent results, this being the last of the series that began with \"Winchester 73\" in 1950. Here the scenery is also one of the most important factors, specially that it was filmed in Cinemascope. The french critic Andre Bazin was worried that the process could affect Mann's style. In my opinion the result is absolutely great and I am sure \"Bend of the River\",\"The Naked Spur\" and \"The Far Country\" would have benefited from it. Nowadays with the LCD, Plasma and Widescreen TVs we can definitely agree that time proved that the widescreen was there to stay. Like the green colors were predominant in \"The Naked Spur\" in this film it is the different shades of browns of the landscape of New Mexico, the adobe houses and even the jackets of James Stewart, Arthur Kennedy and Alex Nicol. Stewart is the man that comes looking for the person responsible for the killing of his brother. His quest is going to bother many people and he is in for a lot of violence, very similar to \"The Violent Men\" made in the same year and also in Cinemascope. Mann wanted to make a western about King Lear (which he never did) but it was not this one, although you can feel he was toying with the idea.",
         "Saw this film on its initial release, when I was just a kid. It has always stuck with me. I thought it was the scene (very controversial for its violence, at the time), where James Stewart is dragged through fire. Saw it a couple of years ago in full Cinemascope and realized why it had, literally, haunted me. This is a film that is driven (although it develops slowly) by themes from \"Oedipus Rex\" and \"King Lear.\" But, it isn't pretentious. Mann was just a genius at fusing these elements into what at first seems like an expertly made western. James Stewart proves here that he had an acting range that is staggering. As a revenge-obsessed \"good guy,\" he falls into the lives of a group of people enveloped by fates that are pure tragedy. Donald Meek is superb as a patriarch betrayed by his haywire son and trusted foreman (beautifully played by Arthur Kennedy). I just watched the video with some trepidation, fearing it would be really hurt by scan-and-pan. But the actors are all usually in camera range and the camera set-ups are unintrusive, but always right for the situation. This is a film for anyone who is a fan of great filmmaking.",
         "Another solid western by a man who gave some of the best works of the whole genre (the naked spur, cimarron,etc).This is the story of a double search:Stewart is looking for the man who's responsible for his brother 's death.Crisp is afraid of a man who might possibly kill his son:he has a recurrent dream which frightens him .Little by little the two stories converge and make one in one of the most brilliant western screenplays of the fifties.The dreamlike touch gives a movie another dimension,which only great directors can conjure :Walsh,Ford ,Daves,or of course Mann. The characters are more complex than we thought at first sight,and the cliché of the old wealthy man with a son -black-sheep-of-the-family and an almost- adoptive- son-good-boy is avoided.Alex Nicol and Arthur Kennedy give strong nervous tortured portrayals which almost outshine star Stewart.Crisp is equally effective in the part of a man who tries not to face the truth -which may be the meaning of his premonitory dream-,and will finally see it when he is blind.The lead female part is the weakest link of the movie ,but Aline MacMahon's colorful Kate more than makes up for Cathy O'Donnell's blandness. I had seen this movie for the first time when I was 13.I saw it again yesterday.It has not aged a bit.",
         "James Stewart rides the vengeance trail as he comes to a dusty New Mexico town in search of a gun runner whose wares were used by raiding Indians that led to his brother's death. Stewart is grim and determined in this beautifully filmed western to square matters with his unknown quarry and meets with hostility and indifference at every turn. The film has touches of extreme violence which was unusual for its time. The story is packed with suspense and tension as Stewart's Will Lockhart seeks his personal retribution. Along the way, Lockhart is befriended by a pretty girl and a strong-willed female rancher who are sympathetic to Lockhart's quest. Another sub plot has a cattle baron, his neurotic son, and a ranch foreman riding rough-shod over other ranchers and townspeople. Arthur Kennedy and Donald Crisp head a great cast of veteran western character actors, and a nod goes to Aline MacMahon for her portrayal of the plucky ranch woman.",
         "The Man from Laramie (1955) You have a right to expect a movie starring James Stewart, directed by Anthony Mann, and photographed by Charles Lang to be spectacular. And it is. This is one of the first full wide screen Technicolor movies, and it's one drawback might be that it is trying to apply a new format to an old and slightly tired genre. The fact it rises above its familiarity is to Stewart's credit and Mann's. Lang (who photographed an extraordinary number of great black and white films) trades stately perfect color and design for pure drama and intensity, which are very different things, but it gives a full backdrop to the high drama here. This is a beautiful movie, for sure, in its restrained way. (The fact that it's restrained when the whole world is gaping for surging new big color movies is a small miracle in itself.) Mann did a number of westerns, for which he's most known, and a few other genre pics, but first made his name as a film minor film noir director. He seems to carry over enough of the edginess and cruelty of those noirs to make his Westerns exciting rather than epic, which is a good thing. He and Stewart worked together on five westerns, and they have taken on a life of their own, and a feeling of their own that's impressive once you click into it. One of the best noir elements to the story (which was not written by Mann) is the feeling of the lone man against the world, a great theme. The key woman lead is a cliché, the widow hanging on against the odds in town. In this case she is a charming but slightly miscast Cathy O'Donnell, a favorite of mine who takes demur and innocent to the heights. You see from the outset that this widow and Stewart's good, hard working character are destined for some kind of meeting of destinies. And there are inevitable clichés, too, that you might get used to--the stoic Indians, the older woman as tough as nails (and a gem of a role), a patriarch with a thoughtful wise look that shows counteracting wisdom, and fistfights in the dust. It's all great stuff, in the Western mold. (One fight is right in the middle of a mooing herd of cattle, and it's pretty fun.) You do wonder sometime at the possibility of a super nice guy sticking it out against all these obstacles, and I mean obstacles. The domineering (and sometimes evil) family led by Donald Crisp, with the always impressive Arthur Kennedy as the chief hand, seems like more than a man could handle. But the conflict is real, and the movie makes it pertinent beyond being \"just\" a western. And beautifully done. Even if you don't like westerns, this will grab you anyway.",
         "Will Lockhart {James Stewart} leaves his home in Laramie on a mission to find out who was responsible for selling repeating rifles to the Apaches who killed his brother. Landing in Coronado, New Mexico, he finds that most of the territory is owned and ruled by Alec Waggoman {Donald Crisp}, a fierce patriarchal rancher with one loose cannon son, Dave {Alex Nicol} and another surrogate son, Vic Hansboro {Arthur Kennedy} running the Barb Ranch. As he digs deeper, Lockhart finds he is in the middle of two wars, one of which may eventually conclude his revenge fuelled mission. The Man From Laramie is the last of the five Westerns that director Anthony Mann made with leading man James Stewart. The only one filmed in CinemaScope, it is a visually stylish picture that is full of brooding psychological themes and boasts great acting and a tight script. It's no secret that Mann, before his sad death, was looking to make a Western King Lear, The Man From Laramie serves as a delicious starter to what would have been the main course. With its family dilemmas and oedipal overtones, Mann's Western is very Shakespearian in tone. That its characters are sumptuously framed amongst a harsh dangerous landscape further fuels the psychological fire; with the landscapes {terrificly photographed by Charles Lang} providing a link to the characters emotional states. So many scenes linger long and hard in the memory {none of which I would dare to spoil for would be new viewers}, so much so they each reward more upon subsequent revisits to the film. There's some minor quibbles down the pecking order; for instance Cathy O'Donnell as Barbara Waggoman is poor and contributes little to proceedings, but really it remains a quality piece of psychological work that barely gives us reason to scratch the itch. Taut, tight and tragic is The Man From Laramie, brought to us courtesy from the dynamite partnership of Mann & Stewart. 9/10",
         "From Columbia Pictures , produced by William Goetz and screenplay by prestigious Philip Yordan , a Western plenty of emotion , action and shootouts ; being the last and the best of James Stewart's classic Western collaborations with Anthony Mann. From a story by Thomas Flynn for the Saturday Evening Post and its subsequent novel with the same title . A cowboy named Lockhart (James Stewart) defies the local cattle baron (Donald Crisp) and his sadistic son (Alex Nicol) by working for one of his oldest rivals (Aline MacMahon) . The obsessed cow-herder going through hell and high water to track down the stranger who sold Indians weapons which led to the death of his brother ; then excitement increases until a surprising final . This exciting Western contains tension-filled familial atmosphere , thrills , suspense and gun-play . Magnificent western from duo Anthony Mann/James Stewart and their final collaboration . Colour , music , scenarios , landscapes all marks well in this thrilling story about a cowboy who deals with a baron land who's going blind and worries which of his two sons he will leave the ranch to . The picture has been described as a western version of King Lear adding a tautly strung outdoor Wodunnit . It describes a family tragedy in which there are extreme characters combined with psychological observations and enriched by eventual ambiguity . By that time (1955) the picture was considered very strong , tough , surprisingly cruel and brutal ; today is deemed a classic film . And seems to be a great influence of wide range such as violence and scenarios , both of them influenced in Spaghetti Western as well as outdoors similar to Almeria landscapes . Filmed in Cinemascope with colorful cinematography by Charles Lang supported by assistant Henry Jaffa , Mann gets to take from nature the maximum impacts , as desert , river , mountains , being wonderfully photographed . Impressive background scenarios , dramatic close-up along with shading illuminations , all of them perfectly mingled with a tale full of violence , tension , intrigue and shoot'em up . The filming took place on location in New Mexico , there were built two ranch : Big Barb and Half Moon , next to Santa Fe . The technician and artist team was formed by numerous actors and 142 technicians . Producers hired 18 mules , 24 horses and 800 cows and building a great ranch of 32 miles length . Nedless to say , the main and secondary cast is first-class . Top-of-the-range acting by the great James Stewart as a lone avenger obsessed with hunting down the men who sold guns to the Indians that murdered his brother . There are top-notch acting from old-stagers as Donald Crisp playing an aging ranch baron and Aline MacMahon as an old spinster and special mention to Western usual secondary Jack Elam as a sinister gunslinger . Delicate Cathy O'Donnell (Ben Hur) was widely felt to be badly miscast as Barbara Waggoman and seems a little lost among the movie's many shots and brawls. Emotive as well as intriguing musical score by George Duning performed by Morris Stoloff , including a notorious theme tune . This top-drawer Western was stunningly realized by the master Anthony Mann , including his characteristic use of landscape which is visually memorable . Mann established his forte with magnificent Western almost always with James Stewart . In his beginnings he made ambitious but short-lived quality low-budget surroundings of Eagle-Lion production as ¨T-men¨ , ¨They walked by night¨ , ¨Raw deal¨ , ¨Railroaded¨ and ¨Desperate¨ . Later on , he made various Western , remarkably good , masterpieces such as ¨The furies¨ , ¨Devil's doorway¨ and ¨Man of the West¨ and several with his habitual star , James Stewart, as ¨Winchester 73¨ , ¨Bend the river¨ , ¨The far country¨ , ¨Man of the West ¨. They are characterized by roles whose determination to stick to their guns would take them to the limits of their endurance . Others in this throughly enjoyable series include ¨Tin star ¨ that is probably one of the best Western in the fifties and sixties . After the mid-50 , Mann's successes came less frequently , though directed another good Western with Victor Mature titled ¨The last frontier¨. And of course ¨The man from Laramie ¨ that turns out to be stylish , fast paced , solid , meticulous , with enjoyable look , and most powerful and well-considered . This well acted movie is gripping every step of the way . It results to be a splendid western and remains consistently agreeable . Rating : Above average . Well worth watching and it will appeal to James Stewart fans ."
      ],
      "genres": [
         "Drama",
         "Western"
      ],
      "productionCompanies": [
         "Columbia Pictures Corporation",
         "William Goetz Productions"
      ],
      "summaries": [
         "Mysterious Will Lockhart delivers supplies to storekeeper Barbara Waggoman at Coronado, an isolated town in Apache country. Before long, he's tangled with Dave Waggoman, vicious son of autocratic rancher Alec and cousin of sweet Barbara. But he sticks around town, his presence a catalyst for changes in people's lives, searching for someone he doesn't know...who's been selling rifles to the Apaches.",
         "A stranger defies the local cattle baron and his sadistic son by working for one of his oldest rivals."
      ],
      "budget": 0
   },
   "movielensId": 3311,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1955-08-31",
      "dvdReleaseDate": "2000-02-08",
      "directors": ["Anthony Mann"],
      "runtime": 104,
      "movieId": 3311,
      "title": "The Man from Laramie",
      "mpaa": "PG",
      "actors": [
         "James Stewart",
         "Arthur Kennedy",
         "Donald Crisp",
         "Cathy O'Donnell",
         "Alex Nicol",
         "Wallace Ford",
         "Jack Elam",
         "John War Eagle",
         "James Millican",
         "Gregg Barton",
         "Boyd Stockman",
         "Frank De Kova"
      ],
      "imdbMovieId": "0048342",
      "originalTitle": "The Man from Laramie",
      "genres": ["Western"],
      "youtubeTrailerIds": [
         "1LxhF0hlflM",
         "aQXZ8LYrmT4"
      ],
      "plotSummary": "Will Lockhart (James Stewart) becomes entangled in the happenings of Coronado, an isolated western town, after delivering supplies there. He is especially involved with the Waggomans, an influential ranching family, and begins his search for someone selling rifles to the local Apaches, only to find out it is the son of the most powerful man in the area. It is at this point that his troubles begin.",
      "tmdbMovieId": 18264,
      "avgRating": 3.69094,
      "releaseYear": "1955",
      "numRatings": 254,
      "posterPath": "/c5JbxVnLBy9bZWjconkU1ZThTEC.jpg"
   }
}