{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "parent child relationship",
            "id": 970
         },
         {
            "name": "overbearing father",
            "id": 154796
         }
      ],
      "imdb_id": "tt0073902",
      "video": false,
      "title": "The Wild McCullochs",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "J. J. McCulloch",
               "gender": 0,
               "credit_id": "5410990bc3a3681acd000320",
               "name": "Forrest Tucker",
               "profile_path": "/yqdE1cqCXWhLTgIRHDgqHJMrJlY.jpg",
               "id": 41214,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Hannah McCulloch",
               "gender": 1,
               "credit_id": "54109934c3a3681ab700037b",
               "name": "Julie Adams",
               "profile_path": "/p6abeZkETxG9h2JdaKwzyesWSFv.jpg",
               "id": 31169,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Culver Robinson",
               "gender": 2,
               "credit_id": "54109950c3a3681ab400036a",
               "name": "Max Baer, Jr.",
               "profile_path": "/93tvf3sSYtMXoJ6upgHQXTyWSH0.jpg",
               "id": 40242,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Ali McCulloch",
               "gender": 1,
               "credit_id": "54109965c3a3681abf000302",
               "name": "Janice Heiden",
               "profile_path": null,
               "id": 163615,
               "order": 3
            },
            {
               "cast_id": 20,
               "character": "Steven McCulloch",
               "gender": 2,
               "credit_id": "54109b6c0e0a264c3b0002bb",
               "name": "Dennis Redfield",
               "profile_path": null,
               "id": 160959,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "R. J. McCulloch",
               "gender": 2,
               "credit_id": "541099bfc3a3681aba00033d",
               "name": "Don Grady",
               "profile_path": "/8l6LRNsG3G6Bm6VzpFNDVygjexZ.jpg",
               "id": 64458,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Gary McCulloch",
               "gender": 0,
               "credit_id": "541099d3c3a3681ac90003b2",
               "name": "Chip Hand",
               "profile_path": null,
               "id": 1362807,
               "order": 6
            },
            {
               "cast_id": 7,
               "character": "Father Gurkin",
               "gender": 2,
               "credit_id": "541099f1c3a3681aba000342",
               "name": "William Demarest",
               "profile_path": "/bQcQWPfKr7RLeDifSBdx4zlZGdV.jpg",
               "id": 21510,
               "order": 7
            },
            {
               "cast_id": 8,
               "character": "George",
               "gender": 2,
               "credit_id": "54109a03c3a3681ac400035b",
               "name": "Harold J. Stone",
               "profile_path": "/j48fWsfAFnSGAVOWeqHCrnK0ZQC.jpg",
               "id": 14505,
               "order": 8
            },
            {
               "cast_id": 9,
               "character": "Tony, the Bartender",
               "gender": 2,
               "credit_id": "54109a15c3a3681aba000346",
               "name": "Vito Scotti",
               "profile_path": "/pN3aRdEF78xyCHsZrju56FO12wK.jpg",
               "id": 82779,
               "order": 9
            },
            {
               "cast_id": 10,
               "character": "Rad",
               "gender": 2,
               "credit_id": "54109a2ac3a3681ab700038a",
               "name": "Sandy McPeak",
               "profile_path": "/lD0obbU43Edw7kjLsRFqKpgjfC.jpg",
               "id": 106726,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Missy",
               "gender": 1,
               "credit_id": "54109a6dc3a3681ab4000380",
               "name": "Lillian Randolph",
               "profile_path": "/mF7bedS0H2nNtQvWLBVKseqTUlJ.jpg",
               "id": 150633,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Cliff Randall",
               "gender": 2,
               "credit_id": "54109a98c3a3681ad3000335",
               "name": "Mike Mazurki",
               "profile_path": "/s1alibwL5JiBhBNZQGiN91Hccc3.jpg",
               "id": 84229,
               "order": 12
            },
            {
               "cast_id": 14,
               "character": "Charlie P.",
               "gender": 2,
               "credit_id": "54109aafc3a3681aba00034e",
               "name": "Billy Curtis",
               "profile_path": null,
               "id": 102426,
               "order": 13
            },
            {
               "cast_id": 15,
               "character": "Ralph",
               "gender": 0,
               "credit_id": "54109ac0c3a3681ab7000394",
               "name": "Biff Elliot",
               "profile_path": "/zygnbK6CJlQSXDhryUBfu8YUQkO.jpg",
               "id": 41719,
               "order": 14
            },
            {
               "cast_id": 16,
               "character": "Larry Carpenter",
               "gender": 2,
               "credit_id": "54109addc3a3681abf00031e",
               "name": "Kenneth Tobey",
               "profile_path": "/eDD3rIv203f48tnu7ONwfjXQW7J.jpg",
               "id": 103069,
               "order": 15
            },
            {
               "cast_id": 17,
               "character": "Pop Holson",
               "gender": 2,
               "credit_id": "54109af6c3a3681acd000346",
               "name": "Doodles Weaver",
               "profile_path": "/zkgv07aQJA3XMnJ1ZjrGH28SFWp.jpg",
               "id": 89735,
               "order": 16
            },
            {
               "cast_id": 18,
               "character": "Pervert",
               "gender": 2,
               "credit_id": "54109b16c3a3681abf000322",
               "name": "Timothy Scott",
               "profile_path": "/1KXqxseXqcbkQTHvybJArdLtdbs.jpg",
               "id": 83411,
               "order": 17
            },
            {
               "cast_id": 19,
               "character": "1st Police Officer",
               "gender": 2,
               "credit_id": "54109b3cc3a3681ac4000370",
               "name": "James Gammon",
               "profile_path": "/4oTidbjDQ8XU3LHot249SMlVLn4.jpg",
               "id": 16433,
               "order": 18
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "54109b9c0e0a264c3e0002d2",
               "name": "Max Baer, Jr.",
               "profile_path": "/93tvf3sSYtMXoJ6upgHQXTyWSH0.jpg",
               "id": 40242,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "54109bad0e0a264c4c0002ea",
               "name": "Max Baer, Jr.",
               "profile_path": "/93tvf3sSYtMXoJ6upgHQXTyWSH0.jpg",
               "id": 40242,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "54109bc50e0a264c3b0002c4",
               "name": "Max Baer, Jr.",
               "profile_path": "/93tvf3sSYtMXoJ6upgHQXTyWSH0.jpg",
               "id": 40242,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "54109be70e0a264c440002df",
               "name": "Fred J. Koenekamp",
               "profile_path": "/yxTbBWproHj24o8yrTLEjtzlF9u.jpg",
               "id": 19102,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5807d94d9251415a4d003761",
               "name": "David Berlatsky",
               "profile_path": null,
               "id": 69954,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5807d93fc3a368123b003357",
               "name": "Ernest Gold",
               "profile_path": null,
               "id": 12142,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5807d954c3a3680bb3003429",
               "name": "Jac McAnelly",
               "profile_path": null,
               "id": 1646202,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.197635,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 291861,
      "vote_count": 0,
      "budget": 0,
      "overview": "A story about the rich McCulloch Family, their overbearing father and the children's misguided blaming him for everything that doesn't go right.",
      "similar": [
         334,
         11631,
         8272,
         2539,
         8967,
         2024,
         858,
         111,
         634,
         1164,
         13,
         88,
         142,
         773,
         2288,
         4347,
         244772,
         319,
         41630,
         39254
      ],
      "original_title": "The Wild McCullochs",
      "runtime": 93,
      "poster_path": "/mPrXMvY6W5vH5gvHWfy0vQxxjlD.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1975-05-21",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "1949... a neat time to be young! - to be a McCulloch!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Max Baer Jr."],
      "runtime": 93,
      "synopsis": null,
      "writers": ["Max Baer Jr."],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0073902/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzc4MTU5OTA4Ml5BMl5BanBnXkFtZTcwMDc5NzAwMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Forrest Tucker, Julie Adams, Max Baer Jr. | See full cast and crew »"],
      "reviews": [
         "Jethro Bodine's literary talent, Corporal Agarn's running buddy from F-Troop, Robby AND Uncle Charlie from My Three Sons, the midget from High Plains Drifter, Frank Nitti from St.Valentines Massacre, the Baker from the Godfather,Madame Queenie from Amos and Andy, the Indian's manager from Major League, and the Creature From the Black Lagoon's leading lady??? Trouble with a capital \"T\" that's what by God! We begin this lovely trip through the last bastion of stereotypes that the mention of which still gets a laugh, instead of a cap being popped in your ass....the white Southern male. Being one myself I am semi-qualified to speak on this subject and make fun of myselves (plural) as I go along. To wit...oh yeah, we begin with Forrest Tucker, all hopped up on Old Forrester I suppose, beating the hell out of another 65 year old character actor that is enjoying getting beat up more than anyone I've ever seen. Actually it's the same guy that played the down and out boxer who was always getting whipped and losing his eyesight but ironically had no other means of paying his doctor bills so he had to keep fighting anyway. Makes sense to me. A few minutes later Forrest continues to make us all proud by dropping the top on his red convertible, and knocking down most of a pint of whiskey as he zips through a number of school zones on his way home to grab him a handful of the little lady, played juicily by a still gorgeous Julie Adams. (now you know why I paid $3 for this thing). Very nimbly, with yet another glass of whiskey in one hand, and Julie's rapidly unbuttoning blouse in the other hand he is informed that they are having \"green beans\" for dinner...all of a sudden his lust is diverted to pork chops and so he pats his wife on the ass as she dutifully, and mercifully trots off to rustle up some dinner. Scuse me, I mean supper--dinner is lunch down here. But before the supper bell rings, Forrest gets a call to advise him that one of the Rhodes Scholars that works for his trucking company had a head on collision as he crashed through a RR barrier, but he was relieved to hear he beat the train with some nifty driving, thus validating why they must have hired the guy in the first place. The driver survived though and one can only speculate that the brain damage he suffered could not have been such a terribly tragic thing. Hang on, that's just the first 5 minutes. SPOILERS AHEAD. You had to expect that though, I have to share. Jethro/Culver has a chip on his shoulder from his own personal stereotyping, and the fact that he had to wear a rope for a belt all those years. No vittles here, just the old man's daughter. Oooohhh, this is going to get ugly. And he displays none of the range we were so accustomed too on the Beverly Hillbillies. Takes this writer/director/star thing a little too seriously I think, that could be the reason old man McCulloch hates him so much. Or it could be that statutory rape thing with the 18 yr old daughter? You just know that the old man wants to punch our fledgling brain surgeon in his medula obadala but he is a very classy guy so he defers so he can go spar with his 16 yr old son. Plenty of drunken drag racing, drunken hay riding, and drunken strip poker, and more drunken ass whooping to go around. And if you're a fan of the \"beating up your kids is the only way to make them a man\" genre you will love this thing. I won't reveal any of the good parts (giggle snort) but the highlight of the movie is a \"homeric\" showdown/street brawl, Culver vs. McCulloch and a major, big time ripoff of the Quiet Man complete with odds savvy old ladies, gambling/guzzling priests, and even an old man on his death bed who is miraculously resuscitated by the sound of whooping and hollering as one more right cross lands on it's target. Oh yeah, the contestants even stop to have a beer before resuming the slugfest. I'm not going to tell you who wins the fight but considering Ellie May used to tie Jethro up like a pretzel everytime he'd complain about her biscuits...well, it's the high spot of the (gulp) film so I'll keep that one secret. Clint Eastwood likewise rips off Jethro in Any Which Way You Can. I'm dangerously close to surpassing my vast film knowledge here so I better not draw any more parallels OK? Believe it or not, the DVD transfer is fantastic and the soundtrack rivals movies like Giant and Hurry Sundown. It's very, very good Jethrine. I like this movie. Somebody slap me but I like this thing. It's really very funny. I've actually never been so hammered that I forgot the words to Old McDonald but in McCullochWorld your punishment is getting dumped out of the bed of a pickup to have your wife turn the sprinklers on you as you simulate a coma on the front lawn. 7/10 only cause they just don't make em' like this anymore.",
         "I had no idea that men were wearing their hair long in 1949, or that a Texas Catholic family would still have enough southern pride to hang a confederate flag in the den, or that William Demarest still thought that stupid red wig was fooling people in 1975. Inconsistencies and anachronisms aside, Max Baer's debut as director (he was screenwriter/producer/star only on MACON COUNTY LINE) is a fun little low-budget flick, a family melodrama with the same pacifist leanings he expressed in MACON COUNTY LINE. Forrest Tucker is at his blustery best as a two-fisted Texas millionaire, a self-made man who began as a trucker but fought his way to the top, eventually owning his own trucking company and putting his name on everything in the county. Max Baer plays his employee and nemesis, for he is dating Tucker's teenage daughter. Baer's hairstyle is the single most glaring anachronism. The odd mix of 1950s and 1970s fashions is straight out of middle-year HAPPY DAYS. The best sequence is the terrific fight that closes the film, as Tucker and Baer duke it out in a long sequence that apparently the entire town has been expecting for quite some time! The primary joy is the opportunity to watch a lot of old pros really put on a show: in addition to Tucker and Demarest, we get Vito Scotti, Harold J. Stone, Don Grady, Julie Adams, Billy Curtis and Mike Mazurki rounding out a great cast. Easy to watch and easy to forget. 6/10.",
         "First off all the other ratings were done nearly 30 years after the movie was made. Of coarse it is not going to hold up to standards in the era of 2002 - 2012. This was Max Baer Jr. first attempt at directing with help from actors he knew and done for a very low budget. It is not a block buster movie, but it is entertaining and has an awesome cast. I think you have to give a little credit to Mr. Baer for even attempting this. I do not see any of the critics attempting a movie. As the matter of fact the only attempt i see from them is sitting on their duffs watching a movie and pretending to be a professional at judging ambitions. I liked this movie and thought it was alright in a 1975 sort of way. I will admit that I am a bit partial to The Wild McCullochs. After all I did have a cameo with Don Grady in the Jeep!",
         "Max Baer, Jr. produced, directed, and had a role in The Wild McCullochs who might be better classified as dysfunctional rather than wild. Julie Adams and Forrest Tucker head the clan with children Don Grady, Janice Heiden, Dennis Redfield, and Chip Hand. Most of the film is a combination of Dallas and The Last Picture Show. Forrest Tucker runs a trucking company and he's the Jock Ewing of the local area in Texas. Max Baer is one of his drivers and is courting his daughter Janice Heiden which doesn't sit well with Tucker. Oldest son Don Grady is a chip of the rough old block. He joins the Air Force just in time to get sent to Korea. The other two sons have issues which quite frankly are not brought out too well in the script. Especially Redfield whose main problem just seems to be he won't grow up. The film looks like it could have been a failed TV pilot. Quite frankly the characters were just not interesting enough for me to care. And while those other two items that I cited are the basis for most of the film, the rather wild climax was completely ripped off from The Quiet Man. It didn't become a TV series for good reason.",
         "Maz Baer Jr.'s directorial debut certainly isn't what you would call impressive. He also wrote, produced and co-starred in this pointless film. J.J. McCulloch is the rich owner of a trucking company. He believes that most disagreements should be handled with your fists. His poor parenting causes a lot of strife in his family and results in tragedy. The main selling point of \"The McCullochs\" in its trailer is that it features one of the finest brawls ever captured on film. That speaks volumes about the mentality of this movie. Watching several poorly executed fights and listening to the McCulloch clan be miserable isn't exactly my idea of entertainment. 1/10"
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [],
      "summaries": ["A Story about the rich McCulloch Family, their overbearing father and the children's misguided blaming him for everything that doesn't go right."],
      "budget": 0
   },
   "movielensId": 3312,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1975-05-21",
      "dvdReleaseDate": "2000-02-08",
      "directors": [
         "Max Baer",
         " Jr."
      ],
      "runtime": 93,
      "movieId": 3312,
      "title": "The Wild McCullochs",
      "mpaa": "",
      "actors": [
         "Forrest Tucker",
         "Julie Adams",
         "Max Baer",
         " Jr.",
         "Janice Heiden",
         "Dennis Redfield",
         "Don Grady",
         "Chip Hand",
         "William Demarest",
         "Harold J. Stone",
         "Vito Scotti",
         "Sandy McPeak",
         "Lillian Randolph",
         "Mike Mazurki",
         "Billy Curtis",
         "Biff Elliot",
         "Kenneth Tobey",
         "Doodles Weaver",
         "Timothy Scott",
         "James Gammon"
      ],
      "imdbMovieId": "0073902",
      "originalTitle": "The Wild McCullochs",
      "genres": [
         "Romance",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A story about the rich McCulloch Family, their overbearing father and the children's misguided blaming him for everything that doesn't go right.",
      "tmdbMovieId": 291861,
      "avgRating": 2.375,
      "releaseYear": "1975",
      "numRatings": 8,
      "posterPath": "/mPrXMvY6W5vH5gvHWfy0vQxxjlD.jpg"
   }
}