{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "tree",
            "id": 3352
         },
         {
            "name": "sequoia",
            "id": 156228
         }
      ],
      "imdb_id": "tt0044420",
      "video": false,
      "title": "The Big Trees",
      "recommendations": [
         222593,
         100257,
         283915,
         28775,
         57090,
         81699,
         43450,
         258037,
         94618,
         102286,
         72241,
         76131,
         73430,
         225958,
         76140,
         44631,
         40718,
         24004,
         28558,
         27635
      ],
      "backdrop_path": "/i8LZJwg665GZGpWnXxQAMgUCuhm.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Jim Fallon",
               "gender": 2,
               "credit_id": "52fe4642c3a36847f80f5131",
               "name": "Kirk Douglas",
               "profile_path": "/vIZgu07gJtS2j460jgBlI1IvkAO.jpg",
               "id": 2090,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Alicia Chadwick",
               "gender": 1,
               "credit_id": "52fe4642c3a36847f80f5135",
               "name": "Eve Miller",
               "profile_path": "/pqsfc8kC1y0Jz6oHXWPI3c8AKbW.jpg",
               "id": 83622,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Daisy Fisher / Dora Figg",
               "gender": 1,
               "credit_id": "52fe4642c3a36847f80f5139",
               "name": "Patrice Wymore",
               "profile_path": "/zSXc568v4GjlpQEwbxYThCCLNgt.jpg",
               "id": 4356,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Walter 'Yukon' Burns",
               "gender": 2,
               "credit_id": "52fe4642c3a36847f80f513d",
               "name": "Edgar Buchanan",
               "profile_path": "/iz7cTUzvJZ0C0ZmzvB4CnmhiiQX.jpg",
               "id": 30512,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Frenchy LeCroix",
               "gender": 2,
               "credit_id": "52fe4642c3a36847f80f5141",
               "name": "John Archer",
               "profile_path": "/64WXX5WH4kuaGAa2VckHqx3v1JQ.jpg",
               "id": 78793,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Tiny",
               "gender": 2,
               "credit_id": "52fe4642c3a36847f80f5145",
               "name": "Alan Hale Jr.",
               "profile_path": "/fWdJEklrhAyZsVvyy1LJPILiFZG.jpg",
               "id": 35322,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Judge Crenshaw",
               "gender": 2,
               "credit_id": "52fe4642c3a36847f80f5149",
               "name": "Roy Roberts",
               "profile_path": "/zKGk6q2As8QFkE4V0OHD3JmF4yA.jpg",
               "id": 19400,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Elder Bixby",
               "gender": 2,
               "credit_id": "52fe4642c3a36847f80f514d",
               "name": "Charles Meredith",
               "profile_path": "/sPHFfu1qg2DvBQj7iYRhi1OebpW.jpg",
               "id": 130423,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Cleve Gregg",
               "gender": 2,
               "credit_id": "52fe4642c3a36847f80f5151",
               "name": "Harry Cording",
               "profile_path": "/gvWWu40cDWcRbhIwDjx7tyfsgJK.jpg",
               "id": 98052,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Sister Blackburn",
               "gender": 1,
               "credit_id": "52fe4642c3a36847f80f5155",
               "name": "Ellen Corby",
               "profile_path": "/3oBJ4HH5z7FspFMxOTUe1eBzoIA.jpg",
               "id": 5738,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4642c3a36847f80f5121",
               "name": "Felix E. Feist",
               "profile_path": null,
               "id": 103910,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4642c3a36847f80f5127",
               "name": "John Twist",
               "profile_path": null,
               "id": 100914,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4642c3a36847f80f512d",
               "name": "James R. Webb",
               "profile_path": null,
               "id": 69104,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5688887a92514132db023227",
               "name": "Kenneth Earl",
               "profile_path": null,
               "id": 935862,
               "department": "Writing",
               "job": "Story"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Western",
            "id": 37
         }
      ],
      "popularity": 1.156107,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 43368,
      "vote_count": 9,
      "budget": 0,
      "overview": "In 1900, unscrupulous timber baron Jim Fallon plans to take advantage of a new law and make millions off California redwood. Much of the land he hopes to grab has been homesteaded by a Quaker colony, who try to persuade him to spare the giant sequoias...but these are the very trees he wants most. Expert at manipulating others, Fallon finds that other sharks are at his own heels, and forms an unlikely alliance.",
      "similar": [
         1381,
         8967,
         8645,
         10315,
         73723,
         258230,
         57120,
         7980,
         351211,
         312831,
         30177,
         11914,
         507892,
         51409,
         42468,
         67158,
         143547,
         40730,
         11110,
         432373
      ],
      "original_title": "The Big Trees",
      "runtime": 89,
      "poster_path": "/23kldjf9wR14LzYJqtV1W8Bf04w.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
         "name": "Warner Bros. Pictures",
         "id": 174,
         "origin_country": "US"
      }],
      "release_date": "1952-02-05",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "MAMMOTH REDWOOD WILDERNESS -- TREASURE PILED TO THE SKY!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Felix E. Feist"],
      "runtime": 89,
      "synopsis": null,
      "writers": [
         "John Twist",
         "James R. Webb"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0044420/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIwMDkwNDQ2N15BMl5BanBnXkFtZTcwMTc0MzU1MQ@@._V1_SY317_CR51,0,214,317_AL_.jpg",
      "actors": ["Stars: Kirk Douglas, Eve Miller, Patrice Wymore | See full cast and crew »"],
      "reviews": [
         "The movie talks about a greedy lumberman called Jim Fallon (Kirk Douglas) who tries to make himself the owner of a redwood with impressive trees called ¨Sequoias¨ placed on California . A group of religious Quakers care the rousing trees like a holy mission . As a Quaker colony tries to save the giant sequoias from a timber baron . Meanwhile , Kirk falls in love with the leader (Eve Miller) , befriends a kind old man (Edgar Buchanan , a real scene stealer) and confronts enemies . Fallon will have to confront some of his own workers to vanquish the battle . The film deals upon the taking on amongst nasty timbermen and peaceful homesteaders . The picture blends action western , a love story , thrills and stimulating outdoors . The landscapes with the Sequoais's woods are spellbound and breathtaking . There are excellent action sequences , as a train derailing where Kirk Douglas demonstrates his energy as action hero . Acting by main actors is top notch similarly to support cast (Edgar Buchanan , Patrice Wymore , Alan Hale and John Archer) in which everybody is awesome . Cinematography by Bert Glennon is glamorous and colorful but is quite worn-out ; in fact , in 2002 the rights to this film became public domain . This film compellingly directed by Felix Feist results to be a remake from ¨Valley of giants (1938)¨ by William Keighley with stock footage taken from this film and was starred by Wayne Morris , Claire Trevor and Alan Hale . The flick will appeal to landscape lovers and Kirk Douglas fans . Rating: Good . Well worth watching .",
         "In his autobiography, The Ragman's Son, Kirk Douglas was telling about how badly he wanted to get out of his Warner Brothers contract. He made Jack Warner and offer he couldn't refuse, a picture for nothing, zero, zip, bupkis and he'd be released. Jack Warner took him up and the result was The Big Trees. Now getting a top star to work for nothing, you'd have thought that Warner would get him something good. Instead Kirk Douglas was saddled with an even worse than usual programmer and something he described as the worst film he ever made. Kirk is a two fisted lumber baron who goes out to the Northern California area to cut down those giant redwoods. A Quaker group who's settled there, ain't having none of that and the story unfolds. The players all look so totally bored. And the way the script is written you have absolutely no liking for Douglas's character Jim Fallon or believe it when he switches sides. In fact the villain of the piece, John Archer is treated like a doormat by Douglas when he was working for him. Watching the movie I couldn't blame him for knifing Douglas in their business. Ditto when gal pal Patrice Wymore sells a dam to Douglas's enemies and momentarily throws our hero for a loop. Best thing you could say about this is that it does have some nice special effects with Kirk Douglas riding on the runaway lumber train. The scene in How the West Was Won was copied and improved with Cinerama from the Big Trees. They should have just left the forest alone.",
         "While certainly watchable, \"The Big Trees\" had the makings of what could have been a better, perhaps much better, movie. With Kirk Douglas in the lead role, a supporting cast of solid character actors, settings that lend themselves to visually appealing scenery, and a story that raises worthwhile environmental and ethical issues, it could have been quite good. As a predatory but charismatic lumberman, Douglas has a role that allows him to use some of his best strengths as an actor, and the scenario provides him with two main characters to play off of, with Edgar Buchanan as a loyal but incorruptibly honest associate, and Eve Miller as an idealist determined to save the redwood forest that Douglas's character plans to exploit. Buchanan is especially believable in his role. The story and script, though, don't give Douglas or the others a lot to work with. The story never tackles the most important issues head-on, nor does it explore the most significant of the possible tensions in the characters' relationships with one another. The important environmental questions and other such topics are dealt with only on a surface level, and aside from Douglas's own character, who changes rather abruptly and unconvincingly, there is little character development. The religious angle was certainly well-intentioned, but it never seems to fit in comfortably with the other story elements. It's still all right for lighter entertainment, and there are some good scenes. Then too, when Douglas gets the chance, he can be quite interesting to watch in this kind of role. As long as you don't expect too much, it might be worth seeing, but it missed quite a few opportunities to be a much more substantial movie.",
         "I bought a copy of this film for a very small price at a job lot store. The company, Global Multimedia Corporation, said this was a digitally remastered copy, called Value DVD. It was amusing that the cover presented Kirk Douglas and Alicia Chadwick. Alicia Chadwick is actually a major character in the story who was played by Eve Miller. The color of this restored master was indeed very good on my plasma TV. The story was set on a historical event which took place during the McKinley administration in 1900. Apparently, land with the giant redwoods was opened up for grabs by allowing lumber companies to pay for new claims, even for land which had been settled by homesteaders under an 1868 act of Congress. Our hero Jim Fallon heads west with cronies from Wisconsin to make his fortune. As the story unfolds with some tragedy, he is forsaken by former associates, and warms to his new friends, the Quakers who had settled the land before. Indeed, he turns the tide in their favor, thus redeeming himself, and winning the girl. The movie was excellent with great stunts, seemingly performed by Douglas himself. It is really instructive to see how much good film action was done long before digital effects. Indeed, this movie could give you a real taste for quality movies of mid-20th century.",
         "Okay western tells the tale of Kirk Douglas as a would-be lumber baron with more charm than business savvy. Not as good as it could have been with a little sharper direction, but the dialog has some spark and Douglas shines like a new penny when he smiles. He gets adequate support from the usual suspects, with Patrice Wymore particularly good as his dance hall prostitute girlfriend. Eve Miller as the real love interest is a bit flat by comparison, even granted that she's stuck in the role of a holy roller trying to protect California's giant redwoods. The plot manages to get genuinely clever at times, with the local judge conspiring to help the Quakers foil Douglas's lumber scheme, Douglas scheming right back, and then the whole thing going topsy-turvy. Still, something is missing (and the faded print I saw didn't help) but the ending goes big to try to save it and nearly succeeds. Worth the time for fans of Douglas, but not a must-see title.",
         "Kirk Douglas works with wood and wants to make money quick by grabbing land in California and cutting the giant and very old trees. He ends up getting involved with religious people who live there and only want him to cut the newer and smaller trees. Patrice Wymore is the woman who is in love with him but he starts falling for the religious Eve Miller. The unusual and interesting scenery makes this western worth seeing. Also Douglas here is at his best. It is a shame that the colors in the DVD, were very inferior to what I remember from the film when it was first released in 1952.",
         "\"The Big Trees\" is a Western, set in northern California around 1900. The main character is Jim Fallon, a timber baron who has recently moved to the state from Wisconsin. Fallon's motive is to take advantage of a new law which will allow him to stake a claim to the area's dense forests. Fallon especially has his eyes on the giant redwoods, the world's largest (and among its oldest) trees which he believes will net him a handsome profit. There is, however, a problem. A religious community have made their home in the forest and are determined to save the trees, which they regard as symbols of the power and majesty of God. So sacred are the trees to them that they even hold their services outdoors in a redwood grove rather than in a church. (The sect have some similarities with both the Amish and the Quakers, although they are probably not intended to be identified with either). A further complication arises when Fallon falls for Alicia, an attractive young widow who is a member of the sect. In the first half of the film Fallon is portrayed as a rogue, smooth and plausible but unscrupulous and not always likable. About halfway through, however, he undergoes a change of heart and becomes one of the good guys, fighting alongside the sect in order to save the trees from his former associates, who turn out to be even more greedy and unscrupulous than he ever was. The film has some good points. The photography of the Californian forests is well done and there are some good action sequences, including a scene where Kirk Douglas leaps onto a runaway train . The theme is a potentially interesting one; environmentalism was not as hot a topic in the early fifties as it has become since, so a film with a conservationist theme was something of a novelty. Moreover, the film gives an interesting slant to the subject, showing the religious roots of the environmental movement. Despite this, however, the film also has its weaknesses. The plot is excessively complex; at times it seems as though you need a thorough knowledge of Californian land law in order to understand what is going on. It also goes through too many twists and turns, with characters assumed to be bad turning out to be good and vice versa, with abrupt changes of mood. At times it all seems fairly light-hearted and then turns into serious drama as two major characters meet violent deaths in quick succession. The acting is generally poor. This is not, by any stretch of the imagination, Douglas' best film or best performance, but the supporting cast are no better. Overall, \"The Big Trees\" tries to be unusual but ends up as just a standard action movie, and not a very good one. 5/10",
         "This is a story about a young opportunist and slick-talker (Kirk Douglas as Fallon) who leaves his floundering lumber operation in Wisconsin in order to exploit a piece of Federal Lands Claims legislation that went into effect in 1900. Hoping to make a quick fortune, he heads for northern California and the vast tracks of Redwoods and Sequoias there. The plot's central conflict is developed when Fallon/Douglas encounters a community of nature-loving religious pacifists who have been living for years on the land that he hopes to harvest. Much attention is paid, in this film, to the simple arguments presented by these people who consider the giant trees to be sacred reminders of God's greatness. The forest is their church, and they strive to convince would-be (de)foresters such as Fallon that the trees are more valuable left standing than being cut down and used for lumber. Douglas' performance is nuanced and convincing, as he portrays the deep internal transformations that his character goes through. In addition, there is a truly remarkable action sequence--clearly the great grand-daddy of all of Tom Cruise's (et al.) exploits--in which Douglas leaps aboard a runaway train. In a silent \"wink\" to savvy audience members, the mock-Spanish name of the California county where all this takes place is written on a sign over the door of the courthouse: San Hedrin.",
         "Sprawling drama is uneven because you wouldn't expect some of the characters and the story line to go down the path it does. Kirk Douglas is in fine form as the unscrupulous lumber barren smitten by a Quaker-like woman in California. Her father winds up dead after a tree from the Douglas lumber company comes down on the house and crushes him. He knew the tree was coming. Douglas gets blamed for his death thanks in part to two of his vicious partners. In addition, what makes this uneven is the part taken by Edgar Buchanan. Buchanan, as a gunslinger, come on. What gives here? When Buchanan goes with Douglas to Indiana, he is taken with that religion and becomes sheriff of the town. This is just too hard to fathom and the ending is as predictable as they come.",
         "The Big Trees (1952) There might be some value in seeing this movie as a sign of another environmental time. There is a fight back and forth over a stand of big, valuable trees, and the owner of them at one point is the U.S. government. But even that will not save them. The movie feels like a Wild West genre film, but set in the big woods of the coast instead of the deserts or Monument Valley. But there are all the simple good folk (in this case, Quakers), the sheriff and buddies, the good guy with issues, and the general mischief of any cowboy town. In general, substitute lumberman for cowboy. And substitute Felix E. Feist for John Ford as director. Feist made a series of B-movies, sports movies, and other genre flick, and this really is one of them, even though Kirk Douglas, the main actor, was coming off of two major movies elsewhere. It condemns both the movie and the reviewer to admit I had to skip parts of it, it just got so boring. Even Douglas couldn't lift it up. Even fistfights and gunfights and a huge explosion of a timbered railroad bridge couldn't save it. It isn't a terrible movie, but just routine to the point of \"don't bother.\" Naturally it's better than a lot of dreck on television, and that's where you ought to catch it, some night when nothing better looms, by accident. It might actually be fun if it catches you by surprise. Two things I noticed that were great. One, there is a legal trick pulled where the judge uses the criminal code to get away with cutting some giant trees legally, sort of. And the other is where some women folk (Quakers, who are famous for their pacifism) swarm a man with a gun, knock him down, and then, with relish, one of the women smacks him with a large rock."
      ],
      "genres": [
         "Action",
         "Romance",
         "Western"
      ],
      "productionCompanies": ["Warner Bros."],
      "summaries": [
         "In 1900, unscrupulous timber baron Jim Fallon plans to take advantage of a new law and make millions off California redwood. Much of the land he hopes to grab has been homesteaded by a Quaker colony, who try to persuade him to spare the giant sequoias...but these are the very trees he wants most. Expert at manipulating others, Fallon finds that other sharks are at his own heels, and forms an unlikely alliance.",
         "Jim Fallon is a big-time lumber man who decides to take advantage of a new Act of Congress that encourages the felling of trees like the big Redwoods in California. Fallon is a wheeler dealer who even manages to convince his men to go with him, even though he hasn't been able to pay them for weeks. When he gets to California, he finds that a group of Quakers have laid claim to the land and have done so primarily to protect the trees. He's particularly interested in Sister Alicia Chadwick and soon reconsiders. He'll have to fight some of his own men however if they're to win the battle.",
         "A Quaker colony tries to save the giant sequoias from a timber baron."
      ],
      "budget": 0
   },
   "movielensId": 3314,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1952-02-05",
      "dvdReleaseDate": "2000-02-05",
      "directors": ["Felix E. Feist"],
      "runtime": 89,
      "movieId": 3314,
      "title": "The Big Trees",
      "mpaa": "",
      "actors": [
         "Kirk Douglas",
         "Eve Miller",
         "Patrice Wymore",
         "Edgar Buchanan",
         "John Archer",
         "Alan Hale Jr.",
         "Roy Roberts",
         "Charles Meredith",
         "Harry Cording",
         "Ellen Corby"
      ],
      "imdbMovieId": "0044420",
      "originalTitle": "The Big Trees",
      "genres": [
         "Romance",
         "Western"
      ],
      "youtubeTrailerIds": ["iM-64OX8fo8"],
      "plotSummary": "In 1900, unscrupulous timber baron Jim Fallon plans to take advantage of a new law and make millions off California redwood. Much of the land he hopes to grab has been homesteaded by a Quaker colony, who try to persuade him to spare the giant sequoias...but these are the very trees he wants most. Expert at manipulating others, Fallon finds that other sharks are at his own heels, and forms an unlikely alliance.",
      "tmdbMovieId": 43368,
      "avgRating": 3.04167,
      "releaseYear": "1952",
      "numRatings": 36,
      "posterPath": "/23kldjf9wR14LzYJqtV1W8Bf04w.jpg"
   }
}