{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "bachelor",
            "id": 1338
         },
         {
            "name": "musical",
            "id": 4344
         },
         {
            "name": "theatrical producer",
            "id": 10963
         }
      ],
      "imdb_id": "tt0043618",
      "video": false,
      "title": "Happy Go Lovely",
      "recommendations": [],
      "backdrop_path": "/mKq238vN5z5PSj8j1MOYRzRWXx.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "B.G. Bruno",
               "gender": 2,
               "credit_id": "52fe4b00c3a368484e172255",
               "name": "David Niven",
               "profile_path": "/xslrziGA3B24iQ7BG9IO0ugycDo.jpg",
               "id": 14261,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Janet Jones",
               "gender": 0,
               "credit_id": "52fe4b00c3a368484e172259",
               "name": "Vera-Ellen",
               "profile_path": "/kMpfnWzEnVmkrFUVumIOPjzYSmQ.jpg",
               "id": 77675,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "John Frost",
               "gender": 2,
               "credit_id": "52fe4b00c3a368484e17225d",
               "name": "Cesar Romero",
               "profile_path": "/fdPXkT3PDFCvVpfI1MUdbEMuz3n.jpg",
               "id": 4355,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Paul Tracy",
               "gender": 2,
               "credit_id": "52fe4b00c3a368484e172261",
               "name": "Gordon Jackson",
               "profile_path": "/yz1S8Ge93l9DoC3zmElq26KN2Ug.jpg",
               "id": 41998,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Charlie",
               "gender": 2,
               "credit_id": "58c2c890c3a36842f4010c40",
               "name": "Bobby Howes",
               "profile_path": "/ppcyRKJZGgTD6Uz5teRKGgcEXHz.jpg",
               "id": 939642,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Mae",
               "gender": 0,
               "credit_id": "58c2c87e92514104e901302a",
               "name": "Diane Hart",
               "profile_path": null,
               "id": 935335,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Madame Amanda",
               "gender": 2,
               "credit_id": "58c2c8aec3a36842d6011396",
               "name": "Barbara Couper",
               "profile_path": "/rN69t5lyXO6gLW8wfodfWBSSVMm.jpg",
               "id": 1065822,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Dodds",
               "gender": 2,
               "credit_id": "58c2c8cfc3a3684294011165",
               "name": "Henry Hewitt",
               "profile_path": null,
               "id": 945387,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Mrs. Urquhart",
               "gender": 1,
               "credit_id": "58c2c8ed92514104f70126f0",
               "name": "Gladys Henson",
               "profile_path": "/4UwP0jgxMcYz5Hzk4mrmNWHtFMz.jpg",
               "id": 559081,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4b00c3a368484e172251",
               "name": "H. Bruce Humberstone",
               "profile_path": "/mHdkYOkKMhIQgrcHmIglB8bwvzz.jpg",
               "id": 87700,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5547b6a292514119e00092b9",
               "name": "Val Guest",
               "profile_path": "/99rZHWC9WKCyVgFLpBy1fKDkyLB.jpg",
               "id": 39853,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5953320ac3a368382e01196a",
               "name": "Marcel Hellman",
               "profile_path": null,
               "id": 592414,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "595332139251416914001a05",
               "name": "Mischa Spoliansky",
               "profile_path": null,
               "id": 592417,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5953321b92514168bf001a12",
               "name": "Erwin Hillier",
               "profile_path": null,
               "id": 31050,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "59533223c3a368151c02b69f",
               "name": "Bert Bates",
               "profile_path": null,
               "id": 10185,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5953322a9251412b31031246",
               "name": "John Howell",
               "profile_path": null,
               "id": 40356,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "595332309251411d9800fedd",
               "name": "Anna Duse",
               "profile_path": null,
               "id": 1290010,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 0.462851,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 127602,
      "vote_count": 1,
      "budget": 0,
      "overview": "B.G. Bruno, a rich bachelor, the head of a successful greeting-card company in Scotland, is essentially a kind man but respectable to the point of stodginess and extreme stuffiness. An American troupe visiting Edinburgh wants to produce a musical in town but has trouble getting backers. Bruno meets several of the leading ladies of the show; through a misunderstanding he doesn't correct they think that he's a newspaper reporter. He falls in love with one of the women, who reciprocates; he grows more lively and friendly, to the surprise of his employees. After a series of mishaps and comic incidents comes a happy ending: a successful show and true love.",
      "similar": [
         11224,
         872,
         224141,
         14128,
         16119,
         824,
         3933,
         11631,
         134,
         10882,
         18947,
         46195,
         194662,
         196867,
         9032,
         15969,
         11970,
         10020,
         426,
         41233
      ],
      "original_title": "Happy Go Lovely",
      "runtime": 97,
      "poster_path": "/y6IvKB3BrpPL4V0IlZ8zEmVQTfG.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Marcel Hellman Productions",
         "id": 19852,
         "origin_country": ""
      }],
      "release_date": "1951-03-06",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "Love...Fun...Youth...Set to Music!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["H. Bruce Humberstone"],
      "runtime": 97,
      "synopsis": null,
      "writers": [
         "Val Guest",
         "Friedrich Dammann"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0043618/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEzOTUwMjQwMl5BMl5BanBnXkFtZTcwMDY5MDIyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: David Niven, Vera-Ellen, Cesar Romero | See full cast and crew »"],
      "reviews": [
         "I was having just about the worst day of my life. Then I stumbled on this cute film, watched it, and now I'm ready to go out & kiss a streetlamp. I have to admit, I only watched it for 2 reasons: VERA-ELLEN'S LEGS. But it's really so much more. The plot is actually quite clever and creatively woven. It's almost like a Shakespearean comedy with all of its delightful misunderstandings. And of course there's also... VERA-ELLEN'S LEGS. The only unfortunate aspect of this film is that the version I purchased (the \"100 Family Classics\" collection by Mill Creek Entertainment) doesn't have the best video quality, and I've heard the same about the Alpha release. The brightness and contrast are a bit too high, so a lot of the scenes seem bleached out especially when Vera is dancing in a white dress. But I suppose you can fiddle with the controls of your TV set to compensate. I can only imagine how it looked on the big screen back in '51. The stage sets, costumes & colours are otherwise dazzling & delightfully creepy--sort of in a \"Cabinet of Dr. Caligari\" vein. As far as the romance goes, this is just perfect. Not sappy, not contrived, not melodramatic. Just 100% ahhhhhh. Too bad, you poor schmucks, your miserable lives will never be as charming as this. Har har har. Wait, what am I laughing at? My life sucks just as bad as yours. Oh hell. Time to watch this movie again.",
         "David Niven et al are charming in this tale involving the confused identity of Niven's character. The love story and humor were more interesting to me than the musical aspects which seemed rather weak except for Vera-Ellen's dancing talent. Depending on your interest, you can fast-forward these scenes. The confused identity situations seemed more natural and less contrived than most movies and certainly were better than today's TV situation comedies. David Niven is especially good at being David Niven! Ceasar Romero does well, if a little extreme, in his role.",
         "I find this movie very enjoyable. The plot is simple and easily digestible, the humour is light and clean, and because the storyline involving mistaken identity is quite common, I find myself looking forward to how this movie flesh this story out. Turns out to be very nice. The performance of the female lead is admirable; her portrayal of an innocent, naive girl trying to fabricate some white lies to David's sophisticated role was very charming. I also find Vera's dancing very, very well done. I find myself drawn to her toes as she pranced about the stage effortlessly and flawlessly. For those who have had enough of profanity-filled movies of today, you will enjoy this movie thoroughly.",
         "A few years ago, I bought several $1 DVD's that contained two movies each. One of them had Three Broadway Girls (an alternate title for The Greeks Had a Word for Them) and this one, Happy Go Lovely. It's basically a backstage musical comedy that takes place in Scotland and concerns mistaken identity involving one of the dancers hitching a ride from a millionaire's limousine. Vera-Ellen is that dancer and-wow, what legs! Ceasar Romero is her producer who takes a chance on her after the original leading lady leaves because he thinks she's dating the millionaire whose car I just mentioned. And David Niven is that rich guy who, when looking for Vera-Ellen, is mistaken for a reporter who's supposed to interview her but gets stalled by Romero. What I've just mentioned may be confusing but (mostly) makes sense if you're willing to check your brain while watching this charmingly screwball comedy with wonderful musical numbers as performed by the exquisite Ms. Vera-Ellen. Romero can be a bit frantic here but Niven becomes hilariously bemused throughout. The print I saw was actually pretty good considering its age and the fact that it's in public domain. And Vera-Ellen does pretty well with her lines since she's not really an actress. So on that note, I highly recommend Happy Go Lovely for movie buffs who love old-fashioned musical comedies.",
         "I don't think any player in Hollywood history lasted as long as David Niven did given most of the weak films he had to carry by dint of his incredible charm. He could act, got an Oscar for it, but most of the material he did was as light as one ply of two ply tissue paper. Happy Go Lovely is a case in point. It's a musical and for the most part you'll remember Vera-Ellen's dancing. You'll remember that they are in Scot's costume as the film is set in Edinburgh during their festival. But if you can recall a single song from it you must have a photographic memory. The plot is light. Vera-Ellen is the American lead in a musical that apparently is getting its out of town tryout in Edinburgh. She starts in the chorus and runs late one day. She gets a lift from the chauffeur of a millionaire greeting card king. Everybody now assumes she's the main squeeze of the millionaire. Doors open up as they've never opened before. The millionaire is David Niven and he goes along with it and the various situations that are engendered by the mistake. Cesar Romero has some good moments here as the frantic producer of this musical. In the end though Happy Go Lovely is light and harmless fluff which David Niven did so much of and got so tired of.",
         "Charming, little British musical much superior to those glossy MGM musicals of the same period. Although David Niven is top billed, this is Vera-Ellens film all the way. She is dazzling in several dance numbers that range from ballet, tap & modern dance - a very versatile dancer!! DVD quality is good - crystal print, lush & brilliant color, and nice sets - check out that gorgeous stain glass door!! Sound is a bit scratchy. This is my favorite Vera Ellen film - she was never lovelier.",
         "As a lightweight British post-war comedy, it's fine. David Niven's really charming, Vera-Ellen's trying like crazy. As a musical, it's very odd. There's nearly no 'musical' in it, and when you finally get to the two on-stage numbers near the end, you'll be glad. There's one long imitation Gene Kelly odyssey piece about a little girl in a big city that's strangely small and mean and bad. It looks like it should at the start, but I'd swear there wasn't any choreography design per se, just the general idea of a Kelly avant-garde set. Large scope, small stage, and the routines are so disjointed, you'll wonder how dancers learned the sequences. But as a comedy, it's quite adequate. Vera-Ellen mostly shines as she usually does though it looks like a bit of a struggle to hold onto the lead position. Fortunately for her, pretty soon she'll get a boost from David Niven. He's really the reason you'd want to see this movie, he just couldn't be more forthright, very plainly happy to be there. Caesar Romero's miscast but he's also obviously happy to be working. Both those big presences, Niven's nuanced, Romero's steamrolling, make this a piece of film worth keeping. And of course, as always, the number one attraction is how Vera-Ellen wore the clothes!",
         "While this takes place at the Edinburgh Festival which started in 1947, I think it is a production suitable for the Fringe, which was originally a group of eight theater companies rejected by the Festival who set up around the edges. The movie makes it clear this is NOT the highbrow entertainment the Festival had in mind! It's one step above Springtime for Hitler but that's about the best that could be said for it UNTIL the lead quits just short of starvation and Vera-Ellen is put in because of her supposed connections to wealth. Cesar Romero's character reminded me very strongly of the character Walter Abel played in Holiday Inn, the hyperactive promoter. So how is this different from other movies of its kind? It has Scottish actors playing locals not whimsical characters (the only kilt is on Romero) and a cast of Brits of various stripes. I don't know a lot about the British theater of the time but from the few I looked up I'd say they had an embarrassment of riches in the cast and a British audience back then would have seen something different from what I saw. It has Vera-Ellen dancing her pretty little toes off. It has suave and smiling David Niven which isn't exactly common for a musical. And it has some acting that is genuine. The leads don't behave in the usual feather-headed way that we are used to in these mixed identity plots. The fellow is enjoying the situation and not a bit upset at the deception. There's no declaration of, \"You are the only one who is totally honest with me,\" and then the tiresome, \"How can I ever trust you again?\" The gal confesses to him before it is absolutely necessary and she isn't angry with him when she finds out who he is. In short, they act pretty much the same way normal folks might act in a similarly bizarre situation and I found that refreshing. I looked up how much that check would be in today's money and it was BIG. Vera-Ellen was so talented, her dancing seemingly so effortless. And that rich deep voice, such a contrast to what one might expect from someone her size--definitely different from her delightfully offbeat roommate's voice. I would have liked more Edinburgh shots but this was a nation still struggling up out of the pit, still rationing some items, still dealing with destruction. So you get what you get and in that it's more Holyrood than Hollywood. If you want more of Scotland of the period, albeit rural Scotland, I'd suggest I Know Where I'm Going, from 1945. And for a movie showing some good outdoor scenes in England I'd suggest Passport to Pimlico, 1949, or The Titfield Thunderbolt, 1953.",
         "Any movie that gives me a chance to watch VERA-ELLEN dance is worth giving it a view, in my opinion--so I watched this little musical comedy pairing her with charming David NIVEN. It's the old mistaken identity theme played to the hilt by a cast that includes CESAR ROMERO as a harried musical producer with financial woes. Unfortunately, a clumsily staged opening Scottish number gets the musical off to a bad start with a distinct lack of charm and bad staging. The backers don't seem too enthusiastic about giving Romero a chance to go on with his show--and it's understandable. \"Half of you dance as if you're flat footed,\" he tells the dancers. When his star walks out, he has no other choice but to turn to VERA-ELLEN...get the picture? Especially after rumors link her with a millionaire in Scotland (David NIVEN) who might provide the right financial backing for Romero's show. The story is obviously a showcase for VERA-ELLEN and on that level it's a bit of a disappointment. She's pert, pretty and knows how to dance. But poor David NIVEN, as the millionaire, has to wait a good half-hour before he even makes an appearance. He ambles through his role with professional ease, but it's a trifle and he knows it. Unfortunately, the concentration on a backstage plot doesn't pay off. It's tiresome stuff and the musical numbers are banal, none of the songs making a lasting impression. Given that it's played as a musical comedy, perhaps that's why the color is a little more garish than usual for a British film. Summing up: At your own risk. Not a bit of inspiration in any of Vera-Ellen's musical numbers.",
         "endearing tale........ voted ten against all averages for my age and sex... not all that much comedy (compared to a i almost wet myself movie) although funny enough. not a fan of musicals at all so probably a little too much for me, but they do give you time to grab a drink or soda without missing anything important. maybe a fifties version of when harry met sally? Ahab no not really but if that is in your top ten like it is mine you will like this movie. really it just leaves you with a warm fuzzy feeling, reminding you of what romance could and should be like, something to shoot for. my summary describes it best in very few words..... quite charming"
      ],
      "genres": [
         "Comedy",
         "Musical",
         "Romance"
      ],
      "productionCompanies": ["Marcel Hellman Productions"],
      "summaries": ["B.G. Bruno, a rich bachelor, the head of a successful greeting-card company in Scotland, is essentially a kind man but respectable to the point of stodginess and extreme stuffiness. An American troupe visiting Edinburgh wants to produce a musical in town but has trouble getting backers. Bruno meets several of the leading ladies of the show; through a misunderstanding he doesn't correct they think that he's a newspaper reporter. He falls in love with one of the women, who reciprocates; he grows more lively and friendly, to the surprise of his employees. After a series of mishaps and comic incidents comes a happy ending: a successful show and true love."],
      "budget": 0
   },
   "movielensId": 3315,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1951-03-06",
      "dvdReleaseDate": "2000-02-05",
      "directors": ["H. Bruce Humberstone"],
      "runtime": 97,
      "movieId": 3315,
      "title": "Happy Go Lovely",
      "mpaa": null,
      "actors": [
         "David Niven",
         "Vera-Ellen",
         "Cesar Romero",
         "Gordon Jackson",
         "Bobby Howes",
         "Diane Hart",
         "Barbara Couper",
         "Henry Hewitt",
         "Gladys Henson"
      ],
      "imdbMovieId": "0043618",
      "originalTitle": "Happy Go Lovely",
      "genres": [
         "Music",
         "Romance",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "B.G. Bruno, a rich bachelor, the head of a successful greeting-card company in Scotland, is essentially a kind man but respectable to the point of stodginess and extreme stuffiness. An American troupe visiting Edinburgh wants to produce a musical in town but has trouble getting backers. Bruno meets several of the leading ladies of the show; through a misunderstanding he doesn't correct they think that he's a newspaper reporter. He falls in love with one of the women, who reciprocates; he grows more lively and friendly, to the surprise of his employees. After a series of mishaps and comic incidents comes a happy ending: a successful show and true love.",
      "tmdbMovieId": 127602,
      "avgRating": 2.825,
      "releaseYear": "1951",
      "numRatings": 20,
      "posterPath": "/y6IvKB3BrpPL4V0IlZ8zEmVQTfG.jpg"
   }
}