{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "alien life-form",
            "id": 4862
         },
         {
            "name": "village",
            "id": 5331
         },
         {
            "name": "bewusstlosigkeit",
            "id": 9535
         },
         {
            "name": "alien",
            "id": 9951
         },
         {
            "name": "pregnancy",
            "id": 13149
         },
         {
            "name": "doppelgänger",
            "id": 161891
         }
      ],
      "imdb_id": "tt0114852",
      "video": false,
      "title": "Village of the Damned",
      "recommendations": [
         9945,
         8852,
         8973,
         4961,
         10016,
         790,
         10012,
         11503,
         13122,
         11133,
         12700,
         10906,
         10727,
         10306,
         9599,
         4722,
         9538,
         10657,
         11954,
         9306
      ],
      "backdrop_path": "/5OcRgYf28xjZhnSt9rIOJE490L8.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 13,
               "character": "Dr. Alan Chaffee",
               "gender": 2,
               "credit_id": "52fe44ba9251416c7503ed99",
               "name": "Christopher Reeve",
               "profile_path": "/9D4L3XeklsMc4r8FybZSTKON3HR.jpg",
               "id": 20006,
               "order": 0
            },
            {
               "cast_id": 14,
               "character": "Dr. Susan Verner",
               "gender": 1,
               "credit_id": "52fe44ba9251416c7503ed9d",
               "name": "Kirstie Alley",
               "profile_path": "/fQ1EOV3dazf05uhrEVqMN2S3T0U.jpg",
               "id": 1796,
               "order": 1
            },
            {
               "cast_id": 15,
               "character": "Jill McGowan",
               "gender": 1,
               "credit_id": "52fe44ba9251416c7503eda1",
               "name": "Linda Kozlowski",
               "profile_path": "/9qgl8JSTVOLtVVPshXclSGxiP57.jpg",
               "id": 57166,
               "order": 2
            },
            {
               "cast_id": 16,
               "character": "Frank McGowan",
               "gender": 2,
               "credit_id": "52fe44ba9251416c7503eda5",
               "name": "Michael Paré",
               "profile_path": "/g1cVLWWAgl3J1nNFhg67qXs8GUT.jpg",
               "id": 60650,
               "order": 3
            },
            {
               "cast_id": 17,
               "character": "Melanie Roberts",
               "gender": 1,
               "credit_id": "52fe44ba9251416c7503eda9",
               "name": "Meredith Salenger",
               "profile_path": "/5KPSGIuTE9lVLsL8rMoxnkn28Fa.jpg",
               "id": 18706,
               "order": 4
            },
            {
               "cast_id": 18,
               "character": "Reverend George",
               "gender": 2,
               "credit_id": "52fe44ba9251416c7503edad",
               "name": "Mark Hamill",
               "profile_path": "/fk8OfdReNltKZqOk2TZgkofCUFq.jpg",
               "id": 2,
               "order": 5
            },
            {
               "cast_id": 19,
               "character": "Sarah, George's Wife",
               "gender": 1,
               "credit_id": "52fe44ba9251416c7503edb1",
               "name": "Pippa Pearthree",
               "profile_path": "/AikMwGDCqZ9ERlaueqo2IDST0N6.jpg",
               "id": 169077,
               "order": 6
            },
            {
               "cast_id": 20,
               "character": "Ben Blum",
               "gender": 2,
               "credit_id": "52fe44ba9251416c7503edb5",
               "name": "Peter Jason",
               "profile_path": "/2VqCiv4R0kZW1Nwi60fIzmHKxpc.jpg",
               "id": 6916,
               "order": 7
            },
            {
               "cast_id": 21,
               "character": "Callie Blum",
               "gender": 1,
               "credit_id": "52fe44ba9251416c7503edb9",
               "name": "Constance Forslund",
               "profile_path": "/tfs7wBaGdiXU2H6m5SLCt3b1hTa.jpg",
               "id": 61149,
               "order": 8
            },
            {
               "cast_id": 22,
               "character": "Barbara Chaffee",
               "gender": 0,
               "credit_id": "52fe44ba9251416c7503edbd",
               "name": "Karen Kahn",
               "profile_path": "/zRoRDrF2xcl9E4of1hkvhbFjM9w.jpg",
               "id": 1006368,
               "order": 9
            },
            {
               "cast_id": 23,
               "character": "David McGowan",
               "gender": 2,
               "credit_id": "52fe44ba9251416c7503edc1",
               "name": "Thomas Dekker",
               "profile_path": "/1wDz8UVkG7rx6t96QKuMrKCo9wj.jpg",
               "id": 34199,
               "order": 10
            },
            {
               "cast_id": 24,
               "character": "Mara Chaffee",
               "gender": 1,
               "credit_id": "52fe44ba9251416c7503edc5",
               "name": "Lindsey Haun",
               "profile_path": "/n4jB2xNUoqY2e18vSG6iCjwSq8i.jpg",
               "id": 78229,
               "order": 11
            },
            {
               "cast_id": 25,
               "character": "Robert",
               "gender": 0,
               "credit_id": "52fe44ba9251416c7503edc9",
               "name": "Cody Dorkin",
               "profile_path": "/pFmPDFwi1oPqvqZtiejlxTV86tn.jpg",
               "id": 186614,
               "order": 12
            },
            {
               "cast_id": 26,
               "character": "Carlton",
               "gender": 2,
               "credit_id": "58601ef092514115cf021c46",
               "name": "George Buck Flower",
               "profile_path": "/xHzW4GszCLTZLNxvTcKL9ICuLIc.jpg",
               "id": 54564,
               "order": 13
            },
            {
               "cast_id": 29,
               "character": "Village",
               "gender": 0,
               "credit_id": "5a9d739dc3a3680b9905248a",
               "name": "Ralph Miller",
               "profile_path": null,
               "id": 1991113,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44ba9251416c7503ed53",
               "name": "John Carpenter",
               "profile_path": "/jGprVNNSmlJzLNhm2tcdmjquLyL.jpg",
               "id": 11770,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ba9251416c7503ed59",
               "name": "David Himmelstein",
               "profile_path": null,
               "id": 71342,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ba9251416c7503ed5f",
               "name": "John Wyndham",
               "profile_path": null,
               "id": 70449,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ba9251416c7503ed65",
               "name": "Andre Blay",
               "profile_path": null,
               "id": 56125,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ba9251416c7503ed6b",
               "name": "Shep Gordon",
               "profile_path": "/lfu8envtdX1fBhcIcPk4Hn41Fns.jpg",
               "id": 56126,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe44ba9251416c7503ed71",
               "name": "Sandy King",
               "profile_path": null,
               "id": 27581,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ba9251416c7503ed77",
               "name": "Michael Preger",
               "profile_path": null,
               "id": 71343,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ba9251416c7503ed7d",
               "name": "Ted Vernon",
               "profile_path": null,
               "id": 71344,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ba9251416c7503ed83",
               "name": "Gary B. Kibbe",
               "profile_path": null,
               "id": 24956,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ba9251416c7503ed89",
               "name": "Edward A. Warschilka",
               "profile_path": null,
               "id": 27583,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5910fb41c3a368650a036ed2",
               "name": "Dave Davies",
               "profile_path": null,
               "id": 71345,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5910fb4e9251414e89039de7",
               "name": "John Carpenter",
               "profile_path": "/jGprVNNSmlJzLNhm2tcdmjquLyL.jpg",
               "id": 11770,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 6.554413,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 12122,
      "vote_count": 212,
      "budget": 0,
      "overview": "An American village is visited by some unknown life form which leaves the women of the village pregnant. Nine months later, the babies are born, and they all look normal, but it doesn't take the \"parents\" long to realize that the kids are not human or humane.",
      "similar": [
         20424,
         16866,
         840,
         602,
         644,
         601,
         10200,
         49849,
         126889,
         228161,
         4858,
         10122,
         34851,
         8836,
         607,
         608,
         2675,
         1091,
         679,
         2756
      ],
      "original_title": "Village of the Damned",
      "runtime": 99,
      "poster_path": "/iwmI6kZWPJ9TYC4PJ0fi80TNFx5.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
         "name": "Universal Pictures",
         "id": 33,
         "origin_country": "US"
      }],
      "release_date": "1995-04-28",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "Beware the Children",
      "adult": false,
      "homepage": "http://www.theofficialjohncarpenter.com/village-of-the-damned/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["John Carpenter"],
      "runtime": 99,
      "synopsis": "The quiet coastal town of Midwich, California is invaded by an unseen force which leaves ten women mysteriously pregnant. Nine months later, the babies are born simultaneously on one night, except for one which is stillborn. At first, they all appear to be normal, but it does not take the parents long to realize that their children are anything but normal. As they grow older, the children are shown to have pale skin, platinum-white hair, fierce intellect and steely, cobalt eyes. The emotionless children display eerie psychic abilities and remarkable powers, which they use with deadly consequences, unleashing a reign of terror. When they actively use their mind-controlled powers, their irises or their entire eyes glow in different colours, mostly reddish-orange, but also green, yellow, violet, blue or pure white. There are some story differences from the earlier adaptation. In this version, the children \"paired off\", but one of the children, David ( Thomas Dekker), loses his partner after she dies at birth. As a result, he shows human compassion while still resembling the other children and retaining some degree of psychic powers. This leads to him not fitting in well with the children. Their ruthless leader, Mara ( Lindsey Haun) (\"daughter\" of a local doctor, Dr. Alan Chaffee ( Christopher Reeve); her mother, Barbara ( Karen Kahn), commits suicide by walking off an ocean cliff), considers him less important due to his expression of emotions. Because of his childhood loss, he understands what the other children do not: pain. He and his mother ( Linda Kozlowski) (the local school principal) share a brief conversation about the meaning of the word \"empathy\", with David beginning to understand that if he feels pain, he can understand others' pain as well. When the other children experience pain, they simply use their powers to inflict the same pain on the adult responsible for the pain, for example forcing one of the mothers to put one of her arms in a pot full of boiling water, or forcing the local optometrist making herself blind with a painful liquid. Soon, the other colonies of psychic children in foreign countries are eliminated because of their danger. The scientific team at Midwich quickly flees the town to escape the chaos. However, the lead government scientist, Dr. Susan Verner ( Kirstie Alley), is killed by the children after being forced to show them David's partner, the baby that was stillborn. Susan has secretly kept it so that she could perform an autopsy on it and study it. A mob of angry townspeople attempt to stop the children, but the latter use their powers to kill the leader of the mob causing the other townspeople to flee quickly. The State Police and the National Guards are then sent out to kill the children, who instead hypnotize them into shooting each other in a chaotic gun battle. In order to rid the town of the children, Alan devises a plan; to detonate a briefcase of explosives inside the children's classroom. By thinking of a brick wall, he is able to create a mental barrier and keep the presence of the bomb a secret from the children. Jill begs him to save David (because he is not like the others), and Alan agrees. He attempts to do this by asking David to leave the classroom to get his books from his car. Finally, Jill shows up, but the children stop her. David, angered by this, rushes to her defense and knocks Mara over. The children turn on David, but Jill rushes him from the building. At last, the children break through Alan's defenses, but the explosives detonate, destroying the barn and killing everyone, including Alan. Jill and David survive the massacre; she says that they would both move to a place where nobody knows them. The last scene is of David, riding in his mother's car, looking off into the distance.",
      "writers": [
         "John Wyndham",
         "Stirling Silliphant"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0114852/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY4ODY4NDczNV5BMl5BanBnXkFtZTcwNDY1NzMyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Christopher Reeve, Kirstie Alley, Linda Kozlowski | See full cast and crew »"],
      "reviews": [
         "John Carpenter's remake of the 1960 original has little to add but it's more violent and explicit. The plot is the same; 10 women get pregnant simultaneously during a group pass out. Several years go by and the children all look similar and stick together. They appear to be anything but normal and once they start killing the residents of the small village it's clear they have to be stopped. Carpenter is really a master of suspense and some scenes work remarkably well, however this is not one of his best films. Not much happens here and the film drags a bit, plus the inclusion of a government intervention and a possible world wide epidemic of these children does little to further the film. Still, Carpenter manages to create a decent amount of suspense and uneasiness by playing on the film's simple premise; that little children are the evildoers here. The soulless stares and glowing eyes are enough to creep you out. The social statement about people (and children) becoming indifferent to violence is a valid input, since the film couldn't really go for the same underlying meaning as the original, which was made during the cold war; the children personifying the threat from the east penetrating the west. An average John Carpenter film is still a lot more interesting than most other horror films out there. Village of the Damned is not one of his best but it's a good film nonetheless.",
         "In the quiet small town in Southern California. Something terribly goes wrong in the small village of Midwich. After an unseen force invades a quiet coastal town. Ten woman mysteriously find themselves pregnant. Local Doctor (Christopher Reeve) and an mysterious government scientist Dr. Susan Verner (Kristie Alley) decide to help each other. When the woman simultaneously give birth... and the reign of terror begins. This is a remake of the 1960 Classic film. The new version is directed by John Carpenter (Escape From New York, Escape From L.A.). Carpenter gives this version with much more explicit violence. Although the original was much more eerie but Carpenter manages to top several key scenes from the original. One of the Highlights of this remake is the Strong Performances by Reeve, Alley, Linda Kozlowski, Mark Hamill (as a Priest!), Thomas Deeker as David and Lindsey Haun \"The Leader of the Emotionless Children\". The Remake does look better in Color than the 1960 Black & White original. This new version was a Box Office disappointment. The film plays better on Video than it did in Theaters but it is a must see in Widescreen, especially Gary B. Kibbe's terrific cinematography. Carpenter cut several scenes before the film's release. Scenes like 9 infants getting up together in the same time (Which is a Babies Puppet F/X from K.N.B EFX Group), 8 Children Attacked and Probably Killing Three Other Children. There is good visual effects by Industrial, Light and Magic. Carpenter Co-Composed the film's music. DVD has an sharp anamorphic Widescreen (2.35:1) transfer and an terrific-Dolby Digital 5.1 Surround Sound. DVD Features are the Original Theatrical Trailer, Bonus Trailer from Other Films and Production Notes. It would have better if the DVD has an audio commentary by Carpenter and Deleted Scenes. We might have these features on a Future DVD but highly doubtful from this Underrated film. One of the few underrated film by John Carpenter. Panavision. (****/*****).",
         "John Carpenter, a respected director among the horror genre enthusiasts, gives us a remake of the classic 60's sci-fi /horror movie. Many people consider it the weakest Carpenter movie, but now, almost 10 years later, it's easy to notice why this movie was considered a failure in it's time, and certainly it's easier to appreciate it for what it is: an old school horror movie. A year before Scream gave new life to the genre, this movie told the story of a small village lost in the rural areas of the U.S. where something strange happened one afternoon when the entire town fell unconscious. By strange circumstances 10 women got pregnant that day, but only 9 children survived. The remaining children look all the same and behave in strange ways, creating horror in town. All this while a government team studies them. Christopher Reeve stars as the father of the leader of the children, Mara. Co-star Kirstie Alley as the government scientific in charge of the study. To be fair, the acting of the children was superb, while the acting of the adult characters was somewhat weak. Reeve steals the show, and Alley just seems out of place. As I wrote before, the whole movie has that early 80's feeling, and I would dare to say that it feels as something made for TV. Not necessarily a bad thing, but it's probably the main reason this movie is not very popular. This old school style maybe was not very attractive for 95's audience, Carpenter would go in a better direction once reunited with Kurt Russell in 96's Escape From L.A. I have not seen the original movie yet, so I came to it without any expectation, I can't say I ended pleased, but I found it entertaining, although quite slow at times. It's worth to notice that it has beautiful cinematography, and even when it may be a flawed effort, it's worth a rent. It's one of those movies that takes it's time to grow on you. 7/10",
         "If you haven't seen the original 1960 film, or read Whyndham's 'The Midwhich Cuckoos', then you might possibly like Carpenter's remake. It has degrees of suspense, and passable acting (perhaps most surprisingly by Christopher Reeve in his last performance prior to his paralysis), but these qualities are inconsistent throughout the film and it frequently falls flat. If you've seen the original film then avoid this one, especially if you have read Whyndam's novel too, you will only come away from the experience with a sense of disappointment and feel cheated of the time you invested in watching it. This film lacks many things that the original had - great and consistent acting, tension, and suspense to name but three. There seems to have been a conscious effort to add gore and violence, and that decision is perhaps the main reason this film fails so miserably compared to the original. The gratuitously graphic nature of the violence directly detracts from the suspense and tension so evident in the original. Whereas in another carpenter remake 'The Thing' the effects and violence enhanced the sense of dread, here they are responsible for destroying it. There are other reasons that this film is quite dire, one of them being the narrative compromises made to attempt a recreation of the visual style of the original film e.g. the children all wear matching clothes which, in the original, was logical since in England children do indeed wear school uniforms. However Carpenter's US town sees the children uniformly garbed with no reason, other than to draw attention to their uniformity in a massively clumsy and illogical visual device. Take my advice, watch the original and avoid this. It's one strictly for carpenter fanatics, not people who are simply fans of his work.",
         "I have always been a fan of John Carpenters brand of cheap but original horror films but this one was the exception to the rule. It should have been good, I like Carpenter and I like John Wyndhams books. \"The Midwich Cuckoos\" was arguably one of the Sci-Fi writers best novels. It was certainly more thought provoking than his better remembered \"Day of the Triffids\". The book was filmed as \"Village of the Damned\" in the early 1960s and within the limitations of its low budget it was pretty faithful to the original novel. This version however seems to have thrown both the novel and the 1960s movie out of the window and opted for a virtual re-write which adds nothing to the story and instead loses most of the subtlety of the book. The narrative flow of the book and earlier film are replaced by a disjointed mess of unrelated scenes. The acting was wooden, the script inconsequential and the direction? Did Mr Carpenter even read the book? What was the point in \"saving\" David, unless it was for a, thankfully, unmade follow up? Virtually every other Carpenter film has simple yet memorable music that matches the mood of the movie perfectly but not this one. I've just watched the film and yet I couldn't hum a note of the theme, if it had one. Oh, I could hum music from \"The Fog\", \"Halloween\" or \"Escape From New York\" etc, etc but they were memorable movies with memorable music this, by contrast, was better forgotten.",
         "My mother turned on Village of the Damned one evening because Christopher Reeve was in it. I knew absolutely nothing about it beyond the fact that there was a movie by that title. After ten minutes I was completely hooked. After it was over I thought about it and realized there were some flaws, but still, while it lasted I was fascinated. I recommend it.",
         "John Carpenter 1995 remake of the classic Village of the Damned is also a classic. whatever what people may have say, this movie is awesome. the late great Christopher Reeve acting are amazing. its just sad to know that its is last movie before his horrible horse accident. but Reeve is not the best actor in the movie. i would give that title to Lindsey Haun. Lindsey acting as Mara, the leading child is simply amazing. this version is, in my opinion, way better than the original 1960 movie. a lot of people wont agree here thought...i totally recommend that movie, since its my 3rd all time favorite (first being 1982 Poltergeist and second, 1986 Aliens). i give Village of the Damned, a 10/10",
         "Critics didn't seem to like Village of the Damned(1995) but when I asked everybody I know, they all liked it. Gee, I wonder why. Village of the Damned is about 9 platinum-white haired children who can control bodies and read minds. Their quest for survival leads to horror and destruction. There are really good acting performances by Christopher Reeve, Kristi Ally, and Mark Hamil. The two best ones were Lindsey Haun as Mara and Thomas Dekker as David, two of the main children. Lindsey Haun is stunning in this movie. I don't know if any other child could've pulled off a role like that. She was emotionless, cold and commanding, yet still beautiful and stylish. She's now 17, and still just as awesome. Thomas Dekker did good in the middle of emotionless and empathetic . Village of the Damned is not like a slasher movie with tons of blood. It cuts down yet still looks real. It sends chills down your spine when you watch it, and the glowing eyes are cool. And like my friend said, \"Even if the entire movie completely sucked, Lindsey Haun would still manage to keep the entire movie awesome.",
         "There are very few horrors in Hollywood that are truly scary from an adults point of view like this one. it looks almost like it was done by an European contemplating the violence in contemporary America but in fact, it's surprising that was John Carpenter himself who's very well aware of that marginal point of America (frivolity of violence) that is so deeply implied in this movie. So this brainy stuff in horror is one of the aspects why this film didn't make good in box-office. Beginning: i love the way how we are introduced to our essential characters then the family and full of harmony feeling that follows as if we're treated to something romantic, and in one moment everything is destroyed. The black-out scene is so chillingly frightening in a very serious tone achieved especially due to that sweet beginning. What follows is what you actually get and that's a very tragical feeling that something bad is gonna happen which is masterfully directed almost in a non-speakable way. That feel of dread flows through the \"childbirth scene\" that features little flashes of happiness for their characters (for a short time). One of the most beautiful scenes is the \"baptizing of that baby\" showing us our human side in contrast to that inhuman-or should i say extraterrestrial. OK first death scene: brilliant, brilliant, brilliant. From the \"boiling-water scene\" to jumping off a cliff it's almost without words which makes it all the more powerful conclusion. Here i must say i'm a big Carpenter fan and i've seen all his movies but this scene (along with that one at a cemetery w/ Alan Chaffee & David) is one of his most spectacular i have ever seen and only proves that Carpenter is indisputably far better filmmaker than before. After the interrogation with K.Alley we are treated to a beautiful film-montage of the village shifting to a truly majestic scene of the marching children which accompanying an enchanting music with an appropriate sound nuances directly for the children&#8216;s theme. Second death scene was done in a very old-fashioned style (which is more or less beautiful and disturbing than just frightening), that is important for us just to get to a point when they represent a real threat with complete lacking of any empathy and compassion for others which leads me to mention a cute scene with David learning something about humanity: in that scene you can take David as some kind of a symbol of hope that there still can be a little of humanity or take Linda Kozlowski character as a symbol of a parent that's actually responsible for that humanity to the future, anyway beautiful scene. Interesting moment is the suicide of Salenger's Melanie Roberts character &#8211; was she compelled by some outer force (extraterrestrial) or was it her own decision (which doesn&#8216;t make much sense). There's truly magnificent scene with David and Reeve's character at a cemetery concerning human emotions - i almost thought that i was watching some Jean Cocteau film, and those who say that Garry Kibbe is a low-class cinematographer should see at least this scene, definitely this film is one of his best collaborations with Carpenter. There are many really old-fashioned scenes that were fancy maybe in 50's or 60's but in a way they're still very elegant and impressive, mainly because Carpenter took from those days only what is at its core virtually timeless, so i don't think there's a way that Village Of The Damned could seem to be dated, on the contrary there's a chance that this will probably find its audience in the future! And by the way for a Carpenter film you gotta have an acquired special taste. What i also admire is that carnage scene at the end of the movie which is a really classic Carpenter scene affluent of the rhythm and style similar to 'Assault On Precinct 13'. Anyway going through with this remake is an experience of a life time that the 1960 version by far ain't equal to. I have seen Carpenter's VOTD 8 years ago and still i can't put those images from this film out of my mind, i was really convinced that i was in that village and believed those events were happening, that's something i can't say about a lot of pretentious movies in Hollywood today. I think Carpenter really outdid himself with this very powerful film that not only beats its inferior original but even in its way Carpenter's early stuff like 'Halloween', 'The Thing' or 'Prince Of Darkness'. You know, it's very easy to prefer a film that is shocking and very serious like 'The Thing', but Village Of The Damned is pretty much opulent in his portrayal of violence in a more brooding sense, it's not so much a horror within itself(The Thing) as it is rather a low viewpoint of the true horror outside and about the way how to deal/struggle with that. So from this perspective it very easily transcends something like 'The Thing' but in fact they're both great, even though 'Village Of The Damned' doesn't try to be that extremely documentary-like serious and 'The Thing' doesn't succeed in that intelligent satiric portrayal of violence and old fashioned artistic film beauty. i can't help but this film is simply a true masterpiece that is criminally under-appreciated.",
         "The movie is pretty well pasted with a clever script and some creepy scenes. We also get some good acting from the adult actors and one of the child actors (David), but when we consider the other children, they seem to be creepier when they're 3-years old. When the movie brings you to the part where they're somewhere around 8 or 9 years old, the movie starts to loose the creepy elements. Basically because the children's acting starts to loose its balance as they tend to act mature. I think those children are creepier when they're unable to speak than they are when they try to talk in the manner of adults (eg. the scene where they all lined up infront of the campus, they were muted and still, and that had a creepy effect along with the score!!!). But besides that, the movie does have powerful special effects and some really neat scenes. The movie did a great job on the visuals and the scores! 9.5/10 -0.5 for loosing the creepy effect, but later as the movie reaches its climax where we get the children lining up in front of the cops, from then, the acting didn't seem so weird anymore and they're \"mature\" way of talking didn't seem to mess up the eeriness."
      ],
      "genres": [
         "Horror",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": [
         "Universal Pictures",
         "Alphaville Films"
      ],
      "summaries": [
         "An American village is visited by some unknown life form which leaves the women of the village pregnant. Nine months later, the babies are born, and they all look normal, but it doesn't take the \"parents\" long to realize that the kids are not human or humane.",
         "A small town's women give birth to unfriendly alien children posing as humans."
      ],
      "budget": 22000000
   },
   "movielensId": 332,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-04-28",
      "dvdReleaseDate": "1998-12-15",
      "directors": ["John Carpenter"],
      "runtime": 99,
      "movieId": 332,
      "title": "Village of the Damned",
      "mpaa": "R",
      "actors": [
         "Christopher Reeve",
         "Kirstie Alley",
         "Linda Kozlowski",
         "Michael Paré",
         "Meredith Salenger",
         "Mark Hamill",
         "Pippa Pearthree",
         "Peter Jason",
         "Constance Forslund",
         "Karen Kahn",
         "Thomas Dekker",
         "Lindsey Haun",
         "Cody Dorkin",
         "George Buck Flower"
      ],
      "imdbMovieId": "0114852",
      "originalTitle": "Village of the Damned",
      "genres": [
         "Thriller",
         "Horror",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [
         "0WzcW9haPto",
         "Y7tNVTmlkzg"
      ],
      "plotSummary": "An American village is visited by some unknown life form which leaves the women of the village pregnant. Nine months later, the babies are born, and they all look normal, but it doesn't take the \"parents\" long to realize that the kids are not human or humane.",
      "tmdbMovieId": 12122,
      "avgRating": 2.77584,
      "releaseYear": "1995",
      "numRatings": 2264,
      "posterPath": "/iwmI6kZWPJ9TYC4PJ0fi80TNFx5.jpg"
   }
}