{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0235872",
      "video": false,
      "title": "The Waiting Game",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 2,
            "character": "",
            "gender": 2,
            "credit_id": "52fe4d79c3a368484e1eb26d",
            "name": "Will Arnett",
            "profile_path": "/vHCqn3SHfSV6GOWrxzEtoDaSMoU.jpg",
            "id": 21200,
            "order": 0
         }],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe4d79c3a368484e1eb269",
            "name": "Ken Liotti",
            "profile_path": null,
            "id": 1193920,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.002618,
      "production_countries": [],
      "id": 210307,
      "vote_count": 0,
      "budget": 0,
      "overview": "A group of aspiring young actors wait tables at a New York City restaurant.",
      "similar": [],
      "original_title": "The Waiting Game",
      "runtime": 85,
      "poster_path": "/pBKoPQ3XzlUl7Qh1QHafbIhLPph.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1999-03-25",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ken Liotti"],
      "runtime": 85,
      "synopsis": null,
      "writers": [
         "Ken Liotti",
         "Ken Liotti"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0235872/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU5ODcwODU1NV5BMl5BanBnXkFtZTYwMzQyNzc5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Will Arnett, Debbon Ayer, Dwight Ewell | See full cast and crew »"],
      "reviews": [
         "You know what I would like to see? A movie about a carpenter. Not a Hollywood movie about a carpenter who's also a secret agent or possessed by the devil, Not an indy movie about a carpenter who was sexually molested by his sister and now compulsively makes birdhouses shaped like her vagina. No, I want to see a movie about a carpenter who just sits around with his boring fellow carpenters yakking about carpentry and how tough it is to make it in the carpentry business. That doesn't sound like such a great film, does it? So why do so many low budget filmmakers think that replacing the word \"carpenter\" with the word \"actor\" makes the story any more interesting or worthwhile? The Waiting Game is yet another piece of crap to throw on the ever growing pile of movies about the lives, loves and career futility experienced by those on the bottom rung of show business. The characters are dull. Their problems are duller. Most of the storytelling only works on the level of an inside joke. None of the performers can actually, you know, \"act\". The director apparently learned how to transition from one scene to another in a Bolivian prison camp. This thing was made by people who weren't succeeding in movies, about how they weren't succeeding in movies and proves why they weren't succeeding in movies. It's about a group of struggling actors who all work together at a New York City restaurant. They're supposed to be a collection of archetypes like the gay guy, the young model, the two old friends who finally realize they love each other, etc. Here's the thing, though. Only one of them does any actor-type stuff, so he winds up doing it all. He has the one act play that bombs, the audition where he vents his spleen at a couple of producers, the misery of waiting tables on annoying customers and the big break where he finally gets his shot at stardom. The other characters\u0085well, they don't do anything. One has a storyline where she dates a guy. That's it. She dates him and that's all. Another has a storyline about impotence and sexual confusion that HAS to be autobiographical, 'cause there's no other way it could have made it into the script. The rest sort of stand around and kill time until the closing credits. If The Waiting Game had come out in 1979 instead of 1999, it still wouldn't have had anything new, surprising or insightful to say about acting, life or the lives of actors. Making it all worse is how writer/director Ken Liotti couldn't recognize humor, chemistry or pathos if they bit him on the end of his penis. I don't know if there's a single line of dialog that's funny, at least not in the way it was intended to be. They said of Humphrey Bogart that he could have sexual chemistry with a desk. Well, Liotti casts Will Arnett and Terumi Matthews as the two old friends who finally fall in love and they have the sexual chemistry of two desks that have been eaten away by termites. Liotti also has absolutely no idea whether the need that Arnett's character has for acclaim is either endearing or pathetic. If you've been toiling away in the trenches of the entertainment industry and think your misadventures would make a good film, forget about it. It's been done umpteen times before and it almost universally turns out to be either self-indulgent tripe or outright garbage. There's nothing about being an actor that's inherently more compelling than being a carpenter, though at least carpenters don't make furniture that looks like themselves.",
         "Manhattan's restaurants are the mecca for a lot of aspiring actors, a route most young thespians follow before they are discovered, because these eateries provide them with an income to help them pursue their goals. The city could be cruel to those that are starting in a highly competitive environment of the performing arts. The disappointments of the actors are at the center of Ken Liotti's account about the lives of some of these people as they balance dreams with reality. Mr. Liotti gathered a nice cast of basically unknowns that make this film a bittersweet experience as one follows the different friends he presents to us. While the movie gives us an account of these people's lives, it keeps the viewer interested in this sunny indie film. Will Arnett, Debbon Ayer, Dwight Ewell, Eddie Malavarca, among the young cast, are actors that, hopefully, will make it big in their own mark in films. The film will delight viewers of indie films thanks to the inspired direction by Mr. Liotti and his sunny performers.",
         "Ever been to an independent film festival? Can be a real mixed bag - experimental stuff, the requisite foreign fare, a few obscure shorts with bizarre plots and bad lighting. But there are always a few good films too... and if you're really lucky, you'll catch a flick that simply blows you away. For me, \"The Waiting Game\". WOW. Not only is it a completely fresh take on what could have been food for cliche, it is bold, surprisingly funny, and thoroughly entertaining from start to finish. Strong performances from the ensemble cast effect a genuine chemistry, although it is perhaps ironic that the unfamiliar faces add to the film's appeal. Writer/director Ken Liotti deserves big \"attaboy\" for an engaging plot that refuses to settle for predictability but always delivers on cue. In short, \"The Waiting Game\" is a keeper. It is an outstanding accomplishment by any measure and it easily ranks as one of the best independent films I've ever seen.",
         "Andi (Terumi Matthews) and Lenny (Will Arnett) are best friends and thespians, who make ends meet by working in the same restaurant. Struggling actor, Dan (Daniel Riordan), is likewise employed at the establishment, as well as a bevy of others. Each hopes to make it big. Each spends his or her day with petulant customers, all the while searching for romantic fulfillment for themselves and their colleagues. Who will give up their pipe dreams and who will stay in the hunt for fame, prosperity, and love? This film is a showcase for the plentiful pleasures of ensemble work. While the cast boasts no stars, each thespian portrays the angst and the aspirations of career choices that are ruthless with aplomb. The New York setting is always appealing as well. Do you favor romantic stories that also deal with showbiz wannabees? You will do yourself a favor by giving this film a try."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Absolute Films Inc."],
      "summaries": [
         "This ensemble comedy love story chronicles the adventures and misadventures of a group of aspiring actors who wait tables at a popular New York City eatery called \"Peter's Backyard.\" Pitted against the New York culture jungle, the crew serves up a prix fixe of artistic trauma, comedic insanity, and thespian lust while struggling to keep their lives from coming unglued in the urban warfare of the survival of the artist.",
         "A group of aspiring young actors wait tables at a New York City restaurant."
      ],
      "budget": 0
   },
   "movielensId": 3321,
   "movielens": {
      "languages": [""],
      "releaseDate": "1999-03-25",
      "dvdReleaseDate": "2000-10-03",
      "directors": ["Ken Liotti"],
      "runtime": 85,
      "movieId": 3321,
      "title": "The Waiting Game",
      "mpaa": "R",
      "actors": ["Will Arnett"],
      "imdbMovieId": "0235872",
      "originalTitle": "The Waiting Game",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "A group of aspiring young actors wait tables at a New York City restaurant.",
      "tmdbMovieId": 210307,
      "avgRating": 2.90909,
      "releaseYear": "1999",
      "numRatings": 22,
      "posterPath": "/pBKoPQ3XzlUl7Qh1QHafbIhLPph.jpg"
   }
}