{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "suspicion",
            "id": 3301
         },
         {
            "name": "suspect",
            "id": 3879
         },
         {
            "name": "investigation",
            "id": 5340
         },
         {
            "name": "remake",
            "id": 9714
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "death",
            "id": 34079
         },
         {
            "name": "accident",
            "id": 207819
         },
         {
            "name": "dysfunctional",
            "id": 208344
         }
      ],
      "imdb_id": "tt0186045",
      "video": false,
      "title": "Drowning Mona",
      "recommendations": [
         21119,
         37722,
         33782,
         17140,
         150889,
         46126,
         72668,
         83674,
         192794,
         144236,
         84752,
         87224,
         84747,
         87237,
         84888,
         84749,
         87202,
         84755,
         68986,
         87218
      ],
      "backdrop_path": "/6CH06Pyvg9RGYlqGpKcPV4nYwPU.jpg",
      "revenue": 15427192,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Chief Wyatt Rash",
               "gender": 2,
               "credit_id": "52fe44bbc3a368484e033c91",
               "name": "Danny DeVito",
               "profile_path": "/zKuyzmKzPLG7RJo7lbbHjx6CCZc.jpg",
               "id": 518,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Mona Dearly",
               "gender": 1,
               "credit_id": "52fe44bbc3a368484e033c95",
               "name": "Bette Midler",
               "profile_path": "/ylGKhmHKUa1fBvvbA0kvdn3eFNn.jpg",
               "id": 73931,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Ellen Rash",
               "gender": 1,
               "credit_id": "52fe44bbc3a368484e033c99",
               "name": "Neve Campbell",
               "profile_path": "/171hRggAVnI2J1DKHGNOCiBgxhm.jpg",
               "id": 9206,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Rona Mace",
               "gender": 1,
               "credit_id": "52fe44bbc3a368484e033c9d",
               "name": "Jamie Lee Curtis",
               "profile_path": "/c4poMDwQ0nUj81m4WPriiv96ExZ.jpg",
               "id": 8944,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Phil Dearly",
               "gender": 2,
               "credit_id": "52fe44bbc3a368484e033ca5",
               "name": "William Fichtner",
               "profile_path": "/oIGjbztWvTqn4tnolW9rDCjpgxu.jpg",
               "id": 886,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Jeff Dearly",
               "gender": 2,
               "credit_id": "52fe44bbc3a368484e033ca9",
               "name": "Marcus Thomas",
               "profile_path": "/2J8uGdqMnG3UHdezuTrc1Gi5JDv.jpg",
               "id": 55174,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Lt. Feege Gruber",
               "gender": 2,
               "credit_id": "52fe44bbc3a368484e033cad",
               "name": "Peter Dobson",
               "profile_path": "/3laM5gryWnG2tfjE2jt0UuPTFlp.jpg",
               "id": 37822,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Lucinda",
               "gender": 1,
               "credit_id": "52fe44bbc3a368484e033cb1",
               "name": "Kathleen Wilhoite",
               "profile_path": "/53qB97B6QJeMtqeENUH1TyiM9BW.jpg",
               "id": 42335,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Clarence",
               "gender": 2,
               "credit_id": "52fe44bbc3a368484e033cb5",
               "name": "Tracey Walter",
               "profile_path": "/pMeImyAZ8fpQ32QyPO8g6W8gs13.jpg",
               "id": 3801,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Deputy Tony Carlucci",
               "gender": 2,
               "credit_id": "52fe44bbc3a368484e033cbd",
               "name": "Paul Ben-Victor",
               "profile_path": "/80xWsGSGwTektmHd9xcPdqeOmlI.jpg",
               "id": 85142,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Deputy Jimmy D.",
               "gender": 2,
               "credit_id": "52fe44bbc3a368484e033cc1",
               "name": "Paul Schulze",
               "profile_path": "/tcGHCA2seYFju3RBKItpyLHAPHc.jpg",
               "id": 36189,
               "order": 12
            },
            {
               "cast_id": 14,
               "character": "Murph Calzone",
               "gender": 2,
               "credit_id": "52fe44bbc3a368484e033cc5",
               "name": "Mark Pellegrino",
               "profile_path": "/meXeaopncCQEw7saya4z0MhkUK2.jpg",
               "id": 1236,
               "order": 13
            },
            {
               "cast_id": 15,
               "character": "Father Tom Stowick",
               "gender": 2,
               "credit_id": "52fe44bbc3a368484e033cc9",
               "name": "Raymond O'Connor",
               "profile_path": "/bIC6drKtKjr4F2GXQwbBgJGh8y9.jpg",
               "id": 84606,
               "order": 14
            },
            {
               "cast_id": 18,
               "character": "Shirley",
               "gender": 1,
               "credit_id": "52fe44bbc3a368484e033cd9",
               "name": "Melissa McCarthy",
               "profile_path": "/qVb4VmZRwcANDuzhXjVjTlQ761x.jpg",
               "id": 55536,
               "order": 15
            },
            {
               "cast_id": 19,
               "character": "Charm Motel Cashier",
               "gender": 2,
               "credit_id": "56d21155c3a3681e36009f17",
               "name": "Philip Perlman",
               "profile_path": "/e3H57eV4xrpd91P2xPfAnuDbrae.jpg",
               "id": 197073,
               "order": 16
            },
            {
               "cast_id": 20,
               "character": "",
               "gender": 2,
               "credit_id": "59e392f89251410b670002ee",
               "name": "Will Ferrell",
               "profile_path": "/dGxt3uGPlUJKIfHYiLasnEgR90e.jpg",
               "id": 23659,
               "order": 17
            },
            {
               "cast_id": 21,
               "character": "",
               "gender": 2,
               "credit_id": "59e392f89251410b670002f0",
               "name": "Casey Affleck",
               "profile_path": "/kPNMpiZHsAzeQar4DiNsrekwHBU.jpg",
               "id": 1893,
               "order": 18
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44bbc3a368484e033ccf",
               "name": "Nick Gomez",
               "profile_path": "/mpV7F62c83IcRNjm4ei6ZMwRtfQ.jpg",
               "id": 17278,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44bbc3a368484e033cd5",
               "name": "Peter Steinfeld",
               "profile_path": null,
               "id": 37933,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 4.673636,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 25166,
      "vote_count": 51,
      "budget": 16000000,
      "overview": "The recently deceased Mona Dearly (Bette Midler) was many things: an abusive wife, a domineering mother, a loud-mouthed neighbor and a violent malcontent. So when her car and corpse are discovered in the Hudson River, police Chief Wyatt Rash (Danny DeVito) immediately suspects murder rather than an accident. But, since the whole community of Verplanck, N.Y., shares a deep hatred for this unceasingly spiteful woman, Rash finds his murder investigation overwhelmed with potential suspects.",
      "similar": [
         15069,
         984,
         2749,
         8090,
         4771,
         4638,
         96,
         49524,
         75780,
         807,
         357096,
         21484,
         10651,
         11423,
         18587,
         26390,
         15762,
         37645,
         12150,
         979
      ],
      "original_title": "Drowning Mona",
      "runtime": 96,
      "poster_path": "/tAkoosobX8wEwIJnPICEhrCI7H5.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Neverland Films",
            "id": 37498,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Code Entertainment",
            "id": 14589,
            "origin_country": ""
         }
      ],
      "release_date": "2000-03-03",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "The death of Mona Dearly wasn't so much a whodunnit, as a who didn't.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Nick Gomez"],
      "runtime": 96,
      "synopsis": null,
      "writers": ["Peter Steinfeld"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0186045/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIzMzI5NzY5NF5BMl5BanBnXkFtZTYwMTE2Mzg4._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Danny DeVito, Bette Midler, Neve Campbell | See full cast and crew »"],
      "reviews": [
         "Why are people so hard on Drowning Mona? I just saw it and enjoyed it a lot. In years to come I believe it will be seen as the same genre as The Good Girl - an attempt to bring very ordinary people to life without apologizing for their ordinariness. In A Good Girl, Jennifer Aniston works very hard to portray an ordinary, poorly-educated young woman in a dead-end job. She has to really work hard to suppress the natural intelligence of a very bright mind and make her ordinary girl sufficiently dumb. But she does it beautifully. In Drowning Mona - portraying Bobby Calzone, Casey `Affleck has a similar challenge. I think he creates his character brilliantly. I am so shocked to find higher up this page that Casey is ashamed of his work on this movie. Can this be true? It seems quite possible - on my DVD package he is the only major cast-member who doesn't give an interview. Casey is handsome and delightful but he manages to leave an impression of terminal dumbness. All the guy wants is to make a reasonable living fixing gardens, but his problems seem insurmountable and it's getting to him. I get the feeling that none of the cast were stirred or excited with Drowning Mona - you need to see the on-set interviews to judge this. Nevertheless it is a successful little film in its own terms and has a lot of gentle humor in it. Affleck, deVito, Midler, Lee Curtis do a very professional ensemble piece as you would expect. As a former copywriter I find the landscaping company slogan hysterically funny: J & B Landscaping - `Yeah, we can do that'. I get the impression the whole cast read through a rather 'thin' script and said exactly that.",
         "I believe that this movie was panned when it first came out, and I don't know why. It is truly an underrated comedic gem that deserves more recognition. The performances are perfect (with the exception of Campbell) and the dialogue is hysterical. William Fichtner steals the show as the sleazy \"battered husband.\" His performance is tops in a stellar cast. Marcus Thomas is excellent as his son and lazy landscaping partner to Affleck, who is marvelous as the nervous and long-suffering lead. Will Ferrell puts in a great cameo as a creepy mortician. Are there flaws? Of course. As another comment mentioned, Tracy Walter's character, Clarence, could have been developed more. Also, some the other characters' run-ins with Mona probably could've been better detailed as well, and the resolution isn't the most satisfying. But this movie is less about the plot and more great characterizations and riotous dialogue. I own the DVD and I roll with laughter every time I see it, even though I practically have it memorized. This movie should be remembered as",
         "This is a different kind of comedy -- maybe too subtle for some people's tastes -- but anyone who appreciates the dark humor in \"Raising Arizona\" or \"Fargo\" should give this movie a viewing. Casey Affleck portrays a perfectly bewildered, hopeless, helpless suspect in the murder of The Worst Woman (Formerly) Alive, Mona Dearly. There are dozens of hilarious, subtle, and easily missed lines and facial expressions throughout the movie which define the many characters inhabiting a small town in upstate New York where Yugo once tested its cars. The town itself, and most of its denizens, are like the Yugo: simple, no- frills, unassuming, more than a little deficient in many ways, but unique and endearing in an odd, pitifully likable way. If seeing a Yugo on the road today brings a smile to your face, see this movie. If seeing a Yugo on the road today makes you angry, see something else.",
         "I did not expect much from this one, considering the lukewarm reviews it had gotten, and its brief time in the theaters. I was attracted by the cast - Dannny deVito, Bette Midler, Jamie Lee Curtis. I found it quite hilarious, as the earnest sheriff, DeVito, of Verplanck, N.Y., a down-at-the-heels upstate burg where everyone drives a Yugo due to a long-ago promotion scheme (an offbeat touch), attempts to solve the murder of the town's most hated woman, played by Middler. The script is very funny, and it is played well by all concerned. The collective i.q. of this God-forsaken hamlet does not appear to rise above room temperature. The frightening thing is that the tawdry machinations of all involved probably reflect pretty closely what life is really like in many trailer-park backwaters. My son & I found it a laugh riot. (As an aside, the movie accomplishes the seemingly impossible task of making Jamie Lee Curtis look positively wretched.)",
         "Drowning Mona is now a cult favorite of mine. The script is unusual yet amazingly funny. Every time I watch this movie, my understanding of its comedic genius grows. Especially for English language buffs, this film's edgy and blatant use of word order and delivery are what make it so hilarious. No line is extraneous or meaningless--they all add up to one hell of a funny film. I'd recommend this to serious movie goers who enjoy an intellectual thrill, a script that puts faith in the audience's ability to understand and not be told outright. If you crave a change from the typical Hollywood Blockbuster formula of drugs, sex, violence, and sentimental life lessons, watch this film. It still manages to deliver action and comedy--but are you smart enough to watch it?",
         "Maybe Danny DeVito and Bette Midler should collaborate more often. The two times they did it was comedy gold. While this movie is not as flat out hilarious as \"Ruthless People,\" it should still be enjoyed by the same people who love that movie. It starts with a prologue stating how Verplanck, New York was the location where they decided to launch the Yugo line of cars in America. As a result, everyone in town, including the police, drives a Yugo car, and they all have catchy license plates like UGOMONA, ELLEEE, and OH RONE. As the title suggests, this black little whodunit concerns who opted to rid the small town of Verplanck of its nastiest inhabitant, the matriarchal hag Mona Dearly (Midler, who chews up every inch of the screen in her \"Rashomon\"-esque flashback scenes). Police Chief Wyatt Rash (Danny DeVito, playing against type as the straight man), is determined to find out, even if nobody else cares to help. It's come at a bad time, because he's trying to help his daughter Ellie (Neve Campbell) plan her big wedding to mild-mannered land-scaper Bobby Calzone (Casey Affleck), who has just ended up short-handed after his beer-guzzling partner Jeff Dearly (Marcus Thomas, the epitome of slackerdom) takes a leave of absence. Bobby also seems unnaturally concerned with the the death of a woman who meant only bad things for him. The characters, while bordering on cartoons, are played tongue-in-cheek, and you know the actors had fun doing it. There's the chain-smoking waitress Rhona Mace (Jamie Lee Curtis), who's having an affair with the deceased's husband Phil (William Fichtner, who walks away with the movie as a complete scumbag), and Bobby's overbearing brother Murph (Mark Pellegrino). The cops are just as zany, with Peter Coyote as the do-gooder lieutenant, and Paul Ben-Victor and Paul Schulze (Ryan Chapelle from \"24\") as a couple of bumbling idiots who seem to be good for one thing, looking out for Numbers One. There's Katherine Wilhoite as Lucinda, the lesbian folk-singer mechanic, and the great Tracey Walter is on board as the local fisherman who nobody really knows much about. Add in a foul-mouthed, alcoholic priest, and a funeral director who's also an amateur pornographer (Will Ferrell before he became huge), and it's a feast for those with a twisted sense of humor.",
         "This off-beat comedy is definitely one of the better movies I've seen recently. The plot is engaging and fast-paced; the movies doesn't even come close to the two-hour mark. The conclusion is satisfying and unexpected. Every actor is perfectly cast. Casey Affleck gives an excellent performance as put-upon Bobby Calzone, Neve Campbell is terrific as Ellen, Bobby's fiancee, and Danny DeVito is loveable and sweet as police chief Wyatt Rash, Ellen's father. All in all, this is a very good movie, perfect for a lazy day.",
         "Drowning Mona is a hard movie to describe. On the one hand, I liked it because, the cast seemed to be doing the best with what the script they had to work with. On the other hand, the plot seemed choppy and the dialogue was for the most part pretty stale. Will Ferrell absolutely steals the movie with his part as the creepy funeral director who laughs inappropiately, has trouble with the right way to make eye contact, and is constantly having sexual trysts during the viewing. If you're looking for an offbeat comedy, give this a try. But don't rush out and kill yourself to see it.",
         "... even the police. Bette Midler, even though she is the title character, gets second billing to Danny DeVito. In the recently released \"Isn't She Great\" she gets to play both sides of the ugly/beautiful coin and she does it here again brilliantly. Sherriff Wyatt Rash (DeVito) has too many suspects in the death of Mona. Everyone would like to see her dead. Neve Campbell as his daughter (Ellen) turns in a fine performance. Her breakdown and ultimate (short-lived) lesbian experience with the town's mechanic is either over-the-top -- or just short of being brilliant; hard to tell. Casey Affleck (Ben's little brother) is very one-note -- I want to believe that it was written that way and that Bobby is not as shallow as the script would have us believe. This is not a film that will appeal to everyone -- but hang in -- it only gets better as it goes along. I enjoyed it -- and as I reflect on it -- it only gets better.",
         "Everybody hates Mona Dearly, and who could blame them. Mona (Bette Midler) is rude, loud, cruel, and another word for \"female dog.\" Then something happens, Mona dies in a car accident, and town sheriff Wyatt Rash (Danny DeVito) found out that Mona was murdered, and who would kill her. The problem is that there is a long list of suspects. DROWNING MONA is a film that is a good example of the term \"black comedy\" a film where the viewer would laugh at something that they wouldn't normally laugh at. But unlike some other black comedies (i.e. the most recent IDLE HANDS) this film isn't as cruel and does work. The small town where DROWNING MONA takes place is a intresting town. In the late 1980's, the entire town received test cars from the Yugo car company. And what's funny is that everyone in the town drives a Yugo. Town sheriff Wyatt goes around his town looking for the person who would tamper with the Yugo that Mona was driving, and send her to her watery death. There's Mona's husband, Phil (William Fichtner) who is having a affair with Rona (Jamie Lee Curtis), who is also a suspect. There's Bobby Calzone (Casey Affleck) a young and ambitious young man who is engaged to the sheriff's daughter, Ellen (Neve Campbell). Then there is Bobby's partner in their business, Mona's son, Jeff (Marcus Thomas) who is very dim, and mean. This is a enjoyable film, but it's not the best black comedy of all time. It does work at times, and at other times it fall flat on it's face. There are some very funny scenes involved with Mona's son, Jeff, on how he might have lost his right hand. And the town's loony mortician (Will Ferrel) does have some good scenes, but not enough. The acting from the cast is good though. Danny DeVito is good as the man who is investigating the crime of Mona's death. Jamie Lee Curtis is also good as the woman who could care less about Mona, and move on with her life. Neve Campbell does o.k. with what little role that she has. William Fichtner, Casey Affleck, and Marcus Thomas are all also good, but nothing outstanding. It seems that the person who gets to steal all of the scenes belong to Bette. She does another role that she is good at, a role that is similar to her role in RUTHLESS PEOPLE. But overall, DROWNING MONA isn't as funny or as witty as RUTHLESS, since both films have characters that are rather ruthless. But director Nick Gomez (HBO's THE SOPRANO'S & OZ) does a respectable first time job for a big feature film. MONA isn't great, but it's worth watching at least once. But if you want to see DeVito and Midler act more funnier and vicious, watch RUTHLESS PEOPLE. ***1/2 (out of five)"
      ],
      "genres": [
         "Crime",
         "Mystery",
         "Comedy"
      ],
      "productionCompanies": [
         "Code Entertainment",
         "Jersey Shore",
         "Marigold Productions Inc."
      ],
      "summaries": [
         "Mona Dearly, a spiteful, loud-mouthed, unpopular woman dies when the car she is driving in plunges off a cliff and into a river near the small upstate New York town where she lives. Wyatt Rash, the local police chief, investivates and suspects foul play in Mona's death and tries to contain the whole town whom all are suspects who include Wyatt's daughter Ellen, who is going to marry landscape artist Bobby Calzone whose business was suffering from his lazy business partner, Jeff, Mona's slow-witted son, as well as waitress Rona Mace, who was having an affair with Mona's husband.",
         "When Mona's key won't fit in her Yugo, she tries it in her son's; when it works, she borrows his car. The brakes fail; she goes through the guard rail, into the river, and drowns. When police chief Rash learns that the brake lines were cut, he looks for a murderer. Suspect one: Mona's dim son Jeff, whom she constantly denigrated. Suspect two: her husband Phil, whom she constantly belittled and who's having an affair with Rona, a waitress with a secret of her own. Suspect three: Jeff's landscape partner Bobby, who wants Jeff out, has yelled at Mona that he'd like to rip out her ovaries, and who is soon to be Rash's son-in-law. Can Rash find the killer and keep Bobby out of jail?",
         "When a woman drives a car into the river to her death, everyone in town becomes a suspect."
      ],
      "budget": 16000000
   },
   "movielensId": 3324,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-03-03",
      "dvdReleaseDate": "2000-07-25",
      "directors": ["Nick Gomez"],
      "runtime": 96,
      "movieId": 3324,
      "title": "Drowning Mona",
      "mpaa": "PG-13",
      "actors": [
         "Danny DeVito",
         "Bette Midler",
         "Neve Campbell",
         "Jamie Lee Curtis",
         "William Fichtner",
         "Marcus Thomas",
         "Peter Dobson",
         "Kathleen Wilhoite",
         "Tracey Walter",
         "Paul Ben-Victor",
         "Paul Schulze",
         "Mark Pellegrino",
         "Raymond O'Connor",
         "Melissa McCarthy",
         "Philip Perlman",
         "Will Ferrell",
         "Casey Affleck"
      ],
      "imdbMovieId": "0186045",
      "originalTitle": "Drowning Mona",
      "genres": [
         "Comedy",
         "Crime",
         "Mystery"
      ],
      "youtubeTrailerIds": ["WUapG9Ma3uw"],
      "plotSummary": "The recently deceased Mona Dearly (Bette Midler) was many things: an abusive wife, a domineering mother, a loud-mouthed neighbor and a violent malcontent. So when her car and corpse are discovered in the Hudson River, police Chief Wyatt Rash (Danny DeVito) immediately suspects murder rather than an accident. But, since the whole community of Verplanck, N.Y., shares a deep hatred for this unceasingly spiteful woman, Rash finds his murder investigation overwhelmed with potential suspects.",
      "tmdbMovieId": 25166,
      "avgRating": 2.6964,
      "releaseYear": "2000",
      "numRatings": 1138,
      "posterPath": "/tAkoosobX8wEwIJnPICEhrCI7H5.jpg"
   }
}