{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "noises",
            "id": 3767
         },
         {
            "name": "alien life-form",
            "id": 4862
         },
         {
            "name": "erection",
            "id": 6935
         },
         {
            "name": "alien",
            "id": 9951
         },
         {
            "name": "reproduction",
            "id": 168550
         },
         {
            "name": "search for new wife",
            "id": 237186
         }
      ],
      "imdb_id": "tt0181151",
      "video": false,
      "title": "What Planet Are You From?",
      "recommendations": [
         25697,
         92331,
         83489,
         50116,
         42217,
         13579,
         73249,
         36271,
         37345,
         42158,
         15513,
         23570,
         30500,
         24029,
         36220,
         18856,
         38554,
         31633,
         15581,
         28446
      ],
      "backdrop_path": "/kaH2D6SnJQHeOeNwnkjOac6Gt9j.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Harold Anderson",
               "gender": 2,
               "credit_id": "52fe436a9251416c7500f89d",
               "name": "Garry Shandling",
               "profile_path": "/rMSod5msflCZBZ9LfJu8n4zYkuP.jpg",
               "id": 52865,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Susan Anderson",
               "gender": 1,
               "credit_id": "52fe436a9251416c7500f8a1",
               "name": "Annette Bening",
               "profile_path": "/q8pCSQzGLrhgtVXBKzMnwfoeBlH.jpg",
               "id": 516,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Roland Jones",
               "gender": 2,
               "credit_id": "52fe436a9251416c7500f8a5",
               "name": "John Goodman",
               "profile_path": "/eOIx8zj1vYIRhVY2bK5cjIQfua0.jpg",
               "id": 1230,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Perry Gordon",
               "gender": 2,
               "credit_id": "52fe436a9251416c7500f8a9",
               "name": "Greg Kinnear",
               "profile_path": "/agOTbOC76I6rC7TPuCTquvngXRu.jpg",
               "id": 17141,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "Helen Gordon",
               "gender": 1,
               "credit_id": "52fe436b9251416c7500f8eb",
               "name": "Linda Fiorentino",
               "profile_path": "/aKadq5uC9CjCKtkMYPYECNcGz3s.jpg",
               "id": 9625,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Graydon",
               "gender": 2,
               "credit_id": "52fe436b9251416c7500f8e7",
               "name": "Ben Kingsley",
               "profile_path": "/2Eu3j31JDJek70ZXLY6xfeUaJoR.jpg",
               "id": 2282,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Rebecca",
               "gender": 1,
               "credit_id": "52fe436b9251416c7500f8e3",
               "name": "Judy Greer",
               "profile_path": "/ooEejsGv4loFIKnbe2arzOwWy6H.jpg",
               "id": 20750,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Don Fisk",
               "gender": 2,
               "credit_id": "52fe436b9251416c7500f8ef",
               "name": "Richard Jenkins",
               "profile_path": "/iz61iPIgNUp0yk48bRNjEJ5GHO4.jpg",
               "id": 28633,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Woman",
               "gender": 1,
               "credit_id": "52fe436b9251416c7500f8f3",
               "name": "Stacey Travis",
               "profile_path": "/peARleY7mDjxph4fFfeWnV4LMFe.jpg",
               "id": 31714,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Nervous Woman",
               "gender": 1,
               "credit_id": "56d6053bc3a3681e4a017413",
               "name": "Janeane Garofalo",
               "profile_path": "/jwZs05qdp8kh6IwfECxDyRrteK8.jpg",
               "id": 21197,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Baby Nurse",
               "gender": 1,
               "credit_id": "587c5eb5c3a36849ff014c45",
               "name": "Octavia Spencer",
               "profile_path": "/4FEVru6fBFyJECqwqjHwlZdsL4c.jpg",
               "id": 6944,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Nadine Jones",
               "gender": 1,
               "credit_id": "59010a67c3a3681123001e2e",
               "name": "Caroline Aaron",
               "profile_path": "/9v9h9bR4CX6MrpZFgEktTHFIlgT.jpg",
               "id": 1910,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe436a9251416c7500f8af",
               "name": "Mike Nichols",
               "profile_path": "/eJgJEVil7iOJ9sTAXLCVRKfeKKM.jpg",
               "id": 5342,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe436a9251416c7500f8b5",
               "name": "Garry Shandling",
               "profile_path": "/rMSod5msflCZBZ9LfJu8n4zYkuP.jpg",
               "id": 52865,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe436a9251416c7500f8bb",
               "name": "Peter Tolan",
               "profile_path": "/hsQpWuaVMYvfcru1lXlr0r03WJF.jpg",
               "id": 18268,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe436b9251416c7500f8c1",
               "name": "Ed Solomon",
               "profile_path": "/dfhHU0NT1mtEhfuPZgNSHe1N1lH.jpg",
               "id": 9612,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe436b9251416c7500f8c7",
               "name": "Mike Nichols",
               "profile_path": "/eJgJEVil7iOJ9sTAXLCVRKfeKKM.jpg",
               "id": 5342,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe436b9251416c7500f8cd",
               "name": "Garry Shandling",
               "profile_path": "/rMSod5msflCZBZ9LfJu8n4zYkuP.jpg",
               "id": 52865,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe436b9251416c7500f8d3",
               "name": "Richard Marks",
               "profile_path": null,
               "id": 3175,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe436b9251416c7500f8d9",
               "name": "Michael Ballhaus",
               "profile_path": "/pMto0iHZb67YaSP9cTgKbAPcaYU.jpg",
               "id": 3769,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe436b9251416c7500f8df",
               "name": "Carter Burwell",
               "profile_path": "/feAqzRbewe6r2icciqiTeaqzTm4.jpg",
               "id": 1225,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 1.940091,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10416,
      "vote_count": 46,
      "budget": 60000000,
      "overview": "A highly-evolved planet, whose denizens feel no emotion and reproduce by cloning, plans to take over Earth from the inside by sending an operative, fashioned with a humming, mechanical penis, to impregnate an earthling and stay until the birth. The alien, Harold Anderson, goes to Phoenix as a banker and sets to work finding a mate. His approaches to women are inept, and the humming phallus doesn't help, but on the advice of a banking colleague, he cruises an AA meeting, meets Susan, and somehow convinces her to marry. The clock starts to tick: will she conceive, have a baby, and lose Harold (and the child) to his planet before he discovers emotion and starts to care?",
      "similar": [
         16866,
         840,
         10200,
         228161,
         126889,
         20424,
         602,
         49849,
         348,
         601,
         679,
         8836,
         2675,
         607,
         608,
         644,
         7453,
         68179,
         8077,
         8078
      ],
      "original_title": "What Planet Are You From?",
      "runtime": 105,
      "poster_path": "/2VtgMZPj3uDLz0zOQqZ74SUZGK4.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
         "name": "Columbia Pictures",
         "id": 5,
         "origin_country": "US"
      }],
      "release_date": "2000-03-03",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "To save his planet, an alien must find a woman on Earth to have his baby. There's just one problem.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Mike Nichols"],
      "runtime": 105,
      "synopsis": null,
      "writers": [
         "Garry Shandling",
         "Michael Leeson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0181151/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM4ODgzNDU2OF5BMl5BanBnXkFtZTYwMjI1Njc2._V1_SX214_AL_.jpg",
      "actors": ["Stars: Garry Shandling, Annette Bening, John Goodman | See full cast and crew »"],
      "reviews": [
         "I don't know why I'm afraid to admit it, but WHAT PLANET ARE YOU FROM? is definitely one of my guilty pleasures which I have viewed multiple times and still find highly entertaining. This cute and entertaining comedy stars Garry Shandling as an alien sent to earth to impregnate a woman and bring the baby back to his planet. He ends up targeting a real estate agent and recovering alcoholic (Annette Bening) as his target, but he doesn't plan on complications like love, marriage, friends, business competitors...those little things that we earthlings deal with on a daily basis but an alien from another planet would have no concept of. The opening scenes of the aliens being educated on the female erogenous zones are quite amusing as is Shandling's explanations of women to aliens when he returns to his planet after impregnating Bening and stealing the baby. Bening is charming in a rare comedic turn and even gets to sing. Greg Kinnear scores as a slimy co-worker of Shandling's and Linda Fiorentino makes the most of her brief appearance as his sexy wife. John Goodman is solid as a cynical UFO investigator who can't get anyone to believe there is an alien on earth and has to deal with his paranoid wife (Caroline Aaron) who is convinced the man is cheating on her. Ben Kingsley, in a refreshing change of pace, plays the stone-faced leader of Shandling's planet and Camryn Manheim, Nora Dunn, and Ann Cusack appear as Bening's girlfriends. Shandling co-wrote this comedy, smoothly directed by Mike Nichols, of all people. It's no masterpiece, but there are worse ways to kill 90 minutes and there are laughs to be had along the way.",
         "\"What Planet Are You From\" is a very original comedy and I was laughing the whole way through. Garry Shandling co-wrote the script, and plays the lead character well. Fans of Garry will love this movie. I liked the scene where Annette Bening and Shandling are making love, and we cut to the dancing fountain at the Belaggio, as we hear their sexual moans in the background while Lionel Ritchie's \"All Night Long\" plays in the soundtrack. That was a well-crafted scene. And there are many others. The supporting cast is great, too. This is a comedy that's funny, original, intelligent and stylish. It's a real gem. If you want some big laughs...you can't go wrong.",
         "This is a cute little sex farce starring and written by Garry Shandling. Harold Anderson (Shandling) is actually an alien on a very special mission. He must impregnate an earth woman to begin the infiltration of earth for eventual domination and takeover. He has done his research and learned to be a good listener, dutifully repeating `uh huh' at every utterance by a female. Unfortunately, there are certain subtleties he hasn't mastered in the fine art of seduction, and he gets his face slapped repeatedly. After countless humorous failures, he meets Susan (Annette Benning), his future mate and discovers that the only way she will have sex with him is if he marries her. After the nuptials he learns that all the rules of engagement have changed. This droll script ranges from mildly silly to hysterical as it holds a circus mirror up to our mating rituals. Shandling is always funny with his deadpan whiney style, but the real treat here is Annette Benning. She makes this film work as Shandling's overwrought love interest. As she did in `American Beauty', she plays another caricature role to perfection. Here she is the aging female who has been a continual loser at the dating game and is desperately searching for love. Her brilliant performance is a treat that upstages Shandling at every turn. In addition, the rest of the cast is wonderful and fits well with Shandling's wry sense of humor. This is a fun and very light comedy that works well most of the time. I rated it 7/10. Viewers who are offended by nudity, profanity and sexual situations should pass. Others will probably enjoy more than a few good laughs.",
         "WHAT PLANET ARE YOU FROM? / (2000) *** (out of four) By Blake French: Mike Nichols' \"What Planet Are You From?\" is one of the most honest comedies I can remember-and it is a funny one, too. The script features distorted stereotypes dealing with human relationships. Men are only interested in sex with women, you say? Women want emotional support from men, so I hear? This film examines those concepts in such a unique and straightforward fashion even several technical flaws fail to interrupt the creative flow of colorful ideas. Sex is the topic in \"What Planet Are You From?\" but what it truly gets at is the differences of female and male relationship perspectives. Gary Shandling stars as an alien called H1449, who lives with an all-male race on a distant, technologically advanced planet. The race reproduces by cloning only, and because the men never use their sex organs, they have shrunk and disappeared. The leader of the planet, Graydon (Ben Kingsley), plans to take over the entire universe, targeting Earth next. Taking over the planet from the inside is his strategy. After extensive training and dispensed with a penis, H1449 is sent to Earth to breed with a woman. H1449 disguises himself as a home and commercial loan officer named Harold Anderson. His first and foremost mission is to impregnate the first available woman, the problem is that his targets are scared of the humming sound that comes from his penis, in correlation with his state of arousal. He does manage to bed a few easy women, including a flight attendant and a strip club dancer. After meeting his adulterous coworker, Perry (Greg Kinnear), and becoming a candidate for a big promotion, his mission becomes more and more unimportant. Harold soon meets Susan Hart (Annette Bening), a recovering alcoholic/real estate agent putting her life back together. Her biological clock is ticking, so she finds herself marrying Harold after learning about his desires to have a child. Under great pressure from Graydon and an FAA agent (John Goodman), who is set on proving Harold is an alien, the confused H1449 must not only focus on his demanding mission, but also with his new Earthly duties and emotionally needy wife. It's fun watching Harold realize the emotions of being human; when he experiences feelings like anger, jealousy, sadness, and sympathy, we feel oddly touched. There are a few funny moments from the hilariously frank sexual gestures. With nonstop sexual innuendoes and extremely blunt material, the dialogue is irresistible. The vibrating penis gag has potential, but it is not fully explored. \"What Planet Are You From?\" has a lot of laughs, but could have had a lot more fun with its plot elements. I really liked the performance by Gary Shandling. His calm, confused state of mind makes for a light-hearted sense of humor. He often provides the film with hilarious moments, with simple, frank facial expressions. Annette Bening provides the story with a comical charm fitting for the role. The supporting cast is top notch even to minor roles. Such small but effective performances come from Nora Dunn (\"Three Kings\"), Janeane Garofalo (\"Clay Pigeons,\" \"The Matchmaker\"), Judy Greer (\"Jawbreaker\") and Linda Fiorentino (\"Men in Black,\" \"Dogma\"). Mike Nichols has made better movies, such \"The Graduate,\" \"The Birdcage,\" \"Primary Colors\" and \"Who's Afraid of Virginia Woolf?\" \"What Planet Are You From?\" is by far his silliest production, and I am actually a bit surprised to see him involved with this kind of movie. It is downright stupid at times-just plain dumb. But it is a funny stupid. The story evokes laughs from its utter foolishness. I enjoyed the film-not a lot-but it often connected with my unusual sense of humor. If you like this kind of offensive, perverse, and superficial buffoonery, and you know who you are, you might just find yourself having a ball with \"What Planet Are You From?\"",
         "Garry Shandling is an unattractive man who looks as if he is suffering from a perpetual state of constipation, and, can you believe it?, he still manages to be enjoyable (and even loveable, of all things) in his latest movie, What Planet Are You From? Despite a clunky title and an unlikely leading man (even Shandling himself seems stunned by the reality of it), this movie manages to just barely pull off a decent performance. The premise seems much more suited to an hour and a half of repetitive penis jokes (and, in some ways, it gets close to that): Shandling plays Harold Anderson, an alien from a planet inhabited by impotent, super-intelligent men bent on universal domination. Led by a stiff-lipped Ben Kingsley (whose neck seems to have disappeared) this race of uber-men has lost all semblances of emotion, let alone sexuality. In their quest for universal rulership, they have chosen Earth as their next target. Their goal? To impregnate a human woman and begin populating the world with \"their kind.\" Of the millions of available aliens, Shandling is chosen as their ambassador, and after being fitted with an artificial and somewhat dysfunctional penis (it hums when erect), he travels to Earth in a glowing white ball and immediately begins incorporating the lessons he learned about the delicate art of female seduction. For instance, he has an endless bevy of \"nice footwear\" and \"nice perfume\" remarks, including some slang: \"Kitty likes to scratch!\" Sounds like a one-hour one-liner, huh? Fortunately, it's not. It's safe to say the movie would have fallen flat on its alien face if it weren't for the stellar performance of Annette Benning as the one woman who finally falls for the bumbling alien's \"charms.\" She manages to take this ludicrous premise and bring a touching dose of reality to it, giving a normally crass idea a glimmer of merit. She is what diversifies Shandling's occasionally monotonous character, and it is through her eyes that the film sheds its hokiness and becomes a real movie. Co-stars John Goodman and Greg Kinnear, to their credit, do a great job as well, both of them displaying an untypical amount of restraint. As far-fetched as it seems, it is the undertones and quiet moments in this film that render it watchable. Likewise, those moments are what keep the joke from getting old. Director Mike Nichols (who gave us such gems as Catch-22 and The Graduate) has combined the quiet soul of his Regarding Henry with the flamboyant ditziness of his The Birdcage to come up with something truly remarkable: a Garry Shandling movie that works. It certainly has its flaws, like most flicks, and many times the plot seems to stop and start just like Harold's malfunctioning member. However, although the jokes reach levels the man from Nantucket would be proud of, they mostly act as reminders that, no matter how much we poke fun at sex and marriage, most of the jokes are true. What Planet Are You From? has its out-there moments, but it still hits close to home.",
         "I have long been a fan of Gary Shandling ever since his show on Fox. He has a perfect way a delivering the dead pan punch line. Gary is perfectly cast as the emotionless alien who comes to impregnate a woman in order to take over our world. What Planet Are You From has its flaws and arguments could be made for not liking this film. At times it is uneven and not sure what direction it wants to take. Sub plots are left unexplained or ended in a somewhat confusing fashion. All of these distractions are a side note to hilarious writing and stellar acting from a great cast including John Goodman, Greg Kinnear, Linda Fiorentino, and Annette Benning. The jokes are all dead on and Shandling's performance, especially as he develops into the more atypical male stereotype, is brilliant.",
         "I wasn't expecting much, but found the movie to be nice and not a waste of time. The story quickly gets to meat of the matter in how aliens intend to take over the earth. And the depictions of their planet is interesting, but most of it revolves around a classroom environment. Annette Bening plays another real estate agent, and so one can guess she's probably qualified to be one in reality by now. Greg Kinnear is typically excellent, he should be a cheaper version of Tom Hanks someday if not already. John Goodman did well as the chaser and did as well as Richard Benjamin did in a '70's Dracula comedy. The story is nice and possibly predictable, as is the ending, but it's a pleasant and feel good movie. Strange for a movie that has the ending like it does (awkward to say the least), but whenever you end the whole thing with a baby laughing it can't be any better. Ben Kingsley was ok as the boss, but his talents weren't used to their fullest, but playing the type of character he was probably didn't require him to tap into his full ability. Would recommend this movie if you can handle \"penis\" being said. Every young man should see this movie before growing up and trying \"to get into women's pants\". Shandling does a good job of being himself and his expressions are excellent, it's too bad he's not done this type of stuff more, he's much better than Jim Carrey and not as thick as Robin Williams, but then again he does another type of comedy than they do. Isn't that sound normal when a guy has an erection... ; ) ...ok, so that may just be all the blood flushing from my brain to my... ...penis that I am hearing.",
         "The new film from director Mike Nichols who did such classics as THE GRADUATE, and WORKING GIRL. Now his newest film is a sort of a different pace for him, it's still a comedy but it has science fiction mixed in with it. Nichols newest film is is WHAT PLANET ARE YOU FROM? This is a intresting sort of film since it mixes AMERICAN PIE with MEN IN BLACK. PLANET is about a alien from a planet far away, where there are only men. The leader, (Ben Kingsley)decides that it's time to start breeding and to begin taking over Earth. A alien is chosen, and it's Harold (Garry Shandling), who goes to Earth to help the future of his planet. Harold arrives in Phoenix to find his lucky future mate. He meets a slimy and cold co-worker (Greg Kinnear)who gives Harold tips on how to meet, \"one night stand\" women. When they go to a alcholic annonymous meeting, Harold meets a woman who he feels fits his profile (Annette Bening). But Harold then discovers what it's really like to live on Earth, and what Earth women are really like. Meanwhile, a Federal Avation Agent (John Goodman) is tracking down the mysterous \"jolts\" with the airplanes that Harold caused. I did enjoy this film for so many reasons. 1.) It was filmed in Phoenix, (where I live) and it was fun spotting the locations on where they shot the film. 2.) The acting by everyone is good. Garry Shandling does a great job playing the lead. At times he is really give a convincing performance by acting weird, like a alien would. Anette Bening (playing a real estate agent again) is also great, giving a good performance. And I also enjoyed John Goodman as the agent determine to pursade the unwelcome guest. 3.) The cinematography by Michael Ballius and production design by Bo Welch was great, since they also both worked on MEN IN BLACK. 4.) The jokes are very dry in this film, yet they do work and succeed. At times they can be cruel, but they are funny. and 5.) Believe it or not, the film does have a heart in it, which does make it meanningful. For a \"screwball\" style comedy with very good sets and special effects, PLANET succeeds. However, at time the story does get disjointed and some actors appear and disappear, when you would like to see more of them. But overall, it is entertaining and funny. I don't think teens would enjoy it, but the older adults will giggle as they see the poor reproductive organ that Shandling's character has. This is a funny film, and I do suggest to catch it when one gets the chance. It's not a classic, but it is very enjoyable. **** (out of five)",
         "This is a great movie. I think it is better on video because at home you can laugh out loud and not offend anyone. All the actors had great lines through out the movie. But a new one to watch for is Rebecca the stewardess (Judy Greer). Linda Fiorentino was outstanding, as usual, to bad her part wasn't larger. All is all a lot of fun. Enjoy!!!!",
         "I've loved this movie from the first time I saw it. Maybe I'm just a Garry Shandling fan, but I laughed my ASS off in the theater. So I had to buy it. So just the other day (Jan 15th/05) I had quite a few people over, kind of like a final end to the party. It was getting really late. So we started watching it, and we were all laughing non stop, everyone was like where did you get this movie from. None of them have ever even heard of it. So now they all want to get their own copy. It's a great movie from beginning to start. Any man would wish they had that kind of attitude with women, and would actually work with most of them."
      ],
      "genres": [
         "Comedy",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Brillstein-Grey Entertainment",
         "Columbia Pictures Corporation",
         "What Planet Are You From? Productions"
      ],
      "summaries": ["A highly-evolved planet, whose denizens feel no emotion and reproduce by cloning, plans to take over Earth from the inside by sending an operative, fashioned with a humming, mechanical penis, to impregnate an earthling and stay until the birth. The alien, Harold Anderson, goes to Phoenix as a banker and sets to work finding a mate. His approaches to women are inept, and the humming phallus doesn't help, but on the advice of a banking colleague, he cruises an AA meeting, meets Susan, and somehow convinces her to marry. The clock starts to tick: will she conceive, have a baby, and lose Harold (and the child) to his planet before he discovers emotion and starts to care?"],
      "budget": 50000000
   },
   "movielensId": 3326,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-03-03",
      "dvdReleaseDate": "2000-07-18",
      "directors": ["Mike Nichols"],
      "runtime": 105,
      "movieId": 3326,
      "title": "What Planet Are You From?",
      "mpaa": "R",
      "actors": [
         "Garry Shandling",
         "Annette Bening",
         "John Goodman",
         "Greg Kinnear",
         "Linda Fiorentino",
         "Ben Kingsley",
         "Judy Greer",
         "Richard Jenkins",
         "Stacey Travis",
         "Janeane Garofalo",
         "Octavia Spencer",
         "Caroline Aaron"
      ],
      "imdbMovieId": "0181151",
      "originalTitle": "What Planet Are You From?",
      "genres": [
         "Comedy",
         "Drama",
         "Romance",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["qNsqTgaIKQ8"],
      "plotSummary": "A highly-evolved planet, whose denizens feel no emotion and reproduce by cloning, plans to take over Earth from the inside by sending an operative, fashioned with a humming, mechanical penis, to impregnate an earthling and stay until the birth. The alien, Harold Anderson, goes to Phoenix as a banker and sets to work finding a mate. His approaches to women are inept, and the humming phallus doesn't help, but on the advice of a banking colleague, he cruises an AA meeting, meets Susan, and somehow convinces her to marry. The clock starts to tick: will she conceive, have a baby, and lose Harold (and the child) to his planet before he discovers emotion and starts to care?",
      "tmdbMovieId": 10416,
      "avgRating": 2.75669,
      "releaseYear": "2000",
      "numRatings": 1009,
      "posterPath": "/h4y0j7DO6qRzaFocG1N0710yXaQ.jpg"
   }
}