{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0114694",
      "video": false,
      "title": "Tommy Boy",
      "recommendations": [
         13997,
         11017,
         8872,
         10956,
         6471,
         11003,
         2609,
         10406,
         9622,
         2617,
         11528,
         1542,
         11543,
         11977,
         8873,
         13595,
         9429,
         9536,
         12133,
         10890
      ],
      "backdrop_path": "/ua22k2wSZ34ft2FzDYtBnF23V4.jpg",
      "revenue": 32648673,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Thomas 'Tommy' Callahan III",
               "gender": 2,
               "credit_id": "52fe44359251416c7502c86b",
               "name": "Chris Farley",
               "profile_path": "/cBdeUwTCordbeFTSo7pPBNPRMph.jpg",
               "id": 58198,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Richard Hayden",
               "gender": 2,
               "credit_id": "52fe44359251416c7502c86f",
               "name": "David Spade",
               "profile_path": "/tamKFAKdB1Q2mllHYHXxqg3YUXr.jpg",
               "id": 60950,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Thomas 'Big Tom' Callahan",
               "gender": 2,
               "credit_id": "52fe44359251416c7502c873",
               "name": "Brian Dennehy",
               "profile_path": "/5OgSljTrXQ3pZvy66WveAGpygnS.jpg",
               "id": 6197,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Beverly Barish, aka Beverly Burns",
               "gender": 1,
               "credit_id": "52fe44359251416c7502c877",
               "name": "Bo Derek",
               "profile_path": "/7WI05Puq8rxZKjXK7nMp82LoNNY.jpg",
               "id": 37995,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Michelle Brock",
               "gender": 1,
               "credit_id": "52fe44359251416c7502c89f",
               "name": "Julie Warner",
               "profile_path": "/xkd9Nr32KCbKRUWUah4ukIAdlMN.jpg",
               "id": 63681,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Ray Zalinsky",
               "gender": 2,
               "credit_id": "52fe44359251416c7502c8a3",
               "name": "Dan Aykroyd",
               "profile_path": "/lV7t37Dla8SILS1G7KpOplmviPg.jpg",
               "id": 707,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Paul Burns (uncredited)",
               "gender": 2,
               "credit_id": "58911f5a92514103ec00c4ea",
               "name": "Rob Lowe",
               "profile_path": "/yt6vMZVBXGCJL0xRE4jFa4SjzcQ.jpg",
               "id": 2879,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Frank Rittenhauer",
               "gender": 2,
               "credit_id": "58911f99c3a368701d00b89d",
               "name": "Sean McCann",
               "profile_path": "/sp4Ci5WLATw889RNLS1RJZuN3es.jpg",
               "id": 17646,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Ted Reilly",
               "gender": 2,
               "credit_id": "58911fa692514103e800c4ea",
               "name": "Zach Grenier",
               "profile_path": "/vwYvEHYXhPBjovqbOHY011ipij9.jpg",
               "id": 7471,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Ron Gilmore",
               "gender": 2,
               "credit_id": "58911fb4c3a368701700ca13",
               "name": "James Blendick",
               "profile_path": null,
               "id": 165369,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44359251416c7502c87d",
               "name": "Peter Segal",
               "profile_path": "/sR43dLCaaPbfImGenqOwB8vcJ4e.jpg",
               "id": 13426,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44359251416c7502c883",
               "name": "Lorne Michaels",
               "profile_path": "/cWJv05hztH5jbiIvWfzMfjMX5fo.jpg",
               "id": 56158,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe44359251416c7502c889",
               "name": "Bonnie Turner",
               "profile_path": null,
               "id": 56156,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44359251416c7502c895",
               "name": "Victor J. Kemper",
               "profile_path": null,
               "id": 14536,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44359251416c7502c89b",
               "name": "Terry Turner",
               "profile_path": null,
               "id": 56157,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5539ff7ec3a3681be4006380",
               "name": "David Newman",
               "profile_path": "/vncTIJaBWoYmpdNCPkDnA8hT3PM.jpg",
               "id": 3393,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 9.497303,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11381,
      "vote_count": 384,
      "budget": 0,
      "overview": "Party animal Tommy Callahan is a few cans short of a six-pack. But when the family business starts tanking, it's up to Tommy and number-cruncher Richard Hayden to save the day.",
      "similar": [],
      "original_title": "Tommy Boy",
      "runtime": 97,
      "poster_path": "/lbsuDUaTH9POXWb4Inyck8gZFck.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1995-03-31",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "If at first you don't succeed, lower your standards.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Peter Segal"],
      "runtime": 97,
      "synopsis": null,
      "writers": [
         "Bonnie Turner",
         "Terry Turner"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0114694/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM2Nzc2Njc5OV5BMl5BanBnXkFtZTYwMDMyNDk4._V1_SX214_AL_.jpg",
      "actors": ["Stars: Chris Farley, David Spade, Brian Dennehy | See full cast and crew »"],
      "reviews": [
         "As it turns out, Chris Farley and David Spade only made three movies together (\"Coneheads\", \"Tommy Boy\" and \"Black Sheep\"), but this was truly the \"Citizen Kane\" of their pairings. Farley plays Thomas Callahan III, the dimwitted heir to an auto parts company. His father Big Tom (Brian Dennehy) hires mild-mannered Richard Hayden (David Spade) to look after him. Big Tom is getting married to a \"ten\" (Bo Derek), so everything has to be in order. After Big Tom suddenly dies, Tommy and Richard have to try to sell half a million auto parts to save the company from bankruptcy. From then on, the movie is pretty much an excuse for Chris Farley to do what he does best: make a mess of everything. When this movie first came out in the theaters, I saw it with my grandfather. He figured out early on that the Bo Derek and Rob Lowe characters were hiding something. But you can completely ignore that and simply luxuriate in Chris Farley's antics. Nothing is safe around his stomach, and hell hath no fury like his happy-go-lucky attitude. The scene where he sets the cars on fire, and later the deer scene, make for a pure laugh riot. Chris Farley and David Spade were truly the John Belushi and Dan Aykroyd of their era. It's a pleasure to always be able to think about \"Fat guy in a little coat\" time and again.",
         "I saw this film knowing absolutely nothing about both it and its stars, Chris Farley and David Spade, and I have to say that this film is a comic classic. It is so stupid at times that it can only be hilarious. Farley is brilliant as the bumbling idiot who takes to the road with his dad's right hand man (the equally excellent Spade) to find the funding to save the families 'auto parts' business. Relax, put your brain on auto-pilot and soak up the fun. A great supporting cast features film favourites such as Brian Dennehy (Cocoon), Rob Lowe (Wayne's World) and Bo Derek (\"10\"). Highly recommended for a good laugh.",
         "This is a comedy in which Thomas 'Tommy' Callahan III (Chris Farley) who is a slow-witted, clumsy guy who recently graduated college after attending for seven years. His father, Thomas 'Big Tom' Callahan II (Brian Dennehy), owns an auto parts factory in Ohio. When Tommy arrives back home, he finds he has a position at the factory waiting for him. His dad also introduces Tommy to the new brake pad division of the factory and to Tommy's soon-to-be stepmother, Beverly Barish-Burns (Bo Derek), and her supposed son Paul Barish (Rob Lowe). But when Big Tom dies, the factory threatens to go under unless the new brake pads are to be sold. Therefore, Tommy must go on the road to sell them, along with the assistance of Richard Hayden (David Spade), Big Tom's right-hand man. Beverly and Paul who are con artists and also husband and wife who try to con Tommy and his family out of the company's money. Tommy and Richard travel all over the Midwestern United States trying to sell a half a million brake pads. If they don't sell the half a million brake pads, the company will be sold to Ray Zalinsky (Dan Aykroyd). This movie is full of great laughs and everybody will enjoy it. If Chris Farley was alive today, I bet there would be many more great and funny movies like this one. There are plenty of great passages that I hear everyday from this movie. I have seen it so many times I have lost count. I pretty much know it by heart. It is that great of a movie. Everybody needs to see it.",
         "Yes, I know, it's not THAT old of a movie, it only dates to 1995. However, so much has happened in our world since then, it just *seems* like it's been around for years. I think the movie is very good and very funny, and certainly much better than critics gave it credit for (every time I see it in the TV listings it has only one star by it. Why?!). I watch it routinely (it's on TV a lot, especially USA network). Two things I like about it are the pacing, and the deeper story that plays in the background. First, the pacing: this movie hits the deck running and never stops moving, it just keeps rolling right along, from one nutty event to the next, but it is all carefully intertwined and everything works in symmetry to bring the viewer to the (admittedly schmaltzy) happy ending. Anyway, I like it when a movie maintains a good pace or a rhythm, never letting itself get too bogged down. \"Tommy Boy\" is one of those. Second, the deeper story in the background: all the times I've watched this movie, I've never lost sight of the fact that the story didn't just revolve around some big dumb guy who couldn't seem to find his way out of a wet paper bag. No, there was always in the background the sad issue of Tommy Boy's beloved father dying. Plus, another sobering issue, that of how all this will lead to rather dire economic consequences for a business (Callahan Autoparts) that's been around for a long time and has employed lots of people in the town of Sandusky. Those two grim facts of life - death in the family and impending economic consequences - make this movie more compelling watching than one may realize, and I think this movie will hold up well over the years to come just for those reasons. But enough with the gloom already. This movie is just plain FUNNY, thanks not just to Chris Farley, but to an entire cast that seems to work really well together. I couldn't envision the cast members being changed or replaced in any form. And Chris Farley did such a seamless depiction of this funny guy named Tommy Boy, that I still, in my heart of hearts, just know that there really IS a big dumb funny guy named Tommy Callahan, somewhere in Sandusky, Ohio, who is running an autoparts factory. No, there really IS a Tommy Callahan, believe me... It's kinda' like Pee-Wee Herman: that wasn't really an actor named Paul Reubens playing him, no! - there really IS a Pee-Wee Herman, who is totally in love with his bicycle, and has a dog named Speck... Funny, but I look at waitresses in restaurants just a little differently now (thanks to that wonderful scene where Tommy Boy explains to Helen why he sucks as a salesman). And any time I'm feeling down, I just remember: \"Fat guy in a little coat.\" \"Hey, Prehistoric Forest!\" \"Holy Schnikees!\" \"Hey, quit playin' with yer dinghy!\" plus many other lines, LOL LOL Those will always cheers me up!",
         "This film should go down as a slapstick comedy classic. Farley's untimely death should be lamented, he was a comic god. This movie is unashamedly stupid, but if you'll just relax it's also one of the funniest films you'll ever see. Ok, it has a paper-thin plot, but it does contain some cinematic firsts: a moose breaking its way out of a classic car; Rob Lowe being electrocuted through his pecker; a fat man in a little coat. See this film. Twice",
         "This movie has everything! It has a good storyline, good acting, great scenery, adventure and some brilliant gags! Chris Farley plays Tommy Callaghanhe mega successful company 'Callaghan Auto Parts' has to go on the road to stop the company going under after Big Tom dies. The trouble is that Tommy knows nothing about break pads and needs the help of Callaghan Auto Parts worker Richard (David Spade). From the moment the two dorks hit the road, the movie is just so much fun. If you love slapstick with a great storyline you'll love this because the gags keep coming thick and fast and the movie will just make you laugh out loud! It was so sad about Farley's untimely death in 1997, but a credit to his genius is 'Tommy Boy'. Get it, chill out and enjoy this brilliant slapstick!",
         "What can you say about Tommy Boy, well its without a doubt stupid, over the top, and not a film with any real message to make you think about life in general. But its also a very, very funny film and most likely my favorite Chris Farley film (Black Sheep coming a close second). I should point out that i am English so i haven't seen any Saturday Night Live shows and only know Farley and Spade from their films and Spades stand up comedy. I think that if you want a film to watch that kills an hour and a half and keeps you laughing from start to finish then this is for you. It does have moments of slushy \"i love you\" in it but they are very few and far between and the slapstick comedy is well worth the wait. The story line is very basic, Farley must sell his late fathers brake pads to keep his business alive. But its the amount of situations that both Farley and Spade encounter along the way that make the film so funny and watchable. I can't say enough about this film to really sell it to anyone but it simply is a very, very funny film and ironicly if it has a message to leave the viewer with its how sad the loss of Farley is and how much great comedy was lost once he died. Watch this film Rotten Addict!",
         "I watch this film (or portions of it) every time it comes on television. I don't buy many DVDs, but this is one I will definitely make an exception for eventually. Chris Farley and David Spade's antics have been well documented in the other reviews, but in addition to the comedy, you might also find yourself shedding a bit of a sentimental tear. There is one particular scene that had me going from tears of sentiment to tears of laughter in a matter of seconds (the sing-a-long in the car - you know the one if you've seen the movie). Even Rob Lowe had some very funny moments. Frankly, I don't know how they ever managed to finish this movie, as I wouldn't have been able to keep a straight face had I been one of the actors. I imagine there were a lot of re-takes. If nothing else, this certainly has to feature the funniest cow-tipping scene ever filmed, though I'd be hard pressed to cite other such scenes. Unlike many of the recent comedies, this one is funny throughout. Highly recommended.",
         "I won't go into great details about this film, basically because there aren't many worth mentioning. It's just a funny little romp with Farley and Spade annoying each other and trying to sell some brake pads in their spare time. I must however say that one scene almost had me on the sticky floor of the theater because I was laughing so hard. In the scene, the duo are driving down a highway in Spade's recently trashed GTX. An old Carpenters song is playing on the radio and the two are emotionally singing along with it. That alone is funny enough, then the hood of the car pops up and they skid wildly out of control. This produces a hilarious argument culminating in Spade smacking Farley in the head with a 2x4. The only time I have ever laughed harder in public was during the snowman scene in Dumb and Dumber. That's really all I have to say about this film. Farley was an adorable slug of a guy. I miss him, even though some of his films were real stinkers. I'd give it 8 of 10 stars. So sayeth the Hound.",
         "A very smart slap-stick comedy featuring comic genius Chris Farley. I think the key to enjoying this film is realizing that Farley's character is in fact very intelligent and creative, just supremely careless and completely out of touch with his surroundings. And Farley's character is not alone in his hubris- remember the workman who did not hesitate to let Tommy buff that cylinder because he's the boss' son? It's a real shame that critics did not laud this film more, because it definitely deserves to be seen. It is perhaps also unfortunate that no one was there to help Farley deal with his disease of fat accumulation. Thanks now to Gary Taubes' recent book Good Calories Bad Calories: Challenging the Conventional Wisdom on Diet, Weight Control and Disease, anyone who has a desire to understand science can possibly gain permanent control over their eating habits."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Paramount Pictures"],
      "summaries": [
         "Tommy Callahan Jr. is a slow-witted, clumsy guy who recently graduated college after attending for seven years. His father, Big Tom Callahan, owns an auto parts factory in Ohio. When Tommy arrives back home, he finds he has a position at the factory waiting for him. His dad also introduces Tommy to the new brake pad division of the factory and to Tommy's soon-to-be stepmother, Beverly, and her son Paul. But when Big Tom dies, the factory threatens to go under unless the new brake pads are to be sold. Therefore, Tommy must go on the road to sell them, along with the assistance of Richard, Big Tom's right-hand man. Will Tommy save the company, or will the factory, and the town, go under?",
         "When Big Tom Callahan dies, his auto parts factory passes to his family, many of whom want to sell it to a corporation which plans to close it down. Now its up to Tommy Callahan Jr. to generate enough brake pad sales to save the factory and its employees from losing their jobs.",
         "Thomas Callahan Jr. is kind of a dumb guy. His father gets married to woman who is actually trying to get him for his money by taking over his stocks and then put his brake pad company out of business. When Big Tom dies of a sudden stroke, it seems pretty good for Beverly and tommy's \"brother\". but Tommy and his buddy Richard are going to set out and keep Calahan auto parts in business. I have said too much.",
         "An incompetent, immature, and dimwitted heir to an auto parts factory must save the business to keep it out of the hands of his new, con-artist relatives and big business."
      ],
      "budget": 0
   },
   "movielensId": 333,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-03-31",
      "dvdReleaseDate": "2005-08-30",
      "directors": ["Peter Segal"],
      "runtime": 97,
      "movieId": 333,
      "title": "Tommy Boy",
      "mpaa": "PG-13",
      "actors": [
         "Chris Farley",
         "David Spade",
         "Brian Dennehy",
         "Bo Derek",
         "Julie Warner",
         "Dan Aykroyd",
         "Rob Lowe",
         "Sean McCann",
         "Zach Grenier",
         "James Blendick"
      ],
      "imdbMovieId": "0114694",
      "originalTitle": "Tommy Boy",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["U-xFypjUqTM"],
      "plotSummary": "Party animal Tommy Callahan is a few cans short of a six-pack. But when the family business starts tanking, it's up to Tommy and number-cruncher Richard Hayden to save the day.",
      "tmdbMovieId": 11381,
      "avgRating": 3.35556,
      "releaseYear": "1995",
      "numRatings": 12943,
      "posterPath": "/lbsuDUaTH9POXWb4Inyck8gZFck.jpg"
   }
}