{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "lesbian",
            "id": 10768
         },
         {
            "name": "dolls",
            "id": 202764
         },
         {
            "name": "actress",
            "id": 207583
         }
      ],
      "imdb_id": "tt0063185",
      "video": false,
      "title": "The Killing of Sister George",
      "recommendations": [
         255863,
         85926,
         27441,
         196929,
         195839,
         96010,
         29268,
         71851,
         199503,
         55835,
         46817,
         52203,
         43028,
         89484,
         29112,
         23283,
         80639,
         54391,
         84508,
         111605
      ],
      "backdrop_path": "/b0FT6CNjwIKh5DxCXIK9nHrtE5o.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "June 'George' Buckridge",
               "gender": 1,
               "credit_id": "52fe48a3c3a36847f8172067",
               "name": "Beryl Reid",
               "profile_path": "/aqptE9h34ULAO4t6Ew6rdGP4Dp0.jpg",
               "id": 42572,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Alice 'Childie' McNaught",
               "gender": 1,
               "credit_id": "52fe48a3c3a36847f8172063",
               "name": "Susannah York",
               "profile_path": "/z21rG8L8RsDOEl2iG467cWPud3T.jpg",
               "id": 13326,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Mercy Croft",
               "gender": 1,
               "credit_id": "52fe48a3c3a36847f817206b",
               "name": "Coral Browne",
               "profile_path": "/nbUOn9NZSZFizwo1bB86OIKioeY.jpg",
               "id": 87513,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Leo Lockhart",
               "gender": 2,
               "credit_id": "52fe48a3c3a36847f8172081",
               "name": "Ronald Fraser",
               "profile_path": "/8aR4DwQ1T0FA9grzGrPFygXxpR6.jpg",
               "id": 51881,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Betty Thaxter",
               "gender": 1,
               "credit_id": "52fe48a3c3a36847f8172085",
               "name": "Patricia Medina",
               "profile_path": "/44uKpcaxE4bSv25dPBcEYlS0Tkn.jpg",
               "id": 105733,
               "order": 4
            },
            {
               "cast_id": 21,
               "character": "Freddie",
               "gender": 2,
               "credit_id": "53b3d88f0e0a26597d00c0cd",
               "name": "Hugh Paddick",
               "profile_path": null,
               "id": 91282,
               "order": 5
            },
            {
               "cast_id": 22,
               "character": "Ted Baker",
               "gender": 2,
               "credit_id": "53b3d8ab0e0a26598000c010",
               "name": "Cyril Delevanti",
               "profile_path": "/ldqsp9NS3cbTQfQvp6JJ5WgTWxA.jpg",
               "id": 88906,
               "order": 6
            },
            {
               "cast_id": 23,
               "character": "Diana",
               "gender": 0,
               "credit_id": "53b3d8c90e0a26598c00c52b",
               "name": "Sivi Aberg",
               "profile_path": null,
               "id": 158897,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe48a3c3a36847f8172071",
               "name": "Lukas Heller",
               "profile_path": null,
               "id": 21600,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe48a3c3a36847f8172077",
               "name": "Robert Aldrich",
               "profile_path": "/gtXt9T1l4OSQdJvX5tLgmvUTSKE.jpg",
               "id": 18392,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe48a3c3a36847f817207d",
               "name": "Frank Marcus",
               "profile_path": null,
               "id": 150950,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 2,
               "credit_id": "53b3d706c3a3682edb008d88",
               "name": "Robert Aldrich",
               "profile_path": "/gtXt9T1l4OSQdJvX5tLgmvUTSKE.jpg",
               "id": 18392,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "53b3d71bc3a3682edb008d8b",
               "name": "Gerald Fried",
               "profile_path": null,
               "id": 3350,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "53b3d731c3a3682edf008974",
               "name": "Joseph F. Biroc",
               "profile_path": null,
               "id": 14431,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "53b3d74bc3a3682ed8008a5c",
               "name": "Michael Luciano",
               "profile_path": null,
               "id": 21781,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "53b3d763c3a3682ef1008c86",
               "name": "Lynn Stalmaster",
               "profile_path": "/rhyzo2qgsGAXIpGTN5OabbZU95U.jpg",
               "id": 1263,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "53b3d779c3a3682ef1008c8a",
               "name": "William Glasgow",
               "profile_path": null,
               "id": 959007,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "53b3d7c60e0a26598900c1f9",
               "name": "John Brown",
               "profile_path": null,
               "id": 1336475,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "53b3d7dd0e0a26598000bff1",
               "name": "Renié",
               "profile_path": "/76N2CTu6h9sZZ8CfkexRlhFiVly.jpg",
               "id": 38229,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "53b3d7fa0e0a26597d00c0a8",
               "name": "William Turner",
               "profile_path": null,
               "id": 197875,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "53b3d8190e0a26597900be73",
               "name": "Jean Austin",
               "profile_path": null,
               "id": 1190242,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "53b3d8380e0a26597d00c0c0",
               "name": "Ygnacio Sepulveda",
               "profile_path": null,
               "id": 1336476,
               "department": "Crew",
               "job": "Property Master"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.685201,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 54575,
      "vote_count": 16,
      "budget": 0,
      "overview": "When June Buckridge (Beryl Reid) arrives at her London flat and announces 'They are going to murder me', her long-time lover and doll-cuddling flat mate Alice 'Childie' McNaught (Susannah York) realises that things are going to change. For June is referring to her character 'Sister George', a lovable nurse she portrays in a popular daytime serial. To make matters worse, the widowed executive at the BBC responsible for the decision to kill off Sister George - Mercy Croft (Coral Browne) is also a predatory lesbian who is after Childie and will stop at nothing to get what she wants.",
      "similar": [
         258480,
         370663,
         401898,
         4995,
         249397,
         244772,
         11634,
         1391,
         1018,
         634,
         979,
         27,
         88,
         627,
         2770,
         4247,
         4248,
         9352,
         44214,
         258216
      ],
      "original_title": "The Killing of Sister George",
      "runtime": 138,
      "poster_path": "/jtZcWwTNN2sAzAZ5pb1MZ6a4UI6.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Palomar Pictures",
            "id": 2380,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "The Associates & Aldrich Company",
            "id": 2595,
            "origin_country": ""
         }
      ],
      "release_date": "1968-09-01",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "The story of three consenting adults in the privacy of their own home.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Robert Aldrich"],
      "runtime": 138,
      "synopsis": "For its time, The Killing of Sister George was a groundbreaking film - and one of the first films in history to be released with an 'X' rating in the United States - a fact which no doubt impacted its first-run boxoffice total. The film centers around the soon-to-be-ending television career of June Buckridge (Beryl Reed) - a staple of a long-running British soap opera based in a bucolic and idyllic English countryside town called 'Applehurst'. On that series, she plays a motor-scooter-riding jack-of-all-trades (nanny, health provider, sage, best friend) - a feisty yet lovable and omnipresent voice of reason in the small town. Fiercely protective of her career and her character, she is equally fierce and protective of her live-in lover, 'Alice' (or 'Childie' as she is 'affectionately' called by her lover) (Susannah York) - a much younger, more nubile, and therefore more unstable presence in her life. Outwardly a simpleton - but possessing enough cunning to know where her future prospects lie, Alice is kept on a short leash by her 'master' - a fact made clear in a near-bondage scene in which June punishes her for a perceived slight by forcing her to kneel on the floor and consume her used cigar butt. (In a classic psychological moment of role reversal, Childie suddenly goes from grimacing while chewing the cigar butt to pretending that the experience is a pleasurable one - mimicking orgasm as she chows down on the rancid tobacco leaves. Of course, this spoils the effect for June (or 'George' as she is affectionately called. Problems develop when a drunken George enters a taxi and molests 2 Catholic nuns. In response to complaints to her station by the local Archbishop, George is visited by Mrs. Croft (Corale Brown) - a tightly-wound and prissy woman who holds George's future in her hands. She informs George that her future is 'dependent' upon her contrition and apology to the nuns involved - as well as a general change in her attitude towards her coworkers and her director. Mrs. Croft also appears to hit it off with Childie, encouraging her to continue in her ambition to become a poet. George's problems continue as we learn that Childie is likely seeing other people on the side - one of them her supposedly young and virile boss - AND misleading George as to her relationship with a local female prostitute who lives across the street. Unable to get honest answers to her questions, George flies into frequent drunken rages - her behavior spilling over into her deportment at work. Frustrated, she is 'written out' of the series for 2 weeks in order to have time to consider her actions and reign in her behavior. Her world begins to crumble when she and Childie attend a party at a local lesbian bar - and Mrs. Croft is sent there to discuss her future on the series. When told that her days in Applehurst are numbered and that she is to die by being 'hit by a delivery truck', she snaps - turning her frustration on both Childie (whom she secretly checks up on behind her back) and her coworkers (whose performances she tries to sabotage on her last day of filming). Discovering that Childie has been lying to her repeatedly (her boss is NOT young and virile, but old and balding - AND she has been talking to Mrs. Croft behind George's back), George explodes at her closing cast party. She confronts Mrs. Croft and Childie both - driving them out of the celebration. Back at the apartment, Childie is persuaded to move out and to live with Mrs. Croft 'temporarily' while she decides her future direction in life. Subtly, slyly, Mrs. Croft maneuvers Childie to the bedroom - then to her bed - and seduces her. Caught by George, there is a final scene in which all parties vent their frustrations to the fullest. Left alone and unemployed, George can only wander among her acting props, desolate, and abandoned.",
      "writers": [
         "Frank Marcus",
         "Lukas Heller"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0063185/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTA4NDM1MTg1ODFeQTJeQWpwZ15BbWU3MDUzODcwMzE@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Beryl Reid, Susannah York, Coral Browne | See full cast and crew »"],
      "reviews": [
         "This movie is a heck of a lot more relevant than more recent films dealing with lesbianism -- the shallow, lame DESERT HEARTS comes to mind. Though over two hours long, TKOSG held me with little effort. The action moved freely from the studio to the apartment to the pub. And the seduction scene was totally erotic and ... well ... never mind. Was this particular scene overly long? Only to a generation raised on sex scenes which rarely last as long as it takes to cook a three-minute egg. Explicit? Grow up! And the performances ... wow! I had no problem with the hold George had over Childie, with Beryl Reid's superior portrayal complemented perfectly by Susannah York's fragile and, at the same time, forceful Childie. I must admit, York was a bit over the top in the beginning, but I wouldn't say that if I didn't count her as one of my all-time favorite actresses. And how about Coral Browne -- she was sensational! Sublty menacing, eerily sensuous -- and when I realized this was the same woman from AUNTIE MAME and LYLA CLARE, well, I nearly fell off my chair. I love this lady!",
         "Anyone who likes gritty, clever, slightly comical drama should see this one. The plot is simple enough - an alcoholic gay actress worried about her future in a top Coronation Street-style soap opera - but the way the film is put together is pithy without being too complex - the characterisations are brilliantly satirical, showing up the worst side of the soap opera industry and its catty, backstabbing nature. You don't find yourself feeling sorry for anyone at the end of it apart from perhaps Susannah York. Lots of London-in-the-1960s location filming and familiar faces - I'm only surprised that John Le Mesurier doesn't appear in it. In a word - absorbing. Why don't they make them like this anymore?",
         "Robert Aldrich is a director who rarely gets the attention he deserves. Ridiculously versatile he made the fascinating Film Noir 'Kiss Me Deadly', the gothic black comedy 'Whatever Happened To Baby Jane?', and the macho \"tough guys on a mission\" action classic 'The Dirty Dozen' to name just three in a long career. Just to emphasize that he could do just about anything, one of the first movies he made after 'The Dirty Dozen' was 'The Killing Of Sister George'. It's hard to imagine two more different movies! George is a very English picture about a much loved soap opera star (played by Beryl Reid) who has to juggle a career crisis with a complex lesbian relationship (her lover being played by Susanna York). Reid was well known to British audiences through her TV work, especially a couple of highly popular John Le Carre adaptations. Reid originated the Sister George role on the stage and she really makes the most of it in this movie. Her performance is terrific, hilariously bitchy and also very sad and pathetic. York is also good, and the lesbian subject matter must have been very shocking for the time. It may look a little dated now, but in context it is quite sensitively handled. There are some great actors in the supporting cast, most notably Coral Browne ('Theatre Of Blood') who plays a TV producer who has her eye on York. 'The Killing Of Sister George' deserves a bigger audience. I highly recommend it and hope that anyone who enjoys it looks further into the career of the Robert Aldrich, a seriously underrated film maker!",
         "Beryl Reid gives a no-holds-barred performance as an aging lesbian actress who's already teetering on the edge when she gets word that her character in a TV soap opera is to be killed off. She takes out her frustrations on her childlike lover (Susannah York) and a production head (Coral Browne), the two of whom eventually become intimate on their own. The script-reading sequence had me howling with laughter, and Reid's non-stop barrage of put-downs, insults, wisecracks and other hateful remarks are acidly hilarious. A surprisingly realistic sex scene near the end is pretty graphic for its time (I almost felt like looking away) and we never learn much about Browne's icy character, but the final scene is gut-wrenching, as is the final line of dialogue. *** from ****",
         "Am I the only one who finds it painfully touching that Robert Aldrich went from the biggest hit of his career--the almost woman-free DIRTY DOZEN--to the kind of movie he really wanted to make, i.e., a stagebound melodrama about an aging lesbian soap star's love for a demented nymphet? In its day, SISTER GEORGE was considered the ne plus ultra in coarse homophobia; critics saw the sweaty thumbprints of the Aldrich Touch on every girl-on-girl scene. (Does anyone now lambaste THE BITTER TEARS OF PETRA VON KANT for not being hardhitting docudrama?) In retrospect, the movie seems to me one of Aldrich's most affecting, with Coral Browne (December) and a teeny, teenaged Susannah York (May) grand-slamming this folie a deux to a fare-thee-well.",
         "this is a showcase for some magnificent acting....it doesn't seem at all homophobic , but rather immensely poignant and sad...and in what other film do you get to see a great lesbian band in matching sweaters and guitars (good solo!) Difficult at the beginning, just seems shallow and bitchy, but stick with it and watch Beryl Reid's character disintegrate....the final scene reminded me of \"The Blue Angel\" or \"The Entertainer\" in its shattering degradation...congrats to Aldrich for having the guts to make this movie, I think it stands the test of time rather well. Coral Browne is also magnificent, and York holds her own. The lesbian bar scene is worth waiting for.",
         "I did not see the stage play upon which this film is based (too young) but, based on its own merits, this film surely deserves a closer look. The central trio of performers (Reid, York, Browne) provide career \"bests\" and there are some amusing vignettes from the others (Fraser, in particular, as a truly odious soap actor). The much-discussed sex scene is, by today's standards (and, it would seem, even those of the 1960s stage play), tame, but its real value as a display of the shift of power between the three central characters is very neatly worked through in the closing quarter. The final five minutes of (self-) destruction is heartbreaking, with excellent use made of the music track. In short: miss it and miss out.",
         "I don't give many movies 10/10, but this black comedy-drama gets my vote, for fine acting, production values, and of course its place in movie history in the frank portrayal of lesbian relationships. Others have & will comment on the latter, so I'll point out some of the other aspects of this fine film. The combination of comedy with personal tragedy poses difficult problems both for the writer & director; here they both succeed brilliantly. The three principals' performances are riveting. I particularly liked the ambiguity of Coral Brown's portrayal of Mercy Croft; watch her carefully in the tight closeups in the gay club, and notice how the down-turned mouth at times hides a hint of a self-satisfied smile. The cinematography deserves special mention. The use of colour is beautiful; I was reminded of \"The Umbrellas of Cherbourg\", but it never steps over the line into unreality. On the contrary, the alleys of London, the TV studio and above all the stairs and corridor of the flat are supremely realistic. Most unusual is the use of chiaroscuro, the interplay of light-and-shadow, seldom seen outside of black & white films. In so many colour films the light appears to come from some amorphous omnidirectional source out of science fiction; great for lighting everything and everybody evenly, but unrealistic and DULL. Look at the shadows as Beryl Reid ('George') enters the apartment building and climbs the stairs, or in some of the bedroom scenes. Apart from its other many virtues, this movie held my attention as a fine piece of film-making. All in all, a masterpiece; my one regret is that it was shown on TV in pan-and-scan. It IS now available in DVD - in several formats & regions - so I look forward to watching it again in its original form.",
         "June Buckridge (Beryl Reid) plays a character named Sister George on a popular TV show. She gets word that her character is going to be killed and panics. She is also a lesbian and her relationship with her lover (Susannah York) is falling apart. Network executive Mercy Croft (Coral Browne) tries to help her...or does she? This movie has problems--it's way too long (almost 2 1/2 hours), has unlikable characters and is pretty depressing. Still it's very well-directed (I love the way the opening credits are done) and has three great performances. Reid had already been in the play on stage so she pretty much knew what she was doing. She's just great--you see her anger but also sympathize with her. York is very good as her lover. Browne is just superb as Mercy Croft. SPOILERS IN THE NEXT PARAGRAPH!!!! This was (for its time) pretty extreme. It was seen as a lesbian movie. In my opinion it really isn't. It's about an older woman whose behavior and attitude ends up destroying her. She just happens to be a lesbian. Still this was pretty raw for 1968. They shot the bar scenes in an actual lesbian bar in England and there was a sexual seduction in the movie that wasn't in the play. It's when Browne and York get together. York hated doing that scene and it shows. This got slapped with an X rating originally just for the subject matter alone. Director Robert Aldrich fought against that rating for years--he thought it deserved an R. It was re rated to an R in 1972. I remember it played here in Boston for months on end. Lines were around the block every night despite the rating. Still it was only a modest hit and quickly was forgotten. The stigma of the X rating still haunts this film which is too bad. No great masterpiece but worth seeing for the great acting by the three leads.",
         "While there is delicate humor here, as in the movie's satire on the twee reassurances and stereotyping of an English soap opera's portrayal of homely English village life, this movie is in the end an unsettling portrait of the human condition, of the ugliness, the uncontrollable and incendiary nature of our sexual and emotional longings and need. I spent years wanting to see this movie, if only because of its legendary nature and Coral Browne's presence in the cast, and it's nothing like what I imagined. Given the title and all the talk in books about scenes set in a dark and intense demimondaine world of lesbian bars, I pictured some sort of police procedural about lesbians being killed by a serial killer, a Sidney Sheldon-type story. Ostensibly a portrait of an aging actress's dying career, the heart of the picture is the competition among the characters for love, for the ruthless quest for success and the money and companionship that go with it. There is constant sado-masochistic emotional gamesmanship here, with characters playing roles that are alternately passive and active. One character pretends to be not much more than a slip of a girl and sits by and watches as others compete for her attentions. The sex scene in the movie, while ugly in the extreme, is vital to the film's message. (I'm amazed that this aired, even late at night, on Turner Classic Movies, so that I, thankfully, got a chance to see the movie.) Coral Browne's face, stripped of its mask of demure self-possession, exposing the animal (the monster?) that we all are at the core of our being--that's something to see. And unsettling. I'll never particularly care for Susannah York. She'll always strike me as a bit of an over-praised, over-successful relic of the 1960s, a kind of prissy relic, but what a film, even with some longeurs. And the towering--both literally and figuratively--Coral Browne: what a presence."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Palomar Pictures (I)",
         "Associates & Aldrich Company, The"
      ],
      "summaries": [
         "George lives with her lover, Childie and plays a cheerful district nurse in a BBC soap opera. However, her character is to be killed off, and George realises that the only other job she can get is the voice of a cow in a children's tv programme. Her life begins to fall apart as Childie has an affair with a predatory tv producer.",
         "\"Sister George\" is a BBC soap opera character who is \"killed off\" due to low ratings. The aging actress who portrays Sister George is a lesbian living with a childish middle-aged woman named Childie, who works in a factory when not playing with her doll collection. Conflict arises between the two lovers when the hard-nosed BBC female program director, who told George of her canceled part, also steals Childie away. As consolation for losing both her job and her lover, George is offered the voice part of a puppet cow in a new animated cartoon series."
      ],
      "budget": 0
   },
   "movielensId": 3333,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1968-09-01",
      "dvdReleaseDate": "2000-02-15",
      "directors": ["Robert Aldrich"],
      "runtime": 138,
      "movieId": 3333,
      "title": "The Killing of Sister George",
      "mpaa": "R",
      "actors": [
         "Beryl Reid",
         "Susannah York",
         "Coral Browne",
         "Ronald Fraser",
         "Patricia Medina",
         "Hugh Paddick",
         "Cyril Delevanti",
         "Sivi Aberg"
      ],
      "imdbMovieId": "0063185",
      "originalTitle": "The Killing of Sister George",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["tm0lbu3Gr3k"],
      "plotSummary": "When June Buckridge (Beryl Reid) arrives at her London flat and announces 'They are going to murder me', her long-time lover and doll-cuddling flat mate Alice 'Childie' McNaught (Susannah York) realises that things are going to change. For June is referring to her character 'Sister George', a lovable nurse she portrays in a popular daytime serial. To make matters worse, the widowed executive at the BBC responsible for the decision to kill off Sister George - Mercy Croft (Coral Browne) is also a predatory lesbian who is after Childie and will stop at nothing to get what she wants.",
      "tmdbMovieId": 54575,
      "avgRating": 3.30899,
      "releaseYear": "1968",
      "numRatings": 89,
      "posterPath": "/jtZcWwTNN2sAzAZ5pb1MZ6a4UI6.jpg"
   }
}