{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "blackmail",
            "id": 1936
         },
         {
            "name": "plastic surgeon",
            "id": 17972
         }
      ],
      "imdb_id": "tt0047127",
      "video": false,
      "title": "Jail Bait",
      "recommendations": [
         51146,
         94259,
         115039,
         32623,
         27263,
         70324,
         43846,
         24751,
         42186,
         46421,
         37380,
         132802,
         31678,
         27999,
         83413,
         48885,
         35543,
         42295,
         235746,
         111753
      ],
      "backdrop_path": "/dKG8pH3UmGigVMDhsbWknbCHCdQ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Inspector John",
               "gender": 2,
               "credit_id": "52fe445ac3a368484e01e4db",
               "name": "Lyle Talbot",
               "profile_path": "/gHbCftyesSSHRCEClOQUOVjISV8.jpg",
               "id": 34119,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Dr Boris Gregor",
               "gender": 2,
               "credit_id": "52fe445ac3a368484e01e4df",
               "name": "Herbert Rawlinson",
               "profile_path": "/anrUAfotPayegt9E2abjR6r315y.jpg",
               "id": 52176,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Lt Bob Lauwrence",
               "gender": 2,
               "credit_id": "52fe445ac3a368484e01e4e3",
               "name": "Steve Reeves",
               "profile_path": "/nl2VTxwmUjSgNz4uHkD3hSuEBDV.jpg",
               "id": 39162,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Marilyn Gregor",
               "gender": 1,
               "credit_id": "52fe445ac3a368484e01e4e7",
               "name": "Dolores Fuller",
               "profile_path": null,
               "id": 99126,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Don Gregor",
               "gender": 0,
               "credit_id": "52fe445ac3a368484e01e4eb",
               "name": "Clancy Malone",
               "profile_path": null,
               "id": 100347,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Vic Brady",
               "gender": 2,
               "credit_id": "52fe445ac3a368484e01e4ef",
               "name": "Timothy Farrell",
               "profile_path": null,
               "id": 100348,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Loretta",
               "gender": 0,
               "credit_id": "52fe445ac3a368484e01e4f3",
               "name": "Theodora Thurman",
               "profile_path": null,
               "id": 100349,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Night Watchman",
               "gender": 0,
               "credit_id": "52fe445ac3a368484e01e4f7",
               "name": "Bud Osborne",
               "profile_path": "/6WIxWcUlDvnILVj8yplY61fQJyG.jpg",
               "id": 34890,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Miss Willis",
               "gender": 0,
               "credit_id": "52fe445ac3a368484e01e4fb",
               "name": "Mona McKinnon",
               "profile_path": "/vzAlSqaeCHQacLv68kg6SAwUtfn.jpg",
               "id": 65498,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Detective Davis",
               "gender": 2,
               "credit_id": "52fe445ac3a368484e01e4ff",
               "name": "Don Nagel",
               "profile_path": null,
               "id": 100350,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Medical Attendant / Photographer",
               "gender": 2,
               "credit_id": "52fe445ac3a368484e01e503",
               "name": "Conrad Brooks",
               "profile_path": "/ccuggOAsOHthPN1kdhDbhH69Xwn.jpg",
               "id": 97824,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Radio News Announcer",
               "gender": 2,
               "credit_id": "52fe445ac3a368484e01e507",
               "name": "Edward D. Wood Jr.",
               "profile_path": "/8ZoVOGxMYwamLR3Unlkrq3rpSQ2.jpg",
               "id": 44763,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe445ac3a368484e01e4d7",
               "name": "Edward D. Wood Jr.",
               "profile_path": "/8ZoVOGxMYwamLR3Unlkrq3rpSQ2.jpg",
               "id": 44763,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "586fb0499251413375004400",
               "name": "Alex Gordon",
               "profile_path": null,
               "id": 117732,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "586fb053c3a3686dc40049ed",
               "name": "Edward D. Wood Jr.",
               "profile_path": "/8ZoVOGxMYwamLR3Unlkrq3rpSQ2.jpg",
               "id": 44763,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.029064,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 23020,
      "vote_count": 14,
      "budget": 0,
      "overview": "Don Gregor, the son of famous plastic surgeon Dr. Boris Gregor, begins to hang around with young criminal Vic Brady and carry a gun. The pair attempt an armed holdup, and when things start to go wrong Gregor accidentally kills a night watchman. Fearing that Gregor plans to turn himself in, Brady kills him and blackmails Dr. Gregor into giving him a new face.",
      "similar": [
         30159,
         4771,
         320,
         3597,
         1645,
         9445,
         521,
         910,
         4723,
         109099,
         403642,
         9769,
         2048,
         1427,
         4638,
         769,
         186,
         949,
         1586,
         9798
      ],
      "original_title": "Jail Bait",
      "runtime": 74,
      "poster_path": "/86UWXY0HXBW88TCUx3KkLSLH5d8.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Howco Productions Inc.",
         "id": 4166,
         "origin_country": ""
      }],
      "release_date": "1954-01-01",
      "vote_average": 3.6,
      "belongs_to_collection": null,
      "tagline": "Danger! These girls are hot!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Edward D. Wood Jr."],
      "runtime": 71,
      "synopsis": "When Marilyn Gregor (Dolores Fuller) is summoned to the police station late one night by Inspector Johns (Lyle Talbot) to bail out her brother Don (Clancey Malone) she is dismayed that there isn't a stronger force in his life. Don has taken up with career criminal Vic Brady (Timothy Farrell) and when they rob a theatre and kill a security guard Inspector Johns begins a wide search for Don with the idea that he still may be rehabilitated. Vic has alternative plans and coerces Delores' father, the plastic surgeon Doctor Gregor (Herbert Rawlinson), to change his looks so he can get away from the police. Doctor Gregor performs an impromptu operation and calls Inspector Johns to alert him. When Johns confronts Vic a shocking discovery is made and a shoot out threatens the life and happiness of the remaining family.",
      "writers": [
         "Alex Gordon",
         "Edward D. Wood Jr."
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0047127/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAxNDQ5MzE5NF5BMl5BanBnXkFtZTcwNTE0MjEzMQ@@._V1_SY317_CR10,0,214,317_AL_.jpg",
      "actors": ["Stars: Lyle Talbot, Dolores Fuller, Clancy Malone | See full cast and crew »"],
      "reviews": [
         "Yes, it's inept directing, bad acting, illogical continuity etc. etc. But it's fascinating! Everybody can do a cheap shot at Wood and repeat the degrading clichés but it is my impression that most people don't judge for themselves or play along for the ride. It's worth it. It is a fact that hallmarks of a \"good movie\" are: 1) it entertained you, 2) you remember it with enthusiasm. And it did both for me. The music was so bold and different and had everything to do with creating the atmosphere in the film. I really liked it because I felt it worked for it's purpose. It gave the film it's very own identity. I would anytime rather see an Ed Wood film than most of the Hollywood clichés poured out these days. I prefer Ed Wood for Steven Spielberg any day because you feel Wood does it for his own sake, not just to please the lowest denominator.",
         "First of all, let me say that the title Jail Bait has to do with a gun and not under-age sex. This is one of Ed Wood's classics. Yes, it's horrible and the movie is so cheap it's funny. However, it's not as \"good\" as Plan 9. Things to watch for: The doctor's office. His desk is huge. When ever anyone wants to sit down, the have to squeeze between a plant and chair. The music - it's horrible and ALWAYS playing. Even when someones parking a car the suspenseful guitar music begins strumming. The doc performs plastic surgery in a guys living room! On his couch! At gun point! Steve Reeves first movie - he takes his shirt off to prove it's him. Worth the rental. The scenes in the theater (with the exception of a horrible and really kind of shocking black-face act thrown in for no reason at all) made me laugh out loud.",
         "As most of the movie lovers, I discovered Ed Wood after watching Tim Burton's \"Ed Wood\", and since then, I try to see all his movies. I have just watched \"Jail Bait\", his attempt to make a serious film-noir, and I really laughed along its 72 minutes running time. The first points that call the attention in \"Jail Bait\" are the ham actors and actresses, and the awful lines. The cast seems to be amateurish, and the screenplay seems to be written by a stupid teenager so ridiculous and silly the dialogs and situations are. The next point to attract me was the beauty and elegance of Theodora Thurman, in the character of the lover of the gangster Vic Brady. Another point is that it is always night along the story. The annoying music score is probably one of the worse I have ever listened in a movie. The funniest parts, in my point of view, are the arrival of Lt. Bob Lawrence to Dr. Boris Gregor's house: from the outside, the lights are turned-off, but when Marilyn Gregor opens the door, the lights are on; the death of Don Gregor is simply hilarious; and what about the surgery of Vic Brady in a sofa? This movie certainly is predictable, laughable, absurd, funny, but it is also absolutely cult. My vote is four. Title (Brazil): \"Jail Bait \u0096 A Face do Crime\" (\"Jail Bait \u0096 The Face of the Crime\")",
         "'Jail Bait', directed by the legendary Ed Wood, is an enjoyably bad attempt at Film Noir on a shoestring budget. The cast includes Lyle Talbot, Dolores Fuller and Timothy Farrell from Wood's classic 'Glen Or Glenda', as well as a very early appearance by Steve Reeves. Talbot once again plays a kindly cop, but this time Farrell is on the other side of the law, the nasty Vic Brady. Brady has corrupted Fuller's brother Don (Clancy Malone) the middle class son of a world renowned plastic surgeon Dr. Boris Gregor (Herbert Rawlinson). We first see Don being bailed out by his sister Marilyn (Dolores Fuller) after being caught carrying an unlicensed firearm. Despite his sister's concern and a stern lecture from Ins. Johns (Talbot), he continues to associate with small time crook Vic Brady. A robbery gone wrong results in the death of a Night Watchman. Don's conscience gets the better of him and he intends to give himself up, but Brady has other ideas... ideas which involve Dr. Gregor's skills as a plastic surgeon. The combination of Wood's trademark lousy dialogue and the stilted performances of the actors (especially Malone and Fuller) with Farrell's hammy Vic Brady and the nutty denouement make 'Jail Bait' a lot of fun to watch.",
         "Last night I decided to watch Ed Wood's crime film, \"Jail Bait.\" Now, much like Wood's other films, the storyline, acting, direction, music and just about everything else are completely weak. However, I thoroughly enjoyed it. The acting is enjoyable because it's so bad that you have to laugh. I would recommend this film to anyone looking for a good time. Plus, the twist actually impressed me. I did not see it coming. A lot of people like to go on about how Ed Wood is the worst director of all time, but how can this be when he's made movies that so many people have enjoyed? Sure, they're awful movies, but he's done his job and entertained us. That's all I ask for.",
         "This movie is basically about a son of a famous plastic surgeon who causes trouble by carrying a gun and eventually ends up killing somebody when he was with his partner in crime. Obviously, his family becomes worried about him. Another one of those \"rich kid gone bad\" stories. Basically, all the acting in this movie is bad except for some detective. Delores Fuller stars as the kid's brother, and she had a pretty bad performance (at least she's good looking, though,) But still, the bad acting adds to the unintentional humor you will find with this. Also, Timothy Farrell stars as partner in crime Vic Brady, and his performance is the funniest especially after he says lines like \"let's unwraps the Christmas presents and see the presents inside.\" (Tim would later star in a terrible movie, The Violent Years, another \"rich kid gone bad story\") Other lines include \"plastic surgery can be strenuous and very, very complicating\" and \"carrying a gun can be dangerous business, miss.\" Other humor in this film are included in the scenes themselves. When you see the two thieves robbing a safe, you will see a picture of a gingerbread man on the wall for absolutely no reason. In addition, you'll also see a stupid dance sequence (I saw the director's cut) You should also watch out for this annoying guitar theme that is played throughout the entire movie. My overall opinion though is that this is an entertaining movie because it was so bad (not to mention the obvious ending) It really didn't bore me as much as other trash flicks. It also should be watched since the director ,Ed Wood, is only known for Plan 9, Glen or Glenda, etc. You should really check this out if you're in the mood for something different.",
         "Not as well-known as Wood's notorious 'horror' output but this truly lamentable attempt at a film noir - demonstrating, if only in its ramshackle production values, an affinity with the cinema of Orson Welles and Edgar G. Ulmer - is at least equally inept and hilarious, if still emerging as perhaps his most tolerable effort! It's practically a manual on how NOT to make a noir: despite a generous dose of hard-boiled - yet godawful - dialogue (particularly in the scenes depicting the gangster's constant bickering with his moll), the film has absolutely no sense of atmosphere, a headache-inducing and inappropriate score, an irrelevant musical number (in blackface, to boot!) and some of the worst, most amateurish acting you're ever likely to see! Perhaps the main culprit in this regard is elderly Herbert Rawlinson (who, amazingly, kept working on such rubbish when he was dying of lung cancer and, in fact, kicked the bucket a day after production wrapped!) as an eminent surgeon who has to contend with a delinquent son; the latter gets embroiled in armed robbery and murder and is subsequently killed by his associate, after the surgeon persuades him to give himself up to the Police. However, the gangster blackmails the old man into doing a makeshift job of plastic surgery in order to avoid capture - but, in perhaps the most uproarious scene of the entire film, the doctor discovers his son's corpse in the gangster's kitchen, without so much as a reaction, and decides to turn the tables on him. While not unpredictable, I must say that the twist ending works...but, unfortunately, the TV reception got screwed up during the last few minutes of the film, so I missed out on some of the details! By the way, the younger of two cops who tail Rawlison's son throughout the film is none other than future peplum icon Steve Reeves in his film debut - and he looks as uncomfortable in a suit and tie as Chuck Heston!!",
         "In \"Jail Bait\", Ed Wood applies his boundless enthusiasm and limited talent to the crime movie genre. From a technical viewpoint, it's actually one of his less unsound features, although that cuts down somewhat on the unintentional laughs that it provides. The story is actually pretty solid, and could have served as the basis for a pretty good film-noir. Most of its weaknesses are in the acting, pacing, and dialogue, plus the occasional zany out-of-place detail. The story uses a basically familiar setup, but adds a couple of extra components to it. Lyle Talbot and Steve Reeves play a pair of policemen investigating the misdeeds of a young man whose father is a highly respected doctor. The doctor and his daughter, meanwhile, try to protect the son both from the police and from the career criminal who has led him astray. For the most part, the story is conventional but believable, with a rather clever ending. Most of the rest of the production does not come up to the level of the story. The ever-loyal Talbot gives his typically earnest performance, trying to make the dialogue sound as good as possible, while enduring some amusingly awkward interactions with the stilted Reeves. The rest of the cast is generally nondescript, and sometimes noticeably out of their depth. The dialogue contains some of the expected unintentional laughs, and the characters often overexert themselves on unnecessary exposition or on pointing out details that were already completely obvious. The pacing, likewise, is inconsistent from scene to scene, although with fewer of the kinds of direction and editing slip-ups that generally characterize Wood's features. No one could ever deny that Wood loved making movies, and he made sincere efforts to make them as well as he could, which is what has kept his movies so watchable despite their shortcomings. \"Jail Bait\" attempts to emulate the classics of its genre, but it is severely limited by the lack of talent and other resources.",
         "People who criticize this picture and its director are missing the point. The movie is the equivalent of a badly produced school play. And that's just the point, the parents who go to see a school play do not go for the acting, directing or any other professional artistic endeavor but for the pure enjoyment of seeing their loved ones on stage. Ed Woods was in love with the movies and no matter what people thought about him and his films he just got pure enjoyment out of making them; and that after all is what entertainment is all about.",
         "Oh my God, where does one even start! This is probably the most overtly 'serious' film that you'll ever see and die laughing in the process. Instead of celluloid, legendary director Ed Wood used cardboard to film this extravaganza, and it's my contention that anyone who's ever seen a movie MUST watch this flick! On the surface, the plot seems reasonable enough. The adult son of a respected plastic surgeon falls into a life of crime and winds up killing a former cop while pulling off a payroll heist with his mentor, small time hood Vic Brady (Timothy Farrell). Virtually everything else is window dressing for shabby sets, grammar school stage play acting and cheap dialog. But Oh, what dialog! My favorite examples: Brady kills Don Gregor; his girlfriend moll Loretta (Theodora Thurman) exclaims - \"Maybe you shouldn't have done that!\" Or how about when Loretta has her moment of doubt about Brady and threatens to leave. Brady - \"I didn't set you up in all this luxury just to have you walk out on me.\" LUXURY!!! A living room with a chair and couch!! The picture even takes it's name from a line from Don Gregor's sister Marilyn (Dolores Fuller), admonishing her brother about his association with Brady - \"You know that gun is jail bait!\" On top of that, did you ever expect to see the future Hercules in this flick? Almost unrecognizable without a beard and loin cloth, Steve Reeves teases the audience with a quick upper torso shot while putting on a shirt, which made me think, what was he doing with his shirt off in the police chief's office? - he was already at work! See what I mean? Oh, and don't let me forget the scene where Miss Willis ID's Brady and Gregor as the two who held up the theater and killed the night watchman. Inspector Johns (Lyle Talbot) has only two pictures of possible suspects to show her, and they're the right ones!!! Amazing! But man oh man, you just had to see it coming! When Brady blackmails Doc Gregor for a facial do-over, you just HAD to know how it would all come out. That ending was the 'Twilight Zone' on acid, especially if you kept a sharp eye on Brady/Gregor's facial scars. The first time the bandages come off, the scar on his forehead runs diagonal from the top of his nose to well above the eye. However when he's shot by the pool, the scar runs laterally across the middle of his forehead. The perfect ending to an Ed Wood masterpiece! Through it all you had just the perfect musical accompaniment, what with the strumming Mexican guitar background. You know, in thinking about it, the only thing that could have made this picture more bizarre would have been the inclusion of a night club comedy routine done in black face. Oh... wait a minute!"
      ],
      "genres": [
         "Crime",
         "Film-Noir",
         "Thriller"
      ],
      "productionCompanies": ["Howco Productions Inc."],
      "summaries": ["Vic Brady draws young Don Gregor into a life of crime. He then blackmails Gregor's plastic surgeon father into fixing up his face so he can evade the cops."],
      "budget": 0
   },
   "movielensId": 3335,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1954-01-01",
      "dvdReleaseDate": "2000-02-15",
      "directors": ["Edward D. Wood Jr."],
      "runtime": 74,
      "movieId": 3335,
      "title": "Jail Bait",
      "mpaa": "",
      "actors": [
         "Lyle Talbot",
         "Herbert Rawlinson",
         "Steve Reeves",
         "Dolores Fuller",
         "Clancy Malone",
         "Timothy Farrell",
         "Theodora Thurman",
         "Bud Osborne",
         "Mona McKinnon",
         "Don Nagel",
         "Conrad Brooks",
         "Edward D. Wood Jr."
      ],
      "imdbMovieId": "0047127",
      "originalTitle": "Jail Bait",
      "genres": [
         "Action",
         "Crime",
         "Thriller"
      ],
      "youtubeTrailerIds": ["BxNtVrsdIUo"],
      "plotSummary": "Don Gregor, the son of famous plastic surgeon Dr. Boris Gregor, begins to hang around with young criminal Vic Brady and carry a gun. The pair attempt an armed holdup, and when things start to go wrong Gregor accidentally kills a night watchman. Fearing that Gregor plans to turn himself in, Brady kills him and blackmails Dr. Gregor into giving him a new face.",
      "tmdbMovieId": 23020,
      "avgRating": 2.44444,
      "releaseYear": "1954",
      "numRatings": 72,
      "posterPath": "/86UWXY0HXBW88TCUx3KkLSLH5d8.jpg"
   }
}