{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "german occupation",
         "id": 9905
      }],
      "imdb_id": "tt0055024",
      "video": false,
      "title": "It Happened Here",
      "recommendations": [
         24041,
         46614,
         26252,
         28916,
         48599,
         68440,
         20372,
         43691,
         43031,
         26205,
         560,
         46492,
         86059,
         20362,
         49805,
         23620,
         44190,
         43117,
         43306,
         17660
      ],
      "backdrop_path": "/qcwCmZ7RPzbF8jACyjBoNAQivtm.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Pauline",
               "gender": 0,
               "credit_id": "52fe4890c3a36847f816e39b",
               "name": "Pauline Murray",
               "profile_path": null,
               "id": 1061538,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Doctor Richard Fletcher",
               "gender": 0,
               "credit_id": "52fe4890c3a36847f816e39f",
               "name": "Sebastian Shaw",
               "profile_path": "/j6SFQiU0isXWNfMK6Cq4XQPdJDl.jpg",
               "id": 28235,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Skipworth",
               "gender": 0,
               "credit_id": "52fe4890c3a36847f816e3a3",
               "name": "Bart Allison",
               "profile_path": null,
               "id": 202198,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 0,
               "credit_id": "579670cbc3a3680d18000c90",
               "name": "Reginald Marsh",
               "profile_path": null,
               "id": 1218554,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4890c3a36847f816e391",
               "name": "Kevin Brownlow",
               "profile_path": "/2SI8QTnTVgxfH5DSQnaHTmpTzog.jpg",
               "id": 228856,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4890c3a36847f816e397",
               "name": "Andrew Mollo",
               "profile_path": null,
               "id": 1061537,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4890c3a36847f816e3a9",
               "name": "Kevin Brownlow",
               "profile_path": "/2SI8QTnTVgxfH5DSQnaHTmpTzog.jpg",
               "id": 228856,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4890c3a36847f816e3af",
               "name": "Andrew Mollo",
               "profile_path": null,
               "id": 1061537,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "War",
            "id": 10752
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.865067,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 54195,
      "vote_count": 10,
      "budget": 0,
      "overview": "It is the Second World War. The Nazis have invaded Britain. There is a split between the resistance and those who prefer to collaborate with the invaders for a quiet life. The protagonist, a nurse, is caught in the middle.",
      "similar": [
         15383,
         497916,
         46799,
         116477,
         154972,
         191085,
         425927,
         383980,
         270887,
         15121,
         16869,
         5925,
         783,
         853,
         2253,
         613,
         637,
         11046,
         409,
         387
      ],
      "original_title": "It Happened Here",
      "runtime": 93,
      "poster_path": "/ea8dckRzJTiZdaxnehYhIhaKPx0.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [],
      "release_date": "1966-05-01",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "The Story of Hitler's England",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": [
         "Kevin Brownlow",
         "Andrew Mollo"
      ],
      "runtime": 93,
      "synopsis": null,
      "writers": [
         "Kevin Brownlow",
         "Andrew Mollo"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0055024/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI2OTYwMDM0MF5BMl5BanBnXkFtZTcwNzY1MDIyMQ@@._V1_SY317_CR10,0,214,317_AL_.jpg",
      "actors": ["Stars: Pauline Murray, Sebastian Shaw, Bart Allison | See full cast and crew »"],
      "reviews": [
         "The film sticks tenaciously in the memory, in a way that slick studio productions often fail to do. Visually, a fair bit of the film is a pastiche of German propaganda newsreels, or borrows from that library of pictures. This augments the feeling of realism and makes it an even bigger shock to see German troops marching through London, or relaxing off-duty, taking in the sights and admiring the women. No studio film would dare to take such an approach. And where did they find so much genuine-looking equipment? No studio film-researcher would ever be that scrupulous about accuracy. The sound-recording is dreadful and it would benefit from one of those clever clean-up jobs that are available these days. But what is said, and how it's said, are unforgettable. The wrong-headed justifications of Fascism that pepper this film sound like real people's words and they're spoken by what clearly are real people, who are taking a little time off from their real jobs to appear in the film. For instance, the fat, middle-aged, bureaucratic bully who voices many of the arguments has to have been in real life a school teacher or a bank manager: he looks and sounds the part in a way that studio actors working from a polished script could never manage. The ending is forced, but only because you feel that the film would be endless without a forced ending. Although a lot of things take place that are genuinely shocking (I won't list them as I'd have to announce spoilers), the point of the film isn't to relate a narrative that has a defined beginning, middle and end. The point is to make you feel that this is all real and make you wonder what your response would have been if the Nazis had started running your country.",
         "Ignore Leonard Maltin's comments - he's clearly missed the point of the film. The \"Brits\" don't keep a stiff upper lip, and the cooperation between them and the Nazis is shocking. The documentary footage of Nazi soldiers parading around London etc appears ever so real. The awesome photography makes up for the weak plot and main character. A must-see. The Battle of Algiers is another such film which mixes documentary with drama.",
         "This film was shown recently as part of the Channel 4 War Weekend. I found it to be well made, and contained some very powerful images, of the German forces in occupation. My only reservation is that I found it difficult to track the passage of time within the film. The film deals with a woman, who is relocated to London, following Partisan activity at her home village. She becomes a Collaborator, not particularly from choice, but from circumstance. She is faced with a simple choice: work for the state, or don't eat. The film presents the Partisans as terrorists, whose methods differ little from the Nazis, although their objectives are purer. The film certainly made me think more about the life of the civilian in occupied territory. You could become a partisan, and act as a terrorist, or work for the forces of occupation, either directly, or indirectly. Or you could starve. Well, what would you do?",
         "`It Happened Here' Directed by Kevin Brownlow and Andrew Mollo is a Classic of British Cinema. The Film is remarkable in its authenticity, given the fictional scenario, the invasion of Britain by the Nazis during World War Two. The look of the Picture is very raw and earthy which adds to its realistic style. The German soldiers look perfect, I say this because it is so rare that Directors make such a concerted effort for perfection. Andrew Mollo and Kevin Brownlow are two of the most talented and unrecognized Directors in Britain. This Film is an example of the best of British Independent Film making and should be seen.",
         "'It Happened Here' is the only British war film which gives a true and accurate idea of what war is about: it is about civilians. All war films, with the exception of this one and a tiny handful of others, deal with boys in their uniforms shooting at each other in glorious Technicolour. The army obey codes of engagement and the goodies win. We identify with the heroes and frown at the villains, we feel sad when the second-stringer dies and exhilarated when the actor with the comic role survives, and so on. Civilians have no such luxury under occupation. This film deals with the dilemmas of surviving. with having to collaborate to a varying extent in order to earn a living, in fact with the real dilemmas which only those who lived through the Nazi occupation can truly understand. Collaboration is a slippery slope, well handled in the film as it is too in the French film 'Lacombe Lucien', where a feckless young man, rebuffed by the resistance, slips almost accidentally into collaboration for a bit of an adventure and some status. A recent article in the London press explained that the lengthy disquisition on the necessity of fascism in occupied Britain, as voiced by an English militiaman in the film, was in fact a pro-fascist argument put forward by a real leading British fascist, who made use of the film to expound his views. Within the context of the film, the views are seductively subversive and dangerously convincing. Think Goebbels when he presented the war against Russia as a European effort to eliminate the Bolshevist menace. This argument appealed to many 'right-thinking' people in occupied Europe as, barely a couple of years after the war, many right-thinking people thought that the communist menace should be eliminated. As a result of the filmed fascist diatribe, United Artists ordered Brownlow to remove this section (6 minutes, I think) and the film was originally screened without it. When the resistance to foreign occupation in Iraq is labelled terrorism, well, that is exactly what the German occupiers said about all resistance movements in Europe. Resistance movements included brigands, double-agents and ruthless operators as well as heroes. At the end of the war, these movements settled scores with collaborators and presumed collaborators, with unofficial executions running into the tens of thousands. Nothing wrong then, in having the British resistance in this film shown as behaving mercilessly. That is what real war is about and if we can't identify with it, then so much the better for those of us who never had to identify with an armed occupation either.",
         "What's most amazing about this film is that it was made by teenagers and looks good even for being shot in 16mm. Seeing Nazis goose-stepping in front of various UK landmarks and is pretty upsetting and totally convincing. The narrative loses a lot of steam after an hour (I think this film was expanded from a short) but the faked newsreel shown in a cinema halfway through the movie is totally flawless in its imitation of German propaganda films.",
         "Being a Londoner, and born but a few months after England declared war on Germany, this film has always held a special significance for me. I originally saw it when it opened in London: a mere twelve years after the worst war in living memory, had ended. I saw it for the second time recently at a friend's house. To me, it is still the best film about the occupation of a country by a foreign army. In his book, \"How It Happened Here\", co-director, Kevin Brownlow explains how he got the idea to make this film. He just happened to be walking down a London street, at the moment when a car screeched to a halt outside a shop. Four or so heavyset men piled out of the car. They were dressed, recalls Brownlow, in grey overcoats in a style reminiscent of Russian KGB agents. All were bulky and acted in a furtive manner. It got Brownlow thinking: \"what if.....\" On a budget that can only be described as miniscule, it took Brownlow and his co-director, Andrew Mollo, eight years to complete the film. It's shot in a quasi-documentary style, which makes it even more realistic. Their attention to detail is amazing considering the paucity of funds available - every uniform the actors wore was sewn by Mrs. Mollo. While I can't claim to personally 'remember' those years when London was bombed constantly, I can recall the sound, or should I say lack of it (we were all inside a bomb shelter), when a German V-2 rocket (nicknamed a doodle-bug), ran out of fuel and plummeted to the ground. We were lucky: it landed but a few streets away, killing many, many people, breaking windows, shaking chimneys and covering all our possesions in a thick layer of soot!",
         "Must have been 1967 when I was based at High Wycombe and often went to London for the day. The film was released during this year and wandered into the cinema. The title and posters intrigued me and I was just killing time. I was amazed at how realistic this film portrayal was and how quiet the cinema was, not a sound from start to finish. The way ID cards/papers were used, the attitude of some people that collaborated, and the resistance starting to fight back, it was just brilliant. I'd love to see it again,let's hope it is screened on TV but I don't remember seeing it on TV to date, unless it was during the 80's when I was working abroad.",
         "A thought-provoking war drama, which began life as the spare-time project of an 18-year-old film-lover and his 16-year-old friend. Almost an amateur film, but intellectually spell-binding. Based on the counter-factual premise that Britain was successfully invaded following the Dunkirk retreat and liberated by the Americans at the end of World War II. The images of London streets thronged with German soldiers are unforgettable. It is a film concerned with what war and military occupation does to people's minds. Nightmarish, stomach-churning. You owe it to yourself to see this film. Cannot recommend too highly. (Please take a look at my slightly longer review under \"Newsgroup Reviews\")",
         "yes this was a fine example of 'what if'. It certainly makes you think about how it might have been had Hitler succeeded. The book 'How It Happened Here' is due to be re-issued with a revised content and updates. The new book 'How It Happened Here' should be out in August but check availability on amazon or at the publishers website ukapress.com The DVD for this film is also available now with a great review on dvdtalk.com http://www.dvdtalk.com/dvdsavant/s100here.html In all, it's a film that hasn't had enough exposure. The concept is frightening and the idea should be bought back into the mind of a new generation. It is horrifying to think how close England came to being ruled by an unspeakable dictator."
      ],
      "genres": [
         "Drama",
         "Sci-Fi",
         "War"
      ],
      "productionCompanies": ["Rath Films"],
      "summaries": ["It is the Second World War. The Nazis have invaded Britain. There is a split between the resistance and those who prefer to collaborate with the invaders for a quiet life. The protagonist, a nurse, is caught in the middle."],
      "budget": 20000
   },
   "movielensId": 3336,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "1966-05-01",
      "dvdReleaseDate": "2000-02-15",
      "directors": [
         "Kevin Brownlow",
         "Andrew Mollo"
      ],
      "runtime": 93,
      "movieId": 3336,
      "title": "It Happened Here",
      "mpaa": "",
      "actors": [
         "Pauline Murray",
         "Sebastian Shaw",
         "Bart Allison",
         "Reginald Marsh"
      ],
      "imdbMovieId": "0055024",
      "originalTitle": "It Happened Here",
      "genres": [
         "War",
         "Drama"
      ],
      "youtubeTrailerIds": ["UibKJl6ByDA"],
      "plotSummary": "It is the Second World War. The Nazis have invaded Britain. There is a split between the resistance and those who prefer to collaborate with the invaders for a quiet life. The protagonist, a nurse, is caught in the middle.",
      "tmdbMovieId": 54195,
      "avgRating": 3.06,
      "releaseYear": "1966",
      "numRatings": 25,
      "posterPath": "/ea8dckRzJTiZdaxnehYhIhaKPx0.jpg"
   }
}