{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "space travel",
            "id": 3801
         },
         {
            "name": "history",
            "id": 9682
         },
         {
            "name": "apollo s",
            "id": 33786
         }
      ],
      "imdb_id": "tt0097372",
      "video": false,
      "title": "For All Mankind",
      "recommendations": [
         381024,
         131478,
         124,
         117406,
         271707,
         99877,
         18727,
         45802,
         121703,
         123772,
         27999,
         16410,
         57976,
         50034,
         36883,
         38721,
         38432,
         35017,
         16902
      ],
      "backdrop_path": "/se3ng0mOsk2kKzljDUAY4mjziQm.jpg",
      "revenue": 770132,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jim Lovell",
               "gender": 2,
               "credit_id": "52fe43e6c3a368484e004b47",
               "name": "Jim Lovell",
               "profile_path": "/t4hYI7BFm4kPbQ0NTDEglelxMjR.jpg",
               "id": 7852,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Russell Schweickart",
               "gender": 2,
               "credit_id": "52fe43e6c3a368484e004b4b",
               "name": "Russell Schweickart",
               "profile_path": "/dLCjS0RvRrCjd8IkfJM9ZDJnZbf.jpg",
               "id": 106838,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Eugene Cernan",
               "gender": 2,
               "credit_id": "52fe43e6c3a368484e004b4f",
               "name": "Eugene Cernan",
               "profile_path": "/fVLuT16rvpoLFQ2cwOTPBWqat57.jpg",
               "id": 106839,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Michael Collins",
               "gender": 2,
               "credit_id": "52fe43e6c3a368484e004b53",
               "name": "Michael Collins",
               "profile_path": "/eFUH0V446r7xBn8m1FyvjlJo82T.jpg",
               "id": 106840,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Charles Conrad",
               "gender": 2,
               "credit_id": "52fe43e6c3a368484e004b57",
               "name": "Charles Conrad",
               "profile_path": null,
               "id": 106841,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Richard Gordon",
               "gender": 2,
               "credit_id": "52fe43e6c3a368484e004b5b",
               "name": "Richard Gordon",
               "profile_path": null,
               "id": 106842,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Buzz Aldrin",
               "gender": 2,
               "credit_id": "52fe43e6c3a368484e004b5f",
               "name": "Buzz Aldrin",
               "profile_path": "/gUuAUCEAR3ut3ZX1a5iiz5tegk0.jpg",
               "id": 106843,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "John Young",
               "gender": 0,
               "credit_id": "52fe43e6c3a368484e004b63",
               "name": "John Young",
               "profile_path": null,
               "id": 106844,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43e6c3a368484e004b69",
               "name": "Al Reinert",
               "profile_path": null,
               "id": 7854,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "57103290c3a3684ff1002ba1",
               "name": "Brian Eno",
               "profile_path": "/1XPKGMXbR2F5UhKPTX79TfhpTF4.jpg",
               "id": 37317,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "5a7c1a469251414b1f00b2c9",
               "name": "Susan Korda",
               "profile_path": null,
               "id": 1974480,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5a7c1a5e0e0a2632f900c787",
               "name": "Betsy Broyles Breier",
               "profile_path": null,
               "id": 1974481,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5a7c1a72c3a3680f8c00b2c8",
               "name": "Al Reinert",
               "profile_path": null,
               "id": 7854,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "History",
            "id": 36
         },
         {
            "name": "Documentary",
            "id": 99
         }
      ],
      "popularity": 2.609466,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 20423,
      "vote_count": 41,
      "budget": 0,
      "overview": "Directed by Al Reinert and with music scored by Brian Eno, \"For All Mankind\" provides a testament to NASA's Apollo program of the 1960s and '70s. Composed of actual NASA footage of the missions and astronaut interviews, the documentary offers the viewpoint of the individuals who braved the remarkable journey to the moon and back. While compiling the material for the film, Reinert went through more than six million feet of film of these historic moments.",
      "similar": [
         8077,
         62,
         2164,
         871,
         157336,
         348,
         698,
         841,
         330459,
         126889,
         2103,
         4437,
         676,
         947,
         76203,
         324786,
         374720,
         402897,
         2067,
         10679
      ],
      "original_title": "For All Mankind",
      "runtime": 80,
      "poster_path": "/7k8ylisWiEGxdRSlAf6v4PWiAjH.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Apollo Associates",
            "id": 19113,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "FAM Productions",
            "id": 19114,
            "origin_country": ""
         }
      ],
      "release_date": "1989-11-01",
      "vote_average": 8.3,
      "belongs_to_collection": null,
      "tagline": "From 1968 til 1972, twenty-four human beings went to the moon. Their journey lives as the ultimate adventure story.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Al Reinert"],
      "runtime": 80,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0097372/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BODE1MDIyNDUyM15BMl5BanBnXkFtZTcwNTc0MTk1Mg@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Jim Lovell, Kenneth Mattingly, Russell Schweickart | See full cast and crew »"],
      "reviews": [
         "I saw this film at a very, very young age and I suspect that it is the reason I developed a heavy interest in space exploration. I recently saw this again for the first time in many years since all I had was a vague recollection of it. And after watching many times since then I have no problem saying that this is one of the best documentaries ever made. One must give the film's director, Al Reinert, at a ton of credit for his work. Who else could have come up with the brilliant notion behind this film? Who would have thought of taking footage from all of the Apollo missions (and a couple of the Gemini missions) and combining them with the words of the men who went where no one had (or has since) gone before? (Apologies for paraphrasing Star Trek) The genius of this film is that it shuns away from traditional documentary styling. Instead of compiling facts on one mission and having a well known actor/actress do the narration, the film lets those who went tell the story. Who else is better qualified? They might not be professional actors, but the astronauts don't need to be. It is the power of the events they describe that is the main reason for their presence. They are a powerful voice in this story. In many reviews I have read, I have seen complaints about the mixing of footage or the use of footage out of its context (a Gemini reentry used for the TLI burn for example). Yes the mixing is nowhere near subtle and is, thus, blatantly obvious. But it is my feeling that this mixing was necessary. The only way to get across the story of Apollo's achievement to the average person was to mix the footage. Does it really matter in the end? I mean by that this: the film isn't about a single mission to the Moon. No, the power of Apollo lies not in each mission, but in the overall effect of the Apollo program. This film is about the journey of Apollo, the effect in had on the astronauts, and the effect it had on us all. If there is one element of this film that really stayed with men it was the music. It is among the most beautiful and haunting things you will ever here. Brian Eno does a marvelous job of conveying the mystery and majesty of both space and the Moon. This is one of those scores who really have to hear to believe. For All Mankind, perhaps better then anything else out there, demonstrates the power of humanity in space. For one to really appreciate this film it needs to be seen on a large screen in surround sound. Only then can one appreciate both the film and the power of the Apollo legacy. This is the first film I've seen that I recommend to everyone. This is a film that is truly \"For All Mankind\".",
         "I won't reiterate all of the praise of this film except to say that if I had just few more spare dollars when it was released on laserdisc, I would have bought a laserdisc player just for this title (and 2001). Fortunately years later I've already purchased a DVD player and For All Mankind has finally been released on that format. To me the defining moment of this film is the lunar lander slowly returning to the command module. At first we only see the cratered surface of the Moon moving below at incredible speed. Then we see a tiny motionless speck above it. Was it a defect in the lens? Of course not. It's the lunar lander slowly returning from the surface. It seems to take much longer than it really does because there are no cuts and no narrator explaining what we already know we're seeing. There's only a dot turning into a space ship. What more could you add to this amazing sight?",
         "Without repeating all the good comments that have been mentioned by earlier reviewers, I will add what is unique for me. 1. When Reinert wonderfully builds up the tension for the liftoff, it is more than a crescendo of power when those Saturn 5 rocket motors blast to life! I've had the film on VHS tape for about 10 years, and I still enjoy knocking the socks off of first time viewers when the surround sound system is allowed give its all as it shakes the house. If there were ice chunks on the outside of my house, they would surely shatter and fall just as they did from the rocket body as it slowly left the pad. UNBELIEVABLE! I once read that the Apollo rocket, if it all exploded at one time, would equal 80% of the Hiroshima atomic explosion in WW2. Imagine sitting atop that 31 story tall monster awaiting your fate on the launchpad. 2. Eno's music- just can't say enough superlatives about this soundtrack. Like good art, there is plenty there to continue to pique your interest for years. He is a gift to all mankind for his work on this soundtrack, but that is just the beginning. He's been doing that high level of work for decades! GREAT FILM!!!",
         "I taped this off British TV in 1989 or 1990, and could never understand why nobody I speak to has ever heard of it! Even real space enthusiasts have not seen or heard of this wonderful film. Even today it remains unavailable on DVD except in the USA (buy an import from Amazon, well worth it!). Quite simply there is no better way to tell the story of such a unique and special journey than in the words of those who undertook it. Here we have the live radio transmissions between the astronauts and Houston, reminiscences from the astronauts a decade or so after and no interference from any professional actor/narrator. There is footage even the most obsessed space enthusiast will not have seen, especially the 8mm film shot by the astronauts themselves. This film presents, in a mere 80 minutes, the story of the Apollo missions from pre-launch preparations though the journey, their time on the surface of the moon to the take-off from the moon and safe return to earth. The views are as majestic as any on the earth, all accompanied by soft and appropriately ethereal music. Why this hidden gem of a film is not constantly being broadcast on a documentary channel or even entertainment stations is totally beyond me - and also beyond those I have shared the DVD with. Seek out this film and watch it. As a friend said to me, \"why is it we can walk into any shop and buy row upon row of rubbish and we cannot buy this, which shows a real achievement of mankind\".",
         "I've been a fan of Brian Eno's work for years, and have cherished the album entitled \"Apollo: Atmospheres and Soundtracks.\" The album is the commissioned soundtrack for this compilation documentary of the NASA Apollo missions. What a harmony of the arts this is. The stark NASA footage coupled with the hauntingly soothing score create a fascinating marriage of techniques and styles. Although the music editor overused certain tracks over others, the subtlety of Eno's music prevents it from becoming repetitive. A pleasure to watch.",
         "The only thing I would criticize is that the movie is not longer! The music (I think Brian Eno composed it) fits well, quite ambient, never overpowering and helps take the viewer along with the astronauts. What a wonderful beginning, with President Kennedy's speech that the U.S. wants to reach the Moon.... And the words that follow are told only by the astronauts, not by some earth-based narrator that would over-dramatize without knowing what the experience of space travel involves. I've searched for this movie since I rented it on laserdisc years ago, and now I find it's being released in DVD! If you can buy it, it's worth purchasing.",
         "This was effective for this viewer. Usually what that means in cases like this is that it made me cry. The hook is that it reviews its subject through the eyes of the astronauts. I was wary of this. I got involved in the program later, during the beginning of the shuttle era and even then the astronauts were pretty much there only to have been taken there. They were chosen \u0097 some of them \u0097 for how good they looked on newsprint. The magic of the program and its heroes were a few visionaries and an army of competent engineers. Yet it was effective because we see the story through the eyes of witnesses. There role here is simply as witness, and if you were alive during this time, you will be impressed at how it affects you. There were all sorts of paths that could have been followed in this. The quest of man to explore; the mysteries of the unknown; the vast game being played by two enemies to demonstrate superiority of ideology; the hidden weapons programs. They cover all these slightly except that last, and that's excusable because these witnesses saw none of that. But the story that dominates is the Kennedy one. Its hard to imagine today, but we loved our president and he deserved it. He was intelligent and articulate. His advisers came off not as louts or bullies, but men (and a few women) smart enough for difficult times. He was the Peace Corps president. Kennedy promised to go to the moon and return without consulting anyone at NASA, and riding on the crest of a national enthusiasm for science and hardware. The nation really was engaged. And then he was killed, and with our rising self-doubt (Vietnam, race) we decided that as a people we owed it to him, or what he stood for. So when it happened, and the world watched, re affirmed the man and what he stood for. It was a good feeling, not pride as much as wonder about who we discovered ourselves to be. This will evoke that same feeling again, the original tears, followed by tears of disappointment at the massive collapse of esteem which followed. A serious of botched opportunities to be worthy of the accomplishment. Its an effective documentary in that regard, all the more so since everything was designed to be photographed, and was. If you really want to learn of this program, you need to go elsewhere, But this delivers on the promise. Ted's Evaluation -- 3 of 3: Worth watching.",
         "Nothing I can say could possibly do this documentary justice, but I'm going to try anyway. One of the greatest (in more than one sense) and most profound of human endeavors that has ever been undertaken is the effort at spaceflight. The most notable achievement is the landing and return of humans to the Moon. This documentary recaptures the awe and wonder I felt (and still feel today) when I watched the landing. Nominated for Documentary Feature, it should have won (or at least tied). As good as Common Threads was and is, for For All Mankind not to have won says more about the Academy and present-day society's fixation on now and its indifference to both yesterday and tomorrow. In a disposable society where creativity is less honored than timliness and for whom all too many, the past is what they had for breakfast, twenty years may as well be two thousand. Sic Transit Gloria (Thus Passeth Glory). Most, most highly RECOMMENDED!!!",
         "This movie is a very valuable resource regarding space education. As someone who works in the education field for the Hansen Planetatrium, we are always trying to interest the public in space sciences. Unfortunately, anyone who is 27 years old or younger has never seen anyone actually walking on the Moon. If it weren't for Apollo 13 most of the Elementary and Secondary aged kids wouldn't even know about the missions to the Moon. . Much less, the Gemini, Mercury, Altas, Skylab and other programs that preceded the Shuttle.",
         "I've always been a fan of space exploration (which incidentally helped fuel my star trek addiction, but that's another story) and this film is certainly very informative. Far be it for me to pontificate over this excellent and informative piece of film, go rent it instead. Or buy it even. Brian Eno's music adds a really effective other worldly atmosphere to this film. (I even went and bought the album! \"Apollo\" by Brian Eno if anyone's interested). You won't be disappointed."
      ],
      "genres": [
         "Documentary",
         "History"
      ],
      "productionCompanies": [
         "Apollo Associates",
         "FAM Productions"
      ],
      "summaries": [
         "This movie documents the Apollo missions perhaps the most definitively of any movie under two hours. Al Reinert watched all the footage shot during the missions--over 6,000,000 feet of it, and picked out the best. Instead of being a newsy, fact-filled documentary. Reinart focuses on the human aspects of the space flights. The only voices heard in the film are the voices of the astronauts and mission control. Reinart uses the astronaunts' own words from interviews and from the mission footage. The score by Brian Eno underscores the strangeness, wonder, and and beauty of the astronauts' experiences--experiences which they were privileged to have for a first time \"for all mankind.\"",
         "The film begins with President Kennedy's September 12, 1962 speech at Rice announcing the goal of going to the moon. The rest of the film, using NASA footage and the voices of Apollo astronauts, takes us on a voyage to the moon, from the donning of space suits to splashdown. Footage of the scientists and engineers in Houston is inter-cut with footage of blastoff, orbiting the earth, looking back at a receding earth from inside the space capsule, circling the moon, seeing its surface up close, landing, and scenes of the astronauts on the moon's surface. They bring music with them, announce football scores, test a theory of Galileo's, and reflect on the wonder of the experience.",
         "This documentary looks at the Apollo moon flight missions starting with Apollo 8. Showing only documentary footage, the voice-over isn't a narration per se but commentaries from the astronauts who flew the missions: on spaceflight, the moon itself and the emotions generated. The film doesn't follow the flights in sequential order which adds to the overall sense of awe and accomplishment."
      ],
      "budget": 0
   },
   "movielensId": 3338,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1989-11-01",
      "dvdReleaseDate": "2000-02-15",
      "directors": ["Al Reinert"],
      "runtime": 80,
      "movieId": 3338,
      "title": "For All Mankind",
      "mpaa": "",
      "actors": [
         "Jim Lovell",
         "Russell Schweickart",
         "Eugene Cernan",
         "Michael Collins",
         "Charles Conrad",
         "Richard Gordon",
         "Buzz Aldrin",
         "John Young"
      ],
      "imdbMovieId": "0097372",
      "originalTitle": "For All Mankind",
      "genres": [
         "History",
         "Documentary"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Directed by Al Reinert and with music scored by Brian Eno, \"For All Mankind\" provides a testament to NASA's Apollo program of the 1960s and '70s. Composed of actual NASA footage of the missions and astronaut interviews, the documentary offers the viewpoint of the individuals who braved the remarkable journey to the moon and back. While compiling the material for the film, Reinert went through more than six million feet of film of these historic moments.",
      "tmdbMovieId": 20423,
      "avgRating": 3.95382,
      "releaseYear": "1989",
      "numRatings": 314,
      "posterPath": "/7k8ylisWiEGxdRSlAf6v4PWiAjH.jpg"
   }
}