{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "chekhov",
            "id": 191826
         }
      ],
      "imdb_id": "tt0111590",
      "video": false,
      "title": "Vanya on 42nd Street",
      "recommendations": [
         43596,
         71125,
         47007,
         61280,
         1785,
         58416,
         79043,
         58098,
         148168,
         99657,
         63057,
         53408,
         40985,
         214952,
         42513,
         43344,
         80705,
         32716,
         14268,
         1940
      ],
      "backdrop_path": "/khiUd37ETJzVFVYTd3xigWg88ZL.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 12,
               "character": "Vanya",
               "gender": 2,
               "credit_id": "52fe44e09251416c9101fd4f",
               "name": "Wallace Shawn",
               "profile_path": "/oGE6JqPP2xH4tNORKNqxbNPYi7u.jpg",
               "id": 12900,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Yelena",
               "gender": 1,
               "credit_id": "52fe44e09251416c9101fd43",
               "name": "Julianne Moore",
               "profile_path": "/v2FcWGiiuvl6P7NV0966jNL09uh.jpg",
               "id": 1231,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Dr. Astrov",
               "gender": 2,
               "credit_id": "52fe44e09251416c9101fd47",
               "name": "Larry Pine",
               "profile_path": "/cVw0dH0MKSu6ckFuqkbQK4rNcRI.jpg",
               "id": 19511,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Sonya",
               "gender": 1,
               "credit_id": "52fe44e09251416c9101fd4b",
               "name": "Brooke Smith",
               "profile_path": "/fiR32HbDUWCZuRjdlknQMIyIsrw.jpg",
               "id": 31649,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Serybryakov",
               "gender": 2,
               "credit_id": "52fe44e09251416c9101fd3b",
               "name": "George Gaynes",
               "profile_path": "/cntFGEwxz14xvl8KXW2WXahpvS5.jpg",
               "id": 57351,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Maman",
               "gender": 1,
               "credit_id": "52fe44e09251416c9101fd37",
               "name": "Lynn Cohen",
               "profile_path": "/3YFzNPqr5CLw5oTovuKS43l4K6p.jpg",
               "id": 8792,
               "order": 5
            },
            {
               "cast_id": 5,
               "character": "Nanny",
               "gender": 0,
               "credit_id": "52fe44e09251416c9101fd33",
               "name": "Phoebe Brand",
               "profile_path": null,
               "id": 109471,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Waffles",
               "gender": 2,
               "credit_id": "52fe44e09251416c9101fd3f",
               "name": "Jerry Mayer",
               "profile_path": null,
               "id": 55459,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Himself",
               "gender": 2,
               "credit_id": "558d6117c3a3687bfc0004c7",
               "name": "Andre Gregory",
               "profile_path": "/cHrPNHXH3QhNqYd3UUETcHM1OlB.jpg",
               "id": 109470,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Mrs. Chao",
               "gender": 1,
               "credit_id": "59df0b4192514124eb09ace6",
               "name": "Madhur Jaffrey",
               "profile_path": "/6WXaJ42HWbqkWWrocVDDEIeAYnM.jpg",
               "id": 195399,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44e09251416c9101fd1d",
               "name": "Louis Malle",
               "profile_path": "/58db1ci6IPJ60hO6Cbbhfsc54H1.jpg",
               "id": 15389,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e09251416c9101fd23",
               "name": "Anton Chekhov",
               "profile_path": null,
               "id": 109469,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e09251416c9101fd29",
               "name": "David Mamet",
               "profile_path": "/gyEERG5App4yST1ivDc8t9JrsjP.jpg",
               "id": 1255,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e09251416c9101fd2f",
               "name": "Andre Gregory",
               "profile_path": "/cHrPNHXH3QhNqYd3UUETcHM1OlB.jpg",
               "id": 109470,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "59df0bc5c3a36861ec09c17e",
               "name": "Fred Berner",
               "profile_path": "/dTrIXqUTqtPnRDxe1roVVJG2UXp.jpg",
               "id": 72584,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "59df0bda9251412505098b23",
               "name": "Joshua Redman",
               "profile_path": null,
               "id": 196726,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "59df0be6925141252c0993a5",
               "name": "Declan Quinn",
               "profile_path": null,
               "id": 6117,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 1,
               "credit_id": "59df0bfec3a36861a309a373",
               "name": "Nancy Baker",
               "profile_path": null,
               "id": 51842,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.995806,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 32636,
      "vote_count": 20,
      "budget": 0,
      "overview": "An uninterrupted rehersal of Chekhov's \"Uncle Vanya\" played out by a company of actors. The setting is their run down theater with an unusable stage and crumbling ceiling. The play is shown act by act with the briefest of breaks to move props or for refreshments. The lack of costumes, real props and scenery is soon forgotten.",
      "similar": [
         3134,
         11564,
         281,
         133805,
         2142,
         22323,
         298312,
         8810,
         948,
         14433,
         12162,
         1359,
         4771,
         8923,
         97630,
         101,
         205,
         141,
         339692,
         281957
      ],
      "original_title": "Vanya on 42nd Street",
      "runtime": 119,
      "poster_path": "/ii4bqnfm5aW3TxqGh0tcxS8nijK.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/voYCwlBHJQANtjvm5MNIkCF1dDH.png",
         "name": "Sony Pictures Classics",
         "id": 58,
         "origin_country": "US"
      }],
      "release_date": "1994-09-13",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Louis Malle"],
      "runtime": 119,
      "synopsis": null,
      "writers": [
         "Anton Chekhov",
         "David Mamet"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0111590/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI3OTUyNDE5M15BMl5BanBnXkFtZTcwMTQwMzkyMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Wallace Shawn, Phoebe Brand, George Gaynes | See full cast and crew »"],
      "reviews": [
         "There's no shortage of intelligent work in film. But here we have one of the most complexly referential things I've ever seen. Simple self-reference points to itself. Common self-reference points to the viewer defining the experience. But Mingus used to say why have three threads when you can have seven? Here, some of the most adventurous thinkers in film give us four threads, actually four and a half. We have the Chekhov play and the Mamet wrapping. Make no mistake that this is not an editing or a translation, but an annotation. We have two perspectives simultaneously. Add to that the notion of the play not as a play for an audience as intended, but an event conducted regularly by the performers for their own sake. This is a creation orchestrated by Gregory, the third thread. One can clearly see in some scenes neither Chekhov nor Mamet but artists collaborating in dialogs. The inner eyes and the outer eyes differ. Fourth, we have Malle's creation which introduces us into the equation with deliberately shaky and sometimes misframed camerawork. We aren't part of any prior experience, but the actors do include the camera in their collaboration, as an independent thread. Watch how Andre works the camera. And finally, we have the framing of the artists in real life. This is not simultaneous with the others and in any case excludes the filmmaker. I recall seeing Paul Newman in the Color of Money in the first scene, acting on three levels simultaneously. It took my breath away. Here, the purpose of the whole contrivance is to challenge the actors (and the viewers!) to participate in a jazz ensemble of acting where the layer of reality is constantly shifting. They chose Uncle Vanya as the base for a reason, because his evershifting foci of love and hate in pairs provide cues for levelshifting. Shawn really plays on this. His skill wasn't apparent to me on first viewing, especially in the first scenes, where all players are on stage and the non-focus actors have to be invisible. But on repeated viewings one can see his mastery, his shifting forehead! Maybe he could have been a Dostoyevsky. The two young women should be celebrated to the heavens for what they do together. I never believed so many giggles and gasps and stutters and excited silences could be so finely woven, tossed so lightly. This is really, really good stuff, very smart. So far as an intelligent construction you won't see a superior. I never expect to see four levels at once again in film at least centered in the acting.",
         "I might not have ever seen this terrific film if it had not been for walking into the wrong theater. I was supposed to see screening of \"A Night on Earth\" during a local film festival, but I ended up in the middle of a screening of \"Vanya on 42nd Street.\" I decided to stay and watch, not just because I had already seen \"A Night on Earth\" several times, but because I was curious when I saw Wallace Shawn & Andre Gregory on screen together in a film other then \"My Dinner with Andre.\" Don't be fooled and think that this film is simply a sequel to \"My Dinner with Andre,\" because it is far from it. What you have here is a screen version of the stage play \"Uncle Vanya\" by Anton Chekhov, but with a twist. The cast is doing a rehearsal of \"Uncle Vanya\" in a rundown theater in the middle of NYC, to an audience of the director (Andre Gregory) and a few others. The film also includes breaks in the play for stage direction (acting as an intermission for the cast) as well as initial dialogue before and after the rehearsal. This also includes an amazing opening scene in which we see all the actors walking down 42nd Street in NYC heading toward the theater (literally appearing out of the crowdedness of NYC). In addition to just seeing a fantastic version of \"Uncle Vanya,\" you get some of the best acting performances in some time. Julianne Moore (\"Boogie Nights\") gets top billing being the best known cast member, but the film features some of the best performances by Wallace Shawn (\"My Dinner with Andre\"), Brooke Smith (\"Series 7: The Contenders\"), Larry Pine (\"Dead Man Walking\"), George Gaynes (\"Police Academy\" films), and stage actress Phoebe Brand. Even though I only mentioned a few, the entire cast is fantastic. If you are in your local video store looking for something a bit unique, I highly recommend that you check out \"Vanya on 42nd Street\" for night of theater without leaving your house. 10/10",
         "Okay, okay. Now that I've got that out of my system, I can actually review the movie. Vanya on 42nd Street is pretty much a perfect film, just like its predecessor My Dinner With Andre. Both films have the same three cooperative creators, Andre Gregory, Wallace Shawn, and Louis Malle. Both these films have revolutionary structure. My Dinner With Andre is a film about two people who sit down to dinner and an extended conversation. Nothing else. For nearly two hours, two people talk, interrupted occasionally by a waiter delivering food. It is one of my favorite films, and only two films rival its depths that I can think of offhand, 2001 and Citizen Kane. All three of those films are so layered and have so many levels of interpretation that their value is priceless. Vanya on 42nd Street is a film about the first complete rehearsal of an English translation of the Anton Chekov play _Uncle Vanya_. The camera shows us actors acting on an undecorated stage with their street clothes on. And it pulls us in just as well as if we were sitting in the front row opening night (perhaps even more; I will explain why further down the page). I was entirely involved in the play throughout the whole film, and at one point Vanya (Wallace Shawn) grabs a cup which he wants to put water in. Emblazened on it: \"I <heart> NY.\" It yanked me out of feudal Russia in a heartbeat. It wasn't there on accident of course. The bright red lettering faces straight on towards the camera, and is in the very center of the picture. This cup is pure braggartry, screaming: \"THERE! You were entirely involved in something that was in no way real. Look just how well we are fooling you!\" Of course, it didn't take another second before I was completely absorbed with the play. About fifteen to twenty minutes later, at the end of act three, tears were streaming down my neck. Okay, now, my reason for my claim that I experienced this play better in this film than I could ever experience it in the front row of a professional production of it. My reason stems from my fundamental dislike of theater. When one is acting in a play, one must shout (or rather, as a theater teacher might correct me, Project!) for the audience to be able to hear you. People do not shout their deeply emotionaly words. They grumble them or murmur them or whisper them or moan them. Dialogue released in a groan or a grumble does not project all that well. Therefore, all dialogue in a theatrical setting has always seemed, well, phony. Also, the complex facial expressions are entirely lost on every person sitting in the aisles at a play. All except for the most pronounced and overwrought. The same goes for gestures. Gestures are not always large in normal human communication, but on stage they simply must be for them to be communicated. The actors in this film are so, so, so, so so so so good, especially in their facial expressions. You could never get a proper feel for them sitting beneath them in a playhouse. The medium of film allows subtlety, as little as that quality is used in most films. That is why I feel film is superior to the play. Well then, if I believe that plays are awful, and conversely, that films are great, then why don't I believe that _Uncle Vanya_ would have been easily adapted into film. Well, because it was written for the stage, I believe (though I'm not 100% sure why, I'll honestly say). To actually see these actors moving around inside a house, or, even worse (since it's not in the actual play), on a farm would have seemed unrealistic. Normally, plays just feel stagey when they're put to film. There have been few exceptions that I can think of. I can tell almost instantly, when a play is translated into film. The only really great film to be made from a play is Who's Afraid of Virginia Woolf?, easily one of the best films ever made. It never lacks the feel of a film. You can tell it was once a play, but it never feels like it has to be a play like Uncle Vanya would if it were adapted straight from play to film. I attribute most of Who's Afraid of Virginia Woolf?'s success as a film to the perfect acting and the superior cinematography by Haskell Wexler. The play to film thing even bothers me when it is Shakespeare. I have seen very few Shakespeare films adapted straight to film that have worked for me. Zafferelli's Romeo and Juliette was the best. But the two Shakespeare works on film which have really intrigued me are direct descendents of Vanya on 42nd: Looking for Richard (I cannot believe Al Pacino did not see Vanya) and Shakespeare in Love (okay, maybe this isn't directly inspired by Vanya). Both of those films place the play on an inner level of the film's overall plot, and thus they try to teach us the inner workings of the plays themselves and acting as an art on the whole. Anyway, since I am tired and no longer in control of my thoughts, per se, I will just say 10/10, goodnight everybody!",
         "I sympathise with the Russian poster who took exception with Mamet's tampering with Chekhov but I still admire this film a great deal. As a non-Russian and non-Russian speaker I have loved Chekhov since the time I was able to distinguish great writing from mediocre and I have always felt that no matter how fine a given translation I was still losing the occasional untranslatable nuance to which Russian speakers have access. Vanya is also one of my favourite Chekhov plays and I just wallowed in this wonderful version. It's magical the way that once inside the rehearsal space with the actors schmoozing Wally Shawn stretches out on a bench almost imperceptibly and Larry Pine asks Phoebe Brand casually how long they've known each other and unless you really know Chekhov you'd think this was just actor small-talk instead of the first lines in the play between the Doctor and Nanny,or, to put it another way, Malle has led us both artfully and seamlessly into the performance and then, having done so, he throws in a touch of the Brechts by deliberately reminding us we're watching actors acting and not people living. The first time he tips his glove is via Wally Shawn's cup which has I Love NY written on it then later Andre explains to the visitors (who, I suspect, have been planted there for just that purpose) that it's now a different time. The acting throughout is beyond praise and a wonderful high note for Louis Malle to end his career. 10 out of 10 going away.",
         "Malle's adaptation handles Tchekhov's notoriously difficult shifts in mood and context excellently, investing every scene and almost every word with an edge of ambivalence and frustration, and the performances are all first-rate. Moore in particular, from her first appearance in the film (which is without dialogue) to the final scene constructs a really intelligent performance as Yeliena, I feel, and she seems to cover the whole gamut of Yeliena's character from the giggly and superficial to the introspective. With all due respect to the American school this film could have descended easily into overwrought Tennessee Williams-esque Naturalism with lots of method-style spitting and uncomfortable truth. Instead the intellectual, spiritual dimensions of Tchekhov's play are always brought to the fore, in addition of course to Tchekhov's dark brand of humour, where the actors (particularly Julianne Moore) laugh through their tears and visa versa. Avoiding the common temptation of drawing out the play's anguished characters at a snail's pace, Malle also paces the film well, with an emphasis on lightness and subtlety of delivery - the result is both intellectually and emotionally satisfying.",
         "Chekhov's Uncle Vanya stripped down to its bare essentials when a group of New York actors rehearse in a decaying theatre with no set dressings or props but just their talent, accompanied by David Mamet's modern adaptation of the play. Off course it may be stagy but you fall under the actors spell and that's what it's all about.",
         "The idea of filming a play gets turned upside down as we see the players before and after the (rehearsal) performance, essentially as themselves. One remarkable scene shows the cast during intermission chatting with each other and audience members while munching on goodies from a caterer. It gives the experience of watching a play in an old, run-down theater, including comments from the director. The play itself is no less remarkable. Shawn is a gifted actor, one of the few who can bring his entire body into a role. The rehearsal atmosphere takes some getting used to - it's hard to tell when real life ends and the play starts. There are no costumes, little in the way of sets, but it all works because the performances are so compelling. And Chekhov's Uncle Vanya is surprisingly relevant 100 years after it was written.",
         "In New York, the cast of Anton Chekhov's \"Uncle Vanya\" rehearse the play in a dilapidated theater on the 42nd Street. The arrogant and selfish Professor Serybryakov (George Gaynes) is an elderly intellectual married with his gorgeous and younger second wife Yelena (Julianne Moore) that feels trapped in a prison with her marriage. They live in a farm that supports their lifestyle with the Professor Serybryakov's brother-in-law from the first marriage Vanya (Wallace Shawn), who manages the family business with Professor's daughter from his first marriage, Sonya (Brooke Smith), a plain single young woman and Vanya's mother. The local Dr. Astrov (Larry Pine) visits the family every day since he is in love with Yelena. She talks with him about his feelings for Sonya, but Astrov misunderstands and believes she is also in love with him. One day, Sonya confides to Yelena that she has an unrequited love for Dr. Astrov. When Professor Serybryakov discloses his intention of selling the real estate, there is a crisis in the family. \"Vanya on 42nd Street\" is a filmed rehearsal of Anton Chekhov's play \"Uncle Vanya\" by Louis Malle. The talkative story about frustrated lives, where every character wish to have a different existence, is surprisingly engaging since there are no costumes or scenarios, but excellent direction and performances. The beginning is a little boring, I agree, but give a chance to this movie and you will certainly have a great (favorable) surprise. My vote is seven, Title (Brazil): \"Tio Vanya em Nova York\" (\"Uncle Vanya in New York\")",
         "Like many others I was blown away by this film. It is SO hard to film a play, but Louis Malle and the actors have worked some incredible magic.",
         "Vanya is one of my favorite plays. Have seen it several times--stage, movies, television. This is far and away the best production I've seen. Incredible performances. I was afraid the frame of a rehearsal, and the bare stage would get in the way. They did not. Actors doing Chekhov usually seem to be more like actors than people. This cast was completely believable as real people(ironically, set and \"costumes\" may actually have helped here). Don't know Brooke Smith or Larry Pine, but they should be getting good roles. Wasn't a Julianne Moore fan, but I am now. Never saw Shawn in a sustained role except \"My Dinner with Andre\".He was perfect.Malle used camera extremely well, but did not \"open up\" the play to irrelevant cinematic expansion. Vanya was BOTH a film and a play without sacrificing one to the other. Making it work as both was quite an accomplishment."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Channel Four Films",
         "Mayfair Entertainment",
         "The Vanya Company"
      ],
      "summaries": [
         "An uniterrupted rehersal of Chekhov's \"Uncle Vanya\" played out by a company of actors. The setting is their run down theater with an unusable stage and crumbling ceiling. The play is shown act by act with the briefest of breaks to move props or for refreshments. The lack of costumes, real props and scenery is soon forgotten.",
         "In New York, the cast of Anton Chekhov's \"Uncle Vanya\" rehearse the play in a dilapidated theater on the 42nd Street. . The arrogant and selfish Professor Serybryakov is an elderly man married with his gorgeous and younger second wife Yelena that feels trapped in a prison with her marriage. They live in a farm that supports their lifestyle with the Professor Serybryakov's brother-in-law from the first marriage Vanya, who manages the family business with Professor's daughter from his first marriage, Sonya, a plain single young woman and Vanya's mother. The local Dr. Astrov visits the family every day since he is in love with Yelena. One day, Sonya confides to Yelena that she has an unrequited love for Dr. Astrov. When Professor Serybryakov discloses his intention of selling the real estate, there is a crisis in the family.",
         "In New York, the cast of Anton Chekhov's \"Uncle Vanya\" rehearse the play in a dilapidated theater on the 42nd Street. . The arrogant and selfish Professor Serybryakov is an elderly intellectual married with his gorgeous and younger second wife Yelena that feels trapped in a prison with her marriage. They live in a farm that supports their lifestyle with the Professor Serybryakov's brother-in-law from the first marriage Vanya, who manages the family business with Professor's daughter from his first marriage, Sonya, a plain single young woman and Vanya's mother. The local Dr. Astrov visits the family every day since he is in love with Yelena. One day, Sonya confides to Yelena that she has an unrequited love for Dr. Astrov. When Professor Serybryakov discloses his intention of selling the real estate, there is a crisis in the family.",
         "New York actors rehearse Chekhov's \"Uncle Vanya\" in a dilapidated theatre."
      ],
      "budget": 0
   },
   "movielensId": 334,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-09-13",
      "dvdReleaseDate": "2002-09-24",
      "directors": ["Louis Malle"],
      "runtime": 119,
      "movieId": 334,
      "title": "Vanya on 42nd Street",
      "mpaa": "PG",
      "actors": [
         "Wallace Shawn",
         "Julianne Moore",
         "Larry Pine",
         "Brooke Smith",
         "George Gaynes",
         "Lynn Cohen",
         "Phoebe Brand",
         "Jerry Mayer",
         "Andre Gregory",
         "Madhur Jaffrey"
      ],
      "imdbMovieId": "0111590",
      "originalTitle": "Vanya on 42nd Street",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["q4WceRNb7e0"],
      "plotSummary": "An uninterrupted rehersal of Chekhov's \"Uncle Vanya\" played out by a company of actors. The setting is their run down theater with an unusable stage and crumbling ceiling. The play is shown act by act with the briefest of breaks to move props or for refreshments. The lack of costumes, real props and scenery is soon forgotten.",
      "tmdbMovieId": 32636,
      "avgRating": 3.81384,
      "releaseYear": "1994",
      "numRatings": 1676,
      "posterPath": "/ii4bqnfm5aW3TxqGh0tcxS8nijK.jpg"
   }
}