{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "experiment",
            "id": 1706
         },
         {
            "name": "octopus",
            "id": 2771
         },
         {
            "name": "b movie",
            "id": 11034
         },
         {
            "name": "woman reporter",
            "id": 11289
         },
         {
            "name": "cult director",
            "id": 155167
         }
      ],
      "imdb_id": "tt0047898",
      "video": false,
      "title": "Bride of the Monster",
      "recommendations": [
         32623,
         24018,
         31286,
         19351,
         29286,
         122163,
         27918,
         38346,
         83519,
         22749,
         76964,
         87911,
         38404,
         23020,
         28676,
         27313,
         99424,
         235746,
         111753,
         122408
      ],
      "backdrop_path": "/zFr3hJ9Bxe3OrZ0ETdQWMVx18Lj.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Dr. Eric Vornoff",
               "gender": 2,
               "credit_id": "52fe45ec9251416c9104325d",
               "name": "Bela Lugosi",
               "profile_path": "/nI14KbMwRNyl8v2Ds5TVAzhu5No.jpg",
               "id": 1547,
               "order": 0
            },
            {
               "cast_id": 20,
               "character": "Lt. Dick Craig",
               "gender": 0,
               "credit_id": "535bde900e0a264feb00198f",
               "name": "Tony McCoy",
               "profile_path": null,
               "id": 1313952,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Lobo",
               "gender": 2,
               "credit_id": "52fe45ed9251416c91043261",
               "name": "Tor Johnson",
               "profile_path": "/4mz1ZqXgSgtBwPKwFtpmbJqqPCH.jpg",
               "id": 100796,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Janet Lawton",
               "gender": 1,
               "credit_id": "52fe45ed9251416c91043265",
               "name": "Loretta King",
               "profile_path": null,
               "id": 115446,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Capt. Robbins",
               "gender": 2,
               "credit_id": "535bd91f0e0a264fde001a6e",
               "name": "Harvey B. Dunn",
               "profile_path": null,
               "id": 131479,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Prof. Strowski",
               "gender": 2,
               "credit_id": "535bd93d0e0a264fe8001a0e",
               "name": "George Becwar",
               "profile_path": null,
               "id": 291778,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Kelton",
               "gender": 2,
               "credit_id": "535bd9570e0a264fd800199c",
               "name": "Paul Marco",
               "profile_path": null,
               "id": 103080,
               "order": 6
            },
            {
               "cast_id": 21,
               "character": "Margie",
               "gender": 1,
               "credit_id": "53d525760e0a262847004089",
               "name": "Dolores Fuller",
               "profile_path": null,
               "id": 99126,
               "order": 7
            },
            {
               "cast_id": 22,
               "character": "Martin",
               "gender": 2,
               "credit_id": "56d9adb8c3a3682cef011c76",
               "name": "Don Nagel",
               "profile_path": null,
               "id": 100350,
               "order": 8
            },
            {
               "cast_id": 23,
               "character": "Mac",
               "gender": 0,
               "credit_id": "56d9adc4925141429100a6fe",
               "name": "Bud Osborne",
               "profile_path": "/6WIxWcUlDvnILVj8yplY61fQJyG.jpg",
               "id": 34890,
               "order": 9
            },
            {
               "cast_id": 24,
               "character": "Jake",
               "gender": 0,
               "credit_id": "56d9add2c3a3681e3c025d5d",
               "name": "John Warren",
               "profile_path": null,
               "id": 1383190,
               "order": 10
            },
            {
               "cast_id": 25,
               "character": "Margie",
               "gender": 0,
               "credit_id": "56d9addfc3a3681e36022356",
               "name": "Ann Wilner",
               "profile_path": null,
               "id": 1586292,
               "order": 11
            },
            {
               "cast_id": 26,
               "character": "Newsboy",
               "gender": 2,
               "credit_id": "56d9adeb925141340201f0fd",
               "name": "William Benedict",
               "profile_path": "/uOmA9EUJIW18nBZDvU06yhSQxcM.jpg",
               "id": 1263061,
               "order": 12
            },
            {
               "cast_id": 11,
               "character": "Drunk",
               "gender": 0,
               "credit_id": "535bd9740e0a264fe5001a5d",
               "name": "Ben Frommer",
               "profile_path": null,
               "id": 152706,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45ec9251416c91043259",
               "name": "Edward D. Wood Jr.",
               "profile_path": "/8ZoVOGxMYwamLR3Unlkrq3rpSQ2.jpg",
               "id": 44763,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45ed9251416c9104326b",
               "name": "Edward D. Wood Jr.",
               "profile_path": "/8ZoVOGxMYwamLR3Unlkrq3rpSQ2.jpg",
               "id": 44763,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45ed9251416c91043271",
               "name": "Alex Gordon",
               "profile_path": null,
               "id": 117732,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "535bd99d0e0a264fe5001a63",
               "name": "Donald E. McCoy",
               "profile_path": null,
               "id": 1313945,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "535bda000e0a264fe10019c3",
               "name": "Edward D. Wood Jr.",
               "profile_path": "/8ZoVOGxMYwamLR3Unlkrq3rpSQ2.jpg",
               "id": 44763,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "535bdaea0e0a264fd80019ad",
               "name": "William C. Thompson",
               "profile_path": null,
               "id": 65502,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "535bdb230e0a264fe8001a3f",
               "name": "Harry Reif",
               "profile_path": null,
               "id": 30839,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "535bdb5e0e0a264fe10019d9",
               "name": "Pat Dinga",
               "profile_path": null,
               "id": 100988,
               "department": "Crew",
               "job": "Special Effects"
            },
            {
               "gender": 2,
               "credit_id": "535bdb8e0e0a264fe8001a49",
               "name": "Igo Kantor",
               "profile_path": null,
               "id": 43863,
               "department": "Crew",
               "job": "Technical Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "56d9ae51c3a3681e390223c2",
               "name": "Frank Worth",
               "profile_path": null,
               "id": 1313946,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "56d9ae6d9251416ff2006fe7",
               "name": "Tony McCoy",
               "profile_path": null,
               "id": 1313952,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "56d9ae8a925141429100a724",
               "name": "Ted Allan",
               "profile_path": null,
               "id": 565369,
               "department": "Camera",
               "job": "Additional Photography"
            },
            {
               "gender": 0,
               "credit_id": "56d9aea4c3a3682cef011ca0",
               "name": "Louis Haszillo",
               "profile_path": null,
               "id": 85764,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 2,
               "credit_id": "56d9aeb4c3a3681e390223d6",
               "name": "Maurice Seiderman",
               "profile_path": null,
               "id": 1000458,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "56d9aedec3a3681e4a021b41",
               "name": "George Bahr",
               "profile_path": null,
               "id": 127203,
               "department": "Crew",
               "job": "Property Master"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 1.64723,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 36489,
      "vote_count": 30,
      "budget": 0,
      "overview": "Dr. Varnoff captures twelve men for his experiment: to turn them into supermen using atomic energy. Newspaperwoman Lawton gets too snoopy for her own good.",
      "similar": [
         31417,
         9426,
         126889,
         336843,
         384521,
         3034,
         9383,
         22825,
         4961,
         9738,
         8078,
         36647,
         98566,
         52520,
         44833,
         119450,
         5548,
         14869,
         19,
         157336
      ],
      "original_title": "Bride of the Monster",
      "runtime": 69,
      "poster_path": "/sV4aImhMlxfd2ncomtxFAns3RC8.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Rolling M. Productions",
         "id": 22384,
         "origin_country": ""
      }],
      "release_date": "1955-05-11",
      "vote_average": 4.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Edward D. Wood Jr."],
      "runtime": 69,
      "synopsis": "We open in the woods after dark during an intense storm and see the old Willows property out on Lake Marsh, roll credits. Wandering around out in this foul weather are Mac (Bud Osborne) and Jake (John Warren). A bolt of lightning strikes a tree bough and it falls off. They decide to make for the Willows place as a refuge from the storm. They think it is deserted. They knock on the door when they see signs it may not be vacant. Dr. Eric Vornoff (Bela Lugosi) answers the door and refuses them entry. When it appears that Mac and Jake may use their guns, Lobo (Tor Johnson) appears and the two think Tor is the \"Monster of Lake Marsh\" and quickly depart. Vornoff returns to his lab via the entrance behind the fireplace. He slips into his lab coat and proceeds with an electrical experiment. He peers into a window and a large octopus appears. Mac and Jake have made it to the lake shore. Mac falls into the lake and is attacked by the octopus. Jakes returns to help his friend. He tries to pull him out, but failing that, he uses his rifle to put a couple of bullets into the thing. Lobo appears and grabs Jake. He takes him back to the house and prepares him for one of Vornoff's experiments. When Jake wakes he's in the lab, strapped to a gurney with some electrical device on his head. Lobo moves some equipment over him. Vornoff explains to Jake that Lobo is mute. He can hear his pleas for help, but he cannot speak. Vornoff fires up his equipment while Jake struggles. Vornoff tells him, \"you will be soon as big as a giant...with the strength of twenty men...or like all the others, dead!\" Jake screams and dies in an instant. Vornoff examines him, but only confirms his worst fear. \"Monster Strikes Again!\" screams the Daily Chronicle headline, and the Daily Globe shouts \"Monster Takes Two!\" At the police station, officer Kelton (Paul Marco) is questioning a drunk (Ben Frommer). The drunk is being very uncooperative. Two police offers drag him downstairs for booking. During the confusion, the newsboy (William Benedict) arrives and tries to go into the Captain's office with his newpapers, but is stopped by Kelton. Kelton starts to read one of the papers, but hears Captain Robbins entering his office from the hallway. Captain Robbins (Harvey B. Dunn) is sitting at his desk petting a bird. He tells Kelton to send Lt. Craig in to see him. Robbins peruses the newspaper headlines. While waiting for Craig to arrive he gives his bird a drink of water. Lt. Dick Craig (Tony McCoy) arrives, sits down and they discuss the Lake Marsh disappearances, twelve in the last three months. They examine the recovered remains of Jake and Mac, a gun and coat. Janet Lawton (Loretta King) bursts into Robbins' office with Kelton making a valiant effort to deep her out, but failing. We learn that Janet and Dick are engaged. They discuss her newspaper story. When she gets no new information, she tells them she intends to drive out to Lake Marsh and do a little of her own investigating. She drives back to the newspaper office. Janet makes her way to the file room and talks to Tilly (Ann Wilner) about the old Willows place out on Lake Marsh. She finds what she is looking for in the files. On her way out she bumps into Margie (Dolores Fuller) who warns her that the boss is looking for her. The police called the papers owner and told them they want a stop to the monster stories because of public panic. Janet gets back in her car and heads for home. Captain Robbins is meeting with Professor Strowski (George Becwar). Lt. Craig enters Robbins' office and is introduced to the professor. Strowski offers his assistance in the investigation. After he departs, Robbins warns Craig that Strowski should be watched. Janet departs for Lake Marsh as the weather starts to change. In a rainstorm near the Willows place, she blows a tire and crashes her car. Dazed, she exits her car and notices a snake in a nearby tree and faints. Lobo arrives at the scene of the accident, and picks her up and takes her back to the house. Janet is asleep on a couch and wakes to the sight of Vornoff. Vornoff hypnotizes her into a dream state. Martin (Don Nagel) and Lt. Craig are driving in their police car and stop. They decide to take the road to the Willows house. Strowski was supposed to meet Craig at 10:00 a.m., but failed to show for the appointment. They drive a short distance and stop when Lt. Craig spots Janet's car, but no trace of her. They head back to a coffee shop to see if she stopped there. Strowski arrives on the same road just after Craig and Martin leave. He starts walking through the woods. Martin and Craig arrive at the Café and call police headquarters. Craig is told to find Strowski. Janet is not at home or at work, and no one has seen her. Back at the Willows place, Vornoff and Lobo are coming into the lab with Janet's breakfast. When Janet sees Lobo she recoils in fear. Vornoff tells her, \"don't be afraid of Lobo, he's as gentle as a kitten.\" Lobo is dismissed, but lingers to stare at Janet. When he fails to comply, Vornoff whips him. Vornoff returns to talk to Janet. He introduces himself, and tells her she had an automobile accident. She concludes she is at the old Willows place based on her research. Strowski finds the house and approaches while Vornoff hypnotizes Janet. He then directs Lobo \"to take the girl to my quarters.\" Strowski enters the house quietly, looks around then enters the living room. He places his briefcase on the mantle and is greeted by Vornoff. Strowski is there to convince Vornoff to return to their country to continue his research. Vornoff, having been exiled twenty years earlier, is in no mood to return or to share his research--the creation of a master race. When Vornoff informs Strowski he has no intention of returning, Strowski pulls a gun and tells him that their government ordered his return. Lobo easily disarms Strowski and takes him down to the lab and throws him to the octopus. Martin and Craig, driving along the road to the Willows place, discover the abandoned rental car Strowski was driving. Martin and Craig split up, Craig walking to the Willows place. He takes the same path Strowski took earlier and falls into some quicksand. He shoots at some alligators and manages to escape the quicksand. Captain Robbins goes to the newspaper office to talk to Tillie. She was the last person known to have spoken to Janet. She informs him that Janet came in around 2:00 p.m. and left about 3:30 p.m. She was researching the file on the sale of the old Willows place. Robbins calls police headquarters and asks for all information on Dr. Eric Vornoff. At the lab, Vornoff summons Janet, now dressed in a wedding gown (!?) He directs her over to the examining table. Outside Lt. Craig enters the house, looks around, then enters the living room and finds Strowskis hat. Vornoff commands Lobo to strap her to the table. When he hesitates, Vornoff whips him. Back in the living room, Craig discovers Strowski's glasses and the file Strowski was carrying on Vornoff. When he places the folder down on the fireplace mantle, it activates the doorway to the lab. He pulls his gun, and makes his way to the lab. Vornoff orders Lobo to get the equipment ready. Lobo has developed a strong attraction to Janet and does not want her harmed. Vornoff continues preparation to turn Janet into the \"Bride of the Atom\". Lt. Craig enters the lab and orders Vornoff to release her. Lobo quietly enters behind Craig and knocks him out. Robbins, Kelton and two police officers meet Martin on the road to the Willows place. They walk to the house. Vornoff has Craig chained to the lab wall and tells him Janet is the subject of his research. Vornoff switches on the equipment, and Lobo realizing Janet will be Vornoff's next victim, turns on his master and attacks. Vornoff shoots him with Craig's service revolver, but the bullets have little effect. Vornoff is knocked to the floor. Lobo releases Janet from the table. As Janet is trying to release Craig's shackles, Lobo carries Vornoff to the table and straps him down. Lobo fires up the equipment and Craig, now loose, tries to intervene. But the stronger Lobo easily knocks him out. Lobo returns to the equipment and Vornoff ends up the subject of his own experiment--successful this time. Robbins and Martin enter the house, look around, enter the living room, and find the same clues as Craig. Vornoff, now an atomic superman, attacks Lobo who falls against some electrical equipment and is electrocuted. It starts a fire. Vornoff now mutated, grabs Janet and leaves the lab. Craig awakens and follows the pair out of the burning building. Robbins and Martin see the smoke, and also escape the building. Kelton sees Vornoff some distance away carrying Janet, with Lt. Craig in hot pursuit. The house is now fully engulfed in flames. Vornoff puts Janet down to make his escape easier. The police fire at him, but the bullets have no effect. Lt. Craig rolls a boulder onto him, which knocks Vornoff into the lake where he is attacked by his own atomic mutation, the octopus. Craig returns to Janet, who is ok and still wearing her wedding dress. Vornoff and his octopus are struck by a bolt of lightning which results in an atomic explosion. We close with Captain Robbins, joining Janet and Lt. Craig. Robbins opines, \"he tampered in God's domain.\"",
      "writers": [
         "Edward D. Wood Jr.",
         "Alex Gordon"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0047898/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjQwMDU5MDUxMV5BMl5BanBnXkFtZTgwNzgxMDkwMzE@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Bela Lugosi, Tor Johnson, Tony McCoy | See full cast and crew »"],
      "reviews": [
         "Ever since The Golden Turkey Awards chose Ed Wood as the world's worst director back in the 80s there have been a lot of people who automatically dismiss all Ed Wood movies as garbage. Even Tim Burton's terrific 'Ed Wood' has encouraged this. My opinion is that there are many, many worse directors out there, because at least Wood's movies were fun and entertaining, unlike many of those made by the likes of Roland Emmerich or Michael Bay, directors who are able to work with budgets a 1000 times bigger than Wood I might add! 'Bride Of The Monster' is one of Wood's most underrated movies. It was his second movie to star horror legend Bela Lugosi, but unlike the first, the truly mind blowing 'Glen Or Glenda', it isn't completely inept. True, some of the acting is terrible, especially the talentless leading lady Loretta King who is (I admit it) lousy, and Wood regular Paul Marco, who has a small supporting role as a cop. But, and this is a BIG but, Lugosi is terrific. Many fans regard this as his best performance. I wouldn't go that far but it's hard not to get choked up at Lugosi's immortal \"I have no home\" speech. 'Bride Of The Monster' is the first Wood film to feature the amazing Tor Johnson. He plays Lugosi's Tibetan servant/slave Lobo. All the scenes with Lobo are great fun to watch, especially when Lugosi whips him. Apart from Lugosi and Tor this movie is best remembered for the rubber octopus monster. Of course it's a hoot, but the rest of the picture isn't anywhere near as bad as many claim and is comparable to say 'The Devil Bat', which Lugosi starred in back in the 1940s. Both movies suffer from their minuscule budgets, but both are still worth watching to see Lugosi struggle for greatness. I recommend 'Bride Of The Monster' to all horror fans, especially those of Bela Lugosi.",
         "Bride of the Monster is the best of Ed Wood's films. Frankly compared with Scared to Death and the Devil Bat-- the film truly looks like a masterpiece -- and truth be told it isn't that bad. In fact, it is rather enjoyable. Okay, I am gonna admit it -- I like it! If you look past the cheesy octopus (no worse than the hysterical devil bat), the cheap sets and the lame acting (better than Scared to Death!), if you suspend a little disbelief and realize this movie was made for a song -- then actually it is pretty darned good. One reason for this is that Bela Lugosi gets ample screen time. If Ed Wood was a bit unimaginative, he at least knew what it was that made Lugosi a legend and reprises little details, from the mad scientific leering of the Devil Bat to the idiosyncratic hand gestures of White Zombie. Bela is given a chance to shine in his final starring performance and shine he does. The movie has its flaws, but Bela is not one of them. He is old and looks weak, but he carries the movie like a true champion. He makes empty dialog sound meaningful and implausible scenarios seem poignant (well almost poignant). Lugosi's \"I have no home\" monolog is beautiful. He could make dialog such as \"I have proven that I am alright!\" sound good. Lugosi gives his all in his last performance, and it is a great performance, even if he does have to wrestle with a fake octopus.",
         "AS others have commented on, BOTM is indeed a competent B-movie. After seeing it on public domain video I was glad to buy the Image DVD which has very good image quality. You can see the movie the way Ed Wood intended it. The lighting is competent; the camera work is competent. But what elevates BOTM to film nirvana is Bela Lugosi's performance as Dr. Eric Vornoff (sp?). To those who say that Ed Wood exploited Bela (including Bela Jr), I say, at least he didn't put Bela in white plastic go-go boots and give him no dialogue, like the director of The Black Sleep did. Without exception Bela's performances are hypnotic. His strange intonation, his deliberate facial gesture, his gravitas -- he is always the magnetic center of his films. And BOTM gives a summary of his career -- the Dracula hands, the White Zombie hands -- and the pathos of his \"I have no home\" speech -- give his performance a dimension most of his roles (though check out \"Invisible Ghost\" for another excellent role) lacked. \"Nuff said. I enjoy the delirium of Glen or Glenda? and Plan 9, but Bride of the Monster is Bela's show ALL THE WAY.",
         "Many person are vanishing in the Lake Marsh, nearby an old mansion recently bought by Dr. Eric Vornoff (Bela Lugosi). He lives with Lobo (Tor Johnson) and has an octopus in the lake, product of his experiment in developing somehow atomic energy. Janet Lawton (Loretta King), a reporter of a tabloid, decides to investigate further the disappearance of locals and is abducted by Dr. Vornoff. Her fiancée, Lt. Dick Craig (Tony McCoy), together with the police force, goes to the old house looking for Janet. This story, expected to be a horror movie, is indeed a funny entertainment due to the lack of talent of Ed Wood. When I bought this rare VHS a couple of days ago, some friends of mine, also lovers of cinema, were a little jealous. - Where did you find this film? was the common question. When we watch an Ed Wood's film, we know that it will be a movie full of flaws. But why do we like him so much? Because since Tim Burton promoted this director, he became a cult personality. Therefore, it is very unfair and almost unacceptable the IMDB User Rating of 2.8 for this movie. There are unbelievable mistakes in framing and edition, such as, for example, about 36 minutes running time, we can see the microphone over the heads of Janet and Dr. Vornoff. The performance of the cast is so ridiculous that becomes really funny. The motionless octopus in the `lake' is also funny. And what about the screenplay, a kind of Frankenstein meeting the Loch Ness monster, with hilarious dialogs? This movie is a great entertainment, to see the courage of a brave director lover of cinema but without any skill. My vote is seven. Title (Brazil): `A Noiva do Monstro' (`The Bride of the Monster')",
         "Okay...lets be honest. This film was just what is was expected to be: a poorly made film with little to no budget, terrible acting overall, a script that borders on insanity, and special effects that children in a school play could be proud of. Yet, the film has a certain charm to it and is a vehicle in which to see both Bela Lugosi and Tor Johnson madly overact and interact. Bela whipping Johnson and then getting into a wrestling match is definitely a high point. The rest of the cast strive to be mediocre...and fail...with the exception of character actor Harvey Dunn. Dunn plays the police chief and is humorous both intentionally and unintentionally. Watch his scenes and see him play with his parakeet in his office. It defies logic, time, and space...and is funny. Not Ed Woods best or worse...and a film that really has been given a boost by Tim Burton's Ed Wood. A fun picture to sit through with a group.",
         "If you do not know Ed Wood then this movie will have little meaning to you. So the first thing you have to do is learn about the life of Ed Wood. He is one of the worst directors of all time, but also one of the most colorful. Bride of the monster is a good example of his ability to make the most out of his scarce resources. You'll love it or you'll hate it. Have fun!",
         "This movie is easily Wood's best! Of all the movies Ed Wood has written this one makes 'the most sense', even though the story and concept are still ridiculous of course. Yet the movie works as an horror movie, or like Ed wood would call it; 'a supernatural thriller'. The acting probably is the only thing that is truly bad about this movie. Lot's of people praise Bela Lugosi for his role in this but I think that's truly offensive to a great actor like him. Lugosi was hundred times better in movies like \"Dracula\" and \"The Black Cat\". Bela Lugosi and Tor Johnson are terribly overacting in this! Also it's too bad about the octopus scene's. It all was terrible fake and the use of archive footage was done horribly. The dialog and characters are the best Wood has ever written. Even though they are far from supreme, they work very well in the movie. Wood even manages to come up with some memorable quotes. This movie really doesn't deserve such a low rating and my guess is that more than halve the people who have rated this movie poorly had not even seen this movie but just rated it low because it's an Ed Wood movie. Be fair people! I recognize a bad movie when I see one and this movie most certainly is not bad! Even if you're not familiar with Wood's work but are a fan of classic horror movie's, you'll appreciate this movie. It really is not bad and works well as an horror movie. The story flows well and the ending is build up very good. By Wood's standards, an excellent movie! 6/10 http://bobafett1138.blogspot.com/",
         "I really don't think this deserves the \"honor\" of being in the Bottom 100 of all times. I've seen much worse films without nearly the notoriety. In \"Bride of the Monster,\" Edward Wood shows himself to be a typically competent director doing a typical low-rent horror film. There are no mistakes in continuity, the lighting is adequate, the performances are pretty good\u0085how \"Plan 9\" came from the same director is beyond me. I *am* put off by the DVD, though. For a premium price, you get the film, the trailer, and chapter stops\u0097that's all, folks. If this is supposed to be a camp classic, I could at least hope for some interviews, outtakes, and other amusements. The transfer isn't bad, with few scratches or specks that I noticed and a faithful rendering of the black-and-white movies of that era.",
         "This really isn't such a terrible little movie. Sure, it's cheap, the acting is horrible, the sets wobble if sneezed upon and the special effects consist of stock footage and a rubber octopus, but \"Bride of the Monster\" is much, MUCH better than \"Plan 9 From Outer Space.\" Mad scientist Vornoff (a sickly Bela Lugosi) has apparently set up shop in the Florida Everglades, kidnapping anyone unwise enough to wander too close to his house (and his pet octopus) and conducting sinister experiments upon them. Vornoff, for some odd reason, is determined to create a race of super giants with incredible strength. We're never really sure exactly WHY he wants to do this, but one can only assume that, if one possesses an army of super strong giants, one could take over the world and rule it and stuff. That seems to be the goal of every other mad scientist in the unruled world, anyway. Into this diabolical plan stumbles loudmouthed newsgirl Loretta King, who is determined to get the story on the Lake Marsh Monster. Whether the title of \"Lake Marsh Monster\" refers to the octopus, Tor Johnson as the fumbling Lobo or Bela's drug problem, we're never sure. Take your pick. Anyway, Loretta is kept under constant hypnosis by Bela's eyebags and is slated to become The Bride of the Monster! By this point, we're all quite ready to see the annoying Loretta fried to a crisp, but unfortunately, her wimpy boyfriend shows up to save her. The stunning climax is packed full of raging Lobo's, rolling boulders, lightening bolts, gunfire and death by octopus! The story doesn't make much sense, but were you really expecting it to when you saw Ed Wood's name listed under the title of director? Still and all, it's certainly Wood's most coherent effort and can be entertaining for those of us who stop to look at road accidents.",
         "***SPOILERS*** Strange things have been happening around the Old Willow's place where a number of people have disappeared with the local police baffled about what happened to them. Janet Lawton, Loretta King, a local reporter has been writing stories about the disappearances and blaming them on what she calls \"The Monster of Lake Marsh\" which is getting people in the area very apprehensive and scared and making the police look helpless. It turns out very early in the movie we're shown that a Dr. Eric Vornoff, Bela Lugosi, with the help of his hulking assistant Lobo, Tor Johnson, have been kidnapping people in the woods around Lake Marsh and using them in experiments. The trouble is that Dr. Vornoff's experiments haven't been working out like he planned them to with those who he's experimenting on ending up dead. One afternoon at the local police station a prof. Strowski,George Becwar, shows up claiming that he's an expert on undiscovered monsters and thinks that whoever solve the mystery about the \"Monster of Lake Marsh\". Telling police Captain Robbins, Harvey B. Dunn, and his second in command Lt. Dick Craig, Tony McCoy, to meet him the next morning and go out in the Lake Marsh area looking for the monster Strowski for some mysterious reason never shows up! Strowski instead checks out the Old Willow's Place where he comes face to face with Dr. Vornoff. It turns out that both Dr. Vornoff and prof. Strowski worked in, for some strange reason the country is never mentioned in the movie, the Soviet Union Back in the USSR Dr. Vornoff came up with a plan to create beings out of atomic energy that would be indestructible and use them to conquer the world for the USSR. The Soviet Government feeling that Dr.Vornoff was mad and ran him out of the country. Now it seems that they realized that Dr.Vornoff was on to something big and they want him back so they sent Strowski to the USA to fetch him and bring him \"home\". Dr. Vornoff feeling insulted and condescended too instead tells Strowski to get lost that his plans for an army of atomic supermen is for his own purposes not for any country much less the Soviet Union who threw him out and stripped him of all his honors and accomplishments. It's then when Strowski pulls out a gun and tells Vornoff that his government ordered him to bring him back. Lobo sneaks up on Strowski and grabs him from behind then throws him into a water tank where he's killed by a giant octopus. Meanwhile Janet, who's Lt. Craig's girlfriend is also snooping around the Old Willow's place looking to break the big story about the monster. Being attacked by a python Lobo comes to Janet's rescue and takes her back to Dr. Vornoff. Dr. Vornoff sees in Janet a new subject for him to try out his atomic experiments with but is interrupted when Lt. Craig, who went out looking for Strowski at the Old Willow's Place, bursts in before Dr. Vornoff can do his dirty work. Lt. Craig like it was with Strowski is grabbed from behind by Lobo who subdues him. With Lt. Craig chained to the wall Dr. Vornoff goes on with his experiments on Janet. Lobo who has taken a liking to Janet then attacks Vornoff and stops him from pulling the switch. Strapping Vornoff to the operating table Lobo turns the juice on him but unlike the other times when the experiment failed and the persons died this time it worked! Vornoff turns into an atomic superman and clobbers Lobo and takes off with Janet in the woods with the whole police force hot on his heels. Vornoff after being forced to releases Janet, after Lt. Craig rolled a bolder on him, falls into a pound where he's attacked by the octopus that killed Strowski. While Vornoff and the the octopus are engaged in a life and death struggle their hit by a lighting bolt! With what seems like the whole movie set goes up in a nuclear explosion with Captain Robbins, who was in charge of the police , ends the film by saying what has now become folk lore in movie history: \"He Tampered in God's Domain\". \"Bride of the Monster\" was Bela Lugosi's last staring role and Bela gave it all that he had with the Mad Scientist bit which has to rank right up there with the best films that he made over his long movie career including \"Dracula\" and \"Son of Frankenstein\" as well as \"Ninotchka\". Bela's \"I Have'a no Home\" speech that he gave to prof. Strowski was as good as anything that you would hear in an Academy Award winning film or top flight Shakesperaean production. Tor Johnson was also very effective as Lobo, even though he never uttered a word in the movie, by showing pain and affection for Janet who he tried to save from Dr. Vornoff's evil clutches and both Tony McCoy and Loretta King did have chemistry in the scenes that they were in together. George Becwar was more then adequate as the cagey and obsessed prof. Strowski trying to get Dr. Vornoff back home, to the USSR, to help in their nuclear research. You can say that the movie was awful only because director Ed Wood didn't have the money to make it more extravagant. Ed had to relay on cheap sets and props and in some places in the film add in stock footage. Yet I wounder how many top directors in the film business today or in 1955 when \"Bride of the Monster\" was made would have done better then Wood did with what he had. People should think of that before they put Ed Wood's \"Bride of the Monster\" down."
      ],
      "genres": [
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": ["Rolling M. Productions"],
      "summaries": [
         "Rumours abound about what may go on at a creepy mansion just out of town. The house is owned by Dr. Eric Vornoff who is conducting experiments to turn people into super-beings through the use of atomic power. Reporter Janet Lawton decides to look into what is going there and its possible connection to men that have disappeared in the area. When Vornoff takes her prisoner, he has definite plans for her.",
         "An mad doctor attempts to create atomic supermen."
      ],
      "budget": 70000
   },
   "movielensId": 3340,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1955-05-11",
      "dvdReleaseDate": "2000-02-15",
      "directors": ["Edward D. Wood Jr."],
      "runtime": 69,
      "movieId": 3340,
      "title": "Bride of the Monster",
      "mpaa": "",
      "actors": [
         "Bela Lugosi",
         "Tony McCoy",
         "Tor Johnson",
         "Loretta King",
         "Harvey B. Dunn",
         "George Becwar",
         "Paul Marco",
         "Dolores Fuller",
         "Don Nagel",
         "Bud Osborne",
         "John Warren",
         "Ann Wilner",
         "William Benedict",
         "Ben Frommer"
      ],
      "imdbMovieId": "0047898",
      "originalTitle": "Bride of the Monster",
      "genres": [
         "Horror",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["B_ABk1pUXPY"],
      "plotSummary": "Dr. Varnoff captures twelve men for his experiment: to turn them into supermen using atomic energy. Newspaperwoman Lawton gets too snoopy for her own good.",
      "tmdbMovieId": 36489,
      "avgRating": 2.58333,
      "releaseYear": "1955",
      "numRatings": 306,
      "posterPath": "/sV4aImhMlxfd2ncomtxFAns3RC8.jpg"
   }
}