{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "washington d.c.",
            "id": 521
         },
         {
            "name": "congress",
            "id": 1705
         },
         {
            "name": "tycoon",
            "id": 5728
         }
      ],
      "imdb_id": "tt0042276",
      "video": false,
      "title": "Born Yesterday",
      "recommendations": [
         24807,
         29451,
         25430,
         43136,
         1942,
         14675,
         31507,
         32255,
         39940,
         3092,
         29884,
         26535,
         18727,
         14554,
         45219,
         37230,
         965,
         31409,
         31773,
         43316
      ],
      "backdrop_path": "/f6wiZK0VWFQsffdI4jApZLG65nv.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "53aead25c3a3682ee2003755",
         "content": "Possibly the most endearing \"dumb blonde\" ever?\r\n\r\nJudy Holliday rightly won the best actress Oscar for her portrayal of dumb blonde kept woman Billie Dawn, a role she successfully played on Broadway in the stage show production. Yet to only mention her would be doing a disservice to the films other strengths as it has many to justify it being labelled a classic of its time.\r\n\r\nBillie Dawn is the girlfriend of scrap metal magnate Harry Brock, she's not that bright and Brock uses her as a front for some less than honest dealings. Sure he cares but his treatment of her borders on the repulsive whilst still managing to get the ribs tickled, Brock worries that her dumbness will do down important business issues socially, so he arranges for the calm and well spoken Paul Verrall to be her chaperon and train her to be eloquent and more astute of the world and its history.\r\n\r\nThe film then becomes your standard Pygmalion story as the nice but dim Billie not only learns about the world she lives in, she also learns about the world SHE HAS been living in, and coupled with the sexual awakening she finds with Verrall this fills out the rest of the story. It's full of delightful scenes that linger long in the memory, and outside of Holliday's brilliant performance, we get a wonderful example of the polar opposite Male love interest, Broderick Crawford as Brock is a maelstrom of shouting daftness, a man that makes you cringe such is his buffoonery. On the other hand we get the serene and well mannered Verrall played with the right amount of pathos by William Holden, and it is with much credit that amongst the loud brash shows from the other stars, he remains more than a distant memory.\r\n\r\nThe comedy here will make you cringe one minute, and then have you giggling away the next, all the chief characters here engage you in the way they are meant to, the climax may be a bit too condensed for some but it's a fine ending that befits the previous efforts you have just witnessed, and I defy anyone to not laugh at the gin rummy sequence! 8/10",
         "url": "https://www.themoviedb.org/review/53aead25c3a3682ee2003755"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Emma 'Billie' Dawn",
               "gender": 1,
               "credit_id": "52fe4498c3a368484e02bb91",
               "name": "Judy Holliday",
               "profile_path": "/pfKChERT9vEzyJrO5sWkJy1go36.jpg",
               "id": 85651,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Harry Brock",
               "gender": 2,
               "credit_id": "52fe4498c3a368484e02bb95",
               "name": "Broderick Crawford",
               "profile_path": "/fCoHg9CyOza4o9Mg1TLd5yXFGM4.jpg",
               "id": 85895,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Paul Verrall",
               "gender": 2,
               "credit_id": "52fe4498c3a368484e02bb99",
               "name": "William Holden",
               "profile_path": "/6sa5f8p1KBhYxJDEmCLxn7QLcBe.jpg",
               "id": 8252,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Jim Devery",
               "gender": 2,
               "credit_id": "52fe4498c3a368484e02bb9d",
               "name": "Howard St. John",
               "profile_path": "/1MmHUGc6btitSBRTu5vmYeGuHII.jpg",
               "id": 5792,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Eddie",
               "gender": 0,
               "credit_id": "52fe4498c3a368484e02bbc9",
               "name": "Frank Otto",
               "profile_path": null,
               "id": 1274075,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Congressman Norval Hedges",
               "gender": 2,
               "credit_id": "52fe4498c3a368484e02bba1",
               "name": "Larry Oliver",
               "profile_path": null,
               "id": 91653,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Mrs. Hedges",
               "gender": 1,
               "credit_id": "52fe4498c3a368484e02bba5",
               "name": "Barbara Brown",
               "profile_path": "/qFsDo8sYpru8SU1QqVHRyDSOG1D.jpg",
               "id": 91654,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Sanborn",
               "gender": 0,
               "credit_id": "52fe4498c3a368484e02bba9",
               "name": "Grandon Rhodes",
               "profile_path": "/llcaHJsyLM45W4gETYJri4a0qKW.jpg",
               "id": 82749,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Helen",
               "gender": 1,
               "credit_id": "52fe4498c3a368484e02bbad",
               "name": "Claire Carleton",
               "profile_path": "/bmEkzqOKIO1qSWrFBgCFpwyglFs.jpg",
               "id": 91655,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4498c3a368484e02bbb3",
               "name": "George Cukor",
               "profile_path": "/s6OKrb7REayEl3NHAQVJXvD9KrX.jpg",
               "id": 14674,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4498c3a368484e02bbb9",
               "name": "Garson Kanin",
               "profile_path": "/nNdttGcKkSbqrtF4zLX9GBCheFG.jpg",
               "id": 100131,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4498c3a368484e02bbbf",
               "name": "Albert Mannheimer",
               "profile_path": null,
               "id": 159503,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4498c3a368484e02bbc5",
               "name": "Harry Horner",
               "profile_path": "/uzkVhjoc4WR3XVSFvnPmiRPVPJL.jpg",
               "id": 14878,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "55317a0c925141529e0008bd",
               "name": "Joseph Walker",
               "profile_path": null,
               "id": 17761,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "55317a4d925141528c00089b",
               "name": "William Kiernan",
               "profile_path": null,
               "id": 34436,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "59193056c3a3683a9304da8a",
               "name": "Friedrich Hollaender",
               "profile_path": null,
               "id": 2916,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5919305ec3a368423c051495",
               "name": "S. Sylvan Simon",
               "profile_path": null,
               "id": 117773,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5919306692514159c104eaab",
               "name": "Charles Nelson",
               "profile_path": null,
               "id": 20601,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5919307992514159c104eac4",
               "name": "Jean Louis",
               "profile_path": "/uJ2hQZlHtrMJpcigGtM6KP7svBz.jpg",
               "id": 12145,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 5.000178,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 24481,
      "vote_count": 40,
      "budget": 0,
      "overview": "Uncouth, loud-mouth junkyard tycoon Harry Brock descends upon Washington D.C. to buy himself a congressman or two, bringing with him his mistress, ex-showgirl Billie Dawn.",
      "similar": [
         6538,
         11679,
         13,
         75,
         9798,
         19908,
         7512,
         37137,
         9437,
         10327,
         180,
         1571,
         100402,
         66,
         11775,
         586,
         3179,
         10216,
         13027,
         205220
      ],
      "original_title": "Born Yesterday",
      "runtime": 103,
      "poster_path": "/yxR3qG3SuqQIMpLwZvoofI1UyY4.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
         "name": "Columbia Pictures",
         "id": 5,
         "origin_country": "US"
      }],
      "release_date": "1950-12-25",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "It's Here AT LAST!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["George Cukor"],
      "runtime": 103,
      "synopsis": null,
      "writers": [
         "Garson Kanin",
         "Albert Mannheimer"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0042276/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ5NjExNTg2OF5BMl5BanBnXkFtZTcwMDY1NDkyMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Judy Holliday, William Holden, Broderick Crawford | See full cast and crew »"],
      "reviews": [
         "She bursts into the screen. Every tiny little nuance in her extraordinarily telling eyes are absolutely true and we surrender to her persona without even thinking about it. She was miraculous. \"I'm stupid and I like it\" she tells William Holden with devastating sincerity. She exudes such honesty that it's impossible to be indifferent to her. Ruth Gordon and Garson Kannin concocted a realistic fairy tale that Judy Holliday inhabits (rather than inhibits)with overwhelming naturalness. It is a sensational creation and George Cukor, as usual, puts the camera at her service to magnificent results. Look at the card game, no cut aways from her face for which, I was enormously grateful. If you haven't seen it, rent it now. You'll have an unforgettable time.",
         "One of my favourite films of all time, this Broderick Crawford, Judy Holliday, William Holden vehicle was magnificently written by Garson Kanin and superbly directed by George Cukor. Cukor did something that is seldom done with any film: He decided to rehearse `Born Yesterday' as if it were a play (which it was on Broadway and of which Judy Holliday performed the role of Billie Dawn 1,200 times) and had a complete theater built on one of the studio's soundstages and filled it with an audience so he could perfectly time the laughs and the pauses so the movie-going public wouldn't miss a thing. This bit of directing genius is part of what is responsible for the remarkable film that is `Born Yesterday.' The other part of the equation is the casting of Broderick Crawford as the slimy, junk dealer turned multi-millionaire, Harry Brock. Rita Hayworth was originally slated to star as Billie Dawn but when she married Ally Khan and put her screen career on hold the producers ran through an entire list of potential candidates\u0085 It was only with great reluctance that they finally decided to use Judy Holliday in the role she created on Broadway \u0096 not believing she was a big enough `name' to pull in audiences. Lucky break for them: She went on to win the first Oscar ever awarded to an actress for a comedic role. Her every movement, glance and word is a study in brilliance of the not-so-dumb blonde, Billie Dawn. Unfortunately Judy Holliday's career was cut short when she died of breast cancer just a few weeks short of her 44th birthday \u0096 who knows what kind of work she could have accomplished had she only lived. `Born Yesterday' went on to receive five Academy Award nominations, including Best Picture, but the only award went to Judy Holliday for Best Actress; she also won the Golden Globe in the same category that year. This is a finely crafted tale of greed, corruption and the ultimate price that must be paid by those that believe they can manipulate the law and the government by for and of the people. It is a brilliant movie and should not be missed.",
         "Okay, so Bette and Gloria lost out to Judy Holliday in this Oscar race 50 years ago. In 20/20 hindsight, have there not been enough scenery-chewing, over-the-top dramatics that have won Academy Awards over the years? Even the least of actors acknowledge that comedy is more difficult to play well than drama. When I watch \"Born Yesterday\" - I KNOW I'm observing two masters at work: Judy Holliday and Broderick Crawford. (Holden gives a good performance, of course, but can't hold a light to his co-stars in this particular project.) Holliday is mesmerizing with every expression, every screechy syllable - and watch those hands during the gin game! Perfection in each gesture. Crawford pulls off a nifty trick by making the viewer simultaneously loathe and feel compassion for his character. Although she died before I was even a twinkle in my mother's eye, I think I could have hung out with Judy Holliday (nee' Judith Tuvim.) I like intelligent people, and I've read that she was a brilliant woman. Makes sense: it takes some serious smarts to play so dumb. She was a funnier Marilyn before there WAS a Marilyn. Partially because she died so young, and partially because of her refusal to play patty-cake with the HUAC, she is now an under-appreciated memory. There's one more reason to love Judy: can you think of any other person hauled before the HUAC who had the . . . <ahem> . . . gonads to confound the committee by appearing as a character from one of their own movies? And pull it off? Now that, ladies and gentlemen, takes guts AND brains! Treasure this unique gem and then . . . Thank God for the short-lived, but stunning talent of Judy Holliday.",
         "It is amazing to think that a talented person like Judy Holliday really was a star only for one decade (on film), and only in a total of nine films. She actually made more than nine, but several of them (prior to \"Adam's Rib\") were actually small roles or small pictures - including (interestingly enough) \"Too Much Johnson\" a film that was made by Orson Welles for a Broadway comedy he was directing in 1938. From \"Adam's Rib\" through \"The Bells Are Ringing\" Judy managed to demonstrate she was a gifted comic actress, a good dramatic actress, and a fine, even sexy musical comedy star. She would even win an Oscar for her second starring role (\"Born Yesterday\" - the currently reviewed movie). This should have guaranteed some degree of posthumous movie glory. It does to those who take the trouble of watching her performances, but most of her films are rarely shown (or, in the case of \"Adam's Rib\" they are shown because the real stars are Spencer Tracy and Katherine Hepburn; and \"The Bells Are Ringing\" is recalled as one of Vincent Minelli's musicals). Judy died of cancer in 1965, much too young. Had she lived twenty or thirty more years (even up to the present) her filmography would have been longer and more elaborate. A decade's worth of good performances is too dependent on the tastes associated with that decade. And Judy will always be part of the Eisenhower years - not the most glamorous period of our history. \"Born Yesterday\" was a play by Garson Kanin, dealing with an unscrupulous, self-made scrap metal dealer and millionaire named Harry Brock. On Broadway, the part was played by Paul Douglas opposite Judy, and apparently they did not get along too well. Yet their stage chemistry worked, and the show ran for four years. Oddly enough, when the film was made, Douglas was not the star - the role went to Broderick Crawford (who had won the Oscar for best actor in \"All The King's Men\" the previous year. Yet six years later, Douglas did very well as McKeever, the Wall Street corporate leader, opposite Judy as Laura Partridge, in \"The Solid Gold Cadillac\". In retrospect it would have been interesting seeing Douglas play a more violent type, but Crawford does quite nicely as the street smart Harry. Harry, Billie Dawn (Judy - his girlfriend), and his bodyguard/cousin Eddie come to Washington, D.C. Harry wants to expand his scrap iron - garbage dump empire by getting legislation passed allowing him an exception to certain tariffs and taxes. This requires his bribing a Congressman (Larry Oliver) who might sway the required committee in changing the law. Supervising this is Harry's lawyer Jim Devery (Howard St. John), an alcoholic who was once quite promising as a legal scholar (he was close to the great associate justice Oliver Wendell Holmes, whom he says was his \"god\"). But Harry, although rather rough himself in manners, decides that Billie should sharpen her image. She seems too naive, but it is actually that she has never been stimulated (certainly not by the rough, unread, uncultured Harry). Harry has attracted the attention of a reporter named Paul Verrall (William Holden), and on Devery's suggestion, he hires Verrall to transform Billie into a socially acceptable girlfriend. Paul and Billie fall in love, of course, and the education works too well. In fact, while comparable to Eliza Doolittle's education by Henry Higgins it is actually different. Eliza gains a firmer grasp on her self respect because her speech and manners improve. But she never questions the social order of things, or Higgins' political and economic views. That's because Eliza is never trained to be thinking that widely. But Billie is - Paul has her reading books, and looking up words. His education is far more sweeping. As a result, she starts questioning what Harry and Devery are doing in Washington - which Harry is not very happy about. \"Born Yesterday\" works due to the acting of Holliday, Crawford (who for all his roughness is funny - see his constant frustration playing gin with Billie), Holden, and St. John. It ends up as reaffirmation of democracy over corruption, and of the possibility of an individual to grow. And it did set the stage for Holliday's screen personae as the urbanite whose humanity and intelligence won out in the end.",
         "\"Born Yesterday\" is a comedy with some serious ideas behind it. The film does a wonderful job in its subtle take about corruption in high places, the role of the lobbyists and influential people in Washington politics. The movie presents an interesting aspect for today's audiences, as things related to the film have been in the news lately, making the film relevant. The comedy by Garson Kanin ran for years on the New York stage. Judy Holliday had starred on Broadway opposite Paul Douglas. For the movie version Broderick Crawford was selected. George Cukor directed with his well known style and getting excellent performances of this ideal cast. The film is the gem it is because the great star turn by Judy Holliday, an actress that was unique in everything she did. Billie Dawn was one of the best achievements in the movies. Ms. Holliday was an intelligent actress who knew what made her character work. She made a wonderful contribution with Billie, who in spite of being supposed to be a girl without brains, Ms. Holliday shows her to be a smart no-nonsense woman with more common sense than anyone could give her credit for. Broderick Crawford made quite an impression as the ruthless Harry Brock, a man that can't see the goodness in Billie. He constantly belittles her and even goes as far as slapping her on occasion, but that is what someone like him would normally do when he can't get his way, or thinks is being threatened by a woman like Billie. Mr. Crawford was a wonderful actor as proved in his appearances in Fellini's \"Il bidone\", and in \"All the President's Men\". The other good performance was William Holden, who as Paul Verrall, transforms Billie from an abused woman into someone that is not afraid to open her mouth against the bully that has been taken her for granted for a long time. Mr. Holden clearly understood the man he was playing and makes a wonderful match for Ms. Holliday. \"Born Yesterday\" is a fun film to watch because all the elements that went into it and the inspired direction George Cukor and the ensemble work of the cast, but especially from its star, Judy Holliday.",
         "Delightful! Hilarious! How often do we get to see a perfect performance? We're closing in on a century of movies and, as we can see, it's pretty rare. So flawless was Judy Holliday's portrayal of Billie Dawn that, as a relative unknown, she came from behind to beat out two heavyweights for the Oscar in 1950. I'm sure this was due in no small part to her refining the role for nearly three years on stage. Everything else fell into place as well. Broderick Crawford was just excellent as Harry Brock. Crawford is able to swing you back and forth between anger and sympathy for his character. Not an easy task! William Holden is perfectly calm and reserved as Paul Verrall. His character forms a wonderful opposite to Billie. And, with direction, George Cukor worked his usual magic. Most of the themes are timeless. A person lives in ignorant bliss until their eyes are opened. They realize that there is a better life for them and begin their struggle for improvement. They discover that their greatest opponents to advancement are not those above them, but those at their current level. A few of the elements are dated. Particularly Jim's speech about how hard it is to find a corrupt politician in Washington. Wow. Maybe that was the case in 1950. Now it's impossible to find an honest one. It all comes back to Judy Holliday. This movie is her vehicle. She was a rare talent who we were only able to see for a very short time. I love all of her movies and this one, Born Yesterday, is my favorite. Thank you Judy!!!!!!",
         "A brilliant Judy Holliday performance is the main attraction in this witty, brisk adaptation of Garson Kanin's Broadway success. As a gangster's moll who gradually awakens to her civic responsibility, Holliday expands her dumb-broad persona from her previous film with Cukor, Adam's Rib, into a character who's sweet, memorable and surprisingly tough. Born Yesterday is a suitable companion piece to Frank Capra's Mr. Smith Goes To Washington, a much more self-consciously \"important\" film that imparts similar messages about political corruption and the responsibility of individuals to require ethical governance. The message is arguably more powerfully imparted here - filtered through the perspective of the selfish, spoiled and barely-literate Ms. Dawn - than in the film focused on Jimmy Stewart's eloquent (and intimidatingly ethical) Mr. Smith, an \"everyman\" who is vastly morally superior to most audience members. William Holden is relaxed and charming as the Henry Higgins-ish newspaper man tasked with opening Billie's eyes and Broderick Crawford is suitably broad and menacingly raspy as her corrupt, vulgar boyfriend. However, the movie is all Holliday's from the opening scenes, which play on the audience's lack of familiarity with the actress by presenting her as a refined, statuesque beauty in an extended sequence until, at last, she squawks out her first lines in nearly impenetrable, helium-voiced Brooklynese to hilarious effect. A richly deserved Best Actress Oscar for the newcomer Holliday, despite formidable competition from grande dames Bette Davis (All About Eve) and Gloria Swanson (Sunset Boulevard).",
         "A hidden gem (I say 'hidden' because as this comment is being written, there are only 400+ votes here in the ImDb for this movie) of a movie from 1950 is \"Born Yesterday\". Nominated for several Academy Awards and won Best Actress for Judy Holliday's performance of a \"not-so-bright\" fiancee of another \"not-so-bright\" but rich and powerful \"junkman\" played by Broderick Crawford. William Holden also shows another of his fittingly played performances as the newspaperman who teaches Judy Holliday's character the better things she's neglected to even try to learn. Another fine \"Broadway Hit\" that is preserved on film. Great acting and dialogue does enhance the quality of a movie and this proves it. It also tells a simple story of intelligence that should be heard once in a while. It is not perfect (probably as a result of because of the movie's age and contrast with modern society) but the imperfections could be ignored for it's truly wonderful feeling that reminds me of \"Mr. Smith goes to Washington\". A movie that should be seen by many politicians and anybody in power. It's just too bad that this movie came at the time of \"Sunset Boulevard\" and \"All About Eve\" because it seems to have been neglected as of late. Also, I would like to say to those who say Judy Holliday's performance isn't as deserving against Bette Davis' in All About Eve and Gloria Swanson's in Sunset Boulevard to figure out which one of the roles were the most difficult to play for each particular actress and in fact for any actress. I'm sure that Gloria Swanson's performance was difficult, but it was seemingly so close to her real life that it doesn't seem so difficult (Although that well known fact made 'Sunset Blvd' a greater Masterpiece). As for Bette Davis in 'All About Eve', it was also great but not very difficult for her (She never had a bad performance in her movie career). Anyway, I recommend this movie to anybody who wants a meaningful movie for a change.",
         "Any play that runs 1642 performances on Broadway for three years you know will wind up in Hollywood. But usually the Broadway cast never makes it intact. It didn't here, but we were lucky to get Judy Holliday to repeat her acclaimed Broadway role her as Billie Dawn, gal pal of junk tycoon Broderick Crawford. Judy only got the role because Rita Hayworth decided to marry Aly Khan and after testing several others who weren't quite right Harry Cohn decided to go with the original. She rewarded Cohn's late faith with a Best Actress Oscar for 1950. Speaking of Oscars, Cohn had an interesting problem on his hands which he solved with Born Yesterday. Broderick Crawford had brought home an Oscar the year before for All the King's Men. But Crawford was hardly traditional leading man material. But there sure were enough similarities with the dictatorial minded Willie Stark with the tyrannical Harry Brock so that Cohn could cast Crawford and keep the momentum going for his career. Crawford's part was played by Paul Douglas on stage who would get to Hollywood right around this time as well. Still neither Holliday or Crawford were box office and Columbia needed one name that had some guaranteed pull with movie audiences. That's where Bill Holden came in. The part was built up from the Broadway version, all that tourist business at the Capitol and other Washington sites were not on Broadway. The role of the intellectual newspaper reporter was played by Gary Merrill and Merrill was certainly better suited for the part than Holden. Personally I think that Cohn should have gone with his other reliable leading man, Glenn Ford in this part. Still even with the built up role Holden was a definite number three in this film. The plot is very simple, the magic of Born Yesterday is watching Holliday's character grow in awareness of what's around her. She's the play thing of junk tycoon Harry Brock, a self made millionaire who's street smart, rich, and nothing else. He's aware of it though and aware that Holliday lacks the social graces as well. Since Crawford can't or won't learn them, at least he wants a polished hostess to make up for it. He hires newspaper reporter Holden to teach Holliday. But he teaches her about democracy and the corrupting influence of special interests of which Crawford is one and she's now aware of. Crawford also put a lot of his holdings in her name for tax purposes. That's a created situation, Crawford regrets starting. Holliday became so identified with the Billie Dawn role that when she started having blacklisting problems due to her left wing politics, she went into character as Billie Dawn before Congress. The chumps in Congress actually bought it all and she skated. Actually in real life Holliday was a well read intelligent woman, the last thing from Billie Dawn you could imagine. Judy Holliday spent the remainder of her career between Broadway and Hollywood so her film output remains small and she died way too young. Still as another uneducated character in a film said, what there is, is cherce. Born Yesterday is as cherce as it gets.",
         "More often than not, I get annoyed at the sound of Oscar award winning (for this part) Judy Holiday's (né Judith Tuvim) voice but it served her character well in this moving drama in which she plays a dim witted and exploited partner of a uncouth and domineering man (Broderick Crawford). William Holden, as always, is very good in his role; this time he is the reporter hired to refine Holiday but falls in love with her. There are so many memorable scenes in this movie but I think the best ones are the card game between Judy and Broderick, the somewhat heavy handed references to Jefferson, and of course the comeuppance of Broderick. The supporting actors, especially Broderick's longsuffering lawyer are also more than competent in their complimentary roles. 8/10."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Columbia Pictures Corporation"],
      "summaries": [
         "Uncouth, loud-mouth junkyard tycoon Harry Brock descends upon Washington D.C. to buy himself a congressman or two, bringing with him his mistress, ex-showgirl Billie Dawn. Brock hires newspaperman Paul Verrall to see if he can soften her rough edges and make her more presentable in capital society. But Harry gets more than he bargained for as Billie absorbs Verall's lessons in U.S. history and not only comes to the realization that Harry is nothing but a two-bit, corrupt crook, but in the process also falls in love with her handsome tutor.",
         "A million dollar Tycoon hires a tutor to teach his lover proper etiquette."
      ],
      "budget": 0
   },
   "movielensId": 3341,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1950-12-25",
      "dvdReleaseDate": "2000-02-15",
      "directors": ["George Cukor"],
      "runtime": 103,
      "movieId": 3341,
      "title": "Born Yesterday",
      "mpaa": "",
      "actors": [
         "Judy Holliday",
         "Broderick Crawford",
         "William Holden",
         "Howard St. John",
         "Frank Otto",
         "Larry Oliver",
         "Barbara Brown",
         "Grandon Rhodes",
         "Claire Carleton"
      ],
      "imdbMovieId": "0042276",
      "originalTitle": "Born Yesterday",
      "genres": [
         "Comedy",
         "Romance",
         "Drama"
      ],
      "youtubeTrailerIds": ["upJ5pZdyZlM"],
      "plotSummary": "Uncouth, loud-mouth junkyard tycoon Harry Brock descends upon Washington D.C. to buy himself a congressman or two, bringing with him his mistress, ex-showgirl Billie Dawn.",
      "tmdbMovieId": 24481,
      "avgRating": 3.85417,
      "releaseYear": "1950",
      "numRatings": 1008,
      "posterPath": "/yxR3qG3SuqQIMpLwZvoofI1UyY4.jpg"
   }
}