{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "video nasty",
            "id": 189921
         },
         {
            "name": "splatter film",
            "id": 232871
         }
      ],
      "imdb_id": "tt0056875",
      "video": false,
      "title": "Blood Feast",
      "recommendations": [
         28170,
         28177,
         39899,
         47886,
         39342,
         27815,
         23506,
         24919,
         30931,
         39982,
         20850,
         28180,
         24777,
         34023,
         42793,
         39867,
         29343,
         27916,
         13553,
         56705
      ],
      "backdrop_path": "/581sl5pbNrGXTt3U3dc1jJewbD3.jpg",
      "revenue": 4000000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "Detective Pete Thornton (as Thomas Wood)",
               "gender": 2,
               "credit_id": "52fe457ec3a368484e05eae1",
               "name": "William Kerwin",
               "profile_path": null,
               "id": 99947,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "Fuad Ramses",
               "gender": 0,
               "credit_id": "52fe457ec3a368484e05eae5",
               "name": "Mal Arnold",
               "profile_path": null,
               "id": 99948,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Suzette Fremont",
               "gender": 1,
               "credit_id": "52fe457ec3a368484e05eae9",
               "name": "Connie Mason",
               "profile_path": "/4USOvJxeZHQyuVjdGxQJYWabXdJ.jpg",
               "id": 99949,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Dorothy Freemont",
               "gender": 0,
               "credit_id": "52fe457ec3a368484e05eaed",
               "name": "Lyn Bolton",
               "profile_path": null,
               "id": 99950,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Frank",
               "gender": 0,
               "credit_id": "52fe457ec3a368484e05eaf1",
               "name": "Scott H. Hall",
               "profile_path": null,
               "id": 99951,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Trudy Sanders (as Toni Calvert)",
               "gender": 0,
               "credit_id": "52fe457ec3a368484e05eaf5",
               "name": "Christy Foushee",
               "profile_path": null,
               "id": 99952,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Marcy",
               "gender": 0,
               "credit_id": "52fe457ec3a368484e05eaf9",
               "name": "Ashlyn Martin",
               "profile_path": null,
               "id": 99953,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Pat Tracey",
               "gender": 1,
               "credit_id": "52fe457ec3a368484e05eafd",
               "name": "Sandra Sinclair",
               "profile_path": null,
               "id": 99954,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "High Priest (uncredited)",
               "gender": 0,
               "credit_id": "52fe457ec3a368484e05eb01",
               "name": "Jerome Eden",
               "profile_path": null,
               "id": 99955,
               "order": 8
            },
            {
               "cast_id": 22,
               "character": "Woman at Lecture (uncredited)",
               "gender": 0,
               "credit_id": "58e5472dc3a368731a032dc4",
               "name": "Allison Louise Downe",
               "profile_path": null,
               "id": 99920,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Drunken Husband (uncredited)",
               "gender": 2,
               "credit_id": "52fe457ec3a368484e05eb05",
               "name": "David F. Friedman",
               "profile_path": "/oFi1eCcemfruKEGuHQClqCUOnKX.jpg",
               "id": 99934,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Garbage Truck Driver (uncredited)",
               "gender": 0,
               "credit_id": "52fe457ec3a368484e05eb0d",
               "name": "Craig Maudslay Jr.",
               "profile_path": null,
               "id": 99957,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "Radio Announcer (voice) (uncredited)",
               "gender": 2,
               "credit_id": "52fe457ec3a368484e05eb09",
               "name": "Herschell Gordon Lewis",
               "profile_path": "/ytxTXGOyeksGML0s99XSnLp5FZk.jpg",
               "id": 99916,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe457ec3a368484e05eaad",
               "name": "Herschell Gordon Lewis",
               "profile_path": "/ytxTXGOyeksGML0s99XSnLp5FZk.jpg",
               "id": 99916,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe457ec3a368484e05eab3",
               "name": "Herschell Gordon Lewis",
               "profile_path": "/ytxTXGOyeksGML0s99XSnLp5FZk.jpg",
               "id": 99916,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe457ec3a368484e05eab9",
               "name": "Herschell Gordon Lewis",
               "profile_path": "/ytxTXGOyeksGML0s99XSnLp5FZk.jpg",
               "id": 99916,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe457ec3a368484e05eabf",
               "name": "Herschell Gordon Lewis",
               "profile_path": "/ytxTXGOyeksGML0s99XSnLp5FZk.jpg",
               "id": 99916,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe457ec3a368484e05eac5",
               "name": "David F. Friedman",
               "profile_path": "/oFi1eCcemfruKEGuHQClqCUOnKX.jpg",
               "id": 99934,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe457ec3a368484e05eacb",
               "name": "Allison Louise Downe",
               "profile_path": null,
               "id": 99920,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe457ec3a368484e05ead1",
               "name": "Allison Louise Downe",
               "profile_path": null,
               "id": 99920,
               "department": "Crew",
               "job": "Makeup Effects"
            },
            {
               "gender": 2,
               "credit_id": "52fe457ec3a368484e05ead7",
               "name": "Herschell Gordon Lewis",
               "profile_path": "/ytxTXGOyeksGML0s99XSnLp5FZk.jpg",
               "id": 99916,
               "department": "Crew",
               "job": "Makeup Effects"
            },
            {
               "gender": 2,
               "credit_id": "52fe457ec3a368484e05eadd",
               "name": "David F. Friedman",
               "profile_path": "/oFi1eCcemfruKEGuHQClqCUOnKX.jpg",
               "id": 99934,
               "department": "Crew",
               "job": "Sound Recordist"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 2.389249,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 28172,
      "vote_count": 34,
      "budget": 24500,
      "overview": "In the sleepy suburbs of Miami, seemingly normal Egyptian immigrant Fuad Ramses (Mal Arnold) runs a successful catering business. He also murders young women and plans to use their body parts to revive the goddess Ishtar. The insane Ramses hypnotizes a socialite in order to land a job catering a party for her debutante daughter, Suzette Fremont (Connie Mason), and turns the event into an evening of gruesome deaths, bloody dismemberment and ritual sacrifice.",
      "similar": [
         764,
         21484,
         25239,
         24124,
         8689,
         7219,
         29702,
         19204,
         28794,
         12237,
         16395,
         15516,
         5486,
         24274,
         8691,
         25627,
         23761,
         39868,
         30062,
         5424
      ],
      "original_title": "Blood Feast",
      "runtime": 67,
      "poster_path": "/bH2GAITqQeJZsJPQBLhZXOlfjkH.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Friedman-Lewis Productions",
         "id": 4756,
         "origin_country": ""
      }],
      "release_date": "1963-06-06",
      "vote_average": 5.2,
      "belongs_to_collection": null,
      "tagline": "You'll Recoil and Shudder as You Witness the Slaughter and Mutilation of Nubile Young Girls - in a Weird and Horrendous Ancient Rite!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Herschell Gordon Lewis"],
      "runtime": 67,
      "synopsis": "In a suburban Miami house, a young woman arrives home and turns on her portable radio which broadcasts another murder, several within a few days. The woman turns off the radio and begins to take a bath. Suddenly, a gray-haired, wild-eyed man appears in the bathroom and brutally stabs the woman in her left eye, killing her. The man hacks off her left leg with a machete and leaves with it. The next day at the police station, Detective Pete Thornton reviews the latest murder to a homicidal maniac doing away with nearly five women now, and there are no clues. His chief superior advices him to continue perusing the case. At Fuad Ramses Catering store, Dorothy Freemont, a wealthy socialite, arrives where she arranges for Fuad to cater a party for her daughter Suzette. Fuad agrees to cater the party for Suzette and tells Mrs. Freemont that what he's preparing hasn't been prepared for over 5,000 years. Mrs. Freemont wants the catering done in two weeks and Fuad tells her that it will be enough time to get the last of his ingredients. After Mrs. Freemont leaves, Fuad ventures to the back storage room where he has a large gold statue of the \"mother of veiled darkness\" which is the goddess Ishtar. Fuad is repairing a blood rite for her in order for the goddesses resurrection. The solution that Fuad mixes in a huge vat, contains the parts of the dead women. That evening, two teenagers, Tony and Marcy, make out on a nearby beach when Fuad attacks them, subduing Tony and slices off the top of Marcy's head where he removes her brain to serve at the latest ingredient. Pete Thornton arrives on the scene with the police chief where after not getting much from the distraught Tony, interrogate Marcy's mother who can only tell Pete that her daughter belonged to a book club. At a local motel, Fuad is staking out the place when he sees a drunken sailor drop his wife off at her room before taking off. Fuad knocks on the woman's front door to the room and attacks her when she opens the door. Fuad rips the woman's tongue out of her mouth as another ingredient to his 'blood feast'. Pete continues to investigate this latest killing and also discovers that the latest murder victim also belonged to a book club too. Pete attends his weekly Egyptian studies lecture at the local university with his girlfriend, who happens to be Suzette. The lecturer tells them about the Cult of Ishtar, and describes how virginal women were sacrificed to the goddess on a altar as a blood offering to the Egyptian goddess. When the lecture is over, Pete takes Suzette out for a evening drive where she becomes worried about these events and of a serial killer loose in the area. Their date gets interrupted by their car radio which the announcer says that another victim has been found near death. Pete drops Suzette home and races to the hospital where the police chief is there and informs him that the maniac has struck again and hacked off the face of another woman named Janet Blake. Pete questions Janet in her hospital bed, in which the woman, with a bandaged face, tells the detectives that the man who attacked her was old with gray hair, with wild eyes, wearing a funny-looking dark suite, and he said something which sounded like \"Etar\". Janet Blake then dies, while Pete can't shake the feeling why that word sounds familiar. Fuad receives a letter from Trudy requesting a copy of the book 'Ancient Weird Religious Rites', which Faud Rames is the author. Fuad calls Trudy's home phone number and learns that she's staying with Suzette. That afternoon, Fuad stakes out the Freemont residence and kidnaps Trudy from the grounds and takes her to his store. He whips her savagely and collects her blood, the last ingredient to his solution for his goddess. With Trudy missing, Mrs. Freemont insists that the party continue. Pete calls Suzette to inform her that he will be late in arriving. Meanwhile, Fuad arrives with his food that he bakes at his store. Elsewhere, Pete calls upon the college lecturer and gets more information about the Cult of Ishtar and about the book that Fuad Ramses had wrote and figures out that Fuad is the killer since all the victims were women who personally called upon him to send them copies of his book. Pete and the police race over to Fuad Ramses' store and find Trudy's chopped-up body in the back of the store. Pete tries to call Suzette to warn her, but at coincidently the same time, Fuad cuts the phone line to the Freemont house. At the Freemont party, Fuad is ready with the food, but he first asks Suzette to come into the kitchen to help him. He has Suzette lie on a counter, which he makes his altar, and say a prayer to Ishtar, as he prepares to stab her in the chest with a butcher knife as a final offering to his goddess. But this takes forever because she can't take him seriously. Dorothy Freemont interrupts Fuad just as he's about to stab Suzette, and Fuad escapes just as the police arrive. Pete and the rest of the police chase Fuad through a nearby garbage dump where Fuad attempts to escape by climbing into the back of a departing garbage truck. But the truck's compact blades turn on and Fuad is crushed to death. The police stop the truck and see there's not much left of Fuad Ramses as Pete puts it, \"he died a fitting end, just like the garbage he was.\"",
      "writers": ["Allison Louise Downe"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0056875/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk0MDc0ODIzNl5BMl5BanBnXkFtZTcwNDU2MzAyMQ@@._V1_SY317_CR10,0,214,317_AL_.jpg",
      "actors": ["Stars: William Kerwin, Mal Arnold, Connie Mason | See full cast and crew »"],
      "reviews": [
         "This is the splatter anticlassic all us sickos know and love. The non-plot is, well, pretty simple and it's only an excuse to cut loose with loads of very extreme gore and sadism. Fuad Ramses (Mal Arnold), an Egyptian maniac of pagan bloodlust, must serve up a \"blood feast\" to Ishtar, his horrible goddess of gory days gone by. Y'know, back when chicks used to get their hearts yanked out on altars IN BLOOD COLOR! How does he get the morsels for his feast? It's an easy guess! Tongues pulled out. Limbs cut off. Brains hacked out in a blood-splattered mess. It's the grand-daddy of all the sickest stuff you've ever seen, and even though it's pretty stupid and bad, it sure is fun! It's even funny on purpose (as well as the other way around). For those of you who dig this unsavory and depraved type of junk the way I do, find this bad mother as soon as possible and surrender to the forbidden pleasures of the first splatter-comedy ever! (I think...)",
         "Oft-credited as the first traditional \"gore\" pic, 'Blood Feast' establishes all of typical conventions of the genre; including nubile, young women (including a Playboy Playmate), excessive blood and guts, and even some dark humor (including the \"hamburger\" line and the trash-compactor ending). It's also inept in every way, from the atrocious acting and horrible directing to the dumb-as-dirt characters. Hell, the most intelligent character in this movie is the murderer, Faud Ramses - what, with him having penned a seemingly popular non-fiction work and running a bang-up catering business to boot - and even he is not too bright, which unfortunately catches up with him in the end. If you love bad movies in that MST3K kind of way, than this is one to see. It's laugh-a-minute riot (and you've go to love the score). So put down that copy of 'Ancient Weird Religious Rites' and check this movie out.",
         "Blood Feast by H. G. Lewis was the first splatter film ever made, and it changed the path of the horror film forever. Its importance, whether good or bad, is undeniable. The film is in many ways the very essence of amateurishness. I do not believe I have ever seen a film where no one...and I mean no one...had ANY acting ability. For me, the only one that comes closest is Mal Arnold as the Egyptian caterer Fuad Ramses. These people cannot laugh, cry, scream, or even speak with any degree of credibility at all. I mean you would have to train people to get results like this if you had wanted them to be like this in the first place. I can only think that maybe with the leads being so poor...the other actors had no inspiration. The direction is not a great deal better...but then the film was made in 9 days. The script is silly and filled with lamentable dialogue where every facet of the plot must be explained and re-explained. What then does this \"classic\" have going for it? Well, it is fun to watch. It will make you laugh at its unreal gore and its poor acting and direction. The gore is a given and it is abundant....bright red dapples and drapes the bodices of many victimized girls...all of which I might point out are very easy on the eyes...another plus for male viewers. The music, created by Lewis, is surprisingly very good and stylish, helping create the mood and pacing of the film. All in all, I recommend seeing Blood Feast for its ineptitude and the laughs it will derive. If you are a fan of horror, it is a must see to satisfy your curiosity of what caused the change from good horror stories to graphic horror films. The answer lies with Blood Feast.",
         "anyone who views themselves as a serious horror fan should praise HG Lewis as GOD!!! although his movies are dated and somewhat cheesy by todays jaded standpoint, without his contributions, the horror genre would not be what it is today. this film is the first of the revolutionary (for their time...) \"trilogy of blood\", which were among the first films ever to show graphic depictions of bondage,blood, mutilation and all things near and dear to true horror fans hearts. obviously upon current viewing of the film, the gore effects will seem amateurish and silly, but you have to remember, this film was made in 1963. NO ONE was making films like this back then and we can all thank Mr. Lewis for his contributions, because without them, horror would not be what it is today. 8 1/2 out of 10 for the genre also see \"The GORE GORE GIRLS\" (aka BLOOD ORGY) - in my opinion the best (and goriest Lewis film)",
         "Some day, I hope to travel to Clearwater, Florida, to place a manikin leg before the Sphinx in the patking lot, in honor of this classic of trash cinema which was filmed there. This is the one film I can think of that succeeds brilliantly in every frame to be deeply entertaining because it's so profoundly inept. Though I have, on repeated viewing, developed a special fondness for Mal Arnold's interpretation of Fuad Ramses. It's the essence of camp. He might have been a neighbor on Pee-Wee's Playhouse! Has anyone else noticed the perverse giddiness of the scenes where he fondles womens' entrails? There's a cut-rate irony at work here, too. The only things happening in this town are Suzette Fremont's party and those horrible murders. Yet only we, the audience, know that they're related. And what about that book club? Do they only offer one title? Also, the tongue-pulling scene had to be the first occurance of slapstick gore. I mean, he didn't knock her out or anything. He just jammed his fingers into her mouth as soon as she opened the door. And she didn't particularly struggle with him. She just went \"Ngaahhh!\" and \"Lleeehhh,\" as he yanked. And when he got the tongue out, it was about a foot long. Did it get stretched out of shape like taffy? For a movie to be that entertaining to me every time I've watched it (which must be more than fifty by now)represents some weird kind of accomplishment. Do yourself a favor and buy the DVD. This is perhaps the best unintentional comedy ever made!",
         "From a technical standpoint, this movie is awful. But, you still have to give credit to Lewis and Friedman for creating a new genre of film; the splatter flick. For this reason, and probably this reason alone, I rate it at 6. Well, you have to give Lewis credit for the musical score that he did himself. The electric organ and opening shot of the Sphinx is hilarious. The writing and acting, though, are deplorable. This is an exploitation movie in the mold of the circus sideshow. The ad campaign for the movie made it appear to be more than it really was. In fact, a \"nurse\" was on hand at showings to assist those who might become overwhelmed by the horror presented on the screen. Many of the scenes, like the one with the woman's tongue being ripped out of her mouth (from what I understand, it was a sheep's tongue purchased from a local butcher)are quite revolting and unsettling. Actually, this is a part of what is known as the Blood Trilogy along with Lewis' better made, Two Thousand Maniacs. The third film is Color Me Blood Red.",
         "Herschell is maybe my favorite gore director. The person who invented genres off handedly, does it again - for the first time! Wonderful colors, very disturbing plot. John Waters used to watch these films as a young man. One could see Herschell's effect on Waters later films like 'Pink Flamingos' when you look at Herschells colors (color me blood red) and the trashy- campy acting, costumes and settings. When I think of flesh Water's star Divine - i have to admit - Waters saved some of that gore effect that Herschell has in his films. The effect of real fleshy gore!",
         "My rating is a kind of anti-rating. Is this a fine film? No. Is the plot compelling? No. Are the actors top-notch emoters? No, no, and thrice no. Are the gore effects convincing? Absolutely not! Is the film a work of sheer visionary genius? Yes! Sort of, in an alternative film-making universe kind of way. Fuad Ramses is one of the greatest/most bizarre cinematic creations I have had the pleasure of seeing. His logic is fantastic, and if for nothing else, he deserves kudos for outrunning a number of fully-fit police officers, and him with a conspicuous (read sinister) limp! Ramses' enunciation of his lines is brilliant and I am now searching for an opportunity to slide \"a feast...last...given...five...thousand...years...ago\" into an everyday conversation. Add not very bright police officers, one of whom is clearly Basil Exposition's father, and a series of splendid (and ground-breaking, it must be said) gore set-pieces, and you have genius. So, let us all raise a glass to Mr. Lewis and proclaim Blood Feast as the warped work of art it most surely is.",
         "Herschell Gordon Lewis' cautionary tale of wanting to be too cultured. Ramses, a shop owner with disturbingly large eyebrows, offers clueless white people a taste of old world Egypt in what is called a blood feast. This turns out to be a cannibalistic ritual needed to resurrect an ancient Egyptian deity. This movie gives you everything you'd expect and more. While using an over abundance of fake syrupy blood, shaking camera effects and plenty of severed body parts, it seems more bizarre than gorey. It does feature plenty of terrible single shot dialogue and a sparse single instrument score. This is the exploitation film that makes you love exploitation films.",
         "Herschell Gordon Lewis's pioneering 'gore' movie is one of those films, like 'Plan 9 From Outer Space', which is entertaining due to its sheer ineptitude. Almost everything that could go wrong, does go wrong. The acting ranges ranges from ridiculously over-the-top (Mal Arnold) to so wooden it makes the furniture look animated (Lyn Bolton and Playboy Playmate Connie Mason). The music is truly appalling, including hilariously misjudged musical 'stings' and out-of-tune strings. The editing, especially in the opening scene, is some of the worst you will ever see. The story is little more than an excuse to show a lot of very bloody (but also very unconvincing) gore. However, the film has plenty of unintentional laughs and is more enjoyable than much of the slick, soulless Hollywood 'product' that gets churned out at an alarming rate each year. A must for all lovers of Z-Grade exploitation."
      ],
      "genres": ["Horror"],
      "productionCompanies": ["Friedman-Lewis Productions"],
      "summaries": [
         "Egyptian caterer busies himself collecting body parts from young maidens in order to bring Ishtar, an ancient goddess of good and evil back to life. When he has prepared enough parts for the ceremony, he hypnotizes a woman giving an engagement party for her daughter, at which he plans to perform the ancient rites of summons, using the daughter as his final sacrifice.",
         "Mrs. Dorothy Fremont wants to throw a very special dinner party for her daughter Suzette. She calls on a local caterer, Fuad Ramses, who promises to prepare her an Egyptian feast, one that has not been prepared for 5,000 years. Suzette's boyfriend, police detective Pete Thornton, is investigating a series of grisly murders. Someone has been attacking young women and harvesting various organs and body parts. What no one realizes is that Fuad Ramses is the killer and needs the body parts to resurrect a long dead goddess.",
         "An Egyptian caterer kills various women in suburban Miami to use their body parts to bring to life a dormant Egyptian goddess, while an inept police detective try to track him down."
      ],
      "budget": 24500
   },
   "movielensId": 3344,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1963-06-06",
      "dvdReleaseDate": "2000-02-22",
      "directors": ["Herschell Gordon Lewis"],
      "runtime": 67,
      "movieId": 3344,
      "title": "Blood Feast",
      "mpaa": "",
      "actors": [
         "William Kerwin",
         "Mal Arnold",
         "Connie Mason",
         "Lyn Bolton",
         "Scott H. Hall",
         "Christy Foushee",
         "Ashlyn Martin",
         "Sandra Sinclair",
         "Jerome Eden",
         "Allison Louise Downe",
         "David F. Friedman",
         "Craig Maudslay Jr.",
         "Herschell Gordon Lewis"
      ],
      "imdbMovieId": "0056875",
      "originalTitle": "Blood Feast",
      "genres": ["Horror"],
      "youtubeTrailerIds": ["frxdl1AB9NA"],
      "plotSummary": "In the sleepy suburbs of Miami, seemingly normal Egyptian immigrant Fuad Ramses (Mal Arnold) runs a successful catering business. He also murders young women and plans to use their body parts to revive the goddess Ishtar. The insane Ramses hypnotizes a socialite in order to land a job catering a party for her debutante daughter, Suzette Fremont (Connie Mason), and turns the event into an evening of gruesome deaths, bloody dismemberment and ritual sacrifice.",
      "tmdbMovieId": 28172,
      "avgRating": 2.83136,
      "releaseYear": "1963",
      "numRatings": 169,
      "posterPath": "/bH2GAITqQeJZsJPQBLhZXOlfjkH.jpg"
   }
}