{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "gore",
         "id": 10292
      }],
      "imdb_id": "tt0059044",
      "video": false,
      "title": "Color Me Blood Red",
      "recommendations": [
         80671,
         54127,
         27566,
         39342,
         27625,
         48885,
         80676,
         42598,
         32623,
         28170,
         85165,
         51260,
         54116,
         31275,
         35642,
         34023,
         28177,
         122677,
         40065
      ],
      "backdrop_path": "/jjncSgpFOmIlKdtEY5s7akgNAUp.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Adam Sorg",
               "gender": 2,
               "credit_id": "52fe457fc3a368484e05edc1",
               "name": "Gordon Oas-Heim",
               "profile_path": null,
               "id": 99963,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "April Carter",
               "gender": 0,
               "credit_id": "52fe457fc3a368484e05edc5",
               "name": "Candi Conder",
               "profile_path": null,
               "id": 99978,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Gigi",
               "gender": 0,
               "credit_id": "52fe457fc3a368484e05edc9",
               "name": "Elyn Warner",
               "profile_path": null,
               "id": 99982,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Rolf",
               "gender": 0,
               "credit_id": "52fe457fc3a368484e05edcd",
               "name": "Jerome Eden",
               "profile_path": null,
               "id": 99955,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Sydney",
               "gender": 0,
               "credit_id": "52fe457fc3a368484e05edd1",
               "name": "Patricia Lee",
               "profile_path": null,
               "id": 64350,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Farnsworth",
               "gender": 0,
               "credit_id": "52fe457fc3a368484e05edd5",
               "name": "Scott H. Hall",
               "profile_path": null,
               "id": 99951,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe457fc3a368484e05eda5",
               "name": "Herschell Gordon Lewis",
               "profile_path": "/ytxTXGOyeksGML0s99XSnLp5FZk.jpg",
               "id": 99916,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe457fc3a368484e05edab",
               "name": "Herschell Gordon Lewis",
               "profile_path": "/ytxTXGOyeksGML0s99XSnLp5FZk.jpg",
               "id": 99916,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe457fc3a368484e05edb1",
               "name": "Herschell Gordon Lewis",
               "profile_path": "/ytxTXGOyeksGML0s99XSnLp5FZk.jpg",
               "id": 99916,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe457fc3a368484e05edb7",
               "name": "David F. Friedman",
               "profile_path": "/oFi1eCcemfruKEGuHQClqCUOnKX.jpg",
               "id": 99934,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe457fc3a368484e05edbd",
               "name": "David F. Friedman",
               "profile_path": "/oFi1eCcemfruKEGuHQClqCUOnKX.jpg",
               "id": 99934,
               "department": "Crew",
               "job": "Sound Recordist"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 1.220018,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 28180,
      "vote_count": 18,
      "budget": 50000,
      "overview": "Gore specialist H.G. Lewis' gruesome tale of an artist who becomes a success after using human blood in his paintings.",
      "similar": [
         341006,
         10185,
         294963,
         10781,
         24920,
         21407,
         199534,
         588,
         948,
         381288,
         74997,
         19204,
         23730,
         923,
         12662,
         434873,
         9792,
         273477,
         9373,
         1991
      ],
      "original_title": "Color Me Blood Red",
      "runtime": 79,
      "poster_path": "/bz4CJiZGOUDNPDqzGlGAA8ruC0F.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Box Office Spectaculars",
         "id": 4758,
         "origin_country": ""
      }],
      "release_date": "1965-10-13",
      "vote_average": 4.9,
      "belongs_to_collection": null,
      "tagline": "Fiendish is the word for it!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Herschell Gordon Lewis"],
      "runtime": 79,
      "synopsis": "At the Farnsworth Galleries, Farnsworth looks at a painting is evidently admires and reluctantly picks the canvas up and takes it outside. He drops it to the ground, saturates it with gasoline and sets it afire. Blood pours out of the canvas as it burns. Artist Adam Sorge stands before a blank canvas, paints it a bit, and angrily throws it aside. He selects another canvas, and places it on the easel, but is upset because he cannot get the right color. Gigi, Adam's live-in girlfriend and model, enters the room and Adam accidentally hits her with his paintbrush. Gigi tells Adam that he is due at the Farnsworth Galleries in one hour and critics will be there. Adam arrives at his showing where an art critic, named Gregorovich, is talking with Farnsworth. Gregorovich tells that due to his less-than-impressive use of color, he is an \"artist imposter\". Adam argues with the critic and leaves, passing Mrs. Carter who admires Adam's past work that is on display. The next day, Farnsworth goes to Adam's house to pick up a new painting. He tells Adam that he feels the same way as Gregorovich about Adam's use of color. Farnsworth takes another painting and leaves, and Adam beats a painting, leaving the broken frame on the floor. Adam and Gigi then spend some intimate time in the bedroom and afterwards, Gigi bends over to pick up the destroyed painting and cuts her finger on a nail. Adam later sees the smeared blood on the canvas and checks it outside with the other paintings. Gigi comes into the room and apologies about the blood, when Adam picks up a rough sketch of a woman and places it on the easel. He asks Gigi to open the wound and he cuts her finger with a razor and \"paints\" by smearing her blood on the canvas. Gigi pulls her finger away and tells him to use his own blood. Adam cuts all of his fingers and paints with his blood until he is weak and collapses on the couch. After resting for a while, Adam looks at his painting. Gigi talks about how he phoned Farnsworth and told him that he had something big, and she wonders where he is going to get the blood to finish the painting. Suddenly, Adam stabs Gigi in the face and uses her bloody head as a brush to finish the painting. Adam buries Gigi's body in the sand hear his house and the next day, he takes the finished painting to the gallery to show everyone. Gregotovich declares it Adam's \"finest.\" Mrs. Carter is there and agrees to Farnsworth's high price of $15,000 to purchase the painting. But Adam tells them that the painting is not for sale. Gregotovich challenges Adam to paint another masterpiece and Adam agrees. Meanwhile, Mrs. Carter is talking with her daughter April, who is going on a picnic with her boyfriend Rolf, and two other friends, Jack and Sydney. At Adam's house, he prepares to cut his fingers again to paint a new painting, when he sees April and her friends on the beach near his house. Adam goes out to spy on them and wait to jump on them so he can kill them and use their blood, but he gets diverted when he sees another couple, named Norman and Betsy, nearby kissing each other on a beach towel. Betsy wants to ride two water bikes that are in the water near Adam's house. As they are doing so, Adam approaches them in a motorboat where he attacks and stabs Norman in the chest with a spear killing him as Betsy screams. Adam subdues her and takes her away. Later, Adam is seen painting a new canvas with blood. He goes in to the next room where the dead Betsy is tied to a wall with her intestines and innards hanging out of her stomach. Adam squeezes more blood out of the disemboweled girl and finishes his painting. He takes it the following day to the gallery and again refuses to sell it. Adam storms out of the gallery, and Gregorovich notes that the painting is still wet and that Adam forgot to varnish it. A few weeks later, Adam is beside himself in his house, more or less a recluse. Mrs. Carter is at her home also wondering why she hasn't heard from Adam for this whole time. April then goes out with Rolf and their two friends again for another beach party. Adam watches them from a distance. When April ventures near Adam's house, Adam takes a canvas outside and pretends to be painting. Adam tells the curious April that he is looking for a model and he asks her to pose. After he tells April his name, she tells him that her mother is Mrs. Carter who wants to buys some of his paintings. Adam tells April that if she poses for him, she can have the painting for free. April returns to her friends near the beach and tells them about meeting Adam and she will be going back later in the evening. That evening, Adam lets April into his house where she notes blood-like paint in his picture, and after she makes a joke about putting blood into the work, Adam explodes at her and says that the joke is not funny to him. April wants to leave, but Adam convinces her to stay, and has her stand on a small stepladder. In order to keep her hands still, Adam ties up April's wrists and restrains her. Meanwhile, Jack and Sydney go looking for some firewood for a fire they make on the beach. Sydney finds Gigi's badly decomposed, half-buried corpse and screams for Jack. They show the body to Rolf who runs towards Adam's house with a flashlight. In the house, Adam tells April to turn away from him for a few seconds and he will be done... as he lifts up a large axe to kill her. Rolf runs inside where he acts rudely towards Adam. Seeing the axe Adam has, Rolf grabs a nearby shotgun and points it at Adam keeping him at bay as he unties April. But Adam knocks the shotgun out of Rolf's hands and talks about how he \"immortalizes\" Gigi by keeping her alive in his painting and using peoples blood to \"immortalize\" them as well. When Jack and Sydney run into the house and momentarily distract Adam, Rolf grabs the shotgun. Adam lifts his axe to kill Rolf when he fires, hitting the deranged artist in the face. Adam stumbles and falls dead with his bloodied face on a blank canvas. The final scene picks up where the opening scene left off where Farnsworth is burning Adam's painting after it is made public about the insane artist using peoples blood for his paintings. Gregorovich arrives just as Farnsworth stands looking at the burning canvas where he tells the critic that he is burning Adam's \"funeral pyre\".",
      "writers": ["Herschell Gordon Lewis"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0059044/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNjkzMDgxNTI1Ml5BMl5BanBnXkFtZTcwMDQ5NzIyMQ@@._V1_SY317_CR10,0,214,317_AL_.jpg",
      "actors": ["Stars: Gordon Oas-Heim, Candi Conder, Elyn Warner | See full cast and crew »"],
      "reviews": [
         "Hershell Gordan Lewis, you all should know him from his cult classics like \"Blood Feast\", \"2000 Maniacs!\", \"Wizard of Gore\", \"Blood Feast 2\", etc. \"Color Me Blood Red\" is the third installment in his notorious \"Blood Trilogy\" series and holds its own as a genre favorite. Although, this movie has nothing to do with the other two films (not like 2000 Maniacs! has anything to do with Blood Feast) it is still a lot of fun. The story opens with a disgruntled artist who isn't getting enough respect from the local art critic. His girlfriend is quite annoying and after she nicks her finger on a nail and gets blood all over a painting the artist gets the idea to start cutting his fingers and painting with the blood. After draining as much blood as he can from himself, he murders his girlfriend by stabbing her in the head and then wiping the blood all over the picture he has been working on. He then brings the picture to the local critic who believes it to be the best piece of art since Picasso. Having such success, the crazed artist wants to make more work in the same fashion. Can you guess what happens from there? This was a fun flick. Although, it wasn't Gordan's most disgusting movie it still has certain moments that are cringe-worthy. Look for a scene in which the artist is squeezing blood out from a woman's intestines. Pretty gruesome for the time. 7/10",
         "\"Color me Blood Red\" completes the infamous Blood-trilogy by the even more infamous director Hershell Gordon Lewis and, although my least favorite film of the three, it's another silly entertaining and smutty gore classic. Don't look for many film-making qualities here, as the story is rather unoriginal (imitating Roger Corman's 1959 \"Bucket of Blood\"), the acting is unspeakable and \u0096 especially compared to \"Two Thousand Maniacs\" \u0096 it's clumsily edited together. Good old Lewis brings the art of finger painting to a whole new dimension here, when mentally unstable artist Adam Sorg discovers that the blood of his girlfriend's cut finger supplies him with the exact right shade of red he needs for his macabre paintings. He's going to need more, of course, and thus he kills her as well as various other models in order to complete his masterful art gallery exhibits. I spotted LESS gore than in the previous two Blood-trilogy films, still there are some effectively nauseating scenes, most notably the one where Sorg literally squeezes all the blood out of one his victims' intestines. Other than the gore, there are the hilariously inept dialogues and the complete lack of context to enjoy. If you're not into The Godfather of Gore's work, however, this will just seem like a mindless and sadistic trash-movie.",
         "Just what does a teenage boy bursting with testosterone say, while with his bikini-clad girl, they discover a dead girl in the sand? \"Wholly Bananas ! It's a girl's leg!\" of course. That is just one example of the laughable dialogue contained in this thoroughly un-artistic look at a painter who uses blood to create his art. He starts by using his own, then moves to girl models for their hemoglobin, corpuscles, and plasma for his creative inspiration. Color Me Blood Red is the third film contained in what is typically known as the Blood trilogy directed by that world renowned director of gore...Herschell Gordon Lewis. Yep this film has all the Lewis trademarks. Poor direction...it has it! Cheap sets too! And that acting only Lewis seems to inspire...so bad it is funny. Many of the performers in here are so awful that one wonders how they were ever chosen, although the lead, Gordon Oas-Heim(Don Joseph) as Adam Sorg shows signs of mediocrity at times. For a Lewis film, Color Me Blood Red is a fun picture. It has some good honest to Gosh belly laughs(99% unintentional), and a story not too unlike Roger Corman's A Bucket of Blood. And the lead actress...Candi Conder does more than AMPLE justice to a very nice swimsuit! I had fun watching it...never took any of it serious and, for a Lewis picture, it has minimal gore(only four deaths). It gives new meaning to the phrase that life is a canvas!",
         "If you're a horror fan who loves gore and are looking for a gory movie, go check out High Tension. If you hate cheesy movies, go rent a new release from Blockbuster. This movie is for people who like quirkiness, b-grade film-making, c-grade acting, cheesy gore and.. FUN. I get the feeling that a few people who wrote reviews for this were obviously expecting something very different. This is NOT a horror movie, only in a very broad sense could it be considered one. It is a movie that is twice as unintentionally funny as any Ed Wood movie. There is no real comedy in Color Me Blood Red but the acting and direction will have you laughing throughout. This movie defines \"grindhouse\". Now that I've prepared you - Go buy it. I rated this movie 8 out of 10. It was very good at doing what it tried to do. Giving this movie a 3/10 is a joke, of course it's bad but that is the whole point! A phrase I see a lot on the IMDb is \"BAD meaning GOOD\", not many movies are more deserving of that praise than Color Me Blood Red.",
         "After seeing the first two installments of the Blood Trilogy, Blood Feast and 2,000 Maniacs, I was a bit skeptical about watching the final film, Color Me Blood Red. It's not that the first two were awful, but by no means can they be considered good either. With that in mind, and the usual conclusion that the third part of trilogies are sometimes \"lacking\", I put the movie in my DVD player and assumed I'd be stuck counting the seconds go by on my clock. Could I have been more wrong! This movie is awesome! It's got just the right amount of nonsense and low budget feeling to it, and really pulls out some decent acting abilities from the lead character in the film, our beloved murderer/painter. The way he reacts with the story and physically and mentally decomposes throughout the movie is pretty convincing. The viewer really gets a sense that this is a troubled guy who turns to some sick methods to prove that he truly is a great painter. With the help of a dorky team of teenagers, that perfectly resemble the generation they exist in, this movie was really able to provide a solid viewing experience. It is with that said, that I declare Color Me Blood Red as the best of the Blood Trilogy. That's not to say the Blood Trilogy wasn't worth the purchase I made (it was interesting to see the origins of gore) but without a doubt, this movie stands alone from the other two. Even if there never was a Blood Trilogy , even with the absence of Blood Feast and 2,000 Maniacs, this movie stands alone as a great example of how story and gore can sometimes mix for the best. And with horror movies these days not understanding that, it's nice to see you can always pull out an old b-movie and enjoy a good story and blood & guts at the same time. Overall, 8 out of 10.",
         "You gets what you pays for with Herschell Gordon Lewis movies. If you are looking for a great, original plot with interesting characters, well acted and impressively directed, then don't look here. But if you want to see a silly Roger Corman rip-off with lots of unintentional cheap laughs, and plenty of HGL's trademark, then you're in the right place. 'Color Me Blood Red' is the last in Lewis' Blood Trilogy, and is the second best of the three in my opinion. ('Two Thousand Maniacs!' just beats it for sheer entertainment value). Don Joseph plays a tormented artist who discovers a way out of his artistic rut - blood, lots of it. Joseph's acting is variable at best, but possibly the best seen in a HGL movie, and he comes across as a corny, poor man's Timothy Carey. Which may not be much, but it's enough, and his performance stands out from the rest of the inept cast, especially the bizarrely unbeatnik beatnik teens (WHAT was that all about?!), and William Harris' stupid art critic character. 'Color Me Blood Red' is dumb, no doubt about that, but it's dumb FUN, and should be seen by every horror movie buff for its historical interest if nothing else.",
         "This is the final film in the infamous Blood Trilogy from director Herschell Gordon Lewis and producer David Friedman. The trilogy also includes superior films \"Blood Feast\" and \"Two Thousand Maniacs\". While \"Color Me Blood Red\" is the most inferior film in the trilogy, it is still worth at least a one time viewing. The film does lack one thing that the other 2 films in the trilogy have and that is an original score. Both of the previous entries include a soundtrack that was scored by Lewis himself but for some odd reason he decided to use \"canned\" music for this one. The gore effects are also inferior to the other 2 entries...there aren't as many but one effect in particular is especially grotesque (this would be the scene where a woman is shown strung from the ceiling with her intestines dangling out and the villain squeezes the blood out of them in order to finish his painting). All in all this is one of the least entertaining of Lewis' gore films but is definitely worth a peek.",
         "it's fun to see with an audience going bananas over it... that said the DVD is very good, the print is really good quality. it's a very good looking movie and lots of fun and I like its take on art and violence and snobbery and \"daddy-o\" ness. it's definitely my favorite of the \"trilogy\". oh I need more lines. how about one from the movie, \"Her blood, you, you used it as paint!?!!?\" \"It's quite the thing to own a Sorge painting!\" \"there is one great painting in all of us.\" \"that caviar critic Farnsworth!\" I still need more lines? I mean how much is there to say about \"Color Me Blood Red\" for goodnessakes!",
         "Hershell Gordon Lewis writes, directs and photographs COLOR ME BLOOD RED...just another of the bloody messes he is noted for. Adam Sorg(Don Joseph)plays a psychotic and obnoxious artist that gets acclaim for painting with his own blood. His art is sold at high end prices, but those rendered in his own blood are not for sale. He realizes that his supply is low; so in order to keep his career going...he starts stabbing and hacking young girls. The rude and crude artist seems to have no conscience. My favorite scene is where Sorg is squeezing blood out of a victim's intestine. This piece of splatter is filmed entirely in Sarasota Florida. Others in the cast: Candi Conder, Patricia Lee, Scott H. Hall, Elyn Warner and Jerome Eden.",
         "Color Me Blood Red has a few good moments. I can honestly say it grossed me out a couple of times (I don't like razors.) The movie has a plot that keeps it fairly entertaining. The major down-fall is its low budget with some poor acting from the bit players. Some scenes are so bad they are funny which helps it. Overall grade: C-"
      ],
      "genres": [
         "Comedy",
         "Horror"
      ],
      "productionCompanies": ["Box Office Spectaculars"],
      "summaries": [
         "An eccentric artist is panned by a well-known critic at his opening for not having a good color sense, so he starts a new series, using his own blood to paint. Soon he is weakened and must find other sources of blood to continue his paintings.",
         "A crackpot artist kills various people to use their blood as his new crimson red color for his paintings."
      ],
      "budget": 50000
   },
   "movielensId": 3346,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1965-10-13",
      "dvdReleaseDate": "2000-02-22",
      "directors": ["Herschell Gordon Lewis"],
      "runtime": 79,
      "movieId": 3346,
      "title": "Color Me Blood Red",
      "mpaa": "",
      "actors": [
         "Gordon Oas-Heim",
         "Candi Conder",
         "Elyn Warner",
         "Jerome Eden",
         "Patricia Lee",
         "Scott H. Hall"
      ],
      "imdbMovieId": "0059044",
      "originalTitle": "Color Me Blood Red",
      "genres": ["Horror"],
      "youtubeTrailerIds": [
         "p4MBvumllXY",
         "Q5uYM9WmF_E"
      ],
      "plotSummary": "Gore specialist H.G. Lewis' gruesome tale of an artist who becomes a success after using human blood in his paintings.",
      "tmdbMovieId": 28180,
      "avgRating": 2.54412,
      "releaseYear": "1965",
      "numRatings": 34,
      "posterPath": "/bz4CJiZGOUDNPDqzGlGAA8ruC0F.jpg"
   }
}