{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "revenge",
            "id": 9748
         },
         {
            "name": "escape from prison",
            "id": 9777
         },
         {
            "name": "suspense",
            "id": 9937
         }
      ],
      "imdb_id": "tt0066141",
      "video": false,
      "title": "The Night Visitor",
      "recommendations": [
         42593,
         76018,
         179254,
         29397,
         86242,
         89725,
         47922,
         29491,
         98106,
         85192,
         34006,
         85498,
         88174,
         64076,
         84422,
         36848,
         84419
      ],
      "backdrop_path": "/znzKoNTnR4p8K0DvM9TlFMQVTRZ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Salem",
               "gender": 2,
               "credit_id": "52fe4857c3a368484e0f3f2f",
               "name": "Max von Sydow",
               "profile_path": "/nwRB1DDylWFC4120kfbtPq2pZzA.jpg",
               "id": 2201,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "The Inspector",
               "gender": 2,
               "credit_id": "52fe4857c3a368484e0f3f33",
               "name": "Trevor Howard",
               "profile_path": "/drj1FPryhAimWCiufEnMLzUxpBQ.jpg",
               "id": 12726,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Ester Jenks",
               "gender": 1,
               "credit_id": "52fe4857c3a368484e0f3f37",
               "name": "Liv Ullmann",
               "profile_path": "/5u8fikv8ANDx5FJhLtvhZmBZtRa.jpg",
               "id": 11916,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Dr. Anton Jenks",
               "gender": 2,
               "credit_id": "52fe4857c3a368484e0f3f3b",
               "name": "Per Oscarsson",
               "profile_path": "/qCSUP6c7jz8kgJrGEX4tKDf8emr.jpg",
               "id": 3855,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Mr. Clemens",
               "gender": 2,
               "credit_id": "57de6902c3a3680956003ff1",
               "name": "Rupert Davies",
               "profile_path": "/3FXttkL0EPViEfgdyVUvcWacTwG.jpg",
               "id": 74689,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4857c3a368484e0f3f2b",
               "name": "László Benedek",
               "profile_path": null,
               "id": 89981,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5480db30c3a36829ae003877",
               "name": "Guy Elmes",
               "profile_path": null,
               "id": 567805,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Horror",
            "id": 27
         }
      ],
      "popularity": 0.660717,
      "production_countries": [
         {
            "iso_3166_1": "SE",
            "name": "Sweden"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 72086,
      "vote_count": 7,
      "budget": 0,
      "overview": "An insane Swedish farmer escapes from an asylum to get revenge on his sister, her husband and others.",
      "similar": [
         357096,
         74997,
         588,
         156022,
         3134,
         9373,
         10781,
         25239,
         15069,
         979,
         24,
         238636,
         281,
         395834,
         3600,
         10576,
         8456,
         281957,
         37835,
         663
      ],
      "original_title": "The Night Visitor",
      "runtime": 106,
      "poster_path": "/eecW5FK54V7EQIll84wvIqlcRik.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Hemisphere Pictures",
            "id": 13992,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Glazier",
            "id": 40349,
            "origin_country": ""
         }
      ],
      "release_date": "1971-01-01",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "Locked in the cold asylum of his mind - a sane man stalks his prey...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Laslo Benedek"],
      "runtime": 106,
      "synopsis": null,
      "writers": [
         "Guy Elmes",
         "Samuel Roeca"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0066141/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAyMTIxOTE4NF5BMl5BanBnXkFtZTcwMDI0NDQzMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Max von Sydow, Trevor Howard, Liv Ullmann | See full cast and crew »"],
      "reviews": [
         "I remember catching 'The Night Visitor' on UK late night TV in the late 70's. At that time I'd not heard of it but was hooked from the outset. Many of the haunting images stayed with me and recently I got all nostalgic and started searching for either video or DVD releases of several lost gems from the early 70's, amongst them 'And Soon The Darkness', 'I Start Counting' and of course 'The Night Visitor'. Success!!! as all titles were available on DVD (some are deleted from obscure labels but all frequently pop up on Ebay for reasonable amounts). Strangely, having caught up with several long forgotten film or TV shows from my childhood, most have been disappointing, however 'The Night Visitor' retains it's menacing, almost surreal air and Max Von Sydow carries the film with great support from Trevor Howard (who seems to be setting the tone for his later appearance in 1973's 'The Offence') and I even recalled Arthur Hewlett as the prison guard with the gnome-like features. All in all a MUST for any Von Sydow fan and any lover of quirky psychological thrillers, low on budget but high on plot and intrigue.",
         "I wasn't expecting much when I saw this movie some years ago, but was I pleasantly surprised. This is a highly underrated suspense movie that is one of my favorites. It grabs you from the very opening (\"why is that man jogging through the snowy countryside in his underwear?\") and delivers a clever plot that deals with a series of murders with a Columboesque twist - you're shown who's doing them at the beginning, yet you're also shown that it's physically impossible for him to be committing them. The story then involves why he's doing them, the cat and mouse interaction between him and the police inspector investigating the cases, and the amazing way he accomplishes the seemingly impossible. Does he get away with it? You'll have to see for yourself. This one won't disappoint mystery fans.",
         "Max Von Sydow brilliantly portrays Salem, a patient at an insane asylum. The chilling cinematography of some guy in his underwear running around in the chilling snow fields makes this thriller even more chilling. But wait till you hear the chilling score by Henry Mancini. He wisely uses de-tuned piano notes that set a perfect mood.",
         "This film grabs you from start to finish.The clever way that Max Von Sydow,s character Salem executes his plan is engrossing.All the acting in this film is brilliant,but special credit has to go to Trevor Howard,s performance playing an ageing world weary inspector perfectly.It says a lot for the power of this film that although i have not been able to see it for over 10 years due to no dvd or video being available in the UK, it would still be in my top 20 movies ever.The plot was so good that i thought the ending would have to let it down,but instead turns out to be one of the best bits. A forgotten masterpiece that far too few people have seen if the number of people that have voted for it is anything to go by.",
         "It's awhile since I saw this movie but it really hooked me, especially seeing two old pros like Max Von Sydow and Trevor Howard going head to head. In looking at a few reviews I don't see much reference to his motivation which is what got me in and explains much of what he does. As I recall, an innocent man is found guilty of a murder committed by his unfaithful wife who frames him. To escape the death penalty he has to be certified criminally insane. If he's that way then he's in for life. Either way a no win. How he seeks to get square is ingenious and really tests Trevor Howard as the inspector. A real twist at the end that you will never forget. I haven't after 15 years or so since I last saw it. Terrific movie. Great acting and scenery. Definitely on my 'must have' list of movies.",
         "It has been thirty years since I first saw this title, at a drive-in movie theater, with my girlfriend. She and I both had eyes glued to the screen. The \"feeling\" of the setting still lingers and we could almost experience the cold. But what I remember the most is that The Night Visitor gave new meaning to the old line, \"a little birdy told me...\". Superb direction and wonderfully twisting ending!",
         "A man is running away from a large brick building surrounded by a high wall. He's running across rocks and snow in his underwear and boots. He sneaks into a farmhouse and steals some odd items, and sneaks into another house where he kills a woman. It's not the last person he'll kill either; he's trying to frame someone, but why - and how is he getting away from the place that establishes his alibi? This is a very good movie. As a horror movie, it doesn't have a very high body count, or much gore, and there's no on screen violence - it cuts away from that. Some horror movies benefit from that, some don't; this one doesn't need it. The locations: isolated locations surrounded by snowy fields are very nice to look at. Acting is very good, as is the musical score by Mancini. Definitely deserves to be better-known. I'm surprised some critics didn't like it. Some didn't like that the movie gives some things away early on that could have been withheld. I don't agree; not every movie that has secrets needs to save them for a big reveal at the end. Others felt that the characters' motivations weren't established. I can only suppose they weren't listening to the dialog, because that was fully discussed.",
         "If Ingmar Bergman had written and directed an episode of THE TWILIGHT ZONE, it may have looked something like this. Wrongly convicted mental patient Max von Sydow leaves the asylum each night to exact revenge on his nasty family members (who, he believes, set him up). Conniving sister Liv Ullman and weak willed brother-in-law Per Oscarsson are no match for von Sydow's vengeance. There's a lot of moody, stark images captured by director Laslo Benedek (the film was shot in a particularly chilly Norway & Sweden) and the music score (by Henry Mancini!) is very creepy. von Sydow is dynamite and Ullman gives a great performance (rare for a non-Bergman film). Trevor Howard is the cop on the case who very slowly peels the case open. Featuring a great, almost comic, ending!",
         "Atmospherically set in freezing Jutland, this clever revenge drama starts slowly but will grab your interest as Salem's plan unfolds. The acting is good and the film is well-handled by director Laslo Benedek. Worth a viewing.",
         "i was looking for \"the night visitor\" for long time cuz im a big max von sydow fan,and i finally i found it under a strange title\"Lunatic\"which SURPRISINGLY not mentioned here in a.k.a section . the story are the same here: a mental patient (MVS as salem)just escaped from his asylum in his underwear and... sorry i won't spoil anything more here, , but this a real thriller and i recommend MVS fans to watch this movie its one of his better performance(after the exorcist 1 and 2 of course) hani (king of horror movies)"
      ],
      "genres": [
         "Crime",
         "Thriller",
         "Horror"
      ],
      "productionCompanies": [
         "Glazier",
         "Hemisphere Pictures"
      ],
      "summaries": ["A man named Salem escapes from an insane asylum where he was confined for an axe-murder. Falsely convicted under a plea of \"guilty due to insanity\", he does not plan to let his sister and her husband forget that they were responsible for the murder of a farmhand and for his cruel imprisonment in the asylum."],
      "budget": 0
   },
   "movielensId": 3348,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1971-01-01",
      "dvdReleaseDate": "2000-02-22",
      "directors": ["László Benedek"],
      "runtime": 106,
      "movieId": 3348,
      "title": "The Night Visitor",
      "mpaa": "NR",
      "actors": [
         "Max von Sydow",
         "Trevor Howard",
         "Liv Ullmann",
         "Per Oscarsson",
         "Rupert Davies"
      ],
      "imdbMovieId": "0066141",
      "originalTitle": "The Night Visitor",
      "genres": [
         "Crime",
         "Horror"
      ],
      "youtubeTrailerIds": ["uqq1NF_e430"],
      "plotSummary": "An insane Swedish farmer escapes from an asylum to get revenge on his sister, her husband and others.",
      "tmdbMovieId": 72086,
      "avgRating": 3.16,
      "releaseYear": "1971",
      "numRatings": 25,
      "posterPath": "/eecW5FK54V7EQIll84wvIqlcRik.jpg"
   }
}