{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "horror",
            "id": 8087
         },
         {
            "name": "gore",
            "id": 10292
         },
         {
            "name": "maniac",
            "id": 14805
         }
      ],
      "imdb_id": "tt0058694",
      "video": false,
      "title": "Two Thousand Maniacs!",
      "recommendations": [
         27313,
         28170,
         42793,
         28172,
         29860,
         23506,
         39342,
         56702,
         34023,
         28180,
         37042,
         39987,
         38946,
         144690,
         27328,
         82094,
         48636,
         80671,
         36236,
         74241
      ],
      "backdrop_path": "/2dc1fRc9QREa6DdnckQi9ioFUll.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Terry Adams",
               "gender": 1,
               "credit_id": "52fe457fc3a368484e05eccd",
               "name": "Connie Mason",
               "profile_path": "/4USOvJxeZHQyuVjdGxQJYWabXdJ.jpg",
               "id": 99949,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Tom White",
               "gender": 2,
               "credit_id": "52fe457fc3a368484e05ecd1",
               "name": "William Kerwin",
               "profile_path": null,
               "id": 99947,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Mayor Buckman",
               "gender": 0,
               "credit_id": "52fe457fc3a368484e05ecd5",
               "name": "Jeffrey Allen",
               "profile_path": null,
               "id": 99966,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Lester MacDonald",
               "gender": 2,
               "credit_id": "52fe457fc3a368484e05ecd9",
               "name": "Ben Moore",
               "profile_path": null,
               "id": 99968,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Bea Miller",
               "gender": 0,
               "credit_id": "52fe457fc3a368484e05ecdd",
               "name": "Shelby Livingston",
               "profile_path": null,
               "id": 99973,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "John Miller",
               "gender": 0,
               "credit_id": "52fe457fc3a368484e05ece1",
               "name": "Jerome Eden",
               "profile_path": null,
               "id": 99955,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Rufus 'Rufe' Tate",
               "gender": 0,
               "credit_id": "52fe457fc3a368484e05ece5",
               "name": "Gary Bakeman",
               "profile_path": null,
               "id": 99974,
               "order": 6
            },
            {
               "cast_id": 23,
               "character": "Harper Alexander (as Mark Douglas)",
               "gender": 0,
               "credit_id": "58f17718c3a3681a30006e7a",
               "name": "Stanley Dyrector",
               "profile_path": null,
               "id": 1601785,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Betsy",
               "gender": 0,
               "credit_id": "52fe457fc3a368484e05eced",
               "name": "Linda Cochran",
               "profile_path": null,
               "id": 99975,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Beverly Wells",
               "gender": 1,
               "credit_id": "52fe457fc3a368484e05ecf1",
               "name": "Yvonne Gilbert",
               "profile_path": null,
               "id": 99976,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "David Wells",
               "gender": 0,
               "credit_id": "52fe457fc3a368484e05ecf5",
               "name": "Michael Korb",
               "profile_path": null,
               "id": 99977,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Switchboard Operator",
               "gender": 0,
               "credit_id": "52fe457fc3a368484e05ecf9",
               "name": "Candi Conder",
               "profile_path": null,
               "id": 99978,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe457fc3a368484e05eca5",
               "name": "Herschell Gordon Lewis",
               "profile_path": "/ytxTXGOyeksGML0s99XSnLp5FZk.jpg",
               "id": 99916,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe457fc3a368484e05ecab",
               "name": "Herschell Gordon Lewis",
               "profile_path": "/ytxTXGOyeksGML0s99XSnLp5FZk.jpg",
               "id": 99916,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe457fc3a368484e05ecb1",
               "name": "Herschell Gordon Lewis",
               "profile_path": "/ytxTXGOyeksGML0s99XSnLp5FZk.jpg",
               "id": 99916,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe457fc3a368484e05ecb7",
               "name": "David F. Friedman",
               "profile_path": "/oFi1eCcemfruKEGuHQClqCUOnKX.jpg",
               "id": 99934,
               "department": "Crew",
               "job": "Sound Recordist"
            },
            {
               "gender": 0,
               "credit_id": "52fe457fc3a368484e05ecbd",
               "name": "Charles Glore",
               "profile_path": null,
               "id": 99961,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe457fc3a368484e05ecc3",
               "name": "Jerome Eden",
               "profile_path": null,
               "id": 99955,
               "department": "Production",
               "job": "Unit Production Manager"
            },
            {
               "gender": 2,
               "credit_id": "52fe457fc3a368484e05ecc9",
               "name": "David F. Friedman",
               "profile_path": "/oFi1eCcemfruKEGuHQClqCUOnKX.jpg",
               "id": 99934,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "56e2b1e0c3a3686ff5002797",
               "name": "Jerry Whittington",
               "profile_path": null,
               "id": 1351437,
               "department": "Sound",
               "job": "Sound Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "56e2b1f5c3a368700b0027dc",
               "name": "Henry Lieberg",
               "profile_path": null,
               "id": 1588916,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            },
            {
               "gender": 0,
               "credit_id": "56e2b23ec3a368700500298b",
               "name": "Gretchen Blank",
               "profile_path": null,
               "id": 1588917,
               "department": "Directing",
               "job": "Script Supervisor"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 2.575479,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 28177,
      "vote_count": 39,
      "budget": 65000,
      "overview": "Six people are lured into a small Deep South town for a Centennial celebration where the residents proceed to kill them one by one as revenge for the town's destruction during the Civil War.",
      "similar": [
         948,
         341006,
         10781,
         24920,
         21407,
         24124,
         1690,
         588,
         381288,
         12521,
         19204,
         923,
         13190,
         5486,
         12662,
         434873,
         9792,
         273477,
         10185,
         9373
      ],
      "original_title": "Two Thousand Maniacs!",
      "runtime": 87,
      "poster_path": "/q6jlKGGKR9TglKazQ0sAiHMoI3I.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Jacqueline Kay",
            "id": 19990,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Friedman-Lewis Productions",
            "id": 4756,
            "origin_country": ""
         }
      ],
      "release_date": "1964-03-20",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "Madmen crazed for carnage!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Herschell Gordon Lewis"],
      "runtime": 83,
      "synopsis": null,
      "writers": ["Herschell Gordon Lewis"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0058694/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkwNzU0MTI1MF5BMl5BanBnXkFtZTcwMjQ5NjMyMQ@@._V1_SY317_CR9,0,214,317_AL_.jpg",
      "actors": ["Stars: Connie Mason, William Kerwin, Jeffrey Allen | See full cast and crew »"],
      "reviews": [
         "Two Thousand Maniacs! is set in the small southern town of Pleasant Valley which has a population of 2000, two cars are lured there via a fake detour. First up is a car with two couples, John (Jerome Eden) & his wife Bea Miller (Shelby Livingston) along with David (Michael Korb) & his wife Beverly Wells (Yvonne Gilbert, whom director Lewis married in 1975...) closely followed by a car with a young woman named Terry Adams (Connie Mason) & a hitchhiking teacher she picked up Tom White (William Kerwin). They are all greeted by the townsfolk & Mayor Buckman (Jeffrey Allen) insists all six stay for the towns 100 centennial celebrations as guests of honour although what they are celebrating exactly the locals seem reluctant to admit. The six strangers quickly discover that the townspeople are taking a bloody revenge for past atrocities committed against them... Photographed, written & directed by Herschell Gordon Lewis who has become known as the 'Godfather of Gore' this was the second in his so-called Blood Trilogy following Blood Feast (1963) & followed by Color Me Blood Red (1965) & is a neat enough little exploitation gore film that has a reasonable story behind it. The script moves along at a nice enough pace, it's populated by over-the-top character's & gore although I think the twist ending goes on for too long & could have been edited down to be a bit punchier & dramatic. The basic story here is pretty good, it show's a bit of imagination especially during the set-piece gore scenes & I especially liked the barrel with nails hammered inside which is then rolled down a hill with someone inside, ouch! This is a surprisingly good effort on what was probably intended to be no more than a quick cheap gore film to capitalise on the huge success of Lewis' seminal Blood Feast which is widely regarded as the very first gore film ever made. I liked it. Director Lewis has a decent imagination & is good at getting the most out of what must have been tiny budgets (apparently he did the voice over on the trailers for his films because he didn't want to pay anyone) but he really can't direct at all, his films look dull & are very poorly staged. Here for instance look at the reactions of the victims as they appear to be in mortal danger, none of them put up any sort of fight or struggle & almost seem willing to let their tormentors kill them, he just can't direct actor's & Two Thousand Maniacs! is a good case in point. There's some good gore here although tame by todays standards, someone has her thumb cut off & then her arm chopped off with an axe, someone is drawn & quarter having had his arms & legs tied to four separate horse, someone is rolled down a hill in a barrel full of nails which ends in very bloody results at the bottom & someone is squished with a huge boulder. The special effects aren't too bad either although the blood looks a bit bright. The IMDb lists 'Severed Tongue' as a Plot Keyword but there is no tongue severing in Two Thousand Maniacs! & probably refers to his earlier film Blood Feast which does. With a supposed budget of about $65,000 only Two Thousand Maniacs! didn't turn out too bad but it's hardly any work of art & the sound is absolutely terrible. It's sometimes hard to understand what character's are saying as their voices 'echo' on location, there are constant pops & crackles in the soundtrack & the sound effect of those cars at the start sound nothing like cars at all, I have to admit I thought the opening theme was annoyingly catchy. The acting is truly terrible, I'm sorry but there's no other word to describe it. Two Thousand Maniacs! is a neat enough exploitative gore film from the 60's with a slightly better story than you would perhaps expect, if that sounds like a film you might like then by all means check it out, if it doesn't then don't. Remade as 2001 Maniacs (2005) which I haven't had the 'pleasure' of seeing yet...",
         "\"Two Thousand Maniacs\" is a wonderful Brigadoon-esque film about two groups of Yankees who become guests of honors for the southern town of Pleasant Valley's centennial. What these \"guests\" don't realize, though, is that they are going to be murdered in bizarre (and I mean, BIZARRE) fashions because of a war lost by the south 100 years ago. The festivities include a woman being dismembered and barbecued, a man being quartered with four horses, and the infamous \"barrel roll\" sequence where a man is pushed down a hill in a barrel that has nails driven into its sides. The movie altogether has a wacky, feel-good charm (despite its gruesome nature) that keeps you smiling, and you'll surely be singing its theme song after the movie's over! I sure as hell was.",
         "\"2000 Maniacs\" is actually not completely inept. Sure, its not a masterpiece, but compared to its predecessor \"Blood Feast\", its \"Citizen Kane\". First off, its obvious H.G. Lewis had improved as a director. The pacing is still rather slow but it moves much quicker than any of his other films. Also, this was the first time his trademark dark humor came into play. Possibly realizing how unintentionally hilarious his previous film was, he added loads of humor of the gallows variety. The premise is actually quite creepy and clever and the twist ending will be a riot to those who get the reference. The gore, while unrealistic and obviously fake, actually becomes disturbing at moments. Plus, there are some brief instances where Lewis comes close to suspense (particularly Tom and Terry's escape). However to be expected, \"2000 Maniacs\" features a lot of the bad movie goodies we've come to expect from Lewis. While they aren't nearly as bad as they were in \"Blood Feast\", both William Kerwin and Connie Mason are still pretty wooden. There are plot holes galore (namely where does the town get all those modern appliances so quickly). The supporting cast is all over-the-top. This is a very politically incorrect film, and while some may take offense to the worst stereotypes of the south imaginable, others will find it amusing. And while \"Blood Feast\" had one memorable psycho, \"2000 Maniacs\" has three (the Mayor, Lester, Rufus). There is one thing that prevents \"2000 Maniacs\" from being an absolute classic however. Namely, H.G. Lewis seems rather restrained from showing us the gore. Not to sound like a sadist or anything, but after the bucket loads of over-the-top bloodshed in his previous film, the graphic murders only take up a small amount of screen time. Lewis' reputation comes from being the \"Godfather of Gore\", so those interested in this aspect are advised to check out \"Blood Feast\" or \"The Gore Gore Girls\" instead. Still, for all its technical shortcomings, \"2000 Maniacs\" is a surprisingly clever drive-in flick. (8/10)",
         "Two Thousand Maniacs is not a film that is on every horror fan's list of best films - but it should be, as when it comes to ingenuity and influence, this film certainly isn't lacking! Two Thousand Maniacs is my first taste of 'the godfather of gore', Herschell Gordon Lewis, and I already want to see more! Given his title, you would expect this film to be gory - and while the gore is rather tame by today's standards, considering that it was released in 1964 - three years before violence was brought to cinema with Arthur Penn's Bonnie and Clyde - it's amazing that Lewis was able to get away with scenes that see a man pulled apart by horses, a woman crushed by a rock and other such highlights. And it's not only the gore that makes this film noteworthy - the plot takes influence from films such as 'Bad Day at Black Rock', in that it follows a small town with a secret - only this time that plot has got itself a horror makeover! We watch as two cars full of people are detoured towards a town hidden deep in the American South. They are told that they are to be the guests of honour in a town celebration. However, they quickly find out that being a guest isn't always honourable... One of the main reasons I loved this film is because it's absolutely hilarious! Lewis sets the film up with a jokey tone from the beginning and keeps it going throughout. It's things such as the scene after the one that sees a woman have her finger cut off that makes this film so great. We cut to a sequence involving the screaming woman, along with the perpetrator, and the town's major - laughing their heads off! The film is also quite frightening. Insanity has been seen in cinema more times than anyone could count, but Lewis delivers it differently; it's not the fact that these two thousand people are mental that's scary - it's the fact that there's so many of them! The American Deep South is a popular destination for films of this ilk - and Lewis does a great job of making sure that we know where the action is taking place. Redneck flags fly, country music plays and the accents are great; and all of this seems to fit the action brilliantly. On the whole, this might not be the best produced horror film ever made; but it's an important one, and a film that anyone who enjoys bizarre cult classics should definitely seek out! Recommended.",
         "In 1963, Herschell Gordon Lewis and David Friedman released the first \"gore\" film ever made into theatres: BLOOD FEAST. The movies shocking violence and gore effects attracted people from all over, and the movie was a huge success. Needless to say, Lewis and Friedman were both anxious to make the next movie, but in order to keep the audiences attention and interest, they wanted to make the next one a better movie, and of course, make it \"gorier.\" They succeeded. Two Thousand Maniacs begins with a group of so called \"Yankees\" who, while driving across the state, end up in a small hick town with only two thousand citizens. The hillbilly and somewhat hyper citizens of this small town congratulate the Yankees, saying that they have been chosen as the special guests of a big event that is taking place in the town. The Yankees get set up in free hotel rooms, and are promised free meals. Little do they know, they are in a town which consists of Two Thousand Maniacs who are blood thirst and have plans to kill them all just for the fun of it. Unlike \"Blood Feast,\" the violence factor in Two Thousand Maniacs takes a little while to kick in. However, when the gore does hit, it is quite a bit heavier then the violence in the previous film. There is no way that anyone could say that this film is \"Extremely Gory\" when comparing it to movies that have come out since, but it is without a doubt the most shocking and graphic film of it's time. Now only that, but the brilliant screenplay that was written by Herschell Gordon Lewis has many creative and well-thought death scenes in it. This movie doesn't try to take itself quite as serious as \"Blood Feast\" did, which makes it more enjoyable to watch. The beautiful Connie Mason returns now obviously playing a different character, and her acting skills seem to have improved. Another \"Blood Feast\" star who came back to star in the second gore film is the very talented William Kerwin aka Thomas Wood. Fans of \"Blood Feast\" should enjoy seeing the two of them on screen once again. Another person, whose skills seem to have improved from Blood Feast to Two Thousand Maniacs, is Herschell Gordon Lewis himself. I am a big fan of Blood Feast, but when watching it, there are obvious flaws in the direction. But with this film, HGL proved that he was indeed a great filmmaker, and that obvious talent traveled into his future films as well. While Two Thousand Maniacs wasn't as successful as Blood Feast, it still brought in enough money for HGL to direct many more afterwards. This is Herschell Gordon Lewis' favorite film out of all of his OLD movies, and mine as well, all though it is my personal opinion that his film BLOOD FEAST 2: ALL YOU CAN EAT, which he made in the early 2000s, was better then any of his older films. Recommended to any and all horror fans. Get the junk food and the popcorn out, sit back, and enjoy this great cult classic. You're in for a treat!",
         "Two Thousand Maniacs! is the second installment in the sleazy classic \"Blood Trilogy\" by Herschell Gordon Lewis. It is a superb film and very important to the gore genre. This early splatter fest features enough carnage(and very realistic-looking blood for its time) to compete with any of today's modern gross-outs. The premise is simple enough. Travelers are lured to a small southern town full of blood-thirsty Confederates seeking revenge on Yankees upon the centennial of the end of the Civil War. Fooled into thinking that they are the guests of honor at the town's centennial celebration, the travelers soon find themselves in the middle of barbaric blood rituals with seemingly no means of escape. While the acting is a little sub-par and exaggerated at times, it does not detract from the film but, rather, adds to the sleaze factor. The action slows down a little toward the end, however, the ultimate conclusion is unique and quite chilling. Overall, Two Thousand Maniacs! is a very worthy watch and a great addition to any gore hound's collection.",
         "I saw this movie while in the Army. It was part of a blood triple header at a drive-in while stationed in Virginia. Blood Feast, 2000 Maniacs and another movie I forgot the name were on the bill. I can still remember the ways the characters were killed and all the themes from a State Fair that were used. But my favorite was when they cut the girls thumb off and then they fixed it by chopping her arm off. Then later that night by the campfire while they cooked the arm. They sang \"I'm rolling my sweet baby's arm.\" How can you not like this movie it is almost like a must before seeing Kill Bill part 2. Just my opinion.",
         "TWO THOUSAND MANIACS is HG Lewis' best film, or most complete film. Unlike so many of Lewis' films, TTM actually has characters, you either care for or dislike. There's some suspense. There's actually a beginning, a middle and an end to it. The story's concept is brilliant and inspired, even if its execution is a tad lacking. And the violence is actually disturbing and important to the story. There are the usual HG Lewis touches in TTM, like bad acting and static film-making but the whole product is so well made that, in the end, the typically HG Lewis weaknesses don't harm the film. There is one big mistake in the story: the town looks modern and the people of Pleasant Valley act like modern folks and are dressed in 1960s clothes. The town should have looked like a town from around 1860s, and the people should have looked and acted like folks from that period. It would have been even more fantastic and creepy. But they probably didn't have the money to recreate such an elaborate setting so I understand why everything looks like the 1960s in Pleasant Valley. The plus side of this mistake: the juxtaposition of 1960s sunny retro quaintness with extreme gory violence actually adds a lot to the film's unique quality. I love TWO THOUSAND MANIACS. It's a cool flick and it's a classic horror film.",
         "It was in 1963 when director Herschell Gordon Lewis and producer David F. Friedman decided to leave the production of nudist films and opted for making horror movies. In those years, independent cinema was on the rise and the two filmmakers took advantage of being out of the studio system to push the envelope further and give their audiences more in terms of violence and sexuality. With the release of \"Blood Feast\", Lewis and Friedman introduced graphic gore to American horror and inaugurated the \"splatter\" sub-genre, beginning a new style of horror that would become a staple of the drive-in theater market. While honestly \"Blood Feast\" wasn't really a well done film, it was only the beginning for Lewis, as 1964's \"Two Thousand Maniacs!\", Lewis' next venture in the horror genre, proved that there was real talent in the savvy businessman. In \"Two Thousand Maniacs!\", Tom White (William Kerwin) and Terry Adams (Connie Mason) are traveling through the American south heading to Atlanta when suddenly they are lured into the small town of Pleasant Ville by the citizens, who want them to be the guests of honor in the celebration of the centennial of an important event in the history of their town. In Pleasant Ville, they find another two young couples who were also lured by the villagers, the Millers (Jerome Eden and Shelby Livingston) and the Wells (Michael Korb and Yvonne Gilbert). Together, the six guests are invited to participate in the town's festivities without any information about what exactly is the town celebrating, however, they find themselves seduced by the charm of the southern townspeople. But they don't know that as guests of honor, they'll become the victims of a town made up of two thousand maniacs. As usual, the film's plot was conceived by H.G. Lewis, but this time he was also responsible of the screenplay, making \"Two Thousand Maniacs!\" probably a more personal job. As a writer, Lewis has certainly improved after his previous movie, as not only \"Two Thousand Maniacs!\" has a truly interesting and fascinating concept at its core, the whole development of the story is actually remarkable, with Lewis genuinely playing with suspense in a honest attempt to deliver something more than scenes of violence. Once again, Lewis adds a good healthy dose of his trademark style of black humor to the plot, which works perfectly when contrasted with the demented nature of the characters, and successfully plays with the typical southern stereotypes and the idea of the clash between urban society and rural society. Of course, everything is done in that campy over-the-top tone that makes the story extremely funny despite its macabre themes. It seems that filmmaker Herschell Gordon Lewis not only improved his skills as a writer this time, as his work as a director is also considerably superior to what he did in \"Blood Feast\" too. While the movie is still done on a extremely low-budget and doesn't really have the most realistic effects in the world, Lewis manages to make everything work nicely by keeping the film moving at a fast pace as he balances comedy and horror with great skill. Using a raw style of cinematography due to budgetary reasons actually helps the film, as it gives it a gritty look that adds to the film's \"southern charm\". One thing that really stands out in the film is the way Lewis handled his actors this time, as while it is obvious that few of them are professionals, Lewis gets good performances out of them by keeping a lighthearted tone through the film and never taking the movie too seriously. As written above, the cast delivers good performances considering their apparent lack of experience, as while obviously playing caricatures and stereotypes, they all seem to have good fun with it and that ultimately makes the movie look better. Lewis' regular collaborators William Kerwin and Connie Mason appear as the film's main characters, and both make good a job in their role. Kerwin always was the most talented of Lewis' troupe, and once again his talent gets shown. After her awful performance in \"Blood Feast\", it was good to see Mason improving her acting a bit in the film, giving a performance that if not good it's at least better than her last one. As the main \"villians\" we find Jeffrey Allen playing the mayor and Ben Moore and Gary Bakeman as his trusted henchmen; the three making the best of their comedic roles as the leaders of a town full of sociopath rednecks. As a result of being made with an extremely low budget, \"Two Thousand Maniacs!\" has a lot of problems in terms of visual look and special effects. What I mean is that the movie looks certainly cheap and unrealistic as the production values weren't exactly high. However, those apparent \"flaws\" can be easily ignored as Lewsis manages to used them for the film's benefit, as the grittiness of the film adds lot of charm to the movie, fitting nicely in the campy tone Lewis uses in the movie. While \"Two Thousand Maniacs!\" is not exactly a scary movie in the typical way (it's more black comedy), there is a certain touch of malice that helps to make some scenes really suspenseful, that together with the grittiness of the cinematography makes the movie feel almost like a direct predecessor of 70s classics like \"The Texas Chain saw Massacre\" and \"The Wicker Man\". Maybe due to Lewis reputation as maker of low-budget films, \"Two Thousand Maniacs!\" doesn't get the respect it really deserves, as this is truly an excellent movie that mixes horror and comedy in a perfect way. Like \"Blood Feast\", this movie would create the bloody path that future horror filmmakers would follow in terms of gory imagery. While often considered more a businessman than a filmmaker, \"Two Thousand Maniacs!\" proves that there was real talent in the hands of director H.G. Lewis, the Godfather of Gore! 8/10",
         "The second part of the blood trilogy that began with Blood Feast. This one is considerably more professional than the first. But it still as its short comings. Acting is variable. And the plot is weak and does not make a lot of sense. The gore scenes (which is probably the reason why you are watching) are great. And even quite brutal, although the film is too camp to take too seriously. The music is also great and very fitting. It does suffer from two annoying things however. The annoying little boy for one. But I do think they knew how annoying he was, because at the end even the villagers don't want him back. The other thing is how long the film takes to end. Its got more endings than Spielberg film. Still its pretty good and worth it if you like gore films..."
      ],
      "genres": ["Horror"],
      "productionCompanies": [
         "Jacqueline Kay",
         "Friedman-Lewis Productions"
      ],
      "summaries": [
         "The citizens of the southern town Pleasant Valley lure six Yankee tourists into town where they are to be the reluctant guests for the centennial celebration of the day a band of renegade Union troops decimated the town. The town then participates in events, a different event for each of the tourists, in which the tourist is dispatched. One couple begins to suspect something and seeks a way to escape.",
         "It's 1965 and the residents of Pleasant Valley, Georgia are celebrating their centennial and they divert six tourists to their town. There, the unsuspecting six are treated as guests of honor but in fact will soon be the victims. The centennial the town is celebrating is its own destruction at the hands by a group of Union soldiers during the Civil War and their goal is revenge. One by one, they kill their guests of honor until only two remain. They flee but can't quite convince the police to help them.",
         "Six people are lured into a small Deep South town for a Centennial celebration where the residents proceed to kill them one by one as revenge for the town's destruction during the Civil War."
      ],
      "budget": 65000
   },
   "movielensId": 3351,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1964-03-20",
      "dvdReleaseDate": "2000-02-22",
      "directors": ["Herschell Gordon Lewis"],
      "runtime": 87,
      "movieId": 3351,
      "title": "Two Thousand Maniacs!",
      "mpaa": "",
      "actors": [
         "Connie Mason",
         "William Kerwin",
         "Jeffrey Allen",
         "Ben Moore",
         "Shelby Livingston",
         "Jerome Eden",
         "Gary Bakeman",
         "Stanley Dyrector",
         "Linda Cochran",
         "Yvonne Gilbert",
         "Michael Korb",
         "Candi Conder"
      ],
      "imdbMovieId": "0058694",
      "originalTitle": "Two Thousand Maniacs!",
      "genres": ["Horror"],
      "youtubeTrailerIds": ["wycAnWMs_TM"],
      "plotSummary": "Six people are lured into a small Deep South town for a Centennial celebration where the residents proceed to kill them one by one as revenge for the town's destruction during the Civil War.",
      "tmdbMovieId": 28177,
      "avgRating": 2.83065,
      "releaseYear": "1964",
      "numRatings": 124,
      "posterPath": "/q6jlKGGKR9TglKazQ0sAiHMoI3I.jpg"
   }
}