{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0171135",
      "video": false,
      "title": "Brown's Requiem",
      "recommendations": [],
      "backdrop_path": "/z8wxGn2wc9gEWIqvf2rbgUjOTBp.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Fritz Brown",
               "gender": 2,
               "credit_id": "52fe46ccc3a368484e0a4465",
               "name": "Michael Rooker",
               "profile_path": "/bvmf7TIjCyRPrBNrmZ5qyePTL5y.jpg",
               "id": 12132,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Jane",
               "gender": 1,
               "credit_id": "52fe46ccc3a368484e0a4469",
               "name": "Selma Blair",
               "profile_path": "/xltCuuG4xjACQ6vQm55iuR5LFJC.jpg",
               "id": 11826,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Cathcart",
               "gender": 2,
               "credit_id": "52fe46ccc3a368484e0a446d",
               "name": "Brion James",
               "profile_path": "/4Vm3Zq6arXq3jyFfq3yJgH9Jj2l.jpg",
               "id": 591,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 2,
               "credit_id": "540fa820c3a3685eb40007f0",
               "name": "Brad Dourif",
               "profile_path": "/6pqeGxtWEdDjYsnQfUkmzXLlDvs.jpg",
               "id": 1370,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 2,
               "credit_id": "540fa836c3a3685eb40007f5",
               "name": "Will Sasso",
               "profile_path": "/5Lz3WLWkgU04Fy4Xa0pjE5U53Wi.jpg",
               "id": 39125,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "",
               "gender": 2,
               "credit_id": "540fa847c3a3685ea10007b2",
               "name": "Kevin Corrigan",
               "profile_path": "/trRjEABsF2BCqn6pib3bYhYIxNH.jpg",
               "id": 18472,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "",
               "gender": 2,
               "credit_id": "540fa85bc3a3685eb80007ba",
               "name": "William Newman",
               "profile_path": "/tSFsRnK1jfCc50yinO5MpFnJL3c.jpg",
               "id": 77027,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 2,
               "credit_id": "540fa872c3a3685ebc000778",
               "name": "Barry Newman",
               "profile_path": "/vAl1PUv9PDy5WMfBLXmhRUhcqVO.jpg",
               "id": 27860,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "",
               "gender": 2,
               "credit_id": "540fa887c3a3685eb10007b9",
               "name": "Tobin Bell",
               "profile_path": "/vbu4iHKY46zJ6K8B5jGJxB1ffp4.jpg",
               "id": 2144,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "",
               "gender": 1,
               "credit_id": "540fa89ec3a3685eae00074a",
               "name": "Jennifer Coolidge",
               "profile_path": "/jOVVWdfxLQ9MOumqM3VxiwAlT9a.jpg",
               "id": 38334,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe46ccc3a368484e0a4473",
               "name": "Jason Freeland",
               "profile_path": null,
               "id": 168200,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46ccc3a368484e0a4479",
               "name": "Jason Freeland",
               "profile_path": null,
               "id": 168200,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46ccc3a368484e0a447f",
               "name": "James Ellroy",
               "profile_path": "/sLxOIe8OsoRI5quoHL4aJyfddUI.jpg",
               "id": 18862,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 1.19303,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 64166,
      "vote_count": 2,
      "budget": 0,
      "overview": "Fritz Brown is an ex-LAPD, recovering alcoholic who now splits his time repossessing cars for a used car lot and staffing his one-man private detective agency. When a filthy caddie named Freddy \"Fat Dog\" Baker wanders into Fritz's office one day, flashing a wad of cash, Fritz is hired to follow Fat Dog's kid sister Jane, who is holed up with a Beverly Hills sugar daddy named Sol Kupferman. Kupferman is a 70 year-old bag man for the mob, and Fat Dog claims that \"Solly K\" is up to something evil that may harm Jane. The trail leads Fritz to an encounter with his dark past in the person of Haywood Cathcart, current head of LAPD internal affairs and the person who kicked Fritz off the police force.",
      "similar": [],
      "original_title": "Brown's Requiem",
      "runtime": 104,
      "poster_path": "/hhshoH9MZM9cB9lfArRtZ0mf9Gv.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1998-11-01",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "In L.A., The Law Is Still For Sale.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jason Freeland"],
      "runtime": 104,
      "synopsis": null,
      "writers": [
         "Jason Freeland",
         "James Ellroy"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0171135/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE0ODQ0NTA4M15BMl5BanBnXkFtZTcwOTk3MjUyMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Michael Rooker, Big Daddy Wayne, Jack Wallace | See full cast and crew »"],
      "reviews": [
         "All of these reviews worth their salt catch on to the fact that this is a great adaption of the book. What they fail to mention is that the locations in this movie really give it that dark, haunting feel that is the underbelly of Los Angeles. LA is not all bright, blaring sunlight and perfectly straight rows of palm trees. The city's most interesting aspect is hidden in its shadows and the film captures that look perfectly.",
         "I am amazed that, given the reviews of the film (all apart from two rate the film highly), how this film managed to score so poorly. Indeed, I think it's a huge shame that it didn't get a better cinema release in this country. I only saw it on video. I thought it was excellent thriller in the noir tradition. There are three standout elements. First, the plot and feel of the film. These are faithful to James Ellroy's book, more so than in the case of LA Confidential. I was amazed how much of the detailed plot was included (and believe me Ellroy plots are detailed!) Secondly, Cynthia Millar's haunting piano score was probably largely responsible for my second viewing of the film. Thirdly, Michael Rooker's performance. I had only ever remembered him as the villain in Sea of Love, a part he played well but not outstandingly. Here, though, his hangdog expression served him excellently. He is a modern Robert Mitchum, born to play noir leads. Actually he's better, Mitchum was too smooth. Highly recommended. Go see it and give it more deserving marks on the board than it has at the moment. I haven't mentioned Jason Freedland's contribution, but I hope to see more from this talented director, given his superb first attempt.",
         "I watched this film on DVD and it was just a chance to catch Michael Rooker in the lead role of Fritz Brown, an ex-cop, repo man, and part time detective. Michael plays him with streetwise honesty and toughness but makes it believable and yet shows the weaknesses, and vulnerabilities and flaws of the character. I really enjoyed watching him play these kinds of characters and it's a nice change from seeing him not play a villain or a psychopath. This is an excellent film noir and the best I've ever seen James Freeland has done a brilliant job with this film. The beautiful music score in the opening and closing for the film just fits together with the sad tone of the character. Michael Rooker is one of my favourite actors and I think he did an amazing job in this role he is one of the most underrated actors in Hollywood I hope to see him in more future films.",
         "The film succeeds at the most basic level: it creates a vivid lead character, and portrays a specific time and place accurately and memorably. Fans of noir should not miss this undeservedly obscure rendering of Ellroy's first (and most autobiographical) novel.",
         "It is definitely Michael Rooker who carries this film with his likable working-man persona.He really manages to show the heart and humanity under his character's rough exterior and when he needs to be menacing he delivers the goods;the scene where he takes a pair of brass knuckles to a creep in order to beat some information out of him is worth the price of admission alone. He is well-served by a snappy script that captures the gritty funk of Ellroy's writing. Capable direction by Jason Freeland keeps things moving nicely. There are excellent character turns by Will Sasso, Brad Dourif,and Barry Newman. And Harold Gould takes a bow as a slimy mobster.I am surprised this isn't more celebrated. Good show, all around.",
         "Really really a good film. I loved the gutsy choices this director made. This is a movie no one should miss. I'm a big fan of James Ellroy and truly believe that Jason Freeland's filmic rendition of this novel is fabulous. If you loved LA Confidential, you'll love this movie.",
         "I stumbled onto this film and was not really sure what it was about but the guy in it is from Henry Portrait of a Serial Killer and he was great. The film was very dark and I came out of the theater wanting to have a beer. I don't know that I can do a great job explaining it but it was more than a detective story. It was about this guy and he really didn't want to drink and he gets this case...a weirdo caddie wants him to check out who's playing around with his sister. The film made me feel like I sometimes feel when my life sucks and I guess that was the point. So if you're looking for fun see something else, but if you like'em dark, check out this",
         "Warning: SPOILERS! I'm suprised no one else seems to have noticed the Chinatown homage this movie does. Kudos to Michael Rooker I'd like to see him in more lead roles. I also liked the irony of Fatdog being both a big fan of Hitler and unknowingly being the son of a Jew. This is just what you want from a small film. A modest production yielding good, but modest, results.",
         "Brown's Requiem is, in my opinion, modern day Film Noir at its best. Jason Freeland's obvious understanding of James Ellroy's notoriously clever dialogue paved the way for one of the best adaptations I've ever seen. The casting choices were right on and this was one of the few crime stories where I didn't guess the ending after the first half hour. It definitely kept me on my toes. Well Done!",
         "...Brown's Requiem tells the story of Fritz Brown, a private investigator and part time repo man who was at one time an officer in the LAPD -- and is currently an on-the-wagon alcoholic. Fritz is hired by an obese golf caddy who calls himself Fat Dog (MadTV's Will Sasso) to watch over his sister (Selma Blair) who is currently shacked up with a wealthy older man. Fritz soon finds himself involved in a complicated plot involving Fat Dog's murder, a former football player turned racketeer and the Internal Affairs chief who had Fritz thrown off the force (the late, great character actor Brion James). I've not read Ellroy's novel (it's one of the few Ellroy novels I haven't read) but I understand it was his first. If this film is a faithful adaptation, then it serves as the filmic representation of the birth of Ellroy's signature devices: flawed \"heroes,\" gruesome violence, perversions, sadism and a filthy Los Angeles underbelly, all of which are on display here. Star/producer Michael Rooker does a fantastic job conveying a character who strives for redemption and allows the possibility of it to pull him into a world of murder and depravity he was not ready for. The direction is tight, the mystery is intriguing and the film is littered with memorable bit roles by such character actors as the aforementioned Brion James, Brad Dourif, Lee Weaver and Tobin Bell. Fans of film noir should give this one a go, as should fans of star Michael Rooker and author James Ellroy. It's not perfect but it surely deserved better than the direct-to-video release it received here in the U.S. A solid 7/10."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "J&T Productions",
         "Savvy Lad",
         "Brown's Requiem"
      ],
      "summaries": ["Fritz Brown is an ex-LAPD, recovering alcoholic who now splits his time repossessing cars for a used car lot and staffing his one-man private detective agency. When a filthy caddie named Freddy \"Fat Dog\" Baker wanders into Fritz's office one day, flashing a wad of cash, Fritz is hired to follow Fat Dog's kid sister Jane, who is holed up with a Beverly Hills sugar daddy named Sol Kupferman. Kupferman is a 70 year-old bag man for the mob, and Fat Dog claims that \"Solly K\" is up to something evil that may harm Jane. The trail leads Fritz to an encounter with his dark past in the person of Haywood Cathcart, current head of LAPD internal affairs and the person who kicked Fritz off the police force. But what is Cathcart doing in business with a mobster? And why is Jane shacked up with a man old enough to be her grandfather? Fritz starts asking some questions, and the answers are all bad news. Fritz finds himself back on Haywood Cathcart's short list, and as the bodies start to pile up around him, Fritz stands to lose more than his job this time around as some old debts get repaid."],
      "budget": 0
   },
   "movielensId": 3352,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-11-01",
      "dvdReleaseDate": null,
      "directors": ["Jason Freeland"],
      "runtime": 104,
      "movieId": 3352,
      "title": "Brown's Requiem",
      "mpaa": "R",
      "actors": [
         "Michael Rooker",
         "Selma Blair",
         "Brion James",
         "Brad Dourif",
         "Will Sasso",
         "Kevin Corrigan",
         "William Newman",
         "Barry Newman",
         "Tobin Bell",
         "Jennifer Coolidge"
      ],
      "imdbMovieId": "0171135",
      "originalTitle": "Brown's Requiem",
      "genres": [
         "Drama",
         "Action",
         "Thriller",
         "Mystery"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Fritz Brown is an ex-LAPD, recovering alcoholic who now splits his time repossessing cars for a used car lot and staffing his one-man private detective agency. When a filthy caddie named Freddy \"Fat Dog\" Baker wanders into Fritz's office one day, flashing a wad of cash, Fritz is hired to follow Fat Dog's kid sister Jane, who is holed up with a Beverly Hills sugar daddy named Sol Kupferman. Kupferman is a 70 year-old bag man for the mob, and Fat Dog claims that \"Solly K\" is up to something evil that may harm Jane. The trail leads Fritz to an encounter with his dark past in the person of Haywood Cathcart, current head of LAPD internal affairs and the person who kicked Fritz off the police force.",
      "tmdbMovieId": 64166,
      "avgRating": 2.53125,
      "releaseYear": "1998",
      "numRatings": 32,
      "posterPath": "/hhshoH9MZM9cB9lfArRtZ0mf9Gv.jpg"
   }
}