{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0218112",
      "video": false,
      "title": "The Closer You Get",
      "recommendations": [],
      "backdrop_path": "/Aqs6MxwpnLCpvxIm7XfqM4lL4eq.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1001,
               "character": "",
               "gender": 2,
               "credit_id": "52fe48a5c3a368484e10372d",
               "name": "Ian Hart",
               "profile_path": "/35KSRxsFR20QGDhIrZn7G4Jkc2g.jpg",
               "id": 10985,
               "order": 0
            },
            {
               "cast_id": 1002,
               "character": "",
               "gender": 2,
               "credit_id": "52fe48a5c3a368484e103731",
               "name": "Sean McGinley",
               "profile_path": "/yYLnTgn7RDR50crBOV7juzJlq6f.jpg",
               "id": 2468,
               "order": 1
            },
            {
               "cast_id": 1003,
               "character": "",
               "gender": 0,
               "credit_id": "52fe48a5c3a368484e103735",
               "name": "Niamh Cusack",
               "profile_path": "/3JoNqI0XRZ9y6aliqLSGK2hwnuv.jpg",
               "id": 174745,
               "order": 2
            },
            {
               "cast_id": 1004,
               "character": "",
               "gender": 1,
               "credit_id": "52fe48a5c3a368484e103739",
               "name": "Ruth McCabe",
               "profile_path": "/yiA0GlVcMQ30hmgkfEaCCBMTGtM.jpg",
               "id": 17026,
               "order": 3
            },
            {
               "cast_id": 1005,
               "character": "",
               "gender": 2,
               "credit_id": "52fe48a5c3a368484e10373d",
               "name": "Ewan Stewart",
               "profile_path": "/lMJIOEOxNUa0RZo3Ib1UC50K2OO.jpg",
               "id": 3071,
               "order": 4
            },
            {
               "cast_id": 1006,
               "character": "",
               "gender": 2,
               "credit_id": "52fe48a5c3a368484e103741",
               "name": "Pat Shortt",
               "profile_path": "/Agui3u14dMkwEu7waNsXPFzfhIN.jpg",
               "id": 83278,
               "order": 5
            },
            {
               "cast_id": 1007,
               "character": "",
               "gender": 1,
               "credit_id": "52fe48a5c3a368484e103745",
               "name": "Cathleen Bradley",
               "profile_path": "/hE0CJWLJFl50Hz5MoXTHs6L7QWG.jpg",
               "id": 585008,
               "order": 6
            },
            {
               "cast_id": 1008,
               "character": "",
               "gender": 2,
               "credit_id": "52fe48a5c3a368484e103749",
               "name": "Sean McDonagh",
               "profile_path": null,
               "id": 585009,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe48a4c3a368484e103729",
               "name": "Aileen Ritchie",
               "profile_path": null,
               "id": 585004,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5904d91392514169fb00fac8",
               "name": "Uberto Pasolini",
               "profile_path": null,
               "id": 57632,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.076793,
      "production_countries": [],
      "id": 73642,
      "vote_count": 2,
      "budget": 0,
      "overview": "Irish bachelors take out an ad in the Miami Herald, looking for love.",
      "similar": [],
      "original_title": "The Closer You Get",
      "runtime": 93,
      "poster_path": "/1PJzmcviGO9sFtlub3OUd8CgP9s.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2000-12-27",
      "vote_average": 4.5,
      "belongs_to_collection": null,
      "tagline": "For five desperate Irishmen, the perfect girl is abroad.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Aileen Ritchie"],
      "runtime": 93,
      "synopsis": null,
      "writers": [
         "Herbie Wave",
         "William Ivory"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0218112/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI0NzU4ODAyOV5BMl5BanBnXkFtZTcwMjI3NzEzMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Ian Hart, Sean McGinley, Niamh Cusack | See full cast and crew »"],
      "reviews": [
         "This is a wonderfully sensitive and human film, well scripted, well acted, superbly directed. And so what if the women come out as the winners. It's a delightful story of sexual awakening, done in a charming, cheeky Irish style. Provocative yet tasteful. Funny yet serious. One of those rare films in which everything works!",
         "This is a quaint and charming little comedy about life and love in rural northwestern Ireland. The question remains, how many rural Irish comedies can we watch before the material starts to get stale. The story begins with the single men of this little town complaining that the women are substandard and there are no marriage prospects. After downing far too many pints, they decide to place an advertisement in the Miami Herald to see if they can induce some American women to come to Ireland to the big town dance. When the townswomen get wind of the scheme, they invite some Spanish fishermen to the same dance. The result is a succession of comical situations where everyone makes fools of themselves in anticipation of the big day. The net result of all this is the lesson Dorothy learned when she left Kansas; that when you are looking for your heart's desire, you don't have to look any further than your own backyard. Aileen Ritchie's directorial debut was marked by some nice photography of well-selected locations and an alluring portrayal of the local color and appeal. The characters all seemed very genuine and unaffected; the way country folks generally are regardless of national origin. The scenes leading up to the dance work well, but the film bogs down after the dance as the tone changes from mirthful to dramatic. The acting was generally good with a couple of standouts. Ian Hart stole the show as Kieran the headstrong town butcher. He was simultaneously affable and obnoxious. His character's complete obliviousness to how ridiculous he was gave Hart ample opportunity to become a laugh magnet. Niahm Cusack was also enchanting as Kate, mixing mischievousness with romantic appeal to create a delightful character. I rated this film a 7/10. It is very light fare, silly enough that it will get a chuckle or two out of almost everyone.",
         "Even though my most favorite movies are thrillers and drama's, I must say that from time to time I can really look forward to a comedy. Life is more than misery or thrills alone, there should be time for laughter as well, so why should my choice of movies be any different? But when looking for comedies, I do have certain standards. I hate toilet humor and the story may be silly, but still has to be of a decent quality. If I'm honest, than I must say that I don't find that too often. The latest (often American) comedies are all full of those dreaded jokes about pee, vomit, sperm,... and too often I end up very disappointed in them. That's also the reason why I prefer British comedies. I like their, often very dry, humor and their jokes don't necessarily have to be about some kind of bodily function. \"The Closer You Get\" is situated in an isolated village in Ireland. Because the girls in their village aren't to their taste, a bunch of young man send an ad to the Miami Herald, inviting fit and enticing American women between the ages of 20 and 21, to come to the local dance. But when the girls they all hoped for don't come and the local girls seem to have more success with men from outside the village, the local men start to realize that some of their 'own' girls might not be that bad after all. Others however chose different solutions like ordering a lot of porn... Like so often with comedies, I'm sure that there are many people who don't like it all that much. Humor is one of the most difficult parts of the entertainment business and not everybody has the same taste. Personally I had a really good laugh with this movie, but when I see some other comments on this website, it's getting very clear to me that not everybody thinks about it like that. I guess this is a comedy that will appeal most to the people who love the typical British humor, so if you aren't into that kind of jokes, you better don't give this movie a try. If you are looking for a very special, deep or touching story, than this isn't the best movie for you either. The story is quite simple, but efficient. It doesn't really know any extreme highs or lows, but it works. The characters are believable, the situations are still recognizable... All in all this is a very decent comedy with some good acting and an OK story. But most important is the amount of laughter that it offers and for me that was more than enough. I had a really good time with this movie and that's why I give it a 7.5/10.",
         "This movie represents the reality of the villages in Ireland. A reality that is very similar to my country, Galicia, the northwest part of Spain and a land that, surprisingly, is very similar in nature to Ireland. The movie talks about the ambitions and hopes of ordinary people in a village and the idea to go abroad and know the world. But the hopes are most of the times unrealistic and your dreams don´t let you see that what you have closer is what you need. May be the worst part is the very typical representation of the Spanish sailors (singing \"flamenco\" with guitars). Most of the sailors of Spain are from the north, a part in which the popular music is not based in the famous \"flamenco\".",
         "A beautiful and worthy film, set in a small and fairly isolated village in Ireland, yet, like the village and its inhabitants, the film is also, sadly, rather forgettable. The people living in this tiny community, whilst optimistic, charismatic and full of life, also realize the dead-end nature of their situation. The men long to travel and meet beautiful women in exotic places. They put an ad in an American publication hoping to attract women to join them for a local dance, but the women fare rather better by attracting the local Spanish fishermen. The movie could easily have degenerated into Hollywood-style unbelievability but it resists the temptation. The characters, their lives, and how they develop are convincing and moving. The title refers to missing what is important (in love and life) when it is under your nose. A lovely feelgood movie.",
         "Gentle Celtic productions are very much in vogue at the moment. What with Waking Ned, Ballykissangel and the late Hamish Macbeth. The Closer You Get is a gentle tragi-comedy with a heart-warming if unsurprising ending. All the performances are very strong, particularly from the ever-magnificent Ian Hart and Niamh Cusack, but you can't help feeling that you've seen it all before. If you're feeling in need of a pick-me-up on a Saturday afternoon, then go see, but otherwise wait for the next series of Ballykissangel!",
         "I saw \"The Closer You Get\" at a school screening recently and I must say that it didn't surprise or challenge me. I wasn't expecting \"Citizen Cane\" in Ireland but I was hoping for some genuine moments of humanity and of course some silly banter. But the comic moments seemed perfunctory and forced and the dramatic moments didn't quite have the gravity that they needed. The story takes place in a small sea side town in Ireland where the male inhabitants decide to invite beautiful women from America over to their town so they can get some foreign variety in their lives. The women get a hold of this news and cleverly play off the men's futile effort. Sadly \"The Closer You Get\" only a few minutes to introduce the plot then we have to sit through over an hour and a half for the bland execution. I really wanted to get to know these colorful characters better in the first act so that I could follow them through this silly plot. It's official now. We have this Irish small town comedy genre on our hands and there's no end in sight. It was fresh at first but come on people we need some variety in plot structure by now. I guess these Irish films are more sincere and have their hearts in all the right places, which is more than I can say for those pesky teen flicks. But when you've watched \"The Commitments,\" \"The Matchmaker,\" \"The Full Monty,\" and \"Waking Ned Divine,\" there innocuous charm quickly becomes annoying. I give \"The Closer You Get\" a six out of ten.",
         "I'm an action movie buff, so mostly I like films that blow up. I like comedies too, but I expect a fast pace and not too much arty melodrama. \"The Closer You Get\" (called \"American Women\" in the USA) is an amusing and somewhat slow-paced Irish comedy that I found an acceptable crossover film to rent with my SO, who doesn't like action films. The plot wraps up satisfyingly. Like many Irish films I've seen, it's charming and has plenty of small town culture. I would, however, recommend \"The Englishman Who Went Up a Hill But Came Down a Mountain\" (which is really Welsch), or \"The Full Monty\" first, which are similar but better. I'll give \"The Closer You Get\" a ho-hum but not exactly bad 5 out of 10.",
         "This movie is one of few that I have watched many many times. I love the cast and story. The characters are everyday folk that seem very real and familiar. Its a great look at the rural northwest Irish coast. I wish more movies of this type were made more often, so that people from other countries could see how things around the world are different and yet the same. If you have not seen this film I say you must if you really like movies. It was not released on DVD that I know of in the United States, but can be purchased from the UK in region two code also I think the only VHS versions were PAL. If you can't find it e-mail me at mark-kilgore@sbcglobal.net and I will try and get you a copy.",
         "There is nothing spectacular in this small movie. In a small Irish village, the guys try to break the limits of their boredom and celibacy, by putting an ad for brides in an American paper. While the American brides almost never show up, the boys learn a few lessons in life, and especially that happiness might be at much closer reach than it appears. No surprises, good acting, discrete humor, there is nothing unpleasant in this film. This is minor entertainment, but by no means a film to avoid."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Redwave Films"],
      "summaries": ["Irish lads send an ad to the Miami Herald inviting fit and enticing women, between the ages of 20 and 21, to live in their isolated Donegal village. The whole town knows about the ad, and it sharpens everyone's sense of the opportunities for happiness already at hand. Kate, a publican with a young daughter, is separating from her husband and catches the eye of a bachelor sheep farmer. Kieran the butcher realizes that his assistant Siobhan is comely, and then he discovers she's fiery as well. Ollie sends off for Dutch skin magazines that the village postmistress won't release to him. The men, and women, find counsel in their movie-loving priest. Will anyone answer the ad?"],
      "budget": 0
   },
   "movielensId": 3353,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-12-27",
      "dvdReleaseDate": "2006-01-10",
      "directors": ["Aileen Ritchie"],
      "runtime": 93,
      "movieId": 3353,
      "title": "The Closer You Get",
      "mpaa": null,
      "actors": [
         "Ian Hart",
         "Sean McGinley",
         "Niamh Cusack",
         "Ruth McCabe",
         "Ewan Stewart",
         "Pat Shortt",
         "Cathleen Bradley",
         "Sean McDonagh"
      ],
      "imdbMovieId": "0218112",
      "originalTitle": "The Closer You Get",
      "genres": [
         "Comedy",
         "Romance",
         "Foreign"
      ],
      "youtubeTrailerIds": ["svnrSLDewY8"],
      "plotSummary": "Irish bachelors take out an ad in the Miami Herald, looking for love.",
      "tmdbMovieId": 73642,
      "avgRating": 3.18293,
      "releaseYear": "2000",
      "numRatings": 41,
      "posterPath": "/1PJzmcviGO9sFtlub3OUd8CgP9s.jpg"
   }
}