{
   "tmdb": {
      "original_language": "fr",
      "keywords": [{
         "name": "kgb",
         "id": 3278
      }],
      "imdb_id": "tt0181530",
      "video": false,
      "title": "East/West",
      "recommendations": [
         118895,
         64835,
         86440,
         30805,
         67381,
         47200,
         337114,
         58777,
         228152,
         26232,
         177579,
         54144,
         49184,
         29134,
         53103,
         8049
      ],
      "backdrop_path": "/vDRn2gJCZNMqDRuDeRM8HNpMimW.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Gabrielle Develay",
               "gender": 1,
               "credit_id": "52fe4598c3a368484e06430b",
               "name": "Catherine Deneuve",
               "profile_path": "/6w0mcMkjLPSIj9iXMKNinxIHRyH.jpg",
               "id": 50,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Marie",
               "gender": 1,
               "credit_id": "52fe4598c3a368484e06430f",
               "name": "Sandrine Bonnaire",
               "profile_path": "/i8Os6hHPZKyDQerX4qtG6njCcDN.jpg",
               "id": 19161,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Aleksei Golovin",
               "gender": 2,
               "credit_id": "52fe4598c3a368484e064313",
               "name": "Oleg Menshikov",
               "profile_path": "/fj6Ie4e1LTVfXKWUpZtD1IOCub7.jpg",
               "id": 82795,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Sasha Vasilyev",
               "gender": 2,
               "credit_id": "52fe4598c3a368484e06431d",
               "name": "Sergei Bodrov Jr.",
               "profile_path": "/jlF4STOkQGsXmZfeaIqGacckVYn.jpg",
               "id": 71871,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Seryozha, à 7 ans",
               "gender": 0,
               "credit_id": "5453fc73c3a368148d002055",
               "name": "Ruben Tapiero",
               "profile_path": null,
               "id": 1380204,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Seryozha, à 14 ans",
               "gender": 0,
               "credit_id": "5453fcd0c3a368147c001f61",
               "name": "Erwan Baynaud",
               "profile_path": null,
               "id": 1380205,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Pirogov",
               "gender": 0,
               "credit_id": "5453fcf1c3a3681488002272",
               "name": "Grigori Manoukov",
               "profile_path": null,
               "id": 240276,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Olga",
               "gender": 0,
               "credit_id": "5453fd120e0a2648c2002065",
               "name": "Tatyana Dogileva",
               "profile_path": "/3kBiCQL37CpcdUubr85N5OQdbXI.jpg",
               "id": 86957,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Colonel Boyko",
               "gender": 2,
               "credit_id": "5453fd390e0a2648c50020ae",
               "name": "Bogdan Stupka",
               "profile_path": "/bKzf1afD1KsXMVCw3dP9YcDY1ud.jpg",
               "id": 82513,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Nina Fyodorovna",
               "gender": 1,
               "credit_id": "5453fd5bc3a368148d002076",
               "name": "Meglena Karalambova",
               "profile_path": null,
               "id": 1197983,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Viktor",
               "gender": 0,
               "credit_id": "5453fd710e0a2648c8002035",
               "name": "Atanass Atanassov",
               "profile_path": null,
               "id": 1254449,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Anastasia Aleksandrovna",
               "gender": 0,
               "credit_id": "5453fd86c3a3681484002116",
               "name": "Tania Massalitinova",
               "profile_path": null,
               "id": 1380206,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Volodya Petrov",
               "gender": 2,
               "credit_id": "5453fdbb0e0a2648d2002107",
               "name": "Valentin Ganev",
               "profile_path": "/9VKnIVL7pouxEowRia9TyWaKa8c.jpg",
               "id": 66792,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Sergei Kozlov",
               "gender": 0,
               "credit_id": "5453fdd8c3a3681488002293",
               "name": "Nikolai Binev",
               "profile_path": null,
               "id": 112342,
               "order": 14
            },
            {
               "cast_id": 17,
               "character": "Ambassadeur de France",
               "gender": 0,
               "credit_id": "5453fdf00e0a2648d90020da",
               "name": "René Féret",
               "profile_path": "/gwnOcreEAGMisWh8isn3jyiQ8AQ.jpg",
               "id": 24481,
               "order": 15
            },
            {
               "cast_id": 18,
               "character": "Le capitaine turc",
               "gender": 0,
               "credit_id": "5453fe67c3a368147c001f92",
               "name": "Daniel Martin",
               "profile_path": null,
               "id": 1380207,
               "order": 16
            },
            {
               "cast_id": 19,
               "character": "Le conseiller de l'ambassadeur",
               "gender": 2,
               "credit_id": "5453fe8ac3a368147800205b",
               "name": "Hubert Saint-Macary",
               "profile_path": "/dIZMy9tcqTgeJ7TQ0bxNZUS0RY7.jpg",
               "id": 44560,
               "order": 17
            },
            {
               "cast_id": 20,
               "character": "Fabiani",
               "gender": 0,
               "credit_id": "5453feacc3a3681473001fa4",
               "name": "Jauris Casanova",
               "profile_path": null,
               "id": 1092396,
               "order": 18
            },
            {
               "cast_id": 21,
               "character": "L'acteur de théatre",
               "gender": 0,
               "credit_id": "5453fedbc3a3681473001fab",
               "name": "Joël Chapron",
               "profile_path": null,
               "id": 1333460,
               "order": 19
            },
            {
               "cast_id": 22,
               "character": "Policier surveillance, Paris",
               "gender": 2,
               "credit_id": "5453fef60e0a2648cf00206e",
               "name": "François Caron",
               "profile_path": "/5okcfO4Z7j26zUiSR8EspJgZL1J.jpg",
               "id": 224148,
               "order": 20
            },
            {
               "cast_id": 23,
               "character": "Habilleuse",
               "gender": 0,
               "credit_id": "5453ff260e0a2648d200212e",
               "name": "Marie Verdi",
               "profile_path": null,
               "id": 584660,
               "order": 21
            },
            {
               "cast_id": 24,
               "character": "Moyta Petrov",
               "gender": 0,
               "credit_id": "5453ff3ec3a36814800020fa",
               "name": "Ivan Savov",
               "profile_path": null,
               "id": 1363432,
               "order": 22
            },
            {
               "cast_id": 25,
               "character": "Cadet Petrov",
               "gender": 0,
               "credit_id": "5453ff54c3a368146f001ef4",
               "name": "Aleksandr Stolyarchuk",
               "profile_path": null,
               "id": 1380210,
               "order": 23
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4598c3a368484e064319",
               "name": "Régis Wargnier",
               "profile_path": "/mYy0wD9HRGHECQPkXJoFLoLOgsx.jpg",
               "id": 27614,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5ab2540b0e0a261dc40085c6",
               "name": "Rustam Ibragimbekov",
               "profile_path": "/h2htMUQ76h6nineCHAtuNK0Hajn.jpg",
               "id": 82798,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 2.162761,
      "production_countries": [
         {
            "iso_3166_1": "BG",
            "name": "Bulgaria"
         },
         {
            "iso_3166_1": "ES",
            "name": "Spain"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "RU",
            "name": "Russia"
         }
      ],
      "id": 28463,
      "vote_count": 14,
      "budget": 0,
      "overview": "June 1946: Stalin invites Russian emigres to return to the motherland. It's a trap: when a ship-load from France arrives in Odessa, only a physician and his family are spared execution or prison. He and his French wife (her passport ripped up) are sent to Kiev. She wants to return to France immediately; he knows that they are captives and must watch every step.",
      "similar": [
         1247,
         1374,
         296098,
         33996,
         4614,
         27576,
         657,
         699,
         708,
         710,
         9080,
         6538,
         700,
         691,
         2370,
         1557,
         9509,
         49517,
         97630,
         68734
      ],
      "original_title": "Est -Ouest",
      "runtime": 125,
      "poster_path": "/x8aMnlDWcHj7yrMF6H5yHafDgJ6.jpg",
      "spoken_languages": [
         {
            "name": "Pусский",
            "iso_639_1": "ru"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [],
      "release_date": "1999-09-01",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Régis Wargnier"],
      "runtime": 121,
      "synopsis": null,
      "writers": [
         "Rustam Ibragimbekov",
         "Sergey Bodrov"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0181530/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQyNTA0NTE5Ml5BMl5BanBnXkFtZTcwNjkwOTgyMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Oleg Menshikov, Sandrine Bonnaire, Catherine Deneuve | See full cast and crew »"],
      "reviews": [
         "In 1946, Stalin invites Russian émigrés to return, in patriotic fervor, to help rebuild from WWII. Unbeknownst to them, all returnees are considered imperialists and spies, and are to be treated accordingly. \"East-West\" explores this nightmare scenario through the eyes of a family who returned; a Russian doctor, his French wife and their young son. Because of his doctoring skills he is spared the Gulag or execution, but his life in Kiev is certainly not what his wife is used to. The collision of cultures, the hardships, and the Stalinist tyranny all take a deep toll as they struggle to survive and escape. Dark, and claustrophobic, this is a gripping tale from beginning to end. And it is in the end a great love story, of devotion and sacrifice. At the showing I attended the tears flowed freely in the audience. I recommend it highly.",
         "I sat in the cinema after the credits had rolled almost unable to bring myself to leave, get in my car and drive home. I was completely overwhelmed by this intense film and its in your face storyline. Whether the story the film was based on was true or not, I thought the performances of all the actors and actresses were exceptional, the photography was excellent and overall though not a film that could be called 'enjoyable' because it was so sad, I was intensely moved and gave it 9/10.",
         "The cathartic nature of this film was such that found myself unable even to cry until the credits began their long slow march across the screen, and even then getting up out of my seat was not an option. I don't think any other film has made such a profound and immediate impact on me. Set in the years following Stalin's invitation to former expatriates to return to their native Russia \u0096a call many answered, blissfully unaware of the dire consequences their decision would have- it is filled with the Russian spirit that sees people stubbornly persevering, and touched with the French one that not only looks for escape but insists upon it. Some films would be rendered incomprehensible simply by the sheer amount of quiet action that here, thankfully, only adds to the audience's investment in the film, without losing focus. It was unquestionably the best film I have seen in recent memory. It is the closest I have ever felt to experiencing a Gesamtkunstwerk in a movie theatre.",
         "I went to this film without realizing that it told a story which had parallels in the history of my own Russian-emigrant family. My grandmother's brother repatriated under Stalin, had his goods and land confiscated, died in Siberia, and lost his two young sons to the Soviet Army. The film is absorbing and disturbing. The most shooting is done at eye level. There is a true sense of witness for the viewer in a very elemental, unavoidable way. Strangely, I think this improved the experience of the predictable horrors of life in Stalin's USSR. It made the experience seem, for me, much more present and less sentimental. The performances were very good. Ms. Bonnaire was totally believable and very likeable, despite the naivete and hysteria of her character. Mr. Menshikov played Alexei with great complexity and nuance, which allowed me to be less judgmental and to see his irrational need to belong among his own people as a very natural inclination. Mr. Bodrov, a Russian Brad-Pitt-alike, was very magnetic in his role as Sacha. I simply love to see Ms. Deneuve in any role, but her playing a mature French actress with admirable values was very moving for me. She carries her own maturity so regally. She was perfect for this role. I think this film is a wonderful model of cross-cultural cinema. I would like to see more films of this type in the US.",
         "'Est Ouest' is an impressive production based upon the true story of family comprising a Russian émigré husband, French wife and a little boy.In the heyday of Coldwar, Stalin invites all émigrés who left the country in the time of 1917 Civil War.The émigrés are promised a heaven once they promote to the restoration of order and rehabilitation of the war-torn economy.This demand is no surprising in view of the fact that Soviet Russia was the country hit by the war the most in terms of human and material resources. Once euphoric, the returnees find themselves disillusioned by old-fashioned, paranoid and corrupt political and economic fabric. The story is capturing sometimes thrilling. I have shared the excitement, fear and hope of heroes and heroines vividly. The music of the film pulls you vividly to understand how precious one's freedom can be.Unlike some criticism that the film misdirected reality,I would confidently maintain the belief that the story of the film is only one of the hundreds of tragedies in the Iron Curtain. Stalin's notorious reputation in employing violence and pressure is nothing but a historical truth. Eastern Europe is so beautiful..Kiev and Sofya..I shall never forget the dance scene at the hotel in Sofya. What is also worth-seeing is the entry of heroes to the Greek-Bulgarian boundary on the mountains capped with snow.This is the Balkans.. I must admit that I spent much time in trying to find this film as DVD.Swedem,Norway,Denmark,Germany,Belgium..nowhere..I did not have chance to request it online.I did not have credit cards..:)) Finally,I found it in mega store Virgin( Thanks Virgin)in Paris. I have soundtrack album of this unforgettable film too. If you haven't seen this film yet, you have missed a lot! By watching and- if possible- purchasing this film, you will have done a great contribution to movie industry which suffers from prevalence of crap movies. I am still under the influence of 'Est Ouest'.I hope u shall feel the same..",
         "Shot in dark tones of the Soviet popular colors, this movie will transport you right into the heart of the Communist system during the 1950's Stalin period. Within half an hour you'll be sorry that you came, because the director will make you fear for the unlikely heroes. You'll be holding to your chair and crave for the safety of your favorite TV soap. To call it a political thriller is not doing justice to the emotional overtone of the story of Marie and her husband Alexey. Director's rendition of the Marie's courage hidden in the simplest acts is quite dazzling. That, and good acting is the major \"special effect\" of this film, theme of which cannot be dismissed as a history to be forgotten. A system similar to the Soviet communism may sprout in any country, and the fate of the condemned people may depend on the valour of both insiders and the citizen of the free world. Don't worry, the movie is not moralizing. Do yourself a favor, go to see it - if the political system of your country permits you to do so (if it does not, smuggle it in and invite all your friends).",
         "For a guy who was a French communist until the age of 35, it was a hard movie to take, but it is a superb film, well acted and very realistic. My father was a french communist (the heart on the left and the wallet on the right) and he actually contempleted emigrating to the motherland of socialism when I was a kid, thank God, his wallet was heavier than his heart... Go to your video store and rent it, you won't regret it !",
         "\"East/West\" ventures into a time (post WWII) when the Iron Curtain shrouded Stalin's Soviet Union and a curtain of suspicion and distrust shrouded every soviet life. The film follows a French family of three as the patriarch returns to his Russian homeland where he and his family are held prisoners of conscience by communism. The film focuses on the characters, their silent suffering and yearning for freedom while living in a state of constant paranoia as it tears husband from wife, mother from son, and heroism emerges from the most unlikely places. \"East/West\" is an entertaining watch for all and, though fictional, offers a sense of what the Cold War was about.",
         "Alexei, the young doctor who decides to go back to the Soviet Union after a generous invitation of Josef Satlin, should have had his head examined! After all, as a professional he seemed to have been doing well in France. With all the best intentions, he takes his wife and young son to the old country only to find himself trapped in a totalitarian system that made him and the family virtual prisoners. \"Est Ouest\", directed by Regis Wargnier, shows in vivid detail what Alexei and Marie, his wife, have to endure when they are taken to Kiev, where he is assigned. Little did Alexei and Marie knew about the dismal housing problems of those years when the family is given a large room in an apartment that is being shared by five families! The film concentrates in the eventual break down of the marriage caused by the environment. Alexei ends up having an affair with Olga, another flat mate, and Marie falls in love for the poor Sacha, a young man who is left alone in the world when his grandmother dies. Marie blames Alexei for all the misery they have to endure; she is regarded as a foreigner, but she can't even go back to her native France. The film has an ironic end when Marie, helped by Gabrielle, a French actress, who is sympathetic to her fellow countryman. Marie realizes at the end of Alexei's tremendous sacrifice and ultimate punishment when she and her son are able to escape the communist hell that has imprisoned them. Great acting in general by Sandrine Bonnaire, who as Marie, is totally credible. Oleg Menshikov, makes the best of Alexei, at times appearing uncaring and selfish, but who deeply cared for his wife. Sergei Bodrov Jr. is also excellent as Sacha, the young boy in love with Marie. The film was shot in drab color, perhaps to emphasize the hard times during the Stalin regime. One gets only glimpses of some of the splendid, and opulent interiors, whenever the action takes place in one of those buildings or theaters. Unfortunately, the principals of this story never really had a chance to enjoy anything because the nightmare that became their lives under that totalitarian regime.",
         "Despite the fact that I was completely ignorant of the circumstances under which the characters suffered, I was swept away by this movie. All of the actors gave amazing performances, but I was most impressed by the way that Sandrine Bonnaire(Marie) and Oleg Menshikov (Alexei) were able to age their characters ten years using only their faces. Sergei Bodrov, Jr., was excellent as Sacha, the teenage lover of Marie. At the beginning of the movie he was scared and immature, but as the plot progressed I saw him evolve into a strong, determined man. The scenes of him swimming in the river involve some of the most captivating cinematography I've seen. I hold Bodrov's performance to be the best in the film. Not to be ignored is Catherine Denueve; though her role as a French actress, Gabrielle, determined to save Marie was small, it was critical, and she pulled it off brilliantly. East-West is a sweeping, engaging epic that will captivate even the most historically ignorant viewer."
      ],
      "genres": [
         "Drama",
         "History",
         "Romance"
      ],
      "productionCompanies": [
         "UGC YM",
         "France 3 Cinéma",
         "NTV-PROFIT"
      ],
      "summaries": ["June 1946: Stalin invites Russian emigres to return to the motherland. It's a trap: when a ship-load from France arrives in Odessa, only a physician and his family are spared execution or prison. He and his French wife (her passport ripped up) are sent to Kiev. She wants to return to France immediately; he knows that they are captives and must watch every step. By chance, she meets a touring French actress and pleads for help. She also takes a young swimmer under her wing, and several years later, he makes a bold attempt to escape. Meanwhile, the KGB is suspicious, and hope for freedom is dim. Patience, her husband's self control, and her good looks may be their only assets."],
      "budget": 0
   },
   "movielensId": 3357,
   "movielens": {
      "languages": [
         "Pусский",
         "Français"
      ],
      "releaseDate": "1999-09-01",
      "dvdReleaseDate": "2000-10-03",
      "directors": ["Régis Wargnier"],
      "runtime": 125,
      "movieId": 3357,
      "title": "East/West",
      "mpaa": null,
      "actors": [
         "Catherine Deneuve",
         "Sandrine Bonnaire",
         "Oleg Menshikov",
         "Sergei Bodrov Jr.",
         "Ruben Tapiero",
         "Erwan Baynaud",
         "Grigori Manoukov",
         "Tatyana Dogileva",
         "Bogdan Stupka",
         "Meglena Karalambova",
         "Atanass Atanassov",
         "Tania Massalitinova",
         "Valentin Ganev",
         "Nikolai Binev",
         "René Féret",
         "Daniel Martin",
         "Hubert Saint-Macary",
         "Jauris Casanova",
         "Joël Chapron",
         "François Caron",
         "Marie Verdi",
         "Ivan Savov",
         "Aleksandr Stolyarchuk"
      ],
      "imdbMovieId": "0181530",
      "originalTitle": "Est -Ouest",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "June 1946: Stalin invites Russian emigres to return to the motherland. It's a trap: when a ship-load from France arrives in Odessa, only a physician and his family are spared execution or prison. He and his French wife (her passport ripped up) are sent to Kiev. She wants to return to France immediately; he knows that they are captives and must watch every step.",
      "tmdbMovieId": 28463,
      "avgRating": 3.74818,
      "releaseYear": "1999",
      "numRatings": 548,
      "posterPath": "/674o9qA7nulzd0Y66h688YNEuPZ.jpg"
   }
}