{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "heaven",
            "id": 4116
         },
         {
            "name": "afterlife",
            "id": 6155
         }
      ],
      "imdb_id": "tt0101698",
      "video": false,
      "title": "Defending Your Life",
      "recommendations": [
         10631,
         27223,
         14741,
         26326,
         24032,
         61280,
         79888,
         19382,
         16448,
         31052,
         2107,
         24798,
         84278,
         55819,
         46435,
         19494,
         123772,
         28054,
         18203,
         32044
      ],
      "backdrop_path": "/qaXC4UVQ90ADUFZVZhoN4nYF5hq.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Daniel Miller",
               "gender": 2,
               "credit_id": "52fe44c79251416c75040a15",
               "name": "Albert Brooks",
               "profile_path": "/kahlMTdygrPJ28VYRhKPavYD9hs.jpg",
               "id": 13,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Julia",
               "gender": 1,
               "credit_id": "52fe44c79251416c75040a19",
               "name": "Meryl Streep",
               "profile_path": "/uyalVm3tH5DaUoxCmvILS9sUFsR.jpg",
               "id": 5064,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Bob Diamond",
               "gender": 2,
               "credit_id": "52fe44c79251416c75040a1d",
               "name": "Rip Torn",
               "profile_path": "/rzGaoGikjMuLDruABKdLcQLtkZk.jpg",
               "id": 9626,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Lena Foster",
               "gender": 1,
               "credit_id": "52fe44c79251416c75040a21",
               "name": "Lee Grant",
               "profile_path": "/t59I45kO8VxH57gg6hGE5UyC0f7.jpg",
               "id": 30123,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Agency Head",
               "gender": 2,
               "credit_id": "54b2b2f792514173690005ff",
               "name": "Michael Durrell",
               "profile_path": null,
               "id": 20628,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Daniel's Judge",
               "gender": 1,
               "credit_id": "54b2b32e92514114a2001f90",
               "name": "Lillian Lehman",
               "profile_path": null,
               "id": 22516,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Daniel's Father",
               "gender": 2,
               "credit_id": "54b2b33f9251416fe1003b96",
               "name": "S. Scott Bullock",
               "profile_path": null,
               "id": 60257,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Dick Stanley, Daniel's substitute attorney",
               "gender": 0,
               "credit_id": "54b2b34e9251417369000613",
               "name": "Buck Henry",
               "profile_path": "/1RVDoUYK85mynMCU7mom7B1TQqC.jpg",
               "id": 7795,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Jeep Owner",
               "gender": 2,
               "credit_id": "54b2b360c3a36820a7001644",
               "name": "James Eckhouse",
               "profile_path": "/4CUK6M7fGVK5Z1Qg65rMLDI6BdO.jpg",
               "id": 19151,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Victorian Girl",
               "gender": 1,
               "credit_id": "54b2b2d1925141746c004322",
               "name": "Noley Thornton",
               "profile_path": "/4AW2W3QPiQkWxaFimAXUDcNvMVt.jpg",
               "id": 1219380,
               "order": 10
            },
            {
               "cast_id": 7,
               "character": "Shirley MacLaine",
               "gender": 1,
               "credit_id": "52fe44c79251416c75040a25",
               "name": "Shirley MacLaine",
               "profile_path": "/faG5S4EOVaGHNf1CwZryGcHCE4e.jpg",
               "id": 4090,
               "order": 11
            },
            {
               "cast_id": 19,
               "character": "Waitress",
               "gender": 1,
               "credit_id": "554687bac3a3680cd700765a",
               "name": "Mary Pat Gleason",
               "profile_path": "/crJCES2ttMVhuU2gFxrRg1jDWum.jpg",
               "id": 62595,
               "order": 12
            },
            {
               "cast_id": 20,
               "character": "Elderly Woman on Tram",
               "gender": 0,
               "credit_id": "554688099251411149000092",
               "name": "Maxine Elliott Hicks",
               "profile_path": null,
               "id": 1363827,
               "order": 13
            },
            {
               "cast_id": 21,
               "character": "Comedian",
               "gender": 0,
               "credit_id": "55468839c3a3680ce800724f",
               "name": "Roger Behr",
               "profile_path": "/xBcohx3xnCM8H0RCJSdaZJqYlF6.jpg",
               "id": 45602,
               "order": 14
            },
            {
               "cast_id": 22,
               "character": "Martin",
               "gender": 2,
               "credit_id": "55f43939c3a3686d0b00340d",
               "name": "Alex Sheafe",
               "profile_path": null,
               "id": 1426205,
               "order": 15
            },
            {
               "cast_id": 23,
               "character": "Daniel's Judge",
               "gender": 2,
               "credit_id": "587142b3925141356400be99",
               "name": "George Wallace",
               "profile_path": "/1BpqYsnqAwCOEz1HX4jbNxUHoQU.jpg",
               "id": 1273694,
               "order": 16
            },
            {
               "cast_id": 24,
               "character": "Steve",
               "gender": 2,
               "credit_id": "59191199925141061e047745",
               "name": "Ethan Embry",
               "profile_path": "/btE5T04gKo8isQ2UekgXmZIMXmA.jpg",
               "id": 58019,
               "order": 17
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44c79251416c75040a0b",
               "name": "Albert Brooks",
               "profile_path": "/kahlMTdygrPJ28VYRhKPavYD9hs.jpg",
               "id": 13,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44c79251416c75040a11",
               "name": "Albert Brooks",
               "profile_path": "/kahlMTdygrPJ28VYRhKPavYD9hs.jpg",
               "id": 13,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44c79251416c75040a2b",
               "name": "Michael Grillo",
               "profile_path": null,
               "id": 30383,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44c79251416c75040a31",
               "name": "Michael Gore",
               "profile_path": null,
               "id": 32398,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44c79251416c75040a37",
               "name": "Allen Daviau",
               "profile_path": null,
               "id": 9965,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44c79251416c75040a3d",
               "name": "David Finfer",
               "profile_path": null,
               "id": 18387,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 5.871343,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 12186,
      "vote_count": 83,
      "budget": 0,
      "overview": "In an afterlife resembling the present-day US, people must prove their worth by showing in court how they have demonstrated courage.",
      "similar": [
         298025,
         12159,
         795,
         38874,
         28162,
         1649,
         3064,
         8067,
         9997,
         8967,
         1585,
         251,
         1832,
         285,
         4011,
         561,
         9473,
         123553,
         354912,
         8839
      ],
      "original_title": "Defending Your Life",
      "runtime": 112,
      "poster_path": "/xywR4UtFJFANoEbcbmOiZckkNPa.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Geffen Pictures",
            "id": 360,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1991-03-22",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "The first true story of what happens after you die.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Albert Brooks"],
      "runtime": 112,
      "synopsis": null,
      "writers": ["Albert Brooks"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0101698/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEzNDQ4MDE5Nl5BMl5BanBnXkFtZTYwOTcyMDc5._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Albert Brooks, Meryl Streep, Rip Torn | See full cast and crew »"],
      "reviews": [
         "This film changed my life and helped me to become a better person. This movie made me realize how MY life will look when showed upon \"the big screen\". \"Defending Your Life\" made me think about how I have handled fear and adversity in my life. It also made me consider the effect my actions can have on the lives of others. Because of this movie, I can tell you that my bus driver's name is Joe, and my mailman is Bob. I never liked Meryl Streep in other movies, but playing Julia, she is absolutely charming. This is one of the few movies I plan to buy and keep.",
         "This film's tag-line \"The first true story of what happens after you die,\" is so perfect for this film. This film is so consistently funny, I only wish I could screen it for all my friends at the same time, so I could share it with every one of them. I've seen this film many times, and enjoy it more each time. \"Lost In America\" is a great film of Albert Brooks', but this one is my favourite of his. Sadly, I rarely encounter someone who's already seen it. When I think of underrated films, I think of this one first. Right off the bat, our protagonist, Brooks, is dead, flattened by a bus. Next thing you know, he's in Judgment City, where people go when they die, and where it will be decided if he will go on to the next level or go back for another crack at life on Earth. In Judgment City he's reminded of all the key events in his life in something like a flashback screening room and his life is then evaluated by the custodians of the city, who will decide if he goes forward or not. Much like a court appearance. There are great performances by supporting players, especially Rip Torn, and while I never associated Meryl Streep with great comedy, she holds her own as Brooks' love interest. There is a hilariously understated performance by Buck Henry. The most fun with this film is learning bit by bit about the inner workings of Judgment City, as each aspect seems to have been well thought out and executed beautifully, right down to eating arrangements. A true masterful writing achievement for Brooks, who has shown his brilliance in many other films as well. This film should've been a big success, but in a way, I feel privileged to be one of the few people I know who has seen this film and enjoyed it so much. I'll do my part though, spreading the good word as much as possible. See it before you die.",
         "I have seen this film many times, and each time I seem to enjoy it more and more. Albert Brooks gets a hat-trick by directing, writing, and starring in this film about what life is like after death and what lies ahead for each individual. Many have already gone into great detail about the particulars of the film. I want to add that the film has tremendous heart. Albert Brooks gives probably his best performance as a man riddled with inner fears and yet learning quickly about life. The humour underlies almost every line in the film, much of it subtle and some more obvious. Brooks has a definite grasp of the little annoyances in life as he pokes fun at all kinds of situations that many of us just forget ever happened. The supporting cast is very good. I don't ever remember Meryl Streep looking so well. She seems to be so at home in her role. Lee Grant is as always a major plus, and Buck Henry adds his special subtle humour in a small role. But acting honors and many of the big laughs go to Rip Torn who looks like he is having a ball in his role defending Brook's character. The film, above all, says something about the fears and constraints we have in our lives and how they hold us back emotionally, intellectually, and spiritually. How true!",
         "Defending Your Life is one of those movies that has stuck with me over the years for some reason. The most likely one is that this film presents one of the most plausible and thought-provoking views of the afterlife that I have ever heard from a movie, or anywhere else for that matter. The protagonist (Brooks) dies and wakes up in Judgement City, where it's just like earth, only 70 degrees and clear all the time, and you can eat all of the most delicious food in existence that you want and not gain a pound. The catch is that you are essentially placed on trial. Several random days from your like are examined, and the judges decide whether you will \"move on\", or be sent back to earth to try again. The most interesting thing to me is that you aren't judged according to how well you followed the commandments, but on whether you let your fear keep you from making the right choices in your life. You see, fear is what keeps those of us on Earth (comically referred to as \"little brains\") from realizing our full potential. As great as this theory is, it's the character played by Albert Brooks that makes this film worth watching. We can sense his bewilderment, as well as his shame at not living his life as well as he could have. In fact, it is so easy to empathize with his character that I felt sorry for him, seeing myself in his place one day. But Don't get me wrong, Defending Your Life is also a very funny movie. Judgement City is a sort of parallel reality to our own, in ways that are very pleasant to see. And the ending is perfect. You owe it to yourself to see this movie.",
         "Albert Brooks definitely gives us his take on the afterlife. After watching movies such as \"Chances Are\" \"Ghost\" and \"Heart and Souls\" afterlife hasn't looked better. Brooks is a comedic genius but not only as an actor but a writer and director as well. In addition, Brooks was joined in this film by Rip Torn and Meryl Streep, who are phenomenal talents of their own. Their additions to the movie makes it that much funnier and dramatically better. Aside from \"What Dreams May Come,\" \"Defending Your Life\" is the best afterlife film I've seen because it is different than all the others. Brooks is a relief since his comedy is genuinely funny. This movie was a joy to watch because of the fun cast, unique plot and fun loving environment. Brooks, the writer, created the script with laughter in mind and enjoyment in his heart. The setting of \"Defending Your Life\" was very creative because it seemed so unique yet so real and true to life on earth. I was very impressed by the set designers at what they came up with to use as sets. Brooks created each scene with humor and wanted the film to be as original as possible. He succeeded because I enjoyed and laughed throughout the film and only original films do that for me. \"Defending Your Life\" will go down movie history as one of the more original and funnier films dealing with the afterlife. This is a must see for everyone.",
         "A wonderful comedy-fantasy that has all the wit of a good Woody Allen movie combined with genuine sweetness and good-naturedness. It's one of those rare films that achieve profundity without pushing for it; here it is done with the help of the clever structure. Albert Brooks delivers some great one-liners and wins the audience's affection easily, while Meryl Streep is atypically unaffected and Lee Grant is excellent in her supporting role. And who could ask for a better ending? (***)",
         "Albert Brooks' view of death is very pleasing to me! Imagine eating all you want while dressed in a comfortable Star Trek outfit! Plus the weather is always great! Unfortunately, that's only at Judgement City..who knows the circumstances at the other places? Daniel (Brooks) dies in the first ten minutes, while listening to Streisand in his brand new car. He is whisked off to Judgement City where everyone's life is evaluated. You see glimpses of your own past and have to defend your life and yourself. There's a prosecutor and your trial will decide if you 'go on' or 'go back' but none of that really matters that much. Its really just a reason to see all the flashbacks and relive all the memories. Everything is based on fear - how you handle it, if you let it run your life and, most importantly, if you overcame it at all. On night in a comedy club he meets Julia, played by Meryl Streep. They get along immediately and enjoy each other very much. She has a better hotel than he does and as the movie progresses you see Daniel as more of a loser than anything, while Julia was apparently in the other category. She is on a first-name basis with her lawyer and gets invited to a dinner party he throws. Daniel eats alone in a sushi bar (very funny scene!) that night. There is one priceless scene that I closely identified with. Daniel is on his way to Hong Kong (this is a scene from his life, obviously) and finds he has seat 'B', meaning he's between two people. He can't even consider sitting in between two people for that long a trip so asks the flight attendant if there are any available seats in first class. She says there is one seat, but it costs $3000 more. He takes it! I would also do a lot to avoid seat 'B', too! Albert Brooks movies are never laugh riots, but they are not supposed to be. They are pleasantly amusing, memorable and thoughtful. This movie falls into the category too but does contain a couple of very funny scenes - during his 'trial' there is what seems to be a 'blooper' tape of his life that is very funny and played strictly for laughs. Its a little disrespectful of the character but Brooks never minds portraying himself as vulnerable and human. Outcome is very satisfying. Streep underplays beautifully and the two actors have a considerable amount of chemistry. Rip Torn, Lee Grant and Buck Henry are the lawyers, and all of them are servicable. 8/10.",
         "I just recently saw this movie again on the tube and I was reminded why its one of my favourites. Not only is Brooks at his comedic best but Meryl Streep blended seamlessly into this movie. I was surprised that most of the comments about this movie were focused only on the afterlife and not the more obvious premise of the movie - how we deal with fear. While it is virtually impossible to take a Albert Brooks movie to heart, this one proves to be a clear exception. There is actually a profound message in this movie - your life is significantly shaped by the way you deal with fear. I challenge anyone who hasn't yet seen this movie to watch it and failed to be entertained. You won't be sorry.",
         "This movie is the very definition of \"feel good movie.\" This is a true laugh a minute while still managing to be insightful film. I watched this movie with my grandparents and all three of us burst out laughing at the same times. I don't think I've ever seen a movie where that's happened before. This movie will appeal to anyone... the jokes, you just can't miss them. It's touching and mind bogglingly hilarious at the same time. And the ending is phenomonal! Watch this movie just for the ending. :) Take two hours out of your life and watch a movie that I promise you, you won't soon forget. Watch it with your family and have someone to laugh with. I am going to see this movie over and over again, and I don't usually say that about movies. Interestingly enough, I was reading a self help book that turned out to be a complete bore the night before but which used \"Defending Your Life\" as an example for something they were trying to prove. I thought, hmm, that sounds interesting, but it's probably one of those old obscure movies I'll never get a chance to see. The very next day, I was in the video store just by chance, and while I was walking down the Comedy isle this movie jumped out at me. \"Hey! That was the book I read about last night!\" I thought. I got the movie and I wasn't dissapointed. What a way to make my day. Thank you Albert Brooks and Meryl Streep!",
         "SPOILERS AHEAD First of all, I should tell you I completely identified with Daniel. He's as neurotic and insecure as I am. Great story, true to form. Great acting (I thought Lee Grant was particularly effective, though I am not a fan of Streep's). Though I can see why the film is not more popular: it's a bit cerebral. For me, that is its best quality. It's cerebral without being dry. I was moved, not just at the end, but throughout the film (particularly the scene where Daniel is a child watching his parents arguing). The ending is \"feel good\". I usually don't like \"feel good\" movies, because usually they manipulate our emotions solely for the purpose of delivering a happy ending. But in this case I feel that the ending was completely justified, and made me feel good to boot. I was emotionally invested, and when Daniel joins Julia on the bus, it was very true to the remainder of the story. The ending summations were great. After watching Torn's I though Daniel was \"in\". Then after watching Grant's summation, I knew he was in trouble. I thoroughly enjoyed Daniel's summation. He simply said \"I'll do the best I can\". That is the central message of the movie, and when he delivers it, he doesn't sound preachy or hokey. It comes off as simple, honest, and beautiful. And it was only after several viewings (and my sister pointing out to me) that I realized that Rip Torn sets up Daniel before he puts him on the bus. He tells him, \"just take the opportunities when they come.\" He doesn't directly tell Daniel to go after Julia, but he's really setting him up. Finally, the sequence with Buck Henry was brilliant. In that sequence, Grant shows a mis-judgement by Daniel, but that mis-judgement is NOT fear-based, it was just a bad investment decision. Buck Henry does not point this out, and Daniel is feeling so guilty about the whole thing that he doesn't notice it himself. Just brilliant. I read all the comments that came before mine, and I was amazed to see that there were a couple of negative reviews. I guess that shows you can't please all the people all the time, though I was genuinely surprised."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Fantasy"
      ],
      "productionCompanies": ["Geffen Pictures"],
      "summaries": [
         "Yuppie Daniel Miller is killed in a car accident and goes to Judgment City, a waiting room for the afterlife. During the day, he must prove in a courtroom-style process that he successfully overcame his fears (a hard task, given the pitiful life we are shown); at night, he falls in love with Julia, the only other young person in town. Nights are a time of hedonistic pleasure, since you can (for instance) eat all you want without getting fat.",
         "All of your life is on videotape -- or perhaps laser disk -- to make it easier on your prosecutor and defense attorney at Judgement City to randomly access a few episodes to show whether you made the most of the life you just completed. If you didn't make the most of that life, you will be sent back to try again and again until you do get it right. And the court must be taking an advance peek at that life tape. Posh accommodations go to those who look like they will merit moving up to citizen of the universe -- like Julia who falls for Daniel, whose quarters have no ambiance at all.",
         "In an afterlife resembling the present-day US, people must prove their worth by showing in court how they have demonstrated courage."
      ],
      "budget": 0
   },
   "movielensId": 3358,
   "movielens": {
      "languages": [
         "English",
         "日本語"
      ],
      "releaseDate": "1991-03-22",
      "dvdReleaseDate": "2001-04-03",
      "directors": ["Albert Brooks"],
      "runtime": 112,
      "movieId": 3358,
      "title": "Defending Your Life",
      "mpaa": "PG",
      "actors": [
         "Albert Brooks",
         "Meryl Streep",
         "Rip Torn",
         "Lee Grant",
         "Michael Durrell",
         "Lillian Lehman",
         "S. Scott Bullock",
         "Buck Henry",
         "James Eckhouse",
         "Noley Thornton",
         "Shirley MacLaine",
         "Mary Pat Gleason",
         "Maxine Elliott Hicks",
         "Roger Behr",
         "Alex Sheafe",
         "George Wallace",
         "Ethan Embry"
      ],
      "imdbMovieId": "0101698",
      "originalTitle": "Defending Your Life",
      "genres": [
         "Fantasy",
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": [
         "jp6qkZkPBhY",
         "oXNBLTdH7aI"
      ],
      "plotSummary": "In an afterlife resembling the present-day US, people must prove their worth by showing in court how they have demonstrated courage.",
      "tmdbMovieId": 12186,
      "avgRating": 3.60145,
      "releaseYear": "1991",
      "numRatings": 2346,
      "posterPath": "/xywR4UtFJFANoEbcbmOiZckkNPa.jpg"
   }
}