{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "italy",
            "id": 131
         },
         {
            "name": "commando",
            "id": 15248
         },
         {
            "name": "canadian army",
            "id": 193534
         }
      ],
      "imdb_id": "tt0062886",
      "video": false,
      "title": "The Devil's Brigade",
      "recommendations": [
         41857,
         36554,
         42500,
         45608,
         21366,
         42472,
         166607,
         45522,
         30298,
         40140,
         18780,
         71945,
         129251,
         26205,
         44736,
         19664,
         16850,
         36642,
         29237,
         29586
      ],
      "backdrop_path": "/pWgGRbrEYB4oj1LI1ZIjHrQ8n3n.jpg",
      "revenue": 0,
      "reviews": [
         {
            "author": "John Chard",
            "id": "52bf78b0760ee37e38041aac",
            "content": "Teufels Brigade. \r\n\r\nThe Devil’s Brigade is directed by Andrew V. McLaglen and adapted to screenplay by William Roberts from the book of the same name written by Robert H. Adleman and George Walton. It stars William Holden, Cliff Robertson, Vince Edwards, Harry Carey, Claude Akins, Andrew Prine, Richard Jaeckel, Jack Watson and Jeremy Slate. A Panavision/De Luxe Color production, music is by Alex North and cinematography by William H. Clothier. \r\n\r\nBased on real people and incidents, film follows the formation of the 1st Special Service Force (AKA: The Devil’s Brigade), their training and subsequent mission to seize control of Monte la Difensa, a Nazi stronghold during the Italian Campaign in World War II. \r\n\r\nSomewhere along the path of war movie history there was a wind of change that saw the all heroic soldier of sincerity replaced by the anti-hero thug! Where misfits, criminals and army bums were thrust into missions that gave them the chance of redemption or a semblance of honour via death. This format reached a pinnacle, arguably, with Robert Aldrich’s Magnificent Macho Movie, The Dirty Dozen (1967). A year later came The Devil’s Brigade, a film strikingly similar to The Dirty Dozen, yet unlike Aldrich’s movie is based on facts, it should also be noted that the novel The Devil’s Brigade was written in 1966. \r\n\r\nMcLaglen’s movie follows the tried and tested formula, men from all walks of life thrust together and expected to gel as one fighting force. Cue hostilities and suspicions, here in the guise of a crack Canadian army unit joining forces with a platoon of American wasters. The training is as tough as it gets, the men continuing to try and out macho each other, and then that magical moment occurs when they come together as one and realise they actually can get on after all. This comes about in TDB courtesy of a gloriously over the top part of the film where the Yanks and Canadians brawl with local lumberjacks and the military police. Something which greatly makes their leader, Lt. Col Robert Frederick (Holden), very proud. He of course is straight from the “unconventional” line of military leaders. \r\n\r\nSo it goes, fists fly as much as the jokes, the insults are barbed and the macho posturing never wavers. Frederick butts heads with the suits, his charges forced to prove themselves as an elite fighting force, and then it’s to the big bang mission, where it’s a time for heroes and we know that not everyone will survive the pyrotechnics. Cast performances are just fine, inevitably with such an ensemble piece many of the characters are not fully fleshed, but the main players impact well on the drama. North’s music is delightfully boisterous, the blend of national themes most catchy, Clothier’s photography around the Utah and Lazio locales lurches nicely from the screen, while McLaglen, so often derided for some of his directing assignments, does a bang up good job for the two action sequences that finalise the movie. \r\n\r\nIt doesn’t break new ground, but for this line of formula war movies it comfortably keeps the fires burning. 7.5/10",
            "url": "https://www.themoviedb.org/review/52bf78b0760ee37e38041aac"
         },
         {
            "author": "talisencrw",
            "id": "57a8ed2292514177dc009308",
            "content": "Being from Windsor, Ontario, Canada, this film has special significance, as there are still survivors from the actual 'Devil's Brigade'. This film was a hoot to watch and greatly enjoyable. Heartily recommended for those enthusiasts of war movies, and had just enough humour to be endearing rather than off-putting. Would make a fine double bill with the similarly-toned 'Three Kings' or 'Kelly's Heroes'.",
            "url": "https://www.themoviedb.org/review/57a8ed2292514177dc009308"
         }
      ],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Lt. Col. Robert T. Frederick",
               "gender": 2,
               "credit_id": "52fe44aa9251416c910189d7",
               "name": "William Holden",
               "profile_path": "/6sa5f8p1KBhYxJDEmCLxn7QLcBe.jpg",
               "id": 8252,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Major Alan Crown",
               "gender": 0,
               "credit_id": "52fe44aa9251416c910189e1",
               "name": "Cliff Robertson",
               "profile_path": "/q8DvYrkVZ6GajgU2V771Y0dOGWy.jpg",
               "id": 19153,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Major Cliff Bricker",
               "gender": 2,
               "credit_id": "52fe44aa9251416c910189e5",
               "name": "Vince Edwards",
               "profile_path": "/mr3mDCY6QQEZJHOr32pI0mN8vnc.jpg",
               "id": 3337,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Pvt. Theodore Ransom",
               "gender": 2,
               "credit_id": "52fe44aa9251416c910189e9",
               "name": "Andrew Prine",
               "profile_path": "/4heJy09ohj94DKYN9C4LN44mR2Z.jpg",
               "id": 15668,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Sgt. Pat O'Neill",
               "gender": 2,
               "credit_id": "52fe44aa9251416c910189ed",
               "name": "Jeremy Slate",
               "profile_path": "/w9SPBkH6XvFSMCDCOUA28BIZGgN.jpg",
               "id": 78690,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Pvt. Rocky Rockman",
               "gender": 2,
               "credit_id": "52fe44aa9251416c910189f1",
               "name": "Claude Akins",
               "profile_path": "/ul0S3Eb0yt2UC8h5xUuNXQHxdy8.jpg",
               "id": 4307,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Cpl. Peacock",
               "gender": 2,
               "credit_id": "52fe44aa9251416c910189f5",
               "name": "Jack Watson",
               "profile_path": "/76e7aWYfYdGq7tlTIVuDEcQtfDo.jpg",
               "id": 47549,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Pvt. Omar Greco",
               "gender": 2,
               "credit_id": "52fe44aa9251416c910189f9",
               "name": "Richard Jaeckel",
               "profile_path": "/pTTfCxMxjBvxkcemCBwNqEiHXce.jpg",
               "id": 58423,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Pvt. Bronc Guthrie",
               "gender": 2,
               "credit_id": "52fe44aa9251416c910189fd",
               "name": "Bill Fletcher",
               "profile_path": null,
               "id": 152654,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Pvt. Hugh MacDonald",
               "gender": 2,
               "credit_id": "52fe44aa9251416c91018a01",
               "name": "Richard Dawson",
               "profile_path": "/hN6YrUubNwblaKQjoqMGf80GS4I.jpg",
               "id": 96623,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Pvt. Al Manella",
               "gender": 2,
               "credit_id": "52fe44aa9251416c91018a05",
               "name": "Tom Troupe",
               "profile_path": null,
               "id": 6466,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Pvt. Hubert Hixon",
               "gender": 2,
               "credit_id": "52fe44aa9251416c91018a09",
               "name": "Luke Askew",
               "profile_path": "/nlV0bfadoMjbz7vxmLl5zALc86H.jpg",
               "id": 8962,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Pvt. Henri Laurent",
               "gender": 0,
               "credit_id": "52fe44aa9251416c91018a0d",
               "name": "Jean-Paul Vignon",
               "profile_path": "/bcyUyg89UnvVPdwJNEfF2FqHPnN.jpg",
               "id": 59066,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Capt. Cardwell",
               "gender": 2,
               "credit_id": "52fe44aa9251416c91018a11",
               "name": "Tom Stern",
               "profile_path": null,
               "id": 223349,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Capt. Rose",
               "gender": 2,
               "credit_id": "52fe44aa9251416c91018a15",
               "name": "Harry Carey, Jr.",
               "profile_path": "/p0olWUm87R6CPsL5M9FnxNSFszF.jpg",
               "id": 4316,
               "order": 14
            },
            {
               "cast_id": 23,
               "character": "Lt. Gen. Maxwell Hunter",
               "gender": 0,
               "credit_id": "58a09387c3a3684dc4000198",
               "name": "Michael Rennie",
               "profile_path": "/ebIHXyh1wx0HJqSpNEnGhYdmTvd.jpg",
               "id": 12282,
               "order": 15
            },
            {
               "cast_id": 24,
               "character": "Maj. Gen. Maxwell Hunter",
               "gender": 2,
               "credit_id": "58a093e0c3a3684dc8000193",
               "name": "Carroll O'Connor",
               "profile_path": "/odTJd5NX5wJ2kTn2wavsypuwmZq.jpg",
               "id": 26512,
               "order": 16
            },
            {
               "cast_id": 25,
               "character": "Brig. Gen. Walter Naylor",
               "gender": 2,
               "credit_id": "58a094299251412b5e00025a",
               "name": "Dana Andrews",
               "profile_path": "/shBCkOYpoJuzwTmJMaP9ZqD8YPf.jpg",
               "id": 13578,
               "order": 17
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44aa9251416c910189dd",
               "name": "Andrew V. McLaglen",
               "profile_path": "/fBPvpudpx5YiOy0S2EWeoc6vXgG.jpg",
               "id": 51875,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44aa9251416c91018a1b",
               "name": "William H. Clothier",
               "profile_path": null,
               "id": 40183,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44aa9251416c91018a21",
               "name": "David L. Wolper",
               "profile_path": "/lJg7z4Orrc5hP7dQ9vJd0mIMnk8.jpg",
               "id": 3453,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44aa9251416c91018a27",
               "name": "William Roberts",
               "profile_path": null,
               "id": 14521,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44aa9251416c91018a2d",
               "name": "Robert H. Adleman",
               "profile_path": null,
               "id": 1266781,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe44aa9251416c91018a33",
               "name": "George Walton",
               "profile_path": null,
               "id": 1266782,
               "department": "Writing",
               "job": "Story"
            }
         ]
      },
      "genres": [
         {
            "name": "War",
            "id": 10752
         },
         {
            "name": "Action",
            "id": 28
         }
      ],
      "popularity": 3.089312,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 31938,
      "vote_count": 25,
      "budget": 0,
      "overview": "1968 American war film about the formation and first mission of the joint Canadian-American WWII special forces winter and mountain unit formally called 1st Special Service Force, but commonly known as “The Devil’s Brigade”.  The film dramatises the Brigade's first mission in the Italian Campaign, the task of capturing the German mountain stronghold Monte la Difensa, in December 1943.  The film is based on the 1966 book of the same name, co-written by American novelist and historian Robert H. Adleman and Col. George Walton, a member of the brigade.",
      "similar": [
         10895,
         8429,
         36557,
         109424,
         98,
         106,
         156022,
         324552,
         4421,
         11216,
         13448,
         1213,
         80752,
         207932,
         242,
         238,
         240,
         279,
         637,
         644
      ],
      "original_title": "The Devil's Brigade",
      "runtime": 130,
      "poster_path": "/c94QnCsfAcugbZxaCZbVZHd76E1.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Wolper Pictures",
         "id": 16354,
         "origin_country": ""
      }],
      "release_date": "1968-05-15",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "What they did to each other was nothing compared to what they did to the enemy!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Andrew V. McLaglen"],
      "runtime": 130,
      "synopsis": null,
      "writers": [
         "William Roberts",
         "Robert H. Adleman"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0062886/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzA5Mjk0ODQyNF5BMl5BanBnXkFtZTcwNjgzMzUyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: William Holden, Cliff Robertson, Vince Edwards | See full cast and crew »"],
      "reviews": [
         "REVIEW OF THE MGM REGION 1 DVD With the huge success of \"The Dirty Dozen\", a popular theme began to appear in war movies: instead of focusing on good, clean-cut heroes, the main characters became misfits thrown into situations which made them heroes, whether they wanted to be or not. The story of the Devil's Brigade is a true one about misfits turned into wartime heroes. William Holden plays Lt. Col. Frederick, who derives a plan for combining Canadian and American troops into an assault force which will attack the Germans in Norway. Holden is forced to deal with two contingents of troops: a proud, professional Canadian unit under the command of career soldier Major Crown (Cliff Robertson) and an American unit comprised of misfits and criminals, led by crass Major Bricker (Vince Edwards). The men instinctively hate each other, and spend their months of training bickering with one another, until a huge bar fight forces them join forces against unappreciative lumberjacks. From there, the men are no longer fighting each other\u0085 they are deployed to Italy, rather than Norway, where they must capture a strategic hilltop from which Nazi artillery pounds the Allied advance. Veteran director McLaglen, who seems to always be able to throw together a satisfying film but never really made a classic, falls short once again \u0096 this time, he's trying to make a docudrama, but constantly falls back on established stereotypes and familiar situations rather than fresh, new material, almost as if he's afraid to try something new. That aside, this is one very entertaining movie, and its' success rests largely on the capability of a huge cast of character actors. Of the three leads, Robertson is most convincing. He manages to make Crown an admirable hero, with guts and determination. He cares about his men but pushes them to their limits because he knows that when they face the Wehrmacht, they will be better off for it. He is calm and collected under pressure, whether it is pressure from superior officers, attitudes of the men under his command or in the tense heat of battle. Likewise, Edwards breathes vibrant life into Bricker. Bricker is a witty officer with a short temper towards misbehavior in his unit, and little respect for the dregs he commands. We know he's unhappy with his assignment from the moment we meet him; only gradually does his attitude change. Holden is actually the least believable of the three leads. He never seems to be acting with much passion or concern for his character, and never comes across as a real, living human being. His role as commander is strictly one-dimensional, and this is probably the lowest-grade role I've seen him in to date. This is where flaws in the script begin to take their toll, because most viewers have seen Holden act so much better, but that's because he's had much better material to work with. The supporting cast is filled with familiar faces, several of which deserve mention because they are so good. One standout is Claude Akins as Rocky Rockman, easily the most rebellious of the Americans. He's physically rough, profane, and won't hesitate to pick a fight with anyone, anywhere. But during the aforementioned bar fight, he finds himself allied with Peacock (Jack Watson), a Canadian he holds in highest contempt. Peacock is a staunch, stiff NCO who makes discipline and respect his #1 priorities, and naturally, he and Rockman don't get along\u0085 until they have to fight alongside each other to gain respect from some angry lumberjacks, and realize that maybe they can get along as comrades in arms, and maybe even friends. The course of this relationship builds realistically throughout the course of the entire film, making one scene during the final battle incredibly moving. McLaglen makes the final major encounters with the Germans, the highlights of the film. The first major encounter involves the brigade's probe of a German village, in which they manage to capture an entire German battalion without taking a single casualty. This scene is funny and well-executed, but never comes across as a very convincing \u0096 it's simply meant to be a humorous excursion, and proves that the men of the Devil's Brigade can operate better than any other American Army unit. The on-location filming looks great in this sequence, though \u0096 it was shot in a real village, not on a set, and the exteriors look fresh in every shot. McLaglen uses a lot of pans and zoom-outs to show the progress of his characters, too, making for some nicely composed sequences. The final mountaintop battle is brilliantly executed from start to finish. Beginning with a perilous sequence of the brigade rappelling up steep cliffs, the sequence builds to a bloody, hand-to-hand encounter with German infantry. Most of the battle is shot from the grunts' perspective, and the camera occasionally rises above the action to show us what progress the men have made \u0096 but essentially, this isn't an epic battle with a bunch of extras battling it out. McLaglen is interested in telling a human drama from the start, and doesn't abandon his characters in favor of scope. Instead, he tells the story of the fight as the men see it, and does a very good job. When compared to films of today, the final battle isn't very graphic, but does feature plenty of blood spurts and there is some use of a hand-held camera, making this a bit more realistic than some other war films of the time period. \"The Devil's Brigade\" is a touching human drama, but easily fades into the sea of familiar unit pictures. There is nothing to really set this apart from that sea, but director McLaglen and the actors work well together, making the story riveting and enjoyable. There are ample doses of humor and satisfying amounts of humor, action and character drama to make this a recommendable war film.",
         "You may sometimes get the feeling that Hollywood thinks that World War II was won entirely by commando units. But The Devil's Brigade is one of the better \"Special Forces\" films. William Holden is chosen to meld a group of American misfits with an elite group of Canadian Army troops. The results are sometimes predictable, but nevertheless, interesting and humorous.The well-chosen cast makes the film what it is, with Jeremy Slate turning in a understated but splendid performance as the hand-to-hand combat instructor. The Devil's Brigade is good entertainment.",
         "The Devil's Brigade was indeed made up of Canadian elite and American cast-offs at the formation of the first US Special Forces unit, and this movie gives us the beginning of their amazing story. Most people are probably unaware that the Canadian army had such an influence on the initial training of this unit. A lot of Americans probably won't like how their countrymen are portrayed at the outset compared to the Canadian \"hand-picked, best-trained men in the best-trained army in the world\" (in the word's of the unit's American commander, portrayed by Holden). But they should be proud of what they were raised up to become, and how they acquitted themselves in battle. It's particularly nice to see the Canadian army portrayed with the respect it richly deserves. There's many amusing scenes in the movie, including my favorite, the mess-hall scene with the Canadian hand-to-hand combat instructor from the PPCLI and the oafish American soldier (who had been denigrating the Canadians up to that point). A great WWII movie, worth watching whenever it's on. The Canadian History channel follows showings with an interview with one of the founding members of this unit, who vouches for the general portrayal of events (though he said he doesn't recall them marching into the Montana training camp on their arrival, as portrayed in the movie). The takeover of the German unit in the town was somewhat fictionalized, too, and is a composite of several events (but that's the movies for you).",
         "When The Devil's Brigade first came out it got panned by a lot of critics in that it was too similar to The Dirty Dozen. Never mind that it was based on some real figures, the consensus was that The Devil's Brigade was a poor imitation of The Dirty Dozen. Personally I think it was a better film. I'm sure that the characters and incidents were given a lot of poetic license, but that was to make it entertaining. And entertaining it is. But it's also inspiring, especially in the last battle sequence, taking that hill by going up the hard way. When Bill Holden was cast as real life Lieutenant Colonel Robert Frederick, Mrs. Frederick was interviewed and said while she admired Mr. Holden's talent, she thought her husband was more the Gregory Peck type. Nevertheless Holden does a fine job as a man who shoots down Lord Louis Mountbatten's idea of a combined American/Canadian special force and then gets command of it. He's also a staff officer who had not seen combat and he was trying to prove something to himself. As good as Holden is, the best performance in this film has to be that of Cliff Robertson as Canadian Major Alan Crown. Robertson's an Ulster Irishman in the film and his acting and accent are impeccable. He's got something to prove as well, he and many of his Canadians left Europe at Dunkirk. Robertson himself was off his Oscar winning performance in Charly and The Devil's Brigade was a good follow up for him. The Canadians selected for this unit are the pick of the lot, while the Americans emptied their stockades of all the refuse. Holden encourages competition among them and a really terrific sequence involving a bar brawl with some obnoxious lumberjacks welds a camaraderie among former feudees. Standing out in the cast are Claude Akins as a particularly rambunctious American recruit and Jack Watson as the Canadian sergeant. They bond particularly close, some might even infer some homosexuality here, but Watson's death scene and Akins's reactions are particularly poignant. The Devil's Brigade also came out during the Viet-nam War and war films were not well received at that time, at least until Patton came out. Seen now though, The Devil's Brigade is a fine tribute to the Canadians and Americans who made up the First Special Service Force.",
         "I've read and researched quite a bit on the actual First Special Service Force, which this movie is based on, and found that, although it (as with most movies) does differ on occasion from the actual history, on the whole it is a moving tribute which captures the spirit of the Force. The acting was first-rate, and although the cinematography left a little to be desired I can see why it recieved high ratings among IMDB members.",
         "This is one great film. I must say that when it comes to WW2, Canadians always seem to be left out. It was that way with The Longest Day, Saving Private Ryan , The Great Escape etc, so I must say that seeing Hollywood making a movie with Canadians is exciting in itself. This movie is based upon an actual joint Canadian - American unit, that was formed during WW2. The movie is fairly accurate as far as how things really went, during training and also in combat. This unit was one of the crack units of the war, and the end battle of the movie was a real WW2 battle. I found the acting to be alright for its time, except that once again Canadians are portrayed as speaking with an English accent! as for the battles and the depth of the film, I would say it did a good job of bringing together the characters. I would say that this would make a great remake. I would also hope that maybe Hollywood would make a few more movies about this great unit and the people who served.",
         "The Historical facts: The following is from the book Canadians at War 1939-1945. The First Special Service Force - or the force , as it was called - an elite unit of both Canadians and Americans was formed in 1942. It had some 700 Canadians and 1700 Americans of all ranks distributed throughout three regiments. It was a tough outfit, trained to drop by parachute and fight in mountains or on skis. The force had its first taste of mountain fighting in Italy in December 1943, when it helped take a group of German-held hills barring the Allied advance on Rome. Two Battalions scaled the sheer face of a 3000 foot peak and drove the enemy form their caves and pillboxes around the summit. Within four days, all the neighboring ridges were also cleared. The Force had done superbly in its first action but it had suffered 400 casualties. Canadian losses totaled 27 killed and 64 wounded. Later the same month, the Force was sent to fight alongside U.S. troops on the approaches to Cassino. And, in February 1944, the unit was committed to the Anzio beachhead, which the Allies had established in an attempt to outflank German forces south of Rome. Churchill called the Force's Leader. U.S. Maj. Gen. Robert Frederick, \"the greatest fighting general of all time.\" The Force itself won the nickname \"The Devil's Brigade,\" a term apparently inspired by the blackened faces members wore on patrols and in battle. A German officer's diary recorded: \"The black devils are around us every time we come into the line, and we never hear them come.\" The Force ended its fighting days in August 1944 in the largely unopposed invasion of southern France and was disbanded later that year. The Americans were formed into an infantry regiment; the Canadians went back to their own army, some of them to the 1st Parachute Batallion.",
         "Critics do not respect this tough-minded and character-rich WWII mission film; it might be subtitled the dirty hundreds because it has so many trainees being readied for combat. The only persons who like this are those who enjoy a stirring action picture with many interesting participants and good actors. The script is by fine veteran William Roberts, direction by Andrew V. MLlaglen, a stellar job. Add music by Alex North of \"Spartacus\" fame and gritty, superior art direction by Alfred Sweeney and you have a fine start. The training takes place somewhere in the US, the mission in the Italian Alps to boot. Actors shining in the large cast include William Holden as the leader, Cliff Robertson as as a needlessly stiff Canadian, plus Michael Rennie. Dana Andrews, Vince Edwards, Claude Akins, Jeremy Slate, Richard Jaeckel, Andrew Prine, Jack Watson and dozens of other well-cast GIs. Add Gretchen Wyler, a spectacular fight with lumberjacks in a bar, judo training with a comedic intro, a twenty-mile hike and the mission itself where many exciting and tragic incidents happen to men the viewer has come to know- -war movies hardly get better than this. The film has a realistic feel about it at all times; Akins as Rocky, Slate as a bespectacled unarmed combat type, Rennie, Jack Watson and Holden are standouts. But Roberts' script, McgLaglen's taut direction and North's music make this a superior film whatever genre it is classified within.",
         "Not bad for an older movie. The 60's is full of WW2 movie, and the Devil's Brigade is better than most. Fast paced, interesting, and the strong ending gives this film 7 stars. I wonder how much of this film is actually based on the true story. The movie appears realistic.",
         "My grandfather passed away when I was 14. He was a member of the First Special Service Force \"The Devil's Brigade\". While the movie is not 100% historically accurate, it gives me a link to my grandfather. When I watch the movie it gives me an appreciation of what he did to serve his country. I would recommend this movie to anyone with an interest in WWII."
      ],
      "genres": ["War"],
      "productionCompanies": ["Wolper Pictures"],
      "summaries": [
         "During World War II, a special fighting unit is formed that combines a crack Canadian Army unit and a conglomeration of U.S. Army misfits who had previously served time in military jails. After an initial period of conflict between the two groups, their enmity turns to respect and friendship, and the unit is sent Italy to attempt a dangerous mission that has heretofore been considered impossible to carry out.",
         "A fictionalized account of the First Special Service Force, the joint Canadian-American World War II commando group under the command of Col. Robert T. Frederick. The Canadians are the best that the Canadian Army has to offer: spit and polish, multiskilled, experienced soldiers. The Americans are the dregs of the U.S. Army: misfits and troublemakers lacking any kind of discipline. Over time, Frederick forges a unified, highly competent fighting force. Initially trained for a commando operation in Norway, Frederick has to move quickly to keep the unit together after the operation was canceled. They are sent to Italy where they distinguish themselves in battle.",
         "An American colonel who has never been in combat is assigned to create a special forces unit from Canadian Army troops and a ragtag group of U.S. Army misfits."
      ],
      "budget": 0
   },
   "movielensId": 3367,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1968-05-15",
      "dvdReleaseDate": "2002-05-07",
      "directors": ["Andrew V. McLaglen"],
      "runtime": 130,
      "movieId": 3367,
      "title": "The Devil's Brigade",
      "mpaa": "",
      "actors": [
         "William Holden",
         "Cliff Robertson",
         "Vince Edwards",
         "Andrew Prine",
         "Jeremy Slate",
         "Claude Akins",
         "Jack Watson",
         "Richard Jaeckel",
         "Bill Fletcher",
         "Richard Dawson",
         "Tom Troupe",
         "Luke Askew",
         "Jean-Paul Vignon",
         "Tom Stern",
         "Harry Carey",
         " Jr.",
         "Michael Rennie",
         "Carroll O'Connor",
         "Dana Andrews"
      ],
      "imdbMovieId": "0062886",
      "originalTitle": "The Devil's Brigade",
      "genres": [
         "War",
         "Action"
      ],
      "youtubeTrailerIds": ["8EIFTAY4Tf8"],
      "plotSummary": "1968 American war film about the formation and first mission of the joint Canadian-American WWII special forces winter and mountain unit formally called 1st Special Service Force, but commonly known as “The Devil’s Brigade”.  The film dramatises the Brigade's first mission in the Italian Campaign, the task of capturing the German mountain stronghold Monte la Difensa, in December 1943.  The film is based on the 1966 book of the same name, co-written by American novelist and historian Robert H. Adleman and Col. George Walton, a member of the brigade.",
      "tmdbMovieId": 31938,
      "avgRating": 3.42958,
      "releaseYear": "1968",
      "numRatings": 213,
      "posterPath": "/2IYtwZv6xEI4Rv43MjDTvURQh2H.jpg"
   }
}