{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "casino",
            "id": 585
         },
         {
            "name": "thief",
            "id": 9727
         }
      ],
      "imdb_id": "tt0057344",
      "video": false,
      "title": "Any Number Can Win",
      "recommendations": [
         86727,
         68827,
         78193,
         34059,
         59434,
         72563,
         74587,
         59969,
         44256,
         74767,
         34145,
         45939,
         74876,
         57539,
         40569,
         31270,
         4034,
         25251,
         76519,
         47416
      ],
      "backdrop_path": "/AeKU7YdXSRFgUNf7PycSVzZWMcs.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Charles",
               "gender": 0,
               "credit_id": "52fe444ac3a368484e01ab21",
               "name": "Jean Gabin",
               "profile_path": "/8CxpWkEoipIsBF9P2D0ypzzSHhs.jpg",
               "id": 11544,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Francis Verlot",
               "gender": 2,
               "credit_id": "52fe444ac3a368484e01ab25",
               "name": "Alain Delon",
               "profile_path": "/brn5xEZUibCzDMBKeJds6Bxz6rZ.jpg",
               "id": 15135,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Louis",
               "gender": 2,
               "credit_id": "52fe444ac3a368484e01ab29",
               "name": "Maurice Biraud",
               "profile_path": "/oz0OiOloXWUl7Z7G8aLhqmktQ4D.jpg",
               "id": 32100,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "le barman",
               "gender": 2,
               "credit_id": "52fe444ac3a368484e01ab2d",
               "name": "Jean Carmet",
               "profile_path": "/dKtbIjEH9FI8Oa55uI5n8BA5qGK.jpg",
               "id": 24540,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Mario",
               "gender": 2,
               "credit_id": "52fe444ac3a368484e01ab31",
               "name": "Henri Virlojeux",
               "profile_path": "/5NzhYohQytUEdLze6MV2ozxLccT.jpg",
               "id": 39098,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Ginette",
               "gender": 1,
               "credit_id": "52fe444ac3a368484e01ab35",
               "name": "Viviane Romance",
               "profile_path": "/k3WmC0AuUQEDn8xPpmvfAyvk4nO.jpg",
               "id": 39471,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Comtesse Doublianoff",
               "gender": 1,
               "credit_id": "52fe444ac3a368484e01ab39",
               "name": "Dora Doll",
               "profile_path": "/uEosUxO9KXng6ru4l2owh0HuILh.jpg",
               "id": 25166,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Liliane",
               "gender": 1,
               "credit_id": "5785518ac3a3685a89007767",
               "name": "Rita Cadillac",
               "profile_path": "/ljWF1j4NNjrSyzMKxPDydViqQCZ.jpg",
               "id": 574349,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe444ac3a368484e01ab1d",
               "name": "Henri Verneuil",
               "profile_path": "/wwIBLr6pMIwdZYsBvvPAM1OX4zY.jpg",
               "id": 34580,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "54085c6a0e0a26385e00179d",
               "name": "Albert Simonin",
               "profile_path": null,
               "id": 93437,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "54085c7a0e0a26385e0017a2",
               "name": "Michel Audiard",
               "profile_path": "/v1ZikQ0sKjG1SQaK6S4SvEFm4o0.jpg",
               "id": 18565,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 2.789202,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         }
      ],
      "id": 22650,
      "vote_count": 27,
      "budget": 0,
      "overview": "Charles, a sixty-something career criminal, fresh out of jail, rejects his wife's plan for a quiet life of bourgeois respectability. He enlists a former cell mate, Francis, to assist him in pulling off one final score, a carefully planned assault on the vault of a Cannes casino.",
      "similar": [
         299,
         8065,
         298,
         949,
         1844,
         309242,
         500,
         336004,
         11660,
         10856,
         209247,
         11524,
         9029,
         9654,
         9679,
         388,
         891,
         59,
         88,
         5236
      ],
      "original_title": "Mélodie en sous-sol",
      "runtime": 118,
      "poster_path": "/jo54ydN4V60iB10iC4vV3M6GMEP.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Cité Films",
            "id": 14035,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Compagnia Cinematografica Mondiale (CCM)",
            "id": 8423,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Compagnie Internationale de Productions Cinématographiques (CIPRA)",
            "id": 18925,
            "origin_country": ""
         }
      ],
      "release_date": "1963-03-19",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Henri Verneuil"],
      "runtime": 118,
      "synopsis": null,
      "writers": [
         "Michel Audiard",
         "Zekial Marko"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0057344/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE4MDEyMDMwMF5BMl5BanBnXkFtZTcwMzc3NjEyMQ@@._V1_SY317_CR10,0,214,317_AL_.jpg",
      "actors": ["Stars: Jean Gabin, Alain Delon, Claude Cerval | See full cast and crew »"],
      "reviews": [
         "A prototypical heist flick. Old ex-con Jean Gambin is looking for one last score before he retires -- the robbery of a casino on the French Riveria. He enlists Delon, a cocky punk, to help him. Has all of the features: old guy looking for one last score, young active guy who still sort of needs to learn the ropes, complicated heist relying on split second timing, things that go wrong at the last second, unexpected developments, a lot of masquerades, etc. Early on there's some playing around with the notion that Gambin symbolizes a time that is passing, but that isn't really developed, settling down instead to more standard genre fare. Heist is clever and well done, the remake of Ocean's Eleven later stole some of the ideas here. Final shot has that typical Gallic \"throw your hands up in despair\" kind of thing going for it. Cast is good, with Delon in particular a standout in the kind of role he was meant to play in those years.",
         "I don't know why this movie is so little-celebrated -- it's terrific. It's so assured. It brings in the worn and smooth Jean Gabin for his last job (of course), and through some exchanges of witty banter gives us some time to get to know him and his wife before introducing his former cellmate, Alain Delon, as the leather-jacketed toughie. They're both excellent here, especially Gabin, who's polite but still certainly in control. He gives a wryness, like a fat Orson Welles, to his performance. The hot-tempered Delon gives a jolt of vitality to the picture. The entire movie is nice and slow, perfectly glamorous, the best of swinging, jazzy '60s cool. In a conventional movie, when Delon is told to seduce a ballerina so he and Gabin can gain a backstage pass to the theater, the courting would have ended with him buying her a drink. But in this film, it lasts for a good half an hour. And it's never boring. Those nice, long sequences explain everything fully. Not the plot, per se, but elements of the plot -- Delon's seducing of the dancer (which he mucks up more than once); Delon's brother-in-law, who in a normal movie would have been nothing but a side character, here is fully-fleshed out; Gabin's wife. And that long, languorous rhythm is what makes the major, lengthy set piece so memorable -- it's where Delon slinks around, slipping up occasionally, climbing up stairs, crawling through a ventilation shaft, and hiding in an elevator (very \"Mission: Impossible\"), eventually leading to the robbery. And it has one of the best endings to any caper movie that I've seen. 9/10",
         "Charles (a magnificent Jean Gavin) is a mature delinquent recently released from prison . He renounces the plans his wife (Viviane Romance) about a simple and easy life . Charles pretends the perfect robbery recruiting previous cell-mate named Francis (Alain Delon, actor most often used in Verneuil films) . The hold-up is carefully schemed on the vault of Cannes casino in the French Riviera . Meanwhile Francis falls in love with a gorgeous baller dancer (Rita Cadillac). Francis wielding a machine gun and black masked hides himself on the elevator shaft and heads to basement where is the locker room . But the bad luck does the crime gone awry. This heist movie packs thrills , emotion , romance, extraordinary performances and exciting finale burglary . Sensational acting by two big star names , Gabin and Delon . Strong secondary cast with Viviane Romance as the spouse , Jean Carmet as a barman and the Spanish Jose Luis De Villalonga as a Casino chief . Interesting and thrilling screenplay by the prestigious Michael Audiard based on novel by Zekial Marko . Atmospheric cinematography in black and white by Louis Page . Lively musical score with catching leitmotif composed and conducted by Michael Magne . The picture is splendidly directed by Henry Verneuil , a Turkish director working in France from the 40s . Although not a director of great reputation among the critics , his movies have almost all been aimed squarely at the commercial market . Verneuil is an expert on heist-genre such as he proved in ¨The Sicilians clan(68)¨ also with Gabin and Delon , ¨The burglars(1971)¨ with Omar Shariff and Jean Paul Belmondo , furthermore on Warlike genre : ¨Weekend at Dunkirk¨ and ¨The 25th hour¨ and even directed one Western : Guns of San Sebastian(68)¨. He seemed to have dropped out of the film-making after 1976 , but in 1981 unexpectedly reappeared with yet another of his caper film : ¨Thousand millions of dollars¨ . Rating : Exceptional and above average, a must see for French cinema lovers and Gavin and Delon fans.",
         "This film deserves more credit than it gets. All the actors are top notch (Jean Gabin as the ageing theif, Alain Delon as the playboy) and the story is very well crafted and has all the great tough guy dialogue of great caper's like RIFIFI, BOB LE FLAMBEUR etc however the overall tone of the film is a bit lighter and not as serious as those films. the heist itself is pretty short and sweet but this movie is more about the planning and the aftermath. Another great thing about this picture is that even though it's black and white, it's still widescreen adding a nice touch to the look of the film. The only drawback to the DVD is that the picture is quite soft and blurry but for a film of this age and obscurity beggars can't be choosers! Another must see for heist fans (like me!)",
         "An old gangster (Jean Gabin) wants to plan a last robbery before retiring. He asks a young man (Alain Demon) met in jail for a partner. The story may look classical but it's played very fine. The most interesting thing in this movie is the dialogue by Michel Audiard. It's amazing ! As good as ever, so watch this film in french language. It's also the farewell to an old world which disappears little by little because the time of old gangsters is over. It's also funny to hear the characters talk in french postwar slang language.",
         "It's so refreshing to sit back, relax, and enjoy a slow simmering casino robbery caper. No dizzy editing, no mindless car chases, no wiz kid gadgets, no convoluted but inexplicable plots. Just an old hand released after serving 5 years, coming home to his wife and vowing that he will pull off a big one and live happily ever after. Never hurried, things get better and better. The year is 1963 and the venue, the French Riviera, as a matter of fact, Cannes. Better still, it's in black and white. Here we have young Alain Delon's explosive appearance that makes him look like James Dean for a few minutes, before he resumes the persona we know him so well by, cool and stylish. At the ending (and what an ending), we even see him in a little bit of a pensive mood. It is, however, old timer Jean Gabin who gives you every dollar's worth, portraying the old master, sturdy as a rock and clever as a fox, as Spencer Tracy might have played it. Following the caper through from the meticulous storytelling, we become so empathized with the principals that we are finally prepared for the ending. The situation is so devilishly set up that every tingle of tension in the air become palpable. Use of the camera is now swung to high gear, from the shot of Delon appearing at a distance through a circular archway with a bulky bag in each hand, to the frame with Gabin sitting at the near side of the swimming pool and Delon over at the far side, at an angle. You can hear the thundering silence as they exchange non-existent glances. The last twenty minutes in this movie would be the most memorable last twenty minutes in any movie that you have come across.",
         "This is referential to a degree; the young Turk and the seasoned pro was done better in Alain Corneau's Le Choix des armes with Gerard Depardieu taking on Yves Montand and if it comes to that Montand was integral to a better 'caper' movie, Jean-Pierre Melville's Le Cercle Rouge but whilst this one takes its time to get going Henri Verneuil racks up the tension with the heist itself, which is, of course, the centre point and then he tends to let himself down by a slight variant of the end of Kubrick's The Killing. Nothing with Gabin is ever going to be a waste of time and though Delon developed into a fine actor he is a tad too mannered here. There's a good opening sequence in which Gabin, on the train taking him home out of the slammer (though we don't know this yet) listens scornfully to the other commuters comparing dull lives but after this there's something of a hiatus til the caper itself. Worth a look.",
         "Melodie En Sous-Sol (aka Any Number Can Win) is an enjoyable little caper, but the big trouble is that Time has not been very kind to it. It starts out with puzzled and chunky old Jean Gabin wandering through some then fashionable 1960's modern style streets and buildings accompanied by some brash and hip modern jazz music. And then the olde plot starts: man out of jail goes home and almost immediately tells his wife he's planning One Last Big Job involving the stealing of \"about a billion\" francs. This turns out to be a meticulously planned op, of the type Mission Impossible did so much better a few years later, and that (and Topkapi etc) was a team affair - however this was planned by Gabin even though Alain Delon seemed to have the lion's share of the work to do. I bet all those cool swingers of the '60's never would have thought they and their music would date faster than those elegant artistes of the 30's! Favourite bits: Delon's long solo bit bringing the caper to fruition; the predatory Countess Doublianoff calling him no gentleman after he peremptorily dismissed her; the cops strolling by and describing the bags they were looking for - I wanted Delon to mutter something as did Peter Lorre in Arsenic And Old Lace when he thought he was going to be discovered; Gabin's expressionless expression. Even though you may have seen it all before in films made since this one it was shot in a nice black and white with good acting and good production which holds the attention well - and it's all worthwhile anyway when you get to the delicious last 5 minutes when Delon's and Gabin's feelings were definitely too deep for words!",
         "Verneuil made a nice,rather banal career with decent,unambitious \"american movies\" like this one,and also he became almost respected.I grant this was,anyway,somehow better,and surely more entertaining than his previous,French-populist phase.I guess I have seen some 8 of his films (Le Mouton a Cinq Pattes,Des gens sans importance,Un singe en Hiver,Mélodie en sous-sol ,Le Clan Des Siciliens,Le Serpent ,I Comme Icare,Les Morfalous );I grant some of them are rather good;I do not consider them extraordinary. But I think no one does. I've seen I Comme Icare when I was 12 years,in '90.I've liked much Le Serpent . \"Melodie ...\" is well-paced,sympathetic,clean,honest,and,above all, suspenseful.All it has to offer are its two leads,and that's not little. Don't expect Ocean's Eleven ,yet. Gabin has a honorary role in \"Melodie ...\",and not only his,but all the roles are simply epic conventions--no characterization at all."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Cité Films",
         "Compagnia Cinematografica Mondiale (CCM)",
         "Compagnie Internationale de Productions Cinématographiques (CIPRA)"
      ],
      "summaries": [
         "Charles (Jean Gabin), a sixtyish career criminal fresh out of jail, rejects his wife's plan for a quiet life of bourgeois respectability. He enlists a former cellmate, Francis (Alain Delon), to assist him in pulling off one final score, a carefully planned assault on the vault of a Cannes casino. Bad luck and Francis's lack of professionalism set the caper maddeningly askew, and the stolen cash resurfaces in an unexpected manner.",
         "Un vétéran du milieu de la criminalité décide après plusieurs années d'essayer à nouveau le coup qui l'avait amené en prison il y a quelques années : celui de dévaliser la caisse du Casino de Cannes en plein milieu de la saison mondaine, quand l'argent tourne, avec l'aide d'un jeune complice. Les deux programment tout minutieusement, mais les palabres ne manquent pas entre eux et il s'agit de vaincre aussi les imprévus du sort. Tout semble à la fin résolu, mais le sable qui arrête aussi l'engrenage le plus huilé est partout... Y réussiront-ils ?"
      ],
      "budget": 0
   },
   "movielensId": 3369,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1963-03-19",
      "dvdReleaseDate": "2000-02-29",
      "directors": ["Henri Verneuil"],
      "runtime": 118,
      "movieId": 3369,
      "title": "Any Number Can Win",
      "mpaa": "",
      "actors": [
         "Jean Gabin",
         "Alain Delon",
         "Maurice Biraud",
         "Jean Carmet",
         "Henri Virlojeux",
         "Viviane Romance",
         "Dora Doll",
         "Rita Cadillac"
      ],
      "imdbMovieId": "0057344",
      "originalTitle": "Mélodie en sous-sol",
      "genres": [
         "Romance",
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Charles, a sixty-something career criminal, fresh out of jail, rejects his wife's plan for a quiet life of bourgeois respectability. He enlists a former cell mate, Francis, to assist him in pulling off one final score, a carefully planned assault on the vault of a Cannes casino.",
      "tmdbMovieId": 22650,
      "avgRating": 2.84091,
      "releaseYear": "1963",
      "numRatings": 22,
      "posterPath": "/jo54ydN4V60iB10iC4vV3M6GMEP.jpg"
   }
}