{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "moon",
            "id": 305
         },
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "spacecraft",
            "id": 1612
         },
         {
            "name": "cold war",
            "id": 2106
         },
         {
            "name": "space travel",
            "id": 3801
         },
         {
            "name": "cartoon",
            "id": 6513
         },
         {
            "name": "moon landing",
            "id": 7422
         },
         {
            "name": "space",
            "id": 9882
         },
         {
            "name": "outer space",
            "id": 12405
         },
         {
            "name": "scientist",
            "id": 14760
         },
         {
            "name": "rocket ship",
            "id": 34046
         },
         {
            "name": "zero gravity",
            "id": 162630
         }
      ],
      "imdb_id": "tt0042393",
      "video": false,
      "title": "Destination Moon",
      "recommendations": [
         79436,
         30117,
         29058,
         139058,
         43143,
         44538,
         84233,
         73614,
         53617,
         16326,
         84762,
         86737,
         86753,
         84669,
         3575,
         21366,
         48885,
         85673,
         21990,
         83413
      ],
      "backdrop_path": "/pAZDrzXgVjJR5KiEGWMrBiW10eE.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Jim Barnes",
               "gender": 2,
               "credit_id": "52fe44c6c3a368484e0361b7",
               "name": "John Archer",
               "profile_path": "/64WXX5WH4kuaGAa2VckHqx3v1JQ.jpg",
               "id": 78793,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Dr. Charles Cargraves",
               "gender": 2,
               "credit_id": "52fe44c6c3a368484e0361bb",
               "name": "Warner Anderson",
               "profile_path": "/qGIbWqzL2cy9RXMIaWwrGi9re86.jpg",
               "id": 89525,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "General Thayer",
               "gender": 2,
               "credit_id": "52fe44c6c3a368484e0361bf",
               "name": "Tom Powers",
               "profile_path": "/afw9RQWkQuKzYUloR8UXJzfYvIy.jpg",
               "id": 14978,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Joe Sweeney",
               "gender": 0,
               "credit_id": "52fe44c6c3a368484e0361c3",
               "name": "Dick Wesson",
               "profile_path": "/7RSSnpDHoUS4DrFyn8EDa7CU10.jpg",
               "id": 93696,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Emily Cargraves",
               "gender": 0,
               "credit_id": "52fe44c6c3a368484e0361c7",
               "name": "Erin O'Brien-Moore",
               "profile_path": "/cdoXiEVGQojG0kYAViEcxiliOwx.jpg",
               "id": 93698,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Man",
               "gender": 2,
               "credit_id": "549c9000c3a3682f1e004259",
               "name": "Mike Miller",
               "profile_path": null,
               "id": 1404084,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Mr. La Porte",
               "gender": 2,
               "credit_id": "5633705ec3a3681b52014e37",
               "name": "Everett Glass",
               "profile_path": null,
               "id": 179352,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44c6c3a368484e03619b",
               "name": "Irving Pichel",
               "profile_path": "/ayZG4dUhY6XtPmvMKv0ezHqBPkN.jpg",
               "id": 20370,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44c6c3a368484e0361a1",
               "name": "Robert A. Heinlein",
               "profile_path": "/do3wtkyC1RWB2dPol2H2wp4EXuY.jpg",
               "id": 7721,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe44c6c3a368484e0361a7",
               "name": "Alford Van Ronkel",
               "profile_path": null,
               "id": 93685,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44c6c3a368484e0361ad",
               "name": "Robert A. Heinlein",
               "profile_path": "/do3wtkyC1RWB2dPol2H2wp4EXuY.jpg",
               "id": 7721,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44c6c3a368484e0361b3",
               "name": "James O'Hanlon",
               "profile_path": null,
               "id": 93689,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44c6c3a368484e0361cd",
               "name": "George Pal",
               "profile_path": "/sqClVTgeuJZ69eg5YwqTxRPlWMo.jpg",
               "id": 21869,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5633707e9251414ab7012fd3",
               "name": "Leith Stevens",
               "profile_path": null,
               "id": 40460,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5633708bc3a3681b59014bed",
               "name": "Lionel Lindon",
               "profile_path": null,
               "id": 14726,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "563370989251412857014fb2",
               "name": "Duke Goldstone",
               "profile_path": null,
               "id": 29356,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "563370b59251414ab7012fdc",
               "name": "Ernst Fegté",
               "profile_path": null,
               "id": 127200,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "563370c09251416d5200732e",
               "name": "George Sawley",
               "profile_path": null,
               "id": 31970,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "563370d39251416167006fcf",
               "name": "Lee Zavitz",
               "profile_path": null,
               "id": 120165,
               "department": "Crew",
               "job": "Special Effects"
            }
         ]
      },
      "genres": [{
         "name": "Science Fiction",
         "id": 878
      }],
      "popularity": 1.807659,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 25392,
      "vote_count": 20,
      "budget": 0,
      "overview": "Postulates the first manned trip to the moon, happening in the (then) near future, and being funded by a consortium of private backers. Assorted difficulties occur and must be overcome in-flight. Attempted to be realistic, with Robert A. Heinlein providing advice.",
      "similar": [
         157336,
         126889,
         2103,
         2067,
         8077,
         62,
         95,
         348,
         286217,
         10679,
         2900,
         4437,
         568,
         2164,
         9738,
         9016,
         871,
         17431,
         19995,
         49529
      ],
      "original_title": "Destination Moon",
      "runtime": 91,
      "poster_path": "/uLtELccUcFnpttTOcwgJ4TM5M1m.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "George Pal Productions",
         "id": 4864,
         "origin_country": ""
      }],
      "release_date": "1950-06-26",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Irving Pichel"],
      "runtime": 92,
      "synopsis": "DESTINATION MOON (1950) was produced by the legendary George Pal (see his WWW.IMDb.Com bio), and was one of the first great full color 1950's sci-fi outer space thrillers which later included WHEN WORLDS COLLIDE (1951), THE WAR OF THE WORLDS (1953), THIS ISLAND EARTH (1955), and FORBIDDEN PLANET (1956). The movie is intelligent, interesting, dramatic, and highly informative about basic science facts regarding space travel and the difficulties, challenges part of it. By any standard, DESTINATION MOON (1950) is a landmark movie, produced in 1950 which was a high water mark year for world cinema, along with 1939, 1928, and 1956........all years notable for multiple cinema productions of remarkable accomplishment and enduring quality. The story is about a successful first flight to the moon, made by four men who travel in a spacecraft built by a private USA company which must take off unexpectedly early because a \"court order\" has been issued and is about to be delivered to the space travellers STOPPING the trip due to the fact that public opinion is fearful of the consequences of any such effort. The four man team learn of the court order and decide to take off early, before govt. officials can \"serve them\" and stop their departure. They take off...three highly educated and renowned men (one a retired Army general, one a famous scientist with a doctorate, one a respected technology executive, and the fourth....played wonderfully by comedian Dick Wesson playing \"Joe Sweeny of Brooklyn NY USA\".....operates the communications equipment, and portrays a wise-cracking, cowardly \"everyman\" from Brooklyln who doesn't believe the space ship will ever fly, and is astonished and frightened when it does. He provides comedy relief for the entire story, which is quite welcome and wonderful.) The space ship travels to the moon and on the way, a problem develops which requires that crew members go outside of the travelling ship in space suits, and make a repair. One crew member accidentally drifts off into space, but is rescued by another crew member who, creatively, uses an oxygen tank to propel himself to connect with the adrift fellow crew member in danger of being lost in space forever. The rescue scene is all done dramatically and believably, and this is true of additional dramatic moments in the movie. Much of the movie is gripping, and comic moments, well done, are welcome interludes to dramatic crisis parts of DESTINATION MOON (!950). The space ship lands on the moon, and the commander claims the moon for the USA on behalf of all mankind in a statement quite similar to the actual statement the first NASA moon landing astronauts made famous in 1969 (the \"one small step for man, one giant step for mankind\" statement). Suddenly, the four moon explorers learn the space ship they need for return to the Earth is too heavily loaded for departure from the moon, and that they need to unload large quantities of equipment and supplies to lighten the ship and make departure possible. They pitch out large quantities of \"junk\" including used oxygen tanks, radios, and other large metal objects, but in the end, not enough has been removed....110 pounds remain! All four travellers separately volunteer to remain behind, and one (the comic \"Joe Sweeny from Brooklyn\") actually leaves the ship and refuses to return so his remaining three comrades can leave safely. His sacrifice isn't necessary, however, since the ship commander determines that the remaining radio used for contact with the Earth can also be thrown off the ship, and so can the one space suit held back and worn by Joe Sweeny, once he returns to the ship. Sweeny does return to the ship and all four travellers depart successfully from the spacecraft after the radio and space suit are thrown out, and the needed weight removal is accomplished. The ship returns to the Earth with all four travellers safely aboard. The final end credit appears over the outer space scene showing the space ship returning from the moon to the earth after the very first space voyage to the moon by people from Earth. The final credit for DESTINATION MOON (!950) reads \"This is THE END..Of The Beginning.\" DESTINATION MOON (1950) is a landmark science fiction space travel movie, and should be seen by all interested in this genre, and by all interested in high water mark quality cinema movies remarkable for creativity and intelligence.",
      "writers": [
         "Alford Van Ronkel",
         "Robert A. Heinlein"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0042393/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYzMTc5OTU2OF5BMl5BanBnXkFtZTcwNjIwOTgxMQ@@._V1_SY317_CR10,0,214,317_AL_.jpg",
      "actors": ["Stars: John Archer, Warner Anderson, Tom Powers | See full cast and crew »"],
      "reviews": [
         "Most science-fiction films are actually raw fantasy, with a disregard for reality that commonly borders on pure contempt. This isn't always a bad thing, since I really like fantasy. But techno-babble and flashy gadgets are too often only gimmicks favored by dumb producers, ignorant directors, and lazy writers who get themselves into of a jam. \"Destination Moon\" is rare and different. An enormous amount of time and effort were expended to make it as technically accurate as was possible in 1950. Even Kubrick wasn't this consistent in \"2001\"; he often let gravity appear where it shouldn't be. They never made that mistake in \"Destination Moon\". So it's unfortunate they didn't spend as much effort on the story and the acting, but both cast and crew were so wrapped up in creating a real moon trip they skimped on these aspects of story telling. The result was surprisingly impressive visuals for the time, but characters who are shallow, trite, and dull, and crises that arise and are solved while leaving us indifferent. But there is real drama here, the drama of people trying to imagine what was virtually unimaginable back then -- how to actually get people to the Moon and back -- using real physics and engineering. And if it doesn't measure up to the story of \"Apollo 13\", another technically accurate film about a REAL trip to the Moon, it still stands out as unique among 1950s films and remains almost as unique among all science-FICTION movies ever made.",
         "I saw this film when it came out in 1950 along with my cousin - I was carried away with the absolute beauty of the graphics. I was too young to realize the hamming of the script and actors. I must have seen the film 3 or 4 times in 1950. I now have it on DVD - at my 63 years of age it still brings back wonderful feelings as it did in 1950. The scenes of the lunar landscape were incredible (painted by Chesney Bonestell). The actual way of getting there and back would not have been possible - Apollo program showed the way by a lander launched from an orbiter. Destination Moon also was in brilliant Technicolor which was a treat to see in 1950. It also used some real footage of what may have been USA captured German V2 rockets in flight.",
         "I can go for quite a while listing the movie's weaknesses-script, actors, et cetera. But with an idea by Robert Heinlein, Chesley Bonestell handling the astronomical artwork, George Pal as producer and a special bit of animation by Walter Lantz starring Woody Woodpecker done just for the movie, what else matters? Anyone who recognizes all those names and appreciates them understands just what I mean. Since everyone coming here is likely to know Pal and Woody, I won't say any more. For the rest, gather round my children and attend. Rober Heinlein was the dean of Science Fiction writers. He spun off enough ideas as throwaways to do another writer proud for two careers! As for Chesley Bonestell, quite simply, he was the greatest artist ever when it came to astronomic art. Paintings he did look so real, you'd swear that they were photographs and so accurate that you'd swear he'd been there. Not only did he have no equal, he lapped the field two or three times over. If I ever strike it rich, the first extravagance would be a Bonestell. Genius strikes rarely. Greatness with only somewhat more frequency. This film, flawed in many ways, is shadowed by greatness and touched by at least one genius.",
         "The 1950 film Destination Moon, based on the Heinlein book, is incredible for it's accuracy of what was to come 19 years later. To show rocket physics in simple terms a Woody Woodpecker cartoon is used. Unlike some of the sci-fi films of the era (Ed Wood comes to mind), there is very little cheesy about this (unless you believe what they say about the moon). A small group of scientists have decided to get private US companies to finance the building of the rocketship to the moon. I'm sure they had McCarthy breathing down their necks enough to use this line: \"Whoever gets to the moon first will be able to hit anywhere militarily on Earth and rule the world.\" In spite of the meglomaniacal military mentality of this, the rest of the film stays off of this track. It's interesting to compare this with the actual Apollo missions. First they show the weightlessness pretty accurately with decent weightless FXs, and when they walk on the spacecraft and someone drifts away they utilize something the first Galileo spacewalkers didn't even think of; using an oxygen tank as a jet to maneuver (after the first spacewalkers found it too difficult without them the spacewalk jets were later used). They ate bananas and coffee (as opposed to tang and baby food), and they never showed how they used the bathroom (in Apollo it was with great difficulty). And the idea to land the rocket whole on the moon was the original concept of Apollo until the main designer found it was much easier to create a Lunar Module. The FX of Earth from space was pretty accurate even if the colors weren't quite right, and most striking was how the moon looked in this film. Check it against the Apollo footage and you'll know they were accurate. I mean in 1950 they did have telescopes powerful enough to see the lunar surface up close and they utilized this. And most impressive is the science, being accurate with the airlocks, 1/6th gravity, and even the crisis where they must lower the payload. And compare the words of what the 2 astronauts who first step onto the lunar surface tell the world via radio: \"First impression is one of utter barrenness and desolation...most intensely brilliant stars anyone ever dreamed of\". Buzz Aldrin said \"Magnificent desolation.\" And \"I claim possession for the United States for the benefit of all mankind.\" Neil Armstrong planted the American flag and said the mankind bit. Remember this was all theoretical and a decade before anyone had even entered space. The stars I guess is what turns people off here, as they are too bright and looked more like lightbulbs. I guess the technology wasn't good enough back then to use actual star footage, but even on the Star Trek TOS intro they use fake stars. And considering all the B films about space travel since (the one with James Caan in '68, The Stowaway in '74, Capricorn One '79, Mission to Mars '99), this stands out for it's being dead on in many ways, even using 4 astronauts (opposed to 3). I'm wondering if the Apollo planners took some cues from this film. No, it's no 2001: Space Odyssey, but it's great for 1950. And one other point: they even predict the Space Shuttle, as the rocket is designed to \"glide to a landing\". I'm wondering when mankind will once again venture to the Moon, establish a moonbase, then onto Mars and beyond. We have the technology now, so let's do it!",
         "This is one of the few sci-fi movies from the 1950's that doesn't have aliens or monsters in it. It's a straightforward, fairly serious story about some scientists and businessmen who want to get to the moon. The special effects and accuracy of space life are above average. Joe Wesson (Sweeney) is included to give the picture some light-hearted humor. Anne Archer's father, John, is the star of the movie and does a good job portraying the boss of the moon project.",
         "Pal, Bonestell, and Heinlein. If you know those names, you already know this film. If not, set your Wayback Machine for half-a-century ago and step in: you're going to the moon, the way it should have been done. You'll ride a cigar-shaped rocket, making the whole trip on one engine and one stage. You'll wear a bubble-headed spacesuit with corrugated arms. You'll have to lighten your ship to make it home and, oh boy, that's going to be a puzzle! Spaceflight turned out to be much, much more complex than this movie projected, but this is still a serious attempt (some, who must not have seen Lang's \"Woman in the Moon,\" say this is the _first_ serious attempt) at making a movie about a moon landing. If you're like me and are feeling the pangs of disillusionment, go watch this film and relive the illusion that a trip to the moon could be accomplished with a pipewrench, slide-rule, and honest sweat. Ignore the last-minute inclusion of a character for comic relief; that seems to have been required in movies of this era. BTW, when I met the venerable Isaac Asimov in 1972, I asked him what he thought of this film. He lightheartedly scoffed at, \"ice on the moon.\" As you may know, NASA now believes there _is_ ice on the moon. Maybe this half-forgotten movie has something to teach us yet. (No offense, Dr. A; you were the great one.)",
         "I was very surprised with how fresh and well made this film was. I grew up seeing the landings on the moon on TV. While these were exciting, they became too commonplace after a while(except for Apollo 13). The film captures the excitement of the trip and the landing and exploration of the moon very well. The best thing they did was to keep it realistic and avoid them meeting mutant monsters along the way. I especially loved the scene when they claim the moon on behalf of and for mankind. What a great moment full of awe and wonder. Throughout, I kept realizing that my reactions to many of the situations they faced would be exactly the same. The end is very tense and although I knew how it would turn out, I was on the edge of my seat. Not to be missed.",
         "Destination Moon stands out as one of the better sci-fi movies from the fifties, mostly because they approach the idea of travelling to the moon in a very specific and realistic way. Unlike other films such as When Worlds Collide (another George Pal film) which sends the rocket down a giant ramp, Destination Moon relies on many of the same procedures that NASA later used in its actual launches. Of course, it still shares some of the fantasy qualities of others in the sci-fi genre as well as some great special effects (for which it earned an Academy Award). The characters are usual sci-fi fare, and that includes the usual \"comedic element\", in this case Dick Wesson playing a street-wise technician from Brooklyn who talks of \"dames and baseball\". By the way, this character was humorously parodied in the classic spoof Amazon Women On The Moon. So if you enjoy cigar shaped rockets, great fifties special effects, and cool retro images, you should check out Destination Moon.",
         "Sure the plot was very straightforward and it was inevitable that the problems that came up would come up but overall, I really liked the film. When you consider that nobody had even put a satellite in orbit yet and everything they attempt to show of what space is like is based entirely on what they thought they knew, it's amazing how accurate they were. The acting at first seemed bland and I wanted to slap that stupid Brooklyn guy around but as someone stated, the movie needed someone the scientists had to explain everything to. I guess if they wanted the audience to understand any of it they had to do it this way. At that year I highly doubt most people knew what space was like at all. We just take it completely for granted now. Fifty-one years from its release and here I am watching it in DVD format. It amazes me sometimes. I gave it an 8.",
         "I almost did not bother to see this movie that was on AMC yesterday as I expected another 1950's black and white \"B\" movie that would just take up another 90 min. of my time. Boy, was I wrong! This movie was terriffic. Not only was it in color but it was not a silly movie. It was very factual and some scenes were actually very thrilling. It was not an Appollo 13 but for it's time it could have been. Too bad there weren't more movies of this caliber in the fifties. If you havn't see it already, you deserve yourself a treat."
      ],
      "genres": [
         "Adventure",
         "Drama",
         "Sci-Fi"
      ],
      "productionCompanies": ["George Pal Productions"],
      "summaries": [
         "After their their latest rocket fails, Dr. Charles Cargraves and retired General Thayer have to start over again. this time, Gen. Thayer approaches Jim Barnes, the head of his own aviation construction firms to help build a rocket that will take them to the moon. Together they gather the captains of industry and all pledge to support the goals of having the united States be the first to put a man on the moon. They build their rocket and successfully leave the Earth's gravitational pull and make the landing as scheduled. Barnes has miscalculated their fuel consumption however and after stripping the ship bare, they are still 100 lbs too heavy meaning that one of them will have to stay behind.",
         "One of the first science fiction films to attempt a high level of accurate technical detail tells the story of the first trip to the moon."
      ],
      "budget": 0
   },
   "movielensId": 3375,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1950-06-26",
      "dvdReleaseDate": "2000-02-29",
      "directors": ["Irving Pichel"],
      "runtime": 91,
      "movieId": 3375,
      "title": "Destination Moon",
      "mpaa": "",
      "actors": [
         "John Archer",
         "Warner Anderson",
         "Tom Powers",
         "Dick Wesson",
         "Erin O'Brien-Moore",
         "Mike Miller",
         "Everett Glass"
      ],
      "imdbMovieId": "0042393",
      "originalTitle": "Destination Moon",
      "genres": ["Science Fiction"],
      "youtubeTrailerIds": ["Fk0vNz_OkaM"],
      "plotSummary": "Postulates the first manned trip to the moon, happening in the (then) near future, and being funded by a consortium of private backers. Assorted difficulties occur and must be overcome in-flight. Attempted to be realistic, with Robert A. Heinlein providing advice.",
      "tmdbMovieId": 25392,
      "avgRating": 3.22018,
      "releaseYear": "1950",
      "numRatings": 218,
      "posterPath": "/uLtELccUcFnpttTOcwgJ4TM5M1m.jpg"
   }
}