{
   "tmdb": {
      "original_language": "fr",
      "keywords": [],
      "imdb_id": "tt0041705",
      "video": false,
      "title": "The Fantastic Night",
      "recommendations": [44787],
      "backdrop_path": "/xMizT6fJKPYPpB1oM5M8U9YhBIQ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Denis",
               "gender": 2,
               "credit_id": "52fe4767c3a368484e0c513b",
               "name": "Fernand Gravey",
               "profile_path": "/vhqP79ZpBziHd1N0wbAAK1M0h0H.jpg",
               "id": 30774,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Irène",
               "gender": 1,
               "credit_id": "52fe4767c3a368484e0c513f",
               "name": "Micheline Presle",
               "profile_path": "/l3JEGPsntAwicRgZaNelmVoYGmg.jpg",
               "id": 34595,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Thalès",
               "gender": 0,
               "credit_id": "52fe4767c3a368484e0c5143",
               "name": "Saturnin Fabre",
               "profile_path": "/3Q6e3k4KbZ0B1jLmiwdkveME6AG.jpg",
               "id": 94938,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Adalbert",
               "gender": 0,
               "credit_id": "52fe4767c3a368484e0c5147",
               "name": "Charles Granval",
               "profile_path": "/pKQY2zHCWaOQ3kvOfrDDyckvMgG.jpg",
               "id": 94942,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4767c3a368484e0c5137",
               "name": "Marcel L'Herbier",
               "profile_path": "/1pXFYsbAIMW7i8wZfWWQp3XeAiB.jpg",
               "id": 143353,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5abf0d02c3a36844440210bb",
               "name": "Louis Chavance",
               "profile_path": null,
               "id": 102862,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5abf0d1dc3a36844480226b1",
               "name": "Marcel L'Herbier",
               "profile_path": "/1pXFYsbAIMW7i8wZfWWQp3XeAiB.jpg",
               "id": 143353,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 0,
               "credit_id": "5abf0d29925141602a01f969",
               "name": "Louis Chavance",
               "profile_path": null,
               "id": 102862,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 0,
               "credit_id": "5abf0d340e0a264a6002254c",
               "name": "Maurice Henry",
               "profile_path": null,
               "id": 2012030,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 0,
               "credit_id": "5abf0d50925141601b01fc91",
               "name": "René Moulaert",
               "profile_path": null,
               "id": 9736,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "5abf0d60c3a368444802272d",
               "name": "Marcel Magniez",
               "profile_path": null,
               "id": 1300958,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "5abf0d80925141601501e91d",
               "name": "Maurice Thiriet",
               "profile_path": null,
               "id": 43784,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "5abf0d930e0a264a540219f2",
               "name": "Pierre Montazel",
               "profile_path": null,
               "id": 70935,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "5abf0da6c3a368443f01ef7a",
               "name": "Henri Tiquet",
               "profile_path": null,
               "id": 1311099,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "5abf0def0e0a264a5a020775",
               "name": "Émilienne Nelissen",
               "profile_path": null,
               "id": 1318580,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5abf0e2cc3a368444402120e",
               "name": "Suzanne Catelain",
               "profile_path": null,
               "id": 2012032,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [],
      "popularity": 0.298176,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 67455,
      "vote_count": 3,
      "budget": 0,
      "overview": "Denis, a poor student in philosophy, works as a night porter in the Paris market of Les Halles in order to pay for his studies. Constantly weary, he falls asleep and dreams of a beautiful girl in white, Irène, with whom he falls in love.",
      "similar": [],
      "original_title": "La nuit fantastique",
      "runtime": 90,
      "poster_path": "/bL2z18OIGyBOJacM2ZT37Xz52BK.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Héraut Film",
            "id": 25070,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Union Technique Cinematographique",
            "id": 102791,
            "origin_country": ""
         }
      ],
      "release_date": "1942-07-10",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Marcel L'Herbier"],
      "runtime": 103,
      "synopsis": null,
      "writers": [
         "Louis Chavance",
         "Maurice Henry"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0041705/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkyMzg3OTI1MF5BMl5BanBnXkFtZTcwOTA5NzMyMQ@@._V1_SY317_CR10,0,214,317_AL_.jpg",
      "actors": ["Stars: Fernand Gravey, Micheline Presle, Saturnin Fabre | See full cast and crew »"],
      "reviews": [
         "La Nuit Fantastique, as directed by Marcel l'Herbier... Those who have watched the director's silent classics l'Argent or l'Inhumaine may have their expectations upset by this movie. Stylistically it is poles apart. It is all fun, chic and froth, nothing much serious going on. The plot is very simple, Denis a French arts student tends to fall asleep during his nighttime work at the flower market. He has dreams of a beautiful woman in white, and falls in love with her. One night whilst asleep he follows her on a series of fantastic adventures, beset by charming villains on all sides. As mentioned elsewhere it is ludicrous to believe that Fernand Gravey is young enough to be a student. On the whole though I thought his performance made him a lot more youthful, full of ephebe sensitivity and brass, boyish insolence and naivety. As in all art, but here particularly, disbelief must willingly be suspended, and there will be ample reward. Christiane Nère is brilliant as Gravey's waking girlfriend/shrew who competes with the dream lady. Saturnin Fabre as Professor Thales hams it up brilliantly with the most superb facial expressions you'll ever see. You'll notice that no place names or dates are given, this adds to the intensity of atmosphere. I think it could be quite easy to mistake this movie for an auteur's potboiler. However quite a lot of care obviously went into making this truly escapist fantasy, the characters get to play dress up, make love on roofs, thwart dream plots, thumb there noses at suitors, sleep in flower markets etc. And in my opinion the craft and the acting are seamless. Quite a lot of shadows in this film, probably due to lack of budget, but makes for true magic realism. Tale a holiday from yourself, a purely ecstatic roller-coaster of dream logic awaits, see if you can get your hands on the OOP DVD, mine cost a pretty penny. N.B. This movie deserves to win the award for worst opening credits ever, truly shocking, don't let them put you off.",
         "In 1942 it was all too easy to interpret any movie set in the distant past (Les Visiteurs du soir) or in a dreamscape as here as a metaphor for avoiding the present and/or commenting obliquely on the Occupation but be that as it may both the Carne-Prevert 'Visiteurs' and this entry from Marcel L'Herbier more than stand up well when viewed today. True, Fernand Gravey was never much of an actor and, as has been noted, was too old to pass for a student - 'mature' students were more or less unknown at the time - but provided you didn't ask him to 'act' anything more demanding than bemusement he could get by. It's also a joy to see Micheline Presle in her prime - she continues to act to this day including small roles in films written and directed by her talented daughter, Tonie Marshall - and understand just why she was so prominent among French actresses. Marcel L'Herbier was, of course, himself a veteran who deserves to be much better remembered than he is and here he turns in a charming melange of comedy, drama and fantasy predicated on student Gravey being so worn out from holding down two jobs AND trying to study that he is prone to fall asleep anywhere and dream of a mysterious - but beautiful, natch - lady in white which amateur psychologists would say was trying to tell him something about his real-life unfaithful girlfriend. In a masterstroke L'Herbier allows Gravey to 'enter' his dream - paving the way for Cocteau to put spin on the technique in Orphee - and set up a story within a story with more twists than a bag of pretzels. Bernard Blier - who would also father a future director, Bertrand - is also on hand to add a little class and Saturnin Fabre chews the scenery to everyone's satisfaction. Overall a fine movie and one I'll be adding to my 'wants' list to France and Norway.",
         "The main problem is the choice of the lead:he is supposed to be a philosophy student and Fernand Gravey was 38 when he made this movie.It is impossible to believe he is a young romantic lead (Jean-Pierre Aumont or Louis Jourdan would have been better in such a part). All that remains is original,inventive,and it is probably Marcel Lherbier's best talkie.After his brilliant silent works,his career had its highs (this movie,\"le Mystere de la Chambre Jaune\",\"le Bonheur\",\"l'Affaire du Collier de la Reine\") and its lows (dreadful melodramas such as \"l'Enfant de l'Amour\",les Hommes Nouveaux\",\"la Porte du Large\" or stodgy propaganda films such as \"Entente Cordiale\"). Ten years before René Clair's \"les Belles de Nuit\" ,Lherbier tells a tale of a dreamer :a student who is forced to work in \"les Halles\" and dreams his life away.It was the Occupation time in France and escapist works were par excellence the prevailing genre(along with \"moral'\" melodramas such as \"le Voile Bleu\" ): 1942 also brought Marcel Carné's \"les Visiteurs du Soir\" and the following year Delannoy-Cocteau's \"l'Eternel Retour\" .You could even call Gremillon's work \"le Ciel est à Vous\" an escapist film:a woman who had a dream to fly. \"La Nuit Fantastique\" is a movie of its time.Certain of its aspects are dated ,but its best moments are still impressive today.The student meets a woman in his dreams :she will be nothing like he pictured her to be and he can never see her face;in real life,his lover cheats on him with one of his so-called pals. One night,he \"enters \" his dream .The gap between dream and reality is brilliantly rendered:using time warp,masterfully working on the pictures (fuzziness) and on the soundtrack (sometimes the words become incomprehensible),Lherbier builds a sensational dreamlike atmosphere.And by introducing magic and conjurers,he gives his movie a fourth dimension.Melodrama is also present (Who is really Irene?)but it is kept to the minimum.Perhaps the final is a bit disappointing but it might have inspired Jean Cocteau for the last picture of his celebrated \"la Belle et la Bête\".Anyway \"la Nuit Fantastique\" is sometimes close to a fairy tale too ,with a smart use of Tom Thumb;and the scene on the roof recalls Andersen's \"the shepherdess and the sweep\" which Grimault/Prevert transferred to the screen as \"le Roi et l'Oiseau\" One should also note that Lherbier's movie was made five years before \"the secret life of Walter Mitty\" a movie which borrows some ideas from it (making the hero out to be a lunatic ;here,the heroine) \"You can be brave when you know you are dreaming\" the hero says.",
         "The feeble beginning made me fear a very bad movie. The main character is dull and the rest of the cast just can't make you forget the studio they are playing in. Then the Fantasy Night begins and this journey through the night is well paced with funny situations all taking place in bizarre surroundings. There's never a grand scene but on the whole it's entertaining. Theme overlapping Maybe the wooden thing in it is the start point with this White Lady the hero uses to dream of. It aims to be poetic whereas the following is mostly a comic adventure. The most interesting focus should have been on this shy guy's behavior as a hero for he thinks he's dreaming. Unfortunately it's not the main theme in La Nuit Fantastique. Last point: the work on sound is somewhat interesting too for a movie made more than 60 years ago."
      ],
      "genres": [
         "Comedy",
         "Fantasy",
         "Romance"
      ],
      "productionCompanies": ["Union Technique Cinematographique S.A. (UTC)"],
      "summaries": ["Denis is distracted: he's studying all day for philosophy exams and working all night at the flower market; plus, whenever he closes his eyes, he dreams of a mysterious woman in white. His girlfriend Nina is annoyed at him for his inattention, so she steps out behind his back with a friend of his. One night, while napping at the flower mart, he pursues the mystery woman in what he thinks is a dream, and finds himself with her in a restaurant with her father and her fiancé, then on to a magic shop, the Louvre, a nightclub, and a mental asylum. During the night, he discovers a plot against her, and still believing it's a dream, goes to great lengths to try to save her."],
      "budget": 0
   },
   "movielensId": 3376,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1942-07-10",
      "dvdReleaseDate": "2000-02-29",
      "directors": ["Marcel L'Herbier"],
      "runtime": 103,
      "movieId": 3376,
      "title": "The Fantastic Night",
      "mpaa": null,
      "actors": [
         "Fernand Gravey",
         "Micheline Presle",
         "Saturnin Fabre",
         "Charles Granval"
      ],
      "imdbMovieId": "0041705",
      "originalTitle": "La nuit fantastique",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "Denis, a poor student in philosophy, works as a night porter in the Paris market of Les Halles in order to pay for his studies. Constantly weary, he falls asleep and dreams of a beautiful girl in white, Irène, with whom he falls in love.",
      "tmdbMovieId": 67455,
      "avgRating": 2.75,
      "releaseYear": "1942",
      "numRatings": 8,
      "posterPath": "/bL2z18OIGyBOJacM2ZT37Xz52BK.jpg"
   }
}