{
   "tmdb": {
      "original_language": "de",
      "keywords": [
         {
            "name": "hitler youth",
            "id": 4446
         },
         {
            "name": "nazi germany",
            "id": 11064
         },
         {
            "name": "fable",
            "id": 161757
         }
      ],
      "imdb_id": "tt0118043",
      "video": false,
      "title": "The Ogre",
      "recommendations": [
         67455,
         36457,
         105716,
         108574,
         57702,
         203089,
         196488,
         63214,
         104089,
         76268,
         115502,
         162453,
         79363,
         69765,
         37584
      ],
      "backdrop_path": "/wvj8rrn0pfLLaUlaOAejftzcrbc.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1003,
               "character": "Abel Tiffauges",
               "gender": 2,
               "credit_id": "52fe475ac3a36847f8130e7f",
               "name": "John Malkovich",
               "profile_path": "/tCtiWZbKKRgHhLxFCIPfveYAsdc.jpg",
               "id": 6949,
               "order": 0
            },
            {
               "cast_id": 1004,
               "character": "Rachel",
               "gender": 1,
               "credit_id": "52fe475ac3a36847f8130e83",
               "name": "Agnès Soral",
               "profile_path": "/4Go0JWZLjDvOGyCn1d8jcUUzaS3.jpg",
               "id": 34637,
               "order": 1
            },
            {
               "cast_id": 1005,
               "character": "Fieldmarshall Hermann Goering",
               "gender": 0,
               "credit_id": "52fe475ac3a36847f8130e87",
               "name": "Volker Spengler",
               "profile_path": "/f8BT3P1izymqkdBBEdxhBR4yBch.jpg",
               "id": 32422,
               "order": 2
            },
            {
               "cast_id": 1006,
               "character": "Chief Forrester",
               "gender": 2,
               "credit_id": "52fe475ac3a36847f8130e8b",
               "name": "Gottfried John",
               "profile_path": "/hOVrTlQwZX4THosi9usXISC7mNS.jpg",
               "id": 3757,
               "order": 3
            },
            {
               "cast_id": 1008,
               "character": "Graf von Kaltenborn",
               "gender": 2,
               "credit_id": "53696bf2c3a3681231006b6f",
               "name": "Armin Mueller-Stahl",
               "profile_path": "/cKdfUl7EuUpBncwvJo2t3hYJPNi.jpg",
               "id": 12647,
               "order": 4
            },
            {
               "cast_id": 1009,
               "character": "Frau Netta",
               "gender": 0,
               "credit_id": "53696c0ac3a3681218006822",
               "name": "Marianne Sägebrecht",
               "profile_path": "/3MKvIqhwKZLFpcO0KHYh6dLiDQB.jpg",
               "id": 32645,
               "order": 5
            },
            {
               "cast_id": 1010,
               "character": "Napola-Kommandant Raufeisen",
               "gender": 2,
               "credit_id": "53696c1bc3a3681238006733",
               "name": "Heino Ferch",
               "profile_path": "/g8NRSFfRxGXutPCmgfjf4ouTpDn.jpg",
               "id": 1086,
               "order": 6
            },
            {
               "cast_id": 1011,
               "character": "Professor Blättchen",
               "gender": 2,
               "credit_id": "53696c2ac3a368121800682f",
               "name": "Dieter Laser",
               "profile_path": "/hMqAjX6e3FCrBTFodXOm3jxnh2H.jpg",
               "id": 23721,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe475ac3a36847f8130e91",
               "name": "Volker Schlöndorff",
               "profile_path": "/5os3QPgtEJANkN9tNyBYcR86gHD.jpg",
               "id": 10249,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "55a65a3bc3a3682bbf0012e7",
               "name": "Gebhard Henke",
               "profile_path": null,
               "id": 36175,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "55a65a81c3a3682bb4001119",
               "name": "Bruno de Keyzer",
               "profile_path": null,
               "id": 50521,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "55a65aaac3a3682bbd0012b1",
               "name": "Nicolas Gaster",
               "profile_path": null,
               "id": 75079,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "55a65abc925141099b00115f",
               "name": "Peter Przygodda",
               "profile_path": null,
               "id": 2309,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "55a65ad1c3a3682bbf0012f2",
               "name": "Karin Beewen",
               "profile_path": null,
               "id": 1487525,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "55a65aec92514109960011b8",
               "name": "Ezio Frigerio",
               "profile_path": null,
               "id": 34855,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "55a65b04925141099b001165",
               "name": "Susanne Hein",
               "profile_path": null,
               "id": 1487526,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "55a65b18c3a3682bb4001120",
               "name": "Heinz Röske",
               "profile_path": null,
               "id": 22972,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "55a65b2f92514109960011c3",
               "name": "Anna B. Sheppard",
               "profile_path": "/q4XKRDuAeHtBsuYDq8gLgr75bCN.jpg",
               "id": 6688,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 1,
               "credit_id": "57729f59c3a36846dd00005e",
               "name": "Ingrid Windisch",
               "profile_path": null,
               "id": 103137,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "57729ed09251415cbc00002e",
               "name": "Michel Tournier",
               "profile_path": null,
               "id": 232680,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "57729f139251415cae00003e",
               "name": "Jean-Claude Carrière",
               "profile_path": "/nlJZcRlzQKo17GuZ2vSMRdag4iV.jpg",
               "id": 9747,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "57729f219251415cae000044",
               "name": "Volker Schlöndorff",
               "profile_path": "/5os3QPgtEJANkN9tNyBYcR86gHD.jpg",
               "id": 10249,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "57729f32c3a36846b5000059",
               "name": "Michael Nyman",
               "profile_path": "/yAjkiel4NWG4zu9o53GusvsdTEn.jpg",
               "id": 10759,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 2.068816,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         }
      ],
      "id": 48213,
      "vote_count": 17,
      "budget": 0,
      "overview": "Frenchman Abel Tiffauges likes children, and wants to protect them against the grown-ups. Falsely suspected as child molester, he's recruited as a soldier in the 2nd World War, but very soon he is taken prisoner of war.",
      "similar": [
         613,
         228150,
         821,
         1771,
         16869,
         5925,
         2253,
         637,
         14574,
         423,
         424,
         203833,
         3482,
         289222,
         11372,
         10105,
         369885,
         13752,
         152760,
         914
      ],
      "original_title": "Der Unhold",
      "runtime": 118,
      "poster_path": "/mtWDd5BDgH4rTA50AACcR5R8KDy.jpg",
      "spoken_languages": [
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Westdeutscher Rundfunk (WDR)",
            "id": 7025,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Canal+",
            "id": 5358,
            "origin_country": "FR"
         },
         {
            "logo_path": null,
            "name": "France 2 Cinéma",
            "id": 45970,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Héritage Films",
            "id": 58245,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Recorded Picture Company (RPC)",
            "id": 11561,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Renn Productions",
            "id": 82,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Studio Babelsberg",
            "id": 264,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Universum Film (UFA)",
            "id": 12372,
            "origin_country": ""
         }
      ],
      "release_date": "1996-01-01",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Volker Schlöndorff"],
      "runtime": 118,
      "synopsis": null,
      "writers": [
         "Michel Tournier",
         "Jean-Claude Carrière"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118043/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc4MTYyMzIzNl5BMl5BanBnXkFtZTcwNzg2OTQxMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: John Malkovich, Armin Mueller-Stahl, Gottfried John | See full cast and crew »"],
      "reviews": [
         "(Note: Over 500 of my movie reviews are now available in my book \"Cut to the Chaise Lounge or I Can't Believe I Swallowed the Remote!\" Get it at Amazon.) This strange and original work is a French film about Nazi Germany done in English. There are no subtitles. Director Volker Schlondorff is German, the screenplay is by veteran French writer Jean-Claude-Carriere, who has scores of films to his credit including Bell de Jour (1967) and Valmont (1989), and the star is the American, John Malkovich, who plays a French simpleton named Abel Tiffauges who ends up as a servant in Field Marshall Herman Goering's hunting estate during World War II, and then later in a Hitler youth academy for boys. Malkovich's Abel is enormously sympathetic because he has suffered but harbors no bitterness, because he genuinely loves children, and because he has a certain magic about him based on his childish belief that somehow he will survive any catastrophe. In a boy's home as a child he survives the brutality of a proto Goering-like fat boy, and then later as an auto mechanic he overcomes a false accusation of child molestation. Both of these little stories are vividly rendered and seem entirely realistic. Then begins Abel's war time adventures, and it is here that the story becomes, as some have observed, something of a fairy tale. Abel is able to leave his barracks at the prison to wander about where he meets a blind moose and then a German army officer at a deserted cabin in the woods. This leads to his being established at Goering's hunting estate, and from there to the Hitler youth academy where he is treated as a privileged servant. We see the Nazis as just another part of the bizarre personages of his world. The depiction of Goering as a kind of self-indulgent Nero, living in opulence as the world burns, seemed entirely believable. The overall portrait of the Germans in an objective and balanced manner was refreshing and thought-provoking and one of the strengths of the film. The Nazi eugenicist is contrasted with the officer who was part of a failed plot against Hitler, both men enormously sincere and dedicated, the one unbalanced, the other unlucky. This is not a film for those looking primarily to be entertained. This is a work of art, dark, uneven, and a bit curious.",
         "This 1996 film, which was not released in the U.S. until 2000 in the rental market, offers a fresh German perspective of World War II. It puts a more human face on the people of the Third Reich, much in the same way as \u0091Das Boot'. We are used to depictions of German soldiers as brutally evil, soulless killing machines (and there is a bit of that here) but this film mostly presents a softer more balanced portrayal. This is the story of Abel, an affable simpleton from France with a love of children and animals (no, there are no undertones of pedophilia). Prior to WWII, he is wrongly accused and convicted of child molestation. While working in the work camps, he is captured by the Germans and through a series of events ends up as a prisoner of war worker in a training school for Hitler youth. He is emotionally seduced by the romantic notions of Hitler's national socialism and the great devotion to the fatherland that is being taught there. And of course, he loves working with the boys. The Germans notice this and how much the boys like him as well, so they ask him to recruit more boys for the school from the local countryside. Things go along well until the Russians invade and the only defense of the school must be made by the students (who are well trained in the art of war). This is a terrific story that gives us a more realistic look inside Germany during the war. No, it wasn't an idyllic free society. But it wasn't exactly a factory for mechanized inhuman killers as it has been routinely portrayed either. We come to understand that what we considered evil was being presented to the children in terms that seemed good and noble. They felt as if they were on an idealistic quest, not on a diabolical mission of subjugation. The direction of this film was expertly done. Volker Schlondorff's presentation of the story, though slow moving at times, offered an excellent character study of Abel and was patient in proffering revealing looks at the people and the feelings of those around him. Malkovich is fantastic as the naïve and slow witted Abel. He is wonderfully childlike and sincere in his portrayal; reminiscent of his role in \u0091Of Mice and Men'. This is the best I can remember him in quite some time. This is a poignant and compelling film of substance. I rate it a 9/10. The sophisticated viewer will enjoy it.",
         "Abel is not simply slow-witted, he is morally shortchanged and has little if any ability to recognize even the reality much less the depth of his willing collaboration with the Germans. Abel is a survivor and while his concern for the children being trained as proto-Nazis in an ancient castle is real, so is his ruthlessness in collecting them by force for his German superiors with the aid of snarling Dobermans. The film abounds in caricatures beginning with an outdoor picnic by complacent, indeed moronic, French officers who fail to even remotely perceive the danger of the onrushing Wehrmacht. Reichsmarshall Goring is portrayed as a grinning fool except when he approaches the state of barking madness. This is a legitimate dramatic device but the real Goring, cured before World War II of doctor-induced morphine addiction, was more complex and, in that sense, more interesting (decades ago I took a psychology course with Dr. Gilbert, who examined Goring at Nuremberg and wrote a book about the experience which is still available in second-hand bookshops. HIS Goring was chilling, no one to laugh at.). The film is most effective when it eerily recreates what must have been the almost erotic attraction of nighttime rallies with flags, bunting, torches and the steady beat of martial music. That little boys were inculcated with the madness of Nazism through these rituals is powerfully shown here. It was hard for me to care about Abel one way or the other but the character is well-acted as are the other main roles.",
         "Known in English as \"The Ogre\" this has got to be John Malkovich's finest film to date. He plays an ignorant man, Abel, living in a small town at the dawn of the Nazi movement. He seems to be mentally slow, but emotionally heightened as has a great passion for the vitality of the children in the town. He is fond of photographing, especially children. However, due to a mis-understanding, because the people of the small town are so ignorant and afraid of the quiet lumbering Abel, he is sentenced to jail (undeservedly) for the crime of molesting a child. He is transferred to help with the war effort in France, and eventually comes to work for the Nazi party, \"recruiting\" children for the cause. He, however, does not seem to know what the Nazis stand for, or why he shouldn't be taking in children. He cares for the children as if they were his own, and is eventually persecuted for harbouring a young Jewish boy, which is when he begins to realise the ramifications of his plight. A brilliantly scripted film (filmed in English despite the foreign origin). A must see. It saddens me, though that it is so difficult to find, and that it was never released in the US (as far as I know). -jjj",
         "One published reviewer said that Goring's character was written, and played, for comic effect. This complaint sounded plausible, but a glance in Encyclopedia Britannica reassures our confidence in the production's respect for authenticity. It suggests that Volker Spengler's characterization may be on the mark. During Hitler's Putsch in 1923, Goring sustained a painful injury whose relief by means of morphine turned him into a drug addict nearly the rest of his life. This influence, in turn, made him \"alternately elated or depressed; he was egocentric and bombastic, delighting in flamboyant clothes and uniforms, decorations, and exhibitionist jewelry.\" We see all these traits in Spengler's scenes, e.g. in his drunken alternation between a tirade and a blue funk at the fact that someone else had shot a stag that he wanted to shoot. When a soldier enters to bring him some really bad news, Goring is already so gloomy that he barely raises his hand from the table to salute, and his \"Heil Hitler\" is just a slurred grunt. The article also establishes his corpulence and luxuriousness, to a point resented by his colleagues in the party. \"His hunting interests enabled him to obtain a vast forest estate in the Schorfheide, north of Berlin, where from 1933 he developed a great baronial establishment\" called Carinhall, full of artistic war booty, to which he retired whenever he could. The film showed Goring as an often jovial man given, like Hitler, to occasional fits of imperious screaming. This behavior, according to one book I read recently, was to be expected of any top leader of the Third Reich not merely as a habit but as a deliberate technique. People outside of Germany were slow to take Hitler seriously as a threat because this conduct was so strange to them. They did not realize that German culture of the time regarded it as a standard part of the fatherly role. Therefore, as Hitler understood well, the more he screamed and shouted at his countrymen, the more closely they would identify him as a father figure and the embodiment of Der Vaterland. Many superstitious beliefs have been associated with precious stones. The novel explains that Goring was not unique in imagining that plunging his fingers into a bowl of gems would drain away nervous energy and uncomfortable emotions. Other sources recount that when Hugo von Hofmannsthal's first poems appeared, under a pseudonym, they were so heavy with sensuous Weltschmerz that one critic declared they must have been written by an opulent old man while dipping his fingers in jewels. (He would soon be surprised that the poet was still a youth). So even this strange indulgence of Goring is in keeping with the ambient culture among those few who could afford the experience. One could say much, much more about this complex film, but perhaps this elucidation of just one minor aspect suggests the multilayered care with which it has been put together.",
         "First, John Malkovich's performance is incredible. He is one of the greatest actors today, and maybe in all cinematic history, and proves it in this movie. How is that someone can honestly believe that they are doing good when in fact all they are doing is harm? This is the theme of this movie. John Malkovich gives a commanding and chilling performance as a man who is frightening and engages in harmful behavior but has no insight as to the abominable nature of his conduct. The Malkovich character is utterly depraved yet his depravity is not driven by animus which makes it even harder to figure out. He wraps himself up in some kind of fantasy world but he is not psychotic, is essentially mild mannered and deferential to authority and does not seem intent on hurting anyone. Yet, everywhere he does people get hurt because of him. He believes that he is doing good when he is doing bad. This what the Nazi war criminals apparently believed. They believed that they had a mission to accomplish and had no problem rationalizing and denying the destructiveness of their program. In fact, they vigorously defended their actions as being in the best interest of humanity. The Malkovich character thinks in much the same way and not surprising is equally warped.",
         "Volker Schlondorff's intermittently powerful \"Ogre\" stars John Malkovich as Abel Tiffauges, a seemingly mentally handicapped Frenchman who finds himself gallivanting across Europe during the Second World War. Like his character in \"Of Mice and Men\", Malkovich plays Abel as a dim witted, obedient giant. Abel's only joy comes from tending to, protecting and helping children, a love that many in the film mistake for paedophilia. Pretty soon Abel finds himself working for the Nazis, firstly at Hermann Goering's hunting lodge, and later at Kaltenborn Castle, an elite training camp for Hitler Youths. At both locations, Abel's fawning attitude toward children epitomises Nazi delirium. Nazism, like Abel's whole being, is a pathology bent upon preserving and protecting a certain \"chosen people\". It's an ethnic pathology which mirrors Abel's own drive to \"photograph\" and \"preserve\" a very specific, idealised view of youth and beauty. What the film stresses is how both stances operate in a cloistered, secluded realm in which the distinctions between the internal and the external world no longer hold, both Abel and Nazism creating fantasy, fairy-tale narratives for themselves and their believers. In this regard, everything Abel does, though benevolent and altruistic in his mind, leads to great violence. And so Abel, like the film's Nazis, is mild mannered, has little insight into his nature, lives in a fantasy world, always defers to authority, does not believe he is hurting anyone, and yet causes great harm. This \"Nazi pathology\" (the desire to \"not see\", a form of disavowal that is hard-wired into the very structure of modern life) is still very much a part of our modern, or post-modern, world. The film ends with Abel rescuing a Jewish child. For Abel, love is by definition always never-ending and always excessive; he loves all children. This brings him in conflict with Nazi ideology, which, of course, demands that he kill the boy. This contradiction leads to Abel betraying his masters during the film's climax, and subsequently wading off into the sunset with the Jewish boy on his shoulders. Hauntingly, the duo think that they're protecting each other with magical powers. They are now each other's \"chosen one\", a stance which itself now foreshadows contemporary politics (protecting the Jew to protect oneself, protecting Israel to protect America). Aesthetically, like Schlondorff's earlier film, \"The Tin Drum\", \"The Ogre\" takes the shape and tone of a dark, grisly fairy tale. Some passages recall both Goethe and the Brothers Grimm (and a hunting sequence Renoir's \"The Rules of the Game\"), though Schlondorff tones down his customary surrealism (and removes all sexual subplots present in the original tale), his eyes now on the more direct tastes of mass market, global (ie Western) audiences. 8/10 \u0096 Ranges from great to watered down and very poor, but Malkovich sucks us in. See Pasolini's \"Salo\".",
         "John Malkovich is doing a fine role here, as expected, and the movie depicts Europe around 1940 from the viewpoint of an emotionally challenged French orphan. You might have thought from the plot that it is about pedophiles or something similar. It is not. This guy moves from \"prison\" to prison, while happily doing the work assigned to him, all the time seeing the world as no one sees it. All his good deeds result in punishments and all his bad deeds make almost no impression on him. He perseveres in both. The movie is spanning a few years of time and the rhythm is slow, as one would expect from a film made from a book, and, while a little boring and depressing, it is a nice movie. Bottom line: imagine Forrest Gump in Europe. No humour, no hope, no cares in the world. Oh, except the war. ;)",
         "Through the eyes of a French man who never grew up, The Ogre depicts wartime life in Hitler's Germany. At the same time that the film takes up loaded questions of power and subjugation, recreating the process of recruitment and training for the Aryan army, it further challenges the viewer by presenting the growing Nazi regime in a very human way. A great deal of the variety in characterization and the breadth of reach can be attributed to the fairy-tale nature of this film. By introducing the character Abel as a troubled and weak youth, the film is able to trace his life's events under the spell of `Fate.' And indeed, Abel is sheltered and provided for throughout the course of events, even when faced with the most irrational of men. In film, characters are arguably always proponents of a few key traits, around which a believable person is constructed. In a fairy-tale, this is true to a greater extent. So of course, a combination of the two leads to a meeting of quite extreme characters. In The Ogre we are presented with a man who cares so much for children and animals that he is unable to see any evil in their presence. This oversight, or, in the heavy-handed symbolism of the film, blindness, is the basic motivation behind all events. A great deal of the film is artfully done, with many subtle displacements to stimulate emotions in the viewer. Although the oft-mentioned 'front line' is never seen, instead we are faced with the massacre of hundreds of wild animals. The childhood friend of Abel returns to him in the form of the military official in the forest, and yet, Abel does not make a connection beyond a vague similarity. He is oblivious to the extravagant decadence of dipping one's hands in jewels, or keeping a wild cat for pleasure. In his simpleton's way he meanders through a landscape of potential knowledge, yet learns nothing. It is the viewer who is given the chance to learn what he can't. Unfortunately, this schema reminded me a bit too much of Forrest Gump. However, the film speaks a great deal to the fairy-tale effects of idealism and propaganda on young children, as finally Abel is cut off by the very boys he loved, their allegiance to a greater unseen force much stronger than their understanding of fellow man.",
         "Interesting film! Such a wealth of crucial questions, great performances - and yet, the final cohesion remains lacking here. The paradox of the enchantment of Nazism has been too little problematized in the cinema, and any attempt to say anything new on the subject is welcome. Schlöndorff does a cinematically good work, but where the film falters is in the way actual, brutal history and Abel's vision of Nazism as the Magic Kingdom are bound together. It's hard to pinpoint where the fault lies; there's just a sense of maybe trying too much at once. Anyway, an honorable and perhaps too multi-layered analysis of the 20th century nightmare."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Canal+",
         "France 2 Cinéma",
         "Héritage Films"
      ],
      "summaries": ["Frenchman Abel Tiffauges likes children, and wants to protect them against the grown-ups. Falsely suspected as child molester, he's recruited as a soldier in the 2nd World War, but very soon he is taken prisoner of war. After shortly serving in Goerings hunting lodge, he becomes the dogsbody in Kaltenborn Castle, an elite training camp for German boys. Completely happy to take care of these children, he becomes a servant of Nazism, catching boys from the area as supplies for the camp."],
      "budget": 0
   },
   "movielensId": 3378,
   "movielens": {
      "languages": [
         "Deutsch",
         "Français",
         "English"
      ],
      "releaseDate": "1996-01-01",
      "dvdReleaseDate": "2000-02-29",
      "directors": ["Volker Schlöndorff"],
      "runtime": 118,
      "movieId": 3378,
      "title": "The Ogre",
      "mpaa": "",
      "actors": [
         "John Malkovich",
         "Agnès Soral",
         "Volker Spengler",
         "Gottfried John",
         "Armin Mueller-Stahl",
         "Marianne Sägebrecht",
         "Heino Ferch",
         "Dieter Laser"
      ],
      "imdbMovieId": "0118043",
      "originalTitle": "Der Unhold",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Frenchman Abel Tiffauges likes children, and wants to protect them against the grown-ups. Falsely suspected as child molester, he's recruited as a soldier in the 2nd World War, but very soon he is taken prisoner of war.",
      "tmdbMovieId": 48213,
      "avgRating": 3.30645,
      "releaseYear": "1996",
      "numRatings": 62,
      "posterPath": "/mtWDd5BDgH4rTA50AACcR5R8KDy.jpg"
   }
}