{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "submarine",
            "id": 339
         },
         {
            "name": "nuclear war",
            "id": 677
         },
         {
            "name": "dystopia",
            "id": 4565
         },
         {
            "name": "australia",
            "id": 5657
         }
      ],
      "imdb_id": "tt0053137",
      "video": false,
      "title": "On the Beach",
      "recommendations": [
         3596,
         15497,
         27725,
         14703,
         74476,
         11016,
         52772,
         43838,
         23518,
         298664,
         43002,
         3547,
         23330,
         31944,
         32969,
         17382,
         25430,
         127878,
         14554,
         20362
      ],
      "backdrop_path": "/s3eV6XjaTKiiOVKUMGo4bvedNil.jpg",
      "revenue": 0,
      "reviews": [
         {
            "author": "John Chard",
            "id": "55f512b59251413a960041be",
            "content": "Like watching paint dry.\r\n\r\nStanley Kramer and John Paxton adapt from Nevil Shute's novel. Gregory Peck, Ava Gardner, Fred Astaire, Anthony Perkins and Donna Anderson star, with music by Ernest Gold and cinematography by Giuseppe Rotunno.\r\n\r\nAfter a global nuclear war, the inhabitants of Australia realise that the radiation clouds are heading their way. A group of people try to come to terms with this fact.\r\n\r\nA well regarded film by the critics, and lauded by the makers at the time as an important and potent piece of cinema, On the Beach is still a film that's not for everyone.\r\n\r\nThe star appeal holds weight, though much of the narrative is tired and weary, trite and cheesy. In fact Shute himself was less than happy with what Kramer made of his literary source, the director in his element with a message movie.\r\n\r\nIf it was Kramer's intent to make the viewers also feel like what it's like waiting for death? Then he achieved it, while Gold's overuse of Waltzing Matilda in his musical score also ends up boring the senses. 4/10",
            "url": "https://www.themoviedb.org/review/55f512b59251413a960041be"
         },
         {
            "author": "Frank",
            "id": "593bff62c3a3680f6700e87b",
            "content": "Well acted story with an obvious anti-war theme, written during the cold war provided an interesting portrayal of how different people may react facing  impending doom. Fearful, Angry, Fatalistic.\r\nIt developed feelings for the characters as they dealt with the situation each in their own way. \r\nOverall, at the end, there was a sadness that prevailed and led one to contemplate the possibility of this occurring. That is the success of the film and the book that inspired it, to create an atmosphere against nuclear war. I saw this film in the 1960's and enjoyed it immensely and read the book because of it. Watching it again as an adult I understood it with a \r\ndifferent point of view and enjoyed it more.\r\nfor what it is worth, I would recommend this film highly, not only for the great story, but also to enjoy the performance of truly talented professionals.",
            "url": "https://www.themoviedb.org/review/593bff62c3a3680f6700e87b"
         }
      ],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Dwight Towers",
               "gender": 2,
               "credit_id": "52fe45a59251416c910396e5",
               "name": "Gregory Peck",
               "profile_path": "/ycs6o0UoohQ7nV7A6VWaTkoIkCQ.jpg",
               "id": 8487,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Moira Davidson",
               "gender": 1,
               "credit_id": "52fe45a59251416c910396e9",
               "name": "Ava Gardner",
               "profile_path": "/qrMGSjgI4tpJ3c7ZEjsIMMFDGuR.jpg",
               "id": 25787,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Julian Osborn",
               "gender": 2,
               "credit_id": "52fe45a59251416c910396ed",
               "name": "Fred Astaire",
               "profile_path": "/tFdgseH9plbGN8XBhBcG9lscfaY.jpg",
               "id": 30181,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Lt. Peter Holmes",
               "gender": 2,
               "credit_id": "52fe45a59251416c910396f7",
               "name": "Anthony Perkins",
               "profile_path": "/8M8Bt20z0M587lrjkdXrEqYtQKU.jpg",
               "id": 7301,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Mary Holmes",
               "gender": 0,
               "credit_id": "52fe45a59251416c91039701",
               "name": "Donna Anderson",
               "profile_path": "/mLGobFwc8avOfhB4KNQooYfxXEP.jpg",
               "id": 19878,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Adm. Bridie",
               "gender": 2,
               "credit_id": "5435be440e0a264d790006f6",
               "name": "John Tate",
               "profile_path": "/s3kTMptxs1fndbl0nmLb4my2wVk.jpg",
               "id": 1004930,
               "order": 5
            },
            {
               "cast_id": 25,
               "character": "Lt. Cmdr. Farrel",
               "gender": 2,
               "credit_id": "575a9fc4c3a3686ad80017db",
               "name": "Guy Doleman",
               "profile_path": "/iHIzzV6Bdk8RRB1VCROVRpFJRqZ.jpg",
               "id": 9923,
               "order": 6
            },
            {
               "cast_id": 26,
               "character": "Ralph Swain",
               "gender": 2,
               "credit_id": "575a9feec3a368068e000785",
               "name": "John Meillon",
               "profile_path": "/dKsqaE8GZ2YjdFREpe17QVVnsGJ.jpg",
               "id": 42841,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45a59251416c910396f3",
               "name": "Stanley Kramer",
               "profile_path": "/5kE8vJSdtX9OJvWngNWZ5imrhdv.jpg",
               "id": 4081,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45a59251416c910396fd",
               "name": "John Paxton",
               "profile_path": null,
               "id": 132577,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "575a9d91c3a3683ada000f6c",
               "name": "Nevil Shute",
               "profile_path": null,
               "id": 114640,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "575a9daac3a3683ada000f71",
               "name": "Stanley Kramer",
               "profile_path": "/5kE8vJSdtX9OJvWngNWZ5imrhdv.jpg",
               "id": 4081,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "575a9dc39251411545001847",
               "name": "Ernest Gold",
               "profile_path": null,
               "id": 12142,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "575a9ddfc3a3680ba800162a",
               "name": "Giuseppe Rotunno",
               "profile_path": null,
               "id": 15131,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "575a9df3c3a368068e00074b",
               "name": "Frederic Knudtson",
               "profile_path": null,
               "id": 12143,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "575a9e03c3a3686bcf000b28",
               "name": "Fernando Carrere",
               "profile_path": null,
               "id": 13782,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "575a9e3fc3a36805d8001416",
               "name": "Rudolph Sternad",
               "profile_path": null,
               "id": 4085,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "575a9ec6c3a3680ba800164d",
               "name": "Sam Freedle",
               "profile_path": null,
               "id": 1360888,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "575a9ef2925141519c000eea",
               "name": "Ross Wood",
               "profile_path": null,
               "id": 1477531,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "575a9f06c3a3680ba800165a",
               "name": "Allen Grice",
               "profile_path": null,
               "id": 1633318,
               "department": "Lighting",
               "job": "Gaffer"
            },
            {
               "gender": 0,
               "credit_id": "575a9f249251411545001878",
               "name": "Lee Zavitz",
               "profile_path": null,
               "id": 120165,
               "department": "Crew",
               "job": "Special Effects"
            },
            {
               "gender": 0,
               "credit_id": "575a9f3cc3a3684188000f94",
               "name": "Hans Wetzel",
               "profile_path": null,
               "id": 1633319,
               "department": "Sound",
               "job": "Sound Engineer"
            },
            {
               "gender": 0,
               "credit_id": "575a9f4f925141154500187f",
               "name": "Art Cole",
               "profile_path": null,
               "id": 1633320,
               "department": "Crew",
               "job": "Property Master"
            },
            {
               "gender": 0,
               "credit_id": "575a9f5f92514128fa0014cb",
               "name": "Jane Shugrue",
               "profile_path": null,
               "id": 1592851,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 2,
               "credit_id": "575a9f6f92514176db000a7c",
               "name": "Frank Prehoda",
               "profile_path": null,
               "id": 1537731,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "575a9f839251411545001886",
               "name": "John O'Gorman",
               "profile_path": null,
               "id": 89539,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            }
         ]
      },
      "genres": [
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 6.719693,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 35412,
      "vote_count": 79,
      "budget": 0,
      "overview": "In 1964, atomic war wipes out humanity in the northern hemisphere; one American submarine finds temporary safe haven in Australia, where life-as-usual covers growing despair. In denial about the loss of his wife and children in the holocaust, American Captain Towers meets careworn but gorgeous Moira Davidson, who begins to fall for him. The sub returns after reconnaissance a month (or less) before the end; will Towers and Moira find comfort with each other?",
      "similar": [
         9659,
         76341,
         8810,
         9381,
         198663,
         157350,
         9355,
         281,
         604,
         605,
         335984,
         9482,
         7512,
         9739,
         12244,
         2048,
         9693,
         17431,
         87101,
         110415
      ],
      "original_title": "On the Beach",
      "runtime": 134,
      "poster_path": "/o2DzOxwUTwA3k1d8ruC8rrn2tjy.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Stanley Kramer Productions",
         "id": 893,
         "origin_country": ""
      }],
      "release_date": "1959-12-16",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "The Biggest Story of Our Time!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Stanley Kramer"],
      "runtime": 134,
      "synopsis": "The year is 1964. The nuclear war that was waged in the northern hemisphere has ended. An American nuclear submarine, The Sawfish, at sea in the mid-Pacific makes its way down the coast of Australia where there appear to be survivors. Docking at the port of Melbourne, the crew, commanded by Lt. Commander Dwight Towers (Gregory Peck) live out their lives waiting for the radioactive winds from the North to slowly make their way towards them, ending all life as we know it. The Australian Government and scientific community, hopeful that life might go on in the Southern Hemisphere or in Antarctica, ask Towers and his crew to take the sub north again to check on radiation levels and a mysterious Morse code signal emanating from near San Diego, CA. Towers is assigned an Australian Ensign (Anthony Perkins) who will act as liaison officer for the mission. Feeling sorry for Towers and the loss he has experienced up North, Perkins and his wife Mary (Donna Anderson), throw a party. They bring in a friend Moira Davidson (Ava Gardner) to distract Towers so he won't become morbid and depressed. Towers slowly begins to fall in love with Moira. However, he still has the mission to think of and is still very much devoted to his wife and kids, who resided in Connecticut. He has difficulty reconciling their loss and at one point confuses Moira for his late wife, Sharon. Moira offers to become \"Sharon\" if it will help him deal with it and also serve the purpose of assuaging her loneliness and fear of the future, impending doom awaiting. Towers refuses. He leaves on the mission north without telling Moira. She finds out from her cousin Julian Osborne (Fred Astaire in his first dramatic role,) who will be serving as a scientist checking on the radiation levels during the mission. The Sawfish first arrives at Point Barrow in the Artic Sea, only to find that the radiation levels have not subsided. Next they visit an untouched but ghostly quiet, San Francisco. One of the crew, yeoman Swain, whose hometown is San Francisco, escapes the sub through an escape hatch and swims ashore. The Sub sits on the bottom of San Francisco bay and then the next morning surfaces to find Swain fishing from a small boat. Swain tells Captain Towers he is sorry that he deserted but he would \"rather be here [sic. San Francisco] to have it\" then in Australia later on. Towers understands. The Sawfish heads south to the San Diego area and puts a Radio Officer, Lt. Sunderstrom ashore in a full radiological suit with oxygen tank. Sunderstrom discovers that the mysterious morse code signal is coming from a silent radio room at a refinery, where the window pane had broken and a window shade pull cord had wrapped around a partially empty Coca-cola bottle and a morse code key thus generating the gibberish Morse code signals. Sunderstrom signals the sub as to what he has found and then shuts down the main generators at the refinery. Resigned to their fate, the Sawfish returns and Towers meets up with Moira at her father's farm. They spend time together and go to the last Australian Grand Prix, where Osborne is racing. Osborne wins which has been his dream and Towers and Moira head off to go fishing, as the fishing season has opened early. The fishing grounds are crowded with people and they spend a stormy evening together having dinner in their room in an inn. In the background one can the hear the very audible singing of drunken locals singing the tune \"Waltzing Matilda\" in the barroom below. Returning from the fishing trip, Towers learns that one of his crew, Seaman Ackerman, has developed radiation poisoning. The radioactive-laden winds have finally arrived and he now must consider what he is going to do about his crew and about Moira. With little time left, Towers says goodbye to Osborne and speaks to his crew. They have already taken a vote and they tell him that they would like \"to head for home.\" He realizes his responsibility and duty is to his crew. He phones Moira who has been helping Peter deal with Mary who can't accept the reality of their present situation. Upon learning that Towers is leaving, she speeds off in her car to the Naval Base. Mary comes around and realizes that she and Peter must face their end and that their infant daughter \"Jennifer\" will never have the chance to experience the love and happiness that she has had. She tells Peter that she has had a good life with him and that she will \"have that cup of tea now.\" The tea is laced with a coma-inducing sedative, provided free to the residents of Melbourne by the government to help them deal painlessly and quickly with the end. Moira finds Towers at the dock and embraces him. He tells her he loves her but has to go with his crew. She realizes that their relationship is now over but is thankful for what they had. She speeds her car along the coast so that she can catch sight of Towers as he takes the Sawfish down for one last time. Standing on a cliff she gazes off into the distance as the submarine submerges. The final scenes are of an empty and desolate Melbourne with a banner from a religious gathering at the city's center. The banner prophetically reads \"There is still time...brother.\" The final shot is a closeup of the banner. The movie ends.",
      "writers": [
         "John Paxton",
         "Nevil Shute"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0053137/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMyNTIzMDEyMV5BMl5BanBnXkFtZTcwODQwOTc2NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Gregory Peck, Ava Gardner, Fred Astaire | See full cast and crew »"],
      "reviews": [
         "I watched this movie in a USAF chow hall on the island of Makung in the China Strait with about 20 other airman. The year was 1960. We were stationed there on a missile site. Our targets were 7 Chinese missile sites. Their target was us. I was 22 years old and immortal. Until I watched this movie. When the movie ended, I will never forget the fact that no one moved for perhaps 10 minutes. There was just the bright, blank screen and the sound of the end of the film going around and around. Thiketa-thicketa-thicketa................... No one ever said a word about what we had just seen. We, or at least I, never forgot this movie. As said earlier, it was more than scary. It was sad. It seems strange now, 40 some years later, to be telling people that you really should watch this film and watch the masters at work, with a script that is chilling. And you know what? We still haven't outlived the possibility...........",
         "\"On The Beach\", despite it's heavy subject of a nuclear holocaust wiping out all human life, succeeds because Stanley Kramer is mercifully more restrained and less pretentious than he would later be in \"Inherit The Wind\" and \"Judgment At Nuremberg\", which are memorable more for their polemics than their characters, in my opinion. Except for one minor speech by Fred Astaire at one point (which as the previous reviewer noted is somewhat ironic in light of the fact that the very thing Astaire rails against, the idea that large nuclear stockpiles could keep the peace, turned out to be absolutely true) the film is for the most part about people and how they react to the knowledge that their world and their lives will soon come to an end. This is what makes the film so compelling as far as I'm concerned. The cast is excellent, with fine performances by Astaire (his first non-musical part), Anthony Perkins and Gregory Peck. But the real strength of the movie is Ava Gardner's touching performance as the lonely, alcoholic Moira Davidson who manages for one brief moment before the end to find true love with Peck. Having read much about her life, there is something almost hauntingly autobiographic in Gardner's portrayal, and that only adds to the movie's overall poignance.",
         "The Cold War aspects of this movie may be a bit dated, but for those of us of a certain age it is a reminder of the fears we lived under at that time. In retrospect, it may be that Julian was wrong: it may have indeed been the very presence of these terrible weapons that prevented a third world war. In any case, that aspect of the story never overshadows the movie's underlying theme, which is, rather, how each of us views the sum of our lives as our mortal end approaches. Are we alone? Have we connected with anyone? Have we failed? Have we loved? Have we been loved? Color would have been all wrong for this essentially b&w story. Superb performances from Gregory Peck, Ava Gardner, Fred Astaire and the pre-Norman Bates Anthony Perkins. A fine bit as well by John Tate as the old admiral(\"to a blind, blind world\"). A mere cold-war nuclear destruction movie would leave one merely frightened at the end. The fact that this movie leaves you with an almost unbearable feeling of terrible sadness is a testament to the human power of Nevil Shute's book, as well as to the fine script and Kramer's superb direction. One of the most depressing movies ever made, but a truly great one.",
         "And the essence of our lives is expressed in the way we treat each other under the implacable threat of imminent mortality. As Ava Gardner's character says, at the penultimate moment of love's farewell, \"It's been nice, Dwight Lionel. It's been everything.\" And what she says on her beach is true for every last one of us, on ours. The primary power of this great movie to me is how well it conveys the idea that for us, on this beach, love and tender kindness are all that matter in the end, and the end is always near. The sheer kindness that Ava and Gregory's characters express for each other is surely the key element of their triumphant relationship. The moment in which their relationship most completely triumphs, of course, occurs at the Narbethong Hotel. \"On The Beach\" achieves a cinematic moment of genius when the chorus singing \"Waltzing Matilda\" changes from a rowdy crowd of drunks to a magnificently harmonious group of fine male voices. As the sheer beauty of the music overwhelms us, it also overwhelms our characters, and we all unite together in a sublime moment of awareness that true love and kindness give us our only victory over imminent death. \"You'll never take me alive,\" says the ghost. The way Gregory Peck's character shifts from fumbling with the fire to turning toward Ava as the music inspires transcendence, and the way Ava smiles at him, make this scene unforgettably great. Nearly as wonderful is the scene in which Ava's character learns that the Sawfish will be leaving, with her captain at the helm. She will have to face her death alone. She doesn't waste a moment in argument or recrimination, but expresses the fullness of her love for him and her great courage when she accepts his decision and thanks him: \"..it's been everything.\" And then: \"oh, I'm so frightened.\" This moment is one that I take to heart. It shows the love and courage I wish to have \"when the time comes.\" There is still time, brothers and sisters. But we are all on the beach.",
         "In an era (1959) and on a topic (nuclear war) that usually demands melodrama, \"On the Beach\" resists. In fact, the all-star principal cast and director Stanley Kramer seem to treat the topic as a stage play, focussing on the individual. And that is how such a story should be treated. Life on the northern hemisphere has been destroyed a defence mistake by one of the (then) two superpowers. Gregory Peck's nuclear-powered submarine was submerged at the time (they stayed under water for a hell of a long time in those days). The sub heads for Melbourne, Australia, which is one of the only places in the world not yet affected by radiation. But the radiation will come, and this is where the truth of the piece comes out. The inhabitants of 'the end of the world' go through what you would expect: denial, anger, clinging to the thinnest hope, and finally, resignation. As I said at the start, this is clearly a story about the individual. Kramer knows this, and the cast of Ava Gardner, Tony Perkins, John Meillon and Fred Astaire play it with a reality that is all too rare. Even recent films like Final Impact fail to deliver on this count. The real joy of the film is the pacing, which gives the cast the chance to play it like it should be played. Astaire proves he is an actor, and only once slips into his raised eyebrow 'top hat and tails' mode. It is a well thought out movie without the Hollywood ending, but such is the art of Kramer that the ending is a good resolution, not just a funeral. The camera work is exceptional throughout, starting with the continuous shots in Peck's submarine. I don't know about the Waltzing Matilda music at the start, however. But it does work later in the piece, and makes it worthy of the Academy Award nomination it received.",
         "On The Beach was made in 1959 and it's still a fantastic movie some 46 years later. As great as all the performances are, the photography and the script are as out-standing. The only drawback to this black & white classic is the hauntingly depressing nature of the film. Death is never easy to explore and it's done here tastefully, gritty, and realistically. Gregory Peck shines in this controversial role. Ava Gardner gives her finest performance. Fred Astaire is incredible in this serious role. However, the film was stolen by the pre-Psycho Anthoney Perkins and newcomer Donna Anderson as a doomed young couple with a new baby. The ending of On The Beach is one of the most depressing in screen history, still this is a must see for any fan of any of the actors or the legendary Stanly Kramer.",
         "One of the most potent movies I've ever seen. Chilling! Although appearance of movie is dated...it should be...filmed in 1956. The characters, situation, emotion are timeless. The date of the movie in no way weakens the strength of the story. Only slight weakness is the relationship between Peck and Gardner. Too much time spend on these two at times distracts from story. Still it does set up a moving ending in which devotion to duty, comrades, (in a situation where such devotion is meaningless) deepens our awareness of humanity. Not for the weak of heart. No happy endings here!! All the more powerful for its non hollywood approach, we need more of these movies. Instead of finishing the moving feeling good, we finish THINKING GOOD. Much more important goal of a movie if you ask me.",
         "I made the mistake of watching this film at 11 pm, in a theater with only 4 other people. We were scattered about...and alone. I have seldom wanted to be in a group as much as I did that night. I almost got up and went to sit in a row with one of the 4. Directing? Brilliant. Cinematography? Brilliant. The cast? Exceptional. Ava Gardner (still beautiful), Gregory Peck, Fred Astair and Anthony Perkins are inspired. I have always wanted to go to Australia. Many years later I got the chance. As the coast of Sydney came into view I started to cry...and didn't know why? Then I realized, I was 'hearing' Waltzing Matilda and remembering.",
         "The French title is \"le dernier rivage\"(the last shore)The intellectuals dismiss this movie in France and I've always thought they were wrong.Ava Gardner had never been better with the eventual exception of Huston's \"night of the iguana\".My favorite part is the central one:one of the soldiers tries to find the cause for the strange Morse signals.He crosses bleak dead San Francisco harbor (the camera takes prodigious high angle shots of him,making us share his loneliness and his hope against hope)Hope that was to be short-lived!What a symbol,this equivalent of a bottle thrown into the sea!So few special effects,ans so much emotion.Stanley Kramer's peak.",
         "Is \"under-wrought\" a word? If so, this movie defines it. A great cast never seems like its acting in an all-too-realistic portrayal of the fifth Kubler-Ross phase of humanity. Past denial and anger, there is finally grim acceptance, replete with just the perfect sprinkling of gallows humour. The ultimate philosophical question is raised by author Nevil Chute,\"What is truly important in life, if in the end, we're all dead?\""
      ],
      "genres": [
         "Drama",
         "Sci-Fi"
      ],
      "productionCompanies": ["Stanley Kramer Productions"],
      "summaries": [
         "In 1964, atomic war wipes out humanity in the northern hemisphere; one American submarine finds temporary safe haven in Australia, where life-as-usual covers growing despair. In denial about the loss of his wife and children in the holocaust, American Captain Towers meets careworn but gorgeous Moira Davidson, who begins to fall for him. The sub returns after reconnaissance a month (or less) before the end; will Towers and Moira find comfort with each other?",
         "In the aftermath of an atomic war, much of humanity has been destroyed. Only Australia remains, but time is short as the winds will inevitably spread nuclear fallout and everyone knows they have only a few months to live. Among those coming to terms with the inevitable is a U.S. navy officer, Cmdr. Dwight Towers, whose submarine and crew were at sea when the holocaust occurred; Moira Davidson, a free-spirit who develops a close attachment to Towers; Julian Osborne, whose dream is to win the Australian Grand Prix automobile race; and Lt. Cmdr. Peter Holmes, who is as concerned about his wife and newborn child's future as his own. All cope with the inevitability of death in their own way, but also with love, dignity and affection.",
         "In 1964, the nuclear submarine USS Sawfish arrives in Australia after the worldwide nuclear holocaust. Commander Dwight Lionel Towers confirms that the world has been destroyed and the nuclear dust is coming to Australia. The widower Cmdr. Towers, who grieves the death of his wife and children, is befriended by Royal Australian Navy Lieutenant Peter Holmes, who is a family man with wife and the newborn baby Jennifer. He has a lover affair with the local Moira Davidson, a still beautiful alcoholic woman with a past, and she falls in love with him. Cmdr. Towers and his crew invite the drunkard scientist Julian Osborne to join them in their reconnaissance voyage to the further North and to the United States, and they return hopeless and aware that Australia and the rest of the mankind has very few days until the doomsday.",
         "A US submarine is on patrol when the Northern Hemisphere is destroyed by atomic war. They land in Melbourne, Australia where they live with the rest of the city which has less than 12 months to live. They travel back to the west cost of the US and witness the holocaust.",
         "Someone, somewhere, pressed the button and started World War III. Australia has survived - temporarily. The radiation is on it's way, the end inevitable. This is the story of the way in which people faced the coming end, focusing mainly on a young Australian couple and their friends, including the captain of an American submarine that was on patrol in the Pacific when the bombs were falling. And then the Australians detect a morse signal coming from somewhere around San Diego...",
         "After a global nuclear war, the residents of Australia must come to terms with the fact that all life will be destroyed in a matter of months."
      ],
      "budget": 2900000
   },
   "movielensId": 3379,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1959-12-16",
      "dvdReleaseDate": "2000-02-29",
      "directors": ["Stanley Kramer"],
      "runtime": 134,
      "movieId": 3379,
      "title": "On the Beach",
      "mpaa": "",
      "actors": [
         "Gregory Peck",
         "Ava Gardner",
         "Fred Astaire",
         "Anthony Perkins",
         "Donna Anderson",
         "John Tate",
         "Guy Doleman",
         "John Meillon"
      ],
      "imdbMovieId": "0053137",
      "originalTitle": "On the Beach",
      "genres": [
         "Science Fiction",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["Awm50kJQeeI"],
      "plotSummary": "In 1964, atomic war wipes out humanity in the northern hemisphere; one American submarine finds temporary safe haven in Australia, where life-as-usual covers growing despair. In denial about the loss of his wife and children in the holocaust, American Captain Towers meets careworn but gorgeous Moira Davidson, who begins to fall for him. The sub returns after reconnaissance a month (or less) before the end; will Towers and Moira find comfort with each other?",
      "tmdbMovieId": 35412,
      "avgRating": 3.75325,
      "releaseYear": "1959",
      "numRatings": 616,
      "posterPath": "/o2DzOxwUTwA3k1d8ruC8rrn2tjy.jpg"
   }
}