{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "artificial intelligence",
            "id": 310
         },
         {
            "name": "android",
            "id": 803
         },
         {
            "name": "hologram",
            "id": 3249
         },
         {
            "name": "computer program",
            "id": 4286
         },
         {
            "name": "virtual reality",
            "id": 4563
         },
         {
            "name": "ex-cop",
            "id": 8440
         },
         {
            "name": "visual effect",
            "id": 9819
         },
         {
            "name": "police training",
            "id": 177258
         }
      ],
      "imdb_id": "tt0114857",
      "video": false,
      "title": "Virtuosity",
      "recommendations": [
         4954,
         178,
         2320,
         9411,
         9278,
         7007,
         8870,
         10685,
         9886,
         9425,
         12123,
         10861,
         10163,
         11285,
         10329,
         12088,
         9292,
         11074,
         11517,
         9306
      ],
      "backdrop_path": "/rkpdTSEYq3A5kL0xb8r2Aqr0pt5.jpg",
      "revenue": 24048000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "Lt. Parker Barnes",
               "gender": 2,
               "credit_id": "52fe44dfc3a36847f80af185",
               "name": "Denzel Washington",
               "profile_path": "/semwsON3dN3np6cyzlCw7F2YDGe.jpg",
               "id": 5292,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "SID 6.7",
               "gender": 2,
               "credit_id": "52fe44dfc3a36847f80af189",
               "name": "Russell Crowe",
               "profile_path": "/ktuOAyUHM2u2YPPChH8gAArxJ7b.jpg",
               "id": 934,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Madison Carter",
               "gender": 1,
               "credit_id": "52fe44dfc3a36847f80af18d",
               "name": "Kelly Lynch",
               "profile_path": "/2ZbV0mppAxxyh4mIG4HKTHfLkDM.jpg",
               "id": 6473,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "William Cochran",
               "gender": 2,
               "credit_id": "52fe44dfc3a36847f80af191",
               "name": "William Forsythe",
               "profile_path": "/3oaz2y7hIm3r3OyDKvQ1i2D8cLR.jpg",
               "id": 4520,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Dr. Darrel Lindenmeyer",
               "gender": 2,
               "credit_id": "52fe44dfc3a36847f80af195",
               "name": "Stephen Spinella",
               "profile_path": "/oZLaKkLYW61XPR0nTu0H1tbFWbL.jpg",
               "id": 57093,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Elizabeth Deane",
               "gender": 1,
               "credit_id": "52fe44dfc3a36847f80af199",
               "name": "Louise Fletcher",
               "profile_path": "/A4Cn7LsuLlOXvOMKv5ez4ThyeZL.jpg",
               "id": 7071,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Woman with Video Camera",
               "gender": 1,
               "credit_id": "52fe44dfc3a36847f80af19d",
               "name": "Una Damon",
               "profile_path": "/d3dcUIwjXY0mH6QplM98L8fswzA.jpg",
               "id": 154644,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Rafael Debaca",
               "gender": 2,
               "credit_id": "56d632a8c3a3681e36017e1b",
               "name": "Miguel Nájera",
               "profile_path": "/inkolHpGkf9uVZkjdzhOLfttbvT.jpg",
               "id": 203762,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Christine Barnes",
               "gender": 1,
               "credit_id": "56d632ddc3a36870ac004c21",
               "name": "Miracle Vincent",
               "profile_path": "/y4hk3qe9tzD9nNslEo3LBw2VQb7.jpg",
               "id": 1585201,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Media Zone Singer",
               "gender": 1,
               "credit_id": "57dc09269251416934009ced",
               "name": "Traci Lords",
               "profile_path": "/40n1G3p2sGxnsU0m8tfIlthMatA.jpg",
               "id": 10826,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Karin Carter",
               "gender": 1,
               "credit_id": "580362eac3a3681659000b3c",
               "name": "Kaley Cuoco",
               "profile_path": "/rlt7XJ0dWik2oReZlxOPLI1L7Vt.jpg",
               "id": 53862,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe44dfc3a36847f80af157",
               "name": "Brett Leonard",
               "profile_path": "/24eM4jVMEY790YFNf3t7VhgX19z.jpg",
               "id": 57090,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dfc3a36847f80af15d",
               "name": "Eric Bernt",
               "profile_path": null,
               "id": 21348,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dfc3a36847f80af163",
               "name": "Hawk Koch",
               "profile_path": null,
               "id": 13017,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dfc3a36847f80af169",
               "name": "Gary Lucchesi",
               "profile_path": "/zQRUANlcJXa1TFVoCYK1vjIMmEh.jpg",
               "id": 3953,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dfc3a36847f80af16f",
               "name": "Christopher Young",
               "profile_path": "/2laVovSXDVpHRS6HSpKyCspSmze.jpg",
               "id": 19155,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dfc3a36847f80af175",
               "name": "Gale Tattersall",
               "profile_path": "/9KA5irPbb2fygOJ4i23oZW4YiHR.jpg",
               "id": 42119,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe44dfc3a36847f80af17b",
               "name": "Rob Kobrin",
               "profile_path": null,
               "id": 57091,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe44dfc3a36847f80af181",
               "name": "B.J. Sears",
               "profile_path": null,
               "id": 57092,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "59fc33dec3a3681aa5029489",
               "name": "Traci Lords",
               "profile_path": "/40n1G3p2sGxnsU0m8tfIlthMatA.jpg",
               "id": 10826,
               "department": "Sound",
               "job": "Songs"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 8.899203,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9271,
      "vote_count": 198,
      "budget": 30000000,
      "overview": "The Law Enforcement Technology Advancement Centre (LETAC) has developed SID version 6.7: a Sadistic, Intelligent, and Dangerous virtual reality entity which is synthesized from the personalities of more than 150 serial killers, and only one man can stop him.",
      "similar": [
         605,
         603,
         281,
         604,
         9323,
         307663,
         1090,
         644,
         861,
         78,
         20526,
         198184,
         335984,
         157353,
         2277,
         62,
         10428,
         10366,
         484886,
         12140
      ],
      "original_title": "Virtuosity",
      "runtime": 106,
      "poster_path": "/7vdg9lA1un8TrNLlLKsaQtVqs4a.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1995-08-04",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "Justice needs a new program.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Brett Leonard"],
      "runtime": 106,
      "synopsis": null,
      "writers": ["Eric Bernt"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0114857/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIyNDkwNTc4MF5BMl5BanBnXkFtZTcwNTU2MDMyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Denzel Washington, Russell Crowe, Kelly Lynch | See full cast and crew »"],
      "reviews": [
         "This was really something else. It was very bad, but damn, I got such a kick out of it. Russell played his role to the hilt. My favorite scene was when the investigator people were talking and they said, \"Sid is evolving.\" Another one of them asked, \"Into what?\". Cut to Sid doing a cocky sort of walk down the street while decked out in a pair of shades and while \"Staying Alive\" by the BeeGees is playing. It has to be seen to be believed. I started laughing hysterically right then and there. I swear that Russ must have known what pure camp quality this was. I bet he had a great time filming it. I must commend everyone, especially Mr.Crowe, for being able to keep a straight face while putting this on. I only have one real complaint about this movie. You'd think that considering Sid had all these serial killers in his head, he'd be a little more perverse. I mean, most deranged killers have a sadistic sexual side. I would have really liked to have seen that. But I guess it would have become too serious if they added that.",
         "You can't help but like Crowe's gleeful portrayal of a schizophrenic nano-bot serial killer in this ridiculous film, and with futuristic fascists, pervey programmers and a bucket loads of virtual reality cyber nonsense, this should really be a winner in the style of The Demolition Man or the Robocop series. But where other films in the genre have used such tools as wit and plot to keep the more intelligent of the viewers amused, this film, um, hasn't. The script is terrible. The acting (excluding Crowe, who only gets away with it thanks to a camp smile and some fortunate direction) is wooden. And the plot is illogical and frustrating.",
         "Virtuosity is by no means a great movie or a good movie. It is barely above average. That though is because of Russell Crowe's character: SID 6.7 who possesses over 150 serial killer personalities. He is just supposed to be used to train police but he escapes from his virtual reality to the reality. That sounds pretty interesting and this premise could be taken into many different directions especially since he is such a complex character you could go so many different way going about to make this film. Though this movie did not take the worst direction it did not take the best one. This movie went for pure action and no real drama or meaningful message. Now that is OK but it lacked in doing this because of the: The directing which was average by Brett Leonard. He made this into a very exciting TV movie which it is not. He had two very talented actors in Denzel Washington and Russell Crowe yet he was not able to generate the excitement and fast pace feeling that is needed to make a good action movie. The writing is also at fault too. The writing was not great here. It seemed to have a lot of overused themes such as the cop trying to retain the high status that he used too have and also the idiot cops getting in the way. That is also OK but the dialog made this interesting idea into a movie that was not so unfamiliar. Not much originality in here despite having such a unique character. That is always the script's fault whenever this happens. The writing and directing just made this movie so frustrating to watch. You cannot blame the acting. You could see that Denzel Washington, already an established actor at that time, and Russell Crowe, not established, really tried to push this movie forward. Yet there was little to work with which made them look really average. This movie could have been much better if it was made more into a action/drama about the our inner battles. Considering that SID 6.7 had 150 personalities the storyline of his character could have made him have a battle within himself. Now this was done to a minor level which really annoyed me. They are many other ideas or methods that could have really made this movie something but of course this did not happen. It went for cheap effects, an over used clichéd storyline with a little bit of a twist. That may work for some people but not for me. I'am giving this movie a 6/10 rating because it had so much potential.",
         "In the near future, Parker Barnes (Denzel Washington) is an ex-cop who has been sent to prison for murder. The circumstances surrounding his crime are disheartening and elicit empathy. Now, he is offered a chance at freedom from prison. Parker must hunt down and destroy a murderous cyborg, SID 6.7 (Russell Crowe), who is menacing the general public after jumping out of a virtual reality program. The chase takes on many twists and turns as SID terrorizes, shoots and kidnaps victims in his path. Can SID be stopped? It may not be a science fiction masterpiece, but this film is worthwhile and intriguing. A second viewing may be required to truly understand and appreciate its complex plot. Then, too, the marvelous special effects enhance the look and feel of the film. It is not Denzel Washington's finest hour (he is adequate); however, Russell Crowe is positively gleeful in his portrayal of the ultimately designed killing machine. There are some humorous moments, somewhat lessening the overall dark and somber tone. On the down side, the ending may be a little too pat and leave a few loose ends untied. Recommended for science fiction and action movie fans who are on the lookout for lesser known films that may satisfy them for an evening.",
         "Virtual Reality gets a look, following in the footsteps of \"The Lawnmower Man.\" If you saw \"The Matrix\"(99) and were wondering where you glimpsed the VR scenery years earlier, it may have been in this pic. Here, Denzel gets to briefly run around inside a VR world, chasing after virtual killer Russell Crowe, known as Sid 6.7 (very close to 6.66, isn't it?). Sid 6.7 is the latest computer program, a conglomeration of about 200 serial killers & mass murderers, and so advanced it's virtually self-aware. The bulk of the picture takes place in the real world, to which Sid 6.7 manages to escape to with the help of very advanced nanotechnology. I believe this was supposed to take place slightly in the future (1999), but from our perspective, it's old hat and square. Everything looks outmoded and just old, except the strangely hi-tech VR and nanites. It's also interesting, from the modern perspective, to view an early role of Crowe's, before he hit the A-List. He doesn't have much to play with here. His character doesn't have the luxury of falling back on deep psychological reasons for his murderous ways, because he's inhuman. He's simply the latest software given locomotion in the semblance of a human body. He's programmed to be the way he is - there's no choice involved on his part. There's a brief mention of his program evolving once in the real world, but there's no actual evidence of that. Once in the real world, it's a simplistic chase & destroy mission, with Denzel the only one in the city trained to stop him. Denzel, just getting on the A-List a couple of years earlier, is standard action hero here, driven by a brutal tragedy from before the film begins. The motivations for a couple of key supporting characters are suspect; the designer of Sid 6.7, for example, turns out to be almost as psychotic, but it's hard to believe no one noticed this before (was he influenced by the software?). Fichtner, as a government aide, has the most thankless role, as an idiotic bureaucrat. The child actress playing the daughter of Lynch's character went on to teenage bombshell roles in TV series, the latest being \"Charmed.\"",
         "So finally, after decades of futuristic scientists proclaiming that virtual reality will someday be here, it's here - sort of. Hollywood's always been a midwife for technology between the science industry and the common man, and in the area of virtual reality it's given us \"Johhny Mnemonic\" and this actioner, starring Denzel Washington. Basic plot is this: The police have been using virtual reality as a training method, to test recruits. Before they use it on real cops, though, they draft crooks out of prison to act as guinea pigs. This is where Washington comes in. A former cop (how convenient), Washington's been rotting in jail for years. So the cops ask him to volunteer to be a part of the experiment, and of course he agrees - but the computer he's going to be downloaded into has other plans. The 'virtual' cops are supposed to face this tough criminal in the system, you see, but the computer's decided to combine all of the nasty characteristics of famous real-life killers - and then download itself into a real, sentient being (Russell Crowe). And of course it's up to our man Washington to save the day. So there you have it, folks. It's a standard cops n robbers plot moved ahead a few centuries to take advantage of modern technology. Of course, it's set in the future, which here is portrayed as busy, grimy, a bit crime-riddled.. Hmm, a lot like the present, come to think of it, and not very inventive. And the effects are nothing special, either; you'd think with virtual reality being the centerpiece you'd see some dazzling special effects. Not really. The cast is good, and Crowe turns in a solid (if a bit hammy, but most bad guys are, aren't they?) performance. Washington is no better or worse than usual, which means the real culprit is the script here. Do yourself a favor and wait for a two-for-one night at your video store to see this one.",
         "The first great film for Russell Crowe, and a very interesting film to say the least. Cyber culture is rarely ever depicted in movies, but this was one of those films which brought some of these underground tendencies to light. What was even more interesting was how evil Sid 6.7 was. Crowe did an excellent job of portraying the demented cyber villain. I especially liked Denzel Washington, who always manages to be believable in his role when he doesn't try to be a \u0091soul brotha.' Granted, the cinematography was pretty average as well as the music, but then again, the performance of the two main stars really made this film a winner.",
         "For the most part, \"Virtuosity\" is basically another virtual reality-themed movie so full of action that it almost hurts. But interestingly enough, there is a little bit of a plot here. Denzel Washington plays Lt. Parker Barnes, who has to help find SID 6.7 (Russell Crowe), a virtual serial killer who has escaped into the real world in 1999 LA. Yes, that certainly sounds like it could degenerate into the kind of garbage that Hollywood usually turns out. Much of the movie is in fact vaguely reminiscent of movies like \"Demolition Man\". But maybe we can interpret the movie as looking at the dangers of letting technology get too powerful, like what \"2001: A Space Odyssey\" looked at. Obviously, this isn't even remotely in the same league as that one, but given that it was released in 1995, it almost seems like a prediction of how computer-centric the world would become. Not a masterpiece by any stretch - both Washington and Crowe have done much better work (and now they're both Oscar winners) - but worth seeing, if only once.",
         "I bought this film awhile back for 50 cents on Amazon, just because William Fichtner was in it. I think he is a talented actor, who ranked up there among the best like Washington, Ford, Connery, etc.. Yes i am a huge Fichnter fan and he and Washington made it tolerable to watch this weird and unrealistic film. I am not a Russell Crowe fan at all, like his character SID 6.7, Crowe is so full of himself it's pathetic. First off the film is bazaar, it has to take place 15 years or more into the future. Think about it what police department would spend that kind of money on a virtual reality program to train their police officers. It a fact a computer can only train officer so much, while most of the training is done with real instructors; and real police academy students. I watched this movie again last night and didn't know whether to classify it as a comedy or Sci-Fi. I think the reason why I gave it a 6 star rating is because it does have some humor to it. As for paying money to see it at the theater, I'm glad I didn't. I then found out it was form the same director as the one who made Lawnmower Man, and that movie was more of a mistake than Virtuosity. THX, Kris L. CocKayne",
         "If you ever want to see a capable actor horribly overact watch this film. The actor I'm referring to is not Denzel but Russel Crowe. He plays an Evil AI program brought to life as a silicon-based human. Boy oh boy is this movie silly, everything is meant to look hi-tech but it all looks old and decrepit (CRT monitors, bulky computers, over-sized VR-Headsets, laughable 3D OS interfaces, plastic holographic cubes,...). Denzel does his best to look and act serious in what he must have come to realize is an awful mess. The plot is a typical 'cyberthriller', something the 90s had plenty off (Johnny Mnemonic, the Net, hackers, Lawnmower Man,...) but this here movie must be the worst off the bunch (I think, because some of the other were pretty ridiculous too). Strangely enough I wasn't bored, it's like disaster tourism, it all quite horrible but you can't look away :)"
      ],
      "genres": [
         "Action",
         "Crime",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": ["Paramount Pictures"],
      "summaries": [
         "The Law Enforcement Technology Advancement Centre (LETAC) has developed SID version 6.7: a Sadistic, Intelligent, and Dangerous virtual reality entity which is synthesized from the personalities of more than 150 serial killers. LETAC would like to train police officers by putting them in VR with SID, but they must prove the concept by using prisoners as test subjects. One such prisoner is ex-cop Parker Barnes. When SID manages to inject his personality into a nano-machine android, it appears that Barnes might be the only one who can stop him.",
         "A virtual-reality serial killer manages to escape into the real world."
      ],
      "budget": 30000000
   },
   "movielensId": 338,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-08-04",
      "dvdReleaseDate": "1999-05-25",
      "directors": ["Brett Leonard"],
      "runtime": 106,
      "movieId": 338,
      "title": "Virtuosity",
      "mpaa": "R",
      "actors": [
         "Denzel Washington",
         "Russell Crowe",
         "Kelly Lynch",
         "William Forsythe",
         "Stephen Spinella",
         "Louise Fletcher",
         "Una Damon",
         "Miguel Nájera",
         "Miracle Vincent",
         "Traci Lords",
         "Kaley Cuoco"
      ],
      "imdbMovieId": "0114857",
      "originalTitle": "Virtuosity",
      "genres": [
         "Action",
         "Crime",
         "Science Fiction",
         "Thriller"
      ],
      "youtubeTrailerIds": ["KEDdaStz4kw"],
      "plotSummary": "The Law Enforcement Technology Advancement Centre (LETAC) has developed SID version 6.7: a Sadistic, Intelligent, and Dangerous virtual reality entity which is synthesized from the personalities of more than 150 serial killers, and only one man can stop him.",
      "tmdbMovieId": 9271,
      "avgRating": 2.99063,
      "releaseYear": "1995",
      "numRatings": 4911,
      "posterPath": "/7vdg9lA1un8TrNLlLKsaQtVqs4a.jpg"
   }
}