{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "hold-up robbery",
            "id": 3607
         },
         {
            "name": "b movie",
            "id": 11034
         },
         {
            "name": "film noir",
            "id": 195402
         }
      ],
      "imdb_id": "tt0039748",
      "video": false,
      "title": "Railroaded!",
      "recommendations": [
         45975,
         59101,
         27999,
         46401,
         1840,
         35543,
         30196,
         32887,
         29470,
         27635,
         43846,
         41234,
         41599,
         74794,
         25407,
         35955,
         25728,
         43269,
         42794,
         32945
      ],
      "backdrop_path": "/cw03Mtq5vifvdmwVrrttFBm74f1.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Duke Martin",
               "gender": 2,
               "credit_id": "52fe4649c3a36847f80f6a1d",
               "name": "John Ireland",
               "profile_path": "/87deUnSyOPNaoiQiBHjScqhu8CZ.jpg",
               "id": 14502,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Rosie Ryan",
               "gender": 1,
               "credit_id": "52fe4649c3a36847f80f6a21",
               "name": "Sheila Ryan",
               "profile_path": "/dYuiGWD61pkJQFXeKdZ9ayJdJo9.jpg",
               "id": 120712,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Police Sgt. Mickey Ferguson",
               "gender": 2,
               "credit_id": "52fe4649c3a36847f80f6a25",
               "name": "Hugh Beaumont",
               "profile_path": "/xxFBaW9yzC8gvEKN8gr1UBOVhzt.jpg",
               "id": 38232,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Clara Calhoun",
               "gender": 1,
               "credit_id": "52fe4649c3a36847f80f6a29",
               "name": "Jane Randolph",
               "profile_path": "/5EN6xSvHUkgwwm4yIasnsFVVEHq.jpg",
               "id": 30114,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Steve Ryan",
               "gender": 0,
               "credit_id": "52fe4649c3a36847f80f6a2d",
               "name": "Ed Kelly",
               "profile_path": null,
               "id": 130408,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Police Capt. MacTaggart",
               "gender": 2,
               "credit_id": "52fe4649c3a36847f80f6a31",
               "name": "Charles D. Brown",
               "profile_path": "/tmJTiq9xHPa7vVEnE8t7wXMKbdD.jpg",
               "id": 13977,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Detective Jim Chubb",
               "gender": 0,
               "credit_id": "52fe4649c3a36847f80f6a35",
               "name": "Clancy Cooper",
               "profile_path": "/qT0XIBQBvf53t1ncBFnAUBB8OcC.jpg",
               "id": 95274,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Marie Weston",
               "gender": 1,
               "credit_id": "52fe4649c3a36847f80f6a39",
               "name": "Peggy Converse",
               "profile_path": null,
               "id": 130333,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Mrs. Ryan",
               "gender": 1,
               "credit_id": "52fe4649c3a36847f80f6a3d",
               "name": "Hermine Sterler",
               "profile_path": "/kDxPvpktsA0R3yiucNTebXM4pDO.jpg",
               "id": 130409,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Cowie Kowalski",
               "gender": 2,
               "credit_id": "52fe4649c3a36847f80f6a41",
               "name": "Keefe Brasselle",
               "profile_path": "/eI1OpWQKrJcXJsMpRzdzSf1peh9.jpg",
               "id": 119081,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Jackland Ainsworth",
               "gender": 0,
               "credit_id": "52fe4649c3a36847f80f6a45",
               "name": "Roy Gordon",
               "profile_path": "/wAnt4yusdtFLvCPrT0rq8j3gnmH.jpg",
               "id": 34211,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Mrs. Wills (uncredited)",
               "gender": 1,
               "credit_id": "594b79dd925141311500d8d8",
               "name": "Ellen Corby",
               "profile_path": "/3oBJ4HH5z7FspFMxOTUe1eBzoIA.jpg",
               "id": 5738,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4649c3a36847f80f69f5",
               "name": "Anthony Mann",
               "profile_path": "/9uc4d2GGoHBRLeAqsZJpwJX4S8x.jpg",
               "id": 40199,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4649c3a36847f80f69fb",
               "name": "Gertrude Walker",
               "profile_path": null,
               "id": 115846,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe4649c3a36847f80f6a01",
               "name": "John C. Higgins",
               "profile_path": null,
               "id": 52589,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4649c3a36847f80f6a07",
               "name": "Charles Reisner",
               "profile_path": null,
               "id": 94180,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4649c3a36847f80f6a0d",
               "name": "Alvin Levin",
               "profile_path": null,
               "id": 130407,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4649c3a36847f80f6a13",
               "name": "Guy Roe",
               "profile_path": null,
               "id": 98151,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4649c3a36847f80f6a19",
               "name": "Louis Sackin",
               "profile_path": null,
               "id": 33369,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 0.954242,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 43463,
      "vote_count": 10,
      "budget": 0,
      "overview": "A mobster frames an innocent man for the killing of a cop during a bookie joint holdup being run in the back of a beauty salon. Can Police Sgt. Mickey Ferguson be convinced that his girlfriend's brother is being railroaded?",
      "similar": [
         996,
         513285,
         14638,
         247,
         4512,
         402,
         599,
         426,
         289,
         1092,
         23168,
         256591,
         7972,
         1939,
         9348,
         9846,
         845,
         678,
         223,
         910
      ],
      "original_title": "Railroaded!",
      "runtime": 72,
      "poster_path": "/9bSHaV3LVY1B1kRqMxmA74KwG29.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "PRC",
         "id": 5879,
         "origin_country": ""
      }],
      "release_date": "1947-09-25",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Anthony Mann"],
      "runtime": 72,
      "synopsis": null,
      "writers": [
         "Gertrude Walker",
         "John C. Higgins"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0039748/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BODA3MTcwMDA2Nl5BMl5BanBnXkFtZTcwMTIyOTIyMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: John Ireland, Sheila Ryan, Hugh Beaumont | See full cast and crew »"],
      "reviews": [
         "Set Up! or Framed! might be better titles than Railroaded! While it's true that the police pursue their suspect (Ed Kelly) with undue alacrity, it's also true that they're only following a trail of maliciously planted evidence. And an odd feature of the movie is that Kelly remains almost an incidental character (not even appearing in the credits); the focus stays on the police and the real behind-the-scenes villain. Brash blonde Jane Randolph operates a little beauty salon that's really a front for a back-room book. One night a couple of masked robbers knock it over, but things go wrong: A beat cop is killed, and one of the gunmen (Keefe Brasselle) takes a bullet. Soon detective Hugh Beaumont knocks on Kelly's door, led there by the boy's monogrammed navy scarf, a sighting of his van at the scene, and a description provided by Randolph. Even Brasselle, bandaged up like the Invisible Man, names Kelly in deathbed testimony. The only one who believes his innocence is his sister (Sheila Ryan). Luckily, Beaumont knows her from the old neighborhood and still is a bit sweet on her. Unluckily, so is the man who set up her brother (John Ireland) as part of a coverup to swindle the head of the syndicate both he and Randolph work for. Little by little, the craftily stitched-together ruse starts to pull apart at the seams, and the hotheaded Ireland grows more reckless and violent... Directed by Anthony Mann just before his collaboration with cinematographer John Alton took his work to a new plateau, Railroaded! displays some of his trademark tricks (a taut story line; swift and unexpected burst of violence; shadows used not merely as mood but visual metaphors). And Ireland gets not only top billing but one of his best roles. When he's not slapping around Randolph for her sloppy drinking (in the grand tradition of alcoholic molls like Claire Trevor in Key Largo and Gloria Grahame in The Big Heat), he's fetishistically perfuming his bullets. He's quite the sex-equals-violence kind of guy; when Randolph and Ryan get into a hair-pulling tussle, he watches from an alcove with a nasty smirk on his face, and his gun barrel unconsciously traces the action. It's as if it's deciding who will be the lucky recipient of its payload.",
         "This film has it all, great photography, well developed plot AND story, snappy dialogue and passable acting. I suppose I shouldn't say it has it \"all\" in that case, as the characters are not particularly round and because of that the acting is not always completely satisfying to me. But that doesn't prevent me from popping this movie in again and again, just because it's non-stop action and so so pretty to look at. \"Leave it Beaver\" fans should see this, of course, but might be slightly disappointed that Beaumont is a bit more rigid than the sit-com serial allowed him to be - I wished for more warmth from his character, as I know he was capable of conveying. John Ireland, however, was brilliantly evil and his acting, at least, was top notch.",
         "John Ireland is a cold blooded and vile villain and Hugh Beaumont is an honest detective who's not so sure that he and his fellow overzealous cops have the right suspect (Ed Kelly) in the murder of a police officer in a gangland robbery. Toss in an evil cat fight between Sheila Ryan and Jane Randolph and \"Railroaded!\" becomes a prime example of Anthony Mann' superior post-war Film Noir direction. Using low lights and a suggestive script despite a low budget and grade \"B\" actors, Mann jumps right into the action from the start with a botched robbery that leads to not just the death of a cop, but the railroading of an innocent man. Mann builds the story up with tension and skill until the taught finale filled with gun shots, breaking glass, and confusing camera angles. It may be a \"B\" movie, but Mann deserves a \"A\" for his effort.",
         "John Ireland's portrayal of a cold obsessed killer is the best thing in this movie. His performance is edgy, sexy and menacing. A brutal thug who loves his gun. Unfortunately he is hampered by a weak script, where his actions often make little sense. (For instance, why would he contact the sister of the suspect he framed?). Jane Randolph is also strong as the moll, although her character seems to change midway through the movie. One of the first noir films directed by Anthony Mann, the movie is well shot, fast paced, tightly edited and tough. One wishes the focus could have stayed on Ireland, or, alternatively, the strong scenes of Ed Kelly being framed and pushed around by the cops. Mann will better develop these themes in his later films (noirs and westerns). Still a pretty enjoyable movie and a must for film noir fans.",
         "A nice moment between John Ireland and Wilma, his boss' mistress. She teases him with a nickname, and he answers \"The name is Duke.\" She jokes \"You petrify me!\" A quip that is a nod to Bogey's Duke Mantee character in \"Petrified Forest,\" but Ireland's Duke is relatively without Mantee's charm, he is definitely not go to fall in love with the leading lady, or do her any favors. He is only looking out for his own hide. And brutally so, even while perfuming his ammunition. Keeping his lascivious eye on Ryan's sister while pretending to help her with her brother's case, he is always a leering physical threat to her. Fine noir ingredients include dark streets and dangerous shadows. Much camera movement and interesting closeups keep up the pace. Watch Turner Classic for future airings.",
         "After watching RAILROADED, I'm convinced JOHN IRELAND could have taken his place alongside men like ROBERT MITCHUM doing grim little film noirs during the '40s. He's excellent as a tight-lipped gangster with a scowling expression as he methodically kills anyone double-crossing him or standing in his way. He knocks around his blonde girlfriend (JANE RANDOLPH) with woman-hating contempt and fires bullets with casual lack of concern for fatalities. In short, he makes an ideal film noir anti-hero. HUGH BEAUMONT, known by most fans principally as Beaver's dad on TV, is only lukewarm as the detective who falls for SHIELAH RYAN and decides to help her track down the killer after Ireland frames her kid brother (ED KELLY) for the murder of a policeman. Their final fade-out kiss looks a little clumsy but--hey, the accent is on crime and action, not romance. Anthony Mann does the best he can with a low-budget crime melodrama and turns it into a taut, well-made, shadowy film noir with Ireland showing his stuff as a ruthless gangster. Summing up: Brisk and entertaining, it's well worth watching for fans of this genre.",
         "Anthony Mann directed some of the very best noirs of the 1940s and early 1950s. This one is brutal, hard-hitting, and unrelenting till its Hollywood ended. (The ending may have been tacked on. I don't know. But it works organically with the whole, unlike many others.) The problem for me with some of his movies, this one included, is that they are so dark they're almost impossible to see at times. Yes, it's atmospheric. But it's also frustrating. The literal noir in some -- not all -- of his movies reminds me of the staging of Wagner at the Metropolitan Opera. Yes, it's brooding and intense. But it's also really hard to see.",
         "Once I got into collecting film-noir movies, I had to have this one, so I paid big bucks for the VHS. I say that because it added to my disappointment. The film is okay, but if you have really high expectations before seeing this, you'll probably be let down, as I was. I liked this more on the second viewing when I knew what to expect. In the beginning, it dwells too long on the innocent man-being arrested theme but after that part is over, it picks up, but then bogs down again. For people who grew up watching \"Leave It To Beaver\" on TV, this film offers Hugh Beaumont as a main character. Since I did, I always find it interesting to see Beaumont in different roles. I also enjoyed ogling a pretty brunette, \"Rosie,\" played by Sheila Ryan. The climax to this story was good, and it was surprisingly realistic. There was some decent film-noir photography in spots, too. Overall, okay but not what it's cracked up to be.",
         "Top billing for \"Railroaded!\" goes to the great actor John Ireland who plays the coldblooded killer Duke Martin. Today, Ireland is perhaps best remembered for his role as the gunslinger, Cherry Valance, in the John Wayne western classic \"Red River\" and for his Academy-Award- nominated performance as a reporter in another Hollywood classic \"All the King's Men.\" Duke Martin, as with most of the heavies in noir flicks, is a misogynist. But this time the woman hater doesn't get away with it completely. Both Clara Calhoun (Jane Randolph) and Rosie Ryan (Sheila Ryan) put him in his place. When Duke misquotes Oscar Wilde, \"Some women should be beaten regularly, like gongs\" (it was actually Noel Coward who used the line), Clara is quick to respond to the effect that if that line belonged to Oscar Wilde, then let him have it. When Rosie and Duke first meet at Duke's club, Duke calls women \"dames.\" Rosie responds sharply, \"I don't like that term.\" Duke backs up and uses the still somewhat derogatory \"gals.\" The plot involves Rosie's brother, Steve, portrayed by unknown actor Ed Kelly, who only made three films to my knowledge. Duke and his girlfriend, Clara, frame Steve for a bookie heist, during which time a patrolman is killed. The police are after a quick conviction and are getting ready to go to trial and ask for the death penalty when Police Sgt. Mickey Ferguson (Hugh Beaumont, aka Ward Cleaver) falls for Rosie and decides that her brother may not be guilty after all. Ferguson attempts to help Rosie find the real murderer when Rosie decides to conduct her own investigation by becoming chums with Duke. This all leads to more murders until the ultimate confrontation between Ferguson and Duke. The film is fast-paced and somewhat violent for its day. The creative use of darkness and shadow was an important ingredient of noir cinema, but as one IMDb reviewer has already noted, there is so much darkness in \"Railroaded!\" that at times it is difficult to see what is happening. One reason for this may be viewing the film on a TV screen. Perhaps on the big screen there was no problem. Outside of this minor weakness, \"Railroaded!\" is a winner all the way.",
         "Railroaded (1947) An almost amazing movie, well made, beautifully photographed, held back by a stiff script but still it manages. And it has a dark current that makes it both creepy and contemporary. Director Anthony Mann seems to have made a dozen great films that are just under the radar, noirs and westerns that have some edge to them to keep them from falling into the abyss of their genres. This is Mann at his mature earliest. He had made a few films in the earlier 40s, but this, along with \"Desperate,\" marks his coming into his own. Yes, you might find too much of a formula at work here, but it's not derivative, just a little stilted in the dialog. And yes, you might ask, near the beginning, why the cops couldn't see how easy the frame up would be (anyone could have stolen the truck and committed the crime), but remember, this one fact was supported by several others, including an eyewitness confirmation. So, once over these humps, you are for a good ride. Who to watch for amongst these relative unknowns? John Ireland, most of all, for his bad guy personification, all charm and heartlessness, simultaneously. His girlfriend, played by Sheila Ryan, is his match, in a sharp performance also dripping with selfish cruelty, but tempered, critically, by doubt and remorse. The third star is the little known cinematographer Guy Roe, who must have been inspired by the young, rising director. The filming right from the opening, subtle crane shot of the beauty parlor facade is artfully gorgeous without becoming baroque the way Orson Welles had become (beautifully) by 1947 with \"The Lady from Shanghai.\" Both are great examples of where the movies were just after the war, both with a dark, brooding, searching uncertainty. And both showing off the amazing movie-making machinery of post-War Hollywood. I say this because both films were smaller budget affairs, and yet they have uncompromised production. Give this a serious look. It's imperfect, for sure, but it has such high points, including some dark dark filming that is so kinetic and scary it surprised even an old film noir fan like me, you'll be glad."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Film-Noir"
      ],
      "productionCompanies": ["Producers Releasing Corporation (PRC)"],
      "summaries": [
         "Sexy beautician Clara Calhoun, who has a bookie operation in her back room, connives with her boyfriend, mob collector Duke Martin, to stage a robbery of the day's take. But the caper turns violent; a cop and Duke's partner are shot; and Duke arranges for innocent Steve Ryan, owner of the car they stole, to be framed. At first homicide detective Mickey Ferguson thinks Steve is guilty, despite his attraction to Steve's sister Rosie. And the suave but ruthless Duke won't hesitate to keep it that way with more of his perfumed bullets...",
         "A beautician and her crooked boyfriend attempt to rob the bookie operation located in the back room, but when the plan goes wrong, they frame an innocent man."
      ],
      "budget": 0
   },
   "movielensId": 3380,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1947-09-25",
      "dvdReleaseDate": "2000-02-29",
      "directors": ["Anthony Mann"],
      "runtime": 72,
      "movieId": 3380,
      "title": "Railroaded!",
      "mpaa": "",
      "actors": [
         "John Ireland",
         "Sheila Ryan",
         "Hugh Beaumont",
         "Jane Randolph",
         "Ed Kelly",
         "Charles D. Brown",
         "Clancy Cooper",
         "Peggy Converse",
         "Hermine Sterler",
         "Keefe Brasselle",
         "Roy Gordon",
         "Ellen Corby"
      ],
      "imdbMovieId": "0039748",
      "originalTitle": "Railroaded!",
      "genres": [
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["qLkTTgd7620"],
      "plotSummary": "A mobster frames an innocent man for the killing of a cop during a bookie joint holdup being run in the back of a beauty salon. Can Police Sgt. Mickey Ferguson be convinced that his girlfriend's brother is being railroaded?",
      "tmdbMovieId": 43463,
      "avgRating": 2.98571,
      "releaseYear": "1947",
      "numRatings": 35,
      "posterPath": "/9bSHaV3LVY1B1kRqMxmA74KwG29.jpg"
   }
}