{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "musician",
            "id": 4048
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0117664",
      "video": false,
      "title": "Slaves to the Underground",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Shelly",
               "gender": 1,
               "credit_id": "52fe49a2c3a36847f81a498d",
               "name": "Molly Gross",
               "profile_path": null,
               "id": 230100,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Jimmy",
               "gender": 0,
               "credit_id": "52fe49a2c3a36847f81a4991",
               "name": "Jason Bortz",
               "profile_path": "/cyLSUDWLolXkJ9NJU5YeRvBUIpP.jpg",
               "id": 230101,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Suzy",
               "gender": 1,
               "credit_id": "52fe49a2c3a36847f81a4995",
               "name": "Marisa Ryan",
               "profile_path": "/fUjEQZiOujsILAIUdk0XOD50pT2.jpg",
               "id": 142293,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Zoe",
               "gender": 0,
               "credit_id": "52fe49a2c3a36847f81a4999",
               "name": "Natacha La Ferriere",
               "profile_path": null,
               "id": 230102,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Big Phil",
               "gender": 2,
               "credit_id": "52fe49a2c3a36847f81a499d",
               "name": "Bob Neuwirth",
               "profile_path": null,
               "id": 1489,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Brenda",
               "gender": 1,
               "credit_id": "52fe49a2c3a36847f81a49a1",
               "name": "Claudia Rossi",
               "profile_path": "/dp4SubZ5it9JOF0qm2jC6iJQPFP.jpg",
               "id": 226046,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Joe Burke",
               "gender": 2,
               "credit_id": "57efd83992514159de003c56",
               "name": "Bill Johns",
               "profile_path": "/5TIG8iF8A2FpkDUQJACs6GZTMVZ.jpg",
               "id": 115432,
               "order": 6
            }
         ],
         "crew": [{
            "gender": 1,
            "credit_id": "52fe49a2c3a36847f81a4989",
            "name": "Kristine Peterson",
            "profile_path": null,
            "id": 73962,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.216268,
      "production_countries": [],
      "id": 59939,
      "vote_count": 2,
      "budget": 0,
      "overview": "The grunge girl band \"No Exits\" is just about to get a record deal. At this time Jimmy is appearing again, the former boy-friend of the band guitarist Shelly. She had left him because his friend had raped her. But he doesn't know that - up to now. Shelly has fallen in love with the band singer Suzy in the meantime. But she still loves Jimmy, too. So she moves to him again, what Suzy doesn't like that all. Especially because she is becoming a feminist.",
      "similar": [
         258480,
         370663,
         401898,
         244772,
         12793,
         52371,
         27586,
         10735,
         858,
         112160,
         141,
         634,
         376867,
         437557,
         242224,
         10818,
         11421,
         43923,
         340485,
         250124
      ],
      "original_title": "Slaves to the Underground",
      "runtime": 93,
      "poster_path": "/smQazRPU2PGA2lEeBsds6dPPIp0.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1997-11-14",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "Love sex insanity. Thank God you're only young once.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Kristine Peterson"],
      "runtime": 93,
      "synopsis": null,
      "writers": ["Bill Cody"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0117664/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNDM3MTQzMTU3N15BMl5BanBnXkFtZTcwMzkzNjIyMQ@@._V1_SY317_CR10,0,214,317_AL_.jpg",
      "actors": ["Stars: Molly Gross, Jason Bortz, Marisa Ryan | See full cast and crew »"],
      "reviews": [
         "The last person to comment has some good points and I can definitely see why some people would dislike the film. Yet, I actually liked this film. I found it really funny in parts. I liked the soundtrack, (Especially Joan Jett and Ani Difranco!) and the hilarious speech about the Cindy Crawford and the fashion industry. Yeah, the acting is awful, there's an odd masturbating scene (which has absolutely nothing to do with the plot) and the main character is incredibly irritating, and unlikable. But in parts, its so bad - its good, in a \"showgirls\" kind of way. Its not for everyone but if you don't take it too seriously, like rock chick music and indie (read: cheaply made) films and are open to the lesbian theme (which isn't really the main storyline...) you might just enjoy it.",
         "All I really have to say is, more please. This movie had a cool sound track, good character detail, managed to tackle complex issues while leaving enough room for the viewer to have an opinion, and unlike more dated genre work such as \"Go Fish\", this movie is well into the young dykedom of today's world. The philosophical moments in this movie are tinged with the bitter-sweet taste of reality, rather than myth. And I do not understand why the film was cut for broadcast on terrestrial TV in Britain. It seems we still have a very long way to go concerning the establishments. However films like this are helping to pave the way.",
         "I got this film from Netflix and it was a nice surprise. I don't know what film the other poster saw, but it wasn't this one. Having spent time around the indie music scene for a number of years I can personally attest to the fact that this film is anything but naive. It hits the nail right on the head. The music from obscure Ben Lee songs to Ani DiFranco are not only dead on (the film was shot back in the nineties)for the scene but the way the kids act - young and impulsive shows that the filmmakers knew their subjects and refused to make a film that imprinted the ideas and beliefs of 40 year old wannabe film critics. The closest film I've seen to this one is probably Penelope Speeris' wonderful film Suburbia from back in the 80's.",
         "I first saw this indie film nearly 10 years ago on cable someplace. I saw it again on DVD last night. SLAVES TO THE UNDERGROUND is a film that certain men probably don't like much, but women like myself enjoy quite a lot, for a great many reasons. The one thing certain men might enjoy is a couple of lesbian sex scenes with some nudity (not a whole lot though). Aside from that, I'm not too sure! This is not only the story of an all girl punk band trying to make it big in post-grunge Seattle, but of how these women have pretty much rejected men---in every possible way imaginable. Shelly (Molly Gross) and Suzy (Marisa Ryan) are 2 members of this band, called the No-Exits. Suzy sings lead and Shelly rocks on the guitar. Their sound is angry, as if you needed to be told that. Before you say, \"Oh, more angry chicks! Who cares?\" you'll get a good single reason why Shelly and Suzy are angry. The writing on the stall in the bathroom makes for a useful public service announcement. I loved it. I also loved the fact that petite Marisa Ryan plays a girl who ends up beating the living you know what out of a guy twice her size. She is awesome in this film. I don't get why we don't see much of her today. Given the right role, such as this one, she is scorchingly charismatic. Shelly and Suzy have been lesbian lovers for some time, but things get turned upside down when Shelly's ex-boyfriend Jimmy (Jason Bortz) unexpectedly shows up to one of No-Exit's local club shows. Suddenly Shelly is no longer in love with Suzy and all over Jimmy, adamant about rekindling their old flame. She launches into a shpeel about how if she didn't have those \"emotional problems\" she wouldn't have broken it off with him, wouldn't have joined the band, wouldn't have met Suzy, etc. Although Molly Gross did a fine job (I'd like to see her doing more stuff too) acting the character, I disliked Shelly after this point. She did go through quite a bad ordeal, but she seemed to feel that it justified the things she did to hurt and use people. Her betrayal of Suzy destroys their relationship and for a while, their friendship. She leaves No-Exits, and has apparently decided she isn't gay. Later, wanting back into the band, she demands that she and Suzy only have a \"platonic\" association. Meanwhile, it seems that she leads Jimmy on, moves in with him, and then, after deciding she needs to go back to the band, moves out of Jimmy's place and pretty much breaks it off with him, again. Jimmy's friends had warned him about Shelly being \"trouble\" and it appears they are right. Shelly WAS deeply affected by the tragedy in her life. Nevertheless, it's not easy to like such a selfish person. It seemed to Shelly that only her wants and only her feelings mattered, no one else's. The human behavior is very realistic. I couldn't blame Suzy for the decision she made about her own life's direction at the end of the film. Again, the social and political statements in this film may not sit well with certain men. It's definitely a women's film, with a N.O.W. attitude. I still find it entertaining, realistic and fresh, if perhaps a bit self conscious, even for a film dated in mid-90s Seattle.",
         "\"Slaves to the Underground\", a grungy and immature flick about some young Seattle slacker-types with issues, is unable to escape the naivete of the creative forces behind it. Built around a story about a sexually and otherwise confused girl with two lovers and no qualities which would explain one lover, this flick also makes shallow and off-target attempts at social commentary and is fraught with awful music. \"Slaves....\" underscores one axiom: A film can be no smarter than the people who make it. Not recommendable."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Music",
         "Romance"
      ],
      "productionCompanies": ["NEO Motion Pictures"],
      "summaries": ["Seattle: The grunge girl band \"No Exits\" is just about to get a record deal. At this time Jimmy is appearing again, the former boy-friend of the band guitarist Shelly. She had left him because his friend had raped her. But he doesn't know that - up to now. Shelly has fallen in love with the band singer Suzy in the meantime. But she still loves Jimmy, too. So she moves to him again, what Suzy doesn't like that all. Especially because she is becoming a feminist. The conflict is about to threaten the band..."],
      "budget": 0
   },
   "movielensId": 3381,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-11-14",
      "dvdReleaseDate": "2000-02-29",
      "directors": ["Kristine Peterson"],
      "runtime": 93,
      "movieId": 3381,
      "title": "Slaves to the Underground",
      "mpaa": "",
      "actors": [
         "Molly Gross",
         "Jason Bortz",
         "Marisa Ryan",
         "Natacha La Ferriere",
         "Bob Neuwirth",
         "Claudia Rossi",
         "Bill Johns"
      ],
      "imdbMovieId": "0117664",
      "originalTitle": "Slaves to the Underground",
      "genres": [
         "Comedy",
         "Music",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The grunge girl band \"No Exits\" is just about to get a record deal. At this time Jimmy is appearing again, the former boy-friend of the band guitarist Shelly. She had left him because his friend had raped her. But he doesn't know that - up to now. Shelly has fallen in love with the band singer Suzy in the meantime. But she still loves Jimmy, too. So she moves to him again, what Suzy doesn't like that all. Especially because she is becoming a feminist.",
      "tmdbMovieId": 59939,
      "avgRating": 3,
      "releaseYear": "1997",
      "numRatings": 8,
      "posterPath": "/smQazRPU2PGA2lEeBsds6dPPIp0.jpg"
   }
}