{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0028282",
      "video": false,
      "title": "Song of Freedom",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 13,
               "character": "John 'Johnny' Zinga",
               "gender": 2,
               "credit_id": "52fe4c1c9251416c910f02cb",
               "name": "Paul Robeson",
               "profile_path": "/7C2v4rYZcrdzAWMZNRWt9v7Owgb.jpg",
               "id": 98568,
               "order": 0
            },
            {
               "cast_id": 14,
               "character": "Ruth Zinga",
               "gender": 1,
               "credit_id": "52fe4c1c9251416c910f02cf",
               "name": "Elisabeth Welch",
               "profile_path": "/nf2My6RNrmofh1tnevk1FpcYrIT.jpg",
               "id": 975135,
               "order": 1
            },
            {
               "cast_id": 15,
               "character": "Gabriel Donozetti",
               "gender": 0,
               "credit_id": "52fe4c1c9251416c910f02d3",
               "name": "Esme Percy",
               "profile_path": null,
               "id": 47668,
               "order": 2
            },
            {
               "cast_id": 16,
               "character": "Monty",
               "gender": 0,
               "credit_id": "52fe4c1c9251416c910f02d7",
               "name": "Robert Adams",
               "profile_path": null,
               "id": 106991,
               "order": 3
            },
            {
               "cast_id": 17,
               "character": "Native Leader",
               "gender": 0,
               "credit_id": "52fe4c1c9251416c910f02db",
               "name": "James Solomon",
               "profile_path": null,
               "id": 1141556,
               "order": 4
            },
            {
               "cast_id": 18,
               "character": "Mandingo",
               "gender": 0,
               "credit_id": "52fe4c1c9251416c910f02df",
               "name": "Ecce Homo Toto",
               "profile_path": null,
               "id": 1141557,
               "order": 5
            },
            {
               "cast_id": 19,
               "character": "Mr. Blane, the Pianist",
               "gender": 2,
               "credit_id": "52fe4c1c9251416c910f02e3",
               "name": "Ronald Simpson",
               "profile_path": null,
               "id": 955167,
               "order": 6
            },
            {
               "cast_id": 20,
               "character": "Bert Puddick",
               "gender": 2,
               "credit_id": "52fe4c1c9251416c910f02e7",
               "name": "George Mozart",
               "profile_path": null,
               "id": 940100,
               "order": 7
            },
            {
               "cast_id": 21,
               "character": "Marian",
               "gender": 0,
               "credit_id": "52fe4c1c9251416c910f02eb",
               "name": "Jenny Dean",
               "profile_path": null,
               "id": 1141558,
               "order": 8
            },
            {
               "cast_id": 22,
               "character": "Nell Puddick",
               "gender": 0,
               "credit_id": "52fe4c1c9251416c910f02ef",
               "name": "Joan Fred Emney",
               "profile_path": null,
               "id": 1141559,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4c1c9251416c910f0285",
               "name": "J. Elder Wills",
               "profile_path": null,
               "id": 992802,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4c1c9251416c910f028b",
               "name": "Claude Wallace",
               "profile_path": null,
               "id": 959258,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe4c1c9251416c910f0291",
               "name": "Dorothy Holloway",
               "profile_path": null,
               "id": 30173,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe4c1c9251416c910f0297",
               "name": "Ingram D'Abbes",
               "profile_path": null,
               "id": 1141549,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 0,
               "credit_id": "52fe4c1c9251416c910f029d",
               "name": "Fenn Sherie",
               "profile_path": null,
               "id": 1141550,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 0,
               "credit_id": "52fe4c1c9251416c910f02a3",
               "name": "Michael Barringer",
               "profile_path": null,
               "id": 1141551,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4c1c9251416c910f02a9",
               "name": "Philip Lindsay",
               "profile_path": null,
               "id": 1141552,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4c1c9251416c910f02af",
               "name": "Will Hammer",
               "profile_path": null,
               "id": 1141553,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4c1c9251416c910f02b5",
               "name": "Eric Ansell",
               "profile_path": null,
               "id": 959262,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "5519d9599251411e930003bc",
               "name": "Harry Rose",
               "profile_path": null,
               "id": 1141555,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5519dd17c3a36830d1000418",
               "name": "Thomas Glover",
               "profile_path": null,
               "id": 959264,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "551bd6509251414af9002af9",
               "name": "Eric Cross",
               "profile_path": null,
               "id": 1111684,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [],
      "popularity": 0.002404,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 159727,
      "vote_count": 0,
      "budget": 0,
      "overview": "John Zinga is a black dockworker in England in the 18th century, with a great baritone singing voice. He is discovered by an opera impresario, and is catapulted into great fame as an international opera star. Yet he feels alienated from his African past, and out of place in England. By chance, he is informed that an ancestral medallion that he wears is proof of his lineage to African kings, and he leaves fame and fortune to take his rightful place of royalty. Reunited with his people, he plans to improve their lives by combining the best of western technology with the best of traditional African ways.",
      "similar": [],
      "original_title": "Song of Freedom",
      "runtime": 80,
      "poster_path": "/7ouV5n8NZFO8RiZHhaaNp3c2tR9.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/pi7SHIi3CNAyDUCt6Jpr1q9UW3t.png",
            "name": "Hammer Film Productions",
            "id": 1314,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "British Lion Films",
            "id": 632,
            "origin_country": "GB"
         }
      ],
      "release_date": "1936-08-16",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["J. Elder Wills"],
      "runtime": 80,
      "synopsis": null,
      "writers": [
         "Claude Wallace",
         "Dorothy Holloway"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0028282/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE4MzgzMTU1NV5BMl5BanBnXkFtZTgwNTIwMzQwMjE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Paul Robeson, Elisabeth Welch, Esme Percy | See full cast and crew »"],
      "reviews": [
         "Although no-one could call this a great movie, it is of compelling historical interest. At a time when Black people in the movies were servants or scoundrels, Paul Robeson portrayed a London dock-worker who is discovered by an impresario and launches a great singing career; after that, he goes to Africa to bring education and enlightenment to the tribespeople. It's easy to be harsh on this movie; it shows the people of Africa as benighted savages in need of guidance (only this time they get it from Robeson, playing an Afro-cockney). The whole second half plays in tropical-adventure mode, with all the clichés of the 1930s. But you have to realize that the film's sympathies are with the London dock-workers, black and white; it goes to great lengths to show them treating each other with friendship and respect, and this is the most notable part of the story. Everyone else is a caricature - the impresario, the aristocratic explorer, the witch-doctor, and so on. Anyone who has a tolerance for 1930s films will quickly realize that this is much better than most of them, and is worth a look for many reasons, not the least is the opportunity to hear Robeson's great singing voice. One curious fact is that this is from Hammer Studios, which later became identified with horror films. A must see for anyone interested in cinema.",
         "This was a fairly good film dating back to 1936 from Hammer Productions in Britain. Starring Paul Robeson, whose extraordinary vocal talents are properly utilized. It's the story of a African-Briton living in England after slavery has been abolished in the European nation. He works on the docks and his one dream in life to discover his ancestry in Africa. His interest is fueled by a song that he sings often, be it to his wife or during his job on the docks. A song that he never learned, but as he would put it, was always inside of him. His amazing bass singing voice is over-heard by a theater yuppie and he is quickly recruited to the stage appearing in theatrical productions while utilizing his singing talents. After creating a fan following and with the help of some knowledge from a theater-goer, he decides to finally take the trip to Africa to find his \"roots.\" Overall, the film is good, if not a bit too idealistic. But it doesn't harm the film's integrity and Robeson's great talent as both an actor and singer. Seeing how this film is not known well, I would recommend it. It's not a very long picture; it runs just under and hour and twenty minutes. So take some the time, and find this movie. If not for the film, then do it for Robeson's incredible vocal talents.***",
         "This movie is about how sheer chance and pure luck and can lead to fame and fortune. Paul Robeson is wonderful. His singing is comparable to that in the 1936 Show Boat, arguably the greatest musical ever made by Hollywood. Paul Robeson is such a commanding presence in this movie that without him this movie could not be made. Also the story is compelling as a man has a chance to fulfill his dream and in the process learn more about himself and his roots. Anyone who gives any thought to their own roots can relate to this movie. It's about a man's quest for cultural and spiritual fulfillment which this movie mots effectively portrays. Also impressive is Elizabeth Welch who plays Mr. Robeson's wife. A good story, well acted, excellent, inspirational songs, all combined to create a great movie.",
         "This movie is not only extraordinary for he 1930's it is extraordinary now. If this movie was made today it would be in the guise of either quasi elite character or a radical angry sounding African American that would be treated as a someone on the fringe who hates white folks. A character that automatically would be dismissed as some white hating, American hating person...in reality a racist or a villain themselves. It is amazing that we as African Americans have the dubious distinction of being villains or crazy if we want to go to Africa or have strong feelings for the place. Treatment one never sees if a Jewish person wants to migrate to Isreal or a Irish person wants to go to Ireland to get in touch of their roots. This film shows that a black person doesn't have to hate their country or white people to love Africa or wanting to go back to their roots. Being conditioned by present day American films I was waiting for the white villain or black companion telling the Paul Robeson character to stop talking about Africa all of the time and that he was nuts. Thankfully none of those characters showed up. Paul Robeson works as a stevedore in London ( I think). He gets along just fine with his white co workers. They even socialize and have a few drinks after work. He has a very supportive wife who listens and tries to understand his pull to Africa. He talks to her about needing to go there. He even has a map of Africa. There is no question that she will go with him without protest if and when he goes. I love this because in movies made now the wife is usually not supportive of such a \"crazy thing\". Which is crazy considering she had to know how her husband would feel before marrying him. Paul Robeson of course has numerous chances to show off his voice. One day he is discovered by this man, a white man. He starts giving concerts and one day a man is in the audience recognizes a song he is singing. This song Robeson tells his wife is a song he has no idea of learning but it was always in him. The man in the audience tells him it is a song that only the Chief of this African tribe would sing. I must mention that neither the white man who manages him or the white man in the audience are bad evil money grubbing folks. Eureka!! He now has a connection to Africa. He always wondered what part of Africa his family was from, now he knows. Well him and his wife and his helper/friend all pack up and leave England for Africa. They do not have the welcome they expected. Which I thought was very realistic. Robeson and his wife are like fish out of water. There is a very angry medicine man who challenges Robeson and there is a ally named Mandingo a elder that helps Robeson out. Mandingo does not become a enemy of his tribe because he doesn't show blind allegiance and he respects the tribal traditions and warns Robeson about them. Of course Robeson thinks he is going to go over like a charm but he doesn't. One night while the tribe is doing a ritual Robeson intervenes while warned not to. But even worse his wife shows up. Both of them are arrested and she is sentenced to death. Right before the are ready to execute her he starts singing that song. All of a sudden everyone stops what they are doing and realizes he really is he Chief. The next scene is a a billboard advertising a show back in London. Well it seems that every year he goes back to England does a few concerts and goes back to Africa to with the proceeds to help his tribe. This we find out from his manager who tells us that he is a nice and great man. I loves this movie because for once we have a Black man who is shown to love his African roots without hating . I am not a defender of the white man. But I feel it puts me as a black woman in a terrible unfortunate position to be looked upon with suspect eyes every time one talks about their African roots. Or even crazy by confused Black people. The way it is always shown in present day movies. I feel most of us don't even think of hating white folks and that is why we want to go to Africa. They are not even in the equation. We want to go to Africa for the same reason a American born Irish person wants to go to Ireland. Just to see what is like and get next to our roots. That's all and this movie shows how it is done. BTW Ozzie Davis died the other day and it turns out that he was one of few people who stuck by Paul Robeson's when he blacklisted for his pro Soviet views. Another brave man, like Robeson who would not be compromised.",
         "Sure, the movie is dated in both technique and appearance. But it does have the great Paul Robeson in the central role as a dockworker and social equal of his white work mates. This is at a time when Blacks in American movies were reduced to either menials or buffoons. In terms of stereotypes, Robeson's non-demeaning role takes some getting used to. But try imagining that powerful presence and commanding voice in anything other than a dignified role. No wonder he was widely viewed as a threat to Jim Crow stereotypes. Perhaps the film's most interesting aspect is what the Westernized Robeson can do for his benighted tribe of ancestors once he returns to them, uninvited. Sure, he can bring those sanitation and medical advances that will improve their collective health. The movie does a pretty good job of dramatizing that aspect, and we're all rooting for him to win out over the tribe's non-scientific methods and the witch- doctor power structure keeping them in place. But what happens after that. Of course, the movie stops at that point, so we don't know. But we do know another area of the continent has been opened to Western presence. The question then is whether Robeson will also bring in Western commercial interests, of much more dubious benefit than the proved health benefits, as history shows. After all, penicillin is one thing, Chevron is another. This remains a point to ponder now that the movie has set up the initial stage. Despite its shortcomings (the outrageously fey Donizetti, for one), the movie remains an interesting artifact of its time, especially for Robeson's and other Blacks' acceptance into the white working class of London's docks. I'm sure the leftist Robeson found that labor- solidarity aspect particularly appealing. Then too, Elisabeth Welch delivers a fine natural performance as Robeson's loyal wife. We root for the two of them just as we would root for a courageous white couple. Above all, however, the film remains a chance to view one of America's noblest forgotten figures\u0097the great Paul Robeson.",
         "It's sad that this sort of film simply could not have been made in Paul Robeson's home country at the time due to racism. Instead, Robeson went to the UK and made a few films--too few. I say this because he had a wonderful screen presence and his singing was gorgeous. Robeson plays 'John Zinga'--a London dockworker descended from royalty back in Africa. Oddly, he lacks a British accent (while Robeson was a brilliant and multi-talented man, apparently a British accent was beyond him) and he has a weird sort of consciousness of his people and Africa within him. It goes far deeper than his interest in his cultural homeland--Robeson's character is fixated on the place and seems to have bits and pieces in the back of his mind about his homeland--though no one apparently ever told him about this--at least as far as he can remember. So, after becoming a huge singing star and learning more about the exact place in Africa where his forebears came from, he takes off for the place to get in touch with his roots. The second portion of the film takes place an Zananga, Africa. There, Robeson is eventually recognized as a descendant of kings and brings culture, medicine and western civilization to these people--but it is a hard fight to get them to abandon their ineffective ways. It's nice that it's NOT a case of whites bringing this to these 'dark' people but a black man bringing this knowledge to them--making it seem a little less paternalistic. In many ways, this portion of the film seems like a call to other black men and women to return and contribute to their ancestral lands. Overall, while the film might seem a bit old fashioned today, it really is a remarkable film in many ways. The most obvious is because of its unusual subject mater, but more important aspects should not be lost on the viewer. To have a mainstream film starring a strong and talented black man was very progressive for its day. And, seeing Robeson liked and respected by all as a person--even by his white co-workers. In many ways the film comes off as a bit overly ideal--absent is racism and in this film a good black man can achieve practically anything--a message that must have resonated in the black communities in the UK as well as back home in the States. A daring film and a great chance to see and hear an amazingly gifted man. For more on this, read his biography on IMDb--you'll see what I mean.",
         "If you can possibly see The Song Of Freedom by all means do so. It's a chance to see Paul Robeson sing and give a fine acting performance in a story set partially in Africa. It's a mini-version of the famous American mini-series Roots. Paul in fact carries his roots with him both in a song that's been with him since birth and a medallion handed down to him from an ancestor who was sold into slavery and who was king of his people. That's all dealt with in a short prologue. Fast forward to 1936 and Robeson is working on the London docks and also provides a bit of entertainment for his fellow stevedores. Impresario Esme Percy discovers him and turns Robeson into a concert/opera singer. But one night a backstage visitor tells Robeson that this melody which he has engraved in his soul is the chief's song from a particular tribe in Africa. Robeson and wife Elisabeth Welch go to that part of Africa where he attempts to reassert his royal prerogatives. As a colonizing power in Africa, the British picked up knowledge about the place that Americans only gleaned from Edgar Rice Burroughs and other such pulp fiction authors. And in these years prior to World War II did film a lot of stories on location there such as The Four Feathers in the Sudan. Song Of Freedom was shot on location in Sierra Leone for the African part of the story. It's light years more real than anything you would get from Hollywood. Incidentally the gambit of the 'lost song' may very well have been lifted from the Victor Herbert operetta Naughty Marietta. No matter, it's well done and provides Robeson with a number. Elisabeth Welch who was a fine singer in her own right gets to do Sleepy Rivers. I wish she had been given more to do. Seeing both Paul Robeson and a glimpse of the real Africa is a chance no one should pass up.",
         "***SPOILERS*** London dock worker Johnny Zinga, Paul Roberson, always longed to find out his roots ever since he was born into slavery on a slave boat, docked in the London pier,back in 1833. It wasn't until five years later that slavery was abolished in England making Johnny a free man as well as his fellow blacks in the country. Now all grown up with a good job and happily married to his wife Ruth, Elisabeth Welch, Johnny beside his excellent work on the London docks had developed a tremendous baritone voice that turns heads from anyone who's within range of hearing it. Johnny for his part doesn't think much of his talents as a singer but Gabe Donozetti, Esme Prcy, an opera lover who after dis-barking from a Trans-Atlantic cruse ship on the London docks just happened to hear Johnny sing and is astounded that a talent like Johnny's has never been discovered! Since he's always out on the docks singing while he works for everyone to hear! Making Johnny an offer that he can't refuse Donozetti gets him to quit his job on the docks, that Johnny in fact loves very much,to become an opera singer making the kind of money that blue collar workers like himself, who's not all that crazy about cash, could only dream about! We get to see a very reluctant at first Johhny get the hang of being a world renowned and beloved opera singer and making tons of money but his feelings for his people back in Africa, on the off coast African island of Casanga, becomes more pronounced in that now with his both fame and money he can finally do something to better their lives. Johnny also had in his possession an ancient African medallion that indicated that he in fact comes from royal African blood making it even more sure that his'presences in far off Casanga Is needed in that he's the islands rightful and long lost king! ***SPOILERS from this point on*** Making the ultimate sacrifice by leaving western civilization for the backward Dark Continent of Africa Johnny at first isn't accepted by the Casanga natives feeling that he's just an out of town, or island, interloper trying to exploit them for his own greedy and selfish purposes. It's also the island witch doctor Endobo, Arthur Williams, who by feeling threatened in Johnny making a fool out of him and his quack medicine, which has already cost the lives of dozens of islanders, who got it in for Johnny and tried to get his fellow Casangaens to run him as his wife Ruth and good friend Monty,Robert Adams, out of Casanga or even go so far as kill them! The final showdown between Johnny and witch doctor Endobo comes when Johnny's about to give up his life to save his wife Ruth from being sacrificed to the ancient Casanga Gods that he starts to sing, or better yet belt out, the Casanga national anthem that only members of the Cosanga royal family would know! This song of freedom was always in Johnny's heart and soul, since birth, but he never was able to remember it until now! Just when his beloved and precious wife was about to be done it by the Casangan natives spurred on by the evil and soon to be discredited, in his fake and useless medical practices, medicine man Endobo! Now back in England and singing up a storm in all he opera houses in both Europe and America Johnny can use the millions he makes singing to help his people, in bringing them into what was then the 19th century, better their lives and throw off the ancient practices, like witch doctors, which held them back in the suffering and poverty that they lived under for so many years!",
         "This Hammer Studio, from London, England which is famous for its horror films surprised me with this great film from 1936 starring Paul Robeson, (John Zinga) who works as a London dock worker and sings songs all the time besides having a great bass voice for the opera and is discovered by a great opera director and producer from London, England. John is always wanting to go to Africa where he came from, but he does not know exactly where he was born, but he still remembers a song which he heard when he was very young. One day John happens to sing this song on stage in an opera performance and this song is recognized by an Englishman who tells him where it comes from and also a charm which John wears around his neck which helped determine its origin. John also has a wife and they both visit this Island and try to introduce themselves to these people and that is when the story gets very interesting. Don't miss this great film from the past, it is a gem in the rough. Enjoy",
         "In reviewing movies starring people of color in chronological order for Black History Month, we're now in 1936 when singer/actor Paul Robeson has one of his strongest roles yet on film. In this one, he's Johnny Zinga, a London dockworker whose constant singing during break time gets him the attention of impresario Gabriel Donozetti (Esme Percy) who offers him a chance to entertain in various concerts. He becomes successful but something pulls him back to his ancestral homeland in Africa and when someone confirms his heritage, he chucks his career to bring himself and his wife, Ruth (Elisabeth Welch) along with servant Monty (Robert Adams), there to claim his inherited royalty. But the native leader (James Solomon) there doubts him along with the rest of the tribe with the exception of Mandingo (Ecce Homo Toto). I'll stop there and just say this was dramatically satisfying from beginning to end and Robeson really carries the film on his own shoulders whether singing or reciting his lines. Ms. Welch herself has a nice singing voice as shown near the end. Some humor is also appreciated whenever Donozetti teaches some lessons to Johnny and since Monty is the same race as his superiors, his stereotypical antics is not as offensive as it would be with a Caucasian as his boss. So in summation, Song of Freedom is one of the most compelling films in Paul Robeson's career. P.S. One of his numbers is from the operatic version of \"The Emperor Jones\" as adopted musically by Louis Gruenberg. If you know about Mr. Robeson, you know his previous portrayal in the title role when it was originally a play and then later a movie."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "British Lion Films",
         "Hammer Film Productions"
      ],
      "summaries": ["A black British dockworker named Johnny Zinga becomes a famous singer and learns that he is the rightful king of the African island of Casanga."],
      "budget": 0
   },
   "movielensId": 3382,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1936-08-16",
      "dvdReleaseDate": "2000-02-29",
      "directors": ["J. Elder Wills"],
      "runtime": 80,
      "movieId": 3382,
      "title": "Song of Freedom",
      "mpaa": "",
      "actors": [
         "Paul Robeson",
         "Elisabeth Welch",
         "Esme Percy",
         "Robert Adams",
         "James Solomon",
         "Ecce Homo Toto",
         "Ronald Simpson",
         "George Mozart",
         "Jenny Dean",
         "Joan Fred Emney"
      ],
      "imdbMovieId": "0028282",
      "originalTitle": "Song of Freedom",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "John Zinga is a black dockworker in England in the 18th century, with a great baritone singing voice. He is discovered by an opera impresario, and is catapulted into great fame as an international opera star. Yet he feels alienated from his African past, and out of place in England. By chance, he is informed that an ancestral medallion that he wears is proof of his lineage to African kings, and he leaves fame and fortune to take his rightful place of royalty. Reunited with his people, he plans to improve their lives by combining the best of western technology with the best of traditional African ways.",
      "tmdbMovieId": 159727,
      "avgRating": 3.2,
      "releaseYear": "1936",
      "numRatings": 10,
      "posterPath": "/7ouV5n8NZFO8RiZHhaaNp3c2tR9.jpg"
   }
}