{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0028629",
      "video": false,
      "title": "Big Fella",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Joe",
               "gender": 2,
               "credit_id": "52fe4eecc3a36847f82b0ff7",
               "name": "Paul Robeson",
               "profile_path": "/7C2v4rYZcrdzAWMZNRWt9v7Owgb.jpg",
               "id": 98568,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Amanda 'Manda'",
               "gender": 1,
               "credit_id": "52fe4eecc3a36847f82b0ffb",
               "name": "Elisabeth Welch",
               "profile_path": "/nf2My6RNrmofh1tnevk1FpcYrIT.jpg",
               "id": 975135,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Spike",
               "gender": 2,
               "credit_id": "52fe4eecc3a36847f82b0fff",
               "name": "Roy Emerton",
               "profile_path": null,
               "id": 990435,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Chuck",
               "gender": 2,
               "credit_id": "52fe4eecc3a36847f82b1003",
               "name": "James Hayter",
               "profile_path": "/b3aczw5adgqvNv6uC4NHYWGDCGL.jpg",
               "id": 30769,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Corney",
               "gender": 2,
               "credit_id": "52fe4eecc3a36847f82b1007",
               "name": "Lawrence Brown",
               "profile_path": null,
               "id": 990436,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Gerald Oliphant",
               "gender": 0,
               "credit_id": "52fe4eecc3a36847f82b100b",
               "name": "Eldon Gorst",
               "profile_path": null,
               "id": 1015323,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Marietta",
               "gender": 0,
               "credit_id": "52fe4eecc3a36847f82b100f",
               "name": "Marcelle Rogez",
               "profile_path": null,
               "id": 1175222,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Ferdy Oliphant",
               "gender": 2,
               "credit_id": "52fe4eecc3a36847f82b1013",
               "name": "Eric Cowley",
               "profile_path": null,
               "id": 988034,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Mrs. Oliphant",
               "gender": 1,
               "credit_id": "52fe4eecc3a36847f82b1017",
               "name": "Joyce Kennedy",
               "profile_path": null,
               "id": 558275,
               "order": 8
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe4eecc3a36847f82b0ff3",
            "name": "J. Elder Wills",
            "profile_path": null,
            "id": 992802,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [],
      "popularity": 0.601101,
      "production_countries": [],
      "id": 244151,
      "vote_count": 1,
      "budget": 0,
      "overview": "In this musical comedy, Paul Robeson stars as Joe, a Marseilles docker hired by a wealthy English couple to find their missing son. When Joe finds him, he learns he escaped of his own will, and takes him to stay with a local singer. They offer him a refuge from his repressed white parents.",
      "similar": [],
      "original_title": "Big Fella",
      "runtime": null,
      "poster_path": "/v4D0tK3iTsvyoI60oCsIQ5QBMoT.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1937-07-17",
      "vote_average": 8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["J. Elder Wills"],
      "runtime": 73,
      "synopsis": "A wanderer (Paul Robeson) and his friend (Elisabeth Welch) shelter a runaway who doesn't wish to return to his parents.",
      "writers": [
         "Ingram D'Abbes",
         "Fenn Sherie"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0028629/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjIzMzQ0NTMwMF5BMl5BanBnXkFtZTgwNTAwMzQwMjE@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Paul Robeson, Elisabeth Welch, Roy Emerton | See full cast and crew »"],
      "reviews": [
         "This easy-going musical has two main things going for it. First and foremost, there's Paul Robeson singing five of the movie's songs with his rich baritone voice, always a great pleasure even when the songs aren't too memorable. And second is watching Paul Robeson act in his natural personable style. The plot, with the police asking him to help find a missing boy, was just an excuse to fill in time between songs. But I also enjoyed Elisabeth Welch singing two nice torch songs, and the comedy provided by some of the rest of the cast. A big surprise was seeing the great Margaret Rutherford in a small unbilled role, right at the start of her movie career.",
         "The great Paul Robeson sings several songs in this British comedy, but the plot and production values are so modest as to be almost nonexistent. \"Marseilles\" is clearly no further south than an English studio, and is full of cockneys. Robeson's character is asked by the police to help find a missing English boy (who, when he turns up, is such a brat with such a precious public-school accent that you want him to get himself lost again). He agrees and turns to leave, but the policemen point out that he will need to know what the boy looks like and give him a photograph! Why is Robeson, who was a brilliant student as well as a singer (he graduated from law school at the top of the class) portrayed as an idiot? The songs are lacklustre and lazy--\"scheming\" rhymes with \"dreaming,\" etc. and, when not singing them, Robeson, although nominally a waterfront worker, never does anything except sit on a barrel at the dock or drink in a café where Elisabeth Welch sings. It is delightful to see her at the beginning of her career, not only for her singing but her appealing, warm personality, but, again, the script is so simpleminded that she is not well used. All the characters just have one trait each, which they tiresomely display over and over, and the humour is elementary. One rough, tough character is ridiculed over and over for having a kitten that he cares for. What's so funny about that? When the boy is reunited with his parents, none of the issues that led to his running off is touched upon, much less resolved. But, but, but--there is Robeson, and when he sings, \"Oh, my baby, my curly-headed baby,\" you just melt. What a crime that one of the few film documents we have of this great man and his gorgeous voice is so feeble, but it is an even worse crime that America's racism prevented Robeson from having the memorials he deserved.",
         "After starring in Song of Freedom together, Paul Robeson and Elizabeth Welch reunited in this, Big Fella. They end up temporarily caring for a rich white kid (Eldon Gorst) who's run away from his parents because he feels stifled. I'll stop there and just say it's wonderful to once again hear both Robeson and Ms. Welch singing to their heart's content whenever they get the chance. I was partly amused by the plot and some of the interactions though this is probably the most trifle of Robeson's British movies. Good thing it's only an hour and 10 minutes. Since this is Black History Month, I have to note also the appearance of Lawrence Brown as one of Paul's friends. Oh, and also Paul's wife Eslanda as the café proprietor who gives him a tongue lashing at one point. Both previously appeared with him in Jericho. So on that note, Big Fella is worth a look.",
         "Paul Robeson was an amazing man. During an age when black men were, at best, second-rate, he managed to excel in so many ways--graduating from a top college at the top of his class, a four-letter man, aster of 20 languages, professional athlete, a lawyer and one of the greatest singers of his age. Considering how much he accomplished in the repressive early to mid-20th century, you wonder just how far he might have gone had he been born a half century later. While Robeson only made a few films, most of them are wonderful...though sadly \"Big Fella\" is not wonderful in any way except for the singing. Even the nice and seemingly effortless performance by Robeson and his amazing singing isn't enough to support this film--mostly because the plot sucks. It's obvious that the plot was secondary and was just an excuse to have him sing-often at the most bizarre times. But, considering how dumb the whole kidnapping plot was and how obnoxious the little jerk was, it was hard to care one bit about the film. On top of that, it was obvious that British Lion Films simply didn't care much about the production, as it was supposed to take place in Marseilles but practically everyone either has a strong American accent or British one. Aside from a few stock pieces of footage, it's pretty obvious this was made in a UK studio. A dumb plot, annoying and one-dimensional characters and low production values really sink this film. It's a shame and a film clearly beneath Robeson's immense talents."
      ],
      "genres": [
         "Drama",
         "Musical"
      ],
      "productionCompanies": [
         "Beaconsfield Productions",
         "Hammer Film Productions"
      ],
      "summaries": ["In this musical comedy, Paul Robeson stars as Joe, a Marseilles docker hired by a wealthy English couple to find their missing son. When Joe finds him, he learns he escaped of his own will, and takes him to stay with a local singer. They offer him a refuge from his repressed white parents."],
      "budget": 0
   },
   "movielensId": 3383,
   "movielens": {
      "languages": [""],
      "releaseDate": "1937-07-17",
      "dvdReleaseDate": "2000-02-29",
      "directors": ["J. Elder Wills"],
      "runtime": 0,
      "movieId": 3383,
      "title": "Big Fella",
      "mpaa": null,
      "actors": [
         "Paul Robeson",
         "Elisabeth Welch",
         "Roy Emerton",
         "James Hayter",
         "Lawrence Brown",
         "Eldon Gorst",
         "Marcelle Rogez",
         "Eric Cowley",
         "Joyce Kennedy"
      ],
      "imdbMovieId": "0028629",
      "originalTitle": "Big Fella",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "In this musical comedy, Paul Robeson stars as Joe, a Marseilles docker hired by a wealthy English couple to find their missing son. When Joe finds him, he learns he escaped of his own will, and takes him to stay with a local singer. They offer him a refuge from his repressed white parents.",
      "tmdbMovieId": 244151,
      "avgRating": 2.71429,
      "releaseYear": "1937",
      "numRatings": 7,
      "posterPath": "/v4D0tK3iTsvyoI60oCsIQ5QBMoT.jpg"
   }
}