{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "gambling",
            "id": 395
         },
         {
            "name": "cia",
            "id": 591
         },
         {
            "name": "asia",
            "id": 1293
         },
         {
            "name": "cold war",
            "id": 2106
         },
         {
            "name": "coca-cola",
            "id": 2107
         },
         {
            "name": "communist",
            "id": 2109
         },
         {
            "name": "naivety",
            "id": 2487
         },
         {
            "name": "thailand",
            "id": 3434
         },
         {
            "name": "bridge",
            "id": 3450
         },
         {
            "name": "product placement",
            "id": 3977
         },
         {
            "name": "village",
            "id": 5331
         },
         {
            "name": "spoiled child",
            "id": 7208
         },
         {
            "name": "yale university",
            "id": 9268
         },
         {
            "name": "wealth",
            "id": 10329
         },
         {
            "name": "wealthy",
            "id": 10910
         },
         {
            "name": "debt",
            "id": 11061
         },
         {
            "name": "brainwashing",
            "id": 12400
         },
         {
            "name": "communism",
            "id": 173644
         }
      ],
      "imdb_id": "tt0090274",
      "video": false,
      "title": "Volunteers",
      "recommendations": [
         29968,
         19357,
         10905,
         30653,
         14464,
         20242,
         28466,
         4988,
         55727,
         40506,
         37296,
         16814,
         19507,
         13343,
         36855,
         16471,
         27224,
         26555,
         14441,
         47070
      ],
      "backdrop_path": "/jZAOfaHYUjM4sBef7FkzOGpLXOq.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Lawrence Whatley Bourne III",
               "gender": 2,
               "credit_id": "52fe47ca9251416c750a58d9",
               "name": "Tom Hanks",
               "profile_path": "/pQFoyx7rp09CJTAb932F2g8Nlho.jpg",
               "id": 31,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Tom Tuttle",
               "gender": 2,
               "credit_id": "52fe47ca9251416c750a58dd",
               "name": "John Candy",
               "profile_path": "/a53ilUnwQ4q7sM0F0h14dbunKA7.jpg",
               "id": 7180,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Beth Wexler",
               "gender": 1,
               "credit_id": "52fe47ca9251416c750a58e1",
               "name": "Rita Wilson",
               "profile_path": "/jsIeIIzvirqMMCua4fA0ziRsRIs.jpg",
               "id": 12931,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "John Reynolds",
               "gender": 2,
               "credit_id": "52fe47ca9251416c750a58eb",
               "name": "Tim Thomerson",
               "profile_path": "/bh8TYtiz09sSen5seoVPdcsZ9SF.jpg",
               "id": 29712,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "At Toon",
               "gender": 2,
               "credit_id": "52fe47ca9251416c750a58ef",
               "name": "Gedde Watanabe",
               "profile_path": "/nyTEOm2sEMJONOp3oWFKUZuJNTv.jpg",
               "id": 16183,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Lawrence Bourne Jr.",
               "gender": 2,
               "credit_id": "52fe47ca9251416c750a58f3",
               "name": "George Plimpton",
               "profile_path": "/3FIC6GkFzf08XMvM3xREwINmwG5.jpg",
               "id": 95741,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Chung Mee",
               "gender": 2,
               "credit_id": "52fe47ca9251416c750a58f7",
               "name": "Ernest Harada",
               "profile_path": null,
               "id": 157456,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Albert Bardenaro",
               "gender": 2,
               "credit_id": "52fe47ca9251416c750a58fb",
               "name": "Allan Arbus",
               "profile_path": "/6DxLQ09V5YokE1l9rxTAIRbpmWQ.jpg",
               "id": 153619,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Kent Sutcliffe",
               "gender": 2,
               "credit_id": "52fe47ca9251416c750a58ff",
               "name": "Xander Berkeley",
               "profile_path": "/vlZ9FDMk2Xd1WHixPKxnheZoXgR.jpg",
               "id": 3982,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47ca9251416c750a58e7",
               "name": "Nicholas Meyer",
               "profile_path": "/942wEyuJVs1K0rGN2Q0ug2Yi7GE.jpg",
               "id": 1788,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe47ca9251416c750a5905",
               "name": "Keith Critchlow",
               "profile_path": null,
               "id": 95994,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "5839d50d9251416f300068c6",
               "name": "Ken Levine",
               "profile_path": null,
               "id": 1213770,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "571e520b9251416f2c0002f1",
               "name": "David Isaacs",
               "profile_path": null,
               "id": 1213771,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 4.142377,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 19259,
      "vote_count": 45,
      "budget": 0,
      "overview": "Lawrence is a rich kid with a bad accent and a large debt. After his father refuses to help him out, Lawrence escapes his angry debtors by jumping on a Peace Corp flight to Southeast Asia, where he is assigned to build a bridge for the local villagers with American-As-Apple-Pie WSU Grad Tom Tuttle and the beautiful and down-to earth Beth Wexler.",
      "similar": [
         826,
         27576,
         582,
         296098,
         1247,
         8012,
         294016,
         6538,
         1535,
         9080,
         4614,
         982,
         2575,
         2370,
         3086,
         430,
         309242,
         31439,
         13580,
         11578
      ],
      "original_title": "Volunteers",
      "runtime": 107,
      "poster_path": "/zJhrgKA3ThYQmu2faoD8UDU450n.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/rzgMLzPgJ2ZBYnlVwNi8ZDfOMwo.png",
         "name": "TriStar Pictures",
         "id": 559,
         "origin_country": ""
      }],
      "release_date": "1985-08-16",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "Ready or not, here they come.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Nicholas Meyer"],
      "runtime": 107,
      "synopsis": null,
      "writers": [
         "Keith Critchlow",
         "Ken Levine"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0090274/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY2MzAyMDY2MF5BMl5BanBnXkFtZTYwODY1NTU5._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Tom Hanks, John Candy, Rita Wilson | See full cast and crew »"],
      "reviews": [
         "before they started winning oscars, struggling actors such as tom hanks and robin williams used to be... SURPRISE!! funny! volunteers is a great example of a movie that refuses to take its leading actors seriously and is all the better for it. this is not a \"star vehicle\" but is rather an irreverant tongue-in-cheek romp. it takes its cues from saturday night live, sctv, monty python, and cheesy off-broadway one-act plays. in return, it is spoofed by one particular hollywood blockbuster to follow, austin powers goldmember. mike myers must have been as impressed with the \"reading the subtitles\" joke, as well as the \"asian guy on the toilet/being chased by sumo wrestler\" schtick. but rather than beat the jokes to death, volunteers assumes we are smart enough to catch them on the fly. i bought this in a $5.00 dvd bin, and was reminded why i liked the movie so much in the first place. it is never particularly mean to any of its subjects, including the primitive thai villagers, the communist revolutionaries, yalies, jews, liberals, conservatives, or any of the other fringe elements put into play. as a result, volunteers doesn't insult me as an intelligent movie viewer. by the way, i had forgotten how humorously effective was the \"lawrence's bar\" scene where the local musician plinks out an oddly romantic version of \"as time goes by\" on an asian sitar. volunteers is the sort of movie actors must do just for fun. y'know... when they're not too busy trying to win oscars.",
         "I don't see why this film has such a bad reputation, and is probably regarded as the worst in Tom Hanks' career. Sure, it's no \"Forrest Gump,\" but as a broad comedy it works out well. Hanks is passionate about every role he plays, and this case was no different. He's very funny as his snooty rich character. Adding to the comic relief are Gedde Watanabe (of \"Sixteen Candles\") and the always-funny John Candy. The plot is predictable, but there are many amusing moments. Plus, it's refreshing to see a comedy that's Rated R!!! Sure, it's no hard R, but nowadays filmmakers are so afraid to release comedies with R-ratings that it's not even funny--no pun intended. My score: 7 (out of 10)",
         "\"Volunteers\" successfully spoofs more classic films than any other - from Casablanca, through Bridge over the River Kwai, to Lawrence of Arabia, they're all there if you're watching carefully enough. It also offers a glimpse of a much younger, fresher and more natural Tom Hanks than the over-processed multi-millionaire product we see so much of today. Full of belly-laughs and quick fire one liners, and packed with so many more subtle references that you'll have to pay close attention and watch it many times to pick up even half of them, this hilarious film really does the job. The Austin Powers and Naked Gun series are almost the only others packing this much fast paced humour into a feature film. Highly recommended!",
         "Volunteers is a consistently underrated movie. I usually agree with the typical video guide reviews, but I fall out of bed on this one. Volunteers is a very funny, well written, well acted film. It is so packed with humour it reminds me of the old Mad Magazines with the jokes written in the margins. Some of the humour is rather subtle and the dialogue rolls right over it. If you're not paying attention, you might miss it. Tom Hanks is perfect as Lawrence Bourne III, the Ivy League cad. John Candy is at the top of his form as the brainwashed Tom Tuttle from Tacoma. Geddy Watanabe as the \"street smart\" Thai gives a performance on par with his Long Duc Dong of Sixteen Candles. And Rita Wilson is totally convincing as the idealistic Peace Corps volunteer out to teach the masses the advantages of Self-Styling Adorn. If you don't think the ratings are off on this one, I suggest this test. Watch Splash and Volunteers back to back and see which one you think is funnier. Both star Hanks and were made at about the same time. Splash was highly rated by the guides while Volunteers was given mediocre ratings. I think the ratings should be reversed.",
         "I was surprised to see Volunteers rate out at just a 5 on a scale of 10. But that rating is pretty consistent across all demographics, so maybe I'm just a sucker for Hanks and Candy. I *know* I'm a sucker for Rita Wilson. Still, I thought the movie offered several good laughs, solid performances from all the principal characters, and a feel-good ending. If nothing else, it should have taught you the words to Washington State University's fight song! If you haven't seen it, rent it with an open mind. It REALLY IS better than a 5.",
         "GREAT movie! One of the classics of the 80s! I love Tom Hanks & John Candy together--good foils-in fact, the two of them and Rita Wilson are a good example of very different personalities being forced to live and work together--we have all been there! And Gedde Watanabe (aka Long Duc Dong from \"Sixteen Candles\") is classic--he gets many of the best lines (\"What have we learned, Dorothy?\", etc). The subtitle gag was totally stolen by Mike Myers for his subsequent Wayne's World, the funny graphics/maps was stolen for EuroTrip (and many others)...it's just too amusing! And it's nice to find a comedy that has a sweet message too-this one fits the bill.",
         "It's been 15 years since I've seen this film, but still; Everytime I hear Tom Hanks name, it's the first thing to pop into my head. For those who have enjoyed Tom's more recent movies, it's a must see. You can really see the development in his career. For those who have never really been interested in any of Tom's more recent \"chick flicks\", this movie will show you the old Tom, before he realized that... well... Chick Flicks = Oscars and $$$. I'm surprised I don't see it more often on T.V. (but I guess Oscars=money, or is it time=money.... no... Opium=money and money=power.... or is it Opium=power and.... No.. Power=mon...) -=-Inside joke for those who've seen the movie-=-",
         "VOLUNTEERS was the second and last time Tom Hanks was teamed with one of the few television based comedians who could match him as a film actor: John Candy. They had been brothers in SPLASH, and VOLUNTEERS makes them fellow members of the Peace Corps. They proved to have good chemistry again here - but no follow-up film showed up for them after this. Pity, but maybe just as well as they each would make their own line of comic masterpieces. VOLUNTEERS is also one of the first times that Hanks plays a somewhat unlikeable (if charming) type. Lawrence Osborne IV is a patrician who has just gone through four years at Yale University. We never know what his major was, but he certainly has enjoyed extra-curriculum activities (such as dating the valedictorian of Smith College), and winning multi-thousand dollar poker matches with vicious opponents. But Lawrence owes a gambling hall owner (Alan Arbus) $14,000.00, and decides to bet it all double or nothing on the outcome of a basketball championship the next day (his graduation date from Yale). He is listening to the game on a radio (while missing the speech by guest speaker President John F. Kennedy) at the ceremony - and hears his bet going down the tubes. That night he asks his father (George Plimpton) for the $28,000. But the senior Osborne actually is very realistic - he feels that being beaten and injured for such a stupid bet is just what Lawrence needs, and he refuses to pay the bet. Chased by Arbus's bouncer/collector (Ji-Tu Cumbuku, as a no-nonsense collector who will go as far as possible to get Lawrence, whom he hates), Lawrence hies to New York's Idlewild Airport, and manages to get onto a plane as a member of the Peace Corps group going to Thailand. Lawrence meets Beth Wexler (Rita Wilson - now Mrs. Hanks in real life), a New York medical student, and Tom Tuttle from Tacoma, Washington (Candy) who is an intensive student of management psychiatry. Candy is also an engineer. When they are taken to a village for their service by helicopter operator John Reynolds (Tim Thompson) they find they are assigned to build a bridge connecting this village with the other shore. Soon it turns out that others are interested in that bridge: the local war lord and opium dealer (Chumg Mee - Ernest Harada) and the local Communists insurgents. While Lawrence tries to get back home (and finds his wise father has made it impossible for him to do so), he finds that he has annoyed Beth (who is more impressed by Reynolds), and he is dealing with the over-active and inept Tuttle. But soon Tuttle vanishes into the jungle (and into the hands of the Communists) while Lawrence finds he needs to rely on a smart local villager (Gedde Wantanabe) which is good because both men are threatened by the war lord to get that bridge built or else. What follows is a delight, as Lawrence does build the bridge, and then realizes (much as Col. Nicholson does at the end of THE BRIDGE ON THE RIVER KWAI) that it was a dreadful mistake, and the poor villagers are in danger from two evil groups as a result. Hanks never loses his charm and insouciance, even as he grows into a responsible local leader. Candy is a wonder as an would-be world saver, an over-achiever who insults people as he tries to show he has a heart. Wilson is good explaining how she wants to help the villagers, speaking in Thai - but telling how she wants to kill them! Wantanabe is constantly finding his warnings and realistic view of the situation is ignored and he gets injured as a result (or even sexually threatened by a trio of sumo-wrestler guards of the War Lord). And Thompson has only one really close friend - his knife. He makes George Macready's relationship with his sword stick in GILDA look matter-of-fact in comparison. Finally there is a definite love affair with David Lean in this film. Besides the similarities with THE RIVER KWAI (including Candy whistling \"Col. Bogie's March\" and saying, \"What have I done!\") there is the concluding shot of Hanks (having brought prosperity to the village) being cheered by the people with cries of \"Lawrence, Lawrence!\". Wonderful comedy here.",
         "Jocky Giles and I saw this on the plane out to America for a working summer, and we spent a lot of time in Montauk bars reliving the great moments from this film (and the book 'Money'). \"I think I put in the hours\" still gets the occasional outing, whilst Tom Tuttle from Tacoma Washington still enters my head whenever I see John Candy on TV, or even hear two T's together. I really hope Tom Hanks doesn't dislike this film \u0096 whilst it goes a bit chase-sequency at the end (as does Splash) the first half has so many gems in it to forgive the rest. Just as Hugh Grant is funniest and most watchable when he's a foul-mouthed cad, it would be good if Tom Hanks played a misanthropic but funny middle-aged man rather than just Tom, nice-but-dull. Give Bill Murray a run, or at least an audition, for his money. And if a film is going to be taken off his CV \u0096 please, the nauseating, unbearable Forrest Gump. Last line to Tim Thomerson. \"This is Mike. Mike's my knife\"",
         "One of the funniest movies you'll find in the 99 cent rental section. Probably one of the late John Candy's most hilarious roles and you can see glimpses of the great actor that Tom Hanks has become. This movie is an excellent spoof of several movies, most notably, The Bridge on the River Kwai. I highly recommend this movie to anyone looking an hour-and-a-half of belly laughs."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Home Box Office (HBO)",
         "Silver Screen Partners",
         "TriStar Pictures"
      ],
      "summaries": ["Lawrence is a rich kid with a bad accent and a large debt. After his father refuses to help him out, Lawrence escapes his angry debtors by jumping on a Peace Corp flight to Southeast Asia, where is assigned to build a bridge for the local villagers with American-As-Apple-Pie WSU Grad Tom Tuttle and the beautiful and down-to earth Beth Wexler. What they don't realize is that the bridge is coveted by the U.S. Army, a local Communist force, and a powerful drug lord. Together with the help of At Toon, the only English speaking native, they must fight off the three opposing forces and find out what is right for the villagers, as well as themselves."],
      "budget": 0
   },
   "movielensId": 3385,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1985-08-16",
      "dvdReleaseDate": "2000-02-29",
      "directors": ["Nicholas Meyer"],
      "runtime": 107,
      "movieId": 3385,
      "title": "Volunteers",
      "mpaa": "R",
      "actors": [
         "Tom Hanks",
         "John Candy",
         "Rita Wilson",
         "Tim Thomerson",
         "Gedde Watanabe",
         "George Plimpton",
         "Ernest Harada",
         "Allan Arbus",
         "Xander Berkeley"
      ],
      "imdbMovieId": "0090274",
      "originalTitle": "Volunteers",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Lawrence is a rich kid with a bad accent and a large debt. After his father refuses to help him out, Lawrence escapes his angry debtors by jumping on a Peace Corp flight to Southeast Asia, where he is assigned to build a bridge for the local villagers with American-As-Apple-Pie WSU Grad Tom Tuttle and the beautiful and down-to earth Beth Wexler.",
      "tmdbMovieId": 19259,
      "avgRating": 2.613,
      "releaseYear": "1985",
      "numRatings": 677,
      "posterPath": "/zJhrgKA3ThYQmu2faoD8UDU450n.jpg"
   }
}