{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "leave",
            "id": 4908
         },
         {
            "name": "fool",
            "id": 5090
         },
         {
            "name": "nymphomanin",
            "id": 9381
         },
         {
            "name": "disappearance",
            "id": 10941
         },
         {
            "name": "disguise",
            "id": 18118
         },
         {
            "name": "private detective",
            "id": 155790
         }
      ],
      "imdb_id": "tt0098645",
      "video": false,
      "title": "Who's Harry Crumb?",
      "recommendations": [
         2620,
         9080,
         14628,
         11933,
         9749,
         10442,
         14170,
         10169,
         11896,
         14361,
         10631,
         12521,
         10859,
         12395,
         11310,
         11584,
         11821,
         9941,
         19357,
         28117
      ],
      "backdrop_path": "/dPK3UCOrDqLWuTKKJssKxNHz0vA.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Harry Crumb",
               "gender": 2,
               "credit_id": "52fe447f9251416c75036f45",
               "name": "John Candy",
               "profile_path": "/a53ilUnwQ4q7sM0F0h14dbunKA7.jpg",
               "id": 7180,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Eliot Draisen",
               "gender": 2,
               "credit_id": "52fe447f9251416c75036f49",
               "name": "Jeffrey Jones",
               "profile_path": "/96J47E34mbjqnhiW9dbLuBqyqmD.jpg",
               "id": 4004,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Helen Downing",
               "gender": 1,
               "credit_id": "52fe447f9251416c75036f4d",
               "name": "Annie Potts",
               "profile_path": "/eryXT84RL41jHSJcMy4kS3u9y6w.jpg",
               "id": 8873,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Vince Barnes",
               "gender": 2,
               "credit_id": "52fe447f9251416c75036f51",
               "name": "Tim Thomerson",
               "profile_path": "/bh8TYtiz09sSen5seoVPdcsZ9SF.jpg",
               "id": 29712,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "P.J. Downing",
               "gender": 2,
               "credit_id": "52fe44809251416c75036f85",
               "name": "Barry Corbin",
               "profile_path": "/38AilHla20EFhEYAqoz6EzfsrQf.jpg",
               "id": 12852,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Nikki Downing",
               "gender": 1,
               "credit_id": "52fe44809251416c75036f89",
               "name": "Shawnee Smith",
               "profile_path": "/yx1HYEalFsiNVc2imDDfhIZthkn.jpg",
               "id": 2138,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Detective Casey",
               "gender": 1,
               "credit_id": "52fe44809251416c75036f8d",
               "name": "Valri Bromfield",
               "profile_path": "/aZXdGwca8YAbXXZkLVKB74KpiDg.jpg",
               "id": 113906,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Dwayne",
               "gender": 0,
               "credit_id": "52fe44809251416c75036f91",
               "name": "Doug Steckler",
               "profile_path": "/uLdL4oKtWlcf8jKqE9coLq0CFme.jpg",
               "id": 563701,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Jennifer Downing",
               "gender": 1,
               "credit_id": "52fe44809251416c75036f95",
               "name": "Renée Coleman",
               "profile_path": "/xYijq3A7e4ZQWrQrnP5IRiQcAJZ.jpg",
               "id": 138241,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Marie",
               "gender": 1,
               "credit_id": "52fe44809251416c75036f9d",
               "name": "Tamsin Kelsey",
               "profile_path": null,
               "id": 27115,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Doorman",
               "gender": 2,
               "credit_id": "52fe44809251416c75036fa1",
               "name": "Joe Flaherty",
               "profile_path": "/eQWzl4MazEkiaIsSuLIBBWB9zV9.jpg",
               "id": 59196,
               "order": 11
            },
            {
               "cast_id": 23,
               "character": "Mrs. MacIntyre",
               "gender": 1,
               "credit_id": "55db485692514143e4007ff6",
               "name": "Michele Goodger",
               "profile_path": null,
               "id": 1222736,
               "order": 12
            },
            {
               "cast_id": 22,
               "character": "Man on Bus",
               "gender": 2,
               "credit_id": "55a5b41ec3a3682bbd000453",
               "name": "Jim Belushi",
               "profile_path": "/AplV1ikSo3Zn93hhy5ht7Y7sQio.jpg",
               "id": 26485,
               "order": 13
            },
            {
               "cast_id": 24,
               "character": "Tim",
               "gender": 2,
               "credit_id": "56f57be99251415607000130",
               "name": "Wesley Mann",
               "profile_path": "/vpyCOtMgrp7q50MEpHnrDQ5TYrK.jpg",
               "id": 1214023,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe447f9251416c75036f57",
               "name": "Paul Flaherty",
               "profile_path": null,
               "id": 28169,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe447f9251416c75036f5d",
               "name": "Robert Conte",
               "profile_path": null,
               "id": 62680,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe447f9251416c75036f63",
               "name": "Peter Wortmann",
               "profile_path": null,
               "id": 62682,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44809251416c75036f69",
               "name": "John Candy",
               "profile_path": "/a53ilUnwQ4q7sM0F0h14dbunKA7.jpg",
               "id": 7180,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44809251416c75036f6f",
               "name": "Arnon Milchan",
               "profile_path": "/5crR5twLRcIdvRR06dB1O0EQ8x0.jpg",
               "id": 376,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44809251416c75036f75",
               "name": "Michel Colombier",
               "profile_path": null,
               "id": 35838,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44809251416c75036f7b",
               "name": "Stephen M. Katz",
               "profile_path": null,
               "id": 7183,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe44809251416c75036f81",
               "name": "Danford B. Greene",
               "profile_path": null,
               "id": 9797,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 6.61463,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11718,
      "vote_count": 90,
      "budget": 0,
      "overview": "Harry Crumb is a bumbling and inept private investigator who is hired to solve the kidnapping of a young heiress which he's not expected to solve because his employer is the mastermind behind the kidnapping.",
      "similar": [
         210577,
         963,
         2841,
         910,
         157825,
         8740,
         28256,
         47508,
         347995,
         44173,
         91554,
         105433,
         6603,
         469206,
         245838,
         497646,
         376839
      ],
      "original_title": "Who's Harry Crumb?",
      "runtime": 94,
      "poster_path": "/eimYRIjRCIi7k7RR8D9RtVakPl8.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Frostbacks",
            "id": 1175,
            "origin_country": ""
         },
         {
            "logo_path": "/rzgMLzPgJ2ZBYnlVwNi8ZDfOMwo.png",
            "name": "TriStar Pictures",
            "id": 559,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "NBC Productions",
            "id": 5253,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Arnon Milchan Productions",
            "id": 25087,
            "origin_country": ""
         }
      ],
      "release_date": "1989-02-03",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "Nerves of steel. Body of iron. Brain of stone.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Paul Flaherty"],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "Robert Conte",
         "Peter Wortmann"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0098645/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BODcwMTYzMzQ5Ml5BMl5BanBnXkFtZTcwNjI5MTkxMQ@@._V1_SY317_CR7,0,214,317_AL_.jpg",
      "actors": ["Stars: John Candy, Jeffrey Jones, Annie Potts | See full cast and crew »"],
      "reviews": [
         "One of my favorite comedies, Who's Harry Crumb is the story of a bumbling private detective played by John Candy, who uses a number of disguises throughout the film. Jeffrey Jones is excellent as Elliot Dreisen. A relatively clean movie, the comedy revolves around Harry and his earnestness and naivete you could say. A lot of viewers will laugh at Harry, but I laugh with him as he tracks down the kidnappers - and find them he will! A number of good lines, interesting dialogue, funny disguises, and cool cameos. Plus this movie actually makes Annie Potts a believable sex object. A very easy 10 for me!",
         "They had to take me to the emergency room; I was laughing so hard they thought I'd gone crazy. It turns out my brain was knocked out of joint by the hilarious gags--gags that should never have been funny to a reasonable person, but I wasn't trying to be reasonable at the time. Harry's asinine comments make him look like a real ass but he isn't. Once you get that, it's easy to get into the humor. That's John Candy's genius; his ability to humanize a variety of unlikely or impossible characters and make us love them even if we don't believe them. this is party because of the expressiveness of his face but also because of his indefinable comic spark. Harry Crump is a great comic impossibility. Don't watch it if you prefer to keep you dignity.",
         "If you're a fan of the late John Candy (as I am) you will most likely love this movie. Candy stars as Harry Crumb, a bumbling detective who comes from a line of great detectives. In his investigations, he uses a great many disguises (much like Chevy Chase in \"Fletch\"). Crumb is totally clueless, and Candy really takes a funny script and makes it even more funny. The movie doesn't take itself too seriously, and neither should the viewer. I give this a 9 out of 10 because it kept me laughing the whole way through.",
         "Simply hilarious. I think the reviewers that gave this movie bad rankings were pretty sour old men. This was a great movie the first time you watch it. After that, it gets dry (as most movies do). But the first time is what counts. And the first time I watched it I was a little lad with a broken leg from skiing stuck on the coach since I couldn't get up and was switching around and ended up with the movie and I could not stop laughing! I laughed so much I rebroke the bone, haha, no, not quite. But, I think you get the idea. John Candy is phenomenal. Though many of the comedy scenes are not entirely original they are done better than anyone else can do them by the late John Candy. Fun for the family ; ) Little kids won't understand alot of the dirty humor ; )",
         "This is one of the better John Candy movies out there, if that isn't damning with faint praise. It's not terrific, but it definitely will tickle your funny bone if you're in the right mood. The only real flaw is the soundtrack, which doesn't accentuate the humor enough. If you enjoy comedies about cute moronic characters who are too blind to see their own faults, you will love this.",
         "Well, having lived in 5 countries, understanding 4 kinds of humors and seen thousands of movies in three lingo, I can say that this movie is a good laugh! And nothing more as it was not created to be more. John Candy was an amazing guy in comedy because he could bring you from tears to laughs to thinking moments. His legacy is to take a good laugh and make life an easier one by understanding how to use the positivity to have a sense of humor! I have seen from Uncle Buck to Planes, trains and Automobiles, and John is talented. Even the series CAmp Candy as cartoons for the environment was putting the C in cool. After all, at least he did something about it...Do we? This movie is a must for a good slapstick and a no brainer: just what you need after a hard day work...",
         "John Candy's best film, by far. Granted, he's been in such classics like Uncle Buck, Planes, Trains and Automobiles, and Little Shop of Horrors, but this is a film where he had to completely stand alone as THE MAN. Campy, fun and entertaining, this film is a great find for anyone who loves old-school comedies. As for those who like American Pie and There's Something About Mary, its best you go back under your rocks.",
         "'Who's Harry Crumb?' is by far one of my favourite movies. What can I say. John's in it. Doesn't that say it all? John plays Harry Crumb, a terrible private investigator, who gets called up to the head office to investigate a kidnapping case. He gladly accepts not knowing that *SPOILER* his boss is the baddie. The rest of the movie is about an inept John barking up the wrong tree with the help of the kidnappee's sister Shawnee Smith, the loveable dimwit secretary from the popular comedy 'Becker'. His investigations are accompanied with an array of idiotic disguises. My personal favourite is *POSSIBLE SPOILER* his giddup of Indian cleaner. Especially the bit where someone punches him and he ends up apologising: 'I'm sorry sahib for my face hitting your fist...' whahahahaha. And what about the bit where he goes to a beauty parlor and manages to misplace his chest hair on a woman's private parts. Priceless. The movie is funny, has a decent story line and great supporting characters. But let's face it... 'Who's Harry Crumb?' John Candy is Harry Crumb. Watch it if you like Candy. Watch it if you like a good 'screwball' comedy. Watch it if you don't expect sophistication. In fact, just watch it. *****/5 stars",
         "This was Candy's attempt in the Peter Sellers venue. Had this movie hit, there would, no doubt, have been a movie franchise involving the bumbling master of disguises. Unfortunately, in comparison to \"Planes, Trains, and Automobiles\" of 1984, \"Uncle Buck\" of the same year as this one (1989) and \"The Great Outdoors\" (1988), this movie was considered to be far below par. However, in retrospect (which does not in any way help Mr. Candy at this time), his attempt was an honest one. I laugh every time I watch this movie. I can say that about very few films. Annie Potts is beautifully cast as the money-hungry, sex-crazed nymphomaniac; Tim Thomerson of \"Cherry 2000\" was great as the idiot you love to take advantage of; and Jeffrey Jones of \"Howard the Duck\" was beautiful as the conniving, hard-hearted megalomaniac; but it was Shawnee Smith who stole the show. She's done other films such as Stephen King's \"The Shining,\" (TV version), \"The Stand,\" \"Armageddon\" and about 25 more, or so. She was excellently cast, and her performance was completely endearing. This movie is about 1,000 times better than the recently ill-fated \"Master of Disguise,\" but it just did not rise to Peter Sellers's caliber. Sorry John. But it didn't. Gods, I miss Candy's talent. I wish he could have lived to be 100. This movie rates a 7.3/10 from... the Fiend :.",
         "'Who's Harry Crumb' rests on the shoulders of the brilliant John Candy. The late comedy legend rules the show, with a lovable, hilarious performance, that appeals entirely. 'Who's Harry Crumb' Synopsis: Harry Crumb is a bumbling and inept private investigator who is hired to solve the kidnapping of a young heiress which he's not expected to solve because his employer is the mastermind behind the kidnapping. 'Who's Harry Crumb' is funny in parts. Some jokes are silly, some laugh-out-loud funny & some are pretty lame. But, in totality, the humor works for its targeted audience - the kids & the kids at heart. Its a passable one-time watch. The Screenplay is flawed, but some memorable moments do the trick. Paul Flaherty's Direction is decent. Cinematography is standard. Editing & Art Design are okay. Performance-Wise: Its John Candy all the way. As Harry Crumb, the late comedy legend doesn't miss a beat & delivers in every sequence. He's the soul of the film. Amongst the supporting cast, Jeffrey Jones is terrific. On the whole, 'Who's Harry Crumb' is a must for John Candy Fans."
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Mystery"
      ],
      "productionCompanies": [
         "TriStar Pictures",
         "NBC Productions",
         "Arnon Milchan Productions"
      ],
      "summaries": [
         "Harry is the latest generation of the Crumbs, famous and extremely talented detectives. Unfortunately talent seems to have skipped a generation and Harry is reduced to \"gumshoe\" work at a remote branch of the Crumb detective agency. Back at headquarters, Crumb executive Elliot Draison hatches an evil plan which requires the inclusion of an incompetent detective. With Harry Crumb on the case Draison thinks everything will run fine for him. Despite his best efforts Crumb actually makes some headway in the case...",
         "Harry Crumb is a bumbling and inept private investigator who is hired to solve the kidnapping of a young heiress which he's not expected to solve because his employer is the mastermind behind the kidnapping."
      ],
      "budget": 0
   },
   "movielensId": 3387,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1989-02-03",
      "dvdReleaseDate": "2000-03-07",
      "directors": ["Paul Flaherty"],
      "runtime": 94,
      "movieId": 3387,
      "title": "Who's Harry Crumb?",
      "mpaa": "PG-13",
      "actors": [
         "John Candy",
         "Jeffrey Jones",
         "Annie Potts",
         "Tim Thomerson",
         "Barry Corbin",
         "Shawnee Smith",
         "Valri Bromfield",
         "Doug Steckler",
         "Renée Coleman",
         "Tamsin Kelsey",
         "Joe Flaherty",
         "Michele Goodger",
         "Jim Belushi",
         "Wesley Mann"
      ],
      "imdbMovieId": "0098645",
      "originalTitle": "Who's Harry Crumb?",
      "genres": [
         "Comedy",
         "Crime",
         "Mystery"
      ],
      "youtubeTrailerIds": ["UM6-VeQ_KPk"],
      "plotSummary": "Harry Crumb is a bumbling and inept private investigator who is hired to solve the kidnapping of a young heiress which he's not expected to solve because his employer is the mastermind behind the kidnapping.",
      "tmdbMovieId": 11718,
      "avgRating": 2.7308,
      "releaseYear": "1989",
      "numRatings": 1159,
      "posterPath": "/eimYRIjRCIi7k7RR8D9RtVakPl8.jpg"
   }
}