{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "bad smell",
            "id": 1866
         },
         {
            "name": "bigfoot",
            "id": 2597
         },
         {
            "name": "vegetarian",
            "id": 4459
         },
         {
            "name": "hamburger",
            "id": 6746
         },
         {
            "name": "hunting trip",
            "id": 9721
         },
         {
            "name": "wildlife",
            "id": 9902
         },
         {
            "name": "cryptozoology",
            "id": 11220
         },
         {
            "name": "family",
            "id": 18035
         },
         {
            "name": "family holiday",
            "id": 33694
         },
         {
            "name": "footprint",
            "id": 170014
         },
         {
            "name": "french canadian",
            "id": 179368
         },
         {
            "name": "sasquatch",
            "id": 210214
         }
      ],
      "imdb_id": "tt0093148",
      "video": false,
      "title": "Harry and the Hendersons",
      "recommendations": [
         10859,
         2617,
         14367,
         1406,
         11630,
         12154,
         11584,
         10019,
         11814,
         11821,
         2619,
         11896,
         9080,
         26603,
         10276,
         11310,
         10466,
         2616,
         1552,
         8873
      ],
      "backdrop_path": "/zpLxlU7tZ3wnAKudHOlhuluR5nm.jpg",
      "revenue": 49998613,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "George Henderson",
               "gender": 2,
               "credit_id": "52fe44cfc3a36847f80ab43d",
               "name": "John Lithgow",
               "profile_path": "/uquz3dZ0fs0lAK57lCXwxaslVkb.jpg",
               "id": 12074,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Nancy Henderson",
               "gender": 1,
               "credit_id": "52fe44cfc3a36847f80ab441",
               "name": "Melinda Dillon",
               "profile_path": "/f4DU3lNCJqNVgwDZmHMlNV96rKV.jpg",
               "id": 4778,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Sarah Henderson",
               "gender": 1,
               "credit_id": "52fe44cfc3a36847f80ab445",
               "name": "Margaret Langrick",
               "profile_path": "/g6oSxhetFIRIXbCfNK1cE1cpwXX.jpg",
               "id": 56509,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Ernie Henderson",
               "gender": 2,
               "credit_id": "52fe44cfc3a36847f80ab449",
               "name": "Joshua Rudoy",
               "profile_path": "/vewmKAjxWHJbI9IbypOCKGwK2br.jpg",
               "id": 56510,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Harry",
               "gender": 2,
               "credit_id": "52fe44cfc3a36847f80ab44d",
               "name": "Kevin Peter Hall",
               "profile_path": "/9FnpE1Z6zeE4EEIn1J6vYR1xcqk.jpg",
               "id": 1109,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Jacques Lafleur",
               "gender": 2,
               "credit_id": "52fe44cfc3a36847f80ab457",
               "name": "David Suchet",
               "profile_path": "/4X4TT8Uf8mAmRIYgYh4EeR4mWva.jpg",
               "id": 20277,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Irene Moffitt",
               "gender": 1,
               "credit_id": "52fe44cfc3a36847f80ab45b",
               "name": "Lainie Kazan",
               "profile_path": "/qI20obSkCyWbo13xh20rWeUuMXp.jpg",
               "id": 53647,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Dr. Wallace Wrightwood",
               "gender": 2,
               "credit_id": "52fe44cfc3a36847f80ab45f",
               "name": "Don Ameche",
               "profile_path": "/q4t9dds6jQuuqpMLvALbOqVJRFV.jpg",
               "id": 18156,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "George Henderson Sr.",
               "gender": 2,
               "credit_id": "52fe44cfc3a36847f80ab463",
               "name": "M. Emmet Walsh",
               "profile_path": "/dLf79xlsmE40rog0gryjxsZJzml.jpg",
               "id": 588,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "'Mouse' Woman",
               "gender": 0,
               "credit_id": "52fe44cfc3a36847f80ab473",
               "name": "Laura Kenny",
               "profile_path": "/nSKGdbGXTM21odLcQNzZhsxRpfE.jpg",
               "id": 163002,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Sgt. Mancini",
               "gender": 0,
               "credit_id": "52fe44cfc3a36847f80ab467",
               "name": "Bill Ontiverous",
               "profile_path": null,
               "id": 1075118,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Dirty Harry Officer",
               "gender": 0,
               "credit_id": "52fe44cfc3a36847f80ab46b",
               "name": "David Richardt",
               "profile_path": null,
               "id": 1075119,
               "order": 11
            },
            {
               "cast_id": 19,
               "character": "DMV Clerk",
               "gender": 0,
               "credit_id": "52fe44cfc3a36847f80ab46f",
               "name": "Jacqueline Moscou",
               "profile_path": null,
               "id": 1075120,
               "order": 12
            },
            {
               "cast_id": 21,
               "character": "'Mouse' Spouse",
               "gender": 0,
               "credit_id": "52fe44cfc3a36847f80ab477",
               "name": "Richard Arnold",
               "profile_path": null,
               "id": 207722,
               "order": 13
            },
            {
               "cast_id": 22,
               "character": "Jerry Seville",
               "gender": 2,
               "credit_id": "52fe44cfc3a36847f80ab47b",
               "name": "Sean Morgan",
               "profile_path": null,
               "id": 161673,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44cfc3a36847f80ab41b",
               "name": "William Dear",
               "profile_path": "/zd7BF2zZTarjru9K4Rwgw6CMFZW.jpg",
               "id": 56506,
               "department": "Production",
               "job": "Finance"
            },
            {
               "gender": 2,
               "credit_id": "52fe44cfc3a36847f80ab421",
               "name": "William Dear",
               "profile_path": "/zd7BF2zZTarjru9K4Rwgw6CMFZW.jpg",
               "id": 56506,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe44cfc3a36847f80ab427",
               "name": "Bill Martin",
               "profile_path": null,
               "id": 56507,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe44cfc3a36847f80ab42d",
               "name": "Bruce Broughton",
               "profile_path": null,
               "id": 20897,
               "department": "Crew",
               "job": "Compositors"
            },
            {
               "gender": 2,
               "credit_id": "52fe44cfc3a36847f80ab433",
               "name": "Allen Daviau",
               "profile_path": null,
               "id": 9965,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe44cfc3a36847f80ab439",
               "name": "George Koblasa",
               "profile_path": null,
               "id": 56508,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44cfc3a36847f80ab453",
               "name": "William Dear",
               "profile_path": "/zd7BF2zZTarjru9K4Rwgw6CMFZW.jpg",
               "id": 56506,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5727ef33c3a3682dee001b1d",
               "name": "Richard Vane",
               "profile_path": null,
               "id": 52042,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 6.327074,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 8989,
      "vote_count": 203,
      "budget": 0,
      "overview": "Returning from a hunting trip in the forest, the Henderson family's car hits an animal in the road. At first they fear it was a man, but when they examine the \"body\" they find it's a \"bigfoot\". They think it's dead so they decide to take it home (there could be some money in this). As you guessed, it isn't dead. Far from being the ferocious monster they fear \"Harry\" to be, he's a friendly giant.",
      "similar": [
         46146,
         185460,
         487283,
         15250,
         435007,
         1842,
         2989,
         54112,
         428,
         483755,
         285225,
         49353,
         321478,
         43753,
         248670,
         458138,
         418947,
         338343,
         93950,
         383664
      ],
      "original_title": "Harry and the Hendersons",
      "runtime": 110,
      "poster_path": "/mhpajPCVjE3y4wgDLichDF5Peq8.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/mpGWkDeikYLeAR8LVNaixig0vwE.png",
            "name": "Amblin Entertainment",
            "id": 56,
            "origin_country": "US"
         },
         {
            "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
            "name": "Universal Pictures",
            "id": 33,
            "origin_country": "US"
         }
      ],
      "release_date": "1987-06-05",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "When You Can't Believe Your Eyes, Trust Your Heart.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["William Dear"],
      "runtime": 110,
      "synopsis": null,
      "writers": [
         "William Dear",
         "Bill Martin"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0093148/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjIzNjA3MTE3OF5BMl5BanBnXkFtZTgwMjkzNTcxMTE@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: John Lithgow, Melinda Dillon, Margaret Langrick | See full cast and crew »"],
      "reviews": [
         "I used to dislike this film. I disliked the mushiness, the story and even the sad parts. This movie was stuck on the shelf, covered in dust, forgotten. Only days ago I pulled this movie out and decided to sit down and watch it, expecting the same mushy film that I saw years and years ago. However, as I have gotten older I have a greater understanding of what this film offers me and people alike. In fact, it touched me so much to see how something that is often portrayed as scary was so gentle and caring. From the introduction when Harry is first discovered (in a rather unfortunate way) to the end of the movie, the Hendersons learn that Harry is more human than they ever thought, and that he has a bigger heart than the human race combined. Throughout the film, the effect that Harry has on people's lives is always seen. We as humans are so receptive to myth, legend and rumours. Yet, before the truth is given a chance to be known, we block our ears, close our eyes and run away. The Hendersons, Jacques LeFleur -a hunter who has followed his trail for 25 years and Dr Wrightwood -a man whose life has been ruined by his dedication towards the study of Sasquatch, all gain a new perspective on life, as well as a new respect. Their original feelings of the \"Beast\" all quashed swiftly to realize that inside of it lay a big heart. Harry's compassion, love for other beings and respect for life made this film an absolute delight to watch. I whole heartedly recommend this for anybody looking for a family film that not only warms the heart, but also teaches a lesson of who is really the monster on Earth.",
         "You will fall in love with Harry and wish that Bigfoot / Sasquatch was real. A funny, endearing movie! There are several messages along the way: 1) Some humans are more beastly than animals; 2) Forgiveness is a powerful healer; and 3) Protect the wilderness, for it contains many wonderful things that are not always apparent to us. This movie is a family favorite!",
         "Harry and the Hendersons is one of the first films I remember seeing in the cinema as a kid. It was 1987 and my uncle had just passed his driving test so he was well into driving places and the cinema just happened to be one of them. Even though the film is only 110 minutes long, they still had an intermission halfway through, for some reason. And I swear, they actually had ushers coming round selling stuff before it started back up again. I believe that is the first and only time I have seen such old-fashioned picturehouse practices. But it makes my original memory of this film so much more nostalgic. The Hendersons consist of wannabe artist/gun salesman dad George (that always brilliant John Lithgow), loving mum Melinda Dillon, a bratty daughter and a hyperactive son. On returning from a camping trip in the Pacific Northwest, they accidentally run into some sort of large furry creature on the forest road. Originally believing it to be a bear, George steps out of the car to prod it with his gun a few times. But the bear has man-like hands and George suddenly asks his family 'What if it's...HIM'. Bigfoot! Think of how much he's worth! So they tie him to the roof of the car and drive him home, while George thinks of the best way of selling him. Later that night, he is curious as to how big his feet really are. So he sneaks down to the garage with a measuring tape only to find that he's no longer strapped to the roof of the car, but poking around in the kitchen fridge. The Hendersons stand back as bigfoot (or Harry as he is later renamed) stomps around the house and garden investigating all their strange belongings. Though he doesn't care much for all the animal trophies hanging around everywhere. Freaking out, George tries to snipe Harry from through the bedroom window, but has a change of heart when he realises that Harry is just big, harmless oaf. The best scenes of the film involve Harry making himself at home in the Henderson house. His mannerisms and body language are similar to a child warned to be on their best behavior while visiting old relatives. He constantly looks a bit nervous and uncomfortable but is always ready to grab you for a big hug. Rick Baker deservedly took home an Academy Award for Best Make-Up Effects back in 1988 for this movie. Harry Henderson is an amazing character with a wonderfully wide range of expressions and emotions. All E.T. ever did was sit there looking bug-eyed. Not Harry though, you can't help loving him. I so want my own Bigfoot. Even now as an adult I think this movie is still great. As a kid I remember feeling the panic and excitement when Harry got lost in Seattle and the half-crazed Bigfoot hunter Jacques LaFleur (David Suchet) doing lots of sleaziness in order to have him shot, gutted and sold to science. Forgive the repeated comparison, but to me it was more involving and fun than the man with the keys in E.T. You just don't get family movies like this anymore. Back in the 80's Steven Spielberg's Amblin production company made loads of great family movies like Gremlins, Goonies, the Back to the Future Trilogy, Young Sherlock Holmes and Innerspace. They all had some kind high-concept spin that crud such as Like Mike and Crapper by the Dozen don't. It was a great time to be a kid back in those days. We weren't cynical and jaded and hooked on Playstation like modern children. We still had a sense of adventure, a longing for the outdoors. Anything could be out there. Maybe Harry is actually bumbling around in the woods as I write this. Like the Patterson/Gimlin film that inspired it, Harry and the Hendersons is one movie that will be timeless forever.",
         "I've been looking for this movie forever on DVD, my copy on tape is long gone and I hate watching the cut version when it is shown on TV. I was so addicted to this movie as a kid, when our TV broke, I plugged headphones into the VCR so I could hear it. Whats sad is I watched it so many times that I didn't mind that there was no picture, I still knew what was happening because I watched it a least 60 times beforehand. I'm so happy its finally coming out on DVD because I have a kiddo on the way and I can't wait till they are old enough to watch it with me. If you have kids and want to watch a movie everyone will like this is a definite buy. It will be watched over and over and your kids will never get tired of it, which could possibly be a bad thing. I hope this was helpful, I tried not to mention anything about the plot because it best to watch it and form your own opinion.",
         "\"Harry\" a bigfoot, unintentionally becomes part of the Henderson family as they try to figure out what to do with a 500 lb. 'thing' they soon discover is more human than animal. You'll cry with laughter while Harry makes himself comfortable in the Henderson's undersized house (for him). And, by the end of the movie, you'll just plain cry as the family struggles with the tough choice between keeping Harry safe from his hunters and the world-at-large, and sending him back into the wild.",
         "An unlikely creature touches the hearts of a family in this underrated beauty. John Lithgow, Melinda Dillon and the rest of the cast all fit their characters perfectly. A wonderful chemistry of happy moments, sad moments and funny moments. The conclusion is both heartbreaking and heartwarming \u0097 not your typical family-film ending, but too perfect to be rewritten. The beautiful scenery of Washington State and the costume design are also to be admired. Joe Cocker's \"Love Lives On\" is the perfect song for this film's end credits. Followed by an inferior television series of the same name. **** (out of four)",
         "I really love this movie! It's one of the best I've seen in a long time. I'm sure I'll watch it over and over. To me the best movies are movies that make you laugh and make you cry. \"Harry\" is a classic family show, one I'll save for the grandchildren. My children love it as much as I do. John Lithgow gives one of his many excellent performances. I also love \"Third Rock\". Harry is good, too. His facial expressions are great! It would be wonderful to see a sequel to \"Harry\". Something with Harry and his family hosting a human? I recommend this movie to anyone with children. It's just as good as \"E.T.\"",
         "It's hard to find a good \"all around\" family movie. If it's something the kid will like, best bet, the parents will hate it. And if it's something mom and dad like, the kids will hate it. Harry and the Hendersons is one of the few family movies that the entire family enjoys! With a PG rating, the movie has just enough action, drama, suspense, and comedy to keep each member of the family interested. An interesting fact: The only character who curses in the entire film is the little boy? Except for hearing the word sh*t two or three times, the rest of the movie is clean for the whole family to enjoy.",
         "WE happened to catch this movie again on the PAX channel and start getting completely captivated once again by its funny scenes, and Harrys reaction to everything he encounters, from the family to the things in the house and its eventual feel good conclusion! I think one of the most touching scenes is when he encounters a deer head mounted on the wall and knocks out a hole in the wall to look for the hind part of the deer.......makes one wonder why people like to hunt in the first place, especially seeing it from Harry's perspective.......well, sit back and enjoy the movie, you will be glad you did, and have a kid or two with you..........OK? shar from oHIo........",
         "Ever since I was a kid, I've loved this movie! It has a great storyline, hilarious and tender moments. You fall in love with Harry because he is so adorable, lovable, and awesome! While on a hunting trip, the Hendersons run into a Bigfoot. When they think he's dead, they put him on the roof of the car. During the night, George Henderson wakes up and finds that Bigfoot is still alive. After a while, the family come to realize that he's gentle, and harmless, so they name him Harry. While the whole town is on the hunt for Harry, the Henderons must take Harry take to back to his home in the wilderness. I love when Harry laughs at the TV, and when George is on the news saying \"My name is George Hen.\" I highly recommend HARRY AND THE HENDERSONS!!!"
      ],
      "genres": [
         "Comedy",
         "Family",
         "Fantasy"
      ],
      "productionCompanies": [
         "Amblin Entertainment",
         "Universal Pictures"
      ],
      "summaries": ["Returning from a hunting trip in the forest, the Henderson family's car hits an animal in the road. At first they fear it was a man, but when they examine the \"body\" they find it's a \"bigfoot\". They think it's dead so they decide to take it home (there could be some money in this..). As you guessed, \"it\" isn't dead. Far from being the ferocious monster they fear \"Harry\" to be, he's a friendly giant. In their attempts to keep Harry a secret, the Henderson's have to hide him from the authorities and a man, who has made it his goal in life, to catch a \"bigfoot\"."],
      "budget": 0
   },
   "movielensId": 3388,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1987-06-05",
      "dvdReleaseDate": "2007-04-24",
      "directors": ["William Dear"],
      "runtime": 110,
      "movieId": 3388,
      "title": "Harry and the Hendersons",
      "mpaa": "PG",
      "actors": [
         "John Lithgow",
         "Melinda Dillon",
         "Margaret Langrick",
         "Joshua Rudoy",
         "Kevin Peter Hall",
         "David Suchet",
         "Lainie Kazan",
         "Don Ameche",
         "M. Emmet Walsh",
         "Laura Kenny",
         "Bill Ontiverous",
         "David Richardt",
         "Jacqueline Moscou",
         "Richard Arnold",
         "Sean Morgan"
      ],
      "imdbMovieId": "0093148",
      "originalTitle": "Harry and the Hendersons",
      "genres": [
         "Comedy",
         "Family",
         "Fantasy"
      ],
      "youtubeTrailerIds": ["5DOX1Poxro4"],
      "plotSummary": "Returning from a hunting trip in the forest, the Henderson family's car hits an animal in the road. At first they fear it was a man, but when they examine the \"body\" they find it's a \"bigfoot\". They think it's dead so they decide to take it home (there could be some money in this). As you guessed, it isn't dead. Far from being the ferocious monster they fear \"Harry\" to be, he's a friendly giant.",
      "tmdbMovieId": 8989,
      "avgRating": 2.69918,
      "releaseYear": "1987",
      "numRatings": 2194,
      "posterPath": "/mhpajPCVjE3y4wgDLichDF5Peq8.jpg"
   }
}