{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "rescue operation",
         "id": 222529
      }],
      "imdb_id": "tt0091400",
      "video": false,
      "title": "Let's Get Harry",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Corey",
               "gender": 2,
               "credit_id": "55023d04925141275c0033f3",
               "name": "Michael Schoeffling",
               "profile_path": "/dNtopMh1iPU2tcLgAqHX0jvG7oj.jpg",
               "id": 140777,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "Norman Shrike",
               "gender": 2,
               "credit_id": "55023d1fc3a3685bab00370e",
               "name": "Robert Duvall",
               "profile_path": "/1aBC7NxPy10ofng6HsJBecJ1vMZ.jpg",
               "id": 3087,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "Jack",
               "gender": 2,
               "credit_id": "55023d34c3a3685ba6003c65",
               "name": "Gary Busey",
               "profile_path": "/n66ycv61ZoqusHthcQde1g3JY6T.jpg",
               "id": 2048,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "Harry Burck Jr.",
               "gender": 2,
               "credit_id": "55023d8e9251414ea6001a06",
               "name": "Mark Harmon",
               "profile_path": "/vzthrZ2QidVi1iMMOYFzAohhVpj.jpg",
               "id": 19728,
               "order": 4
            },
            {
               "cast_id": 4,
               "character": "Bob",
               "gender": 2,
               "credit_id": "55023db59251414ea6001a0b",
               "name": "Thomas F. Wilson",
               "profile_path": "/n5Vk17hmXW5OqltDYH3i0qOTHcZ.jpg",
               "id": 1065,
               "order": 5
            },
            {
               "cast_id": 5,
               "character": "Walt Clayton",
               "gender": 2,
               "credit_id": "55023dcf9251413da8003c2f",
               "name": "Matt Clark",
               "profile_path": "/aG7tC3jOI42OgtCxGiejbhFj1DW.jpg",
               "id": 2454,
               "order": 6
            },
            {
               "cast_id": 6,
               "character": "Kurt",
               "gender": 0,
               "credit_id": "55023e069251414ea6001a17",
               "name": "Rick Rossovich",
               "profile_path": "/f2bFBUT1WRImsKVkSq7A3yACFAa.jpg",
               "id": 2717,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "55023e269251413da8003c38",
               "name": "Stuart Rosenberg",
               "profile_path": null,
               "id": 13859,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "55023e3692514174f600027c",
               "name": "Alan Smithee",
               "profile_path": null,
               "id": 55948,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         }
      ],
      "popularity": 1.531912,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 32031,
      "vote_count": 4,
      "budget": 0,
      "overview": "Harry Burck has been kidnapped by South American terrorists, and when the US Government refuses to intervene, Harry's friends decide to take matters into their own hands!",
      "similar": [
         855,
         254128,
         326425,
         8063,
         31671,
         31690,
         176049,
         109008
      ],
      "original_title": "Let's Get Harry",
      "runtime": 102,
      "poster_path": "/dqamQcX3Jo3TYLaDyNV1lt01cUy.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/rzgMLzPgJ2ZBYnlVwNi8ZDfOMwo.png",
         "name": "TriStar Pictures",
         "id": 559,
         "origin_country": ""
      }],
      "release_date": "1986-01-01",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "An adventure about the hero in all of us",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Stuart Rosenberg"],
      "runtime": 102,
      "synopsis": null,
      "writers": [
         "Mark Feldberg",
         "Samuel Fuller"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0091400/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMwOTYyOTk4M15BMl5BanBnXkFtZTcwNzE1NDAxMw@@._V1_SY317_CR12,0,214,317_AL_.jpg",
      "actors": ["Stars: Michael Schoeffling, Thomas F. Wilson, Fidel Abrego | See full cast and crew »"],
      "reviews": [
         "I was Robert Duvall's character coach or model in Harry. He attended my training camp in Alabama in September 1985 before going on down to Vera Cruz Mexico for the location filming. The major problem with the film was the director(s) and the editing. The actual script wasn't bad. One director quit, and the finishing director cut so much from the film that Duvall tried to keep it from being released, and the director ended up having his own name removed from the film and \"Alan Smithee\" (a name used to protect the guilty) credited as director. Virtually all of the training scenes were cut where the plumbers become commandos, and the character development went with it. Duvall wanted to make a good movie. The script called for his character to give a dying speech after getting shot. When he and I went over the scene, I told him after getting hit the way he was supposed to, he wouldn't be able to say anything. He played it that way. When I finally saw the film, I was surprised to discover that not only had Duvall followed my advice on how to dress, etc., but that he had adopted my own personal mannerisms and way of talking. He never said anything about doing that. I was disappointed in the final release, even more than most viewers. I know what's missing. Frank Camper",
         "Let's Get Harry is an excellent action movie, as far as low-budget, throwaway action movies go. Don't expect state-of-the-art special effects, a deep and meaningful plot, or Oscar-winning performances by any of the stars (however, it should be noted that Gary Busey, arguably, gives one of his best performances). What you will find, however, is a movie that will entertain fans of the genre for 102 minutes. Basically, it is a Charles Bronson movie without Charles Bronson. As for racial insensitivity, anyone that finds insensitivity within this movie is not a true fan of the genre and probably ought to stay away from action movies in general, as any movie where white people aren't being slaughtered is offensive to them. The purpose of Let's Get Harry is to entertain, not to provide thought-provoking insight into US/Colombian relations.",
         "Hello, most people don't like this movie because it was thin in certain areas of the film, listen it's a pure guy movie with tons of action, comedy, and a good acting,not many 80's movies that were action had much story lines to them anyway, it's a feel good story about a group of midwestern men who find out the towns hero in many ways, has been kidnapped and the government wont lift a finger to help since Harry and the other captive aren't worth a rescue, but 5 guys decide they are gonna to go and rescue harry, this movie is a must see for any fan of action, good story, and lot of named actors, don't pay attention to the morons on here who wrote a bad review, what do they expect an Oscar award for this type of movie, it's a buddy, guy movie it's about not sitting by and letting your good friend be killed. while the government seems to not give a s***, if you enjoy a good action movie, with just a feel good story and plenty of action don't pass up this rare gem.",
         "Director Stuart Rosenberg was so dismayed when he surveyed the finished film that he had his name taken off the credits. That should warn you just how bad this cheesy 80s action movie is. But on a certain level, there's a weird, voyeuristic pleasure to be gained from seeing so many good actors struggling with such awful material. Why is a personable leading man like Mark Harmon wasting his time in a badly-written glorified cameo? Why is a rugged, reliable old-timer like Ben Johnson slumming as an embittered father? And - biggest question of the lot - why is a dynamic, Oscar-winning talent as notable as Robert Duvall staining his amazing reputation on such a brainless, gung-ho production? Harry (Harmon) is an American plumber who has just spent several months working in Colombia on an ambitious major water-plant. The day he is due to return home, he is kidnapped by jungle guerillas who say they will only return him safely if some of their colleagues are released by the American authorities. Since the Americans have no intention of meeting the kidnappers' demands, things look pretty bleak for Harry. Harry's brother can't bear the thought of losing his beloved sibling, so he hires a tough mercenary, Shrike (Duvall), and puts together an unlikely rescue team. Their mission, plain and simple: \"Let's Get Harry!\" Coming hot on the heels of other rescue-in-the-jungle films (like Uncommon Valor, Missing in Action, P.O.W - The Escape, and Rambo), Let's Get Harry tries to be different by going for a South American locale instead of Vietnam. However, the story is utterly terrible, with totally unbelievable characters and situations, and an unhealthy attitude towards non-US citizens (who are here portrayed as corrupt, devious, violent, drug-fuelled and expendable). Other than Duvall, the performances are lazy and amateurish. Some reviewers would argue that I'm missing the point, and that the plot and characters have been intentionally sacrificed in the name of cheesy action - but the action is so intermittent (not to mention poorly filmed) that the film is a failure even on \"mindless-adventure-movie\" level. All things considered, Let's Get Harry can be summed up in three words: bad, bad bad!",
         "Spoilers!!! HBO sometimes comes out with great films, and this is one of them. 4.8 and that guy's hateful comments towards this movie I totally disagree with. Rent this film, the people who review it give it a bum rap. I was watching it, with my sister's boyfriend Blake. He yelled get the American flag out, and a bunch of other hysterics. I ignored it, I thought that other countries besides the states also have their social problems, which results in Harry's capture. The part Blake did not get is this film has little to do countries, but communities, families, and brothers. Actually, no one in the government was going to save Harry and he was going to die, and Harry's brother, community and friends did something about it. Gary Busey plays a good role as the financier, too bad he ruined a good career. Robert Duvel, plays the dirty, but fair mercenary. Some can do it others make mistakes, we learn about each character's faults; The scene where everyone in this proud mid western town at work hear that one of their own is rescued, and the party they throw touches my heart. Especially when he understands why the family guy tried, and could not do the mission. I believe in family and community, and that is what this movie is about. 8/10",
         "Mark Harmon, Gary Busey and the great Robert Duvall all give fine performances in this film. It is a good action flick that keeps you on the edge of your seat and makes you cheer for the good guys and the red white and blue. There are so many what you could call hidden \"subliminal\" messages in this film. There is a message in this film about the power of friendship, these men are willing to risk their lives to save their friend. This film sort of reminds us of people left behind like POWs in Vietnam. I like the fact the bad guy in this film is a scummy drug dealer who gets it in the end. Drug dealers are scum and murderers to me, they need to be wiped out! Gary Busey has been trashed enough for what he has done in his personal life, that is irrelevant. He is a fine actor who does good work. He is really funny in this film and steals the show. Robert Duvall is a GIANT in his field. This man was even in the Guiness Book of World Records as one of the most versatile actors of all time, he can play any role and play it well you would not even recognize him in one role from another. I really loved Saving Silverman because the message in the film was about friendship, the question HOW FAR WOULD YOU GO TO HELP A FRIEND???What a wonderful message! This film asks it as well. The blood and guts and shooting and explosions will keep you awake and on the edge of your seat, but the message will make you think after the credits are over. This film came out soon after Rambo: First Blood Part II did. It was when the country was experiencing a wave of patriotism. People realized they treated the Vietnam vets badly when they came home. They spit on them and called them baby killers. It was a horrible time for our country and we realized our wrongs at last. This film brings the message home that we must never do it again. Lets Get Harry won't be considered a classic film, but it is well worth your while to watch it.",
         "The cast and the plot outline suggested an action-packed thriller. Instead, through a lack of intelligence, or just laziness, we get a cartoon,filled with irksome inconsistencies...examples-they're captured and thrown in a hellhole prison, but manage to keep coke, cigarette lighters a large,fresh cigar and wardrobe changes, for later use. with no obvious bulges in their pockets, or travel gear of any kind, they find seemingly endless ammo clips They are able to survive without water(no canteens), and constantly endanger the mission with meaningless tantrums. Finally,successfully, they return home in triumph to be greeted by a bunch of people we've never seen before, or merely in passing. Lives were lost,but no one seems to care or remember. Even for me, a waste of time.",
         "A plot similar to this film was hatched by H. Ross Perot, as written in the book \"On the Wings of Eagles,\" by Ken Follett about a situation in Iran which was very similar to this movie. To me this film really didn't have hardly anything to do with race, I think the reviewer may be reading a little too much into the plot. For a small action movie, this film was interesting and entertaining. The performance of Robert Duvall is understated and sublime, offset by the tailor-made role of the used car salesman, played by Gary Busey. It seems that Busey really didn't have to stretch his acting skills too much for this role, but it was fun to watch.",
         "It's no wonder this ultra-right wing fantasy never made it to theaters: besides stretching credibility to the outer limits of logic and coherence, it tacitly criticizes the Reagan administration as wimps for not effectively dealing with the threat of terrorism (presumably by nuking them out of their Third World foxholes). Mark Harmon plays an American engineer kidnapped in Bolivia by some very well dressed freedom fighters, prompting his beer-drinking buddies back in Aurora Illinois, to stage a daring paramilitary rescue in the jungles of South America (which look suspiciously not unlike Southern California). Robert Duvall lends the film a token measure of respectability in his role as a hard-boiled soldier of fortune whose blood runs red, white and blue, but Gary Busey steals the show playing a crack shot used car salesman with a streak of sadism. Sam Fuller had a hand in the story, which may explain some of the idiot masculinity, and the director's credit is actually a telltale industry pseudonym used when nobody has the guts to claim responsibility. Tune in the next time it shows up on late-night TV and find out why.",
         "Does anyone else feel that Gary Busy was blatantly snubbed for an oscar for his role as the psychopathic, trigger-happy cocaine-fiend in Let's Get Harry? I mean, the man is pure genius. And Alan Smithee's flawless directing cannot be ignored. Let's face it--Let's Get Harry is simply one of the best films ever made. This movie has everything: an inexplicable plot, countless killings, a dirtball Columbian drug dealer who makes a fortune off of the work of an old man with alzheimer's who is happy with receiving a carton of cigarettes for a million dollar's worth of coke, and, of course...Busy, inflamed nostrils and all."
      ],
      "genres": [
         "Action",
         "Adventure"
      ],
      "productionCompanies": [
         "Delphi V Productions",
         "TriStar Pictures"
      ],
      "summaries": ["When Harry Burck (Harmon), an American engineer on loan to Colombia, is taken hostage and held for ransom, his brother Corey (Schoeffling) and friend Jack (Busey) are among a group of men, lead by Shrike (Duvall), who go deep into the jungles of Colombia to rescue Harry and an American ambassador."],
      "budget": 0
   },
   "movielensId": 3389,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1986-01-01",
      "dvdReleaseDate": null,
      "directors": [
         "Stuart Rosenberg",
         "Alan Smithee"
      ],
      "runtime": 102,
      "movieId": 3389,
      "title": "Let's Get Harry",
      "mpaa": "",
      "actors": [
         "Michael Schoeffling",
         "Robert Duvall",
         "Gary Busey",
         "Mark Harmon",
         "Thomas F. Wilson",
         "Matt Clark",
         "Rick Rossovich"
      ],
      "imdbMovieId": "0091400",
      "originalTitle": "Let's Get Harry",
      "genres": [
         "Action",
         "Adventure"
      ],
      "youtubeTrailerIds": ["sGDnwu54RZU"],
      "plotSummary": "Harry Burck has been kidnapped by South American terrorists, and when the US Government refuses to intervene, Harry's friends decide to take matters into their own hands!",
      "tmdbMovieId": 32031,
      "avgRating": 2.48855,
      "releaseYear": "1986",
      "numRatings": 131,
      "posterPath": "/dqamQcX3Jo3TYLaDyNV1lt01cUy.jpg"
   }
}