{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sibling relationship",
            "id": 380
         },
         {
            "name": "chicago",
            "id": 520
         },
         {
            "name": "coma",
            "id": 732
         },
         {
            "name": "subway",
            "id": 1552
         },
         {
            "name": "love of one's life",
            "id": 2038
         },
         {
            "name": "brother",
            "id": 5301
         },
         {
            "name": "man of one's dreams",
            "id": 5989
         },
         {
            "name": "hospital",
            "id": 11612
         }
      ],
      "imdb_id": "tt0114924",
      "video": false,
      "title": "While You Were Sleeping",
      "recommendations": [
         2642,
         1642,
         858,
         397,
         12154,
         11846,
         1641,
         2928,
         11529,
         4806,
         11630,
         10468,
         11467,
         10859,
         6435,
         8874,
         10780,
         9489,
         11777,
         12157
      ],
      "backdrop_path": "/p0VpzQG1PWnICbgQMyrQJGAhwEW.jpg",
      "revenue": 182057016,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Lucy Eleanor Moderatz",
               "gender": 1,
               "credit_id": "52fe4331c3a36847f80416b7",
               "name": "Sandra Bullock",
               "profile_path": "/1Im0NV6nVaKyXMpYjGOfWaj5khS.jpg",
               "id": 18277,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Jack Callaghan",
               "gender": 2,
               "credit_id": "52fe4331c3a36847f80416bb",
               "name": "Bill Pullman",
               "profile_path": "/pIpTEQVbDif8m8OdjAxQKNCj0D6.jpg",
               "id": 8984,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Peter Callaghan",
               "gender": 2,
               "credit_id": "52fe4331c3a36847f80416bf",
               "name": "Peter Gallagher",
               "profile_path": "/76p7x64BpkgNJCLb5d7xklQ1Fzd.jpg",
               "id": 8212,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Ox Callaghan",
               "gender": 2,
               "credit_id": "52fe4331c3a36847f80416c3",
               "name": "Peter Boyle",
               "profile_path": "/hAZw6rJlAemlqND09Km7qGvpZ6D.jpg",
               "id": 1039,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Saul",
               "gender": 2,
               "credit_id": "52fe4331c3a36847f80416c7",
               "name": "Jack Warden",
               "profile_path": "/pD98exbwlD4f9QmQd0N8Sa7j6pw.jpg",
               "id": 5251,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Elsie",
               "gender": 1,
               "credit_id": "52fe4331c3a36847f80416cb",
               "name": "Glynis Johns",
               "profile_path": "/st4IdzYEfXActXFbVnR3DLptpTw.jpg",
               "id": 5826,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Midge Callaghan",
               "gender": 1,
               "credit_id": "52fe4331c3a36847f80416cf",
               "name": "Micole Mercurio",
               "profile_path": "/rqNwt1vtix7LJ94TjTin0t9vnHC.jpg",
               "id": 21202,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Mary Callaghan",
               "gender": 1,
               "credit_id": "52fe4331c3a36847f80416d3",
               "name": "Monica Keena",
               "profile_path": "/f4dD2ohtjJZweo6nbvu38OpSsCO.jpg",
               "id": 18315,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Celeste's Friend",
               "gender": 1,
               "credit_id": "5754992092514126d0004419",
               "name": "Susan Messing",
               "profile_path": "/8emGxNG0N3LDJ1Va2soa1od2ytV.jpg",
               "id": 59407,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Celeste",
               "gender": 1,
               "credit_id": "5754994d92514117290012de",
               "name": "Marcia Wright",
               "profile_path": "/7YRExXidWvylfJudpdZrsg2LSLS.jpg",
               "id": 1631215,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4331c3a36847f8041689",
               "name": "Jon Turteltaub",
               "profile_path": "/borF48XTUkOCKE3ryh3BFxe4Unr.jpg",
               "id": 12962,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4331c3a36847f804168f",
               "name": "Daniel G. Sullivan",
               "profile_path": null,
               "id": 18309,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4331c3a36847f8041695",
               "name": "Fredric LeBow",
               "profile_path": null,
               "id": 18310,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4331c3a36847f804169b",
               "name": "Roger Birnbaum",
               "profile_path": null,
               "id": 4504,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4331c3a36847f80416a1",
               "name": "Joe Roth",
               "profile_path": "/lUtmB3mtMPrA5hhoEwZBeX1U5uL.jpg",
               "id": 18311,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4331c3a36847f80416a7",
               "name": "Randy Edelman",
               "profile_path": "/fGS6OjvQpivFVajkmjTRgRiC9BN.jpg",
               "id": 14712,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4331c3a36847f80416ad",
               "name": "Phedon Papamichael",
               "profile_path": "/vsALQXJ7XDO3VPwS4kEYtqqLkeV.jpg",
               "id": 432,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4331c3a36847f80416b3",
               "name": "Bruce Green",
               "profile_path": "/yplxWPVgwK1b33AjvbhM9mWX2Aw.jpg",
               "id": 12970,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 14.918362,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 2064,
      "vote_count": 437,
      "budget": 17000000,
      "overview": "A love story built on a misunderstanding. A transit worker pulls commuter Peter off the tracks after he's mugged. But while he's in a coma, his family mistakenly thinks she's Peter's fiancée, and she doesn't correct them. Things get more complicated when she falls for his brother, who's not quite sure that she's who she claims to be.",
      "similar": [
         1367,
         416477,
         4170,
         1903,
         11005,
         40807,
         73,
         88,
         510,
         4347,
         334541,
         277216,
         7972,
         10312,
         164457,
         8392,
         9679,
         277,
         48138,
         5503
      ],
      "original_title": "While You Were Sleeping",
      "runtime": 103,
      "poster_path": "/9StV7DX4ZtRZGJs9VcVEPvxIKL6.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Caravan Pictures",
            "id": 175,
            "origin_country": ""
         },
         {
            "logo_path": "/xXojkyRWFZ0JTJyjiu13ThKeFbz.png",
            "name": "Hollywood Pictures",
            "id": 915,
            "origin_country": ""
         }
      ],
      "release_date": "1995-04-21",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "A story about love at second sight.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Jon Turteltaub"],
      "runtime": 103,
      "synopsis": "Sandra Bullock plays Lucy Ellenore Moderatz, a lonely fare collector on the Chicago elevated railway. The highlight of her days is selling a token to a handsome commuter, Peter Callaghan (played by Peter Gallagher), on whom she has a secret crush. Working on Christmas, Lucy witnesses Peter being mugged and pushed onto the tracks, and she rescues him from an oncoming train. Peter falls into a coma and she accompanies him to the hospital, where she fantasizes aloud, \"I was going to marry him\". A nurse overhears her and, misinterpreting the situation, tells the head physician, a policeman and Callaghan's family that Lucy is his fiancée. At first Lucy is too caught up in the madness of everyone's panic to tell the truth, and after that she is too embarrassed to. An orphan with few friends, she becomes so captivated with the quirky Callaghans and their unconditional love for her, that she cannot bring herself to hurt them by revealing that Peter doesn't even know her. She spends a delayed Christmas with the family so \"they can get to know each other\". Lucy then meets Peter's younger brother Jack (Bill Pullman), who has taken over his father's business and is always working. Jack is very suspicious at first, saying Peter never mentioned Lucy or a marriage, which is not like him. Later on, after spending some time together to get acquainted, Jack starts to realize that he himself has feelings for Lucy. Then complications arise. Peter wakes up, not remembering Lucy at all, but by this time the rest of the Callaghan family has become so enamored with Lucy that they all naturally assume that Peter must have amnesia. Forced by his family, Peter and Lucy spend time together, while Lucy doesn't know how to tell them the truth, especially now that she has fallen in love with Jack. Peter is convinced by Saul (Peter and Jack's godfather, who knows about Lucy's secret) that Lucy must be his true love if he really proposed to her, so he does it \"again\". Lucy freaks out by the unexpected questions and agrees. Lucy confides in the kindly Saul, who believes that Lucy belongs in the family. Yet the elderly widower can't bring himself to tell the family about Lucy either. Lucy forces herself to be happy; she's with the man she wanted to be with her whole life. The day before the wedding, Jack visits her to give her a present - a snowglobe of Florence, Italy, the place that she has always wanted to go to. As he leaves, Lucy asks him if he could give her any reason why she shouldn't marry Peter. Jack hesitates before saying that he cannot give a reason, and angrily leaves. On the day of the wedding, Lucy starts to feel more and more guilty over her lie and her feelings for Jack, when it's actually Peter she's marrying. She walks down the aisle, where Peter is waiting with Jack, who is his best man. The priest begins, but during the words \"Dearly beloveds, we're gather here today...\", Lucy suddenly objects. Jack is surprised and objects too. She tells the family who she is and what went wrong in the hospital. She tells the parents she's fallen in love with their son, but points out that it's not Peter, but Jack. Also showing up to object to the union is Ashley, Peter's real fiancee, whom the family learns also happens to be married. As the family argues, Lucy leaves, unsure of her future. The final scene opens with Lucy on her last day of work at the station. As she accepts tokens from passengers, an engagement ring falls through the toll window. When Lucy looks up, she sees Jack and his family standing. Jack passes the token collection line and proposes to Lucy. The film ends with the two happily married in wedding attire, on the back of a train departing from the station, complete with a sign reading \"Just Married\".",
      "writers": [
         "Daniel G. Sullivan",
         "Fredric LeBow"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0114924/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU5NjU4NDUzMl5BMl5BanBnXkFtZTgwMjc4NDgzMTE@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Sandra Bullock, Bill Pullman, Peter Gallagher | See full cast and crew »"],
      "reviews": [
         "You have to be THE most die-hard, unrelenting cynic not to enjoy this movie. I love it when television networks play this film around wintertime because for some reason it doesn't suit any other time of year. In winter you like to have a comfort zone and this film is it! It tells the story of lonely singleton Lucy who daydreams of better things while working at a ticket booth and drooling over the secret crush of a local commuter (Peter Gallagher) One morning she saves him from a coming train and while he lies comatose she gets reluctantly cosy with his family. The deceit is understandable and by no means menacing, as it's Christmas the younger brother Jack (Bill Pullman) returns home and subsequently falls for Lucy. While you were sleeping is beautiful and sweet in so many ways: You are reminded of the more old-fashioned romances of the 40's and 50's. There is not one hint of sexuality or lust in this as the love blossoms between Jack & Lucy is honest, pure and all together endearing. We all relate to Lucy on some level (a dream trip to Paris, Rome or in this case Florence) So it's hopeful to us all when she gets her happy ending. I absolutely loved it!",
         "A sweet and gentle, romantic film about how love sometimes slips in through the window rather than coming straight in through the front door, it's the one that put star Sandra Bullock into contention with Meg Ryan for the crown of America's Sweetheart. And with good reason, because in `While You Were Sleeping,' directed by Jon Turteltaub, Bullock emerges as the epitome of the modern day `girl next door,' in the best and most sincere sense. This is a film that explores one of the basic tenets of the human condition, the need to love and be loved, and makes no bones about what it's trying to accomplish along the way. Clearly, the filmmakers want to make you feel good and entertain you at the same time. And they succeed on both fronts. Lucy Moderatz (Bullock) lives alone in Chicago, where she has an apartment, a cat and a job with the CTA as a token taker for the train. Her life is fairly uncomplicated and uneventful (read: Dull), and the one thing she looks forward to in her daily grind is seeing a certain young gentleman who rides the train everyday and always passes through her toll booth. She's doesn't even know his name, and they've never exchanged so much as a `Good morning,' but in her mind he's become the Prince Charming she's always dreamed about. Then on Christmas morning he passes through, but while waiting on the platform for the train he gets mugged and falls onto the tracks, unconscious. And a train is coming. Lucy runs to his aid and saves his life, but the severe head trauma he's sustained has put him in a coma. At the hospital, they refuse to let her in to see him, as that is a privilege reserved for family members only; so in desperation she tells them that she is his fiancee, which does the trick. But when his family-- his rather `large' family-- shows up, her ruse creates something of a sticky wicket. Everything is moving so fast and becoming so emotional that Lucy simply can't get in a word of explanation. The next thing she knows, to the family she is their beloved Peter's (Peter Gallagher) intended (even though he's never said a word to them about her), and because the situation is so frantic and there's such concern about Peter, besides which it's Christmas, Lucy can't bring herself to tell them the truth. So in an instant, her life is suddenly changed; she's surrounded by `family,' and she's `engaged' to her Prince Charming. Even if he is, well...in a coma. Turteltaub has crafted and delivered a thoroughly engaging film in the tradition of Nora Ephron's `You've Got Mail' (the second best romantic comedy ever made) and `Sleepless In Seattle.' He sets a perfect pace, and presents his endearingly eclectic assemblage of characters in the best possible way-- he makes you feel at home with them. Most importantly, though, Turteltaub manages to make this a `sweet' film without being `saccharin' about it, which would have sunk it quicker than a deflated rubber raft in an undertow. Instead, he pulls out all the right stops to make his film entirely Ephronesque and entertaining, and it works beautifully. The humor is warm, and as the story moves along he builds upon that strong sense of `need' that is universal, then triumphs by satisfying that need in the end. Sandra Bullock has never been more winning or winsome than she is here; there's a special quality about her Lucy that makes you want to reach out to her. She is, without question, the most vulnerable character Bullock has ever played. There is very little of Annie (`Speed') or Gracie (`Miss Congeniality'), for example, about her; the closest to Lucy of any of her characters, in fact, would be Birdee in `Hope Floats.' That is not to say there is anything `weak' about Lucy at all-- quite the contrary, in fact. There is a decided strength in the very benevolence of Lucy's nature, even in the way she wears her heart on her sleeve and especially inasmuch as she is not afraid to admit to herself what she really wants and needs. This is an independent woman who accepts and meets any and all challenges of life, but keeps an open mind and, above all, an open heart. And that is what makes Lucy so endearing; she's the one who brings a cake to the office to share with her co-workers for no other reason than the fact that it makes the world and everybody in it a little bit better. That's what Bullock brings to her performance here, and it's what makes Lucy one of her most enduring and memorable characters. As for sliding in through the window rather than coming through the front door, that's exactly what Bill Pullman does with his portrayal of Peter's brother, Jack Callaghan. He's the one who shows up after the fact, as it were, but very quickly makes a connection and ingratiates himself with the audience. Initially, Jack seems to be playing the role of devil's advocate, his suspicions aroused by the fact that Peter has never mentioned Lucy to him; but that begins to change with some very subtle undertones that prove to be extremely effective. And Pullman does a terrific job of developing his character in real time, which makes Jack convincing, and a piece of the puzzle that fits in perfectly. A `character actor' type leading man, Pullman has a resume filled with varied and colorful characters, but Jack is his most engaging role ever, and he succeeds entirely with it. The wonderful supporting cast includes Jack Warden (Saul), Peter Boyle (Ox), Micole Mercurio (Midge), Michael Rispoli (Joey) and the wonderful Glynis Johns, as beautiful and charming as ever as Elsie. Warm and poignant, `While You Were Sleeping' is one to savor; this one's a keeper. (BTW, the #1 romantic comedy? Bonnie Hunt's `Return To Me'). 10/10.",
         "Lovely little film that has the lonely Sandra Bullock admiring high-class businessman Peter Gallagher from afar in her toll booth on the subway. Then one day he is attacked by a couple of muggers and Bullock saves his life by getting him to the hospital. Naturally Gallagher is in a comatose state after the attack. A true misunderstanding makes it appear that Bullock is Gallagher's fiance and typical confusion ensues. Now Gallagher's family all believe that Bullock really is his woman. Gallagher's brother (Bill Pullman) is suspicious though, but slowly starts to believe Bullock as well. He then starts to fall in love with her and vice versa. A great romantic comedy that is so pure and well-made that it is near impossible to say anything negative about it. It is not a perfect film, but it is a very likeable movie that delivers what it promises. 4 stars out of 5.",
         "Next time you are depressed, this is the perfect pick me up. If you like watching the same movies over and over, this is great for that also. The chemistry between the two main characters is outstanding, much better than in this year's Two Weeks' Notice. Laugh out loud and cry out loud.",
         "This was the picture which proved things could be all about Sandra Bullock. \"Speed\" - one year earlier - showed this. This picture proved it. A lot of people nowadays make fun of a typical Bullock picture and speak of her as negligible in this day and age. They probably forget or were never aware that she was hailed as America's new sweetheart back in '95 and it was no idle chatter. There are very few actresses who can carry a picture on their own slight shoulders - I mean, really make it a success. Sure, Bill Pullman helped, but this really was Sandra all the way, in a sappy, soapy, cliché-ridden slight story of sudden romance usually very hard to buy into. But because Sandra is there on the screen throughout nearly every frame, it all works out, and you're rooting for her happiness in the final few minutes even knowing very well what is about to happen. It's like you've seen it all before, but Sandra makes you want to see it again. We are all very fortunate, those of us who have seen this story, that it was Sandra in the central role and not someone like (shudder) Demi Moore. And if a guy is really fortunate, he may meet someone like Sandra in real life.",
         "Sandra Bullock is a working girl who wants to travel. She has no family, and is usually stuck doing holiday shifts in the Chicago transit system (as a toll booth clerk on the elevated railway). She has noted one man who uses the station all the time (Peter Gallagher), and rescues him when he is thrown onto the train tracks just before a train comes into the station. Gallagher is in a coma and (due to a well-intentioned nurse) Bullock is introduced to the family of Gallagher as his fiancé. She tries to tell them the truth, but when she learns his grandmother (Glynis Johns) has a heart problem she hesitates. Soon she is treated as a member of this nice family as a member (well, she did save Gallagher, and she is thought to be his fiancé). Only his brother (Bill Pullman) has real doubts, and keeps mentioning them (and keeps apologizing for them. Bullock and Pullman find that they are also growing more attracted to each other. The film shows how these problems are resolved. And it is all done in a most charming manner. This is one of those films that would take only a few minutes to quickly resolve in the real world, where Bullock would have told the truth early on. But the audience is allowed to suspend it's disbelief because the characters are uniformly likable. Although Jack (Pullman) is constantly questioning Bullock's story, each time she gives a plausible explanation of what is going on, and Pullman likes her enough to accept these explanations. The only one who knows the truth is the family friend Sam (Jack Warden) and he too feels that the news has to be broken carefully (he loves the family and doesn't want them hurt). Oddly enough his one effort at meddling almost screws up the situation in the film for Bullock, Pullman, and Gallagher. Pullman also faces the truth and explains to his father (Peter Boyle) that he doesn't want to continue in the family business. Boyle's reaction becomes important too. The performances are flawless, and one finds oneself rooting for most of the cast (the sole exception is the actress playing \"Ashley\", Peter Galagher's actual girl friend). Her opposite number, \"Joe Jr.\" is too comic a figure to dislike (in fact, at one point he thinks Pullman is annoying Bullock and offers to take care of him - not the act of a rat at all). For a sweet, lovable love tale WHILE YOU WERE SLEEPING is hard to top. In the last decade only WHEN HARRY MET SALLY, WORKING GIRL, PRETTY WOMAN, NOTTING HILL, SLEEPLESS IN SEATTLE, and YOU'VE GOT MAIL are on par with it, but the family becomes so important to Bullock in the plot this has a special warmth in it that is quite is different from most of the others.",
         "Warm and gentle comedy that shows Bullock to her best advantage, in her favorite role of shy closet beauty. Bullock obsesses about a man she sees briefly every day; when he is knocked unconscious she claims to be his fiancée. Then sparks begin to fly with the brother. Wonderful turns by Boyle and Warden as older family members. There's a great line by Boyle in this movie, something like you always imagine you'll have these long golden moments in life and then when you get there it lasts about a minute. I think Bullock was never better than in this movie, in later productions her shy modesty seems a little artificial. She and Pullman have just enough chemistry together to pull this through.",
         "This was an extremely underrated movie. There were so many funny little segments and happenings in this movie. Like when the newspaper boy was delivering papers, and when they had the dinner conversation. If you just watch the movie for some good laughs and don't try to expect some big, deep storyline you will find that it is a VERY enjoyable movie. It had us all laughing till we......well you know what I mean. Sit back, get some popcorn and enjoy the show. There's nothing wrong with silly, senseless humor, is there? Even my husband enjoyed it. I've seen this movie more times than I probably should admit. But I laugh every time I see it. Another good choice...How to meet a guy in 10 days.",
         "WHILE YOU WERE SLEEPING, in my opinion, is a sweet, charming, hilarious, and heartwarming romantic comedy. If you ask me, the way that Lucy (Sandra Bullock) and Peter (Peter Gallagher) met was very romantic. Also, in my opinion, Joey (Michael Rispoli) was a little crazy. This was because he just couldn't seem to leave Lucy alone. In addition, to me, Jack (Bill Pullman) was a really cute guy. Before I wrap this up, I'd like to say, \"If you like romantic comedies or movies where people meet by chance, I highly recommend WHILE YOU WERE SLEEPING!\" Now, in conclusion, when you see this sweet, charming, hilarious, and heartwarming romantic comedy, prepare to laugh and be touched.",
         "I know, I know...You saw the name Bill Pullman and wanted to shove this movie a side too. In this movie though, he is absolutely a sweetheart. This wonderful fairytale really got me. Sandra Bullock, Bill Pullman and his entire kooky family sucked me right in. This movie is such a chick flick, but it is really funny too. (Joe Fusco Jr.!!!) See it! I think you'll love it. I did."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Hollywood Pictures",
         "Caravan Pictures"
      ],
      "summaries": [
         "Lucy's life consists of constant loneliness that is until she saves Peter's life. Now she is a part of his family, and with a strong heart and fate on her side, others begin to realize what a terrific person she is, especially Jack, Peter's brother. An extraordinarily true-to-life sequence of events begin to take place as Lucy and Jack become closer and learn more about each other and themselves than one would ever expect from such coincidental, yet believable events.",
         "Lonely Chicago \"L\" ticket seller Lucy has fallen in love with a commuter who passes her by every day. On Christmas day, the handsome commuter named Peter falls onto the rails and is saved from certain death by Lucy. Peter's family is mistaken into thinking Lucy is Peter's fiancie. Peter's brother, Jack, is skeptical, but very much attacted to Lucy. What will happen when Peter wakes up?",
         "Lucy is a happy-go-lucky ticket seller, until one day she finds the man of her dreams and also sees him get mugged. After being mugged the man, known as Peter, goes into a coma. Lucy goes to visit him at the hospital and the nurse tells Peter's family that Lucy is his fiancée'. Lucy can not get the courage to tell them the truth and his family take her in as a member of their family. While with this family Lucy falls head over heels in love with Peter's brother, Jack. Lucy does not know what to do when Peter comes out of a coma and doesn't remember her.",
         "Lucy has to work on Christmas at a Chicago train station as a token collector because she has no family to go to. When she spots her dream lover, Peter, getting mugged at the station, she rescues him and brings him to a hospital, but Peter goes into a coma. Peter's family thinks that Lucy is Peter's fiancee, and welcomes her into the family. Lucy feels the family love for the first time. During the time spent with Peter's family, Lucy falls in love with Peter's brother, Jack.",
         "Lucy is a lonely Chicago subway employee whose life consists of living with her cat, avoiding her landlord's boorish son, and nursing a hopeless crush on a handsome commuter who passes her booth every day. Whilst working the Christmas shift, she witnesses him being mugged and pushed off the platform, and manages to save his life - and is mistaken for his fiancé at the hospital. She is duly embraced by the man's warm and welcoming family - except for his suspicious brother Jack, who is not convinced that she's the genuine article.",
         "Ticket collecting romantic pretends to be engaged to an unconscious man but can't fool his brother"
      ],
      "budget": 17000000
   },
   "movielensId": 339,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-04-21",
      "dvdReleaseDate": "2005-10-12",
      "directors": ["Jon Turteltaub"],
      "runtime": 103,
      "movieId": 339,
      "title": "While You Were Sleeping",
      "mpaa": "PG",
      "actors": [
         "Sandra Bullock",
         "Bill Pullman",
         "Peter Gallagher",
         "Peter Boyle",
         "Jack Warden",
         "Glynis Johns",
         "Micole Mercurio",
         "Monica Keena",
         "Susan Messing",
         "Marcia Wright"
      ],
      "imdbMovieId": "0114924",
      "originalTitle": "While You Were Sleeping",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["d3RSYSsgz3w"],
      "plotSummary": "A love story built on a misunderstanding. A transit worker pulls commuter Peter off the tracks after he's mugged. But while he's in a coma, his family mistakenly thinks she's Peter's fiancée, and she doesn't correct them. Things get more complicated when she falls for his brother, who's not quite sure that she's who she claims to be.",
      "tmdbMovieId": 2064,
      "avgRating": 3.50841,
      "releaseYear": "1995",
      "numRatings": 25809,
      "posterPath": "/9StV7DX4ZtRZGJs9VcVEPvxIKL6.jpg"
   }
}