{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0091934",
      "video": false,
      "title": "Shanghai Surprise",
      "recommendations": [
         2703,
         2149,
         26827,
         77985,
         38275,
         24797,
         9930,
         51515,
         18856,
         35225,
         32221,
         20184,
         36859,
         69007,
         41971,
         98130,
         74101,
         25010,
         24254,
         37244
      ],
      "backdrop_path": "/A0OwUPb1Jz5PgPgMiDuba46nzUE.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Gloria Tatlock",
               "gender": 1,
               "credit_id": "52fe4952c3a36847f8194315",
               "name": "Madonna",
               "profile_path": "/7KMAZvh8LehYpRdDuUdaUA7tevs.jpg",
               "id": 3125,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Glendon Wasey",
               "gender": 2,
               "credit_id": "52fe4952c3a36847f8194319",
               "name": "Sean Penn",
               "profile_path": "/f2uy1zq0qmtLBpsr6N9uQ8FktOr.jpg",
               "id": 2228,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Walter Faraday",
               "gender": 2,
               "credit_id": "52fe4952c3a36847f819431d",
               "name": "Paul Freeman",
               "profile_path": "/gWRX09kyrzTFFehwE53cJtps2fx.jpg",
               "id": 652,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Willie Tuttle",
               "gender": 2,
               "credit_id": "52fe4952c3a36847f8194321",
               "name": "Richard Griffiths",
               "profile_path": "/hUHiJYtXgGgYt7UkHA7YgEiGNYC.jpg",
               "id": 10983,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Joe Go",
               "gender": 2,
               "credit_id": "52fe4952c3a36847f8194325",
               "name": "Clyde Kusatsu",
               "profile_path": "/gM5vHl3hl0CgKJxeqwjyeOdhzjP.jpg",
               "id": 2249,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Justin Kronk",
               "gender": 2,
               "credit_id": "59b50c459251413e4c000cca",
               "name": "Philip Sayer",
               "profile_path": "/aPiX9eVW99Cm5DrCDJmiM1Ph9Ol.jpg",
               "id": 26667,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Mei Gan",
               "gender": 0,
               "credit_id": "59b50c6b9251413dbf000da8",
               "name": "Kay Tong Lim",
               "profile_path": null,
               "id": 1885209,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "China Doll",
               "gender": 0,
               "credit_id": "59b50c7ec3a36819d2000b0d",
               "name": "Sonserai Lee",
               "profile_path": null,
               "id": 1885210,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Ho Chong",
               "gender": 2,
               "credit_id": "59b50c8e9251413e4c000d1d",
               "name": "Victor Wong",
               "profile_path": "/70vAqnH2QFhLOenNQCVcaG1JhN3.jpg",
               "id": 11395,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Yamagani San",
               "gender": 0,
               "credit_id": "59b50c9fc3a3681394000ed4",
               "name": "Professor Toru Tanaka",
               "profile_path": null,
               "id": 1708458,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Mr. Burns",
               "gender": 2,
               "credit_id": "59b50caec3a3681adb000b10",
               "name": "Michael Aldridge",
               "profile_path": null,
               "id": 14815,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "China Doll's Maid",
               "gender": 0,
               "credit_id": "59b50cc19251413e4c000d6b",
               "name": "Sarah Lam",
               "profile_path": null,
               "id": 1243384,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Wu Ch'En She",
               "gender": 0,
               "credit_id": "59b50ceec3a36819d2000b9d",
               "name": "George She",
               "profile_path": null,
               "id": 1885211,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Rickshaw King",
               "gender": 0,
               "credit_id": "59b50d05c3a3681e1a0009a9",
               "name": "Won Gam Bor",
               "profile_path": null,
               "id": 1885212,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "China Doll's Boatman",
               "gender": 0,
               "credit_id": "59b50d17925141431f000995",
               "name": "To Chee Kan",
               "profile_path": null,
               "id": 1885214,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4952c3a36847f8194305",
               "name": "Jim Goddard",
               "profile_path": null,
               "id": 134639,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4952c3a36847f819430b",
               "name": "John Kohn",
               "profile_path": null,
               "id": 100981,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4952c3a36847f8194311",
               "name": "Robert Bentley",
               "profile_path": null,
               "id": 228992,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Adventure",
         "id": 12
      }],
      "popularity": 3.128199,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 58048,
      "vote_count": 23,
      "budget": 17000000,
      "overview": "Glendon Wasey is a fortune hunter looking for a fast track out of China. Gloria Tatlock is a missionary nurse seeking the curing powers of opium for her patients. Fate sets them on a hectic, exotic, and even romantic quest for stolen drugs. But they are up against every thug and smuggler in Shangai.",
      "similar": [],
      "original_title": "Shanghai Surprise",
      "runtime": 97,
      "poster_path": "/jxL0m3woGmnIZXpV0n123bLH5Ip.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Vista Organisation, The",
            "id": 94714,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "HandMade Films",
            "id": 20076,
            "origin_country": ""
         }
      ],
      "release_date": "1986-08-29",
      "vote_average": 3.3,
      "belongs_to_collection": null,
      "tagline": "A romantic adventure for the dangerous at heart.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Jim Goddard"],
      "runtime": 97,
      "synopsis": null,
      "writers": [
         "John Kohn",
         "Robert Bentley"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0091934/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMxNzAwMDQ5OV5BMl5BanBnXkFtZTcwMjUxMTE3NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Sean Penn, Madonna, Paul Freeman | See full cast and crew »"],
      "reviews": [
         "OK. So someone took an A-list actor and his famous singer/ part time kind of-sort of actress wife and decided that the movie would be carried on the weight of the names alone. Substitute \"fiancee\" for wife and one has Gigli. But it is not- it is Shanghai Surprise, possibly the most ill-conceived movie of the 1980's (and yes, I have seen \"Hobgoblins.\") This movie has no redeeming qualities whatsoever. Ridiculous plot, painfully bad acting (Madonna as a missionary? She didn't buy it either, so she says her lines in a flat tone which just screams \"get me out of this costume and get me my check\"), cinematography worthy of an old episode of \"Fantasy Island,\" lame ending. If, by some chance, you stumble across a copy of this in an unused corner of your local video rental store, call your local hazardous waste disposal hotline- do not rent it. But do not forget that this horror exists. Some people forgot- and thus \"Gigli\" was born.",
         "In 1938 China, a pretty but prim missionary needs to find a hidden stash of smuggled opium (for medicinal purposes!) and attempts to recruit the help of a ratty-looking con-man; his latest get-rich-quick scheme is glow-in-the-dark ties! After an OK opening (without Sean Penn and Madonna), this falls completely apart, weighed down by lethargic attempts at screwball comedy and no chemistry whatsoever between the leads (then a married couple). Based on Tony Kenrick's novel \"Faraday's Flowers\" (a better title), this failure from George Harrison's HandMade Films must have been a devastating blow to the ex-Beatle, who also executive produced, co-wrote the score and wrote and performed the songs (which are heavy on the camp-Asian allure). Just getting through the picture is a chore, and everything about it seems eternally misjudged. NO STARS from ****",
         "\"Shanghai Surprise\" is an idiotic, out-of-date, poorly-acted, campy action film that wants to be a romantic comedy. Madonna, in her second starring role, had about enough acting talent at this point as a doll. Unfortunately, the doll in this movie comes off looking better than she does. Madonna, playing a missionary (!) nurse (!!) for a Shanghai mission, is in search of opium (!!!) for medicinal purposes (!!?!!) approaches Sean Penn, an American soldier-of-fortune type who happens to speak Chinese. Penn and Madonna, who were married at the time this film were made, are obviously uncomfortable with the material and do little to justify the film's existence. Penn mugs his way through and attempts to crach a few weak jokes, while Madonna stamps her foot and places her hands on her hips as she squeaks (yes, she squeaks, and you must hear it to believe it) in frustration. The plot is absolutely ridiculous -- Madonna and Sean Penn chasing after a mysterious cargo of opium known as \"Faraday's Flowers\" (incidentally, the name of the book this movie is based on) must run from a Chinese gangster with porcelain hands, have a romantic interlude with an Imperial concubine, teach baseball skills to another Chinese gangster, and (boy, aren't we surprised) sleep together to seal a deal. This movie, like \"Mommie Dearest\" or \"Plan Nine From Outer Space\" has immense camp value because it's so deliciously awful. Utterly predictable, insipid, and full of instantly forgettable lines, this movie is the equivalent of the yellow stuff they stick on your nachos at the movie theatres -- it's not really good enough to be real cheese, but it's much cheaper and tastes pretty much the same anyway. This movie isn't even cheesy enough to be cheesy. Avoid \"Shanghai Surprise\" unless, like me, you like Madonna WAY too much or if you're just a fan of bad movies.",
         "I think I made it through about half of this movie. The acting was horrible. The plot was non-existent. The editing was awful. It seemed like they just took a bunch of scenes and put them together in random order. This movie filled me with so many questions: Why is Penn dressed in '80s-style clothing? What is going on? Was Madonna's crotch shot in that first chase scene intentional? What is motivating these characters? How did Sean Penn go on to have a successful career after this film? Will I ever regain that piece of soul I just lost? Why? Why? Why? My wife and I tried to watch this film tonight and it made us physically ill. If only I could unsee this film. I'm going to cry in the dark for the next few hours.",
         "The IMDb advises that I should say ... *Warning Spoilers Follow*. ... but there is no way to spoil this movie, because it is already spoiled to the point of being compost, and is ready to be spread out on the fields. It has been almost 20 years since my girlfriend of the time, an obsessive Madonna fan, talked me into seeing this piece of trash, and I still go to bed at night praying to God that I can somehow get that two hours of my life back. This is not one of those movies that is so bad it is good. This is one of those movies that is so bad it actually slingshots right around past good and right back to bad again. Madonna stars as a missionary (I know this is a leap of faith folks, but I am *not* kidding!), who teams up with Sean Penn (her then husband) to search for \"Faraday's Flowers\", a cache of opium balls she hopes can be used as a pain killer for wounded troops. From about this point on, the movie takes on a rhythm that more or less goes \"1, 2, 3, plot twist, 1, 2, 3, plot twist, 1, 2, 3, plot twist, and so on\", as the duo of Penn and Penn bounce around randomly from one ridiculous situation to another with plenty of plot twists, but absolutely no plot evident to be twisted. In the mean time, they are being chased by a corrupt official with prosthetic hands (He lost his real hands from opening a booby trapped money belt called a \"shanghai surprise\", which is what the movie is supposedly named after. This seems appropriate to me, seeing how I had lost my money from watching this booby trapped movie.). You may wonder why it is that I am able to remember so much about a movie I haven't seen in almost 20 years. To that I can only say one thing ... ... emotional scarring. This movie is that bad folks! I have seen a lot of bad movies in my time, but this one rules as the unchallenged chief god in my pantheon of stinkers. It makes Ed Wood's movies look like Academy Award winning material. It even makes the worst of the worst of the flash animation that I have seen over the last six years on the net look good. I would eagerly gnaw my foot off to escape from this movie. If, for some reason, you are ever unfortunate enough to find a copy of this little \"gem\" on the shelf of your local video store, the only thing I can recommend is that you slowly and carefully turn yourself around, then run, run! RUN!!!!!, and immediately seek psychiatric counseling so as to avoid any possible post traumatic stress syndrome you may suffer from exposure to this movie. I give this movie a 1, but that is only because IMDb will not let me input negative numbers.",
         "If nothing else this film has heart. I remember years ago all the hype that was injected into this film aimed at adolescent girls (i.e. Madonna fans), with the angle being that they would get to see the then infamous couple of Penn and Madonna frolic on the big silver screen. Well, it didn't take a rocket scientist to know where this film was headed. Like with all films when the hype exceeds previously good, yet unhyped, films you know something's up. The story itself isn't bad. It's kind of hackneyed at points, but that's its genre, and for what the film is it works after a fashion. There're only two real problems with this film; 1) Madonna's then acting capabilities. It's not bad for a performer who's more used to singing and dancing, and it's unfair to expect anything more from her, but her acting talent then was what it was; lacking. Let's face it, she's a better singer and dancer than an actress, and this comes from a man who is not one of her fans. 2)The second problem is the actual filming and execution of this film. The storie's there, the acting's there (Madonna not withstanding), and so forth, but there's little in the way of coverage or good cinematography. It's passing. It gets the job done. But the shots are those of a low budget flick. I believe there was a real opportunity to create atmosphere with good camera direction, but the focus of the film wasn't art so much as it was to capitalize on the then Madonna-Penn phenomenon (the film itself was riding the coat tails of Indiana Jones and The High Road to China films). And that last part is really too bad, because this film could've been much more. At least when I saw it on HBO years ago the print I saw then was clear, corrected, crisp and otherwise very viewable. Today I had a gander at the recently released DVD, and it looks like the owners of the property took an old 16mm broadcast print and had some fly by night tranfer company encode it on a DVD master; complete with a couple of scratches on grainy film stock. In short, if you didn't like it the first time, then don't bother with the DVD because it's even worse. If you got a spare evening, and your friend loaned you the disk, or it's available at the library, then give it a look, but don't expect too much.",
         "Who thought this up? It must have looked brilliant when they got Sean and Madonna in the same movie. Unfortunately Sean goes through the whole movie looking like a kid pretending he's in a movie and Madonna as usual just plays herself, badly. Nothing to see here, move along folks...",
         "There is no reason to struggle with justifications, nor to reach for words to describe such an amateurish, hackneyed, stilted, banal ... well, there I go. Just suffice to it say that it is completely understandable why the talented Mr. Penn reportedly chose to stay drunk for every shooting day of this miserable, limp, pointless ... you see where I'm going. However bad you remember it to be, you must re-see it to believe it. Madonna is the worst American actress of all time without peer. The only thing she's done on film that is worth seeing is Evita (a music video) and \"Desperately Seeking Susan\" (in which she has little dialog and rolls her eyes a lot).",
         "Believe me this film is awful. Now I am a BIG Madonna fan and I have tried, out of duty, to watch and enjoy this film, but I can find no redeeming quality. The script is terrible, the direction is misguided, the acting dire...need I go on? I didn't even get as far as enjoying it, I have never seen it all the way through. Sorry Madonna, but as I am sure you know, this is a stinker!",
         "Tinsel town's (then) favorite bride and groom consummated their marriage with this abysmal comedy adventure, an aborted Indiana Jones rip-off set in (of all places) romantic China during the Japanese occupation. The project was obviously an excuse for a paid honeymoon abroad, but no amount of fun and games could possibly validate such an insult to the intelligence, which would have us accept Sean Penn as a romantic hero and Madonna as the chaste and innocent daughter of a local missionary, a joke of bad casting even her most loyal fans would have trouble defending (she can't play the role, at any rate). Ex-Beatle George Harrison obviously saw the film as an opportunity to peddle some forgettable songs, and using his producer's credit he was able to put his distinctive warble in every other scene. Bottom line: life is too short to waste even 90 minutes of it watching indulgent crap like this."
      ],
      "genres": [
         "Adventure",
         "Crime",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "HandMade Films",
         "Vista Organisation, The"
      ],
      "summaries": ["Glendon Wasey is a fortune hunter looking for a fast track out of China. Gloria Tatlock is a missionary nurse seeking the curing powers of opium for her patients. Fate sets them on a hectic, exotic, and even romantic quest for stolen drugs. But they are up against every thug and smuggler in Shangai."],
      "budget": 17000000
   },
   "movielensId": 3390,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1986-08-29",
      "dvdReleaseDate": "2003-07-22",
      "directors": ["Jim Goddard"],
      "runtime": 97,
      "movieId": 3390,
      "title": "Shanghai Surprise",
      "mpaa": "PG-13",
      "actors": [
         "Madonna",
         "Sean Penn",
         "Paul Freeman",
         "Richard Griffiths",
         "Clyde Kusatsu",
         "Philip Sayer",
         "Kay Tong Lim",
         "Sonserai Lee",
         "Victor Wong",
         "Professor Toru Tanaka",
         "Michael Aldridge",
         "Sarah Lam",
         "George She",
         "Won Gam Bor",
         "To Chee Kan"
      ],
      "imdbMovieId": "0091934",
      "originalTitle": "Shanghai Surprise",
      "genres": ["Adventure"],
      "youtubeTrailerIds": ["yhX89dDoAw4"],
      "plotSummary": "Glendon Wasey is a fortune hunter looking for a fast track out of China. Gloria Tatlock is a missionary nurse seeking the curing powers of opium for her patients. Fate sets them on a hectic, exotic, and even romantic quest for stolen drugs. But they are up against every thug and smuggler in Shangai.",
      "tmdbMovieId": 58048,
      "avgRating": 1.57317,
      "releaseYear": "1986",
      "numRatings": 246,
      "posterPath": "/jxL0m3woGmnIZXpV0n123bLH5Ip.jpg"
   }
}