{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0092834",
      "video": false,
      "title": "Date With an Angel",
      "recommendations": [
         38044,
         36486,
         32872,
         67307,
         38222,
         13503,
         56120,
         27224,
         33927,
         42176,
         25884,
         20813,
         31661,
         50812,
         37264,
         32035,
         42597,
         39233,
         32221,
         20858
      ],
      "backdrop_path": "/h8XSKsG0nv86MMbMOgn4BBaDKcO.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jim Sanders",
               "gender": 2,
               "credit_id": "52fe4590c3a368484e0627b1",
               "name": "Michael E. Knight",
               "profile_path": "/buTyvVskoDcn9yvzlakNPs3nS4X.jpg",
               "id": 100591,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Patty Winston",
               "gender": 1,
               "credit_id": "52fe4590c3a368484e0627b5",
               "name": "Phoebe Cates",
               "profile_path": "/zOUE6cOZjFGrIeqidjOfrONj98G.jpg",
               "id": 16171,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Angel",
               "gender": 0,
               "credit_id": "52fe4590c3a368484e0627b9",
               "name": "Emmanuelle Béart",
               "profile_path": "/dICNGDe2Sgz73Febl0TJZpEKO9f.jpg",
               "id": 4885,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Ed Winston",
               "gender": 2,
               "credit_id": "52fe4590c3a368484e0627bd",
               "name": "David Dukes",
               "profile_path": "/3mGdu1jF7TO66rUbyI6seaH5ahP.jpg",
               "id": 29792,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Ben Sanders",
               "gender": 2,
               "credit_id": "52fe4590c3a368484e0627c1",
               "name": "Vinny Argiro",
               "profile_path": "/ebfTJZ5KegV4Xqf3lJI18R1LUXA.jpg",
               "id": 100592,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Grace Sanders",
               "gender": 1,
               "credit_id": "52fe4590c3a368484e0627cb",
               "name": "Bibi Besch",
               "profile_path": "/zWpFXjzIS3cWI90bjrc9GfWMRpd.jpg",
               "id": 1794,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4590c3a368484e0627c7",
               "name": "Tom McLoughlin",
               "profile_path": null,
               "id": 63550,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5645f1839251410a440096f4",
               "name": "Tom McLoughlin",
               "profile_path": null,
               "id": 63550,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 3.743006,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 28370,
      "vote_count": 21,
      "budget": 0,
      "overview": "Aspiring composer Jim Sanders is engaged to spoiled rich girl Patty. But the morning after his bachelor party, Jim wakes up to discover a beautiful, broken-winged angel in his pool. When everyone finds out about his heavenly houseguest, Jim must cope with a dangerously jealous fiancée, an exploitive future father-in-law and a group of buddies with an outrageous business plan!",
      "similar": [],
      "original_title": "Date With an Angel",
      "runtime": 105,
      "poster_path": "/nv4mCEGRJH4dI62XfapGh9Q72fN.jpg",
      "spoken_languages": [
         {
            "name": "Český",
            "iso_639_1": "cs"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "De Laurentiis Entertainment Group (DEG)",
         "id": 484,
         "origin_country": ""
      }],
      "release_date": "1987-11-20",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Tom McLoughlin"],
      "runtime": 105,
      "synopsis": "At his engagement party, Jim Sanders (Michael E. Knight) seems not so sure about his engagement to Patty Winston (Phoebe Cates), a wealthy girl whose father Ed (David Dukes) is the head of a cosmetics firm. The party is cut short when 3 men enter in masks and take Jim away, throwing a grenade to the floor and sending everyone else scurrying from the vicinity. Shortly thereafter, the phone rings, and a voice claims that the grenade is a fake, infuriating Ed, and humiliating Patty. The kidnappers are actually Jim's friends, who shanghai him and return him to his place for a bachelor party, much to his chagrin. After leaving him drunk, Jim wakes up when a noise startles him, and going out back, he finds a woman with angel wings face-down in his pool. Taking her inside, Jim is now certain that she is a for-real angel, and notes that she appears to have broken her wing. The angel appears inquisitive but can't seem to speak except in a series of squawks and high-pitched squeals. The next day, Jim is surprised when his friends come over, and upon seeing the angel, begin to persuade Jim that he should exploit her for profit. Jim quickly kicks them out, but not before the three decide to proceed with their scheme without him. Patty also shows up soon after, but on seeing the Angel (but not seeing her wings), assumes that Jim has been two-timing her and leaves. Later that evening, Patty's father comes to see Jim about his daughter, but finds himself also enchanted by the angel. Her face soon causes him to consider trying to blackmail Jim to having her be his cosmetics company's spokeswoman (of which Patty's has currently been assigned, but has caused company profits to drop). In order to get the angel from Jim, his friends arrange for him to meet with Patty over a reconciliation. This buys them enough time to steal the angel away, while also rousing Patty's ire as Jim rushes off to save the angel. Jim manages to catch up to them the next day before they can reveal her to a press conference, and drives off with her. Soon, a search is made, but noone knows where Jim has gone. Secretly, Jim returns to a wooded area he knew as a kid, where he intends to help the angel mend her wing. Eventually, the others find Jim in the woods, from Ed, to Jim's friends (and his Dad), along with Patty, who has now become a murderous psycho intending to kill the angel. However, the angel soon reveals that her wing has since mended, and frightens off Ed and Patty, before ascending into the sky. In the aftermath, Jim collapses to the ground, and his friends and his Dad rush him to a hospital. It soon is reported that Jim had a cerebral hemorrhage, and may not survive. As he lays in the hospital bed, the angel appears to him, and Jim remarks that he thinks he knows why she landed near his house: she was meant to take him in death. The next day, Jim's friends enter, but are soon shooed away by a blonde-haired nurse, who claims that Jim needs rest. As they look at her, a familiar look crosses their face. Once they leave the room, the nurse turns to Jim, and we see that it is the angel, who has become human due to being on 'good behavior.' She also claims that she and Jim will have a long and happy life together.",
      "writers": ["Tom McLoughlin"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0092834/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI0NzE5MjA5Nl5BMl5BanBnXkFtZTcwOTc2MjMyMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Phoebe Cates, Emmanuelle Béart, Michael E. Knight | See full cast and crew »"],
      "reviews": [
         "Date with an angel is one of my favourite, and as far as I know most of my friends love this one just as I do. I just can't figure out why such a lovely movie gets soooo underrated :( yeah, maybe the plot is a bit simple, and maybe the special f/x is just a joke compared with \"the jurassic park\" and \"the matrix\", but this movie makes me feel good. it makes you believe that there are so many wonderful things in this world: beautiful love, funny friends and adorable angel... If you watch this movie with high expectation, it's gonna fail you; but if you just wanna relex and get yourself one and a half hour of fun, it's a must-see!!!",
         "Oh my God people no a days have no taste so ever ... Where is everybody's humor... I was reading some of the comments people made about this fim. I just do not understand why they hate it so much... Yes, it is true this film is out dated but we need to remember that it came out 17 years ago!!! (Special effects were not the same as they are now)The first time I watched it, i FELL IN LOVE WITH IT.. It was romantic and hilarious! So what! if the Angel didnt talk, her beauty itself did the talking for her.. I really loved this film, I remember when it first came out on the theaters, I was only 7 years old...I do wish that this film would have had a better rating.. I think is one of the most unforgettable romantic/comedies I've ever seen. People need to start being less bitter now a days..!",
         "This film happens to be one of my most favorite movies i've seen. I remember watching this film as a kid and there's just something about it every time i see it. Actually the film was made in the town i visit everyday or almost everyday. It allows me to feel really good every time i see it. Almost makes me believe that an angel will come and visit me. Not to be sappy but i get a little teary from the film.(it takes a real man to admit) and every time i eat french fries it hits me again. Although the acting was not the greatest, but hey its the 80s gotta love it!!! Not like the 90s and 2000s have any better acting. And yes in closing i have the DVD of this film to watch over and over again!!! Its just a good feel Good movie!! highly recommended!",
         "Phoebe Cates was perfect in her shaking-mad scenes. It was just like in \"Top Gun\", where the air-control tower-guy spilled coffee all over himself during a 'fly-by'. One of the funny scenes showed three of Michael E. Knight's buddies knocking at his door in the beat of a classic hit. That was unique. The movie had touching parts as well, like when he awakens in the hospital, sees 'Angel', (Emmanuelle Beart), and finally understands she had come originally to carry him 'over', so to speak. Alas! She couldn't carry out her mission, having fallen for him ... The movie deserves a higher rating!",
         "Forget the script. Forget the acting. Never has such beauty leapt off the screen as it did with french actress, Emmanuelle Beart. My reaction was much like that of the characters on screen. MESMERIZED!!! I am forever in this films debt for the american introduction of this incredible woman. Thank you!",
         "When I was a very young lad I used to watch this movie again, and again, and again. I don't why but this, innerspace, ghostbusters (1 and later 2) and beetlejuice were the crown jewels of my video library. It may be campy, but it has a pretty good storyline and a slew of hilarious moments. Let's face it it's still betetr than 90% of the movies that came out this year--and most of the late nineties--UNder the tuscan Sun, I\"m looking in your direction. Anyway Phoebe Cates and the model angel chick are wicked hot--and really random thigns like a singing love-o-gram dressed as a beetle pop-up in the flick. For a late eighties romantic comedy, the plot is actually somewhat interesting and doesn't involve shenanigans with a dead boss, a secret party island, or either of the corey;s. It's good times.",
         "Nothing made sense until he saw her again, and then everything fell into place. Her mission was derailed by a broken wing. Her target was him, and those headaches were the red lights flashing, warning. But if the mission had gone as planned, the layers of his life would never have been pulled away, and he would never have found true love. But now it was time to go. Love is a mystery that walks beside us, and what we think is love is merely the illusion. And as our eyes struggle to hold it are we captivated by stories, movies from the heart. And complicated lives weave into delicate webs, and lies, betrayal, and greed try to cut those threads. And as the story lines hold us in its hand, we laugh, and we cry. And in the end, love survives, and Date With An Angel soars high.",
         "Minor Spoilers (I think) I remember seeing this film as a teen. I thought it was a great film, back then. I just saw it again and well. Yes, it was an eighties film, pretty typical. The story line was just okay. It got better in the end when he \"figured it out\" because, I sure didn't. I didn't even remember that from the first time I saw it either. The parts that stuck with me all these years were those of the Angel (Emmanuelle Beart) I was completely taken in by her etherial beauty. I love the scenes in the forest with her and the animals. When she lights up, well, it's worth watching for the sight of her alone. She has a grace and innocent charm that suits her role perfectly. Delightful. Phoebe Cates plays Patti the hero's, fiancée and gives a great performance. Unfortunately, it's a very one dimensional role and does not put her in a good light. They (writers/directors) have given her no redeeming qualities. Personally, I think she's a lovely girl, but she's not at all in the same league as Ms. Beart. Our Hero, Jim (Michael E. Knight), rescues the Angel in distress and behaves like a true prince. He has much to deal with trying to do the right thing and has no one but himself to depend on. I suppose, it's very much like a modern (well '80's) fairy tale. But all the characters are very one dimensional. Simply uncomplicated. And about the comments on whether Angels can speak, well, who can argue?! I suppose there are Angels like Gabe, and Mike that are vocal messengers. But this Angel's task was not to bear a message, she was to bring solace, peace, if you will. I think her eyes and facial expressions spoke volumes and words alone could never convey the intensity and sensitivity of the situation. I gave this movie a 10/10 simply for the eye-candy.",
         "All the scenes between the angel Emmanuelle Béart and Michael E. Knight were great, even brought me to tears near the end. But all the other characters, with the possible exception of Michael's father, were played as cartoons. Why the writer/director would make such a decision I cannot fathom. The angel costume/character is absolutely beautiful, wings and all, as is the lighting. I do so wish the ending had been the opposite - personal preference. After such a build-up during the penultimate scene, I was let down. Also wish we were allowed shorter reviews as in the past. It is difficult to come up with additional commentary when there wasn't much of value to view. When a project such as \"Date With An Angel\" offers employment to so many and takes such an effort on the part of the actors and crew, one would hope that the daily rushes would give a clue to the eventual outcome.",
         "Anybody who looks at this film, will say what a unimaginative story, nervetheless at leat a bit entertaining.... But in a contrast to this, the soundtrack is a very special one. The music is by Randy Kerber / Sound Design by Dane Tracks. Singing composition and additional voice is by Avant Garde diva Joan La Barbara. Her voice is uttering in a peculiar way. Not human, maybe angelic?! - Usely angels in films sing like saloon sopranos from the 19th century in very kitschy manner. The music in the film is very kitschy, too. But the voice of La Barbara ist relativating the rest of the film."
      ],
      "genres": [
         "Comedy",
         "Fantasy",
         "Romance"
      ],
      "productionCompanies": [
         "De Laurentiis Entertainment Group (DEG)",
         "De Laurentiis Film Partners"
      ],
      "summaries": ["Jim is soon to be married to Patty, but when he wakes up after a bachelor party thrown by his friends, he finds an injured angel in his pool. When Patty sees her, she thinks he's seeing someone else and gets upset and tells her father. Now he has to figure out how to; cure the angel, tell Patty what happened, keep his friends from taking the angel to the papers, and keep Patty's father from killing him. It's no wonder he has a headache."],
      "budget": 8000000
   },
   "movielensId": 3393,
   "movielens": {
      "languages": [
         "Český",
         "English"
      ],
      "releaseDate": "1987-11-20",
      "dvdReleaseDate": "2002-05-21",
      "directors": ["Tom McLoughlin"],
      "runtime": 105,
      "movieId": 3393,
      "title": "Date With an Angel",
      "mpaa": "PG",
      "actors": [
         "Michael E. Knight",
         "Phoebe Cates",
         "Emmanuelle Béart",
         "David Dukes",
         "Vinny Argiro",
         "Bibi Besch"
      ],
      "imdbMovieId": "0092834",
      "originalTitle": "Date With an Angel",
      "genres": [
         "Comedy",
         "Fantasy",
         "Romance",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["OAQXV8_Oi7w"],
      "plotSummary": "Aspiring composer Jim Sanders is engaged to spoiled rich girl Patty. But the morning after his bachelor party, Jim wakes up to discover a beautiful, broken-winged angel in his pool. When everyone finds out about his heavenly houseguest, Jim must cope with a dangerously jealous fiancée, an exploitive future father-in-law and a group of buddies with an outrageous business plan!",
      "tmdbMovieId": 28370,
      "avgRating": 2.39316,
      "releaseYear": "1987",
      "numRatings": 234,
      "posterPath": "/nv4mCEGRJH4dI62XfapGh9Q72fN.jpg"
   }
}