{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "texas",
            "id": 1556
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "on the run",
            "id": 10562
         }
      ],
      "imdb_id": "tt0093596",
      "video": false,
      "title": "Nadine",
      "recommendations": [
         18713,
         75889,
         24909,
         96333,
         115565,
         25720,
         62676,
         24453,
         91580,
         55916,
         112136,
         61144,
         146563,
         195435,
         29185,
         54109,
         19373,
         72881,
         90949,
         41090
      ],
      "backdrop_path": "/nU1h3NVVqlieQVMr3nskGcBNY22.jpg",
      "revenue": 5669831,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Vernon Hightower",
               "gender": 2,
               "credit_id": "52fe4648c3a368484e08837d",
               "name": "Jeff Bridges",
               "profile_path": "/xms1RAY6q7Lzp7wNeRCB0kzhucn.jpg",
               "id": 1229,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Nadine Hightower",
               "gender": 1,
               "credit_id": "52fe4648c3a368484e088381",
               "name": "Kim Basinger",
               "profile_path": "/xpv6NgpY0mDr5QSWjZLXy5KlFn9.jpg",
               "id": 326,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Buford Pope",
               "gender": 2,
               "credit_id": "52fe4648c3a368484e088385",
               "name": "Rip Torn",
               "profile_path": "/rzGaoGikjMuLDruABKdLcQLtkZk.jpg",
               "id": 9626,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Vera",
               "gender": 1,
               "credit_id": "52fe4648c3a368484e088389",
               "name": "Gwen Verdon",
               "profile_path": "/tOPI0ZXMnVAoDBHBkK0lZkyEPxp.jpg",
               "id": 54122,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Renée Lomax",
               "gender": 1,
               "credit_id": "52fe4648c3a368484e08838d",
               "name": "Glenne Headly",
               "profile_path": "/a90ZslKOvecuy7doMWXsFc1Aoc4.jpg",
               "id": 21104,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Raymond Escobar",
               "gender": 2,
               "credit_id": "52fe4648c3a368484e088391",
               "name": "Jerry Stiller",
               "profile_path": "/wyleNpBLMLZ9CNjl13hNB8zoFIa.jpg",
               "id": 26042,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4648c3a368484e088379",
               "name": "Robert Benton",
               "profile_path": "/wVaHC1VX9yBg9MIEC7POAJ0JlUo.jpg",
               "id": 6729,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "555b3fa4c3a36810890022bd",
               "name": "Robert Benton",
               "profile_path": "/wVaHC1VX9yBg9MIEC7POAJ0JlUo.jpg",
               "id": 6729,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5a80c5d9c3a3681893028697",
               "name": "Ronald W. Moore",
               "profile_path": null,
               "id": 222986,
               "department": "Art",
               "job": "Art Department Assistant"
            },
            {
               "gender": 2,
               "credit_id": "5ac2ce340e0a260c010262f6",
               "name": "Néstor Almendros",
               "profile_path": "/3O9fLu6Mc1AYHHOh3DFwSO9vveY.jpg",
               "id": 3569,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5ac2ce449251412720028ac8",
               "name": "Sam O'Steen",
               "profile_path": null,
               "id": 12015,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5ac2ce51c3a368443f068157",
               "name": "Howard Shore",
               "profile_path": "/4HbFF5o13GkO0rHi4OVXXMb7U5L.jpg",
               "id": 117,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "5ac2ce96c3a3684448070e63",
               "name": "Paul Sylbert",
               "profile_path": null,
               "id": 19045,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.391593,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 61178,
      "vote_count": 24,
      "budget": 12000000,
      "overview": "Hairdresser Nadine Hightower wants to retrieve the risqué photos she once posed for, but when she visits the photographer at his office, he's murdered by an intruder. Nadine talks her estranged husband, Vernon, into going along when she returns to the office, where they stumble across plans for a less than legal construction project. But when Vernon tries to turn the documents into a cash windfall, he and Nadine are pursued by goons with guns.",
      "similar": [
         984,
         96,
         357096,
         445954,
         10651,
         15069,
         2749,
         4639,
         15762,
         37645,
         8456,
         1572,
         4638,
         193893,
         260346,
         49524,
         27576,
         241554,
         395990,
         948
      ],
      "original_title": "Nadine",
      "runtime": 83,
      "poster_path": "/mim8TLLXmD3ui03f9jVmOXGACv8.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/rzgMLzPgJ2ZBYnlVwNi8ZDfOMwo.png",
         "name": "TriStar Pictures",
         "id": 559,
         "origin_country": ""
      }],
      "release_date": "1987-08-07",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "They're a couple on the run... from each other.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Robert Benton"],
      "runtime": 78,
      "synopsis": null,
      "writers": ["Robert Benton"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0093596/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzQyOTQwNTk4OF5BMl5BanBnXkFtZTcwNzcwMDAzMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Jeff Bridges, Kim Basinger, Rip Torn | See full cast and crew »"],
      "reviews": [
         "I thoroughly enjoyed this comedy caper movie set in the Deep South, and I can't understand why it has such a low average vote. Kim Basinger and Jeff Bridges play a divorced couple who team up to solve a murder mystery and end up re-igniting their relationship. The two have a good on-screen chemistry which, along with the comic-book-style humour and plot, is what makes the movie. All in all an enjoyable comedy/romance/thriller/caper/adventure affair with style and wit. 9/10",
         "I say 'surprisingly' because the rating is so low, I didn't know what to expect. But it's a delightful little caper movie, driven (as all good movies are) by the performers and a tight script by Robert Benton, not known for his enjoyable caper movies! Jeff Bridges all but steals the film from a delightful Kim Basinger, and the two of them together set the screen on fire. They are surrounded by some of the best character actors working today, including Rip Torn. As I was watching this I thought how smart Robert Benton is for casting real actors, and having the comedy come out of their behaviour and talent, rather than casting 'wacky comedians' and reducing the story to little bits. A lot of fun, and worth seeing.",
         "Let me begin by saying I am just astonished to see the low average of viewer comments for this splendid movie. I just have to figure the commenters are a bunch of Yankees who never set foot in the South and have no feel for the slow, quiet humor that this fine film represents. But even that cultural adjustment doesn't explain the complete failure of these other reviewers to appreciate a really finely drawn comedy, from beginning to end. This is a wonderful work by the fine writer and director Robert Benton, who defies the axiom, Comedy is hard. He makes it look easy. What he did was simple, looking back, but so very hard for most people to do: He set up a funny plot and kept it funny from one scene to another, by keeping it low key and letting the characters carry the humor lightly, one slightly ridiculous moment after the other, thus avoiding the great comedic danger: You can kill comedy by overworking it. Benton takes a plausible story about some Texas corruption and discovered maps with some amusing twists to it and jacks it up with some great dialogue and some fine actors -- mostly Southern, as it happens: the fine actor Rip Torn (birth name, Ripley J. Torn, Jr., Texas) and Kim Basinger (Alabama). Robert Benton himself is from Waxahatchie, Texas, and wrote the screenplay with full knowledge and confidence of the plausibility of the plot and the reality of his characters. Folks, I know lots of people like these characters. So do you. Good people, simple people, women who on the phone who soon ask, How's yer Mom 'n 'em? And Benton has given them a moment of great adventure and humor. A few gems: Jeff Bridges: \"I'm not in the Vernon Darlin' business anymore.\" Basinger naming her early fetus Doris Isabel and talking to her. Rip Torn: \"Why is it you work your butt off all your life to get ahead and it takes two nitwits about ten minutes to screw the whole thing up.\" And in her most glorious beauty, Glenne Headley as the girlfriend, full of Texas spunk. I truly pity the Yankees and Californians west of Bakersfield who cannot see the beauty of this film. But you know what? We don't need you. This movie is like Elvis. It will live forever.",
         "This film isn't very well known, and should be, especially for Kim Basinger fans. It proves once and for all that comedy is her forte, and that she has broad range between performances such as this and her role in \"Fool for Love\" as a character actress, and not just a pretty face or an adequate leading lady. The chemistry between her and Jeff Bridges is like TNT and drives the film forward, and the added comic bluster of Rip Torn as the villain (and the clever script and direction by veteran Robert Benton) makes this a comic gem in the true tradition of the 1930s screwball comedies, but updated for the 1980s. If you're a fan of such films as \"His Girl Friday,\" and would like to see what that frenetic energy and great chemistry can be like updated into the 1980s, see this movie!",
         "This movie easily makes it into my top 10. I loved it when it came out in the 80's and still watch my VHS copy often. For some reason it just struck a chord with me- my family often quotes lines from \"Nadine\" to each other. I was quite puzzled to see such a low score and wanted to add my opinion that it seriously does not get much better for this type of movie. The script is excellent and it is perfectly acted. Jeff Bridges and Kim Basinger are amazing together, but every character is a scene stealer. The movie moves along at a good pace, with lots of laughs and plenty of action. I highly recommend it, and it has really kept its appeal, even 21 years later.",
         "Okay, so this movie didn't do great when it came out in the late eighties. I think it was because it was set in another era. But I happen to think this is one of those movies that once you've seen it, it stays with you. The plot is predictable, the action is a little on the slow side, and it veers off funny a few times. However, that being said, Kim Basinger single handedly MAKES this movie. Don't get me wrong Jeff Bridges does a great job too, but it's Nadine that gives the movie it's spark and it's wittiest moments. Basinger is picture perfect because YES, she is beautiful, but she REALLy inhabits the dialogue and her character. She acts beautifully and really seems to be having a great time. My favorite two scenes are when Vernon and Nadine are driving to the photography studio and later when they are alone in his trailer. The scene in the car is all about dialogue and establishing who these two are to each other and it's done amazingly well in a short time. Basinger's dialect alone will make you laugh. \"I don't know Vernon, she look a little on the chubby side to be Pecan Queen\" and \"You know me Vernon, they don't bother me, I don't bother them\". She's referring to her spark plugs. I don't know why, but I LOVE her in this scene. It's just seems effortless. And the scene in his trailer, where they are too close for comfort and it starts rekindling that old flame. Chemistry is amazing in this scene, like they can barely exist near each other. I highly recommend watching this some night, where you don't have to be up doing laundry or dusting your knick knacks. Pop some popcorn and give this one a chance.",
         "This energetic comedy is entertaining the moment the title appears on the screen. Set in a rural town a beautician witnesses a murder and then is expected of doing the killing. Now she must run from the killers and the cops. This movie is an instant classic. 10/10",
         "This is a very cute comedy caper movie. Kim Basinger is perfect as the ditsy West Texas small town girl, and Jeff Bridges is great as her even dumber husband. Rip Torn is also good as the villain. Plot is pretty simple, but fun. I've shared this with several others in the 35+ year old class, and they all enjoyed it. Very good chemistry between the leads.",
         "I'm not sure where I was in 1987 when this film came out, but I saw it for the first time tonight, and I'd never heard of it. I found it highly entertaining. Kim Basinger is Nadine, a pregnant, soon to be divorced woman living in small-town Texas in 1954. She posed for some \"art studies and wants to get them back from the sleazy photographer (Jerry Stiller) who told her that he knew Hugh Hefner. She's very insistent, so he lets her into his studio, even though he has an appointment coming, and sticks her in the back room. When he opens the door with what seems to be her file, he falls over, dead from a knife in the back. Nadine grabs her file and gets out of there. When she arrives home, the file has maps of an area of town in it. She lies to her ex-husband (Jeff Bridges) so that he will return to the studio with her; soon, they're on the run from the police - and the owner of the maps (Rip Torn). This is a funny, fast-moving comedy with excellent performances from Bridges, Basinger, Torn, Stiller, Glenne Headley as Bridges' girlfriend, and Gwen Verdon, who plays Nadine's boss. Written and directed by Robert Benton, \"Nadine\" is a small film and an enjoyable one. Recommended.",
         "In 1954, in Austin, Texas, the sexy Nadine Hightower (Kim Basinger) pays a visit to the photographer Raymond Escobar (Jerry Stiller) begging him to retrieve the photos he took from her since she believed that he would show them to Hugh Hefner. He gives an envelope to her mistakenly with the plans of the route of a new road instead and while she is waiting to leave his office, he is murdered bu his client. Nadine becomes the prime suspect and when her ex-husband Vernon Hightower (Jeff Bridges) visits her asking to sign the divorce papers, he sees the documents and realizes that they are valuable. While Vernon wants to make money with the documents, the powerful criminal Buford Pope (Rip Torn) chases Nadine and Vernon to retrieve the plans. \"Nadine\" is an entertaining romantic adventure, with Kim Basinger and Jeff Bridges showing a great chemistry. Maybe the best thing in this movie is the chance to see Kim Basinger in the top of her beauty and sensuality. My vote is six. Title (Brazil): \"Nadine - Um Amor a Prova de Balas\" (\"Nadine \u0096 A Bullet Proof Love\")"
      ],
      "genres": [
         "Comedy",
         "Mystery",
         "Romance"
      ],
      "productionCompanies": [
         "TriStar Pictures",
         "ML Delphi Premier Productions"
      ],
      "summaries": [
         "Working in an Austin, Texas, beauty parlour in 1954, Nadine Hightower endeavours to retrieve some 'art studies' she injudiciously had taken. Her visit to the photographer leaves him dead and her in possession of highly valuable plans of a proposed new road. With both the police and the murderous villains after her she enlists the help of her (almost) ex-husband Vernon, the none too successful owner of the Bluebonnet Bar. Fortunately the thugs are as much no-hopers as the Hightowers.",
         "In 1954, in Austin, Texas, the sexy Nadine Hightower pays a visit to the photographer Raymond Escobar begging him to retrieve the photos he took from her since she believed that he would show them to Hugh Hefner. He gives an envelope to her mistakenly with the plans of the route of a new road instead and while she is waiting to leave his office, he is murdered bu his client. Nadine becomes the prime suspect and when her ex-husband Vernon Hightower visits her asking to sign the divorce papers, he sees the documents and realizes that they are valuable. While Vernon wants to make money with the documents, the powerful criminal Buford Pope chases Nadine and Vernon to retrieve the plans.",
         "In 1950s Texas, a woman trying to recover sexy photos of herself and divorce her husband witnesses a murder and uncovers corrupt land dealings."
      ],
      "budget": 12000000
   },
   "movielensId": 3395,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1987-08-07",
      "dvdReleaseDate": "2005-07-05",
      "directors": ["Robert Benton"],
      "runtime": 83,
      "movieId": 3395,
      "title": "Nadine",
      "mpaa": "PG",
      "actors": [
         "Jeff Bridges",
         "Kim Basinger",
         "Rip Torn",
         "Gwen Verdon",
         "Glenne Headly",
         "Jerry Stiller"
      ],
      "imdbMovieId": "0093596",
      "originalTitle": "Nadine",
      "genres": [
         "Action",
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["4o-AGzZaWtI"],
      "plotSummary": "Hairdresser Nadine Hightower wants to retrieve the risqué photos she once posed for, but when she visits the photographer at his office, he's murdered by an intruder. Nadine talks her estranged husband, Vernon, into going along when she returns to the office, where they stumble across plans for a less than legal construction project. But when Vernon tries to turn the documents into a cash windfall, he and Nadine are pursued by goons with guns.",
      "tmdbMovieId": 61178,
      "avgRating": 2.63406,
      "releaseYear": "1987",
      "numRatings": 276,
      "posterPath": "/mim8TLLXmD3ui03f9jVmOXGACv8.jpg"
   }
}