{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0088760",
      "video": false,
      "title": "Baby: Secret of the Lost Legend",
      "recommendations": [
         25674,
         61698,
         42158,
         61651,
         56120,
         20551,
         31608,
         24073,
         34014,
         3288,
         59585,
         34390,
         39479,
         79500,
         30709,
         14361,
         5333,
         25973,
         11718,
         7269
      ],
      "backdrop_path": "/6xEREiGHs7XoP6xx31iRaZKdPnS.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "George Loomis",
               "gender": 2,
               "credit_id": "52fe47ee9251416c750aa381",
               "name": "William Katt",
               "profile_path": "/8zgHplikymFmzQhOuwYhin6WJv6.jpg",
               "id": 45415,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Susan Matthews-Loomis",
               "gender": 1,
               "credit_id": "52fe47ee9251416c750aa385",
               "name": "Sean Young",
               "profile_path": "/4zgkRFQruIlaJ4JakNZLoKJ70fH.jpg",
               "id": 586,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Doctor Eric Kiviat",
               "gender": 2,
               "credit_id": "52fe47ee9251416c750aa389",
               "name": "Patrick McGoohan",
               "profile_path": "/2M6rJ8tvLg3Ztp0s5PrwDbqFMcu.jpg",
               "id": 2463,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Nigel Jenkins",
               "gender": 2,
               "credit_id": "52fe47ee9251416c750aa38d",
               "name": "Julian Fellowes",
               "profile_path": "/kf38Wij4DyNyVFFL9HokomrQNkc.jpg",
               "id": 10747,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Dr. Pierre Dubois",
               "gender": 2,
               "credit_id": "58c4ad22c3a368164100473c",
               "name": "Edward Hardwicke",
               "profile_path": "/21PRsSZBTaTrqq2wPwDUjRLSUjG.jpg",
               "id": 3545,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Kenge Obe",
               "gender": 2,
               "credit_id": "58c4ad44c3a3681641004762",
               "name": "Hugh Quarshie",
               "profile_path": "/b6RSuGFTvpDe3WIdWglzfs0kyES.jpg",
               "id": 31925,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe47ee9251416c750aa393",
               "name": "Bill L. Norton",
               "profile_path": null,
               "id": 58075,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47ee9251416c750aa399",
               "name": "Clifford Green",
               "profile_path": null,
               "id": 65363,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe47ee9251416c750aa39f",
               "name": "Ellen Greene",
               "profile_path": "/nJzE8dS38hxbALr5LZ88BYt8dm0.jpg",
               "id": 13420,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "56e9e7a1c3a3682d6f0044ce",
               "name": "Paul Huston",
               "profile_path": null,
               "id": 1424133,
               "department": "Visual Effects",
               "job": "Visual Effects"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 2.479144,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 19736,
      "vote_count": 29,
      "budget": 0,
      "overview": "Paleontologist and her husband discover a mother and baby brontosaurus in Africa, try to protect them from hunters who want to capture them.",
      "similar": [],
      "original_title": "Baby: Secret of the Lost Legend",
      "runtime": 95,
      "poster_path": "/mYYAzvVr4JJxJ89mlgETWJWcznK.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/ou5BUbtulr6tIt699q6xJiEQTR9.png",
         "name": "Touchstone Pictures",
         "id": 9195,
         "origin_country": ""
      }],
      "release_date": "1985-03-22",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Bill L. Norton"],
      "runtime": 95,
      "synopsis": null,
      "writers": [
         "Clifford Green",
         "Ellen Green"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0088760/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzcwODA5NjMzMl5BMl5BanBnXkFtZTcwNDcxMDIyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: William Katt, Sean Young, Patrick McGoohan | See full cast and crew »"],
      "reviews": [
         "Let me confess at the start that: 1) I'm definitely fond of dinosaurs and paleontology in general. This interest LONG predates \"Jurassic Park\". If a paleontology major had been available in my college, in the early 60's, that would have been my choice. 2) I've also ALWAYS been a big fan of animation and related effects, such as the dinosaurs. This movie had by far the best dinosaur effects of any prior to \"Jurassic Park\", even better than in \"The Valley of Gwangi\". The baby brontosaurus (actually apatosaurus) was perhaps a little too cutsey with its blinking eyes but otherwise the film captured details of movement, including musculature and skin, very well. This was at its best when the mother dinosaur was chasing the bad guys in their vehicle. Needless to say I was very sympathetic with the efforts of the paleontologists to rescue the dinosaurs. I also enjoyed some of the people \"antics\" such as the natives spitting out the granola bars (hippy food) from the sides of their mouths while pretending to like it. An enjoyable movie if a little saccharine.",
         "This is an almost totally entertaining flick which never flags; not in its tongue in cheek dialogue; not in its plot sequences; not in its amazing technical achievements (for its time) in getting the dinosaurs up and running. Sure the acting is pretty much black and white with Patrick McGoohan dispensing villany on the order of Gengis Khan on a bad day and William Katt and Sean Young surmounting all obstacles with a brio and dispatch that would have Arnold panting. There is also Baby herself, consistently endearing though up to, never over, the line. But one doesn't expect a movie about dinosaurs to take time out for character development. What there is of it is in the overly graphic scene of the female dinosaur mourning her slaughtered mate, a transcendent sequence that almost rips the fabric of the piece apart. That it manages to gets back to fantasy after this is a tribute to director B.WE.L. Norton and the frenetic pace he generates throughout. If you never had a dinosaur as a pet, you may be on the lookout for one after seeing Baby.",
         "The problem with cutting edge technology is that it can very soon look laughably obsolete. Any modern watcher will just laugh at the creaky old Brontosaurii. So lets talk about the people. Sean Young plays her role reasonably well. A pretty, long-legged female Palaentologist is always going to struggle to be taken seriously. The other pretty long-legged Palaentologist, playing her husband, made the automaton dinosaurs look almost convincing. He was atrocious. For a kids movie it is fairly risqué. There are some topless dancers, an almost-sex scene between the young lovers and some cold-blooded and murderous behaviour from my only reason for watching: Patrick McGoohan. He plays Dr. Kiviat and almost the first scene finds him viciously stabbing another scientist to steal some information about the location of the lost dinosaur he has spent his life searching for. The unexpectedly perceptive Sean Young is also on the hunt however and sends Kiviat on a wild pterodactyl chase. Kiviat is not to be outdone and employs the corrupt military to assist him in finding the lost creatures. Once again (for a kids movie) the soldiers behave ruthlessly as they attempt to shoot the young Palaentologists and succeed in annihilating the father-dinosaur. Unbeknownst to Kiviat there is a baby Brontosaurus which has been befriended by the young couple. Eventually they fall into the scientists hands. There is a scene which actually took me by surprise. Kiviat is in conversation with the military leader. It becomes evident that the officer seems even more dangerous than the scientist. McGoohan kills him. He plays the scene in such a way that I was convinced he was having a change of heart; so I was genuinely shocked when he emerges from the tent, raises the alarm and blames the young couple for the murder!! You just can't keep a good actor down. Eventually McGoohan is eaten by the mother dino who rescues her Baby and so it ends. Rights are wronged - is that what I meant? I have read that this movie was plagued by technical difficulties. The robots that worked so well in the factory became very cranky in the hot African jungle locations. Long delays in shooting scenes could explain the fraught appearance of some of the actors. Today, if you spend time at Disneyworld, more than one exhibit has \"Baby\" genes plain to see in their heritage. I also noticed in the credits that Rose Tobias-Shaw was the casting director for the film. So that's how they got McGoohan ?!",
         "The unbelievably awkwardly titled Baby: Secret of the Lost Legend was an even more problematic attempt by Disney to update their family fare for an audience that increasingly avoided films with the Walt Disney logo than The Black Hole was a few years earlier (it was released by Disney's 'adult' label Touchstone with a much more deserved PG rating). On one level it's an apparently family-friendly Gorgo-esquire tale of Sean Young and William Katt discovering a would-be cute baby dinosaur in the African jungle and trying to protect it from Patrick McGoohan's ruthless palaeontologist, but it's also set in a much more realistic Africa than you'd have seen had Uncle Walt been calling the shots, rife with civil war, dictatorships, corruption and violence. Think E.T. with AK47s. When Baby's pop gets machine-gunned to death by government troops, it's certainly a reminder that executive producer Roger Spottiswoode cut his teeth as one of Sam Peckinpah's editors on Straw Dogs and The Getaway. Unfortunately, undercutting the realism is Baby itself. While the Mokele Mobembe, Africa's own land-based Loch Ness Monster, may be a dinosaur, it's not one of the really cool ones like a meat-eating Tyrannosaurus Rex, Allosaurus or Velociraptor but a Brontosaurus (or Apatosaur as they're now known), famed for lumbering along while chomping on the local flora and fauna. To make matters worse, since this is pre-CGi, and with stop-motion too complicated for the jungle locations and Jurassic Park technology still a long way off, that means animatronics and men in rubber suits. While the grown-up critters just about pass muster, junior is a particularly unconvincing bit of rubber and latex with big eyes and limited expression\u0085 As a result the film is particularly schizophrenic as it hovers between the realistic and the ridiculous: it's too violent for the grownups and the beastie's too childish for the teens, though it still manages to score some points as a sporadically guilty pleasure. Jerry Goldsmith's score is an interesting bridge between his work on Legend and his subsequent score for Rambo: First Blood Part II, with some good action cues and a fine, albeit brief, fanfare for the dinosaurs. And you do get to see the writer of Gosford Park chased by an angry momma dinosaur\u0085",
         "I saw this movie when I was probably the age of 3-6 years old..and that was the last time I saw it. It's one of my earliest childhood memories of a movie.. It was a favorite. If anyone..like the idiot before me, thinks this movie is not suitable for children..and needs an R rating, should not be allowed to write comments on movies. This movie was amazing, and geared specifically for a child viewer. In fact, if memory serves correctly..Isn't this a Disney produced movie? If Children are allowed to play video games with guns and violence, I don't think a little National Geographic topless Indian women will be harmful to children. They'll probably not even notice.",
         "Some people are so obsessed with breasts. GET OVER IT! African women don't wear shirts, so why should movies that represent that culture shield anyone from it? Why is this country to sensitive to ethnic nudity? If you think it's too much for your children to see, then don't let them watch it, and most certainly keep them away from the Discovery\u0099 channel, or any other channel that may deal with cultures in which nudity is seen as a sign of beauty and is perfectly natural. People need to stop being so sensitive. Get over it. As far as the movie goes, it's a wonderful story, and it will teach children about good and bad. Kids need to learn that the hero doesn't always rescue the damsel in distress and live happily ever after. It's easier to show them that through movies, that way when something in real life happens that they're not used to, they will be better equipped to handle it.",
         "The folks at Disney must have realized somewhere down the road that the title \"Baby: Secret of the Lost Legend\" was dumb, because when the movie aired on TV, the title was changed to \"Dinosaur: Secret of the Lost Legend\". However, a change in the title is not enough to save the movie. It's a pretty slow-moving movie, with significant padding here and there. While the movie was shot in Africa, a lot of the movie still looks like it was filmed on a Hollywood back lot. And while the dinosaurs look passable when seen at a distance, they look very phony when photographed close to the camera. (In fairness to director Bill L. Norton, he didn't think the special effects were ready, but Disney threatened to pull the plug on the project if filming didn't star promptly.) It's possible kids (YOUNG kids) might find this okay, but anyone older should be wary.",
         "Underrated Kids' Classic Everyone here on IMDb seems to be beating this film to death just because it has poor acting, special effects, and a cheesy story! SO WHAT? It's a kids' movie!!! I saw this film when it first came out and loved it. You have to be a total SOB to let below average film making get in the way of enjoying this flick about lovable young scientists trying to save a cute baby dinosaur from poachers. Don't take this film too seriously. Just relax and enjoy this movie with your kids! The plot: Newly wed scientists find dinosaurs alive and well in Africa. But of course there's an evil scientist Patrick McGoohan (Number 6) whom want to kill the dinosaurs and everyone who knows about them. The scientific couple must save a baby dinosaur and join with a primitive African tribe to rescue the mother dino from captivity. Like I said, don't take this film too seriously and keep in mind it's geared towards kids.",
         "naw. don't believe the bad reviews of this. those people are the kind of people who pass judgment without ever taking into account the facts about a film. they are also the kind of people who probably never appreciate anything hand crafted or anything prior to the year 2000. before there was 'Jurassic Park', there was this film. at that time in the 1980's, 'Baby' had the best Dino effects in film up to that point. yes it became severely dated a few years later with the 'Jurassic Park' films, but it's achievements for the time were considerable and should be properly noted and not mindlessly judged. i like the use of the Disney 'Audio-Animatronics' method. sometimes it can seem more real than CGI FX. i'm not saying this film is better than the 'Jurassic Park' films. it's not. but it actually is a more realistic depiction of paleontology. i mean the 'Jurassic' films were about fantasy and not any thing really factual. even though equally impossible, 'Baby' is more real. i like \"Dino\" movies. i love Dinosaurs and the more things made about them the better. i also love Disney movies. was this a Disney flick? pretty much so. it was released by Touchstone films, but it basically was conceived by the Disney staff. Disney's production designer john B. Mansbridge helped with this production and Disney in-law Ron Miller was also responsible at an early level in this film's evolution(no pun intended). Disney was the probably just afraid to put their name on this because of the adult content. i'm not talking about the African nudity. any anthropologist will tell you that's no big deal. i'm talking about the use of too much profanity and the sex scenes involving the scientist. that stuff is not appropriate for a Disney film. Walt would roll over in his grave and those scenes are not acceptable for children and do not further the action or plot. they are just there so the new \"Eisner\" Disney could prove it's all grown up. a disastrous move in my prudish opinion. aside from profanity and adult sex, everything, including the African nudity, is appropriate for children. in fact aside from the \"adult\" flaws the film is almost Tailor-made for the kiddies( i mean it's all about a baby Dinosaur). this is a cute film and feels very \"Disney\", but parents should be strongly cautioned about excessive profanity and sex scenes which are not appropriate for a Disney film.",
         "This is one of the great movies of the 80s in MY collection that I think about all the time. Baby: The Lost Legend is a great film but it is just to sad. I have seen this movie many times and each time I cry. I don`t want to go into detail. A note to Parents: If your children don`t like to see Dinosaurs get hurt then please don`t show them this because it will upset them and yes the scenes are that emotional. I recommend to show you kids either or all three films of Jurassic Park,The Lost World: Jurassic Park II and Jurassic Park /// if your kids like to see Dinosaurs at their best and not getting hurt. I`M not saying Baby: The Lost Legend is a bad film,no it isn`t at all. It has a tremendous build up,a good story,good acting,wonderful looking Dinosaurs,excellent score by Jerry Goldsmith, and it does have a good ending but its what happens before that. Please take MY advise or view the film before your children do please."
      ],
      "genres": [
         "Family",
         "Adventure",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Silver Screen Partners II",
         "Touchstone Pictures"
      ],
      "summaries": ["Paleontologist and her husband discover a mother and baby brontosaurus in Africa, try to protect them from hunters who want to capture them."],
      "budget": 0
   },
   "movielensId": 3401,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1985-03-22",
      "dvdReleaseDate": "2002-09-03",
      "directors": ["Bill L. Norton"],
      "runtime": 95,
      "movieId": 3401,
      "title": "Baby: Secret of the Lost Legend",
      "mpaa": "PG",
      "actors": [
         "William Katt",
         "Sean Young",
         "Patrick McGoohan",
         "Julian Fellowes",
         "Edward Hardwicke",
         "Hugh Quarshie"
      ],
      "imdbMovieId": "0088760",
      "originalTitle": "Baby: Secret of the Lost Legend",
      "genres": [
         "Adventure",
         "Fantasy",
         "Action",
         "Science Fiction",
         "Family"
      ],
      "youtubeTrailerIds": ["Wy58kS1Deb4"],
      "plotSummary": "Paleontologist and her husband discover a mother and baby brontosaurus in Africa, try to protect them from hunters who want to capture them.",
      "tmdbMovieId": 19736,
      "avgRating": 2.22358,
      "releaseYear": "1985",
      "numRatings": 615,
      "posterPath": "/mYYAzvVr4JJxJ89mlgETWJWcznK.jpg"
   }
}