{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0090219",
      "video": false,
      "title": "Turtle Diary",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Neaera Duncan",
               "gender": 1,
               "credit_id": "52fe4a8cc3a368484e159b03",
               "name": "Glenda Jackson",
               "profile_path": "/7o9KfeMoegPR5rY905vojh1Fadc.jpg",
               "id": 115573,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "William Snow",
               "gender": 2,
               "credit_id": "52fe4a8cc3a368484e159b07",
               "name": "Ben Kingsley",
               "profile_path": "/2Eu3j31JDJek70ZXLY6xfeUaJoR.jpg",
               "id": 2282,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "George Fairbairn (turtle keeper)",
               "gender": 2,
               "credit_id": "52fe4a8cc3a368484e159b0b",
               "name": "Michael Gambon",
               "profile_path": "/k6VxRs7xcG6DLEVM1izjb3UWSyC.jpg",
               "id": 5658,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "The Publisher",
               "gender": 0,
               "credit_id": "52fe4a8cc3a368484e159b0f",
               "name": "Nigel Hawthorne",
               "profile_path": "/jKG3trCa3RGE6h5yzjMOramfoed.jpg",
               "id": 15788,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Mr. Johnson (Neaera's neighbor)",
               "gender": 2,
               "credit_id": "588e163d925141183700b9a6",
               "name": "Richard Johnson",
               "profile_path": "/miDA5sN3ijfED6M4oRZ0NTdBfBR.jpg",
               "id": 20510,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Mrs. Charlie Inchcliff (landlady)",
               "gender": 1,
               "credit_id": "588e1659c3a36874a3009973",
               "name": "Rosemary Leach",
               "profile_path": "/vx4XTLfekw3RYQwFmAjnfSWAnvQ.jpg",
               "id": 96408,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Miss Neap (Flora)",
               "gender": 1,
               "credit_id": "588e166d925141183f00be3c",
               "name": "Eleanor Bron",
               "profile_path": "/6H07jrik14n83TOgqhbkqV86YP0.jpg",
               "id": 45453,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Harriet Sims (bookstore clerk)",
               "gender": 1,
               "credit_id": "588e1680c3a36874a3009993",
               "name": "Harriet Walter",
               "profile_path": "/vfpIPsC27D1ONVres7j3DgWYzdN.jpg",
               "id": 17477,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Mr. Sandor (the slob)",
               "gender": 0,
               "credit_id": "588e1694c3a368749700aece",
               "name": "Jeroen Krabbé",
               "profile_path": "/A5Mks6zi6Xzt9A8fxBWc3wdlvhx.jpg",
               "id": 1924,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Assistant Keeper",
               "gender": 2,
               "credit_id": "588e16b8c3a368749e00a26a",
               "name": "Peter Capaldi",
               "profile_path": "/elySeUbCxDkBq83GwinPnfcLs5t.jpg",
               "id": 12982,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Man in Bookshop",
               "gender": 2,
               "credit_id": "588e16c6c3a36874ac009807",
               "name": "Harold Pinter",
               "profile_path": "/zmnvgAEdRzgH1aQ3TwrfqHzy8Hb.jpg",
               "id": 26157,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4a8cc3a368484e159aff",
               "name": "John Irvin",
               "profile_path": "/A75sBHfUrcdG9BGQdwKh4akqWWn.jpg",
               "id": 17784,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "577b34409251412d8100111b",
               "name": "Russell Hoban",
               "profile_path": null,
               "id": 1571428,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "577b34609251415aed002a7f",
               "name": "Harold Pinter",
               "profile_path": "/zmnvgAEdRzgH1aQ3TwrfqHzy8Hb.jpg",
               "id": 26157,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.44851,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 123047,
      "vote_count": 4,
      "budget": 0,
      "overview": "Two separate people, a man and a woman, find something very stirring about the sea turtles in their tank at the London Zoo. They meet and form an odd, but sympathetic camaraderie as they plan to steal two of the turtles and free them into the ocean.",
      "similar": [],
      "original_title": "Turtle Diary",
      "runtime": 97,
      "poster_path": "/v2DLQlMrbU1jaKZ0nu6hfWvb56P.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "CBS Theatrical Films",
            "id": 46410,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "United British Artists (UBA)",
            "id": 26373,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "britannic",
            "id": 85945,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Samuel Goldwyn Company",
            "id": 798,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "British Lion Films",
            "id": 632,
            "origin_country": "GB"
         }
      ],
      "release_date": "1985-09-10",
      "vote_average": 8.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Irvin"],
      "runtime": 97,
      "synopsis": null,
      "writers": [
         "Russell Hoban",
         "Harold Pinter"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0090219/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk0ODgyMTc0NV5BMl5BanBnXkFtZTYwMDE3Mjg5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Glenda Jackson, Ben Kingsley, Richard Johnson | See full cast and crew »"],
      "reviews": [
         "\"Turtle Diary\" is a movie easily underestimated: the viewer is not 'pushed' through a nerve-wrecking plot and scenes. However, this movie rewards the viewer with an intimate and at times moving picture of common people in unusual circumstances. Ben Kingsley plays a totally credible single male living an undisturbed life as a book-selling clerk. During his daily visits to the giant sea turtles - rare animals on the brink of extinction - in the Zoo Aquarium he develops the moral conviction that the animals should be set free. He discovers that a female writer of nature books, who sometimes visits the bookstore where Kingley works, shares his vision and together with the zoo assistant they make a plan and prepare the illegal 'abduction' of the turtles. The movie succeeds in engaging the viewer in the plans and the suspense of the preparation while at the same time presenting a realistic and sometimes moving picture of daily life in the English lodging house where Kingley lives. There is even a little surprising romantic touch at the end of the movie. The movie invites the viewer to identify himself (and herself) with the main characters. There are reminders of classic Italian neo-realistic cinema in the combination of realism with the feeling of personal involvement it can evoke from the viewer.",
         "This is a film that takes its time to get where it's going, and you should savor every minute of it while it gets there. Nothing monumental happens in it, but it's a joy to watch the story unfold. As a shy and reclusive writer, Glenda Jackson watches the giant sea turtles swim around in their restrictive and small enclosure wishing she could set them free. Ben Kingsley is a shy and nervous book store owner who wishes he could do the same. These two eventually get together and plot to release them back into the wild, with the help of the turtle's keeper. Watching these two consummate actors twitch, stare and fume through their roles is part of the charm of the film; there is obviously some mental condition that Jackson's character is suffering from, but we never get a clear idea of what it is. She was at one time was a successful author but seems not to be able to write anymore. Her mind is in some way cornered within a small space trying to break free, in a way that makes her relate to the plight of the turtles. Romance does figure in the film in a major way, but not between the two leads; this is also part of the film's allure. It is wonderful to see Richard Johnson doing even a small acting role; he's delightful as Jackson's neighbor. Kingsley's rooming house occupants are also a varied crew, and his battles with them form the more comic parts of the film. In the end, this is a quiet, intelligent film about people with problems who struggle to overcome them and help several turtles at the same time. There are no explosions, no running gun battles, no catchphrases. What it does have is a great story and actors, wonderful music, and a marvelous aura to it that is ultimately more memorable than those blockbuster films. I highly recommend it.",
         "Two lonely people, who desperately need to break out of their own confines, conspire together to free two sea turtles that have been imprisoned in an aquarium for thirty years. Harold Pinter's well-written script for \"Turtle Diary\" is spare, but Ben Kingsley and Glenda Jackson are such consummate actors that they bring a depth to their parts that goes well beyond words. Screen acting rarely gets better than these two performances. A glance, a half smile, and a shrug convey more than a page of written lines, and Kingsley and Jackson are masters of non-verbal communication. The supporting cast in this quirky film is equally skilled and ably fleshes out the sketchily written roles. Eleanor Bron is particularly memorable as a shadowy woman of few words, who lives in the same boardinghouse as Kingsley. She says little, but suggests much. Bron's character will haunt the viewer long after the film is over. Richard Johnson plays Jackson's neighbor, and he too creates a character far more real than his few lines of dialog would suggest. Nigel Hawthorne, Rosemary Leach, Michael Gambon, and Jeroen Krabbe also add idiosyncratic characterizations to this engaging film. Set in London, \"Turtle Diary\" could be classified as a love story, although no romance develops between the leads and the lack of romance or interpersonal involvement constrains many of the protagonists. For the most part, the characters are solitary individuals, who exist alone and uninvolved when the film opens. However, as the story progresses, the fortunate form attachments, while those who do not remain confined by their loneliness. The story is slight and obviously intended to provide parallels between the plight of the turtles and those of the characters. Events move slowly, and character trumps plot. \"Turtle Diary\" is a glowing film for patient viewers, who will be rewarded for their time with excellent performances, memorable characters, and a gentle captivating story.",
         "While this story isn't really about turtles, the sea turtles do provide the perfect backdrop for the plot, serving a purpose similar to that of a Greek chorus. The movie is about two wayward souls who bond over their shared obsession with some sea turtles in a English zoo. The turtles are ensconced in a tank that is far too small for them, and witnessing the animals' plight stirs something in each of the two main characters, played expertly by Glenda Jackson and Ben Kingsly. As the two develop a strange bond over their shared sense of personal imprisonment they hatch a plan to free the turtles, assisted by the zookeeper. In a typical Hollywood production of this story, we would be distracted by an inevitable romance between Jackson and Kingsly, a romance that saves both characters. Or perhaps we would see the turtles bond anthropomorphically with the humans. Thankfully there are no such cheap devices used here. Jackson and Kingsly become stronger and freer as the plan takes shape, but the two only become better defined people by their friendship with each other. As the story evolves, our characters become emancipated. Kingsly's development into a strong, independent man is hilariously illustrated through his confrontations with a slovenly house mate over a dirty bathtub. Both characters develop romances, but not with each other. It is a lovely story of imprisonment and freedom, well told and beautifully acted. It is a shame this hasn't been released on DVD.",
         "Two withdrawn, pathologically shy Londoners, one a dedicated bachelor and the other an author of children's books, conspire to hijack a trio of sea turtles from a local zoo and liberate them into the English Channel, coming out of their own shells (so to speak) in the process. It sounds trite, but what saves the film from becoming a starry-eyed promotion for Greenpeace is its refusal to rely strictly on charm. The screenplay by Harold Pinter (a refreshingly straightforward adaptation of the novel by Russell Hoban) is built entirely on small gestures and quiet epiphanies, with none of the expected emotional overkill or cheap inspirational grandstanding (there is, for example, no awkward romantic subplot tacked on to the adventure). Glenda Jackson and Ben Kingsley both give typically immaculate performances, and the film itself is likewise quite exhilarating, in its own understated, unassuming sort of way.",
         "Superb film. I have still have it on betamax! Must move it to safer media. I see it as a story of two aquariums, one is the zoo aquarium which contain the turtles, swimming around aimlessly attempting to satisfy their ancient migration, and the only slightly bigger tank with all of us in. Basically, the story is of two people in a humdrum life in 'bedsit land', who get it together to liberate the turtles, and in doing so, themselves. There are lots of quality cameos with superb actors, superbly chosen by Hoban, an Anglophile who knows us better than ourselves. In my experience only 10% of all films are worth making. This is one of them. Why oh why is'nt it on DVD?",
         "\"Turtle Diary\" tells a preposterous -- even silly -- story but is saved by great performances, an evocative score, and consistent good humor. There has never been a more commanding screen presence than Glenda Jackson. What a shame it is that she has deprived us of her formidable talent in order to become a minor league politician. Ben Kingsley is also wonderful. `Turtle Diary' calls for patience but those who exercise it will be well rewarded. 7 out of 10.",
         "Here we have one of the best English casts anyone could have assembled, starting with Glenda Jackson. And the acting and photography are excellent. But the story! It's \"born free\" for Waterworld. Two very neurotic people decide to free three giant turtles from a zoo. The zoo worker in charge agrees to help them, absolutely assured, incredibly, that there will no reprisals by the people who own and run the zoo. The project is carried out. The music swells. And people jump in bed with each other. That's really about it! The story could have been told in a half hour, but to turn this into a full length film, we have long scenes of driving and fiddling about that become embarrassing after a while. Plus two sub-plots are woven in that add nothing but filler to the original story. As for the anthropomorphism, well, if you really have this idea of freeing all the animals in the zoo, good luck. But please take a few courses on animal behavior first. Not to mention the police side of the undertaking."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Britannic",
         "British Lion Film Corporation",
         "Columbia Broadcasting System (CBS)"
      ],
      "summaries": ["Two separate people, a man and a woman, find something very stirring about the sea turtles in their tank at the London Zoo. They meet and form an odd, but sympathetic camaraderie as they plan to steal two of the turtles and free them into the ocean."],
      "budget": 0
   },
   "movielensId": 3402,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1985-09-10",
      "dvdReleaseDate": null,
      "directors": ["John Irvin"],
      "runtime": 97,
      "movieId": 3402,
      "title": "Turtle Diary",
      "mpaa": null,
      "actors": [
         "Glenda Jackson",
         "Ben Kingsley",
         "Michael Gambon",
         "Nigel Hawthorne",
         "Richard Johnson",
         "Rosemary Leach",
         "Eleanor Bron",
         "Harriet Walter",
         "Jeroen Krabbé",
         "Peter Capaldi",
         "Harold Pinter"
      ],
      "imdbMovieId": "0090219",
      "originalTitle": "Turtle Diary",
      "genres": [
         "Romance",
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["8h7zKYxDy3k"],
      "plotSummary": "Two separate people, a man and a woman, find something very stirring about the sea turtles in their tank at the London Zoo. They meet and form an odd, but sympathetic camaraderie as they plan to steal two of the turtles and free them into the ocean.",
      "tmdbMovieId": 123047,
      "avgRating": 3.45556,
      "releaseYear": "1985",
      "numRatings": 135,
      "posterPath": "/v2DLQlMrbU1jaKZ0nu6hfWvb56P.jpg"
   }
}