{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0081400",
      "video": false,
      "title": "Raise the Titanic",
      "recommendations": [
         42176,
         279817,
         27858,
         36576,
         44568,
         480603,
         40160,
         93018,
         36567,
         10606,
         75641,
         35101,
         31361,
         47892,
         15310,
         19258,
         72096,
         98130,
         36912,
         27591
      ],
      "backdrop_path": "/qH90VaspwmpCr4rVmIYn01h0rXM.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Master Chief Vinnie Walker",
               "gender": 2,
               "credit_id": "52fe449ec3a368484e02d2df",
               "name": "M. Emmet Walsh",
               "profile_path": "/dLf79xlsmE40rog0gryjxsZJzml.jpg",
               "id": 588,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Dirk Pitt",
               "gender": 2,
               "credit_id": "52fe449ec3a368484e02d2cb",
               "name": "Richard Jordan",
               "profile_path": "/9Wv303Zx9yU8zp2sEG1cZbpYRre.jpg",
               "id": 12518,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Dr. Gene Seagram",
               "gender": 2,
               "credit_id": "52fe449ec3a368484e02d2cf",
               "name": "David Selby",
               "profile_path": "/31FZf0TdcYm53S9R9q1KWNNxVaH.jpg",
               "id": 56930,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Dana Archibald",
               "gender": 1,
               "credit_id": "52fe449ec3a368484e02d2d3",
               "name": "Anne Archer",
               "profile_path": "/1dEu7fqOSogHivUjnXRFnnaOJNR.jpg",
               "id": 10427,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "John Bigalow",
               "gender": 2,
               "credit_id": "52fe449ec3a368484e02d2d7",
               "name": "Alec Guinness",
               "profile_path": "/nv3ppxgUQJytFGXZNde4f9ZlshB.jpg",
               "id": 12248,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Captain Prevlov",
               "gender": 2,
               "credit_id": "52fe449ec3a368484e02d2db",
               "name": "Bo Brundin",
               "profile_path": null,
               "id": 85146,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Admiral James Sandecker",
               "gender": 2,
               "credit_id": "52fe449ec3a368484e02d2e9",
               "name": "Jason Robards",
               "profile_path": "/d5t554TsCjMvI9zwe7M5gNLvZeX.jpg",
               "id": 4765,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Lieutenant Northacker",
               "gender": 0,
               "credit_id": "52fe449ec3a368484e02d2ed",
               "name": "Michael Ensign",
               "profile_path": "/nyTn32fU0E1pQpIUeuiTAehaAee.jpg",
               "id": 1080265,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Dr. Silverstein",
               "gender": 0,
               "credit_id": "52fe449ec3a368484e02d2f1",
               "name": "Maurice Kowalewski",
               "profile_path": "/aLtAGGPm8bemPlSIUwhMwdAo1B8.jpg",
               "id": 1152827,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe449ec3a368484e02d2e5",
               "name": "Jerry Jameson",
               "profile_path": null,
               "id": 52094,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "57a340fec3a3683f970019df",
               "name": "Adam Kennedy",
               "profile_path": null,
               "id": 1234544,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "57a341179251410ca8001db8",
               "name": "Eric Hughes",
               "profile_path": null,
               "id": 1294154,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 0,
               "credit_id": "57a3412a925141276900172f",
               "name": "Clive Cussler",
               "profile_path": null,
               "id": 53295,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "57a34146c3a36829a40025fc",
               "name": "William Frye",
               "profile_path": null,
               "id": 52100,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "57a34161c3a3683fa7002076",
               "name": "Martin Starger",
               "profile_path": "/6fUAYOXgAXpbSzYP3xnVmJ4ezZh.jpg",
               "id": 30592,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "57a3417fc3a3682fa7005d87",
               "name": "Lew Grade",
               "profile_path": "/rA0Z1fY2bDpM6Qy5zGfF47XsSBn.jpg",
               "id": 24328,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "57a341c89251410c7d001d39",
               "name": "John Barry",
               "profile_path": "/9NyieJO78xbwKIBZ1589WfdRPV8.jpg",
               "id": 2289,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "57a341e5c3a36829a4002628",
               "name": "Matthew F. Leonetti",
               "profile_path": null,
               "id": 2507,
               "department": "Crew",
               "job": "Cinematography"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 2.959633,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 24575,
      "vote_count": 27,
      "budget": 0,
      "overview": "To obtain a supply of a rare mineral, a ship raising operation is conducted for the only known source, the Titanic.",
      "similar": [],
      "original_title": "Raise the Titanic",
      "runtime": 115,
      "poster_path": "/7cahPJXA1fRXRwqqMVQkX3MTZy3.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "ITC Entertainment",
         "id": 1584,
         "origin_country": ""
      }],
      "release_date": "1980-01-01",
      "vote_average": 5.2,
      "belongs_to_collection": null,
      "tagline": "They've found the Titanic. There's just one thing left to do...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Jerry Jameson"],
      "runtime": 115,
      "synopsis": null,
      "writers": [
         "Adam Kennedy",
         "Eric Hughes"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0081400/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY5MTQwNzMxNV5BMl5BanBnXkFtZTcwMzkwOTMyMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Jason Robards, Richard Jordan, David Selby | See full cast and crew »"],
      "reviews": [
         "I have never understood the degree of ire, dislike, contempt and scorn heaped upon this movie. A multi million dollar turkey at the box office which virtually sank Lord Lew Grade and one that has provided film critics with cheap laughs ever since. I sit here this morning, having sat through ZOOLANDER last night, watching a complacent, pre-programmed brain-dead audience guffaw itself senseless, contributing another truck load of dollars to Ben Stiller's superannuation fund and you know, I wonder about RAISE THE TITANIC. What has happened to sentiment, simplicity, the ultimately simple values in life? Sure, RAISE THE TITANIC captures none of the power of Cussler's novel, but I don't really care! Yeah, they got the funnel configuration shot to hell, the underwater model as it surfaces looks much like the little rubber boat I used to play with in the bath as a child, and David Selby has the animal magnetism of Osama bin Laden, but I'd like to tell you something. Perhaps because I maintained a fascination with the TITANIC ever since I was a child and dreamed of just how it must have been that night, when watching that absolutely awesome scene in RAISE THE TITANIC as the great ship broke the surface I have never in my life been so emotionally moved. Tears just ran down my face and I cried like a child. When I got home that night my wife asked me what was wrong. I couldn't talk about it and was never able to explain, and you people reading this want to believe it, I am the absolute last guy you would consider to be a wuss! How anyone could have witnessed that scene in the theater and NOT been moved I could never understand. So many memorable things in the film. Titanic survivor, Sir Alec Guinness' touching cameo in the pub when he gives Dirk Pitt (the late Richard Jordan) the white star flag that he removed from the stern the night the great ship foundered, and which he wanted replaced if they were ever to raise it from the bottom of the Atlantic. The inarguably realistic scene when Jordan and his crew members finally discover the wreck on the bottom, played out against John Barry's ultimately moving musical score, the best he wrote for ANY film. The external shots of the ship once it has been raised (Way better I thought than Cameron's digitised TITANIC) and the internal shots of the gymnasium still dripping with water. Finally, the wonderful scenes as it is towed into New York harbor to complete its (then) 68-year journey. True, the last twenty minutes or so were all downhill, but nothing can detract from what went before. Worst thing they ever did was to FIND the wreck! A dream died that day!",
         "Inexplicably bad adaption of Clive Cussler's novel, the failure of this movie may be in its focus on an actual historical event. Most of Cussler's novels revolve around odd sinkings and lost-at-sea type events: perhaps this movie couldn't stand up to the scrutiny that accompanies any Titanic -based project. Richard Jordan is badly miscast (as is Jason Robards). Cussler's novels would make excellent Bond-type big budget movies in the right hands, but here Jerry Jameson and the writers managed to suck anything interesting out of Cussler's entertaining original work.",
         "I saw this movie in the theatre, and I remember enjoying it. I knew it was a financial failure, but over the years since I've been surprise by the hatred it has generated. Long before Robert Ballard, finding the Titanic and possibly raising it was a dream I shared with a lot of Titanic fans. Clive Cussler wrote a pulpy but entertaining book on the subject, and I thought the story was made into a pulpy, but entertaining movie. I liked the cast: Richard Jordan, David Selby (I'm a Dark Shadows fan also...hoots of derision), Jason Robards and Anne Archer. Now, however, I have to watch a fading print under cover of darkness to avoid more hoots of derision! I've read that there is excised footage that might help the storyline. I'd buy a directors cut DVD, and have a \"Raise the Titanic\" party. It's only an entertainment, not a work of art.",
         "A folly worthy of its namesake, Lord Grade, its liner sized producer famously remarked that it would have \"been cheaper to lower the Atlantic\", a feat he could have accomplished simply by jumping into it. Raise the Titanic(!)is an adaptation of the novel by Clive Cussler. In its transition to the big screen however, most of the intricate cold war plotting didn't make it to the lifeboats. In its stead you have the basic story and of course the bank breaking poster promise of the doomed liner rising from her watery grave. It might have worked too had the source material been handled a little better. The screenplay is pretty talky and never really succeeds in building the necessary tension but what really sinks (sorry) the whole enterprise is direction from Jerry Jameson so moribund and lifeless, you'd think he was helming a movie for cable television. Its a mark of this that although it doesn't take very long to find the ship itself on screen you could be forgiven for thinking that you began watching the movie in 1912. Also RTT! has, for the most part a cut price look that undermines the epic scale of the story and its subject matter. When the ship does eventually see the light of day its via some model work and camera over-cranking that fails in producing that all important wow factor. To be fair though there are some very good shots of the ship entering New York harbour that do pack a punch, aided enormously by one of John Barry's best ever scores - a wonderful bombastic orchestral suite that is as good as hes ever produced. Were this a better film, and had anyone gone to see it Barry may have been in line for an Oscar (which he got when he plagiarised parts of the score for Out of Africa). In fact, its fair to say that Barry is the only person behind the camera who does the story any justice. Richard Jordan gives a good performance as Cussler's hero Dirk Pitt and there's a nice Cornish Cameo for Alec Guinness but everyone else is really just waiting to die here. The twist is a good one but is handled poorly and you're left wondering what a director like John McTernian who did such good work with Clancy's Hunt for Red October may have made of the same material. Sadly the discovery of the real ship in two pieces has scuppered any remake possibilities so this is it. Raise the Bismarck anyone?",
         "I like this film, and I've always liked it. It is far from perfect, but if you can suspend your disbelief for a couple of hours and enjoy it for what it is then it's worth watching. The oft-criticised script isn't the worlds best, but some of the dialogue is quite moving and it's delivered well by the cast. Jason Robards makes an excellent Sandecker, and Richard Jordan captures elements of Dirk Pitt's character very well. The scene in The Sloop Inn in Cornwall with Jordan and Alec Guinness is particularly noteworthy, with Guinness' portrayal of a surviving crew member accentuated by John Barry's first class score (\"Memories of the Titanic (All That's Left)\") quite moving. Later on, Barry's \"Memories of the Titanic\" theme is reprised to good effect when Jordan's character explores the wreckage. The scene where the Titanic reaches the surface is quite impressive, and I can't help but smile when we see the ship towed into New York harbour (and it's not the poor visual effects that make me smile). I always enjoy re-watching this, and if no-one else does, that's fine - I'll keep it for myself.",
         "Special effects in 1980 weren't what they are in 2002 obviously. This film is rather laughable in terms of pyrotechnics when you compare it to, let us say James Cameron's film (by the way this film was made five years before they found the real Titanic so they had no way of knowing the ship broke in two before it went down). I saw this film as a kid and enjoyed it (I enjoy anything having to do with the Titanic). I remember that summer of 1980 there was a big ad build up for it, the last great human adventure is about to begin. This is a good suspense film, although they would have been better off following Cussler's novel more closely especially in character develpment. Cussler was reportedly so angry at this film he forbid them to make anymore from his novels which is a damn shame. Dirk Pitt is a fine hero in the James Bond mold. The scene where the ship is \"raised\" is handled rather well. I read something that was kind of funny, the producers spent a fortune building an elaborate studio tank for the model they \"raised\" then found out they didn't make it big enough. Anne Archer is rather wasted in this film, shes a fine actress who deserved better. The great Alec Guiness has an amusing cameo. He was always such a loveable old ham.",
         "US Naval Intelligence attempts to raise the Titanic, the ocean-liner that sank on her maiden voyage in 1912. It is believed that her cargo contains rare minerals that will enable the Americans to perfect a defense system completely resistant to enemy missiles. A film which cost $40,000,000 to make, was hyped as a blockbuster and then tripped the flop fantastic when it took a lousy $7,000,000 at the box-office. Hardly surprising because it is very thinly plotted (there's barely enough plot to make a b-movie), the acting is indifferent and above all it's just an unbearably tedious way of passing the time. It really does make one wonder why they spent so much time and money making so very little. I would place this on my list of movies that I love to hate when I call it the movie equivalent of the Millennium Dome, and just to add to the insult, they should have put sprocket holes on all the hype and thrown the picture away.",
         "When I first came across this movie, I thought it was interesting and recored late night off TV. I enjoyed the film, at least until I read the novel by Clive Cussler several times. The cast is pretty good. Jason Robards is great as Sandecker and David Shelby is perfect as Seagram, fitting Cussler's description perfectly. Anne Archer is good in the role of Dana and it's a shame we don't see more of her and her lines are terrible (\"Wormy on the hooky.\" for example). Alec Guinness does so well in the role of Bigalow that the film is worth watching just for his small role. Richard Jordan is the only bad cast member. He doesn't fit in to the character of Dirk Pitt at all and seems to be overwhelmed in his scenes. The music is the best thing going for this movie. The great composer John Barry gives one of his best scores ever for this film, giving the film a much needed boost in atmosphere. Everything else behind the camera though, doesn't live up to expectations. The film's editing, direction, production design all give this film a B- Movie feel. The special effects are decent at least, with some good underwater work. The models of the subs look realistic. And the model of the Titanic is excellent and is, for the most part, accurate. The writing is the worst thing about the film. This is were thee film dies with terrible dialog (back to Anne Archer's lines). The worst thing is that the plot of the novel is all but scrapped and the screenwriters had the nerve to change the ending! The original ending had Pitt finding the ore in the Southby graveyard, bringing back to the U.S. and testing the Sicilan Project successfully. But the film instead has Pitt and Seagram (who wasn't even in the novel's ending, having went insane after the ore isn't on the titanic, though it was a good change for the film) going to Southby and deciding that since the ore could be used for a bomb, decide not to bring it up. This has got to be one of the worst adaptations of a novel in film history. A film that should have been good and started the film series of Cussler's Pitt novels instead turned into a $40 million B- Movie that was destroyed behind the camera. It Should Have Been Good....",
         "This is the book that got me started on Clive Cussler, and although it is quite dated (published 1976) it is still a great book. After searching for years for a video store that had the movie available for rent, I finally got around to watching it. Let me say that if you have not read the book, this movie will seem like another one of those standard 1970's (yes, I know it was made in 1980, but that doesn't matter). These movies have a decent plot, but it gets ruined by dated references, cheesy soundtracks, bad haircuts, and lackluster endings. (c.f. Taking of Pelham One Two Three, The (1978)) Richard Jordan is an excellent characterization of Dirk Pitt. Jason Robards is a decent Sandecker, although his character bears little resemblance to the one Cussler describes in his novels. Naturally, Alec Guiness is superb as Bigalow (who else could play that role?). Oh, and Cussler has a cameo. See if you can recognize him from the pictures on the inside jacket of his novels. It was fairly easy. In addition, the special effects sequences involving the ship and its rise to the surface were excellent. They were just as good as any sequences in Titanic (1997) and not nearly as expensive, I'll bet. If you've read this book, my advice is to shell out a couple of bucks for a rental and see how your visualization of Cussler's story matches up against that of the directors. If you haven't read the book, you may still enjoy the movie, but keep in mind the book was written in 1976, when the Cold War was in full force and the Titanic was still undiscovered and would remain that way for another 10 years. *SPOILERS BELOW* *SPOILERS BELOW* I'll now go on to describe the primary differences between the book and the movie, in case that's what you're concerned with (that was my primary reason for renting it): The opening scene in the book (April 1912, where the \"mystery man\" demands that Bigalow take him to the cargo hold and then locks himself in the vault) is not in the movie. I presume this is due to the large expense a scene such as that would require. Instead, we are presented with a montage of sepia-toned photographs of the Titantic through its construction and on its maiden voyage. The \"Thank god for Southby\" quote is instead found in a letter that Hobart sent to the U.S. Army the day before Titanic sailed. The movie begins with the scene on Novaya Zemlya (except it's called something else in the movie, despite the fact that Novaya Zemlya is a real place), with the mining engineer discovering the abandoned Byzanium mine. The plaque identifying Hobart's grave explicitly says \"Jake Hobart, U.S. Army\", which clears up that little mystery and eliminates the scenes where they visit the mining machinery company in Colorado and Hobart's widow in CA. For some reason, Pitt is a Captain in the U.S. Navy, not the Air Force, but whatever. Oh, and Sandecker is in on the project from the start, for some unknown reason. Arthur Brewster is referred to as a \"con man\" instead of a respected mining engineer. There is no mention of the Little Angel mining disaster. The original mining crew board a Norwegian whaler to get to Novaya Zemlya, and on the way back it's the Russians (who are portrayed as Communists back then, despite the fact that the Czar was still ruling in 1912, 5 years before Trotsky and the revolution), not the French, who chaise them and the Byzanium from Aberdeen to Southampton. Mel Donner does not exist in the movie, and Gene and Dana are not married, but appear to be dating. Dana appears to be a newspaper reporter or something in the movie (instead of working for NUMA), and its implied that she and Pitt had a prior relationship. The Lorlei Current expedition does not exist. First, they're looking in the wrong place for the Titanic. Then they do the experiment with the tank, and discover where they should be looking, and only THEN do they find Graham Farley's cornet. And for some reason, they claim that Farley previously served on the Olympic instead of the Oceanic. Pitt's meeting with Bigalow is pretty much the same as in the book - Alec Guiness is of course excellent - and he presents Pitt with the pennant. Prevlov (the Russian officer) actually comes on board the ship to meet with the NUMA folks - there is no spying, no Silver and Gold, no fight scenes, no snapped towing cable, and no harsh North Atlantic Storm. Which is unfortunate. As I mentioned, however, the shots of the Titanic coming up are quite well done. The ending was rather dismal, but I suppose in 1980, Cussler's 1976 ending wasn't acceptable. The movie ends with the discovery of Hobart's grave in Southby, however Seagram balks at the last minute, and refuses to dig up the Byzanium. Ah well, such is life.",
         "First off let me begin by saying that you have to suspend disbelief for a movie like \"Raise the Titanic.\" If you can do that then you will enjoy this movie. The film then and now had a lot going against it. It came out in 1980 when blockbusters like \"The Empire Strikes Back\" and \"Raiders of the Lost Ark\" were in motion. To make matters worse was when Bob Ballard discovered the real wreckage and the ship was found in multiple pieces on the sea bottom. This of course contradicts the raising of the ship in one piece. Then in 1997 when James Camerons movie came out I believe that was the killer. I mean what is so wrong with this movie? You have a good plot line during the cold war which if someone was watching this movie today did not comprehend what that was like, there understanding may not grasp the whole of the story. At times the acting is a little over board but lets remember the movie was made in 1980. People of the 1990's and 2000's compare the affects with todays which is totally unfair to the affects of decades ago. Its like comparing the 1930's \"King Kong\" to Peter Jacksons remake. I believe the graphics back then were top notch and the Titanic model used was beautiful. And everyone I talk to always mentioned the score of the movie. So watch it again for what is it. A triller set in a time about a doomed ship with some secrets."
      ],
      "genres": [
         "Action",
         "Drama",
         "Thriller",
         "Adventure"
      ],
      "productionCompanies": ["Incorporated Television Company (ITC)"],
      "summaries": [
         "A group of Americans are interested in raising the ill-fated Ocean liner Titanic. One of the team members finds out the Russians also have plans to raise the ship from its watery grave. Why all the interest ? A rare mineral on board could be used to power a sound beam that will knock any missile out of the air when entering us airspace.",
         "The American military have a experimental defense system that requires an extremely rare mineral in order to work. Investigations prove that the only known source of this mineral is in the Soviet Union, but it is known that around the turn of the century a miner exported some of the mineral. Hopes are dashed when it is learned that he transported the mineral about the Titanic, which struck an iceberg and sank without a trace. But perhaps the Titanic can be salvaged....",
         "To obtain a supply of a rare mineral, a ship raising operation is conducted for the only known source, the Titanic."
      ],
      "budget": 36000000
   },
   "movielensId": 3403,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1980-01-01",
      "dvdReleaseDate": "2006-01-24",
      "directors": ["Jerry Jameson"],
      "runtime": 115,
      "movieId": 3403,
      "title": "Raise the Titanic",
      "mpaa": "PG",
      "actors": [
         "M. Emmet Walsh",
         "Richard Jordan",
         "David Selby",
         "Anne Archer",
         "Alec Guinness",
         "Bo Brundin",
         "Jason Robards",
         "Michael Ensign",
         "Maurice Kowalewski"
      ],
      "imdbMovieId": "0081400",
      "originalTitle": "Raise the Titanic",
      "genres": [
         "Action",
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["nesMJIHowS4"],
      "plotSummary": "To obtain a supply of a rare mineral, a ship raising operation is conducted for the only known source, the Titanic.",
      "tmdbMovieId": 24575,
      "avgRating": 2.5514,
      "releaseYear": "1980",
      "numRatings": 214,
      "posterPath": "/7cahPJXA1fRXRwqqMVQkX3MTZy3.jpg"
   }
}