{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "titanic",
         "id": 4388
      }],
      "imdb_id": "tt0046435",
      "video": false,
      "title": "Titanic",
      "recommendations": [
         28594,
         89609,
         390991,
         37204,
         70259,
         82667,
         141822,
         22689,
         95083,
         85512,
         43119,
         98203,
         17635,
         94139,
         27765,
         150839,
         43105,
         150677,
         16902,
         4205
      ],
      "backdrop_path": "/4MlLN6nPOZ6RDFhPcfj4OM1meyY.jpg",
      "revenue": 4905000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Richard Ward Sturges",
               "gender": 2,
               "credit_id": "52fe46d99251416c75085813",
               "name": "Clifton Webb",
               "profile_path": "/12hInQbYKyfkOCBdn5xG8w1duvs.jpg",
               "id": 20125,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Julia Sturges",
               "gender": 1,
               "credit_id": "52fe46d99251416c75085817",
               "name": "Barbara Stanwyck",
               "profile_path": "/yY2CrbaTyKpmmuUeSu57Wsf2aHk.jpg",
               "id": 14974,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Gifford \"Giff\" Rogers",
               "gender": 2,
               "credit_id": "52fe46d99251416c7508581b",
               "name": "Robert Wagner",
               "profile_path": "/nlRWGpsQPo8sSFdl8larlPUy1rS.jpg",
               "id": 9208,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Annette Sturges",
               "gender": 1,
               "credit_id": "52fe46d99251416c7508581f",
               "name": "Audrey Dalton",
               "profile_path": "/2JXtoU1FClln2OpOzld9wBb13Y7.jpg",
               "id": 80600,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Maude Young",
               "gender": 1,
               "credit_id": "52fe46d99251416c75085823",
               "name": "Thelma Ritter",
               "profile_path": "/oMCbRKA165vBWOCskSXNKDplQf9.jpg",
               "id": 7684,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Capt. Edward John Smith",
               "gender": 2,
               "credit_id": "52fe46d99251416c75085827",
               "name": "Brian Aherne",
               "profile_path": "/jX8H9PYZTuzFqxEa76W0dEVzKWF.jpg",
               "id": 32923,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "George S. Headley",
               "gender": 2,
               "credit_id": "52fe46d99251416c7508582b",
               "name": "Richard Basehart",
               "profile_path": "/EwbxGHlgK2nojHYGu5A3mpxFd2.jpg",
               "id": 5403,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Earl Meeker",
               "gender": 2,
               "credit_id": "52fe46d99251416c7508586b",
               "name": "Allyn Joslyn",
               "profile_path": "/xDSHzgl7A7ZZskSkZe3ATEN0IB1.jpg",
               "id": 87698,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Sandy Comstock",
               "gender": 0,
               "credit_id": "52fe46d99251416c7508586f",
               "name": "James Todd",
               "profile_path": "/oa7pmdn4hOGm4qYhfrV1UQVINvK.jpg",
               "id": 103413,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Madeleine Astor",
               "gender": 1,
               "credit_id": "52fe46d99251416c75085873",
               "name": "Frances Bergen",
               "profile_path": null,
               "id": 105307,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "Woman to Whom Norman Gave His Seat",
               "gender": 1,
               "credit_id": "5a7b9270c3a3680f7f003e37",
               "name": "Mae Marsh",
               "profile_path": "/fb2kFQuFo2bHchwnKWM1SrwqPuP.jpg",
               "id": 8829,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "Lifeboat Survivor",
               "gender": 2,
               "credit_id": "5a7b92d1c3a3680f8200421f",
               "name": "Frank McLure",
               "profile_path": "/u6E8Ms5zQXg9LEr7lktIvhtMxjS.jpg",
               "id": 569144,
               "order": 11
            },
            {
               "cast_id": 23,
               "character": "Passenger",
               "gender": 0,
               "credit_id": "5a7b92e1c3a3680f94003d7a",
               "name": "Bert Stevens",
               "profile_path": null,
               "id": 1208035,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46d99251416c75085831",
               "name": "Jean Negulesco",
               "profile_path": "/2KWWnbo5LwLHIxWiP1m3UT8wm0j.jpg",
               "id": 19606,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46d99251416c75085837",
               "name": "Charles Brackett",
               "profile_path": null,
               "id": 8617,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe46d99251416c7508583d",
               "name": "Walter Reisch",
               "profile_path": null,
               "id": 12362,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe46d99251416c75085843",
               "name": "Richard L. Breen",
               "profile_path": null,
               "id": 80601,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe46d99251416c75085849",
               "name": "Charles Brackett",
               "profile_path": null,
               "id": 8617,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46d99251416c7508584f",
               "name": "Sol Kaplan",
               "profile_path": null,
               "id": 30922,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46d99251416c75085855",
               "name": "Joseph MacDonald",
               "profile_path": null,
               "id": 30288,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe46d99251416c7508585b",
               "name": "Louis R. Loeffler",
               "profile_path": null,
               "id": 871,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe46d99251416c75085861",
               "name": "Maurice Ransford",
               "profile_path": null,
               "id": 132251,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "52fe46d99251416c75085867",
               "name": "Lyle R. Wheeler",
               "profile_path": null,
               "id": 3358,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 5.034968,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 16535,
      "vote_count": 34,
      "budget": 1805000,
      "overview": "Unhappily married, Julia Sturges decides to go to America with her two children on the unsinkable Titanic. Her husband, Richard also arranges passage on the luxury liner so as to have custody of their two children. All this fades to insignificance once the ship hits an iceberg.",
      "similar": [
         597,
         10971,
         285,
         87827,
         205775,
         11968,
         950,
         810,
         578,
         5689,
         3989,
         27902,
         10488,
         14372,
         8676,
         24982,
         11021,
         86938,
         11002,
         503
      ],
      "original_title": "Titanic",
      "runtime": 98,
      "poster_path": "/l2ZkdW1zuOgTApWu8N5SdUkDtG6.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         },
         {
            "name": "euskera",
            "iso_639_1": "eu"
         }
      ],
      "production_companies": [{
         "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
         "name": "20th Century Fox",
         "id": 25,
         "origin_country": "US"
      }],
      "release_date": "1953-04-11",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "TITANIC in Emotion...in Spectacle...in Climax...in Cast!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Jean Negulesco"],
      "runtime": 98,
      "synopsis": "Unhappy with life in England, Julia Sturges take herself, and her 2 children abroad the \"unsinkable\" white star liner RMS Titanic. Her husband, Richard Sturges, manages to buy a steerage ticket from another family to battle with Julia for custody. Julia considers Annette \"grown up\" and lets her make her own decisions, while Norman needs care from his mother. It is an adventure of different things until the ship hits an iceberg. an alarm is sounded while Richard tries to convince his family that they will be safe, even though he found out that the ship will sink. the ship begins to lean to its port side, and then forward. Julia and Annette are safe in a lifeboat, while Norman and Richard are left on the ship to die. They sing a \"welsh hymn\" until the ship explodes multiple times, and eventually explodes indefinitely, and goes down.",
      "writers": [
         "Charles Brackett",
         "Walter Reisch"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0046435/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU3NTUyMTc3Nl5BMl5BanBnXkFtZTgwOTA2MDE3MTE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Clifton Webb, Barbara Stanwyck, Robert Wagner | See full cast and crew »"],
      "reviews": [
         "When I was young I was probably the only kid in years who had checked out our library's copy of Walter Lord's \"A Night to Remember.\" It began a lifelong fascination with the ill-fated liner. I was home sick on the couch a short time later when I saw this film for the first time on TV. Forty years later, I still remember how this movie touched me then. Even then I was hooked -- not just because the film dealt with the Titanic, but for some visceral reason I couldn't put my finger on. Still can't -- decades later. I'm not ashamed to say I continue to get choked up by the scene where Webb is on the slanting deck with his \"son\", telling the boy he's never been prouder of him. Fast forward several years and I'm sitting on the couch watching this film with my own son for the first time. Sure enough, I'm having a tough time not losing it all during the Webb and son scene (especially poignant now) when I sneak a peek over at my boy. I've seen him cry maybe two or three times in his whole life yet there he sat with unmistakably moist eyes. What a moment to share. I'm very happy to see so many other people here feel positively toward this movie. One of the defining movie experiences of my life.",
         "While I saw and enjoyed the current \"Titanic,\" I've always held a special place for the excellent 1953 version. Charles Brackett and Walter Reisch's Oscar-winning screenplay, deftly blending fact with fancy, tells the story compellingly in about half the time of the Cameron film. And what a cast! Barbara Stanwyck, Clifton Webb, Richard Basehart, the young Robert Wagner (looking positively \"DiCaprioesque,\" as it were!), the (unfortunately) near-forgotten Brian Aherne, and the underrated Audrey Dalton all give sterling performances. The special effects are equal to anything in the Cameron film. And it all comes together under Jean Negulesco's sure-footed direction. As I say, you've seen the Cameron film, now see the film where they got it right! To update these comments almost seven years after they were originally written, the DVD of this film is definitely one for any Titanic buff to have in their collection. It features TWO separate commentary tracks, one by critic Richard Schickel and stars Robert Wagner and Audrey Dalton, the other by Titanic historians. There is also the original theatrical trailer and newsreel footage of the film's premiere and Oscar wins. Most impressive of all, though, is a fascinating feature-length documentary, narrated by Victor Garber (ship-builder Thomas Andrews in the Cameron/DiCaprio film), about the sinking of the Titanic and how's it's been presented in films and on TV from the silent era to the present. All this on one DVD.",
         "Winner of three Academy Awards, the 1953 \"Titanic\" (dates are important because of the plethora of identically titled films about the great disaster), was recently re-released by 20th Century Fox as part of their important DVD Studio Classics series. Fascination with the fate of the huge and opulent liner is as strong as ever, especially since improved technology has led to more breathtaking visits to the ship's resting spot on the floor of the Atlantic where state-of-the-art robots with cameras explore the crumbling interiors of the still eerily majestic but rapidly decaying wreck. The first film dramatizing the fate of the White Star Line's greatest ship came out very soon after the 1912 sinking. Since then there have been many movies and several Broadway shows about the loss of over 1500 lives (\"The Unsinkable Molly Brown\" and, of course, \"Titanic\"). 20th Century's contribution to the genre came before the historically much more accurate \"A Night to Remember,\" based on Walter Lord's bestselling book of that title. And of course it can't begin to match the special effects and wizardry, to say nothing of a cloyingly popular tune, of James Cameron's international top money grosser. But Barbara Stanwyck and Clifton Webb bring a dramatic and impelling story to the screen that remains powerful and, really, very sad decades after the movie's release. Directed by Jean Negulesco, \"Titanic\" has major (and what could have been easily avoidable) errors about the April 1912 collision with an iceberg. That doesn't matter because this film is about the relationship of rich, haughty, upper class European (no nationality specified) Webb and his estranged American wife of some two decades, Barbara Stanwyck. They have an ingenue teenage girl who is a Parisian snob and a younger boy who adores his dad. The feeling is mutual until Stanwyck reveals that her husband, from whom she's fleeing so the kids can grow up in darkest rural Michigan as Americans, isn't the boy's father. The ship is the setting for a family in dissolution with every first-time viewer knowing the matter won't be resolved when the ship docks in new York. Of course the tempestuous exchanges between Webb and Stanwyck, strongly and believably acted, must give way to the exigencies of dealing with a mortally stricken vessel. Stanwyck and Webb are at the height of their acting careers.. The last dialogue between Webb and his son as drowning approaches is among the most moving and heart-wrenching I have ever experienced in a movie (maybe it's just a guy thing). Barbara Stanwyck said in an interview that when her lifeboat scene ended she burst into uncontrollable tears, so strongly had she felt the experience of the survivors. DVDs frequently have extra features which can and do run from the inane to the outstanding. I have yet to encounter a more valuable and fascinating extra than the documentary \"Beyond Titanic,\" a ninety-five minute film only a bit shorter than the movie itself. While many Titanic documentaries focus on the causes of the maritime debacle or the exploration of the sunken ship, this film is about the social and cultural significance and heritage of one of the world's most consistently engrossing and endlessly studied tragedies. \"Beyond Titanic\" presents the cinema history of the voyage from the first silent reels emerging soon after the event to the most recent movies. Authors of outstanding books on the Titanic are interviewed and film clips from movies and newsreels bring the story to life. While watching the movie before we saw the documentary, my teenage son turned to me and cynically asked why women and children should have had a right to available lifeboat seats before men were debarked from the listing vessel. \"Beyond Titanic\" tackles the social mores of the time and quickly but clearly shows that the heroism of men who yielded the opportunity to get into the boats, and thus forfeited their lives, was a standard that those opposed to woman's suffrage applauded. Fighters for women's rights were embarrassed, indeed appalled, and many clearly felt that no such consideration should have been extended on the basis of gender. Probably no one disputed that children should have been saved before adults (at least I hope so). There are more extra features including newsreels. And to think that this new release cost but $9.95. For the movie, 8/10. For \"Beyond Titanic,\" 10/10.",
         "I enjoyed this version more than James Cameron's magnum opus. The focus of the movie was more on human drama than special effects, though the latter was pretty decent for a 1953 movie. Clifton Webb and Barbara Stanwyck are wonderful as an estranged couple who finally reconcile just before they have to part. I reckon their story is more poignant because it's a greater tragedy to be parted when a couple has history together, as opposed to Leonardo DiCaprio and Kate Winslet's characters, who met aboard the ship. They only seem like they've known each other forever because the movie's so darn long. I guess it's a matter of which you prefer, plot or effects. It's interesting to note that this Titanic won a screenplay Oscar - its only one - whereas James Cameron's Titanic won 11 Oscars but didn't even get a screenplay nomination.",
         "Just a precaution: If you are expecting a completely accurate historical account of the night with all the scientific details neatly in place, look elsewhere. This film instead focuses (touchingly) on the human drama involved with the ship, with many of the elements of real passengers' accounts rolled into the story of Clifton Webb and wife Barbara Stanwyck (Both excellent; when Isn't Barbara Stanwyck excellent?) and their children. A few real characters are involved, but for the most part the drama surrounding the fictional characters is in the forefront. A beautiful and striking account, the film deserved a few more Oscars than it got, primarily for Miss Stanwyck and a supporting Oscar for Robert Wagner, who does wonderfully in his role.",
         "This film has been overshadowed by the 1997 blockbuster, but this 1953 story of the tragic ocean liner certainly stands tall on its own merits, not the least of which are the star performances by Clifton Webb and Barbara Stanwyck. Built around the domestic drama of a fictional family, the well-known story of the sinking of the Titanic unfolds in an unrelenting and straightforward fashion. Brian Aherne (as the captain) is the victim of delayed and incorrect information and sails the ship right into the iceberg. We get glimpses of the rich and famous who populated the doomed ship as well as the luscious interiors of the ship. The special effects are tremendous without taking over the film. The final scenes of the sinking ship are awesome. But the story of innocent passengers takes center stage here. Stanwyck and Webb are a squabbling couple with two children. The girl (Audrey Dalton) is a snob who is charmed by a college boy (Robert Wagner). Thelma Ritter plays a Molly Brown- like character addicted to loud jewelry and cards. Richard Basehart plays a defrocked priest. Allyn Joslyn plays the infamous coward who dresses like a woman to gain a seat on a lifeboat. Oh, and that's Mae Marsh the kid gives his seat to. The final scenes of Webb and son are superb. An excellent film.",
         "I am a Barbara Stanwyck fan first and foremost. I have never seen her make a false move on film. I could name several films that were Oscar-worthy for Barbara, this is definitely near the top. Titanic is an excellent film. It is taut and to the point. No fluff, just substance. Knowing that all of the family won't survive is heart-wrenching. The ending is poignant and ironic and the life lessons are clear. There are surprises at every turn. Everyone in the film turns in top notch performances. I was just simply blown away! They definitely don't make them like this anymore. Rent it, buy it or check it out at your local library, but see it!",
         "The 1997 version was very pretty and had some pretty stunning effects, but this 1953 version had, by far, the best storyline, far better actors and was more engrossing all around. Barbara Stanwyck and Clifton Webb made a fine team and their story added so much to the tragic environment. The excellent acting made up for the dated special effects, though the long shots of the ship going down are quite good, even by today's standards.",
         "If you're unfamiliar with Clifton Webb (3 Oscar nominations, 1 Golden Globe award -- all for other work) just think Campbell Scott and you'll not be far off. Webb carries this film. but Ms Stanwyck as his wife, and Robert Wagner and Audrey Dalton as the young couple are all remarkably good. Stanwyck is rarely this on, imhb. The set up is all about the people, not the ship, and it works because when the iceberg strikes, it's as if we never saw it coming, and now these good folk mean the world to us. The pacing is superb, and I can assure you that you will wish the film were longer. Never mind the barely adequate sets: they don't slow or offset the action. The B&W photography is strangely modern in the ratio of closeups to long-shots. At least enough of the crowd is constantly moving and filling the screen expertly for us not to notice that the camera is usually stationary. This film was unusually successful on television. It was one of the first of those shown in the late 50's when the networks began showing prime time full length feature films of fairly recent vintage on weekend nights. It was an event. Who knew television could entertain showing prime time movies?",
         "Although not as honored as the 1997 Leonardo DiCaprio-Kate Winslet story about the Titanic disaster, this version of Titanic starring Clifton Webb and Barbara Stanwyck can definitely hold its own. In fact it got an Oscar itself in 1953 for Best Story and Screenplay. Although there was a lot more sociology in the 1997 blockbuster, people do remember most from it the story of ill fated young love between DiCaprio and Winslet. In this version we're dealing with an older married couple whose marriage is on the rocks. The old story of staying together for their children's sake is what's holding them together. But Stanwyck isn't having any more. It's her children, Harper Carter and Audrey Dalton, that she's most concerned about. Though American from the Middle West, due to their father's influence they're taking on old world and very haughty airs. And you can't get more haughty than Clifton Webb on screen. Brian Aherne is the foolish, but brave Captain Smith whose eagerness to do the bidding of his employers and set a record crossing led to the disaster. Robert Wagner has a nice role as the young college kid who Stanwyck tries to match up with Dalton to wean her away from her father's fascination with titled nobility. Also look for good performances by Thelma Ritter as the Molly Brown in all but name role, Richard Basehart as the defrocked priest and Allyn Joslyn as the eager social climber. It's Webb and Stanwyck who carry the story. Webb who originally is an snob, shows in fact some real character during the disaster. And Barbara Stanwyck's last moments as the film ends are some of then best in her long distinguished career. It's your father's Titanic and a good one too."
      ],
      "genres": [
         "Drama",
         "History",
         "Romance"
      ],
      "productionCompanies": ["Twentieth Century Fox Film Corporation"],
      "summaries": [
         "Unhappily married and uncomfortable with life among the British upper crust, Julia Sturges takes her two children and boards the Titanic for America. Her husband Richard also arranges passage on the doomed luxury liner in order to let him have custody of their two children. Their problems soon seem minor when the ship hits an iceberg.",
         "Julia Sturges, her marriage in ruins, attempts to return to the United States with her two children, Annette and Norman. Her husband. Richard Ward Sturges, manages to locate her and joins her on board ship but there appears to be little to reconcile them. Annette begins a romance with a young American college student, Gifford Rogers and Norman revels in the time he gets to spend with his father. They are on board the doomed RMS Titanic however and and once the ship strikes an iceberg, their family problems seem quite unimportant.",
         "An unhappy married couple deal with their problems on board the ill-fated ship."
      ],
      "budget": 1805000
   },
   "movielensId": 3404,
   "movielens": {
      "languages": [
         "English",
         "Français",
         "Español",
         "euskera"
      ],
      "releaseDate": "1953-04-11",
      "dvdReleaseDate": "2003-09-02",
      "directors": ["Jean Negulesco"],
      "runtime": 98,
      "movieId": 3404,
      "title": "Titanic",
      "mpaa": "NR",
      "actors": [
         "Clifton Webb",
         "Barbara Stanwyck",
         "Robert Wagner",
         "Audrey Dalton",
         "Thelma Ritter",
         "Brian Aherne",
         "Richard Basehart",
         "Allyn Joslyn",
         "James Todd",
         "Frances Bergen",
         "Mae Marsh",
         "Frank McLure",
         "Bert Stevens"
      ],
      "imdbMovieId": "0046435",
      "originalTitle": "Titanic",
      "genres": [
         "Action",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["dQ7MAigAhas"],
      "plotSummary": "Unhappily married, Julia Sturges decides to go to America with her two children on the unsinkable Titanic. Her husband, Richard also arranges passage on the luxury liner so as to have custody of their two children. All this fades to insignificance once the ship hits an iceberg.",
      "tmdbMovieId": 16535,
      "avgRating": 3.33379,
      "releaseYear": "1953",
      "numRatings": 2178,
      "posterPath": "/l2ZkdW1zuOgTApWu8N5SdUkDtG6.jpg"
   }
}