{
   "tmdb": {
      "original_language": "fr",
      "keywords": [],
      "imdb_id": "tt0201538",
      "video": false,
      "title": "The Carriers Are Waiting",
      "recommendations": [
         64559,
         194077,
         12156,
         32273,
         14521,
         11399,
         415253
      ],
      "backdrop_path": "/zVy9TAho9aSAES98GiK5yz5TOcK.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Roger",
               "gender": 2,
               "credit_id": "52fe44759251416c9101159f",
               "name": "Benoît Poelvoorde",
               "profile_path": "/1rt37BkFjSYF7imtvJ5t30bqsNM.jpg",
               "id": 47820,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Louise",
               "gender": 0,
               "credit_id": "59c7933e9251415b5d055aef",
               "name": "Morgane Simon",
               "profile_path": null,
               "id": 1893902,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "L'entraîneur",
               "gender": 2,
               "credit_id": "59c793549251415b6e053dc8",
               "name": "Bouli Lanners",
               "profile_path": "/nnM1Yq5sodVTC95oav9iPK9ZiNw.jpg",
               "id": 47822,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Madeleine",
               "gender": 1,
               "credit_id": "59c79367c3a368143005a1e2",
               "name": "Dominique Baeyens",
               "profile_path": "/6crU6kqdNcC4eLMg0X1MTWU4zEq.jpg",
               "id": 586378,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Félix",
               "gender": 0,
               "credit_id": "59c79373c3a36813a90550cb",
               "name": "Philippe Grand'Henry",
               "profile_path": null,
               "id": 585173,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Michel",
               "gender": 0,
               "credit_id": "59c7937d9251415b28059283",
               "name": "Jean-François Devigne",
               "profile_path": null,
               "id": 1893904,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Jocelyne",
               "gender": 0,
               "credit_id": "59c7938cc3a36813a90550e0",
               "name": "Lisa LaCroix",
               "profile_path": null,
               "id": 1240039,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Le responsable",
               "gender": 2,
               "credit_id": "59c7939a9251415b5d055b3c",
               "name": "Philippe Nahon",
               "profile_path": "/1ZrnApxh9qZz1EdEB1vKWwoFd5B.jpg",
               "id": 5444,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44759251416c9101159b",
               "name": "Benoît Mariage",
               "profile_path": "/tmuKGoepZq9RoAIR8isocwoy1z.jpg",
               "id": 105752,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "59c793aec3a368141e050f6f",
               "name": "Benoît Mariage",
               "profile_path": "/tmuKGoepZq9RoAIR8isocwoy1z.jpg",
               "id": 105752,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.105655,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "BE",
            "name": "Belgium"
         },
         {
            "iso_3166_1": "CH",
            "name": "Switzerland"
         }
      ],
      "id": 31336,
      "vote_count": 16,
      "budget": 0,
      "overview": "No overview found.",
      "similar": [],
      "original_title": "Les convoyeurs attendent",
      "runtime": 94,
      "poster_path": "/9XCgE28osPybAjJcNLi86BNRfYp.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Télévision Suisse-Romande (TSR)",
            "id": 8453,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "K-Star",
            "id": 22722,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "K2 SA",
            "id": 2210,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Radio Télévision Belge Francophone (RTBF)",
            "id": 7466,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "CAB Productions",
            "id": 22587,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Canal+",
            "id": 5358,
            "origin_country": "FR"
         },
         {
            "logo_path": null,
            "name": "Centre du Cinéma et de l'Audiovisuel de la Fédération Wallonie-Bruxelles",
            "id": 11796,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Eurimages",
            "id": 850,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Office Fédéral de la Culture",
            "id": 21990,
            "origin_country": ""
         },
         {
            "logo_path": "/h4ZJb3wnffXHeeU6mtcldII84fo.png",
            "name": "Centre National de la Cinématographie",
            "id": 310,
            "origin_country": "FR"
         }
      ],
      "release_date": "1999-05-19",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Benoît Mariage"],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "Emmanuelle Bada",
         "Benoît Mariage"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0201538/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQyMTAzOTUzMl5BMl5BanBnXkFtZTYwNjY3MDM5._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Benoît Poelvoorde, Morgane Simon, Bouli Lanners | See full cast and crew »"],
      "reviews": [
         "LES CONVOYEURS ATTENDENT was the first film I saw in 2000 and I doubt I'll see a better one this year. This beautiful tragicomedy by Belgian filmmaker Benoît Mariage is set in the industrial wastelands of Wallonia. Benoît Poelvoorde plays a father who desperately wants his son to win a car (a Lada!) for him. To do this the son has to break the record opening doors. What the father actually wants his for his son to be someone, because he himself has never made it further as the reporter of local news for a newspaper ironically called L'Espoir (Hope). Of course nothing works out as planned. This film can best be compared to Aki Kaurismäki's DRIFTING CLOUDS, although it is more dramatic and the humour is darker. Just like in that film however the tone is more melancholic than depressing and the ending upbeat, without being unrealistically happy. The humour is absurd, without making the plot unbelievable, and Mariage finds stunning images in the bleak settings that never seem artificial. The best thing about LES CONVOYEURS ATTENDENT is the acting by Poelvoorde. This actor shot to fame with the also brilliant cult-classic C'EST ARRIVÉ PRÈS DE CHEZ VOUS in which he played the charismatic hitman Ben. Since then he only played two small roles in films that were not released in the Netherlands, because, as he said in an interview, he was not convinced of his own acting capabilities and all the roles he was offered were reprises of the Ben character. With his return to a leading role in LCA there should be no doubt anymore about his acting. He's simply brilliant as a man stupid and evil enough to put his family in misery, but smart enough to realize what he's done and be torn by remorse about it. A must see.",
         "The movie is set in rural Belgium, in a place inhabited by poor, gloomy people who do not look like Julia Roberts or Hugh Grant. The \"hero\", a clueless photographer for a local newspaper, is a father who decides that his family deserves better : the only way out appears to be in the Guinness Books of Records. After a failed attempt at spitting olive stones as far as he can, he forces his son to be the next world champion of door openings so that the family can get a new car... This movie is a unique mix of gritty social comment (though not heavy-handed) and dark humour, something often to be found in recent movies from Belgium, the Netherlands and North of France (Benoit Poelvoorde was also the hero of \"Man Bites Dog\"). Some of the strangest people we meet (a Belgian Elvis, a school teacher right out of the 50's) are in fact playing themselves, and the scenario itself is based on the true story of a father who trained his 3-year old son to be a professional biker. Certainly not for all tastes, and with its share of very dark humour and a little brush of tragedy, and with a fantastic Poelvoorde, \"Les convoyeurs\" will please the viewers who enjoy \"different\" movies.",
         "The director of this film has obviously seen a Shane Meadows film or two. Not only was the film set in a small town and centred around the poorer parts but it was also in black and white and featured an odd lonely man who befriends someone much younger than him. It has been described as a comedy but it isn't funny in the way that Hollywood tells you when to laugh and builds up to a big punchline (that is usually very disappointing anyway). This film is of a realist nature and so anything that is funny is funny because it could happen to you or i. The plot is simple and the performances are brilliant. Everything is subdued and wonderfully not over the top which gives it a certain charm that is lost in anything that places special effects over a storyline. The young girl who played Luise could have a bright future ahead of her. Why is that the children i have seen in European cinema are much better at acting than those in Hollywood films? I blame the parents.",
         "This is an absurdist dark comedy from Belgium. Shot perfectly in crisp black and white, Benoît Poelvoorde (Man Bites Dog) is on fine form as Roger, the angry, obsessive father of a family in a small, sullen Belgian mining town. Roger is a photographer who, along with his young daughter Luise, visits road accidents to take photos. He is also obsessed with winning a car by entering a competition where the contestant has to break a record - and he decides that his son, Michel, must attempt to break the record of perpetually walking through a door - he even hires an overweight coach to train him. Michel dresses as Elvis and has a spot on a radio show called 'Cinema Lies', where he describes mistakes in films. Luise is friendly with near neighbour Felix, a pigeon fancier. Roger is a callous figure as he pushes Michel right over the limit during the record attempt, which almost results in his death. Interspersed throughout the film are Magritte-like surreal images. It's undeniably charming and well worth your time.",
         "This movie takes place in the Belgian region of Charleroi, which used to be a wealthy area thanks to the mines and the metallurgy. Right now is the poorest area in Belgium with serious problems of unemployment. To reflect this reality there are two ways in cinema: by doing a crude social movie close to the Ken Loach point of view, or by getting some distance and from there expose a narration that superficially could be funny but undoubtly the bitter taste will remain in the audience. In this way, this movie reflects some characters obsessed in trying to evade themselves from that oppressive environment: a father who wants to beat any of the records included in the Guiness book, a daughter in love with doves, etc. To sum up, in my opinion the spectator will find here a movie to laugh while seeing it and a movie to reflect on after seeing it.",
         "Some critics found this film bleak, but for me there was enough good humour and optimism to overcome this impression. For example, the quietly positive and stoic character of the daughter is the still centre of the film, often counterbalancing the unhappy aspects of the setting and plotline. The film is full of original ideas and characters, and the final outcome is not predictable: I felt it could've gone either way. By the way, many reviews I've read mention the effective use of black and white, but the print I saw, shown on the SBS TV network here in Australia, was in full colour.",
         "Strange... I like all this movie crew and dark humor movies; but didn't like this one at all! It's awful, horrible and surely not funny at all. Pity cannot do a whole movie plot, disgust either. And it was really boring. Long empty moments fills the movie; it could have been removed. It should have been in another shorter format, surely. Maybe i expected too much from the crew - like saving the movie lol -. It's also filled with overused clichés of characters and situations... I don't get it why people liked it... \"Poetry\", \"hope\"; nope 'mam, didn't see anything like that! ^^ All in all, it's empty and crude, pitiful and hopeless. Oh darn this one........",
         "It's wonderful to see that Shane Meadows is already exerting international influence - LES CONVOYEURS ATTENDANT shares many themes with A ROOM FOR ROMEO BRASS: the vague class identity above working but well below middle, the unhinged father, the abandoned urban milieu, the sense of adult failure, the barely concealed fascism underpinning modern urban life. But if Meadows is an expert formalist, Mariage trades in images, and his coolly composed, exquisitely Surreal, monochrome frames, serve to distance the grimy and rather bleak subject matter, which, Meadows-like, veers from high farce to tragedy within seconds. There are longueurs and cliches, but Poelvoorde is compellingly mad, an ordinary man with ordinary ambitions, whose attempts to realise them are hatstand dangerous; while individual set-pieces - the popcorn/pidgeon explosions; the best marriage sequence since THE DEAD AND THE DEADLY - manage to snatch epiphany from despair."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "K-Star",
         "K2 SA",
         "Radio Télévision Belge Francophone (RTBF)"
      ],
      "summaries": [],
      "budget": 0
   },
   "movielensId": 3407,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1999-05-19",
      "dvdReleaseDate": null,
      "directors": ["Benoît Mariage"],
      "runtime": 94,
      "movieId": 3407,
      "title": "The Carriers Are Waiting",
      "mpaa": null,
      "actors": [
         "Benoît Poelvoorde",
         "Morgane Simon",
         "Bouli Lanners",
         "Dominique Baeyens",
         "Philippe Grand'Henry",
         "Jean-François Devigne",
         "Lisa LaCroix",
         "Philippe Nahon"
      ],
      "imdbMovieId": "0201538",
      "originalTitle": "Les convoyeurs attendent",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "No overview found.",
      "tmdbMovieId": 31336,
      "avgRating": 2.59615,
      "releaseYear": "1999",
      "numRatings": 26,
      "posterPath": "/9XCgE28osPybAjJcNLi86BNRfYp.jpg"
   }
}