{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0180181",
      "video": false,
      "title": "Soft Fruit",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Patsy",
               "gender": 1,
               "credit_id": "52fe4bafc3a36847f820f571",
               "name": "Jeanie Drynan",
               "profile_path": "/qF9FXda96C0QWpIWz8BFWcq14ER.jpg",
               "id": 3060,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Vic",
               "gender": 0,
               "credit_id": "52fe4bafc3a36847f820f575",
               "name": "Linal Haft",
               "profile_path": null,
               "id": 75258,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Bo",
               "gender": 2,
               "credit_id": "52fe4bafc3a36847f820f579",
               "name": "Russell Dykstra",
               "profile_path": null,
               "id": 94349,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Josie",
               "gender": 0,
               "credit_id": "52fe4bafc3a36847f820f57d",
               "name": "Genevieve Lemon",
               "profile_path": "/fgpd0MzMdvbnLOLWRROoBMGZLdp.jpg",
               "id": 10760,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Nadia",
               "gender": 0,
               "credit_id": "52fe4bafc3a36847f820f581",
               "name": "Sacha Horler",
               "profile_path": "/eebI8i2mJqXvI9ay2kbJGneeW5E.jpg",
               "id": 79713,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4bafc3a36847f820f567",
               "name": "Christina Andreef",
               "profile_path": null,
               "id": 1027277,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4bafc3a36847f820f56d",
               "name": "Christina Andreef",
               "profile_path": null,
               "id": 1027277,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [],
      "popularity": 0.021071,
      "production_countries": [],
      "id": 117259,
      "vote_count": 0,
      "budget": 0,
      "overview": "For the first time in 15 years, all four siblings in a family show up to care for their dying mother, who is only given a couple of weeks to live. One comes from America with her two children. A divorced sister also comes with her child and sneaks off regularly to meet a mystery man who may be her ex-husband. The third &amp; youngest daughter is an unmarried nurse aware of her ticking biological clock. The only son chases after his grumpy father who seems to not care a whit about his wife's circumstances. The four are also faced my their mother's dreams to accomplish a few things before she dies - to visit a beach she had visited in the past, to see her youngest married, and to visit Paris. She also wants to be embalmed and be honored with a 21 gun salute. Thus the whole group has to set off in the quest to fulfill their mother's wishes.",
      "similar": [],
      "original_title": "Soft Fruit",
      "runtime": 101,
      "poster_path": "/ibhCUC9yUkocQiQHmca5WHx2Yxp.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1999-10-28",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Australia",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Christina Andreef"],
      "runtime": 101,
      "synopsis": null,
      "writers": ["Christina Andreef"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0180181/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU3MTA1NzIxOV5BMl5BanBnXkFtZTcwMTc5OTEyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jeanie Drynan, Linal Haft, Russell Dykstra | See full cast and crew »"],
      "reviews": [
         "Christina Andreef's short films have always shown great promise for a feature film. I was worried that she might fall victim to the quirky Aussie trade mark of filmmaking and create jokes around another dysfunctional family gathering for one last flight. But she pulled it off! SOFT FRUIT tells the tale of a blue collar family in the industrial area of Port Kembla who gather for their dying mother. Normally families come together after the death of a parent but in this instant the mother is still alive and part of the fun as each child comes back home with a suitcase full of problems and past confrontations. And what a joy it is to sit back and watch a family as screwed up as your own. There are a few questionable moments but the film manages to pull itself together in a tight 102 minute package.",
         "I saw Soft Fruit for the second time to day and I have to say I loved it even more the second time round. This is the funniest movie I have seen in ages. There are many things that make this movie work. Firstly the realism of the family. They looked like they were a real family and that they belonged together. Not only that but it was their surroundings. They didn't live in the best house, they didn't have the best jobs, they didn't drive the best or the fastest cars. They were like real people living real lives. The good humor in this movie made it even more enjoyable. I would recommend this movie to anyone looking for a real story, with real people and real laughs.",
         "This films captures the all-encompassing breadth of family life from love to brutality, and displays it in a no-punches way that touches the heart strings. As the four children return to share their dying mother's last weeks we see the old family conflicts, rivalries and tensions flare, as each struggles to gain a special relationship with their dying mother, played whimsically by Jeanie Drynan. The bad language may upset some prudes, but is all in the spirit of the movie. Russell Dykstra's winning perfomance as ex-con biker son Bo is one of the best I've seen for years. Sacher Horler is proving to be a major Australian talent. How nice to see a selection of females that aren't wafer thin!!",
         "I saw Soft Fruit today and am still thrilled. The performances from the cast are wonderful, Jeanie Drynan in particular. The casting is amazing - these people actually ARE a family. Its touchingly sad and yet very very funny. One of the best Aussie films, in years. These people don't parade their Australianness like so many other local films do. Great script, great cast! Beats the pants off any thing else around!",
         "\"Soft Fruit\" is a bittersweet Aussie flick about a terminally ill mother who summons her adult children to her bedside for her final days. Anything but a downer, this cross-genre flick shows us humor, poignancy, and quirkiness as we watch a barely functional and functional barely family deal with the passing of its matriarch. An enjoyable film, a critics darling, and a winner of some fringe awards, \"Soft Fruit\" is a worthwhile watch for those into flicks about working class Aussies.",
         "The performances are fabulous, but what really makes this movie special is the care which has been taken to build a symphony of metaphor in the relationships in this family. Clearly done from a woman's point of view (the men can't cope, and all that's needed is for the father to reunite with the son), this piece still goes beyond the usual chick-flick tear-jerker to keep you involved with fascinating metaphors and unlikely characters which nonetheless tell the truth. I am appalled that it has yet to receive distribution.",
         "An exceedingly human film of humor, love and life. I saw it for the first time today and want to see it again right now. I usually like Australian film, when it's not melodramatic, and this film is admirable that it doesn't sink to the horrible depths other films might - given the subject matter - to grab you with it's realism. Another user commented that it was good to see the women in this film that weren't wafer thin, and I would have to agree wholeheartedly! It's a refreshing departure, given the typical Hollywood fare. As is this film, I would recommend it without hesitation!",
         "This movie was very moving and one of those movies that makes you think about life and the choices that you make. In my opinion Soft Fruit did not get as much attention as it deserved and was over looked. Jeanie Drynan is a great actress and has starred in such movies as Muriel's wedding. In Muriel's wedding Jeanie's character was such a sad character to follow but you could truly feel her pain and struggles. The line up in Soft Fruit is fantastic and the acting is also believable and enjoyable. I still can't find a copy of Soft Fruit and have not seen it since the year it was released. It speaks volumes when you see a movie and still think about it 12 years later. I can't even find it on Netflix but, if you are fortunate to run across this movie you should watch it.",
         "I saw this movie in Turin Film-festival last November, and I hope it's coming soon on \"regular\" screens. I was emotionally moved because story and cast remembered me the true story of a friend of mine, whose mom died a few times ago. The plot escape from gender clichés and the characters are round and well performed. Andreef shows her skillness in directing, learned collaborating with Jane Campion for several times. But she also shows how far their views can be distant, moreover if you compare this movie to Campion's last one.",
         "There is a moment in the film between Russell Dykstras character and the father, Russell Dykstra strips naked, and then his father does the same to get him in the car, and they kind of stare at each other for about 3 seconds, and for that moment in the film, something magical happens, but it was a real connected moment between them and I think it made the film what it is. Just that moment. There is a moment in the film between Russell Dykstras character and the father, Russell Dykstra strips naked, and then his father does the same to get him in the car, and they kind of stare at each other for about 3 seconds, and for that moment in the film, something magical happens, but it was a real connected moment between them and I think it made the film what it is. Just that moment."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "New South Wales Film & Television Office",
         "Soft Fruit"
      ],
      "summaries": [
         "For the first time in 15 years, all four siblings in a family show up to care for their dying mother, who is only given a couple of weeks to live. One comes from America with her two children. A divorced sister also comes with her child and sneaks off regularly to meet a mystery man who may be her ex-husband. The third & youngest daughter is an unmarried nurse aware of her ticking biological clock. The only son chases after his grumpy father who seems to not care a whit about his wife's circumstances. The four are also faced my their mother's dreams to accomplish a few things before she dies - to visit a beach she had visited in the past, to see her youngest married, and to visit Paris. She also wants to be embalmed and be honored with a 21 gun salute. Thus the whole group has to set off in the quest to fulfill their mother's wishes.",
         "Three sisters and their ex-con brother return home to nurse their mother, who is dying of cancer."
      ],
      "budget": 0
   },
   "movielensId": 3410,
   "movielens": {
      "languages": [""],
      "releaseDate": "1999-10-28",
      "dvdReleaseDate": null,
      "directors": ["Christina Andreef"],
      "runtime": 101,
      "movieId": 3410,
      "title": "Soft Fruit",
      "mpaa": null,
      "actors": [
         "Jeanie Drynan",
         "Linal Haft",
         "Russell Dykstra",
         "Genevieve Lemon",
         "Sacha Horler"
      ],
      "imdbMovieId": "0180181",
      "originalTitle": "Soft Fruit",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "For the first time in 15 years, all four siblings in a family show up to care for their dying mother, who is only given a couple of weeks to live. One comes from America with her two children. A divorced sister also comes with her child and sneaks off regularly to meet a mystery man who may be her ex-husband. The third &amp; youngest daughter is an unmarried nurse aware of her ticking biological clock. The only son chases after his grumpy father who seems to not care a whit about his wife's circumstances. The four are also faced my their mother's dreams to accomplish a few things before she dies - to visit a beach she had visited in the past, to see her youngest married, and to visit Paris. She also wants to be embalmed and be honored with a 21 gun salute. Thus the whole group has to set off in the quest to fulfill their mother's wishes.",
      "tmdbMovieId": 117259,
      "avgRating": 3.5,
      "releaseYear": "1999",
      "numRatings": 55,
      "posterPath": "/ibhCUC9yUkocQiQHmca5WHx2Yxp.jpg"
   }
}