{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0168475",
      "video": false,
      "title": "Babymother",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "",
               "gender": 0,
               "credit_id": "5394130ec3a3684f450008f6",
               "name": "Anjela Lauren Smith",
               "profile_path": "/j3jGmacxOrsFjDLztQNBYlvqED3.jpg",
               "id": 67207,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "",
               "gender": 1,
               "credit_id": "53a6c1970e0a261445003816",
               "name": "Caroline Chikezie",
               "profile_path": "/qXHS3UhFx2dd6tSuBpPqfSbAy3.jpg",
               "id": 25448,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "",
               "gender": 0,
               "credit_id": "53a6c1a60e0a261436003850",
               "name": "Don Warrington",
               "profile_path": "/szlydzWoMaCGcgpB853ZcRN7Da8.jpg",
               "id": 49813,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 2,
               "credit_id": "53a6c1b60e0a261439003891",
               "name": "Vas Blackwood",
               "profile_path": "/ftmxxqzZ1aaJVS8aT6TdLD4qHkI.jpg",
               "id": 995,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 2,
               "credit_id": "53a6c1f50e0a261442003860",
               "name": "Wil Johnson",
               "profile_path": "/AppytaiEGmq9UO5tPzTmpCqUFV6.jpg",
               "id": 197126,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 0,
               "credit_id": "53b16ccfc3a3682ed8006265",
               "name": "Suzette Llewellyn",
               "profile_path": null,
               "id": 1225417,
               "order": 6
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 1,
               "credit_id": "5474ed259251413981002996",
               "name": "Corinne Skinner-Carter",
               "profile_path": null,
               "id": 1360193,
               "order": 7
            },
            {
               "cast_id": 8,
               "character": "Anton",
               "gender": 2,
               "credit_id": "58d0833c92514159ca003949",
               "name": "Anton Rice",
               "profile_path": null,
               "id": 1780918,
               "order": 8
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "5351d9f60e0a26560300210e",
            "name": "Julian Henriques",
            "profile_path": null,
            "id": 1311102,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "TV Movie",
            "id": 10770
         }
      ],
      "popularity": 0.154728,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 78231,
      "vote_count": 1,
      "budget": 0,
      "overview": "A single mother determined to make it as a singer puts together an all girl reggae group named Neeta, Sweeta, &amp; Nastie with her friends. Living in a housing project with little support, the odds are obviously against her. Emotionally she struggles too as she learns at her mother's death that her actual mother is the woman she had thought was her older sister. With the help of a female agent, the group starts to get some exposure and rises above their setting.",
      "similar": [],
      "original_title": "Babymother",
      "runtime": 82,
      "poster_path": "/tucMWe5hQ0UX7rhwagveow45mj4.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Channel Four Films",
            "id": 181,
            "origin_country": "GB"
         },
         {
            "logo_path": null,
            "name": "Arts Council of England",
            "id": 718,
            "origin_country": ""
         }
      ],
      "release_date": "1998-09-11",
      "vote_average": 3,
      "belongs_to_collection": null,
      "tagline": "From Ragga to Riches.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "£",
      "directors": ["Julian Henriques"],
      "runtime": 82,
      "synopsis": null,
      "writers": [
         "Julian Henriques",
         "Vivienne Howard"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0168475/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk5MjI1NzA5N15BMl5BanBnXkFtZTcwNDU4MDEzMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Anjela Lauren Smith, Wil Johnson, Caroline Chikezie | See full cast and crew »"],
      "reviews": [
         "New talent Anjela Lauren Smith shines in this story of a young woman struggling with the trials of motherhood and establishing herself as a dancehall diva. This film comments on the black community and its attitude to women. While women often are left to raise children on their own, they are revered for this. But when Anita and her girlfriends decide to launch themselves on the ragga dancehall scene they have a tough time being taken seriously by the men not least Anita's Babyfather played by Will Johnson. There are some talented players in this picture not least the captivating Anjela Lauren Smith.",
         "I've heard many people slate this film as 'the worst ever', which is a miserable overreaction. Though the plot could be better etc. it is completely tongue in cheek and such a rare idea - 'a dancehall musical shot on location in Harlesden' - that I like it. Maybe not something I'd watch too many times, but the fact that it's out there is enough to make me smile. Especially if it winds up people who are unwilling to suspend their own narrow views of the world. How the female toasters use their vibrant sexuality as expression, opposed to the aggressiveness of the male counterparts that dominate the scene in reality (Buju Banton etc) is interesting. There's a pretty decent D&B tune in their at one point too. Think of it as a reaction to the falseness of the Spice Girls 'girl power' doing the global marketing rounds at the time.",
         "I caught this movie on Starz. I admit I never heard of it. First of all I am not going to say this was a a bad movie. I have seen far too many bad movies for this to qualify as one. It is obvious the movie was made on a shoestring budget and it never took itself seriously. I was confused at first though. When in the first scene of the movie the two leads break out in song it almost seemed to me like a musical. Not a movie about music with a few songs but a straight out musical with singing dialog. Thankfully it was just a scare because I was not prepared to watch a musical which is my least favorite genre of movies particularly the movie musicals of the last 20 years. This is about a couple with two children who both love music but only one, the husband seems to be able to follow his dream. The wife is a little tiffed about this and sets out to make herself a name in the music business. She has two best friends and they start a singing trio. Mainly reggae music. They go through the usual ups and downs. Nothing new is offered in this movie. Cummulating at the obligatory main concert in the end. My only problem with the movie that the leads were not fully explained to us. We know that her mother is not crazy about him, but why. He seems to love her daughter and he appears to be making a success out of his career. Other then the recent career misunderstanding they look like a happy family. There is a funky relationship going on with her sister. Who seems to be who her mother wants her to aspire to be like. But later in the movie that relationship takes a twist. And a few things are explained. But I am not going to spoil and tell. But it came out of left field. And what in the heck was going on with the wardrobe? It looked like something out of children's show where the adults play childlike characters. Or a David Bowie in his Ziggy Stardust days. The women in particular. What this movie did offer is a good solid cast of actors I have never heard of. I live in NY and this was a movie produced in England so it is very possible these are actors known in Great Britian. I do believe I saw the male lead in other pictures but I am not sure. I liked the empowerment of the woman lead to follow her dream and not let the husband tell her she cannot do it. I liked the closeness of the friendship of the 3 women. You do not see that enough in movies. I loved the music with the exception of the horrendous Babymothers song. Te performances were cool. I would of liked to see more performances though. All in all the movie set out to do what ALL movies I believe should do and that is entertain the viewer. Who could ask for anything more.",
         "This is so easy to launch a poor 1.5 on that movie. Yes it is very naïve,the plot is thin and not original but it does add an interesting and compelling view on some black communities,and the fate of their teenage mothers and to say the least it is full of energy, the cast is more than correct, and the music is quite good. Less dull and politically correct than a lot of Lifetime and HBO T.V movies, less ridiculous that a lot of Hollywood blockbusters.At least it aims at entertaining and edifying it's fresh, rough, definitely not so bad if you give it a shot. Well I enjoyed it more than Fast and Furious, Pearl Harbor or XXX, you'll say this is not difficult.",
         "While this was not the best movie I have ever seen, it was not the worst either. I happen to like the cliché movies about underdogs. Even though the basic storyline is the same, there are different circumstances each \"hero/heroine\" must overcome to achieve their goals. Give props to Neeta for going forward and letting Byron hold her down. She struggled, as many single mothers do, with her mother/grandmother, and the daily responsibilities of motherhood. Not the best acted, not the most creative plot, but above all...NOT the worst movie ever made. Looking at the cast, it is mostly made up of lesser known actors. When comparing this movie, you can't compare apples to oranges. This film and the actors in cannot be compared to the Morgan Freeman's and Cicely Tyson's of the black acting community. It is also a genre that is not typically know as making epic movies that will live on forever in the memories of the minds of the viewers. It is what it is: A film about the struggles of overcoming hurdles that are thrown in front of people living life in an inner city, lower class setting. I liked it! Thank you Starz for running it, otherwise I would never have seen it.",
         "What a surprise. Jamacain girls live up to their potential. The costumes were outrageous. The cinematography was beautiful. Highly recommended. A wonderful coming of age story for twenty-something girls. The main character is nicknamed Nita for Anita. Her husband wants her to be by his side. He encourages her to sing. When she finally takes his advice he dogs her out by not letting her sing on stage as promised. She makes many mistakes along the way. It is an up and down roller coaster ride about love and forgiveness. It gives a wonderful look at the Jamaican community in London, England I presume.",
         "Reading the reviews for another movie I found people calling it (that movie) the 'worst film ever made'. Whilst I disagreed with them, it did inspire me to write a quick review (or perhaps a warning?) about the film that I do view as the worst that I have ever seen, namely Babymother. The acting is useless, the plot weak, the dialogue terrible and the climax (lets all do a rap about being single mothers) absolutely cringe-worthy. Had it not been for my then girlfriend wanting to stay until the end 'in case it got any better' I would have left half way through this absolute disaster of a film. Do yourself a favour and watch something - indeed anything - else instead. I'm sure that you'll prefer it."
      ],
      "genres": [
         "Drama",
         "Musical"
      ],
      "productionCompanies": [
         "Arts Council of England",
         "Channel Four Films",
         "Formation Films Production"
      ],
      "summaries": ["A single mother determined to make it as a singer puts together an all girl reggae group named Neeta, Sweeta, & Nastie with her friends. Living in a housing project with little support, the odds are obviously against her. Emotionally she struggles too as she learns at her mother's death that her actual mother is the woman she had thought was her older sister. With the help of a female agent, the group starts to get some exposure and rises above their setting."],
      "budget": 2000000
   },
   "movielensId": 3411,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-09-11",
      "dvdReleaseDate": null,
      "directors": ["Julian Henriques"],
      "runtime": 82,
      "movieId": 3411,
      "title": "Babymother",
      "mpaa": null,
      "actors": [
         "Anjela Lauren Smith",
         "Caroline Chikezie",
         "Don Warrington",
         "Vas Blackwood",
         "Wil Johnson",
         "Suzette Llewellyn",
         "Corinne Skinner-Carter",
         "Anton Rice"
      ],
      "imdbMovieId": "0168475",
      "originalTitle": "Babymother",
      "genres": [
         "Drama",
         "Music",
         "TV Movie"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A single mother determined to make it as a singer puts together an all girl reggae group named Neeta, Sweeta, &amp; Nastie with her friends. Living in a housing project with little support, the odds are obviously against her. Emotionally she struggles too as she learns at her mother's death that her actual mother is the woman she had thought was her older sister. With the help of a female agent, the group starts to get some exposure and rises above their setting.",
      "tmdbMovieId": 78231,
      "avgRating": 3,
      "releaseYear": "1998",
      "numRatings": 7,
      "posterPath": "/tucMWe5hQ0UX7rhwagveow45mj4.jpg"
   }
}