{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "chinese civil war",
            "id": 4355
         },
         {
            "name": "romance",
            "id": 9840
         },
         {
            "name": "interracial romance",
            "id": 10194
         },
         {
            "name": "hong kong",
            "id": 12354
         },
         {
            "name": "racism",
            "id": 12425
         },
         {
            "name": "doctor",
            "id": 13005
         },
         {
            "name": "cross cultural relationship",
            "id": 173823
         },
         {
            "name": "mixed race child",
            "id": 188014
         }
      ],
      "imdb_id": "tt0048316",
      "video": false,
      "title": "Love Is a Many-Splendored Thing",
      "recommendations": [
         77915,
         116696,
         103130,
         143529,
         115360,
         79359,
         117198,
         132994,
         107673,
         61087,
         138311,
         42106,
         184915,
         81789,
         103886,
         118898,
         429866,
         226343,
         38027,
         113936
      ],
      "backdrop_path": "/qzjzJC034xyKuQn0NJUrti9lHPf.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Mark Elliott",
               "gender": 2,
               "credit_id": "52fe4880c3a36847f816a8b3",
               "name": "William Holden",
               "profile_path": "/6sa5f8p1KBhYxJDEmCLxn7QLcBe.jpg",
               "id": 8252,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Dr. Han Suyin",
               "gender": 1,
               "credit_id": "52fe4880c3a36847f816a8b7",
               "name": "Jennifer Jones",
               "profile_path": "/gp50aCso1iQNqsI7DVGILsnokTU.jpg",
               "id": 39554,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Humphrey Palmer-Jones",
               "gender": 2,
               "credit_id": "52fe4880c3a36847f816a8bb",
               "name": "Torin Thatcher",
               "profile_path": "/vO8Dw33jVxVU3gR1FWbgomrEmRB.jpg",
               "id": 10925,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Adeline Palmer-Jones",
               "gender": 0,
               "credit_id": "52fe4880c3a36847f816a8bf",
               "name": "Isobel Elsom",
               "profile_path": "/ccoA79FB3Buw1rooFBkCSqVnrpt.jpg",
               "id": 95263,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Dr. John Keith",
               "gender": 2,
               "credit_id": "52fe4880c3a36847f816a8c9",
               "name": "Murray Matheson",
               "profile_path": "/gUtISlVx9pxNFOfWjVEqeT5tiHv.jpg",
               "id": 138179,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Anne Richards",
               "gender": 1,
               "credit_id": "52fe4880c3a36847f816a8cd",
               "name": "Virginia Gregg",
               "profile_path": "/kekj3Jr2u34qr28Deq30AIdHQM.jpg",
               "id": 19110,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Robert Hung",
               "gender": 2,
               "credit_id": "52fe4880c3a36847f816a8d1",
               "name": "Richard Loo",
               "profile_path": null,
               "id": 10344,
               "order": 6
            },
            {
               "cast_id": 21,
               "character": "Nora Hung",
               "gender": 0,
               "credit_id": "59225f0a9251414add060e7f",
               "name": "Soo Yong",
               "profile_path": null,
               "id": 124936,
               "order": 7
            },
            {
               "cast_id": 22,
               "character": "Third Uncle",
               "gender": 2,
               "credit_id": "59225f17c3a3687a640633bd",
               "name": "Philip Ahn",
               "profile_path": "/pVJZ47pTD15MntJUlFe458Mcuhc.jpg",
               "id": 95014,
               "order": 8
            },
            {
               "cast_id": 23,
               "character": "Suzanne",
               "gender": 0,
               "credit_id": "59225f219251414a57060407",
               "name": "Jorja Curtright",
               "profile_path": null,
               "id": 170599,
               "order": 9
            },
            {
               "cast_id": 24,
               "character": "Suchen, Suyin's sister",
               "gender": 1,
               "credit_id": "59225f2e9251414a57060416",
               "name": "Donna Martell",
               "profile_path": "/rovoZCXFFgXsEIt2LYvu0SBMkOv.jpg",
               "id": 94991,
               "order": 10
            },
            {
               "cast_id": 25,
               "character": "Fifth Brother",
               "gender": 2,
               "credit_id": "59225f3ec3a368774e067920",
               "name": "James Hong",
               "profile_path": "/8k4RrDRsqkvJDePU8ciMOOx5Zso.jpg",
               "id": 20904,
               "order": 11
            },
            {
               "cast_id": 26,
               "character": "Lee Foo",
               "gender": 2,
               "credit_id": "59225f4c9251411f6a002ca6",
               "name": "Keye Luke",
               "profile_path": "/sUW8C9x2ir0YTJ81GdiaDQpsx1a.jpg",
               "id": 16103,
               "order": 12
            },
            {
               "cast_id": 27,
               "character": "Rosie Wu",
               "gender": 0,
               "credit_id": "59225f599251411f6a002cb7",
               "name": "Marie Tsien",
               "profile_path": null,
               "id": 1821347,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4880c3a36847f816a8c5",
               "name": "Henry King",
               "profile_path": "/3gG3Ctgcttq6632GIeCqBTsv8nB.jpg",
               "id": 37362,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4880c3a36847f816a8d7",
               "name": "Han Suyin",
               "profile_path": null,
               "id": 1170228,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe4880c3a36847f816a8dd",
               "name": "John Patrick",
               "profile_path": null,
               "id": 69393,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "59225e769251414990062fe4",
               "name": "Buddy Adler",
               "profile_path": null,
               "id": 1274641,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "59225e819251414ab10606a0",
               "name": "Alfred Newman",
               "profile_path": "/498k6KmplSJPvWzAecS7eUnaBNg.jpg",
               "id": 8503,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "59225e89c3a368723d066a5d",
               "name": "Leon Shamroy",
               "profile_path": null,
               "id": 13270,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "59225ea6c3a368791205bfb0",
               "name": "George W. Davis",
               "profile_path": null,
               "id": 10604,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "59225eb29251411f6a002c2d",
               "name": "Lyle R. Wheeler",
               "profile_path": null,
               "id": 3358,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "59225ebd9251414a570603b1",
               "name": "Walter M. Scott",
               "profile_path": null,
               "id": 9587,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "59225ec7925141482f062b6f",
               "name": "Jack Stubbs",
               "profile_path": null,
               "id": 1383415,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "59225ed79251411f6a002c4a",
               "name": "Ben Nye",
               "profile_path": null,
               "id": 26175,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 2,
               "credit_id": "5982f9c5925141425700bee2",
               "name": "William Reynolds",
               "profile_path": null,
               "id": 3099,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 3.029033,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 53879,
      "vote_count": 28,
      "budget": 0,
      "overview": "A widowed doctor of both Chinese and European descent falls in love with a married American correspondent in Hong Kong during China's Communist revolution.",
      "similar": [
         40807,
         510,
         277216,
         10312,
         11104,
         10052,
         378018,
         9079,
         2210,
         11821,
         3114,
         27029,
         11306,
         24150,
         78383,
         340027,
         26976,
         55922,
         393764,
         75802
      ],
      "original_title": "Love Is a Many-Splendored Thing",
      "runtime": 102,
      "poster_path": "/a9aqlitzVeo5fq6UX5Ekl5kopco.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "普通话",
            "iso_639_1": "zh"
         }
      ],
      "production_companies": [{
         "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
         "name": "20th Century Fox",
         "id": 25,
         "origin_country": "US"
      }],
      "release_date": "1955-08-18",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "The price they pay when they come out of their secret garden and face the world in modern-day Hong Kong - makes this one of the screen's unforgettable experiences!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Henry King",
         "Otto Lang"
      ],
      "runtime": 102,
      "synopsis": null,
      "writers": [
         "John Patrick",
         "Han Suyin"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0048316/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTc2NjE0NTUzNF5BMl5BanBnXkFtZTYwMjc5Njk5._V1_SX214_AL_.jpg",
      "actors": ["Stars: William Holden, Jennifer Jones, Torin Thatcher | See full cast and crew »"],
      "reviews": [
         "We all want to fall in love... The experience makes us feel completely alive, where every sense is heightened, every emotion is magnified... It may only last a moment, an hour, an afternoon, but that doesn't reduce its value, because we are left with memories that we treasure for the rest of our lives... I love watching people fall in love... It must have something to do with the excellent chemistry between the main characters... Mark Elliott, a charming sensitive American war correspondent, arrives in Hong Kong at the dawn of the Korean war... He finds in Han Suyin an awesome beauty of true grace... Han Suyin, a lovely Eurasian doctor is captivated by Mark's tenderness and insight... It was instant attraction when they first met... The two commence a passionate affair, leading them to fall deeply in love... Their love is so strong, so wonderfully expressed that highlights Elliot's married status, and the difficulties of the troubled time of the Korean War, communism and race relations... Holden is an inspired choice for the role... Not only does he have an imposing screen presence, but he brings the perfect mix of enlightenment, compassion and emotion to the part... Opposite him Oscar Winner Jennifer Jones, perfect in her oriental look, radiantly beautiful in that traditional and modern Asian-inspired Cheongsam... Jones floods her role with personal emotion giving her character a charismatic life of its own... She delivers a heartfelt performance turning her character into a woman who undergoes a spiritual and emotional awakening... Her scene in that verdant hill where she takes refuge is exquisitely touching specially when we heard Mark's voice whispering: \"We have not missed you and I... that many-splendored thing.\" Henry King - who has established himself as a masterful director of romances - spreads the theme tune (by Alfred Newman) in the air above the cosmopolitan harbor... His film is colorful, elegant, with excellent cinematography and set design... Nominated for eight Academy Awards, this beautiful and sensitive motion picture won three: Best Costume Design; Best Music and Best Score...",
         "Those prophetic words were spoken by William Holden (as a war reporter) to the beauteous Jennifer Jones (as a Eurasian doctor), explaining his failing marriage on the beach. They start an affair, despite huge odds of adultery and racial issues. In Hollywood of the 1950s, interracial romance was allowed but only with dire consequences at the end. Beautiful Hong Kong scenery (although some beach scenes look studio-bound), a famous title tune, poetic script, lovely background music (by Alfred Newman), great costumes, outstanding performances, especially Jones (directed here by Henry King, who also did \"The Song of Bernadette - 1943, an Oscar for Jones) still make this a world-class romance weeper.",
         "In the book The Films of William Holden, the author says the film does not wear well and its popularity is due to the hit title song from the film that you could not get away from hearing in 1955. How well I re- member, though I was only eight years old back then. I disagree, the film is a tremendous romance for those who like that and the location photography in Hong Kong is fabulous. A few things struck me. Since Burt Lancaster and Deborah Kerr had their famous romantic swimming scene in From Here to Eternity, I think that Harry Cohn was trying to one up Darryl Zanuck with having Bill Holden and Jennifer Jones do the same. I also think and I could cite other film examples from 20th Century Fox that Zanuck acquired the film rights for the original novel with Tyrone Power in mind for the male lead. Holden is fine in the part, but try and picture Power in it. Not to mention the fact that Power's favorite director Henry King is at the helm. But it is true that the song is the real star of the film. It really carries the romantic plot along. One of the great examples of the right music making a good film. Ironically both the stars dealt with a lot of heartache in their lives. Holden with his alcoholism and Jones with the various marriages and deaths of people close to her. But when you see them high on that windy hill in Hong Kong they are a pair of the most romantic lovers ever filmed. RIP Bill Holden and Jennifer I hope that you're doing well in your retirement and nothing but good things happen for you from now on.",
         "I first saw this film in the mid 60's when I was a teenager, and it moved me so much, in fact the end scene where Han Suyin hears of Mark's death, and then rushes to the hill in disbelief, where you then hear Mark's voice saying \"Give Me Your Hand\", and then the image of him disappears, the butterfly with it's superstitious meaning, the music, the shattered emotions of Love of Han Suyin, just left me sobbing my heart out. I was outwardly crying bitterly, my mother and sister looked up and were shocked at my reaction. I just left the room to be on my own. Fortunately I do not react like that any more BUT I always cry at the end. I love everything about the film, the music mostly, the costumes of Han Suyin, and location. The beauty of Jennifer Jones and the handsome William Holden, they were both at their best. I have the VHS and DVD of this wonderful movie. I also have two versions of the Music & Lyrics by Arthur Newman and Sammy Fain. I also have the book A Many Splendored Thing by Han Suyin. I recommend this film 100%",
         "I just watched this film for the first time as an adult. I still have tears in my eyes. I wish they made movies like this now, without all the crass \"sex stuff\", that seems to be required all too often. Obviously, Jennifer Jones and William Holden (perfect casting) have great passion, but they have true to the mark tenderness. My favorite line is \"The greatest strength is gentleness\", and William Holden portrays an intelligent, gentleman. He and Jones looked fantastic in their swimsuits, and when she asked him to bring her a cigarrette behind the rocks, I thought for sure they were going to have a torrid make out scene. (Or at least torrid by 1955 standards.) But no, she makes him wait! Also, a woman physician, who is Eurasian, was quite an idea back then. This movie was way ahead of it's time in many respects. I intend to get it on DVD, so it will last forever, just like their love!",
         "Two great stars and a legendary Director created a magnificent throbbing love story that is memorable and moving on so many levels. Henry King directed Jennifer Jones in her first hit Song of Bernadette and he again directs Jennifer Jones in this film and Miss Jones is perfect in this role and gives a edgy, beautiful performance that captures the conflict in the character and Bill Holden who hit home run after home run in the l950's with a series of smash hit films beginning with Sunset Blvd, Stalag 17, Born Yesterday,Country Girl, Picnic, and of course River Kwai is superb in this role.Hard to imagine anyone but Holden in this movie I loved the ending and cry every time I see it. For anyone who has ever loved and lost, you will understand. For those who haven't, you won't.",
         "This movie will likely be too sentimental for many viewers, especially contemporary audiences. Nevertheless I enjoyed this film thanks mostly to the down-to-earth charm of William Holden, one of my favorite stars, and the dazzling beauty of Jennifer Jones. There are some truly heartwarming scenes between the pair and the talent of these two actors rescues what in lesser hands could've been trite lines. The cinematography of Hong Kong from the period of filming is another highlight of this movie. All in all, a better than average romantic drama, 7/10.",
         "Holden and Jones SIZZLE in this movie, but not in the way we think of sizzling today -- it's very subtle and under the surface -- yet palpable. Jennifer Jones, in particular, is SO SEXUALLY HOT in this film (much more than a caricature like Monroe EVER was) because she creates a real woman -- with ALL facets of womanhood: She's intelligent, intuitive, graceful. She's desiring AND desirable. There's a scene on that famous hill, where she's lying down in the grass, looking up at Holden, and the expression in her eyes is X-rated, yet in the context of the scene and character, in makes complete sense. You don't need to have it all said in the dialogue -- spelled-out like the crude obviousness in most modern films. It's all there in her eyes -- sexy yet elegant. What a stunning, under-rated actress she was. (I saw her MADAME BOVARY for the first time recently and was equally blown away.) I'll take her over Bergman, Davis, or the two Hepburns any day.",
         "Directed by a veteran Hollywood director Henry King who began his career still in 1915, Love is a Many Splendored Thing was one of his last great films. It was based on a bestseller by Han Suyin called simply A Many Splendored Thing the phrase that was borrowed by the author from the poem The Kingdom of God by Francis Thompson where that many splendored word `love' was used in quite a different and rather transcendental context meaning the love of God. Made in the \u009150s, the film marked along with works by such directors as Douglas Sirk and Vincente Minnelli a sort of renascence of melodrama, its florescence and reaching yet again a peak of popularity. The story begins when a handsome American reporter Mark Elliott played by William Holden yet once again typecast in one of his irresistible `playboy' roles comes to the Hong Kong and meets there a young and pretty Han Suyin (Jennifer Jones) of half-Chinese half-English origin who is working as a doctor at a hospital and whose husband was recently killed by the Chinese communists. Instantly Mark feels a rather strong attraction towards her but at the beginning his deep feelings are not quite reciprocated by Han's heart left cold after the death of her husband (`I believe in human heart now only as a doctor'). But very soon she yields to the persistent courting of tempting as hell Mark and both of them enter a passionate relationship apparently stoppable by nothing, even by the fact that Mark is unhappily married and his wife doesn't want to give him a divorce or social differences and prejudices caused by Han's Chinese origin. But still it's the fate that has a final word to say in determining the fairness of the eternalness of such a blissful loving relationship for no matter how enduring the two assume it to be the merciless time is waiting in a rather alarming form of death, prepared at any given moment to prove its impermanence. Undoubtedly one of the most romantic films ever made, Love is a Many Splendored Thing features fine performances from William Holden and Jennifer Jones, wonderful Academy Award winning musical score by Alfred Newman and extremely romantic, touching, heart-warming but ultimately heart-breaking story. Don't miss that many splendored film. 8/10",
         "I have just sat through this film again and can only wonder if we will see the likes of films like this anymore? The timeless music, the tender voices of William Holden and Jennifer Jones leave this grown man weeping through joyous, romantic scenes and I'm not one who cries very often in life. Where have our William Holden's gone and will they make these moving, wonderful, movies any more? It's sad to have to realize that they probably won't but don't think about it, just try to block that out of your mind. Even so, they won't have Holden in it and he won't appear on that hill just once more either. You can only enjoy this film and watch it again."
      ],
      "genres": [
         "Biography",
         "Drama",
         "Romance",
         "War"
      ],
      "productionCompanies": ["Twentieth Century Fox Film Corporation"],
      "summaries": [
         "Newsman Mark Elliott is an American war correspondent in Hong Kong, separated from his wife. During the closing days of the Chinese Civil War, he meets and pursues a beautiful Eurasian doctor, the widow of a Nationalist general. But when they begin to fall in love, their friends and her Chinese family pressure them to stop the cross-cultural relationship.",
         "A widowed doctor of both Chinese and European descent falls in love with a married American correspondent in Hong Kong during China's Communist revolution."
      ],
      "budget": 0
   },
   "movielensId": 3414,
   "movielens": {
      "languages": [
         "English",
         "普通话"
      ],
      "releaseDate": "1955-08-18",
      "dvdReleaseDate": "2000-03-07",
      "directors": ["Henry King"],
      "runtime": 102,
      "movieId": 3414,
      "title": "Love Is a Many-Splendored Thing",
      "mpaa": "",
      "actors": [
         "William Holden",
         "Jennifer Jones",
         "Torin Thatcher",
         "Isobel Elsom",
         "Murray Matheson",
         "Virginia Gregg",
         "Richard Loo",
         "Soo Yong",
         "Philip Ahn",
         "Jorja Curtright",
         "Donna Martell",
         "James Hong",
         "Keye Luke",
         "Marie Tsien"
      ],
      "imdbMovieId": "0048316",
      "originalTitle": "Love Is a Many-Splendored Thing",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["6ADVQo9Q020"],
      "plotSummary": "A widowed doctor of both Chinese and European descent falls in love with a married American correspondent in Hong Kong during China's Communist revolution.",
      "tmdbMovieId": 53879,
      "avgRating": 3.27043,
      "releaseYear": "1955",
      "numRatings": 257,
      "posterPath": "/a9aqlitzVeo5fq6UX5Ekl5kopco.jpg"
   }
}