{
   "tmdb": {
      "original_language": "ru",
      "keywords": [{
         "name": "memoirs",
         "id": 197170
      }],
      "imdb_id": "tt0072443",
      "video": false,
      "title": "Mirror",
      "recommendations": [
         895,
         31442,
         24657,
         1394,
         20108,
         1398,
         593,
         11506,
         1561,
         15244,
         690,
         797,
         5801,
         29455,
         11602,
         10238,
         8416,
         20530,
         27040,
         29845
      ],
      "backdrop_path": "/b9KF4K0zMCpemVgJuCL22nvGxFL.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Matka/Natalya",
               "gender": 1,
               "credit_id": "52fe42f3c3a36847f802f0d1",
               "name": "Margarita Terekhova",
               "profile_path": "/5IJjwsVPfHU5W1jp7rEsIIMt7Ym.jpg",
               "id": 55512,
               "order": 0
            },
            {
               "cast_id": 18,
               "character": "The Father",
               "gender": 2,
               "credit_id": "52fe42f3c3a36847f802f101",
               "name": "Oleg Yankovskiy",
               "profile_path": "/Yp2PjSJJ8x76CE3x4nXJumTppa.jpg",
               "id": 1090481,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Lisa",
               "gender": 1,
               "credit_id": "52fe42f3c3a36847f802f0d5",
               "name": "Alla Demidova",
               "profile_path": "/lHvrZsCeNFUiu21ZAAC0XJynuQX.jpg",
               "id": 55513,
               "order": 2
            },
            {
               "cast_id": 20,
               "character": "Direktor",
               "gender": 2,
               "credit_id": "52fe42f3c3a36847f802f105",
               "name": "Nikolay Grinko",
               "profile_path": "/aa90cr3ZfY65ZZaYynFKw8dUXFD.jpg",
               "id": 1190992,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Military trainer",
               "gender": 2,
               "credit_id": "52fe42f3c3a36847f802f0dd",
               "name": "Yuriy Nazarov",
               "profile_path": "/vbi6ibR4cI5wwGZ065bHHwYQens.jpg",
               "id": 13710,
               "order": 4
            },
            {
               "cast_id": 4,
               "character": "Nadezha",
               "gender": 0,
               "credit_id": "52fe42f3c3a36847f802f0cd",
               "name": "Larisa Tarkovskaya",
               "profile_path": null,
               "id": 8471,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Ignat, Alyosha",
               "gender": 0,
               "credit_id": "52fe42f3c3a36847f802f0d9",
               "name": "Ignat Daniltsev",
               "profile_path": null,
               "id": 55514,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Niania/Sąsiadka/Dziwna kobieta",
               "gender": 0,
               "credit_id": "52fe42f3c3a36847f802f0e5",
               "name": "Tamara Ogorodnikova",
               "profile_path": "/dpSKediIMxmz6L9rZzxthVDpgeK.jpg",
               "id": 8480,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Forensic doctor",
               "gender": 2,
               "credit_id": "532dbcc99251413a8100196c",
               "name": "Anatoliy Solonitsyn",
               "profile_path": "/mTz5gtiX2Y8B5TajEjQbnTTXlgP.jpg",
               "id": 8475,
               "order": 9
            },
            {
               "cast_id": 29,
               "character": "Proofreader",
               "gender": 1,
               "credit_id": "5a7fb79f0e0a262aa0017217",
               "name": "Татьяна Решетникова",
               "profile_path": "/hwUIBK42aHE0qSCTBeDYUpRsIJB.jpg",
               "id": 1836807,
               "order": 12
            },
            {
               "cast_id": 30,
               "character": "Mały Aleksei",
               "gender": 2,
               "credit_id": "5a7fb7c09251414107015280",
               "name": "Filipp Yankovsky",
               "profile_path": "/5f8oEkxmnoz4G3FiidBiV2Sax61.jpg",
               "id": 55516,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe42f3c3a36847f802f0bd",
               "name": "Andrei Tarkovsky",
               "profile_path": "/cEfzcvS6ZfSlpdn4SHsxZsVG0a3.jpg",
               "id": 8452,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe42f3c3a36847f802f0f1",
               "name": "Lyudmila Feiginova",
               "profile_path": null,
               "id": 8463,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe42f3c3a36847f802f0f7",
               "name": "Georgi Rerberg",
               "profile_path": "/mYz3e5E32fdZaxYL4MIdTHtM8tS.jpg",
               "id": 55518,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe42f3c3a36847f802f0fd",
               "name": "Erik Waisberg",
               "profile_path": null,
               "id": 55519,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "56d4f8e2c3a3681e360159a0",
               "name": "Eduard Artemev",
               "profile_path": null,
               "id": 1204438,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "53da4edb0e0a2652df0023bd",
               "name": "Aleksandr Misharin",
               "profile_path": null,
               "id": 55517,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "53da4ee50e0a2652e500239c",
               "name": "Andrei Tarkovsky",
               "profile_path": "/cEfzcvS6ZfSlpdn4SHsxZsVG0a3.jpg",
               "id": 8452,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "599a096cc3a3683948005cbd",
               "name": "Nelli Fomina",
               "profile_path": null,
               "id": 8467,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "599a097992514149cc005e3d",
               "name": "Semyon Litvinov",
               "profile_path": null,
               "id": 1632786,
               "department": "Sound",
               "job": "Sound Designer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "History",
            "id": 36
         }
      ],
      "popularity": 8.198306,
      "production_countries": [{
         "iso_3166_1": "RU",
         "name": "Russia"
      }],
      "id": 1396,
      "vote_count": 199,
      "budget": 0,
      "overview": "A dying man in his forties remembers his past. His childhood, his mother, the war, personal moments and things that tell of the recent history of all the Russian nation.",
      "similar": [
         343674,
         139516,
         363125
      ],
      "original_title": "Зеркало",
      "runtime": 106,
      "poster_path": "/37EBRMPRpF49t2gDvr2ybXkVKYa.jpg",
      "spoken_languages": [{
         "name": "Pусский",
         "iso_639_1": "ru"
      }],
      "production_companies": [{
         "logo_path": "/jmvVH9ULXPQ9MvBfeGc0sJj9xLt.png",
         "name": "Mosfilm",
         "id": 5120,
         "origin_country": ""
      }],
      "release_date": "1975-03-07",
      "vote_average": 7.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Soviet Union",
      "color": "Black and White",
      "budgetCurrency": "RUR ",
      "directors": ["Andrei Tarkovsky"],
      "runtime": 108,
      "synopsis": "This film does not have a storyline, but proceeds in a non-narrative, stream-of-consciousness form. To add to the confusion, several of the characters are played by the same actors. Margarita Terekhova plays the roles of Maria (the mother, also called \"Masha\" or \"Marousia\" in some of the pre-war scenes), and of Natalya (the wife of the protagonist as a young woman). Ignat Daniltsev is the protagonist at age 12 (Alyosha/Aleksei), as well as Aleksei's own son at age12 (Ignat). A précis to the film will certainly help the viewer through this labyrinth. The film takes place in three distinct time periods: Pre-war (1930s), War-time, and Post-war (1960s), and can be divided into fourteen sections, each of which takes place during one or more of these periods. In the following breakdown of sections, I will indicate the time period for the section and a brief description of the section's content. 1) Post-war. The film opens with Ignat turning on the television set. The program shown is that of a therapist treating an adolescent afflicted with stuttering. The credits follow. The Music: J. S. Bach, Das Orgelbüchlein No. 16, \"Das alte Jahr vergangen ist\" (The old year now hath pass'd away). 2) Pre-war. Edge of a field, Maria and a doctor who is passing by (Anatoly Solonitsyn) meet and converse. Voice-over of the narrator (Innokenti Smoktunovsky), who is obviously the protagonist Aleksei (he talks in the first person, plural, \"we\"). Arseni Tarkovsky's poem, read by the poet. Maria with the children, Alyosha and Marina, inside the dacha. Maria and children go outside to see the barn on fire. 3) Pre-war. Interior night shots. Maria is washing her hair with her husband's (Oleg Yankovsky) help. Maria young/Maria old [Maria Ivanovna Vishniakova (Tarkovskaya)] looking in the mirror (time ambiguous). 4) Post-war. Phone conversation between Aleksei and his mother, Maria. 5) Pre-war. The printing shop incident. (Maria thinks she has made a misprint, \"Shralin\"-- slang for \"excrement\" -- for \"Stalin\"). Lisa (Alla Demidova), Maria's friend, tells her she reminds her of Maria Timofeyevna (Captain Lebyadkin's sister in Dostoevsky's The Devils), which leads to recriminations on Lisa's part. 6) War-time. Natalya and husband quarrel. Ignat watches the Spanish tenants. Archive footage of the Spanish Civil War. Children being evacuated. A stratospheric balloon journey undertaken by a Kurdish aviator in 1937. Music: Pergolesi, Stabat Mater, No 12: \"Quando corpus morietur fac ut animae donetur paradisi glori.\" (While my body here decays, may my soul Thy goodness praise, safe in Paradise with Thee). Ticker tape parade. 7) Post-war. Ignat leafs through Leonardo da Vinci book. Natalya drops her purse. Ignat reads Pushkin's letter to Chaadayev (October 19, 1836) to two unknown women, one of whom appears to be modeled after the poet Anna Akhmatova (1898-1966). Ignat answers the door. Ignat and his father talk on the phone. 8)War-time. Aleksei looks at the redhead girl (Olga Kizilova). Music: Purcell, from The Indian Queen, Act IV, \"They tell us that your mighty powers.\" Instruction at the firing range where a rebellious Asafyev, a war orphan, keeps getting it wrong. War footage of soldiers unloading cargo. Coming from the firing range, Asafyev walks up a snowy hill. War footage of the crossing of Lake Sivash in Crimea. Poem by Arseni Tarkovsky, read by the poet. War footage of Russian tanks at the liberation of Prague, dead soldiers, artillery batteries, Bikini atomic test (1946). Asafyev stops at the top of the hill and a bird lands on his head, after which he takes it in his hand. Chinese crowd scene, the Soviet-Chinese conflict at Damansky Island, in 1969. 9) War-time. Maria with husband leaving for the war. Children playing outside and quarreling. The father with the children. Music: J.S.Bach: Matthew Passion, Recitative: \"Und siehe da! Der Vorhang im Tempel...\" (And see there! The veil of the temple...). Cut to a picture of a Maria look-alike, \"Genevra de Benci\" (c. 1470), by Leonardo da Vinci. 10) Post-war. Natalya and husband again quarrelling. 11) Pre-war. The dacha, Maria, the children on a mat, with Aleksei voice-over. Garden scene with the children. 12) Wartime/Postwar. Maria and Alyosha visit her neighbor, Nadezhda (Larisa Tarkovskaya), to sell her a pair of earrings. Levitation scene. Maria as an old woman with the children (dream). Poem by Arseni Tarkovsky, read by the poet. 13) Post-war. Aleksei (narrator) on his death bed (although we never see his head), attended by a doctor and the two women from the reading of Pushkin's letter scene (Section 7). Aleksei reaches for and holds a bird in his hand. 14) Pre-war. Maria and husband. Music fades in, opening number of J.S.Bach's St John Passion: Herr, unser Herrscher, dessen Ruhm in allen Landen herrlich ist! (Lord, our Sovereign, whose glory in every land is magnificent!). Maria old, with young Alyosha and his sister, and Maria young, briefly in the background (dream).",
      "writers": [
         "Aleksandr Misharin",
         "Andrei Tarkovsky"
      ],
      "originalLanguage": "Russian",
      "imdbLink": "http://www.imdb.com/title/tt0072443/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg1MDg3OTk3M15BMl5BanBnXkFtZTgwMDEzMzE5MTE@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Margarita Terekhova, Filipp Yankovskiy, Ignat Daniltsev | See full cast and crew »"],
      "reviews": [
         "I just finished watching it. It's been several years since I saw it last time. I worried that I may not like it as much as I used to... I should not have worried - I love it even more now if that is at all possible. I've seen it at different times of my life - first, as a college student many years ago in Moscow; I keep returning to it all my life. When Tarkovsky's Zerkalo (The Mirror) was first released, it divided the audience completely. I remember how my friends were passionately discussing it. One girl was complaining that she did not understand anything; the movie was confusing for her, dark, disturbing, the children characters - sad, pale, poorly dressed. I remember her asking, \"Why did they show a boy in the opening scene that had an awful stutter, and they never showed that boy again? What did it mean when the dying man in bed was setting a bird free? How did he get the bird on the first place?\" Another friend of mine, a guy, tried to explain the things to her. He suggested that she thought about the times Zerkalo was showing, he tried to explain to her Tarkovsky's symbolism where the bird could be representing life and soul of the main character and the boy with the stutter could mean that it was most difficult for people to communicate and understand each other. I only listened to their argument and did not participate because I had not seen the film yet. When it finally happened, Andrei Arsenievich Tarkovsky was presented at the screening and he talked to the audience before the show. I remember him repeating over and over that there were no tricks, no puzzles, and no tongue-in-cheeks in the film; that every symbol, image, dialog, and sound was there because they belonged there. He asked us if we had questions. Someone from the audience suggested that we saw the film first, and then, asked questions. Tarkovsky replied that from his experience, not many viewers would sit through the film and who ever would, usually leave in silence, not asking anything. And then he told us a story. After Zerkalo was completed, it was first shown to the group of the famous critics. After watching it, critics started to argue about it, trying to find the hidden meaning and make sense of what they just saw. It went on and on until the cleaning lady who came to the screening room and had been waiting for the end of discussion to do her job, asked them for how long they would stay? Someone said to her that they were discussing a very complicated film, and they needed time to understand it. Cleaning lady asked, \"What is that you do not understand in this film? I saw it also, and I understood everything.\" Critics were silenced for a moment, and then, one of them asked the woman to share her thoughts on Zerkalo. She answered, \"It is about a man who had caused too much pain to the ones whom he loved and who loved him. Now he is dying and he is trying to ask them for forgiveness but he does not know how.\" After the pause Tarkovsky said that he had nothing else to add about his film to what the cleaning lady had to say. I never understood complains that Zerkalo is a very confusing, difficult, and dark film. No, it is clear and deep as a mirror. Tarkovsky said so himself, and I believe him. Every time you look at the mirror, it will show you new depth and reflections. Past, presence, future, memory, love, guilt, forgiveness, beauty, sadness, nostalgia, and sacrifice - the mirror reflects it all -just watch closely. This is the film about his family, his country, and his times. Childhood memory and the memory of the past generations glued together. The film is a look back in time and sad realization that children reflect destiny of fathers, as in a mirror. Destinies reflected one in another. Zerkalo is not just good cinema, it is pure cinema. Like architecture is music in stone, Zerkalo is poetry on screen. My verdict \u0096 The Best Film ever made, the top of my list (tie with Andrei Rublyov).",
         "We are talking visual poetry here. For almost the entire film, every square inch of screen is minutely painted. Ordinary criticism doesn't apply, there is no comparison between this and any other film. So many scenes have you holding your breath in awe. The smallest movement of light is choreographed precisely. A shadow across someone's face, the wind in the trees - these are not simply images of those things, but the ungraspable nature of life, regret, beauty, memory. So much more lies beneath the surface, as we are shown a reflection in a mirror that momentarily purports to be reality, but need not necessarily be interpreted as such. The film's magic derives from Tarkovsky's surefooted ability to succeed with a succession of intense, beautiful images. He cannot put a foot wrong. Discontinuity in the narrative give the appearance of complexity, but Tarkovksy would insist that the basic thrust of the narrative is simple. The film is immensely personal, and the disconnections only serve to involve the viewer more \u0096 we are allowed to fill in the gaps ourselves. To appreciate all this you need an essential sympathy for nostalgia and memories, for the passing of life, and for regret. You need an appreciation of a silent room and what it previously held, and of nature. You will need a sense of living in a turbulent and dangerous world, where all beauty is transient and sad. You will need to understand how small moments in life can become the most precious. The film is tragic because, like memories, it lingers. It shows us details beneath the surface and how they can affect us. It shows life in the context of death, nature, the times and places we have passed through. The camera ponders and paints all this in beautiful detail. Of course, real life is never so rich nor so intense - only momentarily so. The film wants to distil as much of that precious beauty as possible in a number of disjointed moments, coloured through memory and imagination, from childhood through to the point of death. Apply it to your own life. There is no more than this.",
         "To many Mirror is possibly Tarkovsky's most inhibitive and uninviting work, be as it may not a story in the traditional sense but rather an assemblage of images, scenes, and thoughts which at first sight seem to have very little in common and just drift back and forth with no obvious literal explanation. It's only after repeated viewings and the realisation of what it actually was that Tarkovsky tried to achieve that it dawns that this is more than just a bunch of random scenes, but a timeless and highly important masterpiece which defies explanation. But I'll try anyway. I personally hold Tarkovsky in very high esteem. There are many directors I would regard as good or very good (for instance Kubrick, Kieslowski, Ozu, or Miyazaki), but there are only two directors I regard as absolute geniuses: Akira Kurosawa and, yep, Andrei Tarkovsky. Interestingly this is for two solely different reasons - whereas I admire Kurosawa for the manner in which he managed to perfect the art of cinematic storytelling, Tarkovsky deserves praise for wanting to shake cinema out of its complacent acceptance that films should simply tell a story and little else. Mirror is further proof that Tarkovsky's body of work (which is limited in quantity - a mere eight films - but rich in scope) establishes that the Hollywood mode of narrative is not the only way in which film can create an emotional response from an audience. Of course Tarkovsky is not alone in having done so (Marker and Greenaway immediately spring to mind), but what distinguishes him from other \"art house\" directors is that he has managed to take this style of film making and drive it to a stage that can be described as almost perfect. I personally interpret Mirror as a man's life flashing before his eyes before he dies; his relationship with his wife and mother (both played by the same person, in an ingenious move on Tarkovsky's behalf), his children, his friends, the history of his home land, his own childhood. However, Mirror is deliberately structured in such a way that it can, and will, be interpreted differently by different people depending on how they inscribe their own personal thoughts and feelings into the narrative. This is where Tarkovsky's genius comes to fore - to create a film which does not dictate to an audience how to feel by manipulating them via music or mise-en-scene, but to make it the other way around. In the case of Mirror, we, the audience, dictate the emotional response created by the images on screen and, that, ultimately is that makes it such a wonderful work and a true rarity. This is possibly another way the title of the film can be interpreted, in that it illustrates a wholly reflective style of cinema. Those not accustomed to a slightly more disjunctive cinematic style are likely to dismiss Mirror as boring or dull because it may not necessarily correspond to their expectations of film. However, it is still something I would regard as required viewing for everyone since it shows that cinema can be beautiful without necessarily following the rules Hollywood has imposed on the rest of the film making community, and that ultimately rules are there to be broken. A masterpiece, no less.",
         "It's not easy to make such judgments, but this is my favorite film. A personal choice, for sure, but what MIRROR achieves is the height of poetry and literature. Its final moment, if it works for you (and I can imagine it wouldn't for all), is a success of the \"method of indirection\" sought by poetry. Its effect is cumulative and devastating. People often stress the difficulty of this film, but my only answer is to allow it to wash over you and allow it to have its effect. The first time I saw it, I was amazed, but a little baffled. The second time I cried. Each time since then I've teared up, if not actually wept. Its presentation, in its last shots, of the totality of the human experience, combined with the Bach's St John Passion, crushes me every time. And I'm not even Russian. Nor am I religious--this is the closest I get to religion. You just have to be human to understand MIRROR. This is the way of all Tarkovsky.",
         "Ignoring other prominent thematic fields like family or marital problems and Russian or Soviet history (from Pushkin via Stalin to the current fear of a Chinese threat), two topics can be extracted from the movie which Tarkovsky seems to be very concerned about: 1.The confrontation of Man and Nature as two opposing powers, and 2.The continuum of time (the equation of present, future and past). The importance of topic 2 can be made clear by just considering the film's structure: The different time levels are intertwined in an often deliberately confusing way so that it actually becomes difficult to identify them. The fact that the same actors are used to portray different characters of different time levels (Maria=Alexei's mother and Natalya=Alexei's wife; Alexei as a child and Ignat=Alexei's son) underlines the idea of deliberateness in addition. But the interconnection of times is also made visible by the recurrent theme of the so called 'déjà-vu-phenomenon': A character perceives a new situation or action as if it has already occurred before. In fact, he or she gets a notion of the predetermination of everything that happens in his or her life - a horrid thought, because then you can't change anything and have to accept willingly whatever an obscure determinating force has planned for you. Let's concentrate on the last sequences in which the significance and the combination of these themes become obvious. First there is the scene where Alexei, who lives in separation from Natalya, lies in agony, overcome by an unknown disease. He just has the energy to make a last statement for posterity (\"I simply wanted to be happy!\"), then he retires from the world, asking to be left in peace. But while he is on the brink of death, he still succeeds in wondrously stirring up life. He takes into his hand a moribund bird, which is lying on his bedside table, squeezes it, and then lets it go so that it can fly up into freedom. Is it the same bird that breaks through a window glass in another scene, or that places itself on the head of that orphan boy whose parents have perished in the Leningrad blockade, as if he wanted to protect him? The birds of \"Zerkalo\" seem to take up a symbolic function similar to the dogs in other Tarkovsky movies (i.e.: \"Nostalghia\", \"Solyaris\"): They represent some kind of link between Man and Nature; they are frontier guards at the gates of the unknown. Tarkovsky sees Man and Nature as two opposing, incompatible powers. This becomes evident again and again, for instance when a vigorous wind repeatedly runs through grass and trees or when drumming rain drenches the landscape. Here Man can only watch in amazement, being unable to set something of equal value against the inscrutable elemental forces. In the closing sequence Man appears at first as if he was embedded in the womb of Nature. Maria, the future mother of Alexei, is lying dreamily in the grass when she is asked by her husband whether she prefers a boy or a girl. But instead of answering his question she is gazing into the distance, and suddenly she sees herself as grandmother, walking across woods and meadows having little Alexei (Ignat?) and his sister by the hand. Then a juvenile Maria appears again, and tears are running along her cheek, but she is smiling at the same time. It seems as if the knowledge of the unstoppable progression of human existence into a single direction (towards old age and death) makes her sad and happy at the same time. She feels grief because of the inevitable loss of youth, but she also rejoices in happy relaxation for she has made out the rules of life as such and has accepted them. At the end the camera follows the way of the grandmother and her grandchildren for quite a while. But again and again trees interfere and obstruct the view on the humans like gloomy barricades. Until finally both ways separate irredeemably: The humans have disappeared somewhere in the distance whereas the camera shot pans into the dark impenetrability of the forest.",
         "If you have experienced Mirror, and by experience I mean much more than just having watched it (the experience may take multiple viewings to achieve) then you will realise the futility of describing or reviewing this film much in the same way as the inadequacy of a second hand account of a mystical experience. Tarkovsky was a mystic: although his religious beliefs are well known there is much less acknowledgement of his conception of God. For Tarkovsky God was everywhere and in everything, his (its) presence is felt in the rustling of leaves in the breeze, the burning of wood, the rain falling (and falling, and falling) on damp fields. Humans exist as a sea of melancholy within the infinite beauty and wonder of nature. Mirror is the closest art has ever been to portraying the mystical experience of one spiritually sensitive individual. The second hand experience can never be as profound as that from your own being. But an odd and sad experience comes from watching Mirror, the belief that your own interpretation of the world will never be so deeply poetic or deep as Tarkovsky's, and the world you see on the cinema screen seems more vivid and alive than real life ever will.",
         "Spoilers herein. Many films allow one immediate response; you know while watching how effective it is and at the end are geared for talking or writing about what you have just seen. Others, you need to spend time with. This -- I am guessing here -- is because the truly great so lead our imagination that we need to heal or grow after the experience and only then assess what has happened. Surely when you are in this film, you know something special is going on: there are some true transcendences of the eye; very dimensional, surprising. Just as you have established the field of vision and registered the one thing you expect to see, the camera moves in an unexpected manner to reveal either a completely extra or contradictory reality. Those moments thrill, but confuse at the same time because in lesser hands, this would be an excuse for noodling about with the 'story' in a superficially artsy-fartsy manner. Only after some time can you evaluate how effectively this might have slipped between the sheets of your minds. It is a matter of some interest to me how this happens when it does. Is it a matter of the artist knowing us better than we do ourselves and slipping into our dreams unawares? Or is a matter of creating an attractive castle that we are drawn to and inhabit? Generally, when an artist is called 'personal,' it is thought to be the latter. But in this case, I think most of what he has done is find that universal manner of overlapping and merging that underlies the visual memory of us all. What confuses is the Soviet environment: the intensely uncoordinated industrial environment and the once fine but now dilapidated urban residences. They transport us to a different place: the unfamiliar described in a familiar way. Surely this is not what he intended: he didn't make this for a comfortable American/European. And if not made just for himself it was for people who shared the same world. So at least as far as the content, we are attracted to an unfamiliar castle. But so far as the 'personal' form, I think he has found something strangely cosmic. This may be the best film (with Rublev) of one of the three most important filmmakers in history. Ted's Evaluation -- 4 of 4: Every visually literate person should experience this.",
         "I found this film quite difficult to get into since I'm more used to conventional plot driven narratives, a concept that was anathema to Tarkovsky. Certainly the Soviet authorities did their best to limit the venues where this film could be seen, condemning it's personal nature as decadent, self-indulgent and against the formal traditions of Soviet cinema, a cinema which Tarkovsky himself did not have a good word for. Russians who did see it sent many letters to the director saying how much it affected them and mirrored their own childhood experiences. Tarkovsky himself had difficulty in 'finding' his film during production, and originally worried that it would not work. Many critics questioned whether the images were symbolic in some way, but Tarkovsky dismissed symbolism as decadent. He sited Japanese writers of the middle ages rejecting such things. He had no time for surrealism either, pointing out that Dali himself had rejected the concept as facile. And yet the pull of dreams are un-mistakable in this work. Tarkovsky stated that the artist himself does not necessarily know the meaning of an image but is compelled to express his vision. Despite some of the problems in viewing this film there are plenty of moving and mysterious moments, not least the wistful and melancholic look on the face of the mother as she lays in the grass, contemplating her children's future.",
         "Has there ever been a more visually beautiful film than this one? That's a rhetorical question... one that only viewing it can answer. To try to follow it as an ordinary narrative is to lose its poetic ambience...I let it wash over me like glorious music. We are so accustomed to \"and then...and then\" that our minds can follow as logic, that we tend to dismiss the affect that the visual image itself can have on our minds, hearts and souls. Tarkovsky is a poet...and for me this is his richest, most satisfying film of all. Included are film clips from WW 2, the Spanish Civil War, poetry by the director's father. It does help to know that the same actress (Margarita Terekhova) plays the dying man's wife and his mother...as he allows his memory to shift over his life. The only other director I can think of who understands the visual language of film and its significance as beautifully as Tarkovsky is Terence Malick. Zerkalo is haunting and uplifting even as we know the \"hero\" is dying. Death, after all, is an intrinsic part of life.",
         "\"Zerkalo\" is probably my favorite of Tarkovsky's movies-whic says a lot about the quality of the film. I believe that the Russian word \"zerkalo\"-mirror, is one of the most accurate descriptions of Tarkovsky's credo. The theme of the \"home\" and \"family\" exists in this movie stronger than in any of the other Tarkovsky's films. In \"Ivanovo detstvo\", Ivan is ruined the moment his family is killed. In \"Andrey Rublev\" the temple is the house. In \"Solaris\" Kris is guilt-ridenn on account of him being the cause of his wife's death, and in the end, like a prodigal son, he kneels in front of his father. The same guilt lays on the Stalker in the movie of the same name. In \"Nostalghia\" Gorchakov is dying of home-sickness, he constantly dreams of his home in Russia, and after death is rewarded by being taken to the home, placed inside a decreipt Italian temple in one of the most unforgettable shots in cinema's history. Finally, in \"Offret\", the hero becomes a sort of father for the whole world. But in \"Zerkalo\" family and home are presented as a foundation of human existence. Some scenes in this movie are among the most beautiful in cinema. Simply put, this film is something anyone who thinks and feels must see..."
      ],
      "genres": [
         "Biography",
         "Drama"
      ],
      "productionCompanies": ["Mosfilm"],
      "summaries": [
         "Tarkovsky mixes flash-backs, historical footage and original poetry to illustrate the reminiscences of a dying man about his childhood during World War II, adolescence, and a painful divorce in his family. The story interweaves reflections about Russian history and society.",
         "A dying man in his forties remembers his past. His childhood, his mother, the war, personal moments and things that tell of the recent history of all the Russian nation."
      ],
      "budget": 622000
   },
   "movielensId": 3415,
   "movielens": {
      "languages": ["Pусский"],
      "releaseDate": "1975-03-07",
      "dvdReleaseDate": "2000-03-07",
      "directors": ["Andrei Tarkovsky"],
      "runtime": 106,
      "movieId": 3415,
      "title": "Mirror",
      "mpaa": "",
      "actors": [
         "Margarita Terekhova",
         "Oleg Yankovskiy",
         "Alla Demidova",
         "Nikolay Grinko",
         "Yuriy Nazarov",
         "Larisa Tarkovskaya",
         "Ignat Daniltsev",
         "Tamara Ogorodnikova",
         "Anatoliy Solonitsyn",
         "Татьяна Решетникова",
         "Filipp Yankovsky"
      ],
      "imdbMovieId": "0072443",
      "originalTitle": "Зеркало",
      "genres": [
         "Drama",
         "History"
      ],
      "youtubeTrailerIds": [
         "uXYfRkuA3cM",
         "tpaA5PG2rkY"
      ],
      "plotSummary": "A dying man in his forties remembers his past. His childhood, his mother, the war, personal moments and things that tell of the recent history of all the Russian nation.",
      "tmdbMovieId": 1396,
      "avgRating": 4.02354,
      "releaseYear": "1975",
      "numRatings": 786,
      "posterPath": "/37EBRMPRpF49t2gDvr2ybXkVKYa.jpg"
   }
}