{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "spain",
            "id": 514
         },
         {
            "name": "protection",
            "id": 4556
         },
         {
            "name": "pirate",
            "id": 12988
         }
      ],
      "imdb_id": "tt0044517",
      "video": false,
      "title": "The Crimson Pirate",
      "recommendations": [
         32563,
         26851,
         41609,
         10146,
         61087,
         13798,
         49636,
         117897,
         368432,
         43000,
         116314,
         449065,
         97318,
         198518,
         38027,
         26201,
         116696,
         269749,
         79359,
         132994
      ],
      "backdrop_path": "/d3xWRmilxirr1kf55gcJusNpaKe.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Capt. Vallo (The Crimson Pirate)",
               "gender": 2,
               "credit_id": "52fe445d9251416c7503230d",
               "name": "Burt Lancaster",
               "profile_path": "/bpAkekuIvKhh9L9Rean3fBznSy5.jpg",
               "id": 13784,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Ojo",
               "gender": 2,
               "credit_id": "52fe445d9251416c75032311",
               "name": "Nick Cravat",
               "profile_path": "/xZ1QfYvzOgZhiEqWryIxT0daQoi.jpg",
               "id": 69934,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Consuelo",
               "gender": 1,
               "credit_id": "52fe445d9251416c75032315",
               "name": "Eva Bartok",
               "profile_path": "/1xFhlKC4ROjXMQba7LBBAYvES2T.jpg",
               "id": 69935,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Humble Bellows",
               "gender": 2,
               "credit_id": "52fe445d9251416c75032319",
               "name": "Torin Thatcher",
               "profile_path": "/vO8Dw33jVxVU3gR1FWbgomrEmRB.jpg",
               "id": 10925,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Prof. Prudence",
               "gender": 2,
               "credit_id": "52fe445d9251416c75032347",
               "name": "James Hayter",
               "profile_path": "/b3aczw5adgqvNv6uC4NHYWGDCGL.jpg",
               "id": 30769,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Baron Jose Gruda",
               "gender": 2,
               "credit_id": "52fe445d9251416c7503234b",
               "name": "Leslie Bradley",
               "profile_path": "/wc9VysI4TcGNwSQ8D6sJ0fVFbeE.jpg",
               "id": 102746,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Bianca",
               "gender": 1,
               "credit_id": "52fe445e9251416c7503234f",
               "name": "Margot Grahame",
               "profile_path": "/xllWb7C8x7HEyCkadCcOJ67Frj1.jpg",
               "id": 136151,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Pablo Murphy",
               "gender": 2,
               "credit_id": "52fe445e9251416c75032353",
               "name": "Noel Purcell",
               "profile_path": null,
               "id": 33090,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Sebastian",
               "gender": 2,
               "credit_id": "52fe445e9251416c75032357",
               "name": "Frederick Leister",
               "profile_path": null,
               "id": 127024,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Governor",
               "gender": 2,
               "credit_id": "52fe445e9251416c7503235b",
               "name": "Eliot Makeham",
               "profile_path": null,
               "id": 127020,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Colonel",
               "gender": 2,
               "credit_id": "52fe445e9251416c7503235f",
               "name": "Frank Pettingell",
               "profile_path": null,
               "id": 106626,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "La Signorita",
               "gender": 1,
               "credit_id": "52fe445e9251416c75032363",
               "name": "Dana Wynter",
               "profile_path": "/qih3QKH1nJ29vXsO7CQOOHY4vGx.jpg",
               "id": 69810,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "Joseph (attache)",
               "gender": 2,
               "credit_id": "52fe445e9251416c75032367",
               "name": "Christopher Lee",
               "profile_path": "/aVzp6zflzedmdKPLxaPqcZ05PDK.jpg",
               "id": 113,
               "order": 12
            },
            {
               "cast_id": 21,
               "character": "Claw Paw",
               "gender": 2,
               "credit_id": "52fe445e9251416c7503236b",
               "name": "Ewan Roberts",
               "profile_path": "/rwhOzwiWkeiJVciQVgOlNhIvIP9.jpg",
               "id": 93165,
               "order": 13
            },
            {
               "cast_id": 22,
               "character": "Stub Ear",
               "gender": 0,
               "credit_id": "52fe445e9251416c7503236f",
               "name": "John Chandos",
               "profile_path": "/lyZGTEUnCtLBDY5JI22ppeQcou2.jpg",
               "id": 119359,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe445d9251416c7503231f",
               "name": "Robert Siodmak",
               "profile_path": "/i43x7MCzzNGeSbLO6LvAOJWFeXN.jpg",
               "id": 5029,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe445d9251416c75032325",
               "name": "Roland Kibbee",
               "profile_path": null,
               "id": 69936,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe445d9251416c7503232b",
               "name": "Harold Hecht",
               "profile_path": "/jjqEnjTfsHLP8zlhdcdWTzYcCRf.jpg",
               "id": 13780,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe445d9251416c75032331",
               "name": "Burt Lancaster",
               "profile_path": "/bpAkekuIvKhh9L9Rean3fBznSy5.jpg",
               "id": 13784,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe445d9251416c75032337",
               "name": "William Alwyn",
               "profile_path": null,
               "id": 39054,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe445d9251416c7503233d",
               "name": "Otto Heller",
               "profile_path": null,
               "id": 29893,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe445d9251416c75032343",
               "name": "Jack Harris",
               "profile_path": null,
               "id": 12721,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "56df924bc3a368748e002226",
               "name": "Norman Deming",
               "profile_path": null,
               "id": 8235,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "56df92639251412ee2002228",
               "name": "Russell Shearman",
               "profile_path": null,
               "id": 1588033,
               "department": "Crew",
               "job": "Special Effects"
            },
            {
               "gender": 0,
               "credit_id": "56df9271c3a368748200205e",
               "name": "Gladys Atkinson",
               "profile_path": null,
               "id": 1565506,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "56df927c9251412ee700223f",
               "name": "Tony Sforzini",
               "profile_path": null,
               "id": 30939,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "5a5aa6a20e0a267fd70150c9",
               "name": "Maisie Kelly",
               "profile_path": null,
               "id": 1959433,
               "department": "Directing",
               "job": "Continuity"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 6.859965,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11570,
      "vote_count": 36,
      "budget": 1850000,
      "overview": "Burt Lancaster plays a pirate with a taste for intrigue and acrobatics who involves himself in the goings on of a revolution in the Caribbean in the late 1700s. A light hearted adventure involving prison breaks, an oddball Scientist, sailing ships, naval fights, and tons of swordplay.",
      "similar": [
         22,
         58,
         285,
         166426,
         1865,
         10693,
         9016,
         9340,
         2493,
         7461,
         109424,
         72197,
         9472,
         121856,
         71805,
         266647,
         9313,
         955,
         2270,
         364689
      ],
      "original_title": "The Crimson Pirate",
      "runtime": 105,
      "poster_path": "/lOSqs9ntb2wB7gveCx2l7cqC1nG.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Hecht-Lancaster Productions",
         "id": 30724,
         "origin_country": ""
      }],
      "release_date": "1952-09-27",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "MAN OF NINE LIVES AND 1000 SURPRISES!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Robert Siodmak"],
      "runtime": 105,
      "synopsis": null,
      "writers": ["Roland Kibbee"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0044517/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA1ODEyOTkyNF5BMl5BanBnXkFtZTYwMzI2OTk5._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Burt Lancaster, Nick Cravat, Eva Bartok | See full cast and crew »"],
      "reviews": [
         "It's doubtful whether any pirate ever looked like Lancaster, rigged out in a succession of exaggeratedly modish outfits and bleached-blond hair... He is the 18th-century pirate swashbuckler to end all swashbucklers! With his mute, but athletic side-kick friend Nick Cravat, Lancaster leads an island's people in rebellion against the tyrant Baron Gruda... His damsel is Eva Bartok, the freewheeling European beauty... I don't know how many times I have seen this buccaneer saga, and still I love it... The film provides lots of thrills and laughs, lots of adventures and excitement ... Great fun all the time... Lancaster's sense of comedy was evident enough for critic Alton Cook to call him \"one of our most amiable and strenuous comedians.\" For me, Lancaster will be always remembered as the actor who has given the modern cinema more \"pure enjoyment\" than almost any other major star...",
         "In the late 18th century Caribbean a group of pirates led by Capt.Vallo become embroiled in the revolutionary activities of some islanders against the King. That's about all the plot that you need to know, for this film doesn't concern itself with historical accuracy or the like. What it does is to place it's tongue firmly in it's cheek and take the audience on a thrilling romp in the best swashbuckling style. Burt Lancaster plays Vallo with real gusto and exuberance, ideally suited to the all action role. He did all his own stunts, being paired on screen with his one time trapeze partner Nick Cravat as his mute sidekick. In these days of CGI overkill it's refreshing to see smartly choreographed action set pieces with real people performing breathtaking feats of agility. The support cast is filled with familiar faces from the period all giving good value in their respective roles. The whole enterprise is lavishly mounted and shot in glorious vivid Technicolor. This was possibly one of the last of this type before Cinemascope and widescreen in general became the norm. As mentioned previously, accuracy isn't an issue here. In the finale we encounter prototypes of Gatlin guns, tanks and flamethrowers among other things! I hadn't seen this since childhood, so I took the opportunity of catching it on the BBC at the weekend. With 'Pirates Of The Caribbean' still relatively fresh in my mind, it seemed appropriate to revisit this old classic. I'm happy to say that it's lost none of its appeal, quite the opposite in fact. Rollicking good fun - recommended.",
         "Movies do not come any more swashbuckling than this one. Hey, we have pirates, the Caribbean, villains, heroes, damsels in distress, sword fights, sea battles, inventions, acrobatics aplenty. And all delivered with Burt's legendary smile. It is not a genre spoof, but it does not take itself seriously either. Watching this film one can perhaps understand why some people took a while to accept Burt Lancaster as a real actor. Not that his acting in this film is bad, but the excellent acrobatic skills we come to admire betray a different background. Enormous fun.",
         "This is probably one of the best films I have ever seen. It had a perfect mix of adventure and comedy due to the fact that it pokes fun at all the pirate cliches. Also, it really gave the legendary Burt Lancaster a chance to show of his acrobatic talents. Too bad they don't show this on television anymore. This film would probably appeal not only to older fans but to children as well.",
         "'The Crimson Pirate' is pure joy. Maybe the most entertaining movie of the 50's - as far as 'pure entertainment' concept goes, and one of the greatests adventure movies ever made. Burt Lancaster was then at the apex of his powers, and shows very clearly what a good piece of Errol Flynn he could easily have been, and this was not an easy task at all, mind you. Bowing his personal idol Douglas Fairbanks, the dashing, wide-grin, elastic, self-assured Lancaster has marked a whole generation of youngsters - and adults as well - with this wonderful, colorful, funny, action-packed, greatly-soundtracked adventure-spoof, quite probably one of his bests movies ever, although even him surely never realized how good it was. Popcorn at hand, I watched this masterpiece goggle-eyed, then, and do it very, very fondly now. Burt Lancaster was the man who thought me to love movies. My sincere thanks to him.",
         "It's impossible to recapture the absolute bliss of seeing this film for the first time, in all its impudence and style; but watching it yet again this afternoon, I found a broad grin back on my face within minutes. Burt Lancaster's cocky Captain Vallo -- golden-haired, silver-tongued, and sporting a fine taste in trademark crimson trousers -- is a Technicolour pirate straight out of the pages of legend, and it's a toss-up as to whether it's more fun watching him dazzle and bamboozle his way through the ranks of the dastardly Spaniards, every sea-rover's traditional foe, or seeing him taken down a richly-deserved peg or two when events don't go quite as anticipated. If Vallo had it all his own way, he'd be insufferable; but fortunately for the film, circumstances -- and the script -- conspire to unseat his schemes, with results both hilarious and touching. Lancaster and Nick Cravat play off their old acrobatic routines against each other, separately and together, in a virtuoso display perfectly integrated into the action of the film. In \"The Flame and the Arrow\", the acrobatics felt shoe-horned in to show off the star's abilities. Here they develop naturally from the conventions of the genre, and the grace of the big man and pugnacity of the little one make for a gifted double-act. In the role of the loyal mute Ojo (as the leader of their rebel captors observes dryly, 'this one can't talk and the other can't stop talking!') Cravat repeats his eloquent, quickfire mime from the earlier production, providing the last 'word' for the film's ending and comic moments throughout. The character of the first mate 'Humble' Bellows, with his Quakerish speech and rigid adherence to the old ways, is also a triumph. Implacably opposed to his captain's flashy plans for a double- and triple-cross on the grounds that it's more like business practice than honest piracy, and unmoved by Vallo's gift of the gab, his doom-saying has the unpalatable habit of seeming to come true as one complication after another arises. Yet he has a stubborn integrity of his own, and his loyalty is to the ship's company where Vallo's veers like a weathercock. He is a complex character we cannot in a way help but admire. But above all, the essence of \"The Crimson Pirate\" is that it's *very*, *very* *silly*. Gloriously silly. This isn't about realism -- this is comic-strip stuff, where battle consists of tossing your enemies overboard into the water, laying them out cold with a belaying-pin, or stacking them up one by one on the floor of the captain's cabin; where a man with a sword can duel a man with a swinging block on the end of a piece of rope, and an athletic fugitive can escape down narrow streets by using awnings as trampolines and washing-poles as parallel bars. Like \"Galaxy Quest\", this film is both an affectionate spoof of its genre and a gripping contribution to that genre in its own right. This is Adventure with a capital 'A', with a colourful unrepentant rogue of a hero, with devious Dons, thickwitted soldiery, heroic rebels, treachery, cruelty and gallantry against the odds - and generally an unexpected laugh around every corner. It's utterly impossible, of course, but -- believe only half of what you see... if that!",
         "Once you suspend disbelief you can have a glorious time at this movie. The Technicolor looks fabulous on DVD, Burt Lancaster is an Adonis if ever there were, and there's silly fun to spare all around, from the striped tights to the giddy pitched battles and doofus redcoats to the springy Cravat. You can easily see Spielberg and George Lucas learning their pacing and craft from this director, as well as outlandish stunts and fantastical conceits. You can't help but get caught up in it. Not only that, those two kisses shared by Burt 'n Eva are HOT. Yumm. For contrast, view Lancaster in Sweet Smell Of Success. Utter control.",
         "When I was 16 my Grandpa came to town early and it was just me and him. He looked at the TV Guide and started laughing. He looked at me and said one of his favorite movies was coming on. From the moment it began I was captivated. The opening sequence sets up the rest of the film. It is a very tongue in cheek movie that keeps you laughing and enjoying every minute of it. Lancaster and Cravat are one of the great film team-ups, comes from their days in vaudeville together. The film is just a good time. I was already a horror film fan at that time and was surprised to see a young Christopher Lee in it too. My grandpa was larger than life as this film is too. Everyone who has sat and watched this film with me laughs as much as I do.",
         "\"The Crimson Pirate\" is pure happiness, for kids and adults. Everything contributes to the mirth of the audience: the bright colors of the beautiful, careful photography, the frenetic, pyrotechnic action, the outstanding acrobatic performances by Burt Lancaster and Nick Cravat, the humour of the dialogues and also (why not?) the loveliness and charm of Eva Bartok and of the other supporting actresses. A common question asked by parents seeing this movie with their children: What character did you like best? The unanimous answer by the kids will be: Ojo! In fact, Ojo (Nick Cravat) can deservedly compete for the title of the nicest character in movie history. And the great actor-legend Burt Lancaster (captain Vallo) is just perfect in his smiling auto-irony. By the way, when I happen to see again the video of \"The Crimson Pirate\" (my daughters know it nearly by heart), I am always stunned by how beautifully this movie is made. Certainly it is a major work, somewhat hidden behind its extreme fun. A final remark: the director of this masterpiece of comic and adventure is Robert Siodmak, a former great specialist of dark thrillers and noirs (\"The Spiral Staircase\" \"The Killers\"). This gives an idea of how deeply talented the old Hollywood masters were.",
         "Big production values, bold, bright colors, great use of music, high energy acting. Add me to the list of people who have watched this fun movie a zillion times. The Crimson Pirate ages not. This 1952 movie taking place in time over 200 years ago will remain appreciated for years to come."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Comedy"
      ],
      "productionCompanies": ["Hecht-Lancaster Productions"],
      "summaries": [
         "Burt Lancaster plays a pirate with a taste for intrigue and acrobatics who involves himself in the goings on of a revolution in the Caribbean in the late 1700s. A light hearted adventure involving prison breaks, an oddball Scientist, sailing ships, naval fights, and tons of swordplay.",
         "After taking control on a British war ship Captain Vallo, the Crimson Pirate, sees a money-making opportunity. Aboard the British ship is Baron Jose Gruda who has been sent to the Caribbean to stop an independence movement led by someone named El Libre. Vallo's plan is to sell the ships store of guns and powder to El Libre and then double his money by telling Gruda who and where the rebel is to be found. Things don't go quite as planned after Vallo meets the beautiful Consuelo, who just happens to be El Libre's daughter. Vallo has a change of heart and fights with the rebels."
      ],
      "budget": 1850000
   },
   "movielensId": 3417,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1952-09-27",
      "dvdReleaseDate": "2003-07-01",
      "directors": ["Robert Siodmak"],
      "runtime": 105,
      "movieId": 3417,
      "title": "The Crimson Pirate",
      "mpaa": "",
      "actors": [
         "Burt Lancaster",
         "Nick Cravat",
         "Eva Bartok",
         "Torin Thatcher",
         "James Hayter",
         "Leslie Bradley",
         "Margot Grahame",
         "Noel Purcell",
         "Frederick Leister",
         "Eliot Makeham",
         "Frank Pettingell",
         "Dana Wynter",
         "Christopher Lee",
         "Ewan Roberts",
         "John Chandos"
      ],
      "imdbMovieId": "0044517",
      "originalTitle": "The Crimson Pirate",
      "genres": [
         "Action",
         "Adventure",
         "Comedy"
      ],
      "youtubeTrailerIds": ["HIfTeDVHvfQ"],
      "plotSummary": "Burt Lancaster plays a pirate with a taste for intrigue and acrobatics who involves himself in the goings on of a revolution in the Caribbean in the late 1700s. A light hearted adventure involving prison breaks, an oddball Scientist, sailing ships, naval fights, and tons of swordplay.",
      "tmdbMovieId": 11570,
      "avgRating": 3.60957,
      "releaseYear": "1952",
      "numRatings": 397,
      "posterPath": "/lOSqs9ntb2wB7gveCx2l7cqC1nG.jpg"
   }
}