{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0066392",
      "video": false,
      "title": "Something For Everyone",
      "recommendations": [
         163392,
         78355,
         211078,
         190967,
         108614,
         255554,
         288710,
         43116,
         31293,
         39554
      ],
      "backdrop_path": "/4pTFBO5utMgtv7JvQbc3QnLR6UD.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Konrad Ludwig",
               "gender": 2,
               "credit_id": "52fe4ad69251416c910c778b",
               "name": "Michael York",
               "profile_path": "/hW0uWJtsKWsWAQ9k7EYq9sn5YCH.jpg",
               "id": 13919,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Countess Herthe von Ornstein",
               "gender": 1,
               "credit_id": "52fe4ad69251416c910c7787",
               "name": "Angela Lansbury",
               "profile_path": "/nMy8sPPLf8fjSglFLP3IzIGbjly.jpg",
               "id": 14730,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Helmuth von Ornstein",
               "gender": 2,
               "credit_id": "5928fa9c9251413ba003f850",
               "name": "Anthony Higgins",
               "profile_path": "/1cjZmBBVlUCZlLqX4Jn1EOdVulw.jpg",
               "id": 660,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Lotte Von Ornstein",
               "gender": 0,
               "credit_id": "52fe4ad69251416c910c7797",
               "name": "Jane Carr",
               "profile_path": "/wJYMNnFi20oTfk2zfznZ0797A3c.jpg",
               "id": 42000,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Anneliese Pleschke",
               "gender": 0,
               "credit_id": "52fe4ad69251416c910c7793",
               "name": "Heidelinde Weis",
               "profile_path": "/uGaEA1b1pnrrMzRhZ6g3gbVEsBv.jpg",
               "id": 1061877,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Klaus",
               "gender": 2,
               "credit_id": "5928f9779251413b4a0438b0",
               "name": "Wolfried Lier",
               "profile_path": null,
               "id": 46513,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Bobby",
               "gender": 0,
               "credit_id": "5928f98ec3a368780a03e851",
               "name": "Despo Diamantidou",
               "profile_path": null,
               "id": 932751,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4ad69251416c910c7777",
               "name": "Harold Prince",
               "profile_path": null,
               "id": 1072042,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4ad69251416c910c777d",
               "name": "Harry Kressing",
               "profile_path": null,
               "id": 1129772,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe4ad69251416c910c7783",
               "name": "Hugh Wheeler",
               "profile_path": null,
               "id": 136149,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [],
      "popularity": 0.640415,
      "production_countries": [],
      "id": 150043,
      "vote_count": 6,
      "budget": 0,
      "overview": "An opportunistic young man working as a servant to a European countess uses his sexual talents to better his station in life.",
      "similar": [],
      "original_title": "Something For Everyone",
      "runtime": 112,
      "poster_path": "/qJwBSnDLtcIETEAwx1rrop3SIm1.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1970-07-22",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Harold Prince"],
      "runtime": 112,
      "synopsis": null,
      "writers": [
         "Harry Kressing",
         "Hugh Wheeler"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0066392/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIxNDg5MzIxMl5BMl5BanBnXkFtZTcwNjgxMjkxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Angela Lansbury, Michael York, Anthony Higgins | See full cast and crew »"],
      "reviews": [
         "Angela Lansbury as a decadent noblewoman, glaring out into her shaky future is nothing short of sensational. One of the most entertaining performances ever put on film. She has to overcome two massive obstacles, wooden Michael York as a co-star and Broadway legend Harold Prince as her \"film\" director. She succeeds and overcomes both problems with the help of a scrumptious script and a personal zest that it's pure Lansbury. She has been, consistently, one of the most startling actresses to come out of Hollywood, she is, often, the only redeeming quality of some indifferent movies. Unfortunately, the enormous success of \"Murder She Wrote\" has overshadowed her powerful impact as an actress. To introduce her to a younger audience that knows her only as Jessica Fletcher is always a thrill. From \"Gaslight\" right up to \"Nanny McPhee\" As a piece of trivia...Did you know she was offered the part of Nurse Ratchet in \"One Flew Over The Cuckoo's Nest\"?",
         "Once upon a time there was a young, handsome, fair-haired commoner who dreamed of being a young, handsome, fair-haired prince. In fact, while the Britisher is bicycling through Austria, he sees the very castle described in the fairy tale picture book his mother gave him when he was young, and that he now carries with him at all times. Encouraged by this vision of splendour, the young drifter sets out to fulfill his life's dream. Doesn't this sound like a lovely, whimsical, touchingly optimistic tale about believing in one's destiny and having the courage to seek it out? Normally, yes. But in the hands of director Hal Prince, this darkly comic tale takes another direction altogether. Michael York plays the clever, enigmatic young opportunist who is willing to seduce, charm, outmaneuver, even murder whoever he has to in order to become \"king of the castle.\" The afore-mentioned domain is inhabited by none other than the Countess Von Ornstein (the wonderfully eccentric Angela Lansbury) and her brood. The widow has fallen on hard times since the death of her husband and realizes she must marry into money once again to return to her former glory. But with a homosexual son and chubby, homely young teenage daughter left to carry on the family dynasty, prospects look truly abysmal. To say any more would be a dastardly move on my part. Suffice it to say that the sharp, highly astute performances alone make this seldom-seen little gem worthwhile. There are enough twists and turns to keep things compelling from start to finish. Director Prince takes full advantage as well of the breathtaking Bavarian landscape. York, as Konrad, has seldom had a meatier role as he first becomes a footman to the castle, then proceeds to eliminate all the other human elements that interfer with his rise to the social top. Lansbury steals every scene she is in, while given a number of deliciously wry monologues to remind viewers that the Jessica Fletcher character she played in \"Murder She Wrote\" was a popular move but a real step down. Jane Carr, who the year before gave a touching, timorous performance as the ill-fated student in \"The Prime of Miss Jean Brodie,\" does a 100% turnaround here as the dry, sardonic \"plain Jane\" daughter who is wise to York's game from the very start. And Anthony Higgins as the smitten gay son and Heidelinde Weis as an amorous young heiress are quite effective as two of Konrad's romantic pawns. \"Something for Everyone\" definitely HAS something for everyone. A real find in my book.",
         "The wit and glinting malice of this film, combined with stellar performances by Michael York, Angela Lansbury and the completely delectable Jane Carr, keep it as fresh as the day it was released. I've watched it over a dozen times in my life, always with renewed enjoyment. Delicious!",
         "I haven't seen this movie in a long time. I've seen it more than once, so I must have rented the VHS when it was available. I did see it when it was originally released theatrically. If you weren't that lucky, let me tell you, when Angela Lansbury appeared on screen about to board a train in her white satin traveling suit and matching (stewardess-style) cap, there was a collective gasp from the audience--admittedly mostly gay men. You'd never seen anything like it EVER. And you never saw anything like it again until Dynasty in the 80s. Furthermore, Jane Carr utters one of the best lines in all of cinema history: \"There's nothing like a bit of pre-breakfast chocolate cake.\" The movie is pitch perfect, and I'd say required viewing for gay people, even though that theme is a small part of the movie. Hunt it down and see it! And pray for Criterion to get the rights!",
         "This is one of only two movies directed by multi-Tony winning Broadway (and opera) director Hal Prince and redeems him for the ghastly film adaptation of his brilliant stage work on Stephen Sondheim's A LITTLE NIGHT MUSIC. Angela Lansbury is beautiful and brilliant as a penniless countess who is desperate to save her beloved Schloss - played in part (the Schloss, that is) by one of Mad Ludwig's castles whose construction costs bankrupted Bavaria. Other reviewers have commented on the Machiavellian plot, with Michael York charming and subversive as the upwardly mobile manservant. Black humor with clever dialogue, beautiful sets and costumes and fine performances all around. For some reason, in its theatrical release, it was NOT, in fact, \"for everyone\", but this movie is long overdue for release on DVD and deserves to be seen by a wider audience.",
         "Hal Prince's Something For Everyone is perhaps one of the most looked over American classics of the 70's. The blackest of comedies the title might, if taken literally, be misleading since it is, obviously NOT for everyone. Prince's theatrical touch can be felt and lends a strong hand in the telling of the tale and keeping tight reigns on what could easily have become an out-of-control experience (i.e., \"Happy Birthday, Gemini\"), a taut, thrillingly wry comedy \u0096 one of the best of its type. Combining the fantasy of fairy tale with the social repression and economic dire straits of a Post-II World II Bavaria the film provides a vastly entertaining (and darkly hilarious) look into subject matters verboten at the time of the tale including the Nazi issue, social pariahism, class distinction and sexual appetite. The dichotomy between classes has never been more closely paralleled in film: on one hand there is the starving, eager and willing to do anything young Konrad (Michael York) and on the other the Countess von Ornstein \u0096 she of by gone nobility. Countess or now, she too is starving, clinging to a past which has not only faded, but threatens at any minute to disintegrate. Her prospects poor she does what she must. Lansbury's Countess is priceless and she plays it with an unlikely combination of superego and hopeless despair \u0096 and she is brilliant. A tour-de-force. If released today \u0096 the film would be at the top of every best 10 list and be talked about salaciously at every Starbucks. With nazis hiding in the woodwork, sexual weaponry, misplaced romantic feelings, murder, social climbing combining with delicious Bavarian countryside, castles, beer gardens, stunning mountain vistas and even Wagnerian opera, Prince gives us a fairy tale gone wrong. Wondrously, terribly and gloriously wrong. p.",
         "This movie tickled me to the bone. I can laugh decades later just thinking about Angela Lansbury greedily but daintily scarfing down strawberries. Michael York is infinitely sexy and sinister at the same time. Just the memory of his performance gives me goosebumps. Everyone in the cast is such a juicy distinctive being and such fun to watch. It seems funny ranking this movie up there with Citizen Kane as one of the greatest movies of all time, but in terms of sheer enjoyment, for me, it ties with Cabaret (another Michael York movie) as #1.",
         "Charming, machiavellian drifter manipulates widowed aristocrat and her family to gain control of the estate. Exemplary characters and script, and striking scenery for atmosphere. Viewers may also enjoy \"A New Leaf\" (1971).(Rating: A)",
         "\"Something for Everyone\"'s plot has already been described. So, I'll REVIEW it instead. Angela Lansbury wonderfully typlifies the aristocracy that existed at the end of WW II..and someplaces, even today...at least in some people's minds. York's character, Konrad, is both charming and convincingly conniving doing whatever he has to do to achieve his goal. \"Can you sleep with anyone?\" , Helmut asks. \"If I have to\" Konrad answers. Angela has two specific speeches that leave you breathless...making the dialog pure prose, or if you will, Arias. Her struting, expressions and attitude make the basic point of the film more obvious and comedic. York is as smilingly disarming as the rouge as Matt Damon was in \"Ripley --\". Anthony Higgons as Helmut was convincing too. But something must have ended up on the editing floor that would have helped his participation. Hal Prince's talent direction is wonderful, but either the camera direction or editing is somewhat ordinary at times. Music theme is by John Kandor (Kandor-Webb who created \"New York, New York\" and \"Cabaret\")is fun, memorable and perfect for the film's style time and content. However, I wished Hal Prince had him underscore the film....at times the film is slow and needs some mood music. \"Something for Everyone\" is an overseen classic - storywise and performance wise. I had the chance to express my opinion to Angela and she smiled wonderfully at me. York too told me he loved the character and the story and like me, wished the film got more notice.",
         "I remember this film from the 70s...it was one of my favourites. Finally got hold of a copy from the USA. Unfortunately the scene between Conrad and the son was cut out, but otherwise it was still brilliant. Angela Lansbury was superb. Seemed a role made for her. Anuntie Mame gone upmarket and euro. If you can find a copy to rent, do it. A ten from me."
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Drama"
      ],
      "productionCompanies": ["Cinema Center Films"],
      "summaries": ["Konrad, a handsome country boy in post-war Austria, charms his way into a butler position at the castle of a widowed countess that lost her fortune. Before long the opportunistic boy is running the entire household. As he starts affairs with both the countess's son and the daughter of a whealthy businessman, the idea grows to get his two lovers to marry each other and make the house rich again."],
      "budget": 0
   },
   "movielensId": 3419,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1970-07-22",
      "dvdReleaseDate": null,
      "directors": ["Harold Prince"],
      "runtime": 112,
      "movieId": 3419,
      "title": "Something For Everyone",
      "mpaa": "",
      "actors": [
         "Michael York",
         "Angela Lansbury",
         "Anthony Higgins",
         "Jane Carr",
         "Heidelinde Weis",
         "Wolfried Lier",
         "Despo Diamantidou"
      ],
      "imdbMovieId": "0066392",
      "originalTitle": "Something For Everyone",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "An opportunistic young man working as a servant to a European countess uses his sexual talents to better his station in life.",
      "tmdbMovieId": 150043,
      "avgRating": 3.50926,
      "releaseYear": "1970",
      "numRatings": 54,
      "posterPath": "/qJwBSnDLtcIETEAwx1rrop3SIm1.jpg"
   }
}