{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "suspense",
            "id": 9937
         },
         {
            "name": "lawyer",
            "id": 10909
         },
         {
            "name": "courtroom",
            "id": 33519
         },
         {
            "name": "extramarital affair",
            "id": 34094
         }
      ],
      "imdb_id": "tt0078718",
      "video": false,
      "title": "...And Justice for All",
      "recommendations": [
         31587,
         22094,
         10433,
         5916,
         18129,
         10410,
         10551,
         9967,
         10427,
         10896,
         21887,
         27554,
         29973,
         12235,
         10935,
         20306,
         10671,
         9040,
         821,
         31121
      ],
      "backdrop_path": "/j3FcOV6Ss3DYS8S170R2O6dHB3J.jpg",
      "revenue": 33300000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Arthur Kirkland",
               "gender": 2,
               "credit_id": "52fe47259251416c7508f4d3",
               "name": "Al Pacino",
               "profile_path": "/f9tBVwcNHnawvMoyuuzmKvEhBsb.jpg",
               "id": 1158,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Judge Francis Rayford",
               "gender": 2,
               "credit_id": "52fe47269251416c7508f4d7",
               "name": "Jack Warden",
               "profile_path": "/pD98exbwlD4f9QmQd0N8Sa7j6pw.jpg",
               "id": 5251,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Judge Henry T. Fleming",
               "gender": 2,
               "credit_id": "52fe47269251416c7508f4db",
               "name": "John Forsythe",
               "profile_path": "/fgtEcuM7CyFN79IN9hXpwkAzCGs.jpg",
               "id": 24367,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Gail Packer",
               "gender": 1,
               "credit_id": "52fe47269251416c7508f4df",
               "name": "Christine Lahti",
               "profile_path": "/oi8w5nVX1yBiP02uR9qGzD41yxL.jpg",
               "id": 77133,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Grandpa Sam",
               "gender": 2,
               "credit_id": "52fe47269251416c7508f50d",
               "name": "Lee Strasberg",
               "profile_path": "/ygEiIBPmoDfv4T8f4jL3EDn4cm3.jpg",
               "id": 3171,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Jay Porter",
               "gender": 2,
               "credit_id": "52fe47269251416c7508f511",
               "name": "Jeffrey Tambor",
               "profile_path": "/csB350am07xyRL5Ik1BWuSY12tH.jpg",
               "id": 4175,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Arnie",
               "gender": 2,
               "credit_id": "52fe47269251416c7508f515",
               "name": "Sam Levene",
               "profile_path": "/z2QtVul6HSSvX9bJKUEPhltMQdA.jpg",
               "id": 14574,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Ralph Agee",
               "gender": 2,
               "credit_id": "52fe47269251416c7508f519",
               "name": "Robert Christian",
               "profile_path": null,
               "id": 107978,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Jeff McCullaugh",
               "gender": 0,
               "credit_id": "52fe47269251416c7508f51d",
               "name": "Thomas G. Waites",
               "profile_path": "/siYdrSBj0ubxuCZm66lotNulg6M.jpg",
               "id": 15419,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Warren Fresnell",
               "gender": 2,
               "credit_id": "52fe47269251416c7508f521",
               "name": "Larry Bryggman",
               "profile_path": "/fc7XC4C0DayJ6g8ReydAWjwY3IX.jpg",
               "id": 17351,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Frank Bowers",
               "gender": 2,
               "credit_id": "52fe47269251416c7508f525",
               "name": "Craig T. Nelson",
               "profile_path": "/mhKSd2uLhNX7TahlNhwJgDYMRwN.jpg",
               "id": 8977,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Carl Travers",
               "gender": 2,
               "credit_id": "52fe47269251416c7508f529",
               "name": "Dominic Chianese",
               "profile_path": "/szL093yLdzjRvqVWQfu0KPfitDQ.jpg",
               "id": 68186,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "Leo Fauci",
               "gender": 2,
               "credit_id": "52fe47269251416c7508f52d",
               "name": "Victor Arnold",
               "profile_path": "/tr3HJuPI69xsJiSCV0gske7jNnY.jpg",
               "id": 6565,
               "order": 12
            },
            {
               "cast_id": 21,
               "character": "Officer Leary",
               "gender": 2,
               "credit_id": "52fe47269251416c7508f531",
               "name": "Vincent Beck",
               "profile_path": null,
               "id": 109214,
               "order": 13
            },
            {
               "cast_id": 22,
               "character": "Elderly Man",
               "gender": 0,
               "credit_id": "52fe47269251416c7508f535",
               "name": "Michael Gorrin",
               "profile_path": null,
               "id": 557998,
               "order": 14
            },
            {
               "cast_id": 23,
               "character": "Larry",
               "gender": 2,
               "credit_id": "52fe47269251416c7508f539",
               "name": "Baxter Harris",
               "profile_path": null,
               "id": 170921,
               "order": 15
            },
            {
               "cast_id": 24,
               "character": "Prison Doctor",
               "gender": 2,
               "credit_id": "52fe47269251416c7508f53d",
               "name": "Joe Morton",
               "profile_path": "/5adJxjbFX2GeuTTCNqc9dg4Twgx.jpg",
               "id": 3977,
               "order": 16
            },
            {
               "cast_id": 25,
               "character": "Deputy Sheriff",
               "gender": 2,
               "credit_id": "52fe47269251416c7508f541",
               "name": "Alan North",
               "profile_path": "/q79hT4OeYOYzH2WIfqS6VsCmKzg.jpg",
               "id": 53584,
               "order": 17
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47269251416c7508f4e5",
               "name": "Norman Jewison",
               "profile_path": "/umNoz1FsJtvoWKlCsgNOqWlfrgh.jpg",
               "id": 13563,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe47269251416c7508f4eb",
               "name": "Valerie Curtin",
               "profile_path": "/uhdcq0IAtxSKXcZdh3A1myXmHK2.jpg",
               "id": 70172,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47269251416c7508f4f1",
               "name": "Barry Levinson",
               "profile_path": "/AvPOBBODhSCtUJAqxeq2s0nYnTw.jpg",
               "id": 8246,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47269251416c7508f4f7",
               "name": "Norman Jewison",
               "profile_path": "/umNoz1FsJtvoWKlCsgNOqWlfrgh.jpg",
               "id": 13563,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47269251416c7508f4fd",
               "name": "Dave Grusin",
               "profile_path": "/h6EgxJIsRpObohHdvlUGEAu6EqK.jpg",
               "id": 10771,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47269251416c7508f503",
               "name": "Victor J. Kemper",
               "profile_path": null,
               "id": 14536,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe47269251416c7508f509",
               "name": "John F. Burnett",
               "profile_path": null,
               "id": 8881,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe47269251416c7508f547",
               "name": "Patrick J. Palmer",
               "profile_path": null,
               "id": 10829,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47269251416c7508f54d",
               "name": "Joe Wizan",
               "profile_path": null,
               "id": 21024,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 7.758614,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 17443,
      "vote_count": 143,
      "budget": 0,
      "overview": "An ethical Baltimore defense lawyer disgusted with rampant legal corruption is asked to defend a judge he despises in a rape trial. But if he doesn't do it, the judge will have him disbarred.",
      "similar": [
         1645,
         37257,
         93,
         11560,
         11975,
         336843,
         9623,
         389,
         21484,
         521,
         9800,
         10998,
         949,
         1586,
         1592,
         9798,
         189,
         819,
         595,
         314365
      ],
      "original_title": "...And Justice for All",
      "runtime": 119,
      "poster_path": "/xiMZwW8GJiJteLZttRwxVi7oFet.jpg",
      "spoken_languages": [
         {
            "name": "Český",
            "iso_639_1": "cs"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [{
         "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
         "name": "Columbia Pictures",
         "id": 5,
         "origin_country": "US"
      }],
      "release_date": "1979-10-19",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Norman Jewison"],
      "runtime": 119,
      "synopsis": "This first appeared on www.realmoviereview.com This has become a courtroom movie classic. Today, the cheesy soundtrack music, the old-fashioned effects, the characters casual sexuality and the rage-against-the-man mindset seem dated, but the strong acting, which included one of Al Pacinos many Oscar nominations, combined with a screenplay that is alternately touching, funny and adversarial is still compelling. Al Pacino is Arthur Kirkland, a sharp defence lawyer with a heart, who is dealing with a witch-hunting ethics tribunal, crazy and arrogant judges, an ill grandfather, a law partner (Tambor) on the verge of a nervous breakdown, and a new relationship. He definitely did not need the crazy new case that lands on his lap in the form of his least favourite judge, Henry T. Fleming. Soon, Arthur is faced with some decisions that will challenge his beliefs and affect his future. This classic is dated but still well worth seeing for Pacino fans and those who enjoy the Hollywood legal system. The performances and story are excellent and the ending is remembered as vividly today as when people first saw in 1979.",
      "writers": [
         "Valerie Curtin",
         "Barry Levinson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0078718/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNjE2OTgxMDU1N15BMl5BanBnXkFtZTcwOTg2ODAyMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Al Pacino, Jack Warden, John Forsythe | See full cast and crew »"],
      "reviews": [
         "I remember this movie from when I was a kid. I remembered it fondly, and always pictured Pacino giving the big \"This whole courtroom's out of order!!\" speech. I just rented it again after not seeing it for about twenty years, and WOW! There's a lot more to remember than that one speech. I absolutely loved this movie! I always like Pacino, but sometimes he just plays a similar character over and over. In this one, young Pacino got to play everything from scared to sad to funny to furious... and I thought he did great. I haven't felt for a character so much in quite a while. The relationship between Pacino and his \"leading lady\" was a good one, especially for the '70's. I thought those two characters were interesting together. The music sucked, but every movie soundtrack at that time sounded like a porno flick, didn't it? It's a story where one bad thing after another happens in a short period of time, in very unrealistic (we all hope!) fashion - but that's a whole movie genre in itself (although I don't know what you'd call it), to make us think of lots of different things and to push the main character over the edge. Without all the subplots, I don't think the ending would have made as much sense. I'd like a copy for my video library, and I don't say that often.",
         "I liked And Justice for All. I found it very entertaining and absorbing. In its satiric way, the movie is full of rich characters and plausible situations even if sometimes you can spot the cliché around the corner. Sometimes satire works as a magnifying glass to expose and better criticize something. And I believe that's what happens in this movie with all those bizarre scenes and deranged characters. Even though Jewison focuses problems such as corruption, criticizes the danger of powerful people in the wrong places and brings up moral dilemmas about the practice of law, I believe And Justice for All is more of a satire than a serious alert to a possible decadence of the judicial system. The odd elements in the plot are one too many to see the movie strictly from its dramatic point of view: a cross-dresser client, an evidence-eating defendant, a suicidal judge, a hysterical lawyer. In a certain way, the message of this movie reminded me the one of Mike Nichols anti-war comedy Catch-22: in order to cope with a crazy situation you have to become a little crazy. In a war scenario people fight for values like justice and order, but they also fight for power and interests; the same thing happens inside a courtroom. Some lawyers see Law as a business, some see it as a way to promote their personal careers and some see it as the opportunity given to those who have nothing else to lose. The performances are just great, specially the ones of Jack Warden and Jeffrey Tambor. Al Pacino unquestionably steals the movie with another over-the-top performance as the lawyer willing to risk everything and delivers another memorable speech during his `opening statement'.",
         "Arthur Kirkland is a young lawyer who realizes early on in his career that whatever he learned in school is different in real life. When we first meet Arthur he seems eager to help his clients. He soon realizes the legal system, as it's practiced in the court room, depends on who is judging the case, as there appears to be jaded judges who are blind to the justice he is seeking for his clients. This 1979, directed by Norman Jewison, and based on a screen play by Barry Levinson and Valerie Curtin, offers another look at the way our legal system works. The young Arthur clearly gets his fill of what is wrong with the system early on as he sees an innocent man go to jail for something he didn't do. That same man, plays a pivoting role in the story when he becomes so frustrated that he can't take it anymore. The same goes for the black cross dresser, who puts his trust in Arthur, only to feel betrayed when Arthur sends a colleague to defend him, but obviously, that lawyer couldn't care less what happens to the poor man. The film is engrossing because of the work of a young, and eager, Al Pacino, who as Arthur Kirkland, is basically, the whole movie. Mr. Pacino, under Mr. Jewison's guidance did a wonderful job in getting under Arthur Kirkland's skin. This was one of the best performances this talented actor gave early in his career. The rest of the cast shows some actors that went on to bigger and better things. Craig T. Nelson, Christine Lahti, Jeffrey Tambor, Domnenic Chianese,and Larry Briggman, made good contributions to the success of the film. Some veteran pros like Jack Warden, John Forsythe, Lee Strassberg, Sam Levene, are also showcased in the film. \"And Justice for All\" is a satisfactory film worth a look because of Norman Jewison and Al Pacino.",
         "In this movie Al Pacino once again proves my point that he (Al Pacino) is one of the greatest actors off all time. By 1979 he had already pretty much proven this but never the less this is one of his best films yet. Even without Al Pacino this movie would be great.(Not near as great but never the less)I mean it is also very well directed and the screen play alone is magnificently written. So if you are a Pacino fan, or even if your not a Pacino fan i am telling you, that to die without seeing this movie is a sin.",
         "C'mon, people. Are you really having trouble determining whether this is a comedy or not? From beginning to end, it's filled with hysterical and whimsical (if sometimes troubling) situations, wickedly funny bits of dialogue, and sight gags. There are way too many to mention here, but the highlights would include the trial of the foul-mouthed gentleman, the helicopter ride, the defendant eating the lottery tickets, Arthur and Gail's Chinese dinner, the ethics committee hearing, Carl and the prostitute and, of course, the \"opening statement\" in the courtroom. An important subplot runs through all this -- Arthur trying to hold his sanity and legal practice together, while sparking up his love live -- along with some of the tragedy he witnesses. He is, after all, a budget-priced criminal defense lawyer in a large Eastern city, so I wouldn't expect everything to be pretty and tidy, even in a comedy. Contrary to some of the comments below, this movie is highly pedigreed. Thought the script was weak? Barry Levinson co-wrote it. And what's all this bellyaching about the music? This movie was released during the disco craze and the score was performed by a jailhouse ensemble. What did you expect the music to sound like, Tangerine Dream? Porter Wagoner? Beethoven? It was written by Dave Grusin, who has been nominated for seven Oscars (he won in 1988 for \"The Milagro Beanfield War\") and also has collected seven Grammys over the years. Of course, it was directed by Norman Jewison, who has shown good, if occasional, aptitude for comedy (\"The Russians Are Coming, the Russians Are Coming,\" \"Moonstruck,\" \"Other People's Money\"). Also, if you look at Pacino's performance with a critical eye, you may decide it was one of the best of his career -- especially compared with some of the more contrived (if popular) portrayals subsequent to this movie (\"Scarface,\" \"Scent of a Woman\"). Try to remember the context in which a movie was released while watching with that critical eye and it's generally apparent if it stands the test of time. I'd say this one does -- beautifully.",
         "\"...And Justice For All\" is one of those well-intentioned movies that doesn't achieve the goal it was set out to accomplish. Having said this, the film is a good example of the way some lawyers truly do care about their clients and not intent on making a lot of money. I now know why Al Pacino is considered one of the greatest film stars in Hollywood. With roles in \"The Godfather,\" \"Scent Of A Woman,\" \"Heat,\" \"Devil's Advocate\" and \"The Insider,\" Pacino has proven he is an actor with integrity and presence. The best thing about \"...And Justice For All\" was the true and genuine care that Pacino's character had for his clients. The only thing I would change about this movie would be to narrow the story lines because it had a few too many to follow. With the number of subplots in this film, it was too difficult to pinpoint the main plot and enjoy the film outright. Overall, this movie was good and I recommend it.",
         "Superb performances of all players without exception, but of course special mention has to go to Pacino who gives one of the best performances of his career. If you are interested in joining the legal profession (as I was), this is a must-see. Pacino is an over-worked, successful defence lawyer, juggling his heavy caseload. When a judge, whom he is publicly known to hate, is charged with Rape, Pacino is asked to defend him. Although this is the premise for the film, it is so beautifully entwined with many different, rich characters and a multitude of cases, it's almost unfair to even pinpoint the main thread. A perfect blend of tragedy, comedy and drama, I would rank this film in my all-time top 10.",
         "This was a very good movie. Al Pacino was fantastic. The courtroom scenes were intense and emotionally charged, I loved it! Al Pacino was an excellent lawyer. This movie was so good because it showed him in the work place and how it effected him in his personal life. A very good movie, it's one of my favorites. The best scene was the climax when he exploded in the courtroom and and screamed one of the most famous quotes in cinema history! 9/10",
         "\"...And Justice For All\" is one of those well-intentioned movies that doesn't achieve the goal it was set out to accomplish. Having said this, the film is a good example of the way some lawyers truly do care about their clients and not intent on making a lot of money. I now know why Al Pacino is considered one of the greatest film stars in Hollywood. With roles in \"The Godfather,\" \"Scent Of A Woman,\" \"Heat,\" \"Devil's Advocate\" and \"The Insider,\" Pacino has proven he is an actor with integrity and presence. The best thing about \"...And Justice For All\" was the true and genuine care that Pacino's character had for his clients. The only thing I would change about this movie would be to narrow the storylines because it had a few too many to follow. With the number of subplots in this film, it was too difficult to pinpoint the main plot and enjoy the film outright. Overall, this movie was good and I recommend it.",
         "This movie stands out among the hundreds I've seen; It is exactly what it was initially marketed as; an inditement of the late 70's (and I suspect little has changed) legal system. This is accomplished magnificently.. Imagine an over-worked court appointed defender with a heart of gold.. in a corrupt web of compromise, and over-stressed beauro-crats. If you have ever enjoyed a court/lawyer movie give this one a chance!!! Look out for one of the funniest and yet reasonably plausible situations I've ever seen in a movie."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": ["Columbia Pictures Corporation"],
      "summaries": [
         "When a judge is charged with rape, Arthur Kirkland is forced to defend him. Kirkland has had problems with the judge in the past, including one incident when the judge wrongly sentenced his client Jeff McCullaugh because of a technicality. Kirkland faces a moral and legal dilemma.",
         "Arthur Kirkland, an idealistic defense attorney in Baltimore, cares about his clients and visits his aging grandfather, who put him through law school, every week. Things aren't going well for Arthur: two of his clients are increasingly desperate, neither should be in prison, his partner is behaving bizarrely, he's begun an affair with an attorney who's on the bar's disciplinary committee, his favorite judge may have a death wish, and then, the judge he dislikes most, a by-the-book martinet, demands that Arthur defend him when he's accused of a brutal assault on a young woman. Is there any way to expose real corruption and find justice for all?",
         "An ethical Baltimore defense lawyer disgusted with rampant legal corruption is asked to defend a judge he despises in a rape trial. But if he doesn't do it, the judge will have him disbarred."
      ],
      "budget": 0
   },
   "movielensId": 3420,
   "movielens": {
      "languages": [
         "Český",
         "English"
      ],
      "releaseDate": "1979-10-19",
      "dvdReleaseDate": "2001-01-16",
      "directors": ["Norman Jewison"],
      "runtime": 119,
      "movieId": 3420,
      "title": "...And Justice for All",
      "mpaa": "R",
      "actors": [
         "Al Pacino",
         "Jack Warden",
         "John Forsythe",
         "Christine Lahti",
         "Lee Strasberg",
         "Jeffrey Tambor",
         "Sam Levene",
         "Robert Christian",
         "Thomas G. Waites",
         "Larry Bryggman",
         "Craig T. Nelson",
         "Dominic Chianese",
         "Victor Arnold",
         "Vincent Beck",
         "Michael Gorrin",
         "Baxter Harris",
         "Joe Morton",
         "Alan North"
      ],
      "imdbMovieId": "0078718",
      "originalTitle": "...And Justice for All",
      "genres": [
         "Crime",
         "Drama",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": ["sQzYNoLANrg"],
      "plotSummary": "An ethical Baltimore defense lawyer disgusted with rampant legal corruption is asked to defend a judge he despises in a rape trial. But if he doesn't do it, the judge will have him disbarred.",
      "tmdbMovieId": 17443,
      "avgRating": 3.63166,
      "releaseYear": "1979",
      "numRatings": 1276,
      "posterPath": "/xiMZwW8GJiJteLZttRwxVi7oFet.jpg"
   }
}