{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "lesbian",
            "id": 10768
         }
      ],
      "imdb_id": "tt0091939",
      "video": false,
      "title": "She's Gotta Have It",
      "recommendations": [
         51371,
         107131,
         94259,
         41791,
         42368,
         10146,
         46976,
         49471,
         47866,
         41480,
         56143,
         129303,
         51303,
         148168,
         177335,
         84582,
         36818,
         126764,
         214952,
         50117
      ],
      "backdrop_path": "/eTuWCEyXFysR9jcGzat9piy6NlV.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Nola Darling",
               "gender": 0,
               "credit_id": "52fe4572c3a368484e05b737",
               "name": "Tracy Camilla Johns",
               "profile_path": "/3d7rFFNSdOhYlhLi9jwY0GF9gyX.jpg",
               "id": 99358,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Jamie Overstreet",
               "gender": 2,
               "credit_id": "52fe4572c3a368484e05b73b",
               "name": "Tommy Redmond Hicks",
               "profile_path": null,
               "id": 99359,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Greer Childs",
               "gender": 2,
               "credit_id": "52fe4572c3a368484e05b73f",
               "name": "John Canada Terrell",
               "profile_path": null,
               "id": 99360,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Mars Blackmon",
               "gender": 2,
               "credit_id": "52fe4572c3a368484e05b743",
               "name": "Spike Lee",
               "profile_path": "/2LmTDMa6ewhkyP4LDBWFdDYDfUv.jpg",
               "id": 5281,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Opal Gilstrap",
               "gender": 1,
               "credit_id": "52fe4572c3a368484e05b747",
               "name": "Raye Dowell",
               "profile_path": null,
               "id": 99361,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Clorinda Bradford",
               "gender": 1,
               "credit_id": "52fe4572c3a368484e05b74b",
               "name": "Joie Lee",
               "profile_path": "/oWREZ1vjXxycfdwV5wlDwqZnODo.jpg",
               "id": 13602,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Doctor Jamison",
               "gender": 1,
               "credit_id": "52fe4572c3a368484e05b74f",
               "name": "S. Epatha Merkerson",
               "profile_path": "/wuzhs2DR1ImE3Y8kuMoCXpFaHVK.jpg",
               "id": 3978,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4572c3a368484e05b72d",
               "name": "Spike Lee",
               "profile_path": "/2LmTDMa6ewhkyP4LDBWFdDYDfUv.jpg",
               "id": 5281,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4572c3a368484e05b733",
               "name": "Spike Lee",
               "profile_path": "/2LmTDMa6ewhkyP4LDBWFdDYDfUv.jpg",
               "id": 5281,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "584a629892514119b301c94c",
               "name": "Pamm R. Jackson",
               "profile_path": null,
               "id": 1720048,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "584a62a1c3a3681408018a91",
               "name": "Spike Lee",
               "profile_path": "/2LmTDMa6ewhkyP4LDBWFdDYDfUv.jpg",
               "id": 5281,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "584a62aac3a368141401d8c0",
               "name": "Bill Lee",
               "profile_path": null,
               "id": 15520,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "584a62b1c3a3681408018aa0",
               "name": "Ernest R. Dickerson",
               "profile_path": "/2plWyKruDXgk6GQI9ex8lieymoK.jpg",
               "id": 15521,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "584a62b992514159b000a4c1",
               "name": "Spike Lee",
               "profile_path": "/2LmTDMa6ewhkyP4LDBWFdDYDfUv.jpg",
               "id": 5281,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "584a62c292514119bc01c8b0",
               "name": "Wynn Thomas",
               "profile_path": null,
               "id": 548,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "584a62c992514119bc01c8b6",
               "name": "Ron Paley",
               "profile_path": null,
               "id": 1720049,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "584a62d3c3a368141101c31a",
               "name": "John Michael Reefer",
               "profile_path": null,
               "id": 1720050,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 3.113701,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 27995,
      "vote_count": 44,
      "budget": 0,
      "overview": "The story of Nola Darling's simultaneous sexual relationships with three different men is told by her and by her partners and other friends. All three men wanted her to commit solely to them; Nola resists being \"owned\" by a single partner.",
      "similar": [
         258480,
         401898,
         3134,
         48650,
         298312,
         9093,
         112160,
         449176,
         370663,
         11634,
         2142,
         8810,
         4771,
         769,
         979,
         10285,
         205,
         431,
         562,
         281
      ],
      "original_title": "She's Gotta Have It",
      "runtime": 84,
      "poster_path": "/y5BQ1hBqN6tkopJaN0woTl6eMRv.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "40 Acres & A Mule Filmworks",
         "id": 4319,
         "origin_country": ""
      }],
      "release_date": "1986-08-08",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "I'm not a one-man woman. Bottom line.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Spike Lee"],
      "runtime": 84,
      "synopsis": null,
      "writers": ["Spike Lee"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0091939/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc4Mzg3NTcwMl5BMl5BanBnXkFtZTcwMjcxNjM0MQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Tracy Camilla Johns, Tommy Redmond Hicks, John Canada Terrell | See full cast and crew »"],
      "reviews": [
         "\"She's Gotta Have It\" was the beginning of an illustrious career for filmmaker Spike Lee. It starred Tracy Camilla Johns as the sex driven Nola Darling. Her three men were played by Tommy Redmond Hicks, John Canada Terrell and Spike Lee. All the three men had certain traits that stood out. Jamie Street (Hicks) is cool, calm and caring towards Nola. Greer Childs (Terrell) was the obnoxious, stuck up, rude pseudo black man that thought he was better than anyone else. And last but not least was Mars Blackmon (Lee), he was funny and outgoing. Annoying at times but his wit could win you over. This film is full of memorable one liners like \"please baby baby baby please\" and much more. This film was heavily criticized for it's depiction of women (like all of Spike's films), lesbians (the character Opal) and the reality of it. But nonetheless, \"She's Gotta Have It\" opened in 1986 to rave reviews and grossed 7 million dollars (not a lot but it is amazing compared to the thousands it took to make it). What made this film a gem is that you don't find characters like these anymore. They all had something about them that was hard to resist. Mars Blackmon became so famous that he was reprised by Lee in Nike Air Jordan commercials with the great Michael Jordan, airing from 1988 to 1995 (the Nola character also appeared in one Air Jordan commercial with Mars Blackmon, the commercial only aired once). \"She's Gotta Have It\" is a decent start for a young filmmaker and a must see for those that haven't seen it. She's Gotta Have It- Rated R *** out of ****",
         "This is a completely unique, humorous, sexy film from Spike Lee -- his first cinematic effort, using his friends from NYU film school as actors. He himself plays the role of eccentric Mars, one of heroine Nola darling's three lovers. Though I'm sure Lee wouldn't describe himself as a feminist, this film looks at so-called \"promiscuity\" from a distinctly liberated point of view. Perhaps women need more than one man, he wonders, because it takes several men to make up a complete person! The film is set in a rarely seen milieu, that of artistic, well-educated, middle-class, quirky urban African-Americans (like the view of black Chicago in \"Love Jones\"). It would be fascinating from that standpoint, even it if didn't display such ruefully witty characterizations of egotistical, clueless men. You could spend an afternoon in far worse fashion than to rent this film, and view Lee's naked talent shining through in a film whose cost probably wouldn't pay the catering bill for one of his film projects these days. The fact that it is filmed almost entirely in black and white adds to its authenticity and charm.",
         "When I first heard about this film, I very much thought that it was going to be nothing more than a black t&a flick. However, I this film turned out to be an interesting character study, which looks not only at black sexuality, but at the way people look at different stereotypes of men and women. You had sensitive Jamie, arrogant Greer and space cadet Mars all chasing after one of the first truly sexually liberated women to ever be portrayed on the silver screen in Nola. This film also shows how when a man has a lot of sexual partners, they are pretty much looked at a stud, but if a woman has a lot of partners she is looked at as a nymphomaniac. This film pretty much takes those stereotypes and turns them around. The only negative criticisms I have is the fact that as the film goes on it tries to become a serious drama, especially in the scene when Jamie rapes Nola. Also, the film fails to address the idea of safe sex, especially since this film was released just as the AIDS crisis was really beginning to infect the black community. Other than those criticisms this was a pretty decent early effort from Spike Lee.",
         "I read one review on here that labeled She's Gotta Have it as Spike Lee's 'feminist view'. I would agree with this in part because he doesn't show anything- the characters really- on any one side. We see her follies completely. But I think there is a male view going on with his look at these characters too; after we see how a woman can be all liberated and free of being too restricted with who she wants to love/fool around with, there's more of a sympathy going on for the men too as the situation starts to come down to an essential thing- what does Nola REALLY want? By the end of the picture, no one can really say for certain, Nola most of all, but all the while Lee has given us a look at romance that is ordinary only in how some of the typical characteristics of men and women are portrayed at times. But really, it's also out of the ordinary on showing the little things that wouldn't get into the common romantic comedy. It's a little too loosely structured and the style isn't altogether great, but it has as much ambition as Scorsese's Who's That Knocking or Bertolucci's Before the Revolution, at least in trying to convey subject matter primarily through style. Not to say the substance is left unchecked- in fact for the most part it's one of Lee's sharpest satires on the troubles of the sexes, and the main characters are a bit more believable than those of the main white/black couple of Jungle Fever. Lee boils it downs to seeming essentials at first- Nola (Tracy Camilla Johns, not bad at all if not as strong as the main 'heroine' could be) is a magazine painter, but really its her romantic life that keeps her usually occupied. We see the various attempts of various male 'pick-up lines' (which is pretty hilarious, if dated), and then we meet guy #1, Jamie (Tommy Hicks, maybe the best 'real' actor of the group), who is really the nice guy, the kind that any reasonable woman would consider probably marrying sooner or later. But she also has male #2, Greer (John Canada Turrell, with a great, shallow look to him if not overall performance), who is a male model who is meticulously egotistical even with folding up his clothes before sex. And then there's #3, Mars Blackmon (Lee himself, in uproariously huge glasses and his name etched out in gold across his neck, surely one of his most wonderful characters played by him), who is the jokester, and word-spinner, and always takes a while to get around in a conversation. So around and around she goes, and it's really only until the last twenty minutes when Nola finally has to come down and make the decision- and it perhaps will have to come down to the 'right' decision- but for what she just can't tell. Part of it is that she just loves sex, which becomes a problem when she invites over the three men for thanksgiving (not a totally successful scene, mainly due to the dialog and pacing, but still a nice job in awkward tension). And also a problem when Jamie, the nice guy, makes an ultimatum for Nola. At the same time in the background there is the unusual tension of a possible lesbian affair with Opal (Raye Dowell, very good in her scenes), but nothing comes to it. Scenes like those, where the sexual and relationship-type boundaries come into question, are really interesting. The self-conscious talking-to-the-camera interview bits range from excellent to just OK though, and sort of mark the quality of the film down a peg, even as the characters get to share some of their inner thoughts (Lee's being the funniest). What then makes Lee's film a big step above any other number of films out there, primarily in the Hollywood mainstream, about a woman who has trouble deciding what to do with herself? It's two things; one, that the men are probably just as interesting with what they have going on as her, if not more so for Jamie, and two, the cinematic techniques imposed by Lee and cinematographer Ernest Dickerson. The latter of those two helps make She's Gotta Have it even more of a light-hearted picture than it might have been if just filmed as the script is. We get the images first put to Lee's father Bill's score, which is definitely one of his best after Do the Right Thing. Then the images get a lot of invention on such a small budget, unusually intimate and creative camera angles (I loved the bit when we see in slow-motion the extreme close-ups of Mars getting close with Nola), the lighting often very expressionistic, and sometimes the editing going to playful, odd lengths like the sex scene between Nola and Greer. Sometimes the playfulness and first-time filmmaker amazement is a little much, like the color film sequence, which is beautiful but almost better self-contained than with the black & white grittiness of the rest of the film. I also could've done without the last bit after the denouement where all the actors say their names with the clapper. Nevertheless the stylistic merits add a lot to make it a richer film in context and structure. But if you can seek it out, especially in widescreen (I saw it on IFC, though I wish I could see the director's cut to see what was cut out, however explicit it might be), it's well worth it. It's a small film, yet one that brings up some intriguing bits about what it means to really love someone vs. desire them, and what mind-games go on between men & women, men & men, women & women, and where the middle-ground could be, if at all. A minor independent/debut classic. A-",
         "The world was introduced to Spike Lee with \"She's Gotta Have It\", about one Nola Darling (Tracy Camilla Johns) and her three lovers (Lee plays one of them). Everyone in the movie has their own kinds of shortcomings, but they're all honest people, all trying to make their way in the world. Spike Lee was clearly showing the talent that he would bring to his later movies. I should remind you that this is not a movie for people with short attention spans. Most of it is very low-key, involving a lot of dialog. But it's a very impressive flick at that. Maybe this is mainly a flick for film buffs, but I recommend it to everyone.",
         "Spike Lee's low-budget, directorial debut \"She's Gotta Have It\" ranks as the outspoken African-American's helmer's best and least pretentious film. This modest but compelling portrait of single black woman Nola Darling qualifies as one of the greatest feminist films of the 1980s. The theme of women versus men dominates the action with the corresponding themes of women versus women and women versus society tangling for second place. The men fall back on the traditional precedents that society has established for women. Consequently, this melodrama exposes the sexual double-standard issue between men and women. Indeed, men cite dating multiple women as their masculine birthright, while a woman must only date one man at a time. \"She's Gotta Have It\" torpedoes that argument with its unorthodox heroine. Moreover, coming as it did on the last years of \"blaxploitation\" movie, Lee's film is refreshing different because none of the men are portrayed stereotypically as either pimps or drug dealers. The cast, headed by Tracy Camilla Johns, is largely unknown, but they perform well in this simple, but powerful 84 minute melodrama that asks the audience to decide if the leading lady\u0097Nola\u0097is a freak. In other words, is Nola a slut because she has three boyfriends that she has sex with in her apartment in New York City. Lee makes excellent use of the technique of breaking the fourth wall\u0097when the thespians address the audience by looking directly into the camera at us\u0097and taking their argument to us. The heroine has a relationship with a romantically inclined lover Jamie Overstreet (Tommy Redmond Hicks), a stuck-up, egotistical performer Greer Childs (John Canada Terrell), and young, snappy street dude Mars Blackmon (Spike Lee). None of the three guys likes each other as they struggle to please Nola. One of Nola's apartment house neighbors is an attractive lesbian Opal Gilstrap (Raye Dowell of \"Malcolm X\") who tries without success to seduce Nola.",
         "When reviewing all of Spike's work, this is hands down, probably my all-time favorite. This project introduced us to the incomparable Mars Blackman, Spike's oh so charming alter ego. \"She's Gotta Have It\" is a wonderful treatise on the art of love and war from interesting perspectives. On top of that, it is quite hilarious. It is a refreshing look at a black woman who insists on taking control of her sexuality rather than allowing it to be defined by men. There are general male observations, general female observations, and specific cultural outlooks on the art of love and war from an African-American perspective. Tracy Camilla Johns, beautifully portraying the wonderfully developed character, Nola Darling, is perfectly cast as the independent black woman who, in her quest to be sexually independent, realizes this is an uphill journey when dealing with men who still have traditional ideas about women and their roles. She was actively dating more than one man simply because she had adapted the attitude that no one man can provide everything she wanted/needed and furthermore, it was terribly unfair to label her promiscuous for doing so. Interestingly enough, Nola also found that her own reactions when coming up against the same attitude in men, were amazingly traditional. This was a very well-written statement on the ups and downs of love. It also introduces us to Law & Order's Divine Epatha Merkerson in a short but pivotal role as a sex therapist. Eeeeeeeeeeeeeexcellent movie!!!",
         "Spike Lee's fist, and in many ways his best work. Simple, elemental, insightful, and funny. Beautifully shot in black and white the film is a true \"New York/Brooklyn\" movie that makes the most of the City, it's streets, and landmarks; with a wonderful soundtrack by his Dad, Jazz legend, Stan Lee. You have to remember that this was a small budget Indy film from a director who would later enjoy big budget successes. When this movie first came out it had everyone buzzing about it and him; and it earned him the accolade: the up and coming Black Woody Allen in the New York press. (a statement that implied a unique \"New York\" perspective on the world, his intellect, his talent, and his humor; hopefully not also a parallel to the two men being rather short in physical stature....",
         "I'm a Spike Lee fan from way back but missed this one. Now I'm an old retired lady with plenty of time to catch up. All I can say is that this was a wonderful funny erotic comedy. I liked the way the characters introduced themselves, especially the former roommate who moved out because Nola was entertaining so many men, and all the men who announced their charms. If you wouldn't get a laugh watching Greer fold his clothes before sex, I don't know what would tickle you! Spike Lee himself as Mars reminds me of my Border Collie: playful, obnoxiously demanding, adoring, and never understanding why he can't be #1. When Nola is convinced that she should consult a specialist for her addiction, she comes away with no resolution, but we are treated to a wonderful aside by the therapist. The only thing that keeps this picture from a 10 rating is the sequence in color, which I though was trite and out of keeping of the rest of the movie.",
         "Spike Lee's directoral debut is classic. How can he go wrong with a black and white film... BW is the best. This film is made up of great characters(Mars) and perfect, orginal direction. I think Spike did a great job with the editing too.. oh I almost forgot his screen debut as and actor too, which was perfect as well. A smile came to my face every time Mars came in the mix, especially the Thanksgiving scene. I love those glasses Spike. 9/10"
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": ["40 Acres & A Mule Filmworks"],
      "summaries": [
         "The story of Nola Darling's simultaneous sexual relationships with three different men is told by her and by her partners and other friends. All three men wanted her to commit solely to them; Nola resists being \"owned\" by a single partner.",
         "Nola Darling is an independent-minded young woman who knows what she likes and what she wants out of life. She's attractive, likes sex and has no trouble attracting men but she knows what kind of man she wants. She also attracts women like Opal Gilstrap, who hope she'll 'come around'. The three men in her life - Jamie Overstreet, Mars Blackmon and Greer Childs - all provide their point of view on Nola and on their relationship with her.",
         "A window into the life and loves of a young black woman in Brooklyn. Nola Darling is dating three very different men simultaneously: Jamie Overstreet -- a controlling, protective, patriarchal type; Greer Childs -- a wealthy, vain, arrogant male model; and Mars Blackmon -- a comical, juvenile, immature jokester. Nola has gone beyond even a love \"triangle\" and the stability of this love \"square\" is threatened by the increasing jealousy among her three suitors. Finally, under pressure, Nola makes her \"choice,\" but in the end, is this what she really wants?",
         "Story of a woman and her three lovers."
      ],
      "budget": 175000
   },
   "movielensId": 3422,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1986-08-08",
      "dvdReleaseDate": "2008-01-15",
      "directors": ["Spike Lee"],
      "runtime": 84,
      "movieId": 3422,
      "title": "She's Gotta Have It",
      "mpaa": "",
      "actors": [
         "Tracy Camilla Johns",
         "Tommy Redmond Hicks",
         "John Canada Terrell",
         "Spike Lee",
         "Raye Dowell",
         "Joie Lee",
         "S. Epatha Merkerson"
      ],
      "imdbMovieId": "0091939",
      "originalTitle": "She's Gotta Have It",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["xtK9qknAhtE"],
      "plotSummary": "The story of Nola Darling's simultaneous sexual relationships with three different men is told by her and by her partners and other friends. All three men wanted her to commit solely to them; Nola resists being \"owned\" by a single partner.",
      "tmdbMovieId": 27995,
      "avgRating": 3.41082,
      "releaseYear": "1986",
      "numRatings": 998,
      "posterPath": "/y5BQ1hBqN6tkopJaN0woTl6eMRv.jpg"
   }
}