{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "musical",
         "id": 4344
      }],
      "imdb_id": "tt0096054",
      "video": false,
      "title": "School Daze",
      "recommendations": [
         49471,
         34152,
         47898,
         291326,
         4968,
         38925,
         12479,
         20443,
         16162,
         38560,
         19723,
         43269,
         26626,
         31361,
         22976,
         15462,
         76297,
         61418,
         29114,
         241432
      ],
      "backdrop_path": "/zpndSnsOCQBbDILeBpkBNVi8BTY.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 18,
               "character": "Leeds",
               "gender": 2,
               "credit_id": "5484104bc3a36829a700a5a8",
               "name": "Samuel L. Jackson",
               "profile_path": "/AvCReLikjzYEf9XjTQxbv3JWgKT.jpg",
               "id": 2231,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Dap",
               "gender": 2,
               "credit_id": "52fe46069251416c910468fd",
               "name": "Laurence Fishburne",
               "profile_path": "/8suOhUmPbfKqDQ17jQ1Gy0mI3P4.jpg",
               "id": 2975,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Julian",
               "gender": 2,
               "credit_id": "52fe46069251416c91046905",
               "name": "Giancarlo Esposito",
               "profile_path": "/d39hOi5lTfqekjFK4JKKPeuGNdW.jpg",
               "id": 4808,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Jane Toussaint",
               "gender": 1,
               "credit_id": "52fe46069251416c91046913",
               "name": "Tisha Campbell-Martin",
               "profile_path": "/8nfymZ8Ohi7P5mNGOMddRmm5pgF.jpg",
               "id": 141823,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Coach Odom",
               "gender": 2,
               "credit_id": "54840fe7c3a36829b500cb14",
               "name": "Ossie Davis",
               "profile_path": "/9oVewASbQrzqENeKJX5CGLVzq3U.jpg",
               "id": 15531,
               "order": 4
            },
            {
               "cast_id": 3,
               "character": "President McPherson",
               "gender": 2,
               "credit_id": "52fe46069251416c91046901",
               "name": "Joe Seneca",
               "profile_path": "/5penlxizlwlAQr4Dtv0uQuY0Kke.jpg",
               "id": 51546,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Cedar Cloud",
               "gender": 2,
               "credit_id": "54840fdcc3a36829a700a58e",
               "name": "Art Evans",
               "profile_path": "/oFxv6KQdXU30MY00ASwoMqbKVAg.jpg",
               "id": 56183,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Odrie McPherson",
               "gender": 1,
               "credit_id": "54840fc9c3a36829a700a58a",
               "name": "Ellen Holly",
               "profile_path": "/praC2KZpY6RSfD2TB5RrPbS2wAP.jpg",
               "id": 196864,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Grady",
               "gender": 2,
               "credit_id": "54840ff5c3a36829ab00a8f3",
               "name": "Bill Nunn",
               "profile_path": "/dcZWC2iGjHasKwdYSwpHcWFQX5a.jpg",
               "id": 5502,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Darrell \"Half-Pint\" Dunlap",
               "gender": 2,
               "credit_id": "5484100fc3a3685c0e004316",
               "name": "Spike Lee",
               "profile_path": "/2LmTDMa6ewhkyP4LDBWFdDYDfUv.jpg",
               "id": 5281,
               "order": 9
            },
            {
               "cast_id": 9,
               "character": "Rachel Meadows",
               "gender": 0,
               "credit_id": "54840fbcc3a36829a300a2a1",
               "name": "Kyme",
               "profile_path": null,
               "id": 1219219,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Lizzie Life",
               "gender": 1,
               "credit_id": "548410399251416e7400a97a",
               "name": "Joie Lee",
               "profile_path": "/oWREZ1vjXxycfdwV5wlDwqZnODo.jpg",
               "id": 13602,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Dina",
               "gender": 1,
               "credit_id": "54841045c3a36817a500adbf",
               "name": "Jasmine Guy",
               "profile_path": "/pVzVMjL017INzJUhayvjObnYThR.jpg",
               "id": 77353,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "Paula",
               "gender": 1,
               "credit_id": "548410579251416e7b0098a4",
               "name": "Cassi Davis",
               "profile_path": "/h1CvHpp2CFM24hkN42c8dYkLB1Y.jpg",
               "id": 80611,
               "order": 13
            },
            {
               "cast_id": 8,
               "character": "Virgil Cloyd",
               "gender": 0,
               "credit_id": "52fe46069251416c91046917",
               "name": "Gregg Burge",
               "profile_path": "/dbpl591FqLd7ofX3pX7a6cjzxfJ.jpg",
               "id": 180711,
               "order": 14
            },
            {
               "cast_id": 20,
               "character": "Perry",
               "gender": 1,
               "credit_id": "54d5a87a9251415f9c001241",
               "name": "Kasi Lemmons",
               "profile_path": "/dO8h85dpcoVFkKwa8MMOacRro4F.jpg",
               "id": 51864,
               "order": 15
            },
            {
               "cast_id": 24,
               "character": "Jordan",
               "gender": 2,
               "credit_id": "578a7bfe92514163c40049d9",
               "name": "Branford Marsalis",
               "profile_path": "/sUPF2Q2cq8R8D3XRkVDF8lNqDlW.jpg",
               "id": 192272,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46069251416c910468f9",
               "name": "Spike Lee",
               "profile_path": "/2LmTDMa6ewhkyP4LDBWFdDYDfUv.jpg",
               "id": 5281,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46069251416c9104690b",
               "name": "Spike Lee",
               "profile_path": "/2LmTDMa6ewhkyP4LDBWFdDYDfUv.jpg",
               "id": 5281,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "54d5a894c3a3683b920016b0",
               "name": "Spike Lee",
               "profile_path": "/2LmTDMa6ewhkyP4LDBWFdDYDfUv.jpg",
               "id": 5281,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "54d5a8bcc3a3683b920016b3",
               "name": "Barry Alexander Brown",
               "profile_path": null,
               "id": 5289,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "584a6305c3a368141f01c640",
               "name": "Ernest R. Dickerson",
               "profile_path": "/2plWyKruDXgk6GQI9ex8lieymoK.jpg",
               "id": 15521,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 3.135741,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 36739,
      "vote_count": 32,
      "budget": 0,
      "overview": "In the South of the United States are taking place confrontations between two groups of students who have different ideas and are not able to accept the one of the oponent.",
      "similar": [
         872,
         812,
         10530,
         224141,
         38757,
         11224,
         15121,
         11970,
         824,
         8587,
         11631,
         703,
         46195,
         196867,
         114,
         134,
         10545,
         41233,
         18947,
         19404
      ],
      "original_title": "School Daze",
      "runtime": 121,
      "poster_path": "/850d9u0a2NlY0eKoS1Ny6Cm6jaQ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "40 Acres & A Mule Filmworks",
            "id": 4319,
            "origin_country": ""
         }
      ],
      "release_date": "1988-02-12",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Spike Lee"],
      "runtime": 121,
      "synopsis": "Vaughn \"Dap\" Dunlap (Laurence Fishburne) is a politically conscious African American student at Mission College, an all black college in rural Georgia, who leads anti-apartheid demonstrations in encouraging students and school administrators to completely divest from South Africa. At the same time, Dap is also feuding with the Greek fraternal system member and rush chairman, Julian Eaves (Giancarlo Esposito) aka: Dean Big Brother Almighty of Gamma Phi Gamma Fraternity, Incorporated over the frat jocks' indifference to the rest of blacks in America and the rest of the world for their own sports-career minds. Meanwhile, Dap's younger cousin, Darrell (Spike Lee) aka \"Half-Pint\", is a fellow activist and a Gamma pledge who soon becomes torn over his far left-wing political views and of the sports of his new frat brothers. The Gamma women's auxiliary, the Gamma Rays, battle with non-Greek fellow co-eds... and Dap's dark-skinned activist friends battle the light-skinned locals and school officals over rights on the campus.",
      "writers": ["Spike Lee"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0096054/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzcwMTcxMjk4OV5BMl5BanBnXkFtZTcwMzc3NTcyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Laurence Fishburne, Giancarlo Esposito, Tisha Campbell-Martin | See full cast and crew »"],
      "reviews": [
         "I had not seen Spike Lee's School Daze in 13 years, the first weekend of its release. This movie has a very special meaning to African Americans like me who were college students in the 80s. The school setting acts as a microcosm of black life as a whole. The social issues it tackles are all too familiar to black life: light skin vs. dark skin, college kids vs. the surrounding economically disadvantage community, and the social responsibility of African Americans to Africans across the entire black diaspora among others. Watching it in 1988 I thought the dance sequences were too long, but in 2001 I now see their worth. The DVD is visually beautiful, while being gritty in spots where it should thanks to the beautiful work of the great Ernest Dickerson. This was a huge leap for Spike as a director, coming from a $175,000 budget for She's Got To Have It to School Daze. This film does a great job of giving us some of the inner workings of Black Greek letter organizations. It also shows what abuse people will go through to belong. I was actually living School Daze when I saw it in 1988, so I come from that perspective. It was thrilling to figuratively see myself on that screen in 1988. If you are looking for Academy Award winning performances, then this isn't the film for you, although there are some really fine actors in the film. If you haven't ever lived this existence, it is really hard to appreciate School Daze. I have a great appreciation for Spike, the era, and the story Spike has written and brought to the screen. Most folks don't get the ending \"Wake Up\" scene, but it absolutely belongs. The entire movie and most of Spike's works are wake up calls to America, but specifically to the black community.",
         "I am only 18 years old and I just saw the movie School Daze. I do not attend a H.B.C.U., but I have friends that tell me what goes on there. To the older people out there, can you believe that that type of stuff is still going on?! My friends and I were just talking the other day about how this guy on her campus would only date lighter skinned girls. If that is his thing, than it is, however, he would not date them because of their personality. He said they just \"looked better on his arm.\" My mother and I always discuss the future of African-Americans and I am going to tell the truth. I am scared. We hurt each other more than any other race and we have to stop. I am a dark-skinned female and I just learnd to love myself. I thank Spike Lee for not being ashamed to call us out when we needed it. No, I do not think that the movie was an Oscar winner, but I do know that it was a mind opener and should be a lesson to all of us on how we allowed the European standard of beauty to shape our self-worth.",
         "This film dealt with a lot of inner conflicts that African-Americans where unwilling to deal with at the time. Class struggles, light skinned vs. dark skinned and greeks vs. non-greeks. I just purchased it on DVD, but I remember seeing this film when it first came out in February of 1988 and it is just as powerful and entertaining now as it was then. It's amazing to look at this film now and see all of the actors who went on to successful careers afterwards, like Laurence(then Larry) Fishburne, Tisha Campbell, Giancarlo Esposito, Roger Guenveur Smith, Kadeem Hardison, Jasmine Guy, Darryl Bell, Rusty Cundieff(director of \"Tales From The Hood\"), Bill Nunn, Branford Marsalis, and of course I can't forget Samuel L. Jackson. Three years after this film came out a cousin from Seattle came to visit, I showed him this film and he was surprised to discover that there were actually historically black colleges and universities(HBCU's) in this country. He later attended Southern University here in Baton Rouge. That was the effect this film had and continues to have on young African-Americans and their views of HBCU's.",
         "So what if you went to Harvard and not Hampton, this film is still well-shot, well-acted and damn funny. If you can't understand the light vs. dark, town vs. gown, Greeks vs. GDI conflicts, maybe you don't... under... stand... English... well. I never saw the movie in its entirety until I was about 20 (and pledging at an HBCU, but that's another story) but it just got better as I got older. This movie is like many of Spike's: it's for a group of people (Black ones) that rarely get to tell their own stories. If other people get it, super. On a sidenote, what's so \"universal\" about Dirty Dancing? I've never had to drop out of a contest because of my botched abortion that Lenny from Law & Order had to come help me out with. I've also never been a small, Jewish man in New York City, but people seem to find Woody Allen's movies \"universal\" enough. Why don't these issues come up with movies made by whi... (ahem) other filmmakers?",
         "Spike pegged this. He couldn't get it all in, but he was darn close. The light-skinned vs. the dark-skinned, exclusionary syndrome perpetrated by Black Greeks to non-Greeks, Homecoming, the sweaty and hot parties, the rift/resentment between lower-class local Blacks and the students, sexuality... It was great. Unfortunately, my main man Spike failed to make it universal, so if you ain't what I mentioned in my one-line summary, you might not get it. God Bless the ones that try to understand the mentality instead of dogging out the man's obvious and enormous filmmaking talent. You can hate Kobe Bryant for taking all the darn shots, but you can't hate the young man's game! PEACE!",
         "This was the best black college movie of all time! This movie went places that know other college movie to this date have yet to explore. I was eight when I first saw this movie and the message that Spike was making was over my head at the time I viewed this movie, but his message is still a point for our people today. I every once in awhile will set down to look at this great movie and come up with things to talk about with others. This movie made me want to attend a HBCU and I did Delaware State University and I even joined a frat. This movie comes with my highest recommendation. If you missed the message in the movie, its over your head and you need to watch it again.",
         "School Daze is billed as a musical comedy but is better described as a comedy-drama with musical numbers as commentary--the only non-diegetic number is \"Good and Bad Hair,\" Lee's all-girl fantasy homage to West Side Story that addresses colorism between the \"paper bag-light\" sorority Gamma Rays and the darker activist girls. Ebert wrote that this was the first movie he'd seen in a while where the black characters relate to each other instead of a hypothetical white audience--it is this that gives the movie its engrossing authenticity. (If it matters, I'm white.) As funny as the movie can be, it's also incredibly hard-hitting--there's a sequence in the last 20 minutes where Julian, \"Big Brother Al-migh-tee,\" insists his girlfriend \"prove\" her love, that's almost unwatchable and yet brutally honest. Lee has been called sexist for his underwritten female characters--there may be some truth to that but School Daze is far more critical of the men than the women. Rachel, Dap's girlfriend, is perhaps the most levelheaded, likable character in the movie, and is strong and supportive of Dap while still maintaining her independence. Even the Gamma Rays, who come off as shallow and colorist in the beginning, are sympathetic as they stand up for and try to aid the pledges during hazing. The characters who come off the worst are the GPG brothers who are, almost to a man, brutish, sadistic and crude. Julian in particular is unredeemable--clever, manipulative and almost sociopathic in his treatment of Jane. Lee supposedly based the movie on his observations at Morehouse and the movie stands as a scathing indictment against the black fraternity system and its abuse of the women's auxiliaries (aka \"Little Sisters\"). The movie has structural weaknesses (the ending is problematic and seems to come out of nowhere although it fits thematically) but its biggest problem is Lee's flat performance as Half-Pint (and, frankly, he looks a little too old for it). I love Lee's movies but his early tendency to cast himself in major roles was a real weakness--he's just not a good enough actor and his performance always jerks me out of the story. The rest of the cast is fantastic, though, especially Tisha Campbell as Jane and Giancarlo Esposito as Julian. Notice must also be given to Bill Lee's wonderful score. Ultimately it's a movie whose heart and imagination overcome its flaws.",
         "This is my favorite movie of all time. I have seen it at least 300 times. I saw it the first time about a year after it came out. I was about ten years old and I was mesmerized. I really loved all the singing and dancing. But when I got older, thats when I got the message of movie. Thats what makes this movie such as classic. The only thing I don't like about it is that I read the book about the making of School Daze and Spike cut out so many scenes that would have been good for the movie. It would have made some of the scenes easier to understand. I wished he would've put them on the DVD. But still, one of the greatest black films of all time.",
         "(SOME SPOILERS) Coming off the heels of the successful \"She's Gotta Have It\", Spike Lee examines tension between blacks in \"School Daze\". When \"School Daze\" was originally released it caused an uproar in the African American community. African Americans accused Lee for \"airing dirty laundry\". A lot of this happened because \"School Daze\" showcases the tension between light skinned African Americans and dark skin African Americans. A lot of this true. This is seen more recently in music videos. A lot of models with darker complexion complain that women with lighter skin get all the spotlight. This has been going on for a long time in the African American community. This is seen in the rivalry between Tisha Campbell's character Jane and Kyme's character Rachel. They even get into an entertaining musical titled \"Good or Bad Hair\". The funny thing about that scene is that the darker women is in the group called Nappy and the lighter women is in the group Straight. This is also carried on in the feud between Dap (Laurence Fishburne) and Julian (Giancarlo Esposito). There is also a very thought provoking ending that is a must see (common Spike Lee trademark) With \"School Daze\" you get three in one, it's a frat comedy that turns into a musical that turns into a social statement. But nonetheless, this film is entertaining form beginning to end. Watch out for a lot of familiar faces, most of the cast went on to be huge stars. School Daze- rated R *** out of ****",
         "I loved this movie! I have it on VHS and DVD. I always related to this movie. As an African American man who was actively pressuring the institution of \"higher learning\" that I was attending at the time to divest from South Africa, I felt like one of \"Da fellas\". My boys and I even went to see it in a raggedy Chevrolet. I completely vibed with the whole frat versus GDI issue. As a student at a northern predominantly white institution some of the other issues around skin color were new to me. A must see for any African American student attending or planning on attending college - especially if they plan on attending an Historically Black Colege or University."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Musical"
      ],
      "productionCompanies": [
         "Columbia Pictures Corporation",
         "40 Acres & A Mule Filmworks"
      ],
      "summaries": [
         "In the South of the United States are taking place confrontations between two groups of students who have different ideas and are not able to accept the one of the opponent.",
         "A contemporary comedic look at black college life. Dap (Fishburne) and Big Brother Almighty (Esposito) conflict over the greek frat system while the Wanna-be's and Jigaboo's conflict over self-identity and self-esteem.",
         "A not so popular young man wants to pledge to a popular fraternity at his historically black college."
      ],
      "budget": 6500000
   },
   "movielensId": 3423,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1988-02-12",
      "dvdReleaseDate": "2005-02-01",
      "directors": ["Spike Lee"],
      "runtime": 121,
      "movieId": 3423,
      "title": "School Daze",
      "mpaa": "R",
      "actors": [
         "Samuel L. Jackson",
         "Laurence Fishburne",
         "Giancarlo Esposito",
         "Tisha Campbell-Martin",
         "Ossie Davis",
         "Joe Seneca",
         "Art Evans",
         "Ellen Holly",
         "Bill Nunn",
         "Spike Lee",
         "Kyme",
         "Joie Lee",
         "Jasmine Guy",
         "Cassi Davis",
         "Gregg Burge",
         "Kasi Lemmons",
         "Branford Marsalis"
      ],
      "imdbMovieId": "0096054",
      "originalTitle": "School Daze",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["uLT3Qu76-bw"],
      "plotSummary": "In the South of the United States are taking place confrontations between two groups of students who have different ideas and are not able to accept the one of the oponent.",
      "tmdbMovieId": 36739,
      "avgRating": 2.90508,
      "releaseYear": "1988",
      "numRatings": 374,
      "posterPath": "/850d9u0a2NlY0eKoS1Ny6Cm6jaQ.jpg"
   }
}