{
   "tmdb": {
      "original_language": "uk",
      "keywords": [{
         "name": "musical",
         "id": 4344
      }],
      "imdb_id": "tt0100168",
      "video": false,
      "title": "Mo' Better Blues",
      "recommendations": [
         36739,
         1713,
         34152,
         20649,
         49471,
         31004,
         10279,
         12772,
         30798,
         47868,
         267931,
         18414,
         240634,
         18192,
         102463,
         225671,
         60823,
         12479,
         34322,
         56931
      ],
      "backdrop_path": "/ijeW8McIsGAfYbAjSqjh1guYtPh.jpg",
      "revenue": 16153593,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Bleek Gilliam",
               "gender": 2,
               "credit_id": "52fe45dfc3a36847f80df4eb",
               "name": "Denzel Washington",
               "profile_path": "/semwsON3dN3np6cyzlCw7F2YDGe.jpg",
               "id": 5292,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Giant",
               "gender": 2,
               "credit_id": "52fe45dfc3a36847f80df4ef",
               "name": "Spike Lee",
               "profile_path": "/2LmTDMa6ewhkyP4LDBWFdDYDfUv.jpg",
               "id": 5281,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Shadow Henderson (Sax)",
               "gender": 2,
               "credit_id": "52fe45dfc3a36847f80df4f3",
               "name": "Wesley Snipes",
               "profile_path": "/hQ6EBa6vgu7HoZpzms8Y10VL5Iw.jpg",
               "id": 10814,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Left Hand Lacey (Piano)",
               "gender": 2,
               "credit_id": "52fe45dfc3a36847f80df4f7",
               "name": "Giancarlo Esposito",
               "profile_path": "/d39hOi5lTfqekjFK4JKKPeuGNdW.jpg",
               "id": 4808,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Moe Flatbush",
               "gender": 2,
               "credit_id": "52fe45dfc3a36847f80df4fb",
               "name": "John Turturro",
               "profile_path": "/70V4hwvWN0J3aX2LzQg7eKCeq29.jpg",
               "id": 1241,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Madlock",
               "gender": 2,
               "credit_id": "52fe45dfc3a36847f80df4ff",
               "name": "Samuel L. Jackson",
               "profile_path": "/AvCReLikjzYEf9XjTQxbv3JWgKT.jpg",
               "id": 2231,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Eggy",
               "gender": 2,
               "credit_id": "58a3e23592514157b20035d2",
               "name": "Charlie Murphy",
               "profile_path": "/emMzTjrwhrPr1m8gepw1bvqJb6A.jpg",
               "id": 17840,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Josh Flatbush",
               "gender": 2,
               "credit_id": "58a3e2729251415796003692",
               "name": "Nicholas Turturro",
               "profile_path": "/i9m7ox3KoSkqeKvyGqLHZovUN5Q.jpg",
               "id": 32897,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Butterbean Jones",
               "gender": 2,
               "credit_id": "58a3e29c92514157b200361b",
               "name": "Robin Harris",
               "profile_path": "/6SAO1qJ9Q5ZllDK0FJMYV1ZooND.jpg",
               "id": 15535,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Indigo",
               "gender": 1,
               "credit_id": "58a3e2ad92514157a50036fb",
               "name": "Joie Lee",
               "profile_path": "/oWREZ1vjXxycfdwV5wlDwqZnODo.jpg",
               "id": 13602,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Clarke Bentancourt",
               "gender": 1,
               "credit_id": "58a3e2c1c3a368393b0031e4",
               "name": "Cynda Williams",
               "profile_path": "/jSbrK4y3JSboIs8yEiomlIF0pwj.jpg",
               "id": 87117,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Impatient Movie Patron",
               "gender": 2,
               "credit_id": "58a3e2e7c3a368391a003840",
               "name": "Flavor Flav",
               "profile_path": "/2AuDg3jRQ7FzM5jvcrfAUdmvU2x.jpg",
               "id": 146253,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Bottom Hammer",
               "gender": 2,
               "credit_id": "598d3bf492514178b1007a81",
               "name": "Bill Nunn",
               "profile_path": "/dcZWC2iGjHasKwdYSwpHcWFQX5a.jpg",
               "id": 5502,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Big Stop Williams",
               "gender": 2,
               "credit_id": "598d3c1d92514178ec007902",
               "name": "Dick Anthony Williams",
               "profile_path": "/wibb1X9fvfiLADMFtfwuTb9UIUI.jpg",
               "id": 1911,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45dfc3a36847f80df4e1",
               "name": "Spike Lee",
               "profile_path": "/2LmTDMa6ewhkyP4LDBWFdDYDfUv.jpg",
               "id": 5281,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45dfc3a36847f80df4e7",
               "name": "Spike Lee",
               "profile_path": "/2LmTDMa6ewhkyP4LDBWFdDYDfUv.jpg",
               "id": 5281,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "57dd70cc9251417853000387",
               "name": "Ernest R. Dickerson",
               "profile_path": "/2plWyKruDXgk6GQI9ex8lieymoK.jpg",
               "id": 15521,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "59151e459251415723015ea0",
               "name": "Bill Lee",
               "profile_path": null,
               "id": 15520,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "598d3c4292514178b1007b99",
               "name": "Spike Lee",
               "profile_path": "/2LmTDMa6ewhkyP4LDBWFdDYDfUv.jpg",
               "id": 5281,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "598d3c5492514178a4008460",
               "name": "Samuel D. Pollard",
               "profile_path": null,
               "id": 18747,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 4.465272,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 41823,
      "vote_count": 66,
      "budget": 10000000,
      "overview": "Opens with Bleek as a child learning to play the trumpet, his friends want him to come out and play but mother insists he finish his lessons. Bleek grows into adulthood and forms his own band - The Bleek Gilliam Quartet. The story of Bleek's and Shadow's friendly rivalry on stage which spills into their professional relationship and threatens to tear apart the quartet.",
      "similar": [
         872,
         812,
         11224,
         38757,
         10530,
         224141,
         824,
         3933,
         11631,
         18947,
         194662,
         196867,
         11970,
         10020,
         41233,
         19404,
         254470,
         150689,
         114,
         703
      ],
      "original_title": "Mo' Better Blues",
      "runtime": 129,
      "poster_path": "/eF6mhJfx3CAHXcbbLKt8Knj0YSL.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "40 Acres & A Mule Filmworks",
            "id": 4319,
            "origin_country": ""
         },
         {
            "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
            "name": "Universal Pictures",
            "id": 33,
            "origin_country": "US"
         }
      ],
      "release_date": "1990-08-03",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Spike Lee"],
      "runtime": 129,
      "synopsis": "Brooklyn, New York 1969. A group of four boys walk up to Bleek Gilliam (Zakee L. Howze)'s brownstone rowhouse and ask him to come out and play baseball with them. Bleek's mother insists that he continue his trumpet lesson, to his chagrin. His father becomes concerned that Bleek will grow up to be a sissy, and a family argument ensues. In the end, Bleek continues playing his trumpet, and his friends go away. 20 years later. The adult Bleek Gilliam (Denzel Washington) is performing on the trumpet at a busy nightclub with his jazz band, The Bleek Quintet. They make up of trumpeter Bleek, saxphone player Shadow Henderson (Wesley Snipes), pianist Left Hand Lacey (Giancarlo Esposito), drummer Bottom Hammer (Bill Nunn), and bass player Rhythm Jones (Jeff \"Tain\" Watts). Giant (Spike Lee), whom is the Quintet's manager and one of Bleek's former childhood friends, is waiting in the wings, and advises him to stop allowing his saxophone player Shadow Henderson to grandstand with long solos. The next morning Bleek wakes up with his girlfriend, Indigo Downes (Joie Lee). She leaves to go to college classes, while he meets his father by the Brooklyn Bridge for a game of catch, telling him that while he does like Indigo, he likes other women too and is not ready to make a commitment. Later in the day while he is practicing his trumpet, another woman named Clarke Bentancourt (Cynda Williams) visits him. She suggests he fire Giant as his manager; he suggests that they make love (which he refers to as 'mo better'). She bites his lip and he becomes upset about it, saying, \"I make my living with my lips,\" as he examines the bleeding bottom lip. Giant is with his bookie, betting on baseball. Then he goes to the nightclub and argues with the doormen about what time to let the patrons into the club. He meets Bleek inside with the rest of the band, except for the pianist, Left Hand Lacey, who arrives late with his French girlfriend and is scolded by Giant. Later Giant goes to the club owners office, points out how busy the club has been since Bleek and his band began playing there, and unsuccessfully attempts to renegotiate their contract. The next morning, Giant meets his bookie (Ruben Blades), who is concerned that Giant is going too deep into debt. Giant shrugs it off, and places several new bets. He then stops off at Shadow's home to drop off a record. Shadow confides in him that he is cheating on his girlfriend. This leads to the next scene where Bleek is in bed with Clarke, and she asks him to let her sing a number at the club with his band, to which he declines. Bleek and Giant are fending off requests from the other members of the band, especially Shadow, for a raise due to the bands success at the club. Bleek goes to the club owners to see about more money, which they refuse, reminding him that it was Giant who locked him into the current deal. That night at the club, both Clarke and Indigo arrive at the club to see Bleek. They are wearing the same style dress, which Bleek had purchased for them both. Bleek attempts to work it out with each girl, but they are both upset with him over the dresses, and though he sleeps with them each again they leave him (after he calls each of them by the others' name). However, tension rises with Shadow, who has feelings for Clarke. Bleek and Giant go for a bike ride, where Bleek insists to Giant that he do a better job managing and bringing in money. Giant promises to do so, then asks Bleek for a loan to pay off his gambling debt. Bleek declines, and later Giant is apprehended by two loan sharks Madlock (Samuel L. Jackson) and Rod (Leonard L. Thomas) who demand payment. Giant can't pay and gets his fingers broken. Later Giant tells Bleek that he fell off his bike on the ride home, but Bleek does not believe him. Giant asks the other band members for money and Left loans him five hundred dollars. When loan sharks stake out Giant's home, he goes to Bleek for a place to stay. Bleek agrees to help him raise the money, but fires him as manager. Bleek misses both his girlfriends, leaving messages for each, but Clarke has begun a new relationship with Shadow. Bleek finds out about it, and fires Shadow from the band. The loan sharks track Giant down at the club before Bleek can come up with the money, take him outside and beat him while Bleek plays. Bleek goes outside to intervene, and gets beaten as well. Additionally, one loan shark (Madlock) takes Bleek's own trumpet, and smacks him across the face with it. This not only puts Bleek in the hospital, but it also permanently injures his lip, making him unable to continue playing trumpet. Months later, Bleek reunites with Giant, who has gotten a job as a doorman and stopped gambling. He drops into see Shadow and Clarke, who are now performing together with the rest of Bleek's former band. Shadow invites him on stage, and they play together. Bleek still has scars to his lips, and is unable to play correctly. He walks off the stage, gives his trumpet to Giant, and goes directly to Indigo's house. She is angry with him because she hasn't heard from him in over a year. She tries to reject him, but agrees to take him back when he begs her to save his life. A montage flashes through their wedding, the birth of their son, Miles (Jelani Asar Snipes), and Bleek teaching his son to play the trumpet. In the final scene of the movie, Miles (Arnold Cromer) is ten years old, and wants to go outside to play with his friends. Indigo wants him to finish practicing his trumpet lessons. However, Bleek relents and allows his son to leave and play. This final scene uses exactly the same dialogue as the (almost identical) opening scene, with changes only in the delivery of the dialogue leading to an alternate conclusion.",
      "writers": ["Spike Lee"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0100168/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNzA3MjExMDQ0Nl5BMl5BanBnXkFtZTcwNTExOTEyMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Denzel Washington, Spike Lee, Wesley Snipes | See full cast and crew »"],
      "reviews": [
         "After the commercial and critical success of \"Do The Right Thing,\" in which Lee announced his arrival as a major player, he choose to follow up his breakthrough with a more personal film. If you examine history, it seems all iconoclasts choose to do so after their first big success (\"The Conversation,\" \"Close Encounters Of The Third Kind,\" \"Talk Radio\"), and Lee decided to pay homage to what he's always referred to simply as \"the music.\" Set in then-present day 1990, \"Mo' Better Blues\" tells the tale of Denzel Washington as Bleek Gilliam, a selfish trumpeter who fronts his own jazz quintet in an upscale Brooklyn club. The strength of the film deals with Bleek juggling his loyalties. On the love side, Bleek is caught between two women; Clarke is a sexy bombshell in constant need of Bleek's attention who's too busy centering in on his music. She's also an aspiring singer hoping Bleek will give her a chance to shine. Bleek, obviously, does not want to share the spotlight. Indigo is a thoughtful schoolteacher who is not fragile with Bleek's tremendous ego but is careful with his somewhat callous heart. At work, Bleek is wrestling with a hungry band demanding pay raises given the success they're achieving at the \"Beneath The Underdog\" club. Clumsily working towards the band's raise is Giant, Bleek's lifelong friend and incompetent manager, who also has a considerable gambling problem. Bleek must decide whether to trust Giant or risk losing his band, while deciding how long he can keep up the game between Indigo and Clarke. This, simply, is one of my favorite Lee films. Thank God someone finally made a jazz film for the late 20th century, jazz had not received a proper modern makeover since 1961's \"Paris Blues.\" Lee creates a wonderful, intimate world set off by moody lighting in shades of red, yellow and blue. His camera and editing - which was spontaneous and lively in \"Do The Right Thing\" - is slow and deliberate here, carefully punctuated in all the right places. This film marked the debut of some of Lee's trademark camera moves, including the 'gliding sidewalk' dolly and his slow-spin-upward pans. Like his previous films, Lee is adept and balancing out scenes between comedy and drama. A lot of the 'band' scenes are engagingly funny, mostly guy talk with a spin of that \"cool daddy jazz vibe\" added. Lee is also skillful at making Bleek the antagonist of the film without rendering him completely unlikable. The \"Love Supreme\" montage ending seemed to stretch the film for longer than some would have liked, but I feel it was justified in order to illustrate the beauty and necessity of Bleek's redemption. Lee was also smart to reduce screen time given to the film's true protagonist, saxophonist Shadow Henderson (rendered with cool, suave sophistication by Wesley Snipes), in order to keep the audience focused on Bleek. You will also get a delicious sampling of great jazz in this film if you're a novice to such. Aside from the concert numbers written and performed by Branford Marsalis and the dreamy jazz score by Lee's father, Bill, there are great pieces by John Coltrane, Miles Davis and Dizzy Gillespie, among others. A cool, sexy film.",
         "One of Spike Lee's best, \"Mo Better Blues\" captures the atmosphere of jazz. The soundtrack flows with the acting like a song. Denzel Washington does a great job of portraying a jazzman's quest for perfection, while living in a \"real world\" full of problems. Being a musician myself, I appreciated the struggle Washington's character was going through. All of Spike Lee's trademark camera angles (which I've disliked in some of his movies) worked to perfection in this movie. Great music, good acting, and a solid plot. Recommend!",
         "When this was on TV the other night, I expected to stick out about two minutes of it. Being a follower of Tarantino, all I'd heard recently of Spike Lee was wholly negative. In addition, I know nothing of black culture and/or jazz. Imagine my surprise then when, two hours later, I found myself entirely intoxicated by the blend of atmosphere, empathy, humour and pure depth of character and relationship in this exceptional movie. Next up, I'm watching all his other movies... Quentin, make your peace!",
         "This is a very entertaining movie and it is underrated. The characters, story and music are captivating. However, I think part of the reason for the lower ratings is the the poor camera effects. Lee focuses in on characters at times, as though they are standing and talking to a camera by themselves in some sterile room, such that it actually cheapens the film. There is a real lack of realism to this technique - it reminds me of 1960's style TV shows like Batman. It gives a feel that they ran out of money and when they had to go back and re-shoot the scene, they did so on the cheap. A minority may find this unique or appealing, but no great movie or director will use this technique. The filming with multiple characters in the shot is generally very good. But, the movie could have been better without these flaws. The writing at times is exceptional. There are great lines, as well as very entertaining dialogue. The scenes between Denzel and Snipes are exude an extraordinary power and they offer an exceptional dynamic to the movie as a whole. The female characters are also very compelling. \"Clark\" (Cynda Williams) is extraordinarily attractive and the movement of the character through the course of the movie is well done. It is difficult not to be captivated by this film. The positive cultural dynamic it captures is one that Americans can only hope to be present. Yet, one gets the feeling that reality is closer to the darker elements the movie exposes. Yet, there is ultimately a very positive message of love, responsibility.",
         "Spike Lee's latest 'joint' is a jazz variation of 'She's Gotta Have It', with the genders reversed: maladjusted trumpeter Bleek Gilliam (Denzel Washington) juggles two lovers while indulging an almost neurotic addiction to his music. His compulsive behavior is, presumably, a consequence of strict childhood practice habits, but if all work and no play have made Bleek a dull boy, the same can't be said of the film itself: Lee's self-conscious homage to music and fatherhood suffers from a dizzy overabundance of distracting, Scorsese-influenced 'style'. The film has been criticized for its stereotypical supporting roles, but the primary characters are likewise only skin deep. Except for some early childhood Freudian motivation, Bleek remains more or less a cipher, and his contrived, fantasy redemption (after a series of false endings, each one more lame than the last) seems tacked on only to provide a neat, symmetrical resolution.",
         "In Spike Lee's fourth film, Denzel Washington proves early in his career that he is capable of being funny and romantic in a more modest film than Glory or Cry Freedom, the music is breezy and romantic and consistent, jazzy and colorful cinematography, and another characteristic Spike Lee touch, which is his gift for drawing from his actors stunningly realistic performances. In some ensemble scenes, the dialogue seems like improvisation. Maybe it is. Mo' Better Blues is a good, steady, effective drama, a portrait of a complex and overwrought musician and the indecision and jealousy that gradually eat away at his life, but it lacks the passion and brazen provocative nature of nearly all of Spike Lee's other films. The cast, once again, is brilliant. Denzel is very very very authentic, faithful, graphic, and lifelike. My brother is a jazz musician and I've met several of his fellow musicians. I'm seasoned when it comes to jazz musicians. Take my word for it, Denzel's performance is entirely true. Snipes is brilliantly, swaggeringly audacious. Joie Lee comprehensively draws our sympathy towards her sensitive, self-conscious character and away from the elegant and subtly compelling Cynda Williams. Spike Lee himself is one of the most compelling characters. Samuel L. Jackson entertains in one of his millions and billions of early bit roles. If I were to say, \"I'm in the mood for a Spike Lee joint,\" this would not be one of the first films I pick, but it's different and enthralling. I mean, it's directed by Spike Lee, so how can it not be?",
         "I really enjoyed this film. Everyone has a Bleek in his life: someone whose love of his life is all he knows, wants to know, etc. However, we always lose the love of our life for various reasons. Then, what do you do when the love of your life is suddenly taken from you? That is this film's theme. Bleek's only love was jazz music. Bleek's music was the only thing that mattered to him. Music overrode everything: an incompetent manager (who was his best friend), his lovers, and the contentment of his bandmates (the money issue which is related to having an incompetent manager). When Bleek lost the love of his life (watch the film to learn why), he was forced to make some hard choices about his life and face some unpleasant truths (something we've all had to do). I enjoyed the score and the jazz pieces included in this film (after all, Bleek played the trumpet). I really liked the cinematography in this film because the film showed the beauty of New York City - the brownstones, the Manhattan skyline (a brief glimpse), the Brooklyn Bridge, etc.",
         "\"Mo' Better Blues\" is Spike Lee's immediate follower of the unanimously acclaimed \"Do the Right Thing\". And if not 'Mo' Better' than the glorious predecessor, Lee still 'did the right thing' by tackling a less political subject and pay a beautiful tribute to jazz music through one of the most under-appreciated performances of the 90's: Denzel Washington as Bleek Gilliam, the trumpet player. \"Do the Right Thing\" also coincided with the year Washington won his first Oscar for his performance as the tormented Afro-American soldier questioning the value of his engagement with the Yankees. As Bleek, Washington not only shows a more light-hearted facet of his acting range, but also proves a unique ability to portray men driven by anger, selfishness but with enough pride and confidence to win our respect. His characters might be flawed but we understand them and the emotional pay-off is that they ultimately try to change, for the best, closing some fascinating characters' arcs, among which Bleek isn't an exception. Bleek is interesting because he crystallizes the curse of making constantly bad choices, and by 'bad' I mean 'tragic', even more because only the scope of a life highlight them. And \"Mo' Better Blues\" spans thirty years of Bleek's life so we have glimpses on the devastating effects of the most benign choices. It opens in 1969 when Bleek's friends urge him to come play softball, but it is trumpet which he must play, under his mother's tyrannic supervision. His father coerces her to let the boy be a boy, but he's too busy watching TV to be listened to. The kids finally leave, calling Bleek a 'sissy', Bleek resumes playing with much reluctance. The immediate ellipse endorses the mother's authoritarian education; Bleek became a handsome trumpet player with a way with women, leader of a quintet featuring Shadow Henderson (Wesley Snipes) the saxophone player, Bill Nunn in the bass and Giancarlo Esposito in the piano. What a great delight to watch all these actors joined interacting in the artist's room. The list would be incomplete without Spike Lee who plays Giant, an ironic name for the vertically challenged manager of the band. Anyway, life seems to smile to Bleek, but all the film's stylish shots can't hide behind the shadowy and smoothly designed atmosphere, the presages of an imminent downfall. \"Mo' Better Blues\" chronicles a series of bad choices made by a man not by lack of luck or intelligence, but because his ego and certitudes prevent him from realizing the harm he causes to his entourage, and ultimately, to himself. Bleek is too blinded by his leadership to understand that it might not last, especially with such a promising sax player, who proves his value every night through outstanding solos. He's too caught up by his friendship with Giant he lets him ruin the band's career. Giant is a gambler who makes the wrong bets, who fails to convince the club owners Moe and Josh Flatbush (John and Nicholas Turturro) to renegotiate the contract, and much more, who gets no respect because of his diminutive size. Not stupid or unlucky, but Bleek's tragedy is that his best friend is. Spike Lee perfectly plays Giant, the lovable loser. But Bleek is also the architect of his own demise, notably on the love department. He dates two women who couldn't have been more opposite: Cynda Williams as Clarke Bettencourt, a glamorous, light-skinned artist whose dream is to be Bleek's Muse and sing for him but she can't break the iced gate of his own ego forcing Bleek to turn the subject into a \"Mo'Better\" moment, a classy euphemism for sex. But it is interrupted when she accidentally bites Bleek's very tool of work: his lip, confirming the impossible junction of work and passion. But Clarke's pleas find echoes in Shadow and her character magnificently blooms when she sings a sweet ballad for Shadow's quartet (guess who misses?) and proves Bleek wrong. But his heart belongs to Indigo (Joie Lee), the less glamorous but more dedicated woman who patiently endures his rejections. We know they're meant for each other, but Bleek is still obsessed with Clarke's body, the highest in the hierarchy of beauty standards in the black community. Realistically, it's only when Bleek's career is over that he seeks Indigo's help, and she knows. Paying the highest price of being Giant's friend, his lip is permanently hurt by two loan sharks. By the way, the film tactfully avoids the ridiculous triumphant comeback cliché invited to join the band by Shadow, Bleek can't play correctly and leaves the stage \u0085 forever, the heart full of pain and humiliation. All he's got left is Indigo, and she only accepts after he begs her to ''save his life', which means that he finally triumphed over his own ego. Part choice, part luck, the film subtly parallels life with jazz music, which is one third- dedication, one third-inspiration and one-third improvisation, Bleek was too dedicated to himself to see how listening to the others could help him. I could relate to Bleek for I had my share of bad choices, for I'm still trusting my best friend to whom I owe many of the biggest problems I have (and he's still a friend) for even with my future wife, I kept lusting about other more voluptuous women, while I still know that she was the one. I remember an old man who hardly knew me but said \"there's something erroneous\" about me. Now, I knew what he meant and this is something I can also say about Bleek, hoping that, like him, my life will change positively. And the ending says it all when the exact opening scene is recreated, only this time, Bleek lets his son go play with his friend, probably realizing that one simple choice can have one hell of an effect on one's life, and not repeating the same mistakes is already a way to succeed.",
         "I was surprised how much I responded to this movie. I have worked as a jazz trumpet player, and I thought Spike Lee's presentation of the darker side of jazz was brilliant. I myself have had to address many of the problems faced by Denzel Washington's character in this movie, and I think it should be required viewing for aspiring jazz musicians. Why? Not because of the entertainment value, but because of the Truth value (with a capital \"T\".) Jazz Musicians are artists at the heart, and any good jazz musician has to deal with the necessary tension between the somewhat egotistical act of creating one's art, and the cold realities and consequences of sharing it with an audience. Denzel Washington did a good job of portraying the conflict between his character's narcissism and his relationships. Admittedly selfish, his character is eventually transformed in a powerful and realistic way. Reminiscent of William Blake's Songs of Innocence and Songs of Experience, Spike Lee has contributed to the popular lore and also to human understanding with this work. (And he also is a good actor!) To me the unique camera angles and choice of sets served to amplify the message of this movie, which transcends race. While I would have preferred a different ending, and I hated to watch the violence, I am forced to acknowledge the realism in the way this movie ends in a positive way. I believe I am a better person for having watched this movie.",
         "The film opens in 1969 with young Bleek practicing his trumpet (and showing no promise). His friends want him to come out and play, but his mother insists he practice, though his father would have let him go out. Bleek's practice paid off. He is a talented trumpeter as an adult with a talented if only moderately successful band. The music in this movie is wonderful, and the acting quite good (Denzel Washington and Wesley Snipes probably don't know how to play their instruments as wonderfully as what we could hear, but they faked it well). As usual, Spike Lee appears in the film. In this case he is the band's manager, who has a gambling problem. I liked Dick Anthony Williams as Bleek's father, and I liked Samuel L. Jackson at first, playing one of the bad guys. I was disappointed when he left so quickly, but when he came back he was so nasty I wished he hadn't come back at all. Other than the music, I didn't see much reason to feel entertained by this film. I'm not sure what this means, but the only two white men with lines came across as cartoon characters, in stark contrast to the well-played blacks. And there were two white women with lines, one a waitress who seemed intelligent enough based on her one or two lines, and the other a mixed-race French woman (who was supposed to be educated but didn't seem that way to me) the band members didn't seem to approve of their colleague dating. I don't mind, though, when Spike Lee addresses racism in his movies because he makes valid points. My purpose in watching a Spike Lee movie is to be educated rather than entertained. I think this film achieved that, but not as well as some others. *****************************SPOILER************************* Interestingly, the movie ends almost exactly the way it started, except Bleek is an adult whose son is practicing the trumpet, and this time the boy gets to go out and play with his friends. Nice touch."
      ],
      "genres": [
         "Drama",
         "Music",
         "Romance"
      ],
      "productionCompanies": [
         "Universal Pictures",
         "40 Acres & A Mule Filmworks"
      ],
      "summaries": [
         "Opens with Bleek as a child learning to play the trumpet, his friends want him to come out and play but mother insists he finish his lessons. Bleek grows into adulthood and forms his own band - The Bleek Gilliam Quartet. The story of Bleek's and Shadow's friendly rivalry on stage which spills into their professional relationship and threatens to tear apart the quartet.",
         "Jazz trumpeter Bleek Gilliam makes questionable decisions in his professional and romantic life."
      ],
      "budget": 10000000
   },
   "movielensId": 3425,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1990-08-03",
      "dvdReleaseDate": "2004-12-28",
      "directors": ["Spike Lee"],
      "runtime": 129,
      "movieId": 3425,
      "title": "Mo' Better Blues",
      "mpaa": "R",
      "actors": [
         "Denzel Washington",
         "Spike Lee",
         "Wesley Snipes",
         "Giancarlo Esposito",
         "John Turturro",
         "Samuel L. Jackson",
         "Charlie Murphy",
         "Nicholas Turturro",
         "Robin Harris",
         "Joie Lee",
         "Cynda Williams",
         "Flavor Flav",
         "Bill Nunn",
         "Dick Anthony Williams"
      ],
      "imdbMovieId": "0100168",
      "originalTitle": "Mo' Better Blues",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["io8Jw9BRRFY"],
      "plotSummary": "Opens with Bleek as a child learning to play the trumpet, his friends want him to come out and play but mother insists he finish his lessons. Bleek grows into adulthood and forms his own band - The Bleek Gilliam Quartet. The story of Bleek's and Shadow's friendly rivalry on stage which spills into their professional relationship and threatens to tear apart the quartet.",
      "tmdbMovieId": 41823,
      "avgRating": 3.28834,
      "releaseYear": "1990",
      "numRatings": 489,
      "posterPath": "/eF6mhJfx3CAHXcbbLKt8Knj0YSL.jpg"
   }
}