{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "escape",
            "id": 10685
         },
         {
            "name": "fish out of water",
            "id": 11860
         },
         {
            "name": "chrysler building",
            "id": 162632
         }
      ],
      "imdb_id": "tt0062824",
      "video": false,
      "title": "Coogan's Bluff",
      "recommendations": [
         14881,
         20187,
         11707,
         15393,
         31906,
         11916,
         17689,
         16969,
         27331,
         10651,
         8348,
         11901,
         14554,
         4929,
         8879,
         11589,
         20442,
         18264,
         11046,
         10724
      ],
      "backdrop_path": "/evKvNgzydY1e8LmnEpxhAO0272X.jpg",
      "revenue": 3110000,
      "reviews": [{
         "author": "talisencrw",
         "id": "5727c1e79251410387002fa9",
         "content": "Early American Clint Eastwood performances, as he was testing the cinematic waters after his huge success in Leone's highly influential 'The Man with No Name' trilogy of great spaghetti westerns, are such fun to watch, as he experiments and tries out different genres, deciding what direction he wants to take his career. There are such unexpected gems to behold, both acting and directing, like 'Two Mules for Sister Sara', 'Breezy', 'The Beguiled', 'Play Misty for Me', 'Where Eagles Dare' and this, where he plays the proverbial 'fish out of water', in way over his head, as a deputy sheriff from the sticks, having to find an escaped prisoner in the megalopolis of New York City, no less. The great variety of this time is such a cinematic luxury to peruse and discover for oneself. Mine came in the humongous '35 Years 35 Films', and there have been even larger compendiums more recently. They all offer fine value to the discerning cinephile.\r\n\r\nIt's great fun seeing Lee J. Cobb and Susan Clark (when she was really irresistible), and you can never go wrong with director Siegel, who, along with the aforementioned Leone, were the greatest influences on the American icon who at that time was blossoming into his own, the San Franciscan-born Eastwood. Definitely worth owning and rewatching.",
         "url": "https://www.themoviedb.org/review/5727c1e79251410387002fa9"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Coogan",
               "gender": 2,
               "credit_id": "52fe44f1c3a368484e03fa53",
               "name": "Clint Eastwood",
               "profile_path": "/n8h4ZHteFFXfmzUW6OEaPWanDnm.jpg",
               "id": 190,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Lt. McElroy",
               "gender": 2,
               "credit_id": "52fe44f1c3a368484e03fa57",
               "name": "Lee J. Cobb",
               "profile_path": "/535dOk8eUI97esLMunIXdG58jUu.jpg",
               "id": 5248,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Julie",
               "gender": 1,
               "credit_id": "52fe44f1c3a368484e03fa5b",
               "name": "Susan Clark",
               "profile_path": "/tQradyDXFaFWV1ZefFpwx3kr5Jm.jpg",
               "id": 40168,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Linny Raven",
               "gender": 1,
               "credit_id": "52fe44f1c3a368484e03fa5f",
               "name": "Tisha Sterling",
               "profile_path": "/dhSN1m1sopIAPEv8UIwlpyBNMRf.jpg",
               "id": 94774,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Ringerman",
               "gender": 2,
               "credit_id": "52fe44f1c3a368484e03fa63",
               "name": "Don Stroud",
               "profile_path": "/7jT8523HL3myVWDXPpNOqf9Ubp0.jpg",
               "id": 69494,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Sheriff McCrea",
               "gender": 2,
               "credit_id": "52fe44f1c3a368484e03fa67",
               "name": "Tom Tully",
               "profile_path": "/reBpi3E34yudxU7mxtiZBolJovi.jpg",
               "id": 19414,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Mrs. Ringerman",
               "gender": 1,
               "credit_id": "52fe44f1c3a368484e03fa8f",
               "name": "Betty Field",
               "profile_path": "/lqTpbIAThp7ChbHC3Pf914MMtul.jpg",
               "id": 13785,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Millie",
               "gender": 0,
               "credit_id": "52fe44f1c3a368484e03fa93",
               "name": "Melodie Johnson",
               "profile_path": null,
               "id": 123630,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Sgt. Jackson",
               "gender": 2,
               "credit_id": "52fe44f1c3a368484e03fa97",
               "name": "James Edwards",
               "profile_path": "/57hJbLy1mYXMcwYl3n13Tdpv0TW.jpg",
               "id": 3342,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Running Bear",
               "gender": 2,
               "credit_id": "52fe44f1c3a368484e03fa9b",
               "name": "Rudy Diaz",
               "profile_path": null,
               "id": 123631,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "Pushie",
               "gender": 2,
               "credit_id": "52fe44f1c3a368484e03fa9f",
               "name": "David Doyle",
               "profile_path": "/o5ugOCZoaqkz8tjLtGgYZ6PGth4.jpg",
               "id": 123632,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "Taxi Driver",
               "gender": 2,
               "credit_id": "52fe44f1c3a368484e03faa3",
               "name": "Louis Zorich",
               "profile_path": "/fgsvG0sXJNOrTBE35ldRaSBRzbI.jpg",
               "id": 73210,
               "order": 11
            },
            {
               "cast_id": 23,
               "character": "Big Red",
               "gender": 1,
               "credit_id": "52fe44f1c3a368484e03faa7",
               "name": "Meg Myles",
               "profile_path": "/vv9BDWoaJezstYSsaoSur3ifLEy.jpg",
               "id": 123633,
               "order": 12
            },
            {
               "cast_id": 24,
               "character": "Mrs. Fowler",
               "gender": 1,
               "credit_id": "52fe44f1c3a368484e03faab",
               "name": "Marjorie Bennett",
               "profile_path": "/cyY0ltPueaqENXEBnd0KWE5VHRd.jpg",
               "id": 97257,
               "order": 13
            },
            {
               "cast_id": 25,
               "character": "Young Hood",
               "gender": 2,
               "credit_id": "52fe44f1c3a368484e03faaf",
               "name": "Seymour Cassel",
               "profile_path": "/atWyQvsLNjmXP5dxsOiaf5Qg9j.jpg",
               "id": 5950,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44f1c3a368484e03fa3d",
               "name": "Don Siegel",
               "profile_path": "/vylrJ53CsYbxECA8c2CDEqkYKge.jpg",
               "id": 14773,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f1c3a368484e03fa43",
               "name": "Herman Miller",
               "profile_path": null,
               "id": 94773,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f1c3a368484e03fa49",
               "name": "Dean Riesner",
               "profile_path": null,
               "id": 14776,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f1c3a368484e03fa4f",
               "name": "Howard A. Rodman",
               "profile_path": null,
               "id": 65151,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f1c3a368484e03fa6d",
               "name": "Herman Miller",
               "profile_path": null,
               "id": 94773,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f1c3a368484e03fa73",
               "name": "Don Siegel",
               "profile_path": "/vylrJ53CsYbxECA8c2CDEqkYKge.jpg",
               "id": 14773,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f1c3a368484e03fa79",
               "name": "Lalo Schifrin",
               "profile_path": "/zYz8R5xJGdO4Rq2FrcagMoG1UxD.jpg",
               "id": 9217,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f1c3a368484e03fa7f",
               "name": "Bud Thackery",
               "profile_path": null,
               "id": 33960,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f1c3a368484e03fa85",
               "name": "Robert Surtees",
               "profile_path": "/6CuhH7m0KvjbR088xyaJurddfZH.jpg",
               "id": 10005,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f1c3a368484e03fa8b",
               "name": "Sam E. Waxman",
               "profile_path": null,
               "id": 123629,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 7.160473,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 26170,
      "vote_count": 96,
      "budget": 0,
      "overview": "Coogan (Clint Eastwood) an Arizona deputy sheriff goes to New York to pick up a prisoner. While escorting the prisoner to the airport he escapes and Coogan heads into the City to recapture him.",
      "similar": [
         5925,
         1701,
         1368,
         107846,
         10447,
         9654,
         5503,
         1369,
         1429,
         708,
         11412,
         76640,
         10061,
         2832,
         9291,
         5971,
         11327,
         10694,
         12437,
         6075
      ],
      "original_title": "Coogan's Bluff",
      "runtime": 93,
      "poster_path": "/3qesKb5OL4zzBRwc2GiQPOeGrib.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
            "name": "Universal Pictures",
            "id": 33,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Malpaso Productions",
            "id": 171,
            "origin_country": ""
         }
      ],
      "release_date": "1968-10-02",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "Before \"Dirty Harry\"... there was Coogan.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Don Siegel"],
      "runtime": 93,
      "synopsis": "There's a disruption in the activities of Sheriff Walt Coogan (Clint Eastwood) as a crack tracker and ladies' man when he is ordered as punishment to travel from his home state Arizona to extradite bail jumper Ringerman (Don Stroud) from jail in New York City. When Coogan arrives he is met by bureaucratic red tape because Ringerman is in the hospital recovering from a bad dose of LSD. Furthermore Coogan can get no cooperation from overworked Police Detective and department supervisor Lt. McElroy (Lee J. Cobb) who tells Coogan to wait for the autocratic machinery to function. Coogan takes matters into his own hands and breaks Ringerman out of the prison hospital but is waylaid by the criminal's associates, one of which is the lovely and elusive Linny Raven (Tisha Sterling) who knocks out the Arizona Sheriff and steals his gun. Lt. McElroy orders Coogan to leave town but the Sheriff has met lovely parole officer Julie (Susan Clark), a naïve case worker who is taken by Coogan's charms. Coogan discovers that Linny is one of Julie's patients and manages to track down the young girl which leads him to Ringerman.",
      "writers": [
         "Herman Miller",
         "Dean Riesner"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0062824/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTAzNTcyODI3MzZeQTJeQWpwZ15BbWU3MDM5NDA3MjE@._V1_SY317_CR9,0,214,317_AL_.jpg",
      "actors": ["Stars: Clint Eastwood, Lee J. Cobb, Susan Clark | See full cast and crew »"],
      "reviews": [
         "Coogan's Bluff ranks as one of my favorite Eastwood films. Partly because of the time period & location which the story takes place. It's an excellent period piece. Late 1960's New York city in all it's Glory. I live in NYC and it's was nice to see the Pan Am Building in the backdrop. It's now the Met Life building. The Pan Am building was also the location of the final scene where the helicopter takes off. The other reason I like this movie is that Eastwood is essentially playing Dirty Harry before Dirty Harry. Coogan is just like Harry Calahan without the 44. magnum. The story is solid but it's the locales and the situations that Coogan finds himself in that sell the movie. Who cares of it's dated? Of course it's dated but that's part of the experience. Actually most movies made more than 20 years ago (or less) are dated. If you look at it in the context of the time it was made then you'll enjoy it. Ignore the negative reviews and check it out.",
         "Clint Eastwood has always been one of the most career-savvy superstars of all time. Looking over his filmography, since his career breakthrough it is obvious he has never done a film strictly for the money and has solid reasons behind every film he has made. Even his worst films have a purpose: \"The Rookie,\" for instance, which most people would agree is a career low, was obviously made to satisfy the brass at Warner Bros. by delivering a modern-day Dirty Harry clone so he would be left alone to work on his Academy Award-winning classic \"Unforgiven,\" which came out two years later. So it is with \"Coogan's Bluff,\" which most viewers would probably dismiss as second-rate Eastwood, but in reality served as a savvy bridge from Westerns (the type of genre he was primarily known for at the time) into more modern day roles. As directed by his mentor Don Siegel, \"Coogan's Bluff\" actually opens in the Arizona desert, which strongly resembles the background of his spaghetti westerns. Indeed, the first character we see is a loincloth-attired man, who appears to be Indian, so the audience is tricked into thinking they're watching a western. Then, we see a jeep driving down a dirt road, with a stetson-wearing Clint at the wheel. He is Dept. Sheriff Coogan, and there we see our first view of Clint as a modern lawman. It isn't long before he's in New York City, chasing down an escaped extradited criminal (Don Stroud), romancing a beautiful parole officer (Susan Clark) and butting heads with a strong-willed police captain (Lee J.Cobb, a terrific, yet sadly forgotten character actor of the day). Therefore, in a matter of fifteen minutes, Siegel cleverly introduces Eastwood as a contemporary figure, a transition that will be complete when he returns to modern times three years later in his most famous role, \"Dirty Harry\" Callahan. But \"Coogan's Bluff\" is an enjoyable film on its own terms. Eastwood at times is very funny here--his retort to an unethical cab driver is priceless--and the film moves along at a brisk pace. Just don't expect action galore or a high body count. Clint doesn't kill anybody here; there's no broad conspiracy or mystery to solve; his job is simply to find the prisoner and take him home. In fact, the film is at its best when its dealing with Coogan as a fish-out-of-water, dealing with various New York thieves, crooks, drug dealers, hippies, and the aforementioned cab driver. There is, however, a well-choreographed fight scene in a bar and an exciting motorcycle chase for a climax, but that's as much action as there is. It's also pretty short for an Eastwood film: where most of his films run over two hours, this one clocks in at a brisk 94 minutes, next to \"Joe Kidd\" and \"The Dead Pool,\" one of his shortest adventures. So there you have it, a \"minor\" effort that served a \"major\" purpose in what has become an important Hollywood career. *** (out of *****)",
         "From the opening scenes to the end it's never boring, and often hilarious. Lee J. Cobb turns in a wonderfully wry performance, the young Susan Clark is hot as Julie the probation officer, and Tom Tully is perfect as the tough, no-nonsense Sheriff McCrea. Add to that the sights and sounds of the city in the late 1960's and the feel for the atmosphere of the times, and it's a wonderful way to spend an afternoon. I define the quality of a movie by how it makes me feel. And this one always makes me feel good. Watching Eastwood work as Deputy Sheriff Walt Coogan, with that cool Eastwood demeanor makes you realize just how hokey Dennis Weaver played the McCloud character in the TV series - while 'Coogan' inspired the series, the series certainly didn't outshine it. This one is a fun romp, and like all in the genre, not to be taken too seriously. Highly recommended.",
         "Even though not among his best-known thrillers, \"Coogan's bluff\" from 1968 is definitely a rather important and noteworthy movie in Clint Eastwood's long and esteemed career. It was his first cooperation with legendary Don Siegel who was stylishly working behind the camera. Eastwood was altogether the star of five movies Don Siegel directed and Siegel turned out to be one of the biggest mentors of him as a director. Secondly Clint was a very popular and noted western star back in the late 60's. He had just played the leading character, the nameless cowboy in Sergio Leone's praised and beloved Dollars trilogy but his career in a cop thriller genre and the splendid Dirty Harry series was still ahead. \"Coogan's bluff\" was an extremely interesting changing over from one genre to another. Eastwood played Sheriff Coogan and it was clearly a cowboy role, no doubt, but everything else around him, the big city with big city criminals, sleazy taxi drivers, hippies, prostitutes and so on weren't no longer from Coogan's world but rather from Harry Callahan's normal working day. \"Coogan's bluff\" is a terrific pre-Dirty Harry thriller classic and every Eastwood fan should watch it couple of hundred times. 9/10.",
         "Walt Coogan (Clint Eastwood) an Arizona deputy sheriff is sent to New York to collect a prisoner (Don Stroud). After learning that it might take a while before he can get his prisoner he decides to take it in own hands to bring him back, but while doing so he is jumped at the airport and the prisoner escapes. So now it's personal and he uses his western methods to recapture his man, but the city cops don't share his ways. Before they teamed up for the classic cop film \"Dirty Harry\" (1971) - Don Siegel directed Clint Eastwood in an earlier and under-appreciated cop drama \"Coogen's Bluff\". I came across this film only knowing that it starred Eastwood and that's about it. But to my surprise it had more to it than Eastwood's strong persona, but it was engaging and clever entertainment by director Don Siegel. What it generates is a violent and hard-hitting police story that has superb attention to detail and is particularly well crafted. There's so many things going for it that you may or may not notice all the small hints that the film possesses on the clash of two different cultures (city vs. western) and the protagonist being dragged into the wicked and dirty side of the hippie drug circuit. This is when he learns that he is out of his league and that he has to adapt to this city way off life to get his man, sometimes with dire consequences because he grows slowly attached to it. Add in some psychedelic overtones and a spaced out feel to evoke the carefree era. The whole setup is naturally staged and doesn't feel forced. Siegel seems to have a knack of creating a gritty mood, but also capturing the life of the unique surroundings, from the Arizona deserts (excellent opening sequence) to the harsh city life. This was helped by fluid camera-work with its high shots and smooth pans that are well staged. The location photography and dashing settings are two of the strong points of this production. Another is the rousing score that mixes some western tang into the equation. Throw in edgy and sharp dialogue, with also scathing humour and an abundance of Texas gags against our protagonist. Siegel's paces the film perfectly and generates tension in some well-designed action scenes, one being the bike chase scene through the park. Though, this film isn't overtly filled with just action and violence. It's an amusing watch with a set-up that has more to it! Eastwood gives an iconic cool-as-ice performance as the Texas, ah I mean Arizona deputy sheriff who adapts his hunting techniques for the big city and who's quick with a sharp reply. Lee J. Cobb is good as the arrogant Det. Lt. McElroy, NYPD who has no time for Coogan or his antics. Susan Clark plays Julie Roth a probation officer and possibly Coogan's love interest. A superb Don Stroud weaselly plays James Ringerman the criminal who Coogan's after and Tisha Sterling plays Ringerman's hippie girlfriend. There's also a small role by a feisty Betty Field as Mrs. Ellen Ringerman. Actually, it's hard to find one thing that I didn't actually like about the film. Highly recommended!",
         "The film borrows from the older city crime dramas adding a new twist, Eastwood's character, a police lieutenant from Arizona who will use any means to apprehend his prey. This film, shot on a relativley tight budget in New York City, captures the dark side of New York City in the late 60's, amidst the \"free love\" atmosphere. Particularly notable are the sharp fight sequences, the amazing sequence at the \"Pidgeon Toed Orange Peel\" dance club, and the chase sequence at the Cloisters. This film inspired the \"Dirty Harry\" series, and also paved the way for cowboy in the big city flicks such as \"Midnight Cowboy\" (and there are a few interesting resemblances). An overall exciting picture that should keep your interest.",
         "With less violence and the addition of a comical bent, \"Coogan's Bluff\" became the inspiration for the long running TV series \"McCloud\" starring Dennis Weaver. For director Don Siegal, it was, like the same year's \"Madigan,\" another early examination of the maverick police officer that would reach its zenith with 1971's \"Dirty Harry.\" For Eastwood, it's an interesting blend of the genre for which he was best known at the time--the western--and of the urban crime thrillers with which he would achieve superstardom. This one isn't as exciting as \"Dirty Harry,\" and the fish out of water theme (ala \"Mr. Deeds Goes to Town\") helps to excuse some of the more unpleasant aspects of the character's law and order at any cost mentality, but \"Coogan's Bluff\" has an abundance of smart-a** humor to make it memorable. Eastwood is very effectively cast, and it is to his credit that he was willing to play such an unlikable and offensive SOB at this relatively early stage of his big-screen career. (Can you imagine Gregory Peck in this role?)",
         "As the story begins, Coogan, an Arizona policeman, goes after a murderer that is wanted. The man is found on top of a rocky hill trying to shoot the cop that has come for him. Coogan, a no-nonsense laconic man, out smarts the bandit and goes back with the fugitive, but before that he makes a stop to visit a woman whose man is away from home. That sets the tone for the story, Coogan is one of those men that are secure in themselves with no attitude to speak of. The police chief in charge of Coogan, meanwhile, wants to send him on a mission to New York. He must pick up an escaped man now living in the Big Apple. Coogan, who is still sporting his western attire, sticks out like a sore thumb among the crowds of Manhattan. One thing for sure, he takes no bull crap from anyone, including the taxi driver that thinks he is so smart by going around in circles thinking his out of town passenger will not notice the way he is jacking up the price for the ride. What Coogan finds is a hostile police environment. Little does he know that to do things in New York, he must rethink what he is accustomed to do in Arizona. His meeting with Chief McElroy doesn't go too well. For starters, the man he has come to get, Ringerman, has been sent to Bellevue for observation. There he finds his man in the company of a girlfriend, Linny Raven, who will prove to be more dangerous than Coogan bargained for. He also finds a kindred soul in Julie, a woman who works with tough cases within the police department. Coogan's stay in New York will be marked by violence, but he is smart enough to deal with the situation and get what he came for. Don Siegel, a director who worked extensively in B pictures, is in charge of this production. Mr. Siegel, was an astute artist who always delivered, as he does with this 1968 film. He captures the essence of that generation like no one. Mr. Siegel was a master in these types of movies, as he clearly shows here. Clint Eastwood shows the making of the persona that he will later transfer to most of his work that followed. His Coogan was a man of a few words who believed in getting a job done, as quickly, and as neatly, as possible. His take on this character is what he did best. Lee J. Cobb, one of the great actors of stage, and screen, is at hand to portray Lt. McElroy, a man who knows how things worked in his territory. Also in minor roles, Susan Clark, the great Betty Field who appears as Ringerman's mother in one of the best sequences of the film. Tisha Sterling, Don Stroud and a young Seymour Cassel have some interesting moments. Lalo Schiffrin jazzy musical score worked well with the film as did the fine cinematography of Bud Thackery that photographed the Manhattan of those years with excellent flair. Don Siegel did a good job with his direction and made a film that is fun and packs some action as well.",
         "Coogan's Bluff marked the first of six films that Clint Eastwood was to do with director Don Siegel, the most famous of them being of course Dirty Harry. The film will also contain no shots of the former location of the legendary Polo Grounds which were at that spot on Manhattan island. Clint Eastwood's charisma is what carries this film through because he's playing one of the most dislikeable characters he ever essayed on the right side of the law. He's a deputy sheriff from Piute County, Arizona who has his own way of doing things. When we first meet him instead of following sheriff Tom Tully's orders and staying at a roadblock, Eastwood follows a hunch and captures fugitive Indian Rudy Diaz in the inimitable Clint fashion. That he got the man doesn't cut it with Tully. He sends Clint on assignment to New York to extradite Don Stroud wanted in Arizona. When he gets to New York, Stroud is in Bellevue Psych Ward. There are procedures to get him out says Police Lieutenant Lee J. Cobb, but Clint cuts through them and while Stroud's in custody, he effects an escape. Seduce them for clues is Eastwood's investigative technique as he works on parole officer Susan Clark and Stroud's girlfriend Tisha Sterling. Tisha proves to be a formidable adversary and bed partner, yes she's both. Tisha's pretty unforgettable as the amoral hippie chick from the era. Also unforgettable is Betty Field in what proved to be her final big screen role as Stroud's tramp of a mother. Clint doesn't quite have to get down and dirty with her, but I think he would have been up to it if needed. A lot of attitudes that were later exhibited in Dirty Harry are in Coogan's Bluff. Walt Coogan has the same attitude towards criminals and the rules that prevent him from dealing with them as he'd like. Some nice location shots of New York, including an unforgettable chase scene through Fort Tryon Park in the upper reaches of Manhattan. Not as good as some of Clint Eastwood's other films, still Coogan's Bluff is a must for his fans.",
         "At New York reaches \"Walt Coogan\" (Clint Eastwood), a sheriff of Arizona who pursues a dangerous murderer who has escaped his jurisdiction. \"Coogan\" used to using methods of his own a cowboy not of a policeman, collides with the methods used by agents of the big city. We are facing a urban western. This film marks a turning point in the race of Clint Eastwood to put in contact, for the first time, with Don Siegel, Here Eastwood starts to perform his figure of gallant, interpreting perfectly the role of seductive whenever the occasion required to achieve his ends other than the kind of character that starred in films of Sergio Leone. It is one of the most important moments in the life of a giant of cinema, Clint Eastwood. The meeting between the Eastwood and Don Siegel mark a before and after the artistic career of Clint Eastwood, both as an actor as in his subsequent race director. They shared a large amount of hobbies and passions. Among them their love for the film from director Sergio Leone, which Siegel had enjoyed through the screen and Eastwood had starred with great success. Perhaps that is why the film is a work of transition It has a delicious soundtrack for the maestro Lalo Schifrin that help at any time the narrative rhythm of the tape. We should also emphasize the good work as secondary to Lee J. Cobb giving life to the serious and quiet \"lieutenant McElroy\", and Susan Clark. It is not the best film of the five that both agreed but if served to the beginning of a great time to develop during the 1970 with \"Harry the dirty\" as a success and with the police cinema in the height of its history."
      ],
      "genres": [
         "Action",
         "Thriller"
      ],
      "productionCompanies": [
         "Universal Pictures",
         "Malpaso Company, The"
      ],
      "summaries": [
         "Coogan, an Arizona cop, is sent to New York to collect a prisoner. Everyone in New York assumes Coogan is from Texas, much to his annoyance. To add to Coogan's problems the prisoner isn't ready, so he decides to cut a few corners. In the process the prisoner escapes, and Coogan is ordered home. Too proud to return home empty handed, Coogan sets out into the big city to recapture his prisoner.",
         "Coogan's an Arizona deputy sheriff, who doesn't get along with his boss and doesn't exactly do things by the book, and also a little arrogant. Fed up with his rugged individualness, his boss sends him to New York to get a man who's waiting to extradited. Upon arriving everybody thinks he's just another bumpkin. When the New York Police Lieutenant tells him that his prisoner is still not ready to be transported, Coogan tries to be patient. But when he decides that he can't wait anymore, he tricks one of the attendants into releasing the prisoner and at the airport someone springs him. Coogan's boss is pleased that he has screwed up so bad, and orders him to return but Coogan feeling responsible or his ego has been bruised stays and tries to find despite being warn by the Lieutenant that he has no authority here.",
         "An Arizona deputy goes to New York City to escort a fugitive back into custody."
      ],
      "budget": 0
   },
   "movielensId": 3427,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1968-10-02",
      "dvdReleaseDate": "2004-06-01",
      "directors": ["Don Siegel"],
      "runtime": 93,
      "movieId": 3427,
      "title": "Coogan's Bluff",
      "mpaa": "R",
      "actors": [
         "Clint Eastwood",
         "Lee J. Cobb",
         "Susan Clark",
         "Tisha Sterling",
         "Don Stroud",
         "Tom Tully",
         "Betty Field",
         "Melodie Johnson",
         "James Edwards",
         "Rudy Diaz",
         "David Doyle",
         "Louis Zorich",
         "Meg Myles",
         "Marjorie Bennett",
         "Seymour Cassel"
      ],
      "imdbMovieId": "0062824",
      "originalTitle": "Coogan's Bluff",
      "genres": [
         "Action",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["erIn_2cVWp4"],
      "plotSummary": "Coogan (Clint Eastwood) an Arizona deputy sheriff goes to New York to pick up a prisoner. While escorting the prisoner to the airport he escapes and Coogan heads into the City to recapture him.",
      "tmdbMovieId": 26170,
      "avgRating": 3.26903,
      "releaseYear": "1968",
      "numRatings": 381,
      "posterPath": "/iE38YqtaiHI4TqAkaEwgpAjUWSJ.jpg"
   }
}