{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "friends",
            "id": 9713
         },
         {
            "name": "camp",
            "id": 11663
         },
         {
            "name": "summer",
            "id": 13088
         },
         {
            "name": "club",
            "id": 156801
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "summer school",
            "id": 208721
         }
      ],
      "imdb_id": "tt0112435",
      "video": false,
      "title": "The Baby-Sitters Club",
      "recommendations": [
         106143,
         18856,
         42580,
         17207,
         61418,
         12257,
         370071,
         83489,
         38554,
         47608,
         25697,
         40562,
         31220,
         12723,
         15992,
         41282,
         27141,
         12312,
         24736,
         26258
      ],
      "backdrop_path": "/qbXdpwGYpz0bgW5kTsbXaPwdIwX.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Kristy Thomas",
               "gender": 1,
               "credit_id": "52fe475dc3a36847f8131c33",
               "name": "Schuyler Fisk",
               "profile_path": "/5nQajFEGYNH8IeVhbWMKdF4lxu8.jpg",
               "id": 70852,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Stacey McGill",
               "gender": 1,
               "credit_id": "52fe475dc3a36847f8131c37",
               "name": "Bre Blair",
               "profile_path": "/7OYowPUAnhT8h2TaKtxqjX4ULN5.jpg",
               "id": 131934,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Mary Anne Spier",
               "gender": 1,
               "credit_id": "52fe475dc3a36847f8131c3b",
               "name": "Rachael Leigh Cook",
               "profile_path": "/cotGJui5H2Te2ThYERndc3DOVOm.jpg",
               "id": 38581,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Dawn Schafer",
               "gender": 1,
               "credit_id": "52fe475dc3a36847f8131c3f",
               "name": "Larisa Oleynik",
               "profile_path": "/qhRcTWcXykI29zsuEC4po563sJC.jpg",
               "id": 40978,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Jessi Ramsey",
               "gender": 1,
               "credit_id": "52fe475dc3a36847f8131c49",
               "name": "Zelda Harris",
               "profile_path": null,
               "id": 112037,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Rosie Wilder",
               "gender": 1,
               "credit_id": "52fe475dc3a36847f8131c4d",
               "name": "Vanessa Zima",
               "profile_path": "/lyd5C8ZVFtnZ1Diq0qgbuRVLvO9.jpg",
               "id": 130104,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Elizabeth Thomas Brewer",
               "gender": 1,
               "credit_id": "52fe475dc3a36847f8131c51",
               "name": "Brooke Adams",
               "profile_path": "/9LUExxYJTTkVEtnouKAEEG1QjLu.jpg",
               "id": 69054,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Watson Brewer",
               "gender": 2,
               "credit_id": "52fe475dc3a36847f8131c55",
               "name": "Bruce Davison",
               "profile_path": "/kYFBIffblcsbLMITDZYHhVf5c9f.jpg",
               "id": 52374,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Emily Haberman",
               "gender": 1,
               "credit_id": "52fe475dc3a36847f8131c59",
               "name": "Ellen Burstyn",
               "profile_path": "/kxWFljG3JjJMbOMCLm0SkrPQjhf.jpg",
               "id": 9560,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Logan Bruno",
               "gender": 2,
               "credit_id": "52fe475dc3a36847f8131c5d",
               "name": "Austin O'Brien",
               "profile_path": "/5K63RAJq6iwnOSM8ADpj9ARzIxq.jpg",
               "id": 58119,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Becca Ramsey",
               "gender": 1,
               "credit_id": "52fe475dc3a36847f8131c61",
               "name": "Kyla Pratt",
               "profile_path": "/4BGV47PlqqgCcVb7zSveNOFtqjc.jpg",
               "id": 31031,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Maureen McGill",
               "gender": 1,
               "credit_id": "52fe475dc3a36847f8131c65",
               "name": "Colleen Camp",
               "profile_path": "/3SbQnaC4SjykOIPDzrDlyIKzD9I.jpg",
               "id": 13023,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Patrick Thomas",
               "gender": 2,
               "credit_id": "53a7129b0e0a2614360041f1",
               "name": "Peter Horton",
               "profile_path": "/uq9ry9LRU2yn63LigCQFkB07CCY.jpg",
               "id": 44990,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Luca",
               "gender": 2,
               "credit_id": "53a712b40e0a2614360041f3",
               "name": "Christian Oliver",
               "profile_path": "/jziXtz3qCCOzYL9sEhyNHMel6xU.jpg",
               "id": 114034,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Lily",
               "gender": 1,
               "credit_id": "58cf098dc3a36850e9027743",
               "name": "Lily Costner",
               "profile_path": "/vsKFJHW0HM3IQzZIYhEVky8FIhQ.jpg",
               "id": 1780225,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe475dc3a36847f8131c45",
               "name": "Melanie Mayron",
               "profile_path": "/vFDm9CyXqbUBnbunSBVNlwuMrkY.jpg",
               "id": 83313,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "546e1d9dc3a36817e6000117",
               "name": "Dalene Young",
               "profile_path": null,
               "id": 942560,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 2.652912,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 48287,
      "vote_count": 31,
      "budget": 0,
      "overview": "It's the story about seven very different best friends, and one summer that will bring them together like never before.",
      "similar": [
         858,
         44683,
         19913,
         40807,
         862,
         141,
         634,
         13,
         137106,
         242224,
         41630,
         28178,
         68718,
         112160,
         394117,
         437557,
         8839,
         244264,
         17130,
         43923
      ],
      "original_title": "The Baby-Sitters Club",
      "runtime": 94,
      "poster_path": "/1Hbz9SWu98m4LsMPxfRNFIGKxuT.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Beacon Pictures",
            "id": 10157,
            "origin_country": ""
         },
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         }
      ],
      "release_date": "1995-08-18",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "Friends Forever",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Melanie Mayron"],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "Ann M. Martin",
         "Dalene Young"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0112435/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYwMjU1MzQ5MF5BMl5BanBnXkFtZTcwMDAwNDAwMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Schuyler Fisk, Bre Blair, Rachael Leigh Cook | See full cast and crew »"],
      "reviews": [
         "Ok, so the BSC movie is good - but it was, to me, a bit of a letdown. Now, it's possible that I don't remember the books as well as I would like to think I do. Five years since reading a BSC book can make a difference. The plot I had no complaints with; I remember there being a BSC book or two with similar storylines. It's the character development I didn't like. Some of the behavior, mostly Kristy's, seemed slightly off. On the other hand, I like the actors/actresses picked for the roles. I also missed some faves from the books (I always enjoyed Kristy's older brothers, whenever they showed up, and some of my favorite charges were missing.) but i know that not every character could be cast - finding ways to involve each one would result in an insanely long movie. Overall, it's cute. But I'll take the books any day.",
         "I really didn't know that Sissy Spacek(from Stephen King's Carrie), had a daughter till I looked up this movie last night as I was watching it. I loved and grew up with the Baby-sitters Club books. Every once in awhile I will stll watch this. It is about seven best friends who have a baby-sitter's club. During the summer the girls make a day camp for the kids, Kristy's father comes to town and doesn't want Kristy or MaryAnne, who was with Kristy the night she saw he was in town, didn't want them to tell anybody that he was in town. Kristy had to lie to her friends, didn't help Claudia with her science, or help that much with the camp. I do have a few complaints about this movie. 1. when the girls got to the Kishi's house the very first time, they knocked on the door. In the books, they went right in and up the stairs past Jeanne's room. Did anybody else catch that? 2. somebody already mentioned this but ROSEY SHOULD HAVE BEEN CHAROLETTE. Didn't the writers read the book before they made this movie? I thought the actress(well most of them) were so cute. The girl who played Stacey(april 3rd is her birthday like mine) is beautiful but i haven't seen her before. The girl who played the shy and sensitive MaryAnne was also a cutie but haven't seen her before. The girl who played Dawn,I've seen her in 10 things i hate about you. I can't believe how young she looked. I gave it a 10.",
         "When I first saw this movie, I wanted to run far, far away. The cheese! The corniness! The horror! But years later, I have come to appreciate it. Everyone who's familiar with the BSC will definitely watch this movie looking for any discrepancies from the series, and discrepancies abound. As for the actresses who play the Baby-Sitters? Well, one's wearing a wig, another is way older than the others, and one just seemed like a bad casting choice altogether. And as for the plot? Kristy's dad coming to town and everything involving that was a real downer. Plus, the Stacey/Luka thing (despite the fact that Luka is HOT!) was just WEIRD. The best parts in the movie were those involving the play group. What also saves this movie is its hidden talent(s) -- look for Kyla Pratt, Scarlett Pomers (\"I've been to the moon!\"), Larisa Oleynik, Rachael Leigh Cook, Marla Sokoloff, and Austin O'Brien. So all in all I've chosen to look past the cheese and realize that this movie is just a G-rated romp about friendship that really isn't a waste of your afternoon to watch. 7 stars out of 10.",
         "Okay, so maybe I am a 17-year-old guy now. That never stopped me from Liking The Baby-sitters Club and I only stopped reading the books because my mother didn't want me to. I still haven't popped out of the phase, and I occasionally go back to read the books. When I saw the movie appear, I wanted to go accompany a friend to see it (she was only 7). Anyhow, I missed my chance there and didn't get to see the film until it appeared on Showtime down here (a year after it was released on video). I still found it appealing. Mainly thanks to the park bench scene between Stacey, Luka and Rosie (I always thought Stacey was Charlotte Johanssen's favourite...) Basically the Club of the title is holding a playgroup (I now scare you by saying it sounds like book #7) except there is a perturbed neighbour who threatens the club, and Kristy's father demands that she spends more time with him while letting nobody else know of his existence in Stoneybrook. On top of that, Claudia has summer school, Mary Anne is the only person to know the truth about Kristy and Alan Gray (stupid jerky dweeb extraordinaire) is trying to date Dawn using tips from Logan. And diabetic Anastasia Elizabeth McGill is in love with a guy four years her senior. That's pretty much the books done for you",
         "I used to read the books when I was around nine years old so it was quite nostalgic moment for me catching this film one morning. Unlike the lacklustre series, this was quite a nice portrayal of the books and the child actors were able to bring the characters to life. The plot is easy enough to follow, even for those who have never read the books before, and the film would probably appeal very much to young girls who are at an age when they have a hundred best friends. But I don't think anyone older than twelve (with the exception of the teenage and twenty-something former fans of the book!) would be very interested other than to reminisce on that innocent, childish period when life revolved around homework, best friends and relishing in the freedom of the summer hols. One thing, however, that struck me while watching the film. It did remind me how ridiculous the whole concept of eleven- and thirteen-year-olds forming a babysitting group was. At that age, I'd be hiring a babysitter for *them* since they're as young as the kids they babysit!",
         "For some people who take their kids to see this movie, they say it's cute, and it is. But some of the acting was just poor. Sissy Spacek's daugter was all right, her best work was the scene at the rainy carnival. Larisa Olenik and Rachel Leigh Cook were my favorite. Ellen Burstyn even had a small role. But the other actresses were just poor. But the teen actors were good, like Austin O' Brien. I didn't read many of the books, but I watched the old series, and I'm not saying that it was better, but it was just like the movie.",
         "TBC is a riot a minute! I've never read the books, but I saw this movie when I was 13 and I was in love with all of the girls in it. The storylines in it are perfect for adolescents. The movie abstains from boredom with some entertaining and hilarious scenes and comments, and the overall cheesiness of the film is endearing in a way. The storyline between Luca and Stacey is magic, and very funny.(SPOILER) At the end of the film, she says that next summer she'll be 14, and he says, \"I know.\" It is absolutely gut-splitting fun. Watchable for all ages of movie fans, and afficionados of every genre and niche of movies. 8 out of 10.",
         "I think I would have loved this film if I were maybe eleven, but watching it now it's incredibly predictable, lame, dorky and boring, with trendy 90's boy-band soundtrack, obvious 90's fashions, mediocre acting and the things teen girls (and boys) face growing up, that they don't seem to realize isn't as important as they think. Kristy has a new step-family and still can't accept that her father doesn't speak to her. Stacey is struggling with her diabetes when she meets a boy older than her who she tries to have a relationship with. Dawn is in the \"I can make a difference\" teen activism phase, sort of a 90's hippie dork, and there are more in the group who I honestly don't care enough to recall. The group of girls are all babysitters, looked down on by the snobby rich girls. The summer changes everything, they each grow up a little faster than they expected when running a summer camp for their clients. Kristy learns that her beloved father isn't who he was when she was a baby, and Dawn learns that not all people are what they seem when she has to deal with a cranky neighbor. Stacey discovers that lying about your age to get a guy is no way to build a relationship, and that while her disease is annoying, she doesn't need to be ashamed of it. By the time summer ends it brings the club, and their new friends they've met over the summer, closer together. I wasn't a 90's teen, I don't know... were eleven-year-olds allowed to babysit at that time? I just don't see this film as very realistic; the few in the group who are old enough to fully understand how to tackle running a full-time summer camp are hardly present because they're busy doing other things in their lives. Dawn's character was extremely annoying; she would ramble on about the environment at the worst of times and was a pretty much useless waste of space. One positive, it was cool seeing Natanya Ross, who played the role of gloomy and depressed Robyn Russo in the Secret World of Alex Mack, pulling off a half-decent acting job in the minor role of the snobby girl Grace. Babysitter's Club is just a typical teen drama, but it lacks the humor that Madeline (1998) and Harriet the Spy (1996) both had. If you grew up reading the novels and want it for nostalgic value, you might enjoy it but it isn't the same as the books, it differs in many parts.",
         "My only knowledge of \"The Baby-Sitters Club\" book series was that I used to see it in the Scholastic ads when I was a kid. I have no idea how faithful this movie is to the books. I gotta admit I found myself mocking a lot of this movie, as it is definitely made from corn. But I remind myself that I am not part of the demographic this was made for and try to be fair. If you can suppress your grown-up cynicism for awhile, it's actually pretty cute. The girls are all fun to watch and seem to enjoy being in the movie. Marla Sokoloff is a great little villainess. Rachel Leigh Cook would go on to be the most famous of any of the Club girls. She's \"all that\" here, too. Some of the girls have little subplots. One girl has boy problems with the kid from Last Action Hero. The lead girl has daddy issues due to her absentee father showing back up. Another girl has diabetes and talks about it like it's leprosy and she's deathly afraid of telling her new Swiss boyfriend about it. He's a dork, by the way. But my favorite is the girl who is worried about flunking summer school and whines about it every chance she gets. Her friends reassure her that they will help her study and everything will be fine. This leads to the movie's highlight, a hilarious scene where the girls perform the most epic rap song ever to help her. It has to be seen to be believed. I found myself liking this movie more as it went on. It's easy to dismiss it as fluff, and I guess it is, but it's enjoyable fluff. The actors, young and old, are decent. The direction is a little flat and the whole thing kind of looks like a made-for-TV movie but I liked it anyway. I think little kids might like it most or perhaps people who grew up in the '90s and are nostalgic about it.",
         "The Baby-sitters Club series defined by childhood reading experience. I loved all of the characters and even got into the spin-off specials and series. As a baby-sitter my self and girly girl, these books were my favorite. I found out that there was a 1995 film years later, as a matter of fact right when I had passed my phase of reading the series. I was in a for a wonderful ride. It was an amazing series to see the characters I grew up with come to life in this film. I got to see the traits I loved and hated about them in a movie setting. The movie draws on so many emotions as it makes you laugh, cry, and feel tender. When I return to this movie as a young woman, it makes me feel so nostalgic and get more out of it than as a child. It explores friendship, family conflict, coming of age, and so much more. I recommend it to anyone who has read the books."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Family"
      ],
      "productionCompanies": [
         "Beacon Communications",
         "Columbia Pictures Corporation",
         "Scholastic Productions"
      ],
      "summaries": [
         "Based on the bestselling book series about seven friends whose babysitting business leads to one adventure after another. When tomboy Kristy, president of the club, has a brilliant idea to run a summer day camp, the girls all agree it's the perfect way to spend their summer--together! But life gets complicated as budding romance, family problems and a trio of scheming snobs all conspire to ruin the club. The BSC gang learn for themselves the amazing power of friendship.",
         "A group of friends in junior high decide to start a summer camp for the kids they babysit. However, their plans are constantly changed by complaining neighbors, school rivals, and the ususual growing pains - from passing summer school to dating to reconnecting a relationship with an absentee father.",
         "Seven junior-high-school girls organize a daycare camp for children while at the same time experiencing classic adolescent growing pains."
      ],
      "budget": 0
   },
   "movielensId": 343,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-08-18",
      "dvdReleaseDate": "2003-09-16",
      "directors": ["Melanie Mayron"],
      "runtime": 94,
      "movieId": 343,
      "title": "The Baby-Sitters Club",
      "mpaa": "PG",
      "actors": [
         "Schuyler Fisk",
         "Bre Blair",
         "Rachael Leigh Cook",
         "Larisa Oleynik",
         "Zelda Harris",
         "Vanessa Zima",
         "Brooke Adams",
         "Bruce Davison",
         "Ellen Burstyn",
         "Austin O'Brien",
         "Kyla Pratt",
         "Colleen Camp",
         "Peter Horton",
         "Christian Oliver",
         "Lily Costner"
      ],
      "imdbMovieId": "0112435",
      "originalTitle": "The Baby-Sitters Club",
      "genres": [
         "Comedy",
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": ["zBmEySbwGsk"],
      "plotSummary": "It's the story about seven very different best friends, and one summer that will bring them together like never before.",
      "tmdbMovieId": 48287,
      "avgRating": 2.66436,
      "releaseYear": "1995",
      "numRatings": 1010,
      "posterPath": "/1Hbz9SWu98m4LsMPxfRNFIGKxuT.jpg"
   }
}