{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "new york",
            "id": 242
         },
         {
            "name": "taxi",
            "id": 444
         },
         {
            "name": "fight",
            "id": 1721
         },
         {
            "name": "architect",
            "id": 2301
         },
         {
            "name": "police",
            "id": 6149
         },
         {
            "name": "vigilante",
            "id": 7002
         }
      ],
      "imdb_id": "tt0071402",
      "video": false,
      "title": "Death Wish",
      "recommendations": [
         14373,
         24873,
         26263,
         34746,
         19403,
         5916,
         26173,
         22094,
         11484,
         16113,
         15393,
         10651,
         10649,
         15417,
         13154,
         10648,
         8333,
         10650,
         10126,
         17814
      ],
      "backdrop_path": "/kIPE9R2pEOl6SpZN2IzUe0eG3ut.jpg",
      "revenue": 22000000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Paul Kersey",
               "gender": 2,
               "credit_id": "52fe45b79251416c7505ff3f",
               "name": "Charles Bronson",
               "profile_path": "/hxZR2w0LXX47VKtxibDyZDsTAkH.jpg",
               "id": 4960,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Joanna Kersey",
               "gender": 1,
               "credit_id": "52fe45b79251416c7505ff43",
               "name": "Hope Lange",
               "profile_path": "/pkUVlKHmajjgH26t7qe1PyBaF4i.jpg",
               "id": 3382,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Det. Frank Ochoa",
               "gender": 2,
               "credit_id": "52fe45b79251416c7505ff47",
               "name": "Vincent Gardenia",
               "profile_path": "/o57oXN3dTxdKAXNttmRjfEWXp57.jpg",
               "id": 14830,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Jack Toby",
               "gender": 2,
               "credit_id": "52fe45b79251416c7505ff4b",
               "name": "Steven Keats",
               "profile_path": "/ga9VT6E6PzsxLvU4oHFu3v1IiSB.jpg",
               "id": 76019,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Sam Kreutzer",
               "gender": 2,
               "credit_id": "52fe45b79251416c7505ff4f",
               "name": "William Redfield",
               "profile_path": "/5Tk02lfq65M4GT4lfCCfSais2Qg.jpg",
               "id": 7072,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Ames Jainchill",
               "gender": 2,
               "credit_id": "52fe45b79251416c7505ff53",
               "name": "Stuart Margolin",
               "profile_path": "/aPY5PDrURHBlZv45XXCvrijmjsx.jpg",
               "id": 41406,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Police Commissioner",
               "gender": 2,
               "credit_id": "52fe45b79251416c7505ff57",
               "name": "Stephen Elliott",
               "profile_path": "/uOZD5RzLjLtDSotOqKB3FPeznBx.jpg",
               "id": 786,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Carol Toby",
               "gender": 1,
               "credit_id": "52fe45b79251416c7505ff5b",
               "name": "Kathleen Tolan",
               "profile_path": null,
               "id": 76020,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Young Thug",
               "gender": 2,
               "credit_id": "52fe45b79251416c7505ff71",
               "name": "Jeff Goldblum",
               "profile_path": "/t812WlNdP6F2ksRj21JF68DUiwz.jpg",
               "id": 4785,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Joe Charles",
               "gender": 0,
               "credit_id": "5689ac359251417c0600069a",
               "name": "Robert Kya-Hill",
               "profile_path": "/m74YUR1VnsC8La9OXZnvFS3pPhx.jpg",
               "id": 584096,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Receptionist",
               "gender": 1,
               "credit_id": "5a02f34c92514111f9015e43",
               "name": "Marcia Jean Kurtz",
               "profile_path": "/lzmW0hnVyyRUkU0tjtFvlfViG9K.jpg",
               "id": 14548,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45b79251416c7505ff2f",
               "name": "Michael Winner",
               "profile_path": "/jZix6y5rPSromAWQe0o774eqqa.jpg",
               "id": 19244,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45b79251416c7505ff35",
               "name": "Hal Landers",
               "profile_path": null,
               "id": 76017,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45b79251416c7505ff3b",
               "name": "Bobby Roberts",
               "profile_path": null,
               "id": 76018,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45b79251416c7505ff61",
               "name": "Herbie Hancock",
               "profile_path": "/hiYIvYhh7jnU2O5RLLdTEVv1a1l.jpg",
               "id": 15193,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45b79251416c7505ff67",
               "name": "Brian Garfield",
               "profile_path": null,
               "id": 70645,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe45b79251416c7505ff6d",
               "name": "Wendell Mayes",
               "profile_path": null,
               "id": 844,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5971463cc3a36813d70019cb",
               "name": "Bernard Gribble",
               "profile_path": null,
               "id": 20954,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "59714636c3a3687c05002525",
               "name": "Arthur J. Ornitz",
               "profile_path": null,
               "id": 31501,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 6.919822,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 13939,
      "vote_count": 212,
      "budget": 3000000,
      "overview": "After his wife is murdered by street punks, a pacifistic New York City architect becomes a one-man vigilante squad, prowling the streets for would-be muggers after dark.",
      "similar": [
         4771,
         2142,
         1266,
         10651,
         11423,
         26390,
         1572,
         96,
         101,
         75780,
         156022,
         281,
         681,
         395834,
         3580,
         305943,
         193893,
         868,
         445954,
         984
      ],
      "original_title": "Death Wish",
      "runtime": 93,
      "poster_path": "/n0MJPBLSCtt7DBYZGFsOfQkZCWt.jpg",
      "spoken_languages": [
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1974-07-24",
      "vote_average": 6.9,
      "belongs_to_collection": {
         "backdrop_path": "/m3K7AXN8Wi6VIRtVlpF1E6nzEn1.jpg",
         "name": "Death Wish Collection",
         "id": 14377,
         "poster_path": "/3mC5lppASzZHx5IlmFSL6cPQpCP.jpg"
      },
      "tagline": "Vigilante, city style -- Judge, Jury, and Executioner",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Michael Winner"],
      "runtime": 93,
      "synopsis": "Paul Kersey (Charles Bronson) and his wife Joanna (Hope Lange) vacation in Hawaii. They return to New York City, where Paul works as an architect. Joanna and their daughter Carol Anne (Kathleen Tolan) shop for groceries at D'Agostino's. Three hooligans (one played by Jeff Goldblum) are wreaking havoc in the supermarket. They catch Joanna's address after she asks that her groceries be delivered. They follow her to the apartment, burst in and trash the apartment. They search for money but find only $7. The hooligans then rape Carol and savagely beat Joanna, escaping scot-free. Paul's son-in-law Jack Toby (Steven Keats) calls to tell him only that Joanna and Carol are in the hospital. After waiting impatiently, Paul is told by a doctor that his daughter is okay and that she was sedated and put to bed, but his wife has died. Devastated, he is told by police that the likelihood of catching the criminals is small since his wife is dead and his daughter, the only witness, traumatized from her ordeal of being raped, cannot speak. That night, a frustrated Paul goes out for a walk and quickly encounters a mugger who attempts to rob him with a gun. Carrying a sock full of quarters, Paul swings it at the would-be-mugger and flees, narrowly escaping from being shot. The next day, Paul's boss gives him an extended business vacation to Tucson, Arizona to meet a client, Ames Jainchill (Stuart Margolin), who shows him the ropes. Paul witnesses a mock gunfight at Old Tucson, a reconstructed Western frontier town used as a movie set. At a gun club, Ames is impressed when Paul shoots near bulls-eye accuracy. He reveals that he was a \"CO\" (conscientious objector) during the Korean War who served his country as a combat medic. Ames drops him at the airport, slipping a little going-away present into Paul's bag. Back in New York, Paul visits Jack who tells him that his daughter is catatonic and will likely never recover. At home, Paul opens his suitcase and the gift box that Ames left him to find a nickel-plated .32 Colt Police Positive revolver. He pockets the gun and takes a stroll that night. While walking alone in Riverside Park, Paul almost immediately encounters a mugger, a doped-up ex-convict named Thomas Leroy Marston who attempts to rob him at gunpoint with a .38 Smith & Wesson Model 36 revolver. Paul shoots him with his own revolver, killing him. Shocked that he just killed a human being, Paul runs home and throws up. But his vigilantism continues the following night, when he guns down three black men (one with an afro is played by an uncredited Denzel Washington) who are robbing a defenseless old man in a vacant alley. A few nights later, two muggers see Paul on a subway, holding a bag of groceries. They attempt to rob him at knife-point but Paul shoots them both with the revolver. Paul again gets away. Another night later, Paul is sitting in a sleazy 8th Avenue coffee shop surrounded by prostitutes and assorted street people. He pays his bill to the cashier purposely revealing a wallet full of cash. He leaves followed by two black thugs, named George and Joseph, who have taken the bait. Yet again a robbery attempt is made in a subway tunnel. Paul shoots one but the other manages to stab him in his shoulder before he gets shot as well. As a wounded Paul stumbles off, the one who stabbed him gets away mortally wounded, dying at a hospital. Police Lt. Frank Ochoa (Vincent Gardenia) investigates the vigilante killings. His department narrows a list to men who have had a family member recently killed by muggers and who are war veterans. The public, meanwhile, is happy that somebody is doing something about crime. Lt. Ochoa soon suspects Paul. He is about to make an arrest when the District Attorney (Fred J. Scollay) intervenes and tells Ochoa to \"let him loose\" in another city instead. Ochoa doesn't like the idea, but relents. In the meantime, Paul has his daughter committed to a mental hospital in upstate New Hampshire where she will remain catatonic, possibly for life. After returning to New York, Paul hides his .32 gun in a hidden drawer in his office while adjusting (and possibly enjoying) committing murder against muggers to \"clean up the city\". When Paul invites Jack over for dinner, Jack cannot understand Paul's sudden and happy mood. (Note: The three muggers who murdered Paul's wife and assaulted his daughter are never seen again in the movie, so their fate is left ambiguous. Since Paul was not present during their attack, it is implied that Paul only targets random muggers to vent his frustration at not being able to find the ones who assaulted his family.) One evening, Lt. Ochoa anonymously phones Paul at his office to tip him off that the police are watching him, hoping to provoke a reaction or slip up from Paul. When Paul is briefly detained by the police after leaving his office, they do not find any gun on him and allow him to continue on his way. Aware that the police are starting to catch on to him, Paul gives them the slip by sneaking out of his apartment building through a backdoor service entrance. He goes to his office to retrieve his gun and then goes out looking for more would-be muggers where he is confronted by three street gang members in Central Park who try to mug him. Paul shoots two of them before he is wounded in his right leg by a third mugger who is armed with a .45 caliber M1911A1 pistol. The third mugger flees as Paul attempts to take aim at him, only to fall to the ground. Hospitalized, Paul is confronted by Ochoa after a sympathetic policeman finds Paul's revolver near the latest crime scene and gives it to the detective. Ochoa makes Paul promise to leave New York, permanently in exchange to avoid prosecution for the vigilante killings. Paul replies, \"By sundown?\" In the final scene, set one week later. Paul arrives in Chicago Union Station by train. Being greeted by a company representative, he notices a group of hoodlums harassing a woman. He excuses himself and helps the woman. The hoodlums make obscene gestures, but Kersey points his right hand like a gun and smiles... suggesting that his vigilantism will resume sooner or later.",
      "writers": [
         "Brian Garfield",
         "Wendell Mayes"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0071402/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTAxNDUxODAyNjFeQTJeQWpwZ15BbWU3MDUzMzM3MTE@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Charles Bronson, Hope Lange, Vincent Gardenia | See full cast and crew »"],
      "reviews": [
         "Perhaps \"Death Wish\" is unquestionably the best vigilante film ever made. It's not the action-packed thrill-fest that movies like \"Kill Bill\" or \"The Punisher\" seek to be, instead it's a haunting, sometimes intoxicating look at our society's views on justice. Charles Bronson is Paul Kersey, a New York architect whose wife is killed by a group of muggers ransacking their apartment, an attack that also leaves his daughter catatonic. The killers are never caught, and Kersey is left shattered. He takes a job working for a land developer in New Mexico to get his mind off his troubles, and while there his long dormant fascination with guns is renewed when his client Ames Jainchill (Stuart Margolin) shows off his personal collection and lets him crack some shots off. He also witnesses a live reenactment of an Old West shootout, where frontier justice was administered at the end of the gun. Kersey soon arrives back in New York, livened up a bit from his visit and ready to resume his life. But the streets are still filled with thugs, and Kersey knows that Manhattan is not the best place to be at night. He discovers that Jainchill has given him a .32 revolver as a present, and subsequently uses it to kill a man trying to mug him. Kersey soon realizes the cathartic release of enacting vigilante revenge as the media reports his killings and other private citizens take action, all while police officer Frank Ochoa (Vincent Gardenia) leads a task force to capture the vigilante and stop future violence. \"Death Wish\" was a product of its day -- a Nixon-era knee jerk reaction to rampant crime that turned out to be quite a hit. But to dismiss it simply as that would be to deny the film its true power. It asks the question of whether or not vigilantism can be used as a social good, and just how can a citizen properly defend himself from criminal attacks. More importantly, to the movie's credit it does introduce the downside of vigilantism, with Ochoa worrying that people will be whipped into such a frenzy that they'll start attacking anyone who looks suspicious. The movie does play it safe when it comes to Kersey's \"victims\" however. Every one of them is clearly a mugger, threatening his life or just wanting his money. But the movie does enter into ambiguous territory by looking at the actual actions Kersey takes. At first he just stumbles into traps set up by muggers or happens on a crime taking place; later on the other hand it's clear that he's actually inviting attacks by making himself a target. And the self-defense aspect of his actions becomes equally cloudy when he kills muggers that are already fleeing. He wants to punish them for their crimes, which itself can be morally troubling. But to understand \"Death Wish\" you had to understand the times. Murder rates were very high in New York City, and many muggers had little problem killing their victims. The criminals in the film are not overly sympathetic either, most of them clearly hippies or other social undesirables, probably hooked on drugs from their \"free love\" days and now stuck in the bitter reality of narcotic dependency now that the good times are over. It's hard to feel sorry for someone willing to kill you just for a couple hours worth of pleasure. I'm sure the movie's audiences in New York, and probably across the country, enjoyed living out their revenge fantasies vicariously through Kersey. It should be said that Bronson, normally criticized as a wooden actor, gives a remarkably strong performance. This may be due to his friendship with director Michael Winner, who also helmed several of his other films. But it's probably due to the fact that the movie was not written as an action hero vehicle, and because of this the story demanded a character more grounded in reality. Kersey is not a superhero -- he's just one man trying to make a difference in the world. Also, he's not all there, either. The movie makes it clear that Kersey is a little deranged as well, and one wonders just how far he might go to do what he thinks is right. The sequels were more interested in making him out to be an infallible crusader against evil, abandoning any pretext of social commentary and just offering body counts, but here at least the movie shows that someone willing to go on a shooting spree isn't quite right in the head, regardless of the guilt of his victims. Supporting roles are excellent as well. A very young Jeff Goldblum nails his performance as one of the muggers who invades Kersey's apartment, immediately scary and repellent. Gardenia is a nice foil for Bronson, making Ochoa an intelligent officer not unsympathetic to Kersey's crusade, especially when he sees how the crime rate plummets following the killings. Christopher Guest, who would go on to star in hit mockumentaries like \"This is Spinal Tap,\" \"Best in Show\" and \"A Mighty Wind\" has a small but memorable role as a police officer towards the end of the movie. In fact, everyone does a good job. Ultimately, your enjoyment of \"Death Wish\" will probably rely both on your politics and views toward crime. It's a movie where the critic is judged based on his review, which is just as well I suppose. It's at once fascinating, and still very timely. Nine out of ten stars. Bronson's best solo movie and certainly a very thought-provoking piece, which is lost on both people who only want to watch it for the mugger killings and those who just dismiss it a fascist trash.",
         "Michael Winner's provocative film is slightly more intelligent and much more insidious than Richard Fleisher's 'Mr.Majestyk.' Charles Bronson is a Manhattan middle-aged architect who was at work's one day, when three brutal punks invade his Riverside Drive apartment and attack his loving wife and happily wed daughter... The wife was beating to death and the daughter savagely sexually assaulted, and sent traumatized into a near-vegetable state... To escape the oppressive urban environment, Bronson goes to Tucson, Arizona on business, and gets the gun code of the Old West imprinted on his mind... He was given a .32 pistol as a going away present by a gun-loving millionaire... Back in New York, Bronson carries one night his gift, and kills the first mugger who was molesting him... The first one was the hardest! Then he discovers he likes it... He begins deliberately to tempt muggers, whether in an alley, on a subway train, or in a park... and that he mechanically guns them down... The police couldn't identify him... This made him the 'avenging angel,' a true phantom 'one-man crusade.' In the eyes of the public, Bronson became a national figure\u0097the vigilante... The authorities were worried sick about the example he was setting... His actions seemed to be giving others new attitudes toward crime in the streets... When Inspector Ochoa (Vincent Gardenia) identifies the mysterious vigilante, he was immediately ordered to scare him off... The police commissioner asks him to quit, to desist, to go away, to stop! If you have never seen Bronson in action by sundown, 'Death Wish' is the one to see... Final comment: Rarely have I found myself so caught between my own gut reactions and intellectual reservations... I wish (with many here) to touch an exposed nerve in fearful Mexico, particularly of its muggers, thugs, kidnappers, and rapists, who (as in this film) could be easily eliminated if every upright, middle-class, middle-aged citizen got himself a weapon and used it at least one time a week... We are tired of being frightened, endangered and ripped-off daily... If the law is fighting a losing battle against the criminal element and can't protect innocent people, then maybe someone else should... It is very important that we know how to protect ourselves within the law...",
         "I guess by now you could call this movie a \"classic.\" It would meet most definitions. It was so popular that it spawned a number of sequels, but they just got dumb and dumber. This is one of the most famous \"revenge\" movies ever made and still stands up today. This was a very, very simple story and it panders to our base instincts which is probably why it was so successful. Most people want justice, and they want it now....which is what this movie preaches. At the time, the movie was shocking. If it came out today, it wouldn't have nearly the impact. However, the early scene of the mother and daughter raped and killed is still horrifying. That will never change. The story then slows down as we see the transformation of the husband, from conscientious objector to vigilante. When Charles Bronson hits the streets, the film picks up big-time. The movie also ends on a very satisfying note.",
         "Charles Bronson was already a major movie star in 1974 in Europe and a top action actor in the USA but it was \"Death Wish\" released that year that made him the super star that he became. What's so unusual is that in the movie \"Death Wish\" he played a man who was a pacifist all of his life, he served in the Korean War as a conscientious objector, who then turned into the vigilante executioner! A role which Bronson has become known for and identified with more then any of the scores of actions roles that he made during his long film career. Bronson as well as director Michael Winner and writer Brian Garfield touched a raw nerve in \"Death Wish\" with the American people in big cities under siege like no other movie ever did before and, now some 30 years later, after. Since \"Death Wish\" there must have been made over a hundred films with it's theme but none had the impact that \"Death Wish\" with Charles Bronson had. A group of tugs get Joanna Kersey's, Hope Lange, address from a delivery slip of a local grocery store and acting as if their delivering her groceries break into Joanna's apartment and savagely attack her and beat and rape her daughter Carol, Kathleen Tolan. Paul Kersey, Charles Bronson, comes home to learn that his wife and daughter are in the hospital rushes over to see how they are. Kersey finds out that his wife is dead and his daughter is mentally destroyed and needs to be institutionalized for life. The whole world around Paul Kersey falls apart like a house of cards and he's left alone with everything that he loved dead or as good as dead. Some time later going to Arizona to do his job as a land developer for his firm in NYC he's given a .32 handgun as a gift by the person that he worked for Ames Janichill, Stuart Margolis, for the great job that he did for him. One night back home in New York City taking a stroll in the park with the gun on him Kersey is accosted by a local junkie who pulls a handgun on him but Kersey draws first and shoots and kills him. Sick at first over what he did, killed a human being, Kersey like a wild beast from the jungle tasting blood for the fist time begins to roam the streets of New York at night for prey. A vengeful Kersey goes out looking for criminals to put out of commission, like those who killed and raped his wife and daughter, as some kind of revenge and retribution against them. In the process Kersey puts the criminals of the city of New York into a state of absolute terror and panic. In his guerrilla-like actions Kersey knocks off some dozen of them sending the the city's crime rate falling as much as 70%! All this with the ineffective, in stopping crime, police being more interested in stopping \"The Vigilante\" then stopping the criminals! The movie \"Death Wish\" hit a raw nerve with the public as well as the local politicians and police because it showed how, in the movie at least, one man with a gun and knowing how to use it can make a difference when it comes to stopping crime. The story is not that unlikely as those against it would want the public to believe. There's been many times when average people took to protecting themselves, with firearms, and did a much better job then the police; which is just what Paul Kersey did in the movie. That may have been one of the reasons that those in authority were so much against the film. When Bernie Goetz in December 1984 gunned down four muggers, much like Charles Bronson did in the movie \"Death Wish\", who tried to attack him in the New York subway crime dropped a lot more then if one hundred policemen were put on the trains. Nobody can doubt now that Charles Bronson's \"Death Wish\" was not only a major milestone in films about urban crime but also a major milestone in what the public thinks about crime and what's best to do to stop it.",
         "Over the course of a career that has spanned nearly fifty years, action star Charles Bronson has appeared in dozens of films. Among them, the one that he is best remembered for is \"Death Wish,\" an urban drama that has practically defined his career. He plays Paul Kersey, a liberal, mild-mannered architect whose family falls victim to violent crime. One fateful afternoon, he is shocked to hear the dreadful news: his wife has been murdered, his daughter brutally raped. What's more, the police are unable to apprehend the perpetuators. Feeling stunned and helpless, Kersey decides to take the law into his own hands--and the subsequent publicity galvanizes New York City. It isn't long before the police are hot on his heels. The ultimate consequences promise to be drastic. \"Death Wish\" was a highly controversial film when initially released. At the time, major cities were facing a deadly crime epidemic, and this film tapped into the fears and unspoken desires of many viewers, giving them a chance to live out their secret fantasies. Critics on the Left lambasted its politics on crime, and even some on the Right felt it went too far. One could find much to complain about from an ideological standpoint. One could point out that the film is manipulative and heavy-handed (the attack on Kersey's family comes right after his co-worker tells him he's a \"bleeding-heart liberal\"). Yet, it is undeniably compelling; one of these movies that makes you wonder, \"what if this happened to me?\" In light of the later, inferior sequels, it is fascinating to see how the character came to be, how he made the transition from law-abiding man to cold-blooded vigilante. It is not an easy transition to make by any means--after his first kill, he breaks down and vomits the moment he reaches home. Yet, as his kills (each is very suspensefully handled) occur with greater frequency, we get the sinking feeling that he has reached a point of no return. Indeed, he narrowly eludes capture on at least two occasions, and there is the certainty that it is only a matter of time before the law will catch up with him. Bronson is highly effective here; while not one of the great actors, he has a very strong screen presence. The audience is on his side every step of the way, rooting for him even as he strays onto the wrong side of the law. Surely, he is entitled to justice, but at what point does his vengeance outweigh his grievances? Vincent Gardenia is effective as the police detective assigned to his case. He grudgingly admires Kersey's resolve, although he is sworn to put a stop to the killings. The manner in which this is resolved is creative, though its plausibility is less than certain. The film is also noticeable for an early appearance by Jeff Goldblum as a slimy thug. However, Steven Keats is somewhat ineffectual as Bronson's son-in-law (he just sorta got on my nerves). In the years to come, this film would be followed by an endless chain of sequels and rip-offs, many of them starring Bronson himself, reducing him to a stock character whose only attribute was blowing the bad guys away. A shame, considering he was once an internationally respected actor. \"Death Wish\" is nonetheless a well-crafted, tightly paced crime drama, despite some dated aspects. It still kept me interested throughout and made me more interested in viewing more of the star's other films--good or otherwise. Rating: *** (out of ****) Released by Paramount Pictures",
         "Here is a film whose quality and appeal, much like Sylvester Stallone's Rocky, may be overshadowed by a seemingly endless line of inferior sequels. But Death Wish is a real crowd-pleaser filled with emotion, drama, action and suspense. It's the story of Paul Kersey, a family man (and former Conscientus Objector in Korea) whose wife and daughter fall victim to a brutal attack at the hands of unknown thugs. Yet Kersey doesn't get mad, he gets even as a one-man judge, jury and executioner against those who prey on the innocent. Bronson delivers an underrated performance in a movie that constantly asks the viewer, \"What would you do?\"",
         "One of the best favorite action movies of all time, Death Wish glitters Charles Bronson's glory famously. Followed by 4 script-free episodes the first episode had inspired millions worldwide. At present(2009) while the remake version is being filmed I have to say that; no matter who will perform Paul Kersey for the second time, he won't be able to impress us as Bronson did. Rather than Bronson's performance Death Wish has its significant themes and screenplay components which were used at almost every action/crime movie later on, thus became clichés of their genre. Spending a lot of the running time through the bad guys' side is the most fundamental component. This development was so modern and original, after a while it changed the outlook of the Crime genre. Death Wish is nearly as good as Eastwood's Dirty Harry, with just a different taste. Obviously, this should have been produced only once; since the sequels misrepresented its purpose.",
         "Charley Bronson portrays Paul Kersay, a mild mannered soul who's life is turned upside down when some punks ruin his happy life. After some deep soul searching, Charley comes to the conclusion that all those punks out there walking the streets need a lesson. So, after donning a beannie cap and a heavy jacket, Charley decides to give them all a taste of their own medicine. The night time is the wrong time for muggers when Charley's around. This is the first film in what would later turn out to be a franchise of action/revenge flicks and it made Charley Bronson a household name and a part of Americana. Highly recommended. A.",
         "I recently watched \"Death Wish\" for the first time ever on video, having only seen edited-for-TV versions in the past. Before seeing the uncut versions, I thought the film was just an entertainingly intelligent little bit of slicked-up exploitation. Basically another take on the Dirty Harry formula--what if a peace-loving regular guy became a Dirty Harry? Even as a kid I could see that the simplistic political/social theory the film served up would only work in the self-contained, fictional world the filmmakers had created. But, that's art--a lie that tries to show truth. Well, I wouldn't say \"DW\" shows truth, but it does raise questions people often don't want to face. I also thought that the way Bronson's character made the transition from bleeding heart peacenik to fascist vigilante was very well written and well-played. And I don't think the story is as cut-and-dried as it seems on the surface. Near the end, Bronson's actions even seem to have driven him a bit mad, loosening his grip on reality (evidenced when he confronts the last thug and starts vacantly spouting Western cliches like they're both in \"Gunfight at the OK Corral\"). But (and as they say, this is a BIG BUT) I can't enjoy the uncut film because the murder of Kersey's wife and the viscous rape of his daughter is simply too repulsive to watch. Murder and rape are indeed repulsive, but for the melodrama to work, do I need to be subjected to such a graphic, in-my-face portrayal of the violence and humiliation? One that is presented like a porno snuff film? This raises an interesting question: If violence is going to be used in a drama, should it be graphically represented to be as repulsive and foul as it really is? Or should we be spared the details? Think about it: if all violence on TV and movies were as disgustingly graphic as in this film, violence might start to disappear from pop culture--we just wouldn't be able to take it. Instead, we as a society are constantly drowned in sanitized, videogame violence. The violent acts depicted in movies and on TV these days has no more effect on us than when a cartoon mouse drops a cartoon brick on a cartoon cat's head. Kill someone and them make a joke about it. So, even though violent acts are depicted everywhere in our popular culture, none of it seems real, thus disconnecting us from the consequences of real-life violence. So, if we can say nothing else, we can say that the violence in \"Death Wish\" is \"effective\". It does seem real. It is repulsive. Hence, the dichotomy: Even though I can intellectually defend the use of graphic violence in \"Death Wish\", that same depiction keeps me from enjoying the film. I simply can't watch it. I keep thinking: Is this representation of rape actually exciting some of the film's viewers? I feel complicit watching it. Dirty. So, does that make the film a success, or trash? Is that strong a reaction a mark of art, or exploitation? I don't know. And I must say that this I do not ask these questions only because this is a exploitation film. I've had the same thoughts about Kubrick's \"A Clockwork Orange.\"",
         "\"What do you call people who when they're faced with a condition of fear do nothing about it they just run and hide?\" Paul Kersey. This is one of my favorite films made from one of my favorite books. I lived in New York during the 1970's and can attest that crime was out of control then, the subways, parks and many streets were no man's land at night where you only went if you really had to or else you wanted to score dope, get a cheap hooker (or be one), or just for the thrill and danger. Police corruption had been so rampantly widespread for so long that there was no law and order and the thugs had taken over the night. If you question this just see Serprico and read that book which details how one honest cop almost died and was nearly buried by the massive tide of corrupt cops he was trying to expose, which was practically all the other cops. The majority of the people lived in fear of being in the streets at night and even many places during the day. Even if you packed heat that was no guarantee of anything, it wasn't uncommon to come across a gang of muggers all carrying guns, knives, baseball bats, etc. Most people in New York then were as Paul Kersey described only worse, not only did they run and hide from fear and danger but they ignored the suffering of others. New Yorkers had developed a reputation as cold and indifferent, which was fairly accurate. I remember a concert in Central Park where a girl was gang banged by a group of guys and hundreds of people just watched it, too afraid, too apathetic, or too vicariously sadistic to get involved. Someone even stole her clothes and she staggered around naked and bleeding in the rain. Things were not good and just about everybody in New York felt angry, alienated and helpless. People were sick of it all, the terrible Vietnam war, corrupt Richard Nixon, corrupt cops, corrupt everything, but they mostly were sick of being afraid and tired of living in fear. Then the movie \"Death Wish\" came out. The theater was packed when I went, which surprised me, as I had already read the book and knew what it was about but how did these other people know, besides it was a matinée. I discovered why everyone was there when Paul Kersey shot his first mugger: the whole place exploded in screaming cheers and the cheers got more powerful and louder with each subsequent vigilante act. I had been to Yankees games and concerts where you hear screaming and cheers but nothing had the power of the cheers on that day. There was something wonderfully cathartic taking place, everyone in that audience who had ever been mugged or had been afraid of being mugged, which was virtually everyone, was delighting in having the tables turned. We felt safe, and were happy to see a somewhat soft spoken, average kind of a guy being played by Charles Bronson kick a*s for us, take out the bad guys. This was a new, radical concept back then, an open revenge film where an ordinary appearing guy beats the muggers at their own game. It was a great experience and we all felt like we too could be as tough as Charles Bronson, at least during that safe little reprieve within the theater. Say what you will about the film, its technical shortcomings, you'd be hard pressed or less than honest to say that Charles Bronson didn't display his international appeal in this movie, the one that made him the world's biggest box office draw. He appears in this movie just like he was in real life, a quiet, unassuming kind of guy who really was tough, not the usual Hollywood tough guy who is so unconvincing because he can't fully hide his physical and character based qualities that are everything but a real, quiet, cool tough guy. Bronson was the real deal, just read about his earlier life if you want to know. This film got a lot of negative reaction as being a crass and brutal revenge film, and other typical cavalier comments. The New Yorkers who lived it, all the ones I knew and the ones in the theater that day, loved it for what it was, a piece of cinematic magic to make us feel like we weren't afraid and would perhaps very soon never have to feel afraid again. If you've never been mugged or been afraid of being mugged it's very easy to tell others how they're suppose to react, what they're suppose to like, think, do, etc. But until you've lived in a real urban jungle, you'll never know the great release that a movie like \"Death Wish\" can bring you. It's strictly vicarious entertainment but what marvelous entertainment it is!"
      ],
      "genres": [
         "Action",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Dino De Laurentiis Company",
         "Paramount Pictures"
      ],
      "summaries": [
         "Open-minded architect Paul Kersey returns to New York City from vacationing with his wife, feeling on top of the world. At the office, his cynical coworker gives him the welcome-back with a warning on the rising crime rate. But Paul, a bleeding-heart liberal, thinks of crime as being caused by poverty. However his coworker's ranting proves to be more than true when Paul's wife is killed and his daughter is raped in his own apartment. The police have no reliable leads and his overly sensitive son-in-law only exacerbates Paul's feeling of hopelessness. He is now facing the reality that the police can't be everywhere at once. Out of sympathy his boss gives him an assignment in sunny Arizona where Paul gets a taste of the Old West ideals. He returns to New York with a compromised view on muggers...",
         "Paul Kersey, New York architect, is a bleeding-heart liberal whose world is suddenly torn apart by the murder of his wife and the rape of his daughter. After a business trip to Arizona, Kersey returns to New York with a vengeance against crime and takes to vigilantism.",
         "Paul Kersey is an architect who served in the Korean War in the medial corps, and he lives in New York City. One day, three street punks posing as grocery delivery boys break into his apartment while he's not home. At first, they are simply looking for money, but when they find a lack of cash, their intentions turn more sinister, as they batter and physically humiliate Paul's loved ones, beating up Paul's wife Joanna and raping his married daughter Carol Toby, and both women are spray-painted \"just for fun.\" Joanna later dies of her injuries, and Carol is left catatonic. Paul's life is ripped apart by this. Paul's boss decides that Paul needs to get out of New York for a while, so he sends Paul to Tucson, Arizona to meet with a client. There, Paul witnesses a mock gunfight at Old Tucson, a reconstructed Western frontier town that is often used as a movie set. Paul's client, a gun enthusiast, gets Paul interested in guns, and even gives him one. When Paul returns to New York, he brings the gun with him, and when the police are unable to find the rapists, Paul sets out to find the rapists himself. Paul begins patrolling the streets, killing street criminals as he encounters them. While his obsessive search for street justice sickens him at first, Paul begins to enjoy it as Detective Frank Ochoa tries to find the man who is doing the police department's job for them. The public sees Paul as a hero, and the public feels thankful that someone out there is actually taking a stand against criminals, doing a much better job than the NYPD could ever do. As a result, in Ochoa's search for Paul, there is a problem: when it comes to public relations, Ochoa and the city government would have a political nightmare on their hands if they actually find Paul.",
         "Paul Kersey is an architect, who is a peaceful man. But when his wife and daughter are attacked in their apartment, his world changes. His wife is killed and his daughter is in catatonic state. His boss decides that Paul needs to get out of New York so he sends him to Arizona to meet with a client. While their the client, a gun enthusiast gets Paul interested in guns and even gives him one. When Paul returns, he brings the gun with him when he goes out and when a mugger tries to hit him Paul shoots and kills him. After that he goes on killing spree. The police of course are investigating it, but the public feels thankful that someone out there is taking a stand.",
         "A New York City architect becomes a one-man vigilante squad after his wife is murdered by street punks in which he randomly goes out and kills would-be muggers on the mean streets after dark."
      ],
      "budget": 3000000
   },
   "movielensId": 3430,
   "movielens": {
      "languages": [
         "Français",
         "English",
         "Italiano",
         "Deutsch"
      ],
      "releaseDate": "1974-07-24",
      "dvdReleaseDate": "2001-01-16",
      "directors": ["Michael Winner"],
      "runtime": 93,
      "movieId": 3430,
      "title": "Death Wish",
      "mpaa": "R",
      "actors": [
         "Charles Bronson",
         "Hope Lange",
         "Vincent Gardenia",
         "Steven Keats",
         "William Redfield",
         "Stuart Margolin",
         "Stephen Elliott",
         "Kathleen Tolan",
         "Jeff Goldblum",
         "Robert Kya-Hill",
         "Marcia Jean Kurtz"
      ],
      "imdbMovieId": "0071402",
      "originalTitle": "Death Wish",
      "genres": [
         "Action",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "hyZgZ9cN4kQ",
         "g6Yo8ltiU5c"
      ],
      "plotSummary": "A New York City architect becomes a one-man vigilante squad after his wife is murdered by street punks in which he randomly goes out and kills would-be muggers on the mean streets after dark.",
      "tmdbMovieId": 13939,
      "avgRating": 3.19628,
      "releaseYear": "1974",
      "numRatings": 1238,
      "posterPath": "/3PKm5qtlxxIX7WEmWkCub6PCFSX.jpg"
   }
}