{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "rape",
            "id": 570
         },
         {
            "name": "detective",
            "id": 703
         },
         {
            "name": "drug traffic",
            "id": 2149
         },
         {
            "name": "vigilante",
            "id": 7002
         },
         {
            "name": "revenge",
            "id": 9748
         },
         {
            "name": "los angeles",
            "id": 12670
         },
         {
            "name": "surveillance",
            "id": 18420
         }
      ],
      "imdb_id": "tt0082250",
      "video": false,
      "title": "Death Wish 2",
      "recommendations": [
         24873,
         26263,
         34746,
         13939,
         18587,
         16113,
         14854,
         19086,
         15379,
         20721,
         14362,
         15983,
         13154,
         10651,
         11037,
         33055,
         9395,
         9057,
         11707,
         9569
      ],
      "backdrop_path": "/tunPGpLoGhECru6pxVEaQsn9Ffj.jpg",
      "revenue": 45000000,
      "reviews": [{
         "author": "John Chard",
         "id": "5556b3ae9251411e5b00437b",
         "content": "Kersey Chaos.\r\n\r\nMichael Winner once again pushes the buttons of Hollywood with this sequel to his controversial hit, Death Wish. Plot follows a familiar trajectory, Paul Kersey (Charles Bronson) is now in Los Angeles living a normal life, when wouldn't you know it, some scumbag youths cross his path after administering some rape and pillage on folk close to him... \r\n\r\nThe problem here, and the reason why some critics positively burst blood vessels after watching it, is that for the first half it just is pure exploitation, this in spite of some decent production value. Did it really need to be another sex crime? Could it not have been a murder et al? There gets a point in the film where you sense it's boobs for boobs sake. Though you have to wonder if Winner dared to ask Chuck and Jill Ireland (playing girlfriend of Chuck...) if Jill would do a nude scene? I think a broken nose may have come about if that subject had of been broached... \r\n\r\nOnce Kersey (Bronson hard as nails again) goes about dealing out his brand of justice, the film hits its straps, teasing the viewers with moral - cum - ethical outrage or conversely, vicarious thinking. Vigilante films are always going to swim in tricky waters, provoking anger and heated debate from all walks of the political spectrum, but better to have them out there to provoke a response than not. Surely? \r\n\r\nThere is nothing remotely high end here, but it's a film worthy of its above average rating on IMDb. It can shock, annoy, dismay and even induce unintentional mirth (three of the rapist thugs dance the campiest dance ever), but it will not be ignored and people are still seeking it out today to watch for the first time. Michael Winner still showing the ability to pique interest with his vigilante franchise. 6.5/10",
         "url": "https://www.themoviedb.org/review/5556b3ae9251411e5b00437b"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Paul Kersey",
               "gender": 2,
               "credit_id": "52fe45eb9251416c75066fe1",
               "name": "Charles Bronson",
               "profile_path": "/hxZR2w0LXX47VKtxibDyZDsTAkH.jpg",
               "id": 4960,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Geri Nichols",
               "gender": 1,
               "credit_id": "52fe45eb9251416c75066fe5",
               "name": "Jill Ireland",
               "profile_path": "/suSIOlNf82A49bcFIdoY3vd45ir.jpg",
               "id": 15753,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Det. Frank Ochoa",
               "gender": 2,
               "credit_id": "52fe45eb9251416c75066fe9",
               "name": "Vincent Gardenia",
               "profile_path": "/o57oXN3dTxdKAXNttmRjfEWXp57.jpg",
               "id": 14830,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "New York D.A.",
               "gender": 2,
               "credit_id": "52fe45eb9251416c75066fed",
               "name": "J. D. Cannon",
               "profile_path": "/mgZsKMd5zg0g5yQ7UUkfvsLkGJd.jpg",
               "id": 19106,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Carol Kersey",
               "gender": 1,
               "credit_id": "52fe45eb9251416c75066ff1",
               "name": "Robin Sherwood",
               "profile_path": "/rORJGEQ1WZZ8HgdKOa0CGRYzE87.jpg",
               "id": 74682,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Cutter",
               "gender": 2,
               "credit_id": "52fe45eb9251416c75067001",
               "name": "Laurence Fishburne",
               "profile_path": "/8suOhUmPbfKqDQ17jQ1Gy0mI3P4.jpg",
               "id": 2975,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Herman Baldwin",
               "gender": 2,
               "credit_id": "52fe45eb9251416c75067005",
               "name": "Anthony Franciosa",
               "profile_path": "/mnxzc8wk6COR3ElHZfXMztBbuT0.jpg",
               "id": 106179,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Inspector Lt. Mankiewicz",
               "gender": 0,
               "credit_id": "52fe45eb9251416c75067009",
               "name": "Ben Frank",
               "profile_path": null,
               "id": 103455,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Rosario",
               "gender": 1,
               "credit_id": "52fe45eb9251416c7506700d",
               "name": "Silvana Gallardo",
               "profile_path": null,
               "id": 106702,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Fred McKenzie",
               "gender": 2,
               "credit_id": "52fe45eb9251416c75067011",
               "name": "Robert F. Lyons",
               "profile_path": "/33GfkGHwpoTt942epr4g6VB0udS.jpg",
               "id": 51519,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Elliot Cass",
               "gender": 2,
               "credit_id": "52fe45eb9251416c75067015",
               "name": "Michael Prince",
               "profile_path": "/xjmQon7LI8XEeJ4XjJ1SYDZOQCe.jpg",
               "id": 175017,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Deputy Comm. Hawkins",
               "gender": 2,
               "credit_id": "52fe45eb9251416c75067019",
               "name": "Drew Snyder",
               "profile_path": "/xW8V4eZaFRm0J2FCNNrcojN8yOg.jpg",
               "id": 52188,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "New York Police Comm.",
               "gender": 2,
               "credit_id": "52fe45eb9251416c7506701d",
               "name": "Paul Lambert",
               "profile_path": null,
               "id": 14507,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Nirvana",
               "gender": 2,
               "credit_id": "52fe45eb9251416c75067021",
               "name": "Thomas F. Duffy",
               "profile_path": "/jLANWUvY91SUNcBfB4z7PQUieE7.jpg",
               "id": 46919,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Stomper",
               "gender": 0,
               "credit_id": "52fe45eb9251416c75067025",
               "name": "Kevyn Major Howard",
               "profile_path": "/5ot93qmaANhNe9JZVPx6qktMoDY.jpg",
               "id": 8657,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "Jiver",
               "gender": 0,
               "credit_id": "52fe45eb9251416c75067029",
               "name": "Stuart K. Robinson",
               "profile_path": null,
               "id": 159738,
               "order": 15
            },
            {
               "cast_id": 20,
               "character": "Donald Kay",
               "gender": 2,
               "credit_id": "54ac8936c3a3680c2100abba",
               "name": "Charles Cyphers",
               "profile_path": "/pglMfoHMVEcziDlnl33DrZjRSM3.jpg",
               "id": 11786,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "5927a9659251413b5b033025",
               "name": "Menahem Golan",
               "profile_path": "/qGtHMLd4E7tRyw75H4lWTRelW7B.jpg",
               "id": 33008,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5927a96ec3a368787002ea5c",
               "name": "Yoram Globus",
               "profile_path": "/bKbeXNvErtCQiK3pEEnFgmR9cvo.jpg",
               "id": 33009,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5927a9a4c3a36877fd02bd1f",
               "name": "Michael Winner",
               "profile_path": "/jZix6y5rPSromAWQe0o774eqqa.jpg",
               "id": 19244,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5927a9da9251413b50030e05",
               "name": "Thomas Del Ruth",
               "profile_path": null,
               "id": 3031,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "5927a9e89251413b8a03152b",
               "name": "Richard H. Kline",
               "profile_path": "/1b9iffgT1rS9ff2erVOaPhVowW8.jpg",
               "id": 1762,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "52fe45eb9251416c75066ffd",
               "name": "David Engelbach",
               "profile_path": null,
               "id": 197925,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5927a9bfc3a36877bc035dac",
               "name": "Michael Winner",
               "profile_path": "/jZix6y5rPSromAWQe0o774eqqa.jpg",
               "id": 19244,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5927a9f89251413ba002ef76",
               "name": "Julian Semilian",
               "profile_path": null,
               "id": 1200016,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5927aa2c9251413b5b0330c0",
               "name": "Jimmy Page",
               "profile_path": "/vYHUUeD8skosTDWFLRMBChDZQD8.jpg",
               "id": 87463,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 7.090345,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 14373,
      "vote_count": 97,
      "budget": 2000000,
      "overview": "Paul Kersey is again a vigilante trying to find five punks who murdered his housekeeper and daughter in Los Angeles.",
      "similar": [
         357096,
         281,
         4771,
         96,
         156022,
         281957,
         979,
         445954,
         23587,
         1266,
         3134,
         10651,
         11423,
         12143,
         2749,
         18587,
         15069,
         26390,
         1586,
         9654
      ],
      "original_title": "Death Wish 2",
      "runtime": 88,
      "poster_path": "/8xYtuhzBuTIBugmnOHtHpTbv4Iz.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/5jvFLUVXGXxkyszL9cqJN5hNhJ6.png",
         "name": "Cannon Group",
         "id": 1444,
         "origin_country": ""
      }],
      "release_date": "1982-02-20",
      "vote_average": 6,
      "belongs_to_collection": {
         "backdrop_path": "/m3K7AXN8Wi6VIRtVlpF1E6nzEn1.jpg",
         "name": "Death Wish Collection",
         "id": 14377,
         "poster_path": "/3mC5lppASzZHx5IlmFSL6cPQpCP.jpg"
      },
      "tagline": "First His Wife. Now His Daughter. It's Time To Even The Score!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Michael Winner"],
      "runtime": 88,
      "synopsis": "The film opens with a grand view of Los Angeles, with a news broadcast in the background detailing an increase in crime in the city. The overview of the city goes until the end of the opening credits where we zoom in on the new house of Paul Kersey (Charles Bronson) where the maid, Rosario (Silvana Gallardo), is preparing dinner. He seems to have picked up the pieces of his life to move on, as his girlfriend is KABC news/radio reporter Geri Nichols (Jill Ireland) and they both go and pick up Carol from the hospital and spend the day with her. Paul talks to the doctor, who says that despite her traumatic catatonia, she has begun to speak again. Her husband, Jack Toby, though not seen or mentioned, presumably divorced Carol. Paul, Geri, and Carol spend the rest of the afternoon at a carnival, where Paul offers to buy ice cream while the girls look around. While waiting in line for some ice cream, he gets mugged and his dollar bill is stolen by five gang members. At first Paul does not mind but realizes they also took his wallet. Paul manages to catch up with one of them (Jiver), but Jiver exclaims that he was not the one who took the wallet. Geri heads to do an interview with the senator while Carol and Paul go on a boat ride. The same five muggers who stole Kersey's wallet arrive at his house determined to kill him. The thugs break in, tightly bind, and gag, and then gang rape Rosario. Paul arrives home with Carol, only to get beaten unconscious when he walks in the door. Rosario tries to call the police, but the thugs hear the sound and quickly kill Rosario by bashing her head in. They then take Carol to their hideout, where one of the muggers rapes her. After the attack, she runs away from the thugs and jumps from a window, becoming impaled on the railings below. Geri arrives to the house as Paul regains consciousness and the police arrive. Lt. Mankewicz (Ben Frank) is one of the first on the scene, asking Paul about the identification of the muggers because the description was \"a little vague\". A short time later, Paul learns about the death of his daughter and is sent to the station to ID her. Later, Mankewicz asks Paul to view some photos at the station to rejog his memory since Paul is the only witness. Paul declines by saying: \"it won't do any good.\" The next scene is at a funeral where Paul and Geri both attend. That night, Paul pulls out a .32 caliber semi-automatic handgun he kept hidden in his closet, changes clothing, and rents a low-rent apartment in the inner city as his forward base of operations. After wondering around most of the night through the rough part of downtown L.A. Paul returns to his own house. Geri arrives the next morning and lets herself in, where she nearly discovers Paul's gun laying on a dresser. Paul quickly gets up and hides it. After Geri leaves, he calls a locksmith to have the locks on his house changed. The next night, Paul spots one of the muggers, Stomper, and follows him into an abandoned hotel building as a drug deal is about to be made between his partner and two buyers. Kersey tries to be quiet as he can, but the others notice his presence when he knocks over a can. Kersey kills Stomper's partner, then orders the other two out of the room where he kills Stomper. The following evening, as he is patrolling the streets, Paul hears a scream coming from an underground parking garage where a man and a woman are being assaulted by four muggers. One of the muggers is Jiver, whom Kersey chased down the alley the day of his daughter's death. Paul opens fire on the muggers, killing two of them. Jiver is wounded, but he and the fourth mugger manage to get away. Taking a .45 caliber pistol off one of the dead muggers, Paul follows the trail of blood, and manages to wound and kill Jiver at a warehouse across the street. Paul flees before the police arrive. The L.A. police quickly hear about the murders, as does the NY Police Department. Detective Frank Ochoa (Vincent Gardenia) is called by the LAPD to help. The Police Commissioner (Anthony Francoisa) thinks the vigilante killings may be done by Kersey again. Fearing that Kersey, when caught, will reveal that they let him go instead of prosecuting him, the NYPD sends Inspector Frank Ochoa to make sure that does not happen. Ochoa meets with Lt. Mankewicz, who suspects that Frank is hiding something. That night, Ochoa breaks into Geri's apartment where he meets Geri and tells her about Paul's past and recent vigilante spree. But when Geri confronts Paul, he quickly denies it, ascribing the tale to Ochoa's imagination. Paul drives Geri to work the next morning, where Ochoa is waiting. In order to keep tabs on Paul, Ochoa calls Mankiewicz and asks him to park his car near Paul's apartment (but he doesn't tell Mankiewicz about following Kersey himself). Another night later, Ochoa follows an unknowing Kersey from his house to his low-rent apartment and from there to a local square where Kersey spots the three remaining gang members who attacked him: Cutter (Laurence Fishburne), Punkcut (E. Lamont Johnson), and Nirvana (Thomas F. Duffy). Kersey follows the trio on a bus to an abandoned park, where a major drug deal goes down. Ochoa follows Kersey and sees him from a distance hiding in a bush, but decides to help Paul after detecting a spotlight heading in his direction. Ochoa warns Paul with a shot by shooting a gang member who tries to shoot Paul. Paul runs behind a tree as the gang members grab their guns and fire back. Ochoa gets shot by a hail of gunfire, but Paul manages to kill Cutter (who vainly tries to shield his head with a boom box) with a bullet through the face. Punkcut is also wounded by a gunshot to the chest, as is another gang member. Paul also shoots and kills the getaway driver and seller of the firearms, who plummets off a cliff to a fiery doom below. The final mugger, Nirvana, gets away. Paul goes over to Ochoa and asks him why he saved his life. Ochoa responds he had to side with Paul against the criminals, and tells Paul to kill Nirvana for him. Ochoa dies as the police arrive, and Paul escapes into the night. The police get the name of Ochoa's killer from a badly injured Punkcut by inflicting pain, who succumbs to his injuries and dies. A few days later, Nirvana (who's real name is revealed to be Charles Wilson) is found by the police hiding out in an apartment. Paul, monitoring the police radio frequency from an acquired radio scanner, tries to get to Nirvana to kill him before the police do. But in the apartment building hallway, Paul narrowly misses his opportunity for a kill when he gets slashed on the arm by Nirvana during a chase. Nirvana runs outside when he sees the police approaching and gets tasered, but with no effect due to an influence of PCP. He is finally arrested after stabbing several officers. Tried and found criminally insane, Charles 'Nirvana' Wilson is sent to McLarren State Hospital. Paul comes along with Geri to the hospital where she is interviewing Charles Wilson's doctor. The visit allows Paul to secretly steal a facility ID card and a white doctor's lab coat. Despite his plans for revenge to kill the last surviving thug who assaulted him, Paul has lunch with Geri the next day and proposes to her. Geri accepts. The night they plan to go to Mexico for their wedding, Paul uses his altered doctor ID and stolen lab coat to gain access to the hospital and confronts Wilson in the hospital meeting room. They have a violent fight and Kersey is stabbed repeatedly by Wilson with a scalpel. But when Wilson slams Kersey up against an electrical device, Kersey ducks the oncoming punch. Wilson's hand smashes through the machine and Kersey turns the power up, electrocuting Wilson. Donald Kay (Charles Cyphers), the head orderly on duty, witnesses Wilson's death, but sympathizes with Kersey and gives him three minutes to escape from the hospital before sounding the alarm. Geri goes to his apartment later that night and finds the scanned copy of the stolen ID. She realizes that Paul is actually the vigilante after she hears a report of Wilson's death on the radio. She puts the paper and the engagement ring on the table and drives off. Paul arrives home minutes later to an empty apartment. Five months later, Paul is at his office speaking to his clients about a party in celebration of a new architectural design. His boss Elliott Cass (Michael Prince) invites him to a party that very evening, and when Paul is asked if he's free, he answers: \"What else would I be doing?\" The movie ends with gunshots heard on L.A.'s skid row, implying that Paul will continue his vigilante spree undisturbed.",
      "writers": [
         "David Engelbach",
         "Brian Garfield"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0082250/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIxODc3MTg2M15BMl5BanBnXkFtZTcwNjg3NTQyMQ@@._V1_SY317_CR9,0,214,317_AL_.jpg",
      "actors": ["Stars: Charles Bronson, Jill Ireland, Vincent Gardenia | See full cast and crew »"],
      "reviews": [
         "Be grateful for Michael Winner's sledgehammer sensitivity because it produced this classic. None of Paul Kersey's (Charles Bronson) remaining family and friends get off lightly in this twisted nightmare of domestic violence, anal rape, vigilante justice and simplistic politics. For fans of rough justice, the rape of Bronson's Mexican housemaid is truly amazing and eroticized like crazy by Winner's leering direction. Thomas F. Duffy as Nirvana, the film's lead thug, is really horrible and a joy to behold (in a perverse way). Led Zeppelin's Jimmy Page provides a rock score that scorches the L.A. imagery and Vincent Gardenia returns as the cop who prefers to look the other way. A Cannon-backed sleazefest that brings home the groceries if you like eating trash. Screw GONE WITH THE WIND. This is much more entertaining.",
         "The second Death Wish film has a very strange concatenation of qualities. It can come dangerously close to running off the rails altogether, but overall, I think it's a more successful film than the first Death Wish. The first peculiarity is that much more strongly than the first film, Death Wish II's urban crime-ridden backdrop is exaggerated to a point of caricature. Of course, there was plenty of crime in Los Angeles during this era, but not as depicted here. This is almost Broadway-style crime, with choreographed gaggles of hoodlums running out of control in designer gang-wear, making spectacles of themselves. It's over the top but serious in a way that feels uncomfortable at first, but then, that's just the point, and it helps anchor the plot developments that follow. And that plot should be no surprise to anyone who first watches Death Wish I. Death Wish II follows the plot of its predecessor as if it were a fairly rigid template. Even the events that cause Paul Kersey (Charles Bronson) to take charge and clean up society's scum by his lonesome are very similar. I don't see this as a flaw here (as I don't in many other sequels that use a template approach, including series like Friday the 13th). This is a direct continuation of the story of the first film, and the similarity gives Death Wish II both a natural, logical flow and a nice symmetrical structure. Although Death Wish I had its brutal moments, Death Wish II amplifies that atmosphere and sustains it through its length. Like the films that best display gritty 1970s New York City--such as Taxi Driver (1976) and Basket Case (1982)--Death Wish II makes you feel almost dirty (in the grimy despair way, not a sexual way) while watching it. It's ironic, maybe, that Death Wish II does this so well when the setting is Los Angeles as opposed to actually being New York City, as in the first film. That director Michael Winner is able to perpetuate that atmosphere, whether by accident or design, results in the viewer being sucked into the setting and vicariously experiencing the range of unpleasant emotions felt by both the protagonists and the antagonists. Also helping on that end is the score, provided by Led Zeppelin guitarist Jimmy Page. Although Winner sometimes incorporates Page's music in a discordant, jarring way--over the opening credits when it fights for volume with radio banter, for example--more often than not the score gives Death Wish II a sublime, otherworldly and eerie edge. It's too bad that Page didn't go on to score many more films. This is certainly not a film to show during family time, and it's not particularly uplifting or overflowing with positive messages or socially redeeming values. But it's not trying to be any of those things. It's just a visceral (especially on an emotional level), disturbing revenge flick, and at that, it meets its goals well.",
         "\"Yes,\" says the crying thug, knowing his last breathing second on this planet has come. Bronson replies: \"Now you'll get to meet him,\" and blows a hole in his chest! This scene found me laughing in disbelief, shocked and horrified over what the Paul Kersey-character has become, and at the same time impressed that somebody actually dared to make this stuff more than 20 years ago, and even starring one of the biggest movie-stars in the world! This once bleedin' heart liberal family man has for sure turned into a messenger of death, with about as much mercy for the criminals as a hungry stray cat has for a limp mouse! It's shocking to watch, but at the same time fascinating because the whole movie looks great, the atmosphere gets under your skin, and you still find yourself rooting for Bronson's character. This is still the best of the \"Death Wish\"-sequels, and it still packs a wallop and manages to stir controversy even today. It's a movie you will either like or hate, there is no middle road here, and it makes for a great conversation piece. One final note: this movie sure is a reminder and evidence that when it came to movie tough-guys Charles Bronson WAS the baddest of them all. After the sad news of Bronson's passing a lot of people say he was second behind Clint Eastwood as far as action icons go. I'm a huge Eastwood-fan but Bronson still beats him any day. It really hit me as I was watching this movie. Bronson is driving through down-town Los Angeles, after brutally executing the thug in the above mentioned scene, he passes a movie-theater and sees a guy pretending to be a cowboy outside the theater, and what is the double-billing at the theater? Those silly comedies with Clint Eastwood and that big monkey Clyde! That kinda' sums it up doesn't it? Charles Bronson was THE MAN.",
         "Charles Bronson picks up where he left off in the famous \"Death Wish\" movie of 1976, going after punks and eliminating them. The only differences: he's moved from New York to Los Angeles and the violence is more graphic. Despite the B-movie feel to this (produced by the kings of the cheapo movies of that era (70s and early 80s) : Golan/Globus, it still is very enjoyable and satisfying - if revenge is your thing. Here, Bronson revenges the death of his daughter. At least her death is quick and bloodless, unlike the unpleasant rape-and-murder scene in the first film. Also, unlike the first film there is no need for a long setup. Bronson gets back in his vigilante mode in a hurry here and never lets up. If you want a short dose (an hour and a half) of action, this is your movie. One of the gang members in here, by the way, is a young Laurence Fishburne. The negatives are (1) sub-par acting performances by Bronson and his real-life wife, Jill Ireland; (2) some blatant credibility problems with the story ( such as how Bronson could get across town all bloody but never be noticed;) and (3) not exactly the most intelligent dialog! Yet, this is still an appealing movie to our conditioned satisfaction for instant revenge. So, if you've had a bad day and need a release of your hostilities, this is a good remedy!",
         "The supposed correlation between violence/sexuality in art and violence in reality has been shoved to the forefront of our culture, especially in the past decade, when incidents such as the Columbine massacre confirmed politicians' fears of an unregulated entertainment industry in need of a spanking. In non-fanatical, everyday reality, however, I have come to disagree with the equation above. Some would argue that ugly, violent, nihilistic, and generally misanthropic films like \"Death Wish\" and its sequels do nothing but contribute to intensifying the more unsavory impulses that lay dormant in the viewer's id. Yet therein lies the purpose of such rough-edged, unpleasant entertainment. It sparks the id, pummels it into submission, so that when the experience is over, a sigh of relief is uttered. The original \"Death Wish\" was a well-done exploitation flick with the professional gloss of an A picture; despite its relatively shallow insight into the murky moral terrain of vigilante justice, it contained an intensely subdued performance by Charles Bronson, and confident direction by Michael Winner. By comparison, \"Death Wish 2\" is a typical sequel, taking what the original had and dumbing it down to milk some cash for the franchise. In addition to Bronson (in the role of architect Paul Kersey), a few other characters return to provide at least a superficial connection to the original (Robin Sherwood as his daughter; Vincent Gardenia as the cop that uncovered his identity). The plot is as before: Paul Kersey has begun a new life (courting the cheerfully cardboard Jill Ireland) which is shattered when a gang of punks (including a young Laurence Fishburne) rape and murder his housekeeper and daughter. Unlike the original, no time is spent watching Kersey contemplate his actions; he simply goes to work, and in the process is rendered a stoic killing machine. The characterization/motivation for the punks is given even less thought--they exist for the sole purpose of showing how scummy the scummiest scum of society can be. The film moves from one random encounter to the next, wherein Kersey stumbles across gang members and kills them. Of course this doesn't sound like highbrow film-making, but \"Death Wish 2\" never teases the audience with any notions of greatness. In spite of the meager attention given to Kersey's character, we root for him anyway; and in spite of the inexplicably-written punks, we hope for their demise. Michael Winner once again gives the film a gritty yet polished look, though he is clearly directing a flat-out B picture; the pacing is tight (the film runs just under 90 minutes), and the action is competently choreographed (though the romantic subplot provides a respite from the relentless violence, it is shallow and cloying). Jimmy Page's offbeat musical score only adds to the unusual charge this film packs. In the best-case scenario, \"Death Wish 2\" is no masterpiece, but the perfect Novocaine to apply after a particularly rotten day. It will numb you into a state of apathy and wash your troubles away (that's a compliment).",
         "It's hard to believe that anyone who didn't like the first one wouldn't like this one. Bronson is back, this time avenging the death of his daughter and he's angrier than he's ever been. This one takes more of a action hero approach than the first one, but that's okay, you see, Bronson is a bad ass and that's all that matters. Movies like this aren't made to win best picture or best screenplay, they're made to be entertaining and filled with action, and that's what this is. Bronson has a great line he give to a punk just before he blows him away; he asks the punk if he believes in Jesus as the punk clutches a cross around his neck. The punk says \"yes sir\" so Bronson pauses and then tells him \"you're going to meet him.\" Then he shoots him twice, it's great. Classic. I found no insight in this film, all I found was an awesome character who you can't get enough of that gets away with killing pieces of trash that rape, mug, and murder civilians. This formula is timeless, and the whole Death Wish series should be appreciated for proving so, because I'd watch one of these films before I watch any action film that may be produced today.",
         "Of all the Death Wish sequels, this was the best. I think once they got to up part 3 with all the machine guns and rocket launchers, then it started to get a little stupid. The story almost has an identical plot outline as the first one and the action is just as good, if not, then even better. The shootout at San Pedro park was awesome!!! The only difference is that they make Paul Kersey have more emotional interaction with the creeps he kills which makes it seem to be more \"Hollywood\". In the first Death Wish, Kersey would just kill them stone cold without having a conversation. That's why the original was so good as so realistic.",
         "I had to see this movie after I surfed on the IMDb and read some comments on this movie: It seemed like some meeting of psychoanalysts or something. Well, where to begin... I must admit that this is an interesting movie \"psychologically\", but I don't think any five penny analysts could do anything to these sick people. Everybody is sick in this movie. It has the overall feeling of some really cheap low-life bar: The feeling of disappointment and failure in life. I would say it's the overall feeling of death; This movie feels like you would have just heard, that you have an incurable cancer. It's an interesting fact that Charles Bronson is, or at least has been, some kind of popular action hero: He looks like a disappointed- and tired-to-everything alcoholic. An interesting world-view and feeling. There is NO humor, joy or hope in this film; Not even before the bad guys come and \"ruin it all\". The bad guys names tell all: Nirvana, Stomper, Cutter, Punkcut, Jiver. They are the bad guys, and nothing else. They even smoke the \"herb\" and become psychotic and aggressive killer-madmen after that! I didn't know that that stuff makes that, but it's always good to learn. The bad guys first dance, chill out and have fun, and all of the sudden start to rape and kill people. (After that they forget about it.) It seems that the main character (Bronson) is a real psychopath, at least he fits perfectly of the description of one. I have to correct what I said before: Not everybody is totally sick in this movie; Just the ones that are involved in THE WAR. There is some (very few) good-looking pictures in this film; for example when the antihero walks in the streets at night. It's funny how he judges people that are unknown to him: For example when he sees somebody drinking alcohol, he looks at him with an expression of total repulsion on his face. Some police story also goes in the background, but it doesn't have much to do with the movie. But after all, this film manages to represent some peoples (the filmmakers) very strong feelings, and evidently also the feelings of many viewers, and isn't that one of the main purposes of any piece of \"art\" or self-expression? Can you judge people for how they feel? If you want to see a really good movie of this genre (revenge-moral-story), I strongly recommend Tony Scott's \"Man on Fire\" (2004)(with Denzel Washington, Christopher Walken, Mickey Rourke, Dakota Fanning). Peace.",
         "Well, we don't get the great Herbie Hancock score of the first movie, but we do get Jill Ireland, Mrs. Bronson, in one of her last films, directed as Death Wish I and III, by Michael Winner. We also get what I feel is the biggest collection of scumbags ever assembled. Thomas F. Duffy as Nirvana, Kevyn Major Howard as Stomper, Stuart K. Robinson as Jiver, Laurence Fishburne as Cutter, and E. Lamont Johnson as Punkut. It was fitting that the first kill occurred in a rat- infested building, and the last was an electrocution. Vincent Gardenia is back to track down Kersey after he starts again in Los Angeles. Unlike the serious and tragic first film, this is more focused and revenge-oriented. A good film, nonetheless.",
         "Charles Bronson is back as Paul Kersey. After some punks (including a young Morpheus, Laurence Fishburne) get away with his wallet, they find his house. He's not home so they rape and kill the housekeeper. When Kersey and his daughter return, they knock him out and kidnap her. After raping her back at an abandoned warehouse, she jumps out the window, killing herself. Bronson being Bronson, it's time once again for revenge, while hiding it from his new girlfriend.Not as good as the original. As sequels rarely are. But I enjoyed it. Bronson as an actor just kicked so much ass. My Grade: B Eye Candy: Silvana Gallardo and Robin Sherwood show much flesh, but due to the subject matter, it's not really eye candy. Leslie Graves and Melody Santangello's topless scenes are more palatable."
      ],
      "genres": [
         "Action",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Cannon Films",
         "City Films",
         "Golan-Globus Productions"
      ],
      "summaries": [
         "Paul Kersey, the vigilante, now lives in LA with his daughter, who is still recovering from her attack. He also has a new woman in his life. One day while with them, Kersey is mugged by some punks, Kersey fights back, but they get away. The leader, wanting to get back at Kersey, goes to his house, but Kersey and his daughter Carol are not there. The muggers rape his housekeeper, and when Kersey and his daughter arrive, they knock him out and kidnap her. After they assault her, she leaps out of a window to her death. Kersey then grabs his gun and goes after them. When the LA authorities, deduce they have a vigilante, they decide to consult with New York, who had their vigilante problem. Now the New York officials, knowing that Kersey lives in LA, fears that he's back to his old habit. Fearing that Kersey, when caught will reveal that they let him go instead of prosecuting him send Inspector Ochoa to make sure that doesn't happen.",
         "Paul Kersey and his daughter Carol, who is still catatonic from the attack that included the murder of her mother Joanna, now live in Los Angeles because Paul accepted a deal from the NYPD to leave town so they wouldn't prosecute him, which would tell everyone that he was the one who was doing a better job than the NYPD at stopping criminals. Paul now has a new woman in his life, KABC news reporter Geri Nichols. One day while he's out with Carol and Geri, Paul is mugged by some punks. Paul fights back, but they get away. The muggers want to get back at Paul for fighting back, so they go to his house. Paul is not there, so they rape and murder Paul's maid. When Paul and Carol return, they knock him out and kidnap Carol and rape her -- the second time in her life that she's been raped, and she didn't even have a chance to recover from the first rape. After the muggers are done, Carol escapes and jumps from a window -- and she dies when she becomes impaled on the railings below. Paul is fed up with his family being attacked all the time, no matter where they live, so Paul rents a ratty hotel room, disguises himself, and sets out to find the muggers who killed Carol. When the LAPD deduces that that they have a vigilante on their hands, they decide to consult with the NYPD, who had their vigilante problem years ago. The NYPD, now knowing that Kersey lives in Los Angeles, fears that Kersey is killing criminals again. Fearing that Kersey, when caught, will reveal that they let him go instead of prosecuting him, the NYPD sends Inspector Frank Ochoa to make sure that doesn't happen. But Ochoa gets killed in a car crash at an L.A. freeway ramp while Paul is still trying to find the muggers.",
         "Architect-turned-vigilante Paul Kersey is back, now living in Los Angeles and tracking down five street punks whom murdered his daughter and housekeeper while keeping his secret brand of justice a secret from his newest girlfriend and co-workers.",
         "Architect Paul Kersey once again becomes a vigilante when he tries to find the five street punks who murdered his daughter and housekeeper, this time on the dark streets of Los Angeles."
      ],
      "budget": 2000000
   },
   "movielensId": 3431,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1982-02-20",
      "dvdReleaseDate": "2004-02-03",
      "directors": ["Michael Winner"],
      "runtime": 88,
      "movieId": 3431,
      "title": "Death Wish 2",
      "mpaa": "R",
      "actors": [
         "Charles Bronson",
         "Jill Ireland",
         "Vincent Gardenia",
         "J. D. Cannon",
         "Robin Sherwood",
         "Laurence Fishburne",
         "Anthony Franciosa",
         "Ben Frank",
         "Silvana Gallardo",
         "Robert F. Lyons",
         "Michael Prince",
         "Drew Snyder",
         "Paul Lambert",
         "Thomas F. Duffy",
         "Kevyn Major Howard",
         "Stuart K. Robinson",
         "Charles Cyphers"
      ],
      "imdbMovieId": "0082250",
      "originalTitle": "Death Wish 2",
      "genres": [
         "Action",
         "Crime",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "vFxtcrUZZw4",
         "h-8mxZus4x8",
         "8H633FYwQmQ",
         "Fy-9RGbpnnk"
      ],
      "plotSummary": "Paul Kersey is again a vigilante trying to find five punks who murdered his housekeeper and daughter in Los Angeles.",
      "tmdbMovieId": 14373,
      "avgRating": 2.44497,
      "releaseYear": "1982",
      "numRatings": 527,
      "posterPath": "/cD0RZPk8IE1FiJphsKdlBxnTzRt.jpg"
   }
}