{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "rocket launcher",
            "id": 2732
         },
         {
            "name": "punk",
            "id": 4470
         },
         {
            "name": "vigilante",
            "id": 7002
         },
         {
            "name": "revenge",
            "id": 9748
         }
      ],
      "imdb_id": "tt0089003",
      "video": false,
      "title": "Death Wish 3",
      "recommendations": [
         26263,
         14373,
         34746,
         13939,
         18587,
         16113,
         20721,
         12764,
         15983,
         15379,
         19086,
         33055,
         11037,
         14362,
         10651,
         42552,
         25087,
         36692,
         32065,
         21338
      ],
      "backdrop_path": "/6Cmb6GTZWrGSnB56fcQx26gi0io.jpg",
      "revenue": 16945171,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Paul Kersey",
               "gender": 2,
               "credit_id": "52fe44adc3a368484e030a3b",
               "name": "Charles Bronson",
               "profile_path": "/hxZR2w0LXX47VKtxibDyZDsTAkH.jpg",
               "id": 4960,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Kathryn Davis",
               "gender": 1,
               "credit_id": "52fe44adc3a368484e030a3f",
               "name": "Deborah Raffin",
               "profile_path": "/aH0szm0XkxCpNSEndihvKJUGVZg.jpg",
               "id": 87120,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Insp. Richard S. Shriker",
               "gender": 2,
               "credit_id": "52fe44adc3a368484e030a43",
               "name": "Ed Lauter",
               "profile_path": "/3mlQucZnEpYA1R8LxxKepsd7JpO.jpg",
               "id": 21523,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Bennett Cross",
               "gender": 2,
               "credit_id": "52fe44adc3a368484e030a47",
               "name": "Martin Balsam",
               "profile_path": "/vOrAfNxbu3Y1eQbdVQGUcmTu9Rc.jpg",
               "id": 1936,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Manny Fraker",
               "gender": 2,
               "credit_id": "52fe44adc3a368484e030a4b",
               "name": "Gavin O'Herlihy",
               "profile_path": "/brFrEXHx5vaeWJmqhQJMEaZhUHl.jpg",
               "id": 12660,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Hermosa",
               "gender": 2,
               "credit_id": "52fe44adc3a368484e030a61",
               "name": "Alex Winter",
               "profile_path": "/yHtymrjOTwB82EnpPgQjIgAXdTN.jpg",
               "id": 18355,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Maria",
               "gender": 1,
               "credit_id": "52fe44adc3a368484e030a65",
               "name": "Marina Sirtis",
               "profile_path": "/ueHzqv6uN6Mhf1DC3IjTPhNafYq.jpg",
               "id": 2393,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Angel",
               "gender": 2,
               "credit_id": "52fe44adc3a368484e030a69",
               "name": "Tony Spiridakis",
               "profile_path": "/m3SkKw2wET74Gd8cjy1I62VFzXx.jpg",
               "id": 151286,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "The Cuban",
               "gender": 0,
               "credit_id": "52fe44adc3a368484e030a6d",
               "name": "Ricco Ross",
               "profile_path": "/oxKgoS69eWyEwyZ6FdkTaevjIQA.jpg",
               "id": 10212,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Giggler",
               "gender": 2,
               "credit_id": "52fe44adc3a368484e030a71",
               "name": "Kirk Taylor",
               "profile_path": "/kCu5PF6OLegXDXL2HHCOnsvsFQp.jpg",
               "id": 8661,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Rodriguez",
               "gender": 0,
               "credit_id": "52fe44adc3a368484e030a75",
               "name": "Joseph Gonzalez",
               "profile_path": null,
               "id": 1096093,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "5927a7a6c3a368782d02f3f5",
               "name": "Menahem Golan",
               "profile_path": "/qGtHMLd4E7tRyw75H4lWTRelW7B.jpg",
               "id": 33008,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5927a7b6c3a368783e031f75",
               "name": "Yoram Globus",
               "profile_path": "/bKbeXNvErtCQiK3pEEnFgmR9cvo.jpg",
               "id": 33009,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5927a809c3a36877fd02bbd1",
               "name": "John Stanier",
               "profile_path": null,
               "id": 16592,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "5927a8209251413b50030c88",
               "name": "Michael Winner",
               "profile_path": "/jZix6y5rPSromAWQe0o774eqqa.jpg",
               "id": 19244,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5927aa49c3a368780a02e564",
               "name": "Mike Moran",
               "profile_path": null,
               "id": 1250017,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5927aa55c3a36877bc035e27",
               "name": "Jimmy Page",
               "profile_path": "/vYHUUeD8skosTDWFLRMBChDZQD8.jpg",
               "id": 87463,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44adc3a368484e030a51",
               "name": "Michael Winner",
               "profile_path": "/jZix6y5rPSromAWQe0o774eqqa.jpg",
               "id": 19244,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44adc3a368484e030a57",
               "name": "Don Jakoby",
               "profile_path": null,
               "id": 51346,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44adc3a368484e030a5d",
               "name": "Brian Garfield",
               "profile_path": null,
               "id": 70645,
               "department": "Writing",
               "job": "Characters"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 10.035157,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 24873,
      "vote_count": 89,
      "budget": 9000000,
      "overview": "Paul Kersey returns to New York to visit his friend Charley, who lives in one of the worst parts of New York City. But when Paul arrives at Charley's apartment, he finds Charley dying after a vicious beating by a gang led by Manny Fraker, and the police enter the apartment and find Paul standing over Charley's body. Paul is arrested for the murder, but police chief Richard S. Shriker is like Paul.",
      "similar": [
         281957,
         3134,
         156022,
         8456,
         281,
         979,
         2652,
         395834,
         357096,
         37835,
         74997,
         445954,
         26789,
         8292,
         994,
         23587,
         40805,
         11423,
         588,
         238636
      ],
      "original_title": "Death Wish 3",
      "runtime": 92,
      "poster_path": "/ike0J7zLCOzfxgBfXExFObM5UYc.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/5jvFLUVXGXxkyszL9cqJN5hNhJ6.png",
         "name": "Cannon Group",
         "id": 1444,
         "origin_country": ""
      }],
      "release_date": "1985-11-01",
      "vote_average": 5.9,
      "belongs_to_collection": {
         "backdrop_path": "/m3K7AXN8Wi6VIRtVlpF1E6nzEn1.jpg",
         "name": "Death Wish Collection",
         "id": 14377,
         "poster_path": "/3mC5lppASzZHx5IlmFSL6cPQpCP.jpg"
      },
      "tagline": "He's back in New York bringing justice to the streets...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Michael Winner"],
      "runtime": 92,
      "synopsis": "Paul Kersey (Charles Bronson) has arrived in Brooklyn to visit his longtime Korean war buddy friend Charley, who is attacked by a gang in his apartment. The neighbors hear commotion and call the police. Paul arrives as Charlie collapses dead in his arms. The police arrive and mistakenly arrest Paul for Charley's murder. At the police station, chief Richard Shriker (Ed Lauter) recognizes Paul as \"Mr. Vigilante\". Shriker lays down the law on Paul, and the two get into a scuffle before Paul is taken to a holding cell. In the same cell Manny Fraker (Gavan O'Herlihy), the leader of the gang who attacked and killed Charlie, is held. Fraker and Paul get in a fight before the police break it up. A few moments later, Fraker is released from the jail after his fellow gang members post his bail. Before walking out, he threatens Paul and states: \"I'll tell you what, I'm gonna kill a little old lady, just for you. Catch it on the six o'clock news.\" Manny arrives back on his gang turf to take his place as leader, slashing fellow gangmember Hector (David Crean), possibly for betrayal (and later he and his gang kill either a resident or a member of a rival gang when he accidentally enters Manny's turf). Manny's gang is also responsible for the recent thefts in the apartment where Charley was staying. The police receive daily reports about the increased rate of crime. Shriker arranges to talk with Paul and offers him a deal: Paul can kill all the punks he wants to kill, but has to inform Shriker of any gang activity he hears about so the police can get a bust and make the news. Paul agrees, and moves into Charley's apartment in a decaying building in the middle of a bombed out gang war zone. The building is populated by a group of elderly tenants who are absolutely terrified by Fraker and his gang. Kersey befriends some of them: Bennett Cross (Martin Balsam), a World War II veteran and Charley's good buddy; Mr. and Mrs. Kaprov, an elderly Jewish couple, and young hispanic couple Rodriguez (Joseph Gonzalez) and his wife Maria (Marina Sirtis). After a few violent muggings, Kersey decides to go into action: he uses money to buy a car from a used car shop as bait. When two gang members try to break into the car, Kersey protests, and they reply \"What's it to you man?\" Kersey says, \"It's my car!\" Whereupon they laugh and say, \"now you're gonna die!\" and advance towards Kersey. Kersey quickly pulls out a revolver and shoots them dead. Kersey protects Maria twice from Fraker's gang, but is unable to save her a third time as she is raped (she later dies as a result of her injuries). Kersey orders an automatic gun for protection, a .475 Wildey Magnum, and spends the afternoon handloading ammunition for it stating \"Nothing's good enough for our friends\". He then tests the gun later that night when he kills another gang member, The Giggler (Kirk Taylor), who steals his camera bag and tries to make a clean getaway. He immediately becomes applauded in the neighborhood as Shrieker and the police become involved in the violent acts. Kersey also throws a gang member off a roof (landing on the hood of a car) during a nightly chase sequence. There is also a subplot involving a possible love interest in public defender Kathryn Davis (Deborah Raffin) in which we learn why Kersey is hesitant to get back in the dating game. Kersey later goes back to say good-bye to her, as she is going out of the city to visit her sister. Kersey offers to take her out for dinner on her final night. While waiting in Paul's car, Kathryn is knocked unconscious by Fraker and the car is pushed into oncoming traffic. The car slams into another and explodes, killing Kathryn. The police arrive and Shriker places Kersey under protective custody because Kersey is now in too deep. Bennett takes matters into his hands, after his taxi shop is blown up, in an attempt to drive out Fraker's gang with one of Charley's machine guns, a MG-42. The gun gets jammed as the gang cripples Bennett. Shriker notifies Kersey and takes him to the hospital. Kersey escapes after Bennett notifies him of the one remaining gun. Kersey and Rodriguez spend the day collecting weapons. At the climax, both Kersey and Shriker attack a group of gathering gang members. They mow down many of the criminals with a Browning M1919 A4 machine gun before running out of ammo. Kersey then uses the Magnum while Rodriguez uses a zip gun, while many neighbors begin fighting back as Fraker sends in more reinforcements. Shriker decides to help Kersey and together they kill many criminals before Kersey runs out of cartridges for his Magnum. He goes back to the apartment to collect more ammo, with Fraker in pursuit. Fraker tracks Kersey down to the apartment and Shriker arrives just in time, resulting in Shriker getting wounded in the arm and Fraker shot (however, he wears a bulletproof vest). Kersey obliterates Fraker once and for all with a mail-ordered 66mm LAW rocket launcher. They both hear sirens, and Shriker gives Kersey a head start. Kersey gives a look of appreciation and leaves as the remainder of Fraker's gang retreat.",
      "writers": [
         "Don Jakoby",
         "Brian Garfield"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0089003/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI0MDk3MDEyMV5BMl5BanBnXkFtZTcwOTA3OTQyMQ@@._V1_SY317_CR9,0,214,317_AL_.jpg",
      "actors": ["Stars: Charles Bronson, Deborah Raffin, Ed Lauter | See full cast and crew »"],
      "reviews": [
         "I think it definitely is. The writing is of such a quality that beginner students of the English language should model their conversations after its dialogue. For example, the exchange between Paul Kersey(Bronson) and Ms. Kathryn Davis(Deborah Raffin) (more about this character later) is extremely clear and to the point: Ms. Davis says, \"I hope you like chicken. It's the only thing I know how to make,\" to which Kersey deftly responds, \"Chicken's good. I like chicken.\" If that's not English Grammar 101, I don't know what is. Another thing about this Ms. Davis character: Kersey sleeps with her on the second date after she practically throws herself at him and tells him she wants to see him \"one last time\"(this being only the fourth time they've ever met) before she moves to her sister's house in Binghamton,NY to get away from the creeps; then he really doesn't even bat an eye while her corpse is burning in the street only minutes later. Kersey never even says her first name through the entirety of the film. Not once. Never a \"Get over here, Katy,\" or a \"That's a nice dress you wearing, Kathryn\" or a \"Be careful, Katie, or the creeps'll get ya!\" And while this 'love' is developing between the two, Fraker(Gavan O'Herlihy) keeps his ever-watchful eyes on them. It's almost as if Kersey is using her as bait to get to Fraker, much as he uses the camera or the car. Sure enough, when Fraker bites, Kersey bites back hard...in the most incredible sequence of events ever caught on film! The final fifteen or so minutes are possibly rivaled only by the final thirty minutes of Delta Force in their brilliance. And that's giving Delta Force a lot of credit. In what other film can you see Ed Lauter take out Alex Winter in order to get Charles Bronson's back, a troubled gang leader seemingly calling a hotline to summon neo-nazi bikers to come to his aid, and nimble Broadway dancers wearing mesh halter-tops posing as street punks, all laid down to a soundtrack written by none other than Jimmy Page. If that's not the highest of high comedy, then nothing is funny. Truthfully speaking, there are a thousand ways to state the unintentional comedy of Death Wish 3, but the only way to truly understand it is to watch it and judge for yourself.",
         "There are few movies out there that can honestly be called classics, Deathwish 3 is one. I must have watched this movie dozens of times, yet each time it is just as ridiculously funny. From the outset the movie explodes with laughs. Kersey's trip to jail, where he is threatened by some thug, who apparently high on goof balls, decides to attack the most giant guy in the jail for no reason and is bloodily beaten down. At this point he turns back to Kersey and curses him like it is his fault! Make no sense? Don't let that stop you, there is more where that came from. Next the police inspector beating Kersey up, then abruptly out of nowhere saying, `you see, I'm a big fan of yours'! . There are so many other hilarious plot inconsistencies. Mr.Kaprov saying `Mr.Kersey, it's 90 degrees outside!' as he is wearing a full shirt and thick sweater! Or Kersey's friend Charlie, who somehow managed to smuggle back two massive machine guns from Korea. Did he take that in his carryon luggage on the trip back? Add to all this lame romance that Kersey and the public defender have and you have the making of a masterpiece. For whatever reason, the desperate woman wants a date with Kersey. The romance that ensues is epic, until unfortunately, like all women that Kersey dates, she is horribly killed. The final piece of the puzzle is some of the best one liners in any movie. Some include, `it's your wife, she is sick or... something' Fraker, `bulletproof just like yours asshole' Fraker, `they call him the giggler, he laughs when he runs' Bennet, \"I'll kill a little old lady for you. Catch it on the 6 o'clock news!\" Fraker. I could go on and on. You owe it to yourself to rent this extraordinary film. Truly one of the greatest ever made!",
         "This is how subtle Death Wish 3 is: there's a bit where the stupid chief stamps on a cockroach. That kind of says it all really. Why bother with laws, why bother with a constitution and why bother with a police force \u0096 they only get in the way. What you really need to keep the streets safe is a big gun\u0085and lots of bullets\u0085and maybe a machine gun\u0085 and perhaps a rocket launcher too. Because, hey, if those liberal pinkos have their way there will only be anarchy. Paul Kersey's day starts off really badly. Not only do synthesisers, weeping saxophones, twangy guitars and a smarmy piano accompany his trip to New York, but by the time he gets there his best mate has been killed. How unlucky can you get? Well, to make matters worse, one of the people that kills his best mate is Bill S. Preston, Esq. Oh, and when he gets there, just as his friend is dying in his arms, he gets arrested for his murder. Damn. But then, after getting beaten up by the police, ramming a fat porker's bulbous head through prison bars and enraging the head of a local gang, he gets unofficial approval from the stupid chief to go on a one man killing rampage\u0085which is nice. Death Wish 3 is a guilty pleasure. After all, it's dumb, it's fascistic and it's badly filmed, but a number of people greater than the population of San Marino get brutally killed, so it rules. I mean, how can you not dig a film where people are set on fire, thrown off buildings and shot at point blank range with a rocket launcher? Anyone with a penis should enjoy this. So if you don't like it, you're probably either a woman or Dale Winton. Where do I start when it comes to the best death in Death Wish 3? The rocket launcher killing is a classic, but the firebombing is probably even better \u0096 the punks firebomb the flat of an elderly couple and they come running out, in flames, and then get mowed down with Uzis. But then there's death by broom and all the machine gun slayings. However, I also dig the bit when a bunch of bikers, in leather daddy gear, get blasted to pieces by a bunch of disgruntled neighbourhood residents. An armed society is a polite society. But this praise for other characters takes away from the Bronsoninator's contribution. Never before has one man killed so many people. He mows down punks with his mate's Browning and then he blows them away with his unfeasibly huge Magnum \u0096 normally I'd suggest that Bronson was making up for certain shortcomings, but there's no way the man wasn't hung. And it's his Magnum technique that impresses most. He can dodge a hail of bullets simply by slowly crouching down on one knee. Genius! And then there are the people he kills. One man, who's trying to rape a black woman, is the spitting image of Freddie Mercury. Another, who he throws off a roof, is Frost out of Aliens. And he even kills The Giggler! \"They killed The Giggler, man! They killed The Giggler!\" But perhaps the best Bronson killing is the one where he coolly kills a couple of punks who are trying to nick his car. At the time he's having dinner with a Jewish couple, but he politely excuses himself, shoots the punks and finishes his grub. What a gentleman. But it's not all fun and games. Bronson's lady gets killed. But the woman should have known better. Any woman that gets close to the Bronsoninator is immediately doomed. It's the James Bond rule. I mean, we can't have our bloodthirsty heroes suddenly become happy and content, can we? So she has to die. And at least she goes out in style. She gets a headbutt for her troubles and then succumbs in a car crash. Of course, just in case she might survive, the car spontaneously blows up. You've got to make sure. Not that any of this seems to bother Bronson. He merely goes along with his bloodthirsty rampage, squinting at the targets he's going to blow into bloody pieces. And what of his targets? Well, the gang he takes on is isn't especially formidable. In fact, they're rather camp. They wear bandanas, headbands, string vests, fingerless gloves, sleeveless shirts, leather jackets, chain belts, lots of studs and one even wears a cute little cut off vest so that he can show off his rock hard abs. Actually, now that I think about it, they dress and prance like a bunch of failed Fame auditionees. Perhaps that's why they're so mad. They just want to be in a chorus line but they can't get a gig. Maybe that's why they kidnap, rape and kill the Mexican lady. They want to get their own back on any tang they can get their hands on. The way they emerge from their hiding place \u0096 the bushes, of course \u0096 certainly suggests this. They leap out like coked-up ballerinas. But they all get brutally killed, so their Broadway ambitions go unfulfilled. But hey, who cares about the punks? Not I. Indeed, Death Wish 3 has made me see the light. All we need to keep the streets safe are viscous vigilantes, dispensing their wonderful brand of arbitrary justice. Only then will we be free from the tyranny of punks, hoods and lowlifes. I never knew that a Jewish food critic could be so delightfully fascist.",
         "Oh my word!! I have never seen a film so lacking in any kind of moral judgement or consideration for anything other than the death of the scum! Michael Winner here makes a valid observation of human desires in displaying a gung-ho troth world of deep and damaged execution. Not only does he spoon feed us with utter hell on earth seen through the face of the moustached Bronson, but he also shows us the spoon he's feeding us with and says \"look at what your watching now look at your self and ask the question: Are you enjoying this?\" And even though you'll tell yourself NO IT CAN'T BE!!!! You'll know that deep down inside you'll know...it's a masterpiece",
         "This movie is truly a classic 80s movie! A must have in any '80s' movie collection! Guns, Bad Guys, CREEPS, Gangs, CHARLES BRONSON and more CREEPS!!!! In my opinion, this is the best Death Wish movie. Tons of non-stop action! And keeping with the classic 80's \"bad guy vs good guy\" movie - this movie is about anything but the norm and all about guns and CREEPS! We see Bronson mowing down thugs and CREEPS with a 30 caliber Korean War heavy machine gun! A HEAVY MACHINE GUN FOR CRYING OUT LOUD! When Charlie runs out of ammo for the Heavy Machine gun, he runs back to his crib and takes up arms with his long range high caliber pistol! This pistol can stop a freakin ELEPHANT and Charlie is putting holes the size of hub caps into bad guys with it! And if that is not enough, Charlie is also packing an anti tank grenade launcher, which by the way, is only good if he can get the CREEPS clumped together. The acting in this movie is \"ha ha\" great and a lot of off the wall actors (mainly playing CREEPS) appear throughout the movie! The film is loaded with memorable one liners and scenes! Heck, my favorite scene/line is where the CREEP leader confronts Broson in Jail and calmly explains to him: \"Tell you what I am going to do ...I'm gonna kill a little old lady ...just for you! ...catch it on the six o'clock news\". Is this film violent? Heck yes! But, you'll laugh and cringe all the way through!!!!",
         "Most critics seem to have dismissed this film, like so many other Charles Bronson vehicles, as just another patchwork of mindless violence. And while there is a fair amount of mayhem, DEATH WISH 3 is not that awful of an effort, particularly for fans of the series and its star. This time out, aging Charlie's Paul Kersey is let loose by a police chief desperate to clean up a rough part of New York City. The trigger-happy vigilante moves into the heart of gang territory, where he once again becomes a one-man army in an urban war of good versus evil. Bronson, at least the \"older\" version, is truly at his best. I'm not saying DEATH WISH 3 is a classic. Indeed to the discriminating eye it has a plethora of imperfections. The characters are generally made of cardboard. The violence is over the top. A man well into his 60s outruns and outspooks dozens of young punks. But in the tradition of the original DEATH WISH and later films such as FALLING DOWN with Michael Douglas, it has a definite crowd-pleasing charm. Who doesn't want to see gangbangers get their due? There are also some great cheesy moments and one-liners so common in 1980s films. When a tenant of his apartment building sees Kersey setting up a booby trap, for instance, the vigilante lightheartedly says he's \"thinning the herd.\" A line only Bronson can truly make work. So you see, the key to enjoying DEATH WISH 3 is to accept it for what it is. It ain't Spielberg and it ain't art. So throw the popcorn in the microwave and have fun with it.",
         "Charles Bronson is back in his most famous role. In my opinion, this is by far the best film of the series and my favorite movie ever. This movie doesn't take itself seriously, because the filmmakers knew that all the social commentary that was necessary was put across in the first film. Golan and Globus made this film for Bronson fans, not for the critics, and it works. DW3 has been unfairly criticized as \"trash\" and \"a weary entry in a worn out series.\" These statements would be true if the film was made to be taken seriously or to spread a statement, but it wasn't. If you take it as what it is, DW3 is just a fun, action packed romp, with Charlie doing to street punks what we all wish we could do. The action is non stop, the atmosphere is great, and the movie is just out and out the best Bronson flick ever made. You can tell that the penny pinching Cannon group spent a lot of money on this one. It is believed that Bronson thought this film was too violent, and that was the reason why Winner didn't direct any of the following entries. I can understand his concern, but as is always the case of sequels, you have to push the envelope even further to pass a previous entry. In any case, this movie was no more violent than any other movie made during this time. What makes DW3 the best of the series and my favorite film ever (not the best, just my favorite), is the action, Charlie's presence, memorable villains, and it's ability to get the viewers to jump on the bandwagon. The first film may be the most technically well made, but this one is the most fun. For once, Charlie actually has some clever lines (although he doesn't say much)and a halfway interesting story, photography, action, and direction to back him up. Charlie has never been more intense or super cool than in this one. Yes, it's exploitive, maybe it does promote stereotypes, and maybe it is the same story as before, but Bronson's films always have and always will stand for defending the common man and giving his audience what they want to see. Many argue that the DW series manipulates its' audience, my reply is that the movies don't manipulate us, the fans are the ones in charge. We demand that Bronson blow away deserving scum, and in turn Winner and Co. deliver the goods. And for those of you who still want to put it down, remember a few things. DW3 was the #1 movie in America when it came out and was among the viewing favorites of millions of people on video and television because they realize that not all films have to be epics, they just have to be fun. **********/10 You can't get any better. John Batchelor",
         "Wow! What a movie! I can't get over how much I enjoy it! I watch this movie time and time again and enjoy it more and more. This is by far and way the best of the Death Wish series. The directing is superb, (particularly the scene with Charles and Ed Lauter patrolling the streets shooting punks to a funky 70's soundtrack.)Winner builds up just the right amount of tension, action, humour and emotion at exactly the right moments. There is a high standard of acting on display here. Apart from Charles's flawless performance, there is a career best from Ed Lauter here as the vigilante cop. The plot is superbly written, the only drawback is, it was too short! (I hope they bring out a DVD version with extra scenes soon) Best Bit:- Hard to choose, there are so many classic scenes. Lookin for trouble ma'an? (You'll know what I mean when you see the film) Best Line:- Tell you what I'm gonna do. I'll kill a little old lady, just for you. Catch it on the 6 o'clock news!",
         "One of the most magnificent movies ever made. The acting of Charles Buchinski (later known as Bronson) is simply outstanding. This is the crown on the career of director Winner, who himself was often quoted saying this was his masterpiece. The plot has been copied many times, but it's never been topped. Wildey J. Moore, the gun manufacturer, many times claimed his brand's growth since the mid 80s can be fully credited to DW3, and rightly so. This is not just a movie, this is art that many generations will admire and appreciate. Although this movie has never been fully appreciated in the USA, it has found a huge following in Europe and Asia, where the movie is regularly shown at film schools and it is still a popular hit in student cinemas all across Europe. All in all, a true classic.",
         "I'm having a lot of trouble trying to figure out how to rate this movie. As an actual film, it can't honestly score more than one star out of five. As pure cheese however, you'd have to give this movie a straight up five out of five. This is probably one of the worst movies I have ever seen. The catch is, it's so bad that it's actually good. Make sense? The movie is infinitely rewatchable and you can always find something new to laugh at every time you pop this sucker in the player. There is very little to tell you about this movie other than if you haven't seen it, you need to. It's unbelievably violent and Ol' Chuck mows down at least a hundred gang members throughout the film's ninety minutes. I can write an entire dissertation on this film but I've already seen it done on the Web on quite a few sites so I'm not going to bother. Just to remind you, the movie is so bad and unintentionally funny (watching the film again, it'd make sense if the filmmakers were going for laughs) that if you haven't seen it, you need to. I'll leave you to ponder this one scene and decide for yourselves whether or not this movie is for you or not: Gang bikers come down the street. Angry civilians wait with a chain stretched across the road. Bikers come and are clotheslined off of their bikes when the chain is yanked upwards. While the bikers are on the floor, the civilians come out and shoot all of them, point blank while they lay writhing on the floor. Men, women and oh yes, children come out and join in the festivities, dancing around the dead bodies of the bikers. Sigh. Instant classic. RATING: * out of *****. SHLOCK-O-CHEESE RATING: ***** out of *****."
      ],
      "genres": [
         "Action",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Cannon Group",
         "Golan-Globus Productions"
      ],
      "summaries": [
         "Paul Kersey, New York City architect and part-time vigilante, returns from L.A. to visit an old friend. Instead, he must avenge his death by fighting youth gangs.",
         "Paul Kersey returns to New York to visit his friend Charley, who lives in one of the worst parts of New York City. But when Paul arrives at Charley's apartment, he finds Charley dying after a vicious beating by a gang led by Manny Fraker, and the police enter the apartment and find Paul standing over Charley's body. Paul is arrested for the murder, but police chief Richard S. Shriker is like Paul with a badge -- he's a big fan of Paul. Shriker offers a deal: Paul can kill all the punks he wants to kill, if he keeps the cops informed about the death count. Shriker releases Paul to go after Fraker. Paul moves into Charley's apartment in a decaying building in the middle of a bombed out gang war zone. The building is populated by a group of elderly tenants who are absolutely terrified by Fraker and his gang. Among the tenants are Charley's friend Bennett, an old watch repairman who keeps a couple of machine guns in his closet. There is also an elderly Jewish couple who live on the first floor. The neighborhood is ruled by Fraker, who wears a reverse Mohawk: He keeps his hair on the sides, but shaves down the middle, to make room for a gang symbol in war paint. Paul buys a .475 Wildey Magnum with exploding big-game cartridges, spends an afternoon planting explosive charges in the bullets, and loads up for war against Fraker.",
         "Paul Kersey, the vigilante, returns to New York to visit a friend. But when he arrives he finds his friend dead, and the police enter and find him standing over the body holding a gun. At the station a police lieutenant recognizes him as the vigilante, and releases to go after the gang that killed his friend, who are led by the deadly Manny Fraker. So Kersey moves into his friend's apartment and along with his friend's friend, Bennett, they try to get the gang and help the neighbors who are being plagued by Fraker and his gang.",
         "Architect/vigilante Paul Kersey arrives back in New York City and is forcibly recruited by a crooked police detective to fight street crime caused by a large gang terrorizing the neighborhoods."
      ],
      "budget": 9000000
   },
   "movielensId": 3432,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1985-11-01",
      "dvdReleaseDate": "2004-02-03",
      "directors": ["Michael Winner"],
      "runtime": 92,
      "movieId": 3432,
      "title": "Death Wish 3",
      "mpaa": "R",
      "actors": [
         "Charles Bronson",
         "Deborah Raffin",
         "Ed Lauter",
         "Martin Balsam",
         "Gavin O'Herlihy",
         "Alex Winter",
         "Marina Sirtis",
         "Tony Spiridakis",
         "Ricco Ross",
         "Kirk Taylor",
         "Joseph Gonzalez"
      ],
      "imdbMovieId": "0089003",
      "originalTitle": "Death Wish 3",
      "genres": [
         "Action",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "jeJ7FDxFUxc",
         "dE7k3ZONXFk"
      ],
      "plotSummary": "Paul Kersey returns to New York to visit his friend Charley, who lives in one of the worst parts of New York City. But when Paul arrives at Charley's apartment, he finds Charley dying after a vicious beating by a gang led by Manny Fraker, and the police enter the apartment and find Paul standing over Charley's body. Paul is arrested for the murder, but police chief Richard S. Shriker is like Paul.",
      "tmdbMovieId": 24873,
      "avgRating": 2.26789,
      "releaseYear": "1985",
      "numRatings": 489,
      "posterPath": "/ike0J7zLCOzfxgBfXExFObM5UYc.jpg"
   }
}