{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0092857",
      "video": false,
      "title": "Death Wish 4: The Crackdown",
      "recommendations": [
         34746,
         24873,
         14373,
         13939,
         15983,
         9395,
         18587,
         14362,
         42552,
         9625,
         33055,
         12764,
         27352,
         20721,
         11119,
         26172,
         36859,
         18998,
         9569,
         19086
      ],
      "backdrop_path": "/6hEJavVyTyrMmD81yFnyhdqSshe.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "Social Justice Sally",
         "id": "58b0472bc3a3682d2400cefe",
         "content": "**Bronson should have shown restraint.**\r\n\r\n**CONTAINS SPOILERS**\r\n\r\nTo be fair, the bad guy did warn Bronson that he would kill the girl - but Bronson did not listen. He kept on coming at the other guy until the guy delivered his promise and killed the girl. Bronson pushed the guy into it. He _did_ warn Bronson. Here is the unacceptable part - _Bronson then mercilessly blows him to pieces._\r\n\r\nThe man was trying to reason with Bronson and gave him ample warning but Bronson just opted for a violent conclusion. Bronson should have not killed the man - especially as the guy was trying to make concessions for Brosnan. \r\n\r\nBronson brought it on himself.",
         "url": "https://www.themoviedb.org/review/58b0472bc3a3682d2400cefe"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Paul Kersey",
               "gender": 2,
               "credit_id": "52fe44f6c3a368484e040e8b",
               "name": "Charles Bronson",
               "profile_path": "/hxZR2w0LXX47VKtxibDyZDsTAkH.jpg",
               "id": 4960,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Karen Sheldon",
               "gender": 1,
               "credit_id": "52fe44f6c3a368484e040e8f",
               "name": "Kay Lenz",
               "profile_path": "/sJqpCZrM1IIQetdLrPaLwZDP8Bp.jpg",
               "id": 42174,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Nathan White",
               "gender": 2,
               "credit_id": "52fe44f6c3a368484e040e93",
               "name": "John P. Ryan",
               "profile_path": "/lMdObPGv8eNscCpC0ICYSc01t75.jpg",
               "id": 15213,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Ed Zacharias",
               "gender": 2,
               "credit_id": "52fe44f6c3a368484e040e97",
               "name": "Perry Lopez",
               "profile_path": "/bpw3oCVkAasOd8A2uwy60pnSXoD.jpg",
               "id": 12295,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Detective Reiner",
               "gender": 2,
               "credit_id": "52fe44f6c3a368484e040e9b",
               "name": "George Dickerson",
               "profile_path": "/htojA9mRgJ5vM1JeRNUshLNwzJ5.jpg",
               "id": 11792,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Det. Phil Nozaki",
               "gender": 2,
               "credit_id": "52fe44f6c3a368484e040e9f",
               "name": "Soon-Tek Oh",
               "profile_path": "/6ZNOhKG5ZhqVhVb3qbdZSZ1np65.jpg",
               "id": 10345,
               "order": 5
            },
            {
               "cast_id": 25,
               "character": "Erica Sheldon",
               "gender": 1,
               "credit_id": "52fe44f7c3a368484e040ef3",
               "name": "Dana Barron",
               "profile_path": "/pA96AvipoiQxNck5Kvxt3sQPkTZ.jpg",
               "id": 1217003,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Randy Viscovich",
               "gender": 2,
               "credit_id": "52fe44f6c3a368484e040ea3",
               "name": "Jesse Dabson",
               "profile_path": "/cm9zw4FgoaN85eCYDFKL7Lma0dV.jpg",
               "id": 98609,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Nick Franco",
               "gender": 2,
               "credit_id": "52fe44f6c3a368484e040ea7",
               "name": "Peter Sherayko",
               "profile_path": "/wrhEeUhNshT1lpzJjHsd1XDgXSx.jpg",
               "id": 113781,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Vince Montono",
               "gender": 2,
               "credit_id": "52fe44f6c3a368484e040eab",
               "name": "James Purcell",
               "profile_path": "/zxzl87hdbxhK7V63z0MWMlaJ9XN.jpg",
               "id": 46904,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Danny Moreno",
               "gender": 2,
               "credit_id": "52fe44f6c3a368484e040eaf",
               "name": "Michael Russo",
               "profile_path": "/p9zxNz3Rk86LzwYzgd3Zo4XsF1v.jpg",
               "id": 142162,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Art Sanella",
               "gender": 2,
               "credit_id": "52fe44f6c3a368484e040eb3",
               "name": "Danny Trejo",
               "profile_path": "/7b8cDfrmeheQbgryfCm7MeJOxxM.jpg",
               "id": 11160,
               "order": 11
            },
            {
               "cast_id": 26,
               "character": "Tony Romero",
               "gender": 2,
               "credit_id": "56b23ec692514103450003fd",
               "name": "Dan Ferro",
               "profile_path": "/fsoBer43z0W0GNk3KPSvjtfIWQr.jpg",
               "id": 34841,
               "order": 12
            },
            {
               "cast_id": 27,
               "character": "Jack Romero",
               "gender": 2,
               "credit_id": "56b240159251410336000472",
               "name": "Mike Moroff",
               "profile_path": "/zwq1DD5Xt76wm9OY7mou3erUt13.jpg",
               "id": 100260,
               "order": 13
            },
            {
               "cast_id": 28,
               "character": "Marilyn - Kersey's Secretary",
               "gender": 1,
               "credit_id": "5a986a79925141546b006d34",
               "name": "Michelle Michaels",
               "profile_path": null,
               "id": 1891382,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44f6c3a368484e040e81",
               "name": "J. Lee Thompson",
               "profile_path": "/cVHgJwHOh4j7q1tn3vQEcopblrJ.jpg",
               "id": 18669,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe44f6c3a368484e040e87",
               "name": "Gail Morgan Hickman",
               "profile_path": null,
               "id": 94975,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f6c3a368484e040eb9",
               "name": "Brian Garfield",
               "profile_path": null,
               "id": 70645,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f6c3a368484e040ebf",
               "name": "Yoram Globus",
               "profile_path": "/bKbeXNvErtCQiK3pEEnFgmR9cvo.jpg",
               "id": 33009,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f6c3a368484e040ec5",
               "name": "Menahem Golan",
               "profile_path": "/qGtHMLd4E7tRyw75H4lWTRelW7B.jpg",
               "id": 33008,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f6c3a368484e040ecb",
               "name": "Pancho Kohner",
               "profile_path": null,
               "id": 237036,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f7c3a368484e040ed1",
               "name": "John Bisharat",
               "profile_path": null,
               "id": 1185098,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f7c3a368484e040ed7",
               "name": "Paul McCallum",
               "profile_path": null,
               "id": 1185099,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f7c3a368484e040edd",
               "name": "Valentine McCallum",
               "profile_path": null,
               "id": 1096248,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f7c3a368484e040ee3",
               "name": "Gideon Porath",
               "profile_path": null,
               "id": 1096222,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f7c3a368484e040ee9",
               "name": "Peter Lee-Thompson",
               "profile_path": null,
               "id": 70750,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f7c3a368484e040eef",
               "name": "Whitney Brooke Wheeler",
               "profile_path": null,
               "id": 1185100,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 7.951604,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 26263,
      "vote_count": 66,
      "budget": 0,
      "overview": "After the death of his girlfriend's daughter from a drug overdose, Paul Kersey (Charles Bronson) takes on the local drug cartel.",
      "similar": [],
      "original_title": "Death Wish 4: The Crackdown",
      "runtime": 99,
      "poster_path": "/8yVdLJa5ywqwNAKU1nmUtDJlx8b.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/5jvFLUVXGXxkyszL9cqJN5hNhJ6.png",
         "name": "Cannon Group",
         "id": 1444,
         "origin_country": ""
      }],
      "release_date": "1987-06-11",
      "vote_average": 5.4,
      "belongs_to_collection": {
         "backdrop_path": "/m3K7AXN8Wi6VIRtVlpF1E6nzEn1.jpg",
         "name": "Death Wish Collection",
         "id": 14377,
         "poster_path": "/3mC5lppASzZHx5IlmFSL6cPQpCP.jpg"
      },
      "tagline": "This time it's war!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["J. Lee Thompson"],
      "runtime": 99,
      "synopsis": "A woman is walking to her car in the parking garage. She gets in and has trouble starting her car. Three thugs appear, break into her car, force her out, and begin to rape her when Paul Kersey (Charles Bronson) appears out of nowhere. He shoots the first two thugs, but wounds the third. He follows the third mugger as he attempts to escape the parking garage, but Kersey quickly blocks the exit. The third mugger pleads for his life, but Paul shoots him dead. He rolls the criminal over with his foot, and reveals the criminal to be himself. It is then revealed that the whole assault was a dream as Paul wakes up in a cold sweat. The next morning, a young woman enters Paul's architectural design office in Los Angeles, and it is revealed to be Erica (Dana Barron). Paul is dating her mother Karen Sheldon (Kay Lenz). Erica goes out later that evening with her boyfriend Randy Viscovich (Jesse Dobson) to the arcade to meet up with Jojo and his buddy. Jojo offers Erica crack, and she dies from an overdose. The next night (without any explanation), Paul follows Randy to the arcade where Randy confronts Jojo and threatens to go to the police and tell them everything. Jojo kills Randy to prevent this. Kersey shoots JoJo, who falls onto the electrified roof of the bumper-car ride. Paul arrives back at his house where he receives a note and a phone call from publisher Nathan White (John P. Ryan), who tells him that he knows about the death of JoJo. Nathan explains to Kersey that after Nathan's wife died, his daughter became his whole life. Then she became addicted to drugs, and died of an overdose. Nathan wants to hire Kersey to wipe out the drug trade in L.A. and in particular to target Ed Zacharias (Perry Lopez) and Jack Romero (Mike Moroff), rival drug kingpins who are the city's two main drug suppliers. Kersey asks for a few days to think about it, and after a few days, he accepts Nathan's offer. Nathan supplies Kersey with weapons and information so Kersey can go after Zacharias and Romero. All the while, two L.A. detectives, Reiner (George Dickerson) and Phil Nozaki (Soon-Tek Oh), are on Paul's trail of destruction. Paul infiltrates Zacharias's mansion where Ed Zacharias is throwing an elaborate birthday party. As Paul Kersey bugs Zacharias's phone, he unwittingly witnesses Zacharias murder one of his colleagues, Vincent, due to betrayal. Zacharias captures Paul, and tells him to help take Vincent's body out in order for his silence. Another of Zacharias's gang's members offers to help, and they take the body out and hide it in the trunk of the car. Knowing that he is to be killed, Paul kills the hired hitman in self defense and walks away from the crime scene. Paul kills three more men in an Italian restaurant, kills a drug dealer disguised as a video store owner and two of his assistants, as well as Romero's top hitman, Frank Bauggs (David Wolos-Fonteno). All the while Zacharias and the Romero brothers begin to suspect each other's involvement. Eight more of Zacharias's men are killed at the fisherman's wharf by Kersey. Zacharias is informed by Nozaki, revealed to be corrupt, to kill whoever is setting him up. Nozaki tracks Kersey at work and tries to get information out of him. Nozaki attempts to kill Kersey, but Kersey shoots him dead. Detective Reiner learns about Nozaki's death (not knowing about his corruption) and swears vengeance on the vigilante Kersey. In an act of retribution, Zacharias calls Jack and wants to talk to him. They arrange a meeting place at the oil fields. Kersey is already there and fires his rifle. Zacharias thinks that it is Jack's crew who is doing it and opens fire. They kill each other as Kersey kills Tony and Zacharias. Nathan calls, congratulating Kersey on a job well done, and asks to meet with him tonight. Kersey arrives at the meeting place, but Nathan sends his limo driver instead. Kersey hops in the limo, and realizes he's been set-up after the limo driver jumps in White's car. Kersey shoots the back window with the PP and makes it out before the limo explodes. Kersey forces his way into Nathan's house demanding to see Nathan. An old man living there claims to be the real Nathan White, having returned from a three-month vacation. Kersey drives back to his apartment, only to be pulled over and arrested by two cops. On the way to the downtown police station, Paul immediately recognizes them as impostors. He flips over the car, killing one, and knocking the other unconscious. Back at his apartment, Paul Kersey comes face-to-face with Reiner. Kersey tries to inform Reiner about his partner's corruption, but Reiner does not buy his story. The impostor Nathan White (his true name isn't revealed) is mad that Kersey is still alive, and uses Karen to lure him into a trap. He leaves a message, but hangs up before Kersey is given time to answer. To get away from Reiner, Kersey pretends to speak to him and knocks Reiner out cold. He pulls a rifle with a grenade launcher from his gun rack. Kersey arrives with car at the meeting place. The car rolls forward as White orders his men to open fire. They spray the car with bullet holes before realizing Paul's not in the car. Kersey fires a grenade, killing three as the car explodes. He also shoots Jesse's car, with Jesse inside, as he makes his escape. Kersey follows them into the roller rink where he kills six more thugs. White escapes through the back door as Kersey follows. Karen escapes his grasp, but is shot in the back while attempting to run. Realizing White is now out of bullets and distraught by Karen's death, Kersey fires a grenade that finishes him off. Reiner arrives and orders him to surrender, threatening to shoot as Kersey walks away. Kersey replies: \"Do whatever you have to.\" Reiner lets him go.",
      "writers": [
         "Brian Garfield",
         "Gail Morgan Hickman"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0092857/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMyMzkyMDYxNF5BMl5BanBnXkFtZTcwMTM4NTQyMQ@@._V1_SY317_CR9,0,214,317_AL_.jpg",
      "actors": ["Stars: Charles Bronson, Kay Lenz, John P. Ryan | See full cast and crew »"],
      "reviews": [
         "\"Death Wish 4\" is easily my favorite of the DW series, even though I really like most of the first entry. But you see, I find graphic, luridly depicted rape in films distasteful. I could take it in the first film, because there was at least some thematic and emotional need for it (though I still think it was overboard and gratuitous). Parts 2 and 3 escalated the rape and humiliation sequences and writer/director Michael Winner actually seemed to be trying to get us to enjoy the sight of tortured, crying, beaten, naked woman as much as he obviously did; combine this with zero plot, zero character development, and inept action, and you had some really, really bad flicks. Number four was directed by J. Lee Thompson, a frequent collaborator with Bronson since 1976's \"St. Ives.\" Thompson took the usual DW revenge formula, eliminated the obligatory rape sequence, and ratcheted up the action. So what we have is a Death Wish picture more similar to \"Murphy's Law\" than any of the other films in the series. Of course Bronson's 80s films are often the butt of jokes (to those who remember them at all, that is) but I happen to enjoy them immensely--there's just something I dig about this charismatic, elderly guy running around shooting bad guys; I can't even explain it. If you dig the salt and pepper Bronson as well, then give DW4 a try.",
         "My friends and I started watching Bronson movies for the pure humor. It wasn't long after the fact that I found Bronson to one a biggest bad a$$es in movies. In This movie he is well over sixty and he still takes down three gangs and an arcade.My Grandpa can't move much let alone blow people up with a wine bottle bomb. SO if you want to laugh at some really bad acting, but at the same time see a legend at work and have a chance to be exposed to the man know as Bronson. I think this is a good movie to start with. Start here and work your way back. You will find your way to some great movies. My favorite is Once Upon A Time In The West or Hardtimes. Bronson Lives",
         "Sometimes reviewers get so caught up in their own little vision of what entertainment ought to be that they can't loosen up and just enjoy a movie for what it is. Case in point is \"Death Wish 4: The Crackdown.\" Charles Bronson returns as mild-mannered vigilante Paul Kersey, only this time he's taking on a powerful drug cartel, his girlfriend's daughter having died of a crack overdose. Backed by a mysterious publisher named Nathan White, Kersey yet again transforms himself into a one-man army dishing out justice where justice is due. Of all the \"Death Wish\" films, this ranks not only as one of the best, but as the most complex. The plot takes an interesting twist or two, particularly when it appears White is not who appeared to be and Kersey pits rival drug dealers against one another. It's also fun to watch Kersey employ his inventive methods of \"thinning the herd\" (as he put it in a previous \"Death Wish\"). The scene where he passes himself off as a wine salesman, for instance, is great. Who would have thought an explosion that massive could result from such a small bottle-disguised bomb? And besides all of that, who doesn't want to see drug dealers get what's coming to them? Is \"Death Wish 4\" slightly cheesy? Perhaps. Are the characters deep and the production values high? No. Is it completely outlandish to see a senior citizen pickin' off bad guys? Sure. But nobody ever claimed that this movie was going to win awards. Producers just wanted to give their intended audience a good time, and in that task, they succeeded.",
         "This is a good fun movie. The story is basically Charles Bronson killing gangsters! Imagine Grand Theft Auto 3 as a movie, and you got The Crack Down! The ending to the film is even somewhat of a remake of Yojimbo! I definetely recommend this movie to action lovers! This will not let you down! For God's sake, there's a roller rink shootout!!!! 5/5 STARS",
         "Every once in a while we stumble onto film that has a bad reputation for some unknown reasons, but we can't help but love it. DW4 is that kind of a film. Don't get me wrong, I can watch and appreciate films like Ben Hur (1959) or To Kill A Mockingbird (1962), but unlike great deal of the critics community, I keep an opened mind and don't confine myself to these sort of films. Death Wish 4 opens with a brutal and nail biting sequence (I won't spoil) and doesn't let you of the hook until the final minutes. Paul Kersey is now living happily with his girlfriend and her daughter Erica in LA Until one evening Erica dies of OD. Kersey decides to revenge those who in the drug business with the help from rich and respectable newspaper owner who's daughter also died from use of Cocaine. This time the direction goes to the legendary director who gave us in the 60's such classic as The guns of Navarone (1961) and Cape Fear (1962) and he managed to take the DW series into a good direction. The action is great and dialog is a bit cheesy at times but very entertaining. Here we have all the elements of an action film that we loved over the years: Corrupted cop, twist at the end etc\u0085 Charles Bronson is as his usual great here and in the supporting cast Perry Lopez shines as the sleazy mob boss Ed Zacharias. I highly recommend this film and give it 10 stars.",
         "In Charles Bronson's fourth outing as vigilante killer Paul Kersey in Death Wish 4: The Crackdown, he's hired by mysterious millionaire John P. Ryan for his professional services. The daughter of female companion Kay Lenz just died from an overdose and Bronson killed the person responsible. Ryan tells Bronson he's had a similar tragedy in his family, but with his connections and Bronson's skill he can really do a lot of damage to the drug trafficking in Los Angeles. So Bronson is off to do his thing. But all is definitely not as it seems. Especially since he's now taking on a higher level of crinals than just street punks as he did in the previous three Death Wish movies. In the three previous Death Wish films Bronson has gone up the scale in terms of ingenuity in his public service homicides. He's not just a guy with a large gun any longer. You would definitely think that Bronson did this full time instead of just a sideline with his real job being an architect. But let's just say the wool is truly pulled over his eyes in Death Wish 4: The Crackdown in a way I certainly couldn't believe. It makes the film quite unreal and down right dumb at times. It's the weakest of the Death Wish series and let's let it go at that.",
         "Despite being absolute garbage DEATH 3 was a hugely entertaining franchise movie . It might have been entertaining for all the wrong reasons but it was amusing enough for me to give THE CRACKDOWN the benefit of the doubt when it was broadcast earlier tonight . It starts well enough to continue the campy feel of the third film . A woman walks through a darkly lit car park . Her car fails to start then she looks to see The Masked Magician standing there . She tries starting the car again the fear written upon her face . Now David Blaine stands alongside The Masked Magician . Morbid panic sets in . The woman realises as this rate the worst thing in the world is going to happen - yes now David Copperfield stands alongside the duo who want to use her in their next trick . Thankfully Charles Bronson turns up to execute these rude magicians only to find he's shot himself and .... it's all been a dream If you've ever attended a class featuring the mechanics and science of screen writing then you'll been warned straight away that never EVER start a film off with a dream sequence , a rule that has just been broken here . Strangely this explains why the opening sequence feels so unreal . It's a dream therefore it's supposed to be surreal so kudos for the production team for at least understanding internal continuity . Unlike DW3 this movie does take place in a recognisable world but the longer it continues the longer you wished the franchise had died in the previous movie for two reasons The first reason is that it's deadly dull . Say what you want about DW3 but at least it's amusing if not laugh outloud funny as you're able to point out how it would be impossible for the events on screen to happen in \" our world \" . Not here where there is a sort of reality involved . There are some ridiculous moments to THE CRACKDOWN such as Bronson having a machine pistol that has a magazine capacity of several hundred rounds but you've seen that type of goof in so many movies it has become part of cinematic convention . Nearly every 80s action thriller suffers from the same flaws The second reason the movie is so bad is the entirely naive attitude towards cocaine . I wish to state I have never tried a class A drug but I know many people who have . I think nothing less or more for them having done so . Drugs are bad I do agree but the almost obscene rant that his movie takes against users and dealers is not even bad enough to be amusing . Teenage girl takes cocaine for the first time and dies . Hands up anyone who knows someone killed by cocaine ? We're all in the same boat then aren't we ? On top of that Bronson's character spent the first three movies killing muggers , rapists and other human garbage so why does the movie take the offensive stance that someone being killed by drugs is the same moral equivalence as someone being murdered ? As you can imagine Charley boy kills all the bad guys and for some strange reason never realises there will be a few other coke cartels coming along in a few minutes . Maybe being a vigilante he possess a clear insight that if you kill drug dealers no one will take their place unlike what happens in say the real world ? Oh dear I'm starting to realise maybe DW3 was a fly on the wall documentary compared to this ! Just shows what a badly thought out and naive movie it is after all",
         "WARNING: This review has MAJOR spoilers! In this one, Paul Kersey is back in L.A. and his girlfriend's daughter dies from a drug overdose. The dealer who gave this girl the drugs kills the girl's boyfriend and then Paul goes out and kills the dealer. Paul gets ticked off because his girlfriend's daughter is dead, so he goes out and kills the main drug lords. He does some cool stuff in this one. In one scene, he puts a bomb in a bottle of wine and it explodes, killing the bad guys. In another scene, he throws a guy off of a huge building. The guy's date is complaining about how long it's taking him to go, and she says \"I hope he drops dead.\" Well, she got her wish. The guy falls onto the limo that they're in. This movie is great. There's a shootout in the roller-skating rink. There's a huge gang war. The opening scene is great. A girl is getting raped by three punks, but Paul goes up to them. \"Who the (insert \"f\" word here) are you?\" asks the punk. \"Death.\" replies Paul. He then shoots the three punks. The last scene is the best. Paul kills the main villain with a rocket launcher. How freakin' cool is that? This is some good stuff! You have to see this if you're a fan of Bronson. 9/10. Rent it, or buy it. I've got it on VHS. I bought it with another Bronson movie(Assassination)for about 6 bucks. 9/10.",
         "Death Wish 4: The Crackdown is set in Los Angeles where architect & ex vigilante Paul Kersey (Charles Bronson) has been happily living with his girlfriend Karen Sheldon (Kay Lenz) & her teenage daughter Erica (Dana Barron). While out with her boyfriend Randy (Jesse Dabson) Erica is given some cocaine by a dealer, later that night Paul & Karen get a phone call to say Erica is in hospital because of an overdose. They rush to be with her but it's too late & Karen dies. The following day Paul is contacted by supposed newspaper publisher Nathan White (John P. Ryan) who says that he too lost a daughter to drugs & that all drug dealers & smugglers deserve to die & if Kersey wants to dole out a little justice to the drug dealers in Los Angeles he will finance it & give Kersey all the information he has, never one to turn down the opportunity to kill some scum Kersey agrees & sets-out to bring the Los Angeles drug trade & those who run it down all by himself... Directed by J. Lee Thompson after Michael Winner declined to come back to the series after directing the first three Death Wish 4: The Crackdown is a better film than Death Wish 3 (1985) but isn't quite as much fun or quite as entertaining. Death Wish 4: The Crackdown is more of a straight laced thriller in the style of the often imitated Yojimbo (1961) in which Bronson plays two rival drug gangs off against each other in order that they will literally wipe each other out but with a few Death Wish style touches like rape, dirty cops & yet another person close to Kersey getting killed. I mean it's just dangerous to know this guy as your likely to either end up raped or murdered. Unlike Death Wish 3 which was a really silly & mindless exploitation flick Death Wish 4: The Crackdown tries to have a little social relevance & bases it's unfortunate events around drugs, the perils of taking drugs & the evils of pushing drugs. In fact the film starts off quite anti drug with a tour around an LA county morgue in which most of the bodies there are drug related & Karen a journalist trying to write a story about the dangers of drugs but even her editor saying no-one cares anymore but this moral preaching & social message is soon completely ditched in favour of a fairly entertaining action thriller as Bronson plays the two gangs off one another & if you throw in a couple of neat twists then this really ain't too bad. Death Wish 3 had everyone know who everyone else was & Bronson was the face of vigilantism but here he stays in the shadows & the two drug gangs don't know who he is which makes for a more plausible if not entirely realistic film too. There's also a terrific dialogue exchange here that is maybe the hight light of the series where a dirty cop threatens Bronson & says 'I can be very nasty' before Bronson blows him away with a concealed gun & replies without a hint of irony 'so can I'. The pace is generally good but although it's an improvement on the previous film in terms of plot, themes & narrative there's a loss of entertainment value somehow, it's just not as much fun even if it does work better as a film. The film looks alright, it's much more competent than Winner's Death Wish 3 but again somehow it just loses a little entertainment value because of it. The violence is kept to shoot-outs & bloody gunshot wounds along with a brief rape at the start. I have to hand it to John P. Ryan who gives it his all & just check out his 80's clothes at the end. The action scenes are workman like & are not particularly memorable but get the done. Bronson also scales down his arsenal here too so there's no rocket launchers or huge machine guns. With a supposed budget of about $5,000,000 this has solid if unspectacular production values, the action scenes are alright if a little flat & I would have liked to have seen more things explode. Explosions are good. Again Bronson stars & actually comes across as quite tough while John P. Ryan is a total hoot here. Death Wish 4: The Crackdown is a decent enough vigilante flick with a hint of Yojimbo thrown in there, it's not brilliant but it's not too bad either. Fans of the series should like it, followed by one more sequel Death Wish V: The Face of Death (1994).",
         "After death wish 2 and 3 came out, the series seemed, to well, have a death wish. 2 was unremarkable, and 3 cared more about a very high body count then anything. Unlike in 3, the relationship between Kay Lenz's character and Kersey doesn't seemed forced, doesn't seem like ti was tacked on like the third entry. the fourth entry seemed to be a better level then the previous. Not as good as the first, face it, hardly any action flick with a vigilanty storyline as been as good as the first death wish, the 4th one makes kersey a little more human. You want him to find those responsible for the death of his girlfriends's teen daughter. You cheer when he gets the bad guy. Personally, I would to have loved to have seen a little more interaction between Bronson and Soon Tek-oh, perhaps one of the most underrated supporting actors in movie history. Overall a decent little flick that doesn't try to outsmart itself."
      ],
      "genres": [
         "Action",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": ["Cannon Group"],
      "summaries": [
         "Paul Kersey, LA architect and part-time vigilante, is fed up with violence and wants a quiet life. However, when friend's daughter dies of overdose, he has no choice but to go to war on drug dealers.",
         "Paul Kersey is back in Los Angeles, and he is dating attractive reporter Karen Sheldon, who has a teenage daughter named Erica. While Erica is at an arcade with her boyfriend Randy Viscovich, Erica dies of a crack overdose. Later, Randy goes back to the arcade, with Kersey following him. Randy confronts JoJo, the dealer that Erica got the crack from. Randy tells JoJo that he's going to the police. To prevent that, JoJo kills Randy. Kersey shows up and blows JoJo away, and watches JoJo land on the electrical roof of the bumper-car ride, where JoJo is electrocuted to death. Next, Paul gets a note and a phone call from publisher Nathan White, who tells him that he knows about the death of JoJo. Nathan explains to Kersey that after Nathan's wife died, his daughter became his whole life. Then she became addicted to drugs, and died of an overdose. Nathan wants to hire Kersey to wipe out the drug trade in LA -- and in particular to target Ed Zacharias and Jack Romero, rival drug kingpins who are the city's two main drug suppliers. Kersey asks for a few days to think about it, and after a few days, he accepts Nathan's offer. Nathan supplies Kersey with weapons and information so Kersey can go after Zacharias and Romero.",
         "Architect/vigilante Paul Kersey takes on the members of a vicious Los Angeles drug cartel to stop the flow of drugs after his girlfriend's daughter dies from an overdose."
      ],
      "budget": 5000000
   },
   "movielensId": 3433,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1987-06-11",
      "dvdReleaseDate": "2004-02-03",
      "directors": ["J. Lee Thompson"],
      "runtime": 99,
      "movieId": 3433,
      "title": "Death Wish 4: The Crackdown",
      "mpaa": "R",
      "actors": [
         "Charles Bronson",
         "Kay Lenz",
         "John P. Ryan",
         "Perry Lopez",
         "George Dickerson",
         "Soon-Tek Oh",
         "Dana Barron",
         "Jesse Dabson",
         "Peter Sherayko",
         "James Purcell",
         "Michael Russo",
         "Danny Trejo",
         "Dan Ferro",
         "Mike Moroff"
      ],
      "imdbMovieId": "0092857",
      "originalTitle": "Death Wish 4: The Crackdown",
      "genres": [
         "Thriller",
         "Action",
         "Adventure",
         "Crime"
      ],
      "youtubeTrailerIds": ["EpBLG3pkpk4"],
      "plotSummary": "After the death of his girlfriend's daughter from a drug overdose, Paul Kersey (Charles Bronson) takes on the local drug cartel.",
      "tmdbMovieId": 26263,
      "avgRating": 1.93434,
      "releaseYear": "1987",
      "numRatings": 297,
      "posterPath": "/8yVdLJa5ywqwNAKU1nmUtDJlx8b.jpg"
   }
}