{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "dolphin",
            "id": 630
         },
         {
            "name": "mascot",
            "id": 6732
         },
         {
            "name": "private detective",
            "id": 155790
         },
         {
            "name": "pets",
            "id": 208152
         }
      ],
      "imdb_id": "tt0109040",
      "video": false,
      "title": "Ace Ventura: Pet Detective",
      "recommendations": [
         9273,
         1624,
         8467,
         2123,
         854,
         9894,
         818,
         816,
         310,
         817,
         1701,
         414,
         9737,
         941,
         9679,
         2109,
         1597,
         9493,
         90,
         7552
      ],
      "backdrop_path": "/d29F2JeMP1S6MQG4o5N6BCpRC3n.jpg",
      "revenue": 107217396,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Ace Ventura",
               "gender": 2,
               "credit_id": "52fe4380c3a36847f8058c7f",
               "name": "Jim Carrey",
               "profile_path": "/5tVf0ow8MX4OwjmVoSa5v7qUDka.jpg",
               "id": 206,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Lt. Lois Einhorn",
               "gender": 1,
               "credit_id": "52fe4380c3a36847f8058ca5",
               "name": "Sean Young",
               "profile_path": "/4zgkRFQruIlaJ4JakNZLoKJ70fH.jpg",
               "id": 586,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Melissa Robinson",
               "gender": 1,
               "credit_id": "52fe4380c3a36847f8058c83",
               "name": "Courteney Cox",
               "profile_path": "/1mBVn6MiP69dxpKJkPCK3ckBuHI.jpg",
               "id": 14405,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Emilio",
               "gender": 2,
               "credit_id": "52fe4380c3a36847f8058ca9",
               "name": "Tone Loc",
               "profile_path": "/o940ZhEYQYrOJdhRnmPrYoc9iOq.jpg",
               "id": 31004,
               "order": 3
            },
            {
               "cast_id": 23,
               "character": "Himself",
               "gender": 0,
               "credit_id": "53de6c230e0a265a990024e7",
               "name": "Dan Marino",
               "profile_path": null,
               "id": 1223629,
               "order": 15
            },
            {
               "cast_id": 27,
               "character": "Riddle",
               "gender": 2,
               "credit_id": "562ec4e5c3a3681b5c00bbb1",
               "name": "Noble Willingham",
               "profile_path": "/wJcquiMa4IVlJZBr7gvJXrbPsI0.jpg",
               "id": 31005,
               "order": 16
            },
            {
               "cast_id": 28,
               "character": "Roger Podacter",
               "gender": 2,
               "credit_id": "562ec508c3a3681b6100c249",
               "name": "Troy Evans",
               "profile_path": "/74r7ajwva1F0yd6moWljQFfqnnR.jpg",
               "id": 31006,
               "order": 17
            },
            {
               "cast_id": 29,
               "character": "Woodstock",
               "gender": 2,
               "credit_id": "562ec55fc3a3681b5900bafe",
               "name": "Raynor Scheine",
               "profile_path": "/o5jW5NDeFPIyETEVJQItQEqmJcx.jpg",
               "id": 21082,
               "order": 18
            },
            {
               "cast_id": 30,
               "character": "Ron Camp",
               "gender": 2,
               "credit_id": "562ec56a9251410a220077b8",
               "name": "Udo Kier",
               "profile_path": "/sTNpaKOBNi7WUJw7jPDrsbGAL4O.jpg",
               "id": 1646,
               "order": 19
            },
            {
               "cast_id": 31,
               "character": "Vinnie",
               "gender": 2,
               "credit_id": "562ec579925141284c00bdfe",
               "name": "Frank Adonis",
               "profile_path": "/gvFFIid37pDICRPlEFYOQdH9mWc.jpg",
               "id": 4692,
               "order": 20
            },
            {
               "cast_id": 32,
               "character": "Roc",
               "gender": 2,
               "credit_id": "562ec586c3a3681b5400c013",
               "name": "Tiny Ron Taylor",
               "profile_path": "/wSA3KPLbETH9JwyJ8ZvCakb4n8h.jpg",
               "id": 98579,
               "order": 21
            },
            {
               "cast_id": 33,
               "character": "Sgt. Aguado",
               "gender": 2,
               "credit_id": "562ec67e925141285700b8c0",
               "name": "John Capodice",
               "profile_path": "/sQuJV9o2FSXr5UBo2MaiTLObXiY.jpg",
               "id": 31007,
               "order": 22
            },
            {
               "cast_id": 34,
               "character": "Mrs. Finkle",
               "gender": 1,
               "credit_id": "582b896fc3a3682358010787",
               "name": "Alice Drummond",
               "profile_path": "/f1O8suDhVloKdPvhyltj017SPTo.jpg",
               "id": 17488,
               "order": 23
            },
            {
               "cast_id": 35,
               "character": "Sexy Woman",
               "gender": 0,
               "credit_id": "582b8978c3a368360f04a375",
               "name": "Rebecca Ferratti",
               "profile_path": "/jkj9xVFHEftdPfuDTxqLF1WgoZr.jpg",
               "id": 928,
               "order": 24
            },
            {
               "cast_id": 36,
               "character": "Mr. Shickadance",
               "gender": 2,
               "credit_id": "582b8982c3a368360f04a37b",
               "name": "Mark Margolis",
               "profile_path": "/ue04GglAWi7FnxLWeESekpRJ8do.jpg",
               "id": 1173,
               "order": 25
            },
            {
               "cast_id": 37,
               "character": "Gruff Man",
               "gender": 0,
               "credit_id": "582b898c9251417b2c046db5",
               "name": "Randall 'Tex' Cobb",
               "profile_path": "/wtRQp99LgNrJ8bF9XyAzbuoekMb.jpg",
               "id": 5177,
               "order": 26
            },
            {
               "cast_id": 38,
               "character": "Toothless Giant",
               "gender": 0,
               "credit_id": "59617ad1c3a368253c0b2ac6",
               "name": "Bubba Baker",
               "profile_path": null,
               "id": 214541,
               "order": 27
            },
            {
               "cast_id": 39,
               "character": "Redneck #1",
               "gender": 0,
               "credit_id": "59617af1c3a3680dec09f4e3",
               "name": "Robert Deacon",
               "profile_path": null,
               "id": 135571,
               "order": 28
            },
            {
               "cast_id": 40,
               "character": "Mascot",
               "gender": 2,
               "credit_id": "59617b0ec3a36828a10dca09",
               "name": "Greg Finley",
               "profile_path": "/i6SUrQqiDiYSHCCHzNBVpqDxs3j.jpg",
               "id": 30029,
               "order": 29
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4380c3a36847f8058c75",
               "name": "Tom Shadyac",
               "profile_path": "/8CtwYIVmCSDQ9F1SXFpifKW0N3v.jpg",
               "id": 4499,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4380c3a36847f8058c7b",
               "name": "Jack Bernstein",
               "profile_path": null,
               "id": 29901,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4380c3a36847f8058c89",
               "name": "James G. Robinson",
               "profile_path": null,
               "id": 4700,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4380c3a36847f8058c8f",
               "name": "Julio Macat",
               "profile_path": null,
               "id": 11506,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4380c3a36847f8058c95",
               "name": "Don Zimmerman",
               "profile_path": null,
               "id": 15005,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe4380c3a36847f8058c9b",
               "name": "Mary Jo Slater",
               "profile_path": null,
               "id": 2121,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "52fe4380c3a36847f8058ca1",
               "name": "William A. Elliott",
               "profile_path": null,
               "id": 1260,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "562ec46a925141285700b853",
               "name": "Jim Carrey",
               "profile_path": "/5tVf0ow8MX4OwjmVoSa5v7qUDka.jpg",
               "id": 206,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "562ec47ac3a3681b4b00b208",
               "name": "Jack Bernstein",
               "profile_path": null,
               "id": 29901,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "562ec487925141284500b1a7",
               "name": "Tom Shadyac",
               "profile_path": "/8CtwYIVmCSDQ9F1SXFpifKW0N3v.jpg",
               "id": 4499,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 30.269649,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 3049,
      "vote_count": 2191,
      "budget": 15000000,
      "overview": "He's Ace Ventura: Pet Detective. Jim Carrey is on the case to find the Miami Dolphins' missing mascot and quarterback Dan Marino. He goes eyeball to eyeball with a man-eating shark, stakes out the Miami Dolphins and woos and wows the ladies. Whether he's undercover, under fire or underwater, he always gets his man . . . or beast!",
      "similar": [
         8920,
         963,
         829,
         856,
         17692,
         281,
         539,
         11596,
         8224,
         9319,
         476631,
         98357,
         192149,
         910,
         175,
         227735,
         177494,
         2841,
         62837,
         2620
      ],
      "original_title": "Ace Ventura: Pet Detective",
      "runtime": 86,
      "poster_path": "/nZirljb8XYbKTWsRQTplDGhx39Q.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Morgan Creek Productions",
            "id": 10210,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1994-02-04",
      "vote_average": 6.4,
      "belongs_to_collection": {
         "backdrop_path": "/aPoX8RAxA9J2XW44Ud0AozTUFop.jpg",
         "name": "Ace Ventura Collection",
         "id": 3167,
         "poster_path": "/qCxH543pScFed1CycwJ1nVgrkOc.jpg"
      },
      "tagline": "He's the best there is! (Actually, he's the only one there is.)",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Tom Shadyac"],
      "runtime": 86,
      "synopsis": "The movie begins with our hero Ace Ventura (Jim Carrey) rescuing a dog from an angry man, all but destroying his car in the process. The dog's owner, an attractive young woman, seduces Ace to avoid paying the detective's fee- a feat that Ace hardly resists. Late in the night at Miami Stadium, a group of individuals break in and steal the Miami Dolphins' mascot- a trained dolphin named Snowflake. Next morning, the Dolphin's Head of Operations Roger Podacter (Troy Evans) and his Chief Publicist named Melissa Robinson (Courtney Cox) are instructed to find the missing Snowflake before the upcoming Super Bowl (out of fear that the theft will affect the superstitious football players). A member of their staff was previously a client of Ace Ventura so they decide to call in this \"pet detective\" in to try investigating. Meanwhile, Ace is trying to capture a rare bird with a reward of $25,000 with no success. After receiving the request from Melissa to investigate, Ace goes to the stadium and takes a look inside Snowflake's tank, finding a small stone in the filter system. Roger spots a team of reporters heading to the tank and is worried (fearing the negative press that would result from knowledge of Snowflake's abduction). Ace poses as an eccentric animal trainer and manages to drive the reporters (Antoni Corone and Margo Peace) away. Later that day, Ace Ventura stops in at the local police headquarters. After an altercation with Sgt. Aguado (John Capodice), Ace meets his friend Detective Emilio (Tone Loc) to find out what leads the police may have. Emilio admits that a missing animal case isn't a priority for the police but they suspect that one of the local animal rights groups, who have repeatedly protested the Miami Dolphin's ownership of Snowflake, may be responsible. At this point, Emilio's superior, attractive female Lt. Lois Einhorn (Sean Young) comes along and throws Ace out. Ace visits his hacker buddy Woodstock (Raynor Scheine) to try and find information relating to the purchase of equipment that would be necessary for handling a dolphin. Woodstock notices several purchases by a man named Ron Camp (Udo Kier), a billionaire who apparently enjoys gathering rare fish. Furthermore, Woodstock notes that Camp donated land to the Miami Dolphins for the building of a new stadium. Ace decides to investigate Ron Camp further and gets into a party thrown by Camp that evening with Melissa. As Camp attempts to seduce Melissa, Ventura investigates Camp's home and finds a large aquarium tank that he assumes holds the missing Snowflake. However, the tank actually holds a large shark and Ace barely escapes with his life. As Melissa and Ace leave the party, her very annoyed and him wet as a hen and with rags instead of pants, the detective notices an unusual ring on Camp's hand, manhandling the billionaire in order to get a closer look. When they return to the stadium, Ace informs Melissa of the stone he found in Snowflake's tank-and Camp's ring had the same kind of stones, but since no stones were missing, Camp was not the one responsible for Snowflake's abduction. The ring in question is a 1984 AFC Championship Ring, won by the Miami Dolphins. Ace decides to personally investigate all the ring-owners to find one with a missing stone, but before long his photographic list of suspects has run out with no results. Melissa attempts to console Ace about his failure to find the damaged ring. Ace is in no mood for her and they trade insults. As Ace goes inside to apologize, Melissa receives a devastating phone call- Roger Podacter is dead. The police investigate Podacter's apartment, learning that Roger's body was found after crashing through a sunroof twenty stories below his apartment balcony. Lt. Einhorn is in charge of the investigation and she is prepared to pronounce Podacter's death a suicide. Ace, however, disagrees, insisting that Roger was murdered. After interviewing Podacter's neighbor (Florence Mistrot), who had heard a scream in the apartment and the manager (who opened the balcony door to check the place), Ace's theory is proven- Roger's balcony door is made of soundproof glass and thus Roger's neighbor couldn't have heard a scream with the door closed- meaning that somebody else closed the door upon leaving the apartment after throwing Roger Podacter over the balcony. Despite proving his theory to the police, Ace is still upset about not finding the correct ring. Melissa takes Ace to the stadium office to investigate paperwork regarding the sale of the rings. There, Ace spots an unfamiliar player face that was not in his previous checklist. Melissa tells Ace that the player is a mid-season replacement kicker named Ray Finkle. Furthermore, Finkle is the player who allegedly kept the Dolphins from winning the 1984 Super Bowl- by missing the final field goal in an event known as \"The Kick Heard Round The World\", a reference to Scott Norwood's missed field goal kick in the closing moments of Super Bowl XXV. The result was Finkle's contract with the Dolphins being canceled and he never played football again. Ace drives to Finkle's childhood home and finds it covered in graffiti and damage from the still-bitter townsfolk. Finkle's father (Bill Zuckert) is outwardly hostile, pointing a gun at Ace until Mrs. Finkle (Alice Drummond), senile yet doting over her absent son. Ventura learns that Ray Finkle was institutionalized in a private hospital several years ago, but escaped soon after. A tour of Finkle's room shows a testament to his hatred of Dan Marino (Dan Marino himself), the player who held the ball for Finkle's Kick and who Ray blames for the whole thing insisting that Marino held the ball \"laces in\" instead of out, per regulations. Realizing that Marino is likely in danger, Ace telephones Melissa and requests extra security for the star player. Marino is filming a commercial for Isotoner gloves when he is tackled by two men in Miami Dolphins uniforms-apparently as part of the commercial. But when the \"Dolphins\" keep carrying Dan after the director yells CUT, everyone realizes what has happened. Ace attempts to stop the abductors but they evade capture. Einhorn finds Ace in her office after a press interview, infuriating her- until Ace mentions the name Ray Finkle. Ace shares his theory with the lieutenant- Finkle has come back to take his revenge right at Super Bowl time, when it will be most harmful to the Dolphins. Snowflake was the first target of revenge because the dolphin had been given Finkle's old number and taught to kick a field goal as part of the halftime show. Ace also theorizes that Podacter was murdered because he recognized Finkle from his previous tenure with the Dolphins. Lt. Einhorn actually applauds Ace's work, making physical advancements towards the pet detective- which Ace rebuffs. Desperate to find out more about Ray Finkle, Ace goes to the mental hospital where the ex-player was held in an attempt to search through any remaining belongings. Melissa poses as an anguished sister looking to commit her deranged, football-obsessed brother to give Ace a chance to explore the hospital. She talks to the doctor (David Margulies) while Ave looks into every room in the hospital. A check of the storage room reveals further examples of Finkle's hatred of Dan Marino along with an unusual news article- the failure of search parties to locate a missing hiker named Lois Einhorn. Emilio checks out Lt. Einhorn's desk at police headquarters, finding a love letter to the lieutenant from Roger Podacter dated several days before Rogers' death. Ace struggles to find the possible link between Finkle and Einhorn but cannot see any viable connection. When Ace's pet dog lies on a picture of Finkle (covering the player's short black hair with long red threads) Ventura finally realizes the truth- Finkle IS Einhorn! Ace is overjoyed at finding the answer, but repulsed by the knowledge that the lieutenant who attempted to seduce him is actually a man. On the morning of the Super Bowl, Ace tails Einhorn to a remote boathouse where Dan Marino and Snowflake are being kept. Ace manages to defeat Einhorn's two henchmen but is caught by Einhorn and held at gunpoint before he can free Marino. Einhorn radios the police for assistance, claiming Ace is the one behind the abductions. Einhorn is distracted by a news report on the Super Bowl, repeating the '84 \"Kick Heard Round The World\" clip. In her rage, Ace is able to overpower her and Snowflake takes the lieutenant's gun away. As the police arrive, Einhorn orders them to shoot Ace- until Melissa arrives holding Emilio at gunpoint to distract the other police officers enough to let Ace finish the case. Ace explains the full details of Finkle's new career and plan, ripping off Lt. Einhorn's clothes in an effort to prove his point. However, Ace's efforts only seem to prove that Einhorn is a genuine female. However, Dan Marino spots the truth- Einhorn has male genitalia tucked between her (his?) legs. Ace realizes that this is why Roger Podacter died- he learned of Einhorn's true gender! Enraged, Einhorn attempts to stab the pet detective but Ace knocks her into the water with Snowflake. Einhorn staggers back out (her red hair now washed back to black thanks to the water) and Ace notices a ring on her finger. Ventura leans over and cheers in triumph- it is indeed the AFC Championship ring, missing a stone. Dan Marino and Snowflake are both returned to the Miami stadium in time for the Super Bowl halftime show. At the same time, Ace spots the rare bird he had been chasing at the beginning of the movie- only to have it chased away by the opposing teams' mascot (Mark Margolis). Ace and the costumed man get into a fight just as the stadium announcer brings the camera onto Ace Ventura to thank the pet detective for his actions in saving the Dolphins.",
      "writers": [
         "Jack Bernstein",
         "Jack Bernstein"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0109040/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAzNTI0ODUxOF5BMl5BanBnXkFtZTgwNTQxNzQxMTE@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Jim Carrey, Courteney Cox, Sean Young | See full cast and crew »"],
      "reviews": [
         "I'm guessing that everybody knows the story of this movie by now, but for those who might not have had the opportunity to see this great movie, it's quite a simple formula. The Miami Dolphins mascot is stolen and by word-of-mouth advertising Ace Ventura (Jim Carrey) is called into manic action. His job is to find the dolphin and return it before The Miami Dolphins' crucial game. Jim Carrey is quite simply amazing, I never stopped laughing the whole way through the movie. This is surely Carrey's best work, even now. OK, Dumb and Dumber and The Mask are very funny movies too, but this takes the biscuit. Everything Ace does made me laugh, from whipping football player's with a towel to get a ring imprint to showing up at a mansion party and being his usual manic self. 100 laughs per hour, if you have a sense of humour, then this movie is for you!!!",
         "Ace Ventura is the kind of comedy that stems directly from a TV show, and in this case, that show was probably In Living Color, where Carrey got most of his publicity before he became famous as a movie actor. A quick look through Carrey's filmography will prove that Ace Ventura is the film that really acted as a springboard for his career. He had a few small roles in films previous to Ace Ventura, the largest of which was probably his role as one of the aliens in the awful film Earth Girls Are Easy, but after Ace Ventura, his career skyrocketed. The Mask (hey, he's still new, give the guy a break), Dumb & Dumber, a sequel to Ace Ventura, Liar Liar, The Cable Guy (oops), The Truman Show (ah, better), Man On The Moon, Me, Myself & Irene, The Grinch, and there's no end in sight. Sure, Ace Ventura does not compare to half of these movies, and is clearly more on the side of the bone-headed comedy that he was doing on In Living Color, but his talent is unmistakable. I first saw this movie when I was in high school, and I remember that I would ditch school and go to the theater to see it and I would laugh hysterically until my sides hurt every time I saw it. There's something about seeing a slob at a tremendously rich party who just doesn't care about the etiquette of the rich people. Did anyone not laugh when he was `testing' the food at Ron Kamp's I'm-the-richest-man-in-the-universe party and stuck his tongue out at that poor guy next to him? That whole scene at that party is classic! And, of course, it only gets better with Ace's dealings with Lois Einhorn. The whole crying game idea may have gone a little too far, but it was always amusing. Jim Carrey saves Ace Ventura from sinking to the totally brainless level of more recent crapfests as the Scary Movies, and even makes this into one of the better comedies of 1994. This is not the type of movie that is likely to win any awards, but you will remember the hilarious dialogue and Jim Carrey's immediately recognizable rubber-faced antics in this film that served as a spring board to his career, which later brought us many more excellent movies. Way to go, Jim.",
         "In 1994, a year that gave us Forrest Gump, Pulp Fiction and The Shawshank Redemption, Morgan Creek Productions and Warner Bros. Pictures came out with the funniest film of the decade, err, 1994, with the Jim Carrey super-vehicle, ACE VENTURA: PET DETECTIVE. Right off the bat, it is a Jim Carrey showcase: chasing missing albino pigeons, rescuing a pampered shiatsu, and making high speed getaways, this all works because it is Ace Ventura, a hilarious, live-action cartoon character who spouts one-liners like an M-16. The premise of the film is that the Miami Dolphin's team mascot, Snowflake the dolphin, has been captured and needs to be found in time for the Super Bowl. Ace is hired and the sexy Courtney Cox is made his partner until the dolphin is recovered. With an assortment of funny situations like Ace falling into a great white shark tank (!), a montage of Ace searching for a missing jewel, Ace head banging in a CANNIBAL CORPSE concert, it's all gold, and as you have read, Ace is what drives this film into comedy genius! It was a busy and successful year for Jim Carrey, as he came out with another pair of comedy blockbusters, the LOOSELY translated Dark Horse comic THE MASK, and his hilarious buddy comedy with Jeff Daniels, DUMB and DUMBER. Thanks to Tom Shadyac for letting Carrey out of the bag and letting this damn funny Canadian strut his lanky stuff. It has some offensive, adult-oriented material, but if caught on television, this is nearly perfect family entertainment: as long as you don't mind your kids talking from their a$$es for the next couple months.",
         "While his later films are good, Ace Ventura is the best of all. Jim Carrey brings his now famous style of acting to the screen. Ace is the kind of guy who you never know what he's going to do next, and that is what makes him so funny. The plot is not the best one out there and the actors in this one are not the best, but this movie is not for intelligent plots and famous actors. It's a whacky comedy that made Jim Carrey a star. The movie is not bad, not at all. Why people think that is just odd and strange. Guess there is no appreciation for good movies these days.",
         "Undeniably juvenile, but funny and entertaining comedy stars Carrey\u0097in his breakthrough role\u0097as a goofy, wildly eccentric pet detective hired to find the missing Miami Dolphins mascot. He's the right man for the job but his childish idiosyncrasies, uncanny bond with animals, and aberrant investigative techniques cause outsiders to question whether or not he can actually make good on his word. Aimed mostly at fans who really enjoy silly humor, others will quickly find it tiresome. There are some amusing cameos by real Dolphin football players (including an engaging Dan Marino) but this film belongs to Carrey and his constant outrageousness. Sure-fire entertainment for fans of this genre. **½",
         "I thought this movie was the best movie Jim Carrey has ever did. It had me and my whole family laughing non-stop! No one could have done this movie the way Jim did. I could go on for hours about how great it is. I could watch it every day! I would give it a perfect 10! The acting in his movie was great. And Courtney Cox did an amazing job as Melissa! She's such an talented and amazing actress! One of the funniest lines: Melissa: Did you have any trouble getting in? Ace Ventura: No, the guy with the rubber glove was surprisingly gentle.",
         "We saw \"Ace Ventura: Pet Detective\" right after \"The Mask\" came out. We could not have possibly predicted how wacky it would be. At the moment when Jim Carrey started butt-talking, my dad shouted out: \"Lee, he's crazy!\" And believe you me, he really was. Anyone who knows anything about the movie probably knows that Carrey plays the title character, who has to find the Miami Dolphins' mascot. But mostly, the whole movie is an excuse for him to be silly. And of course, the woman who played reporter Melissa (Courtney Cox) went on to play the reporter in the \"Scream\" trilogy. Well anyway, Ace Ventura really is a master of disguise, and it's almost hard to believe that after almost ten years of stagnation in comedy, this movie came and changed the way that we think about humor. Hilarious.",
         "Now, these movies can't be taken too seriously. The storyline is silly, the dialog is silly and the concept is silly, with one extraordinary exception: Jim Carrey, who, in contrast, uses his extremely intelligent wit and hugely humorous body actions to make this movie what it is, hilarious. The fact is, this mans arguably a genius, he made a possibly average, run-of-the-mill, 'straight to TV' comedy into an all-time classic. You can switch your brain off and literally laugh yourself to tears watching the scenes in which he acts in. He CARRIES this movie, no doubt and his performance in this is extremely underrated. Being one of his first major roles and to actually manage to single-handedly make this movie what it is with his sheer brilliance at being a comedian-actor, well, it should not be overlooked. But of course, it has it's flaws. The fact is, the scenes without Carrey (Albeit, they're not many of them) really just shows this movie doesn't have much else going for it besides the man himself. Many of the other actors/actresses (Including Courtney Cox) just aren't funny. But this movie, in my opinion, deserves an 8, because it's just really showcasing Jim Carreys excellence. Watch it and believe me, you'll get hooked!",
         "Following the kidnapping of \u0091Miami Dolphins' mascot `Snowflake' Melissa (Courteney Cox) hires Ace Ventura (Jim Carrey) to track the dolphin down before Superbowl Sunday. The Nineties were generally good for Jim Carrey and \u0091Ace Ventura: Pet Detective' is a shining example of sheer Carrey hilarity! Jim Carrey plays his character with his typical, undoubtedly unrivalled, madcap charisma that has now become so famous throughout the world, yet this movie probably remains the greatest example of just how outlandish a Carrey movie can be. The plot is so thin that it becomes obvious that the story was made to suit Carrey's style rather than vice versa and surprisingly succeeds well. Carrey's extremely arrogant and oddball \u0091Ace Ventura' character is unexpectedly likeable and continuously places the viewer in a fit of hysterics with the increasingly wacky scenarios he finds himself in. Carrey's off the wall antics are what made this film and direct attention away well from the flaws that the movie has. It is safe to say that Carrey was the star and provided all the highlights of this movie and while Sean Young (playing Lt. Lois Einhorn) and Courteney Cox in some ways aided the movie they simply came off as bit-part characters rather than stars as Carrey stole the entire show. Capable direction from Tom Shadyac is a further high spot in this movie and recognition should also be given to Jack Bernstein who co-wrote an astoundingly funny script with Jim Carrey. \u0091Ace Ventura: Pet Detective' is certainly one of the finest comedies Jim Carrey has offered the world so far and despite missing the more heart-warming moments that later films such as \u0091Liar Liar' (1997) offered, is a good movie in it's own right. However, as humour is viewer dependant it would be unfair of me to say I recommend this movie to everyone. Those people who dislike many of the Jim Carrey movies will probably not enjoy this one and I can understand why some would condemn this movie as being puerile nonsense. Many of the jokes do border on bad taste and much of the movie has an atmosphere of schoolyard humour to it. I am aware that some people will not find Carrey's zany antics and silly noises funny at all. That being said I personally do enjoy this movie and feel that fans of Jim Carrey and many other people will find this entertaining fun. To sum up \u0096 I feel this is an enjoyable movie for teenagers, young adults and probably for the more open-minded older audience despite being somewhat childish and risqué. Not for everyone though. My rating for \u0091Ace Ventura: Pet Detective' \u0096 7/10.",
         "Ace Ventura ,Pet detective is about an animal lover!! The movie is funny and enjoyable for all ages. Its when the Miami dolphins have there mascot snowflake taken and by circle of gossip he finds himself looking for a bottle-nosed dolphin. In a strange way ace ends up in a murder investigation. If your interested in a great,action filled comedy that this is the movie for you. Sure liar liar is good but this movie blows off the competition.I was laughing through the whole thing , man this movie always gives me a laugh no matter how many times I've seen it i will still laugh 1000 times and more!I think if you ever saw it you would be laughing your socks off too!!! its a great movie too watch any day of the week.Even when your feeling low it'll get you up!!!!"
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Morgan Creek Productions"],
      "summaries": [
         "To be a Pet Detective, you have to understand both the criminals and animals. Ace Ventura goes even further... He behaves like a criminal animal. When a football team's mascot (a dolphin) is stolen just before the Superbowl, Ace Ventura is put on the case. Now, who would want to steal a dolphin, and why?",
         "He's the best there is. In fact, he's the only one there is! He's Ace Ventura: Pet Detective. Ace is on the case to find the Miami Dolphins' missing mascot and quarterback Dan Marino. He goes eyeball to eyeball with a man-eating shark, stakes out the Miami Dolphins and woos and wows the ladies. Whether he's undercover, under fire or underwater, he always gets his man . . . or beast!",
         "A goofy detective specializing in animals goes in search of a missing dolphin mascot of a football team."
      ],
      "budget": 12000000
   },
   "movielensId": 344,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-02-04",
      "dvdReleaseDate": "1997-08-26",
      "directors": ["Tom Shadyac"],
      "runtime": 86,
      "movieId": 344,
      "title": "Ace Ventura: Pet Detective",
      "mpaa": "PG-13",
      "actors": [
         "Jim Carrey",
         "Sean Young",
         "Courteney Cox",
         "Tone Loc",
         "Dan Marino",
         "Noble Willingham",
         "Troy Evans",
         "Raynor Scheine",
         "Udo Kier",
         "Frank Adonis",
         "Tiny Ron Taylor",
         "John Capodice",
         "Alice Drummond",
         "Rebecca Ferratti",
         "Mark Margolis",
         "Randall 'Tex' Cobb",
         "Bubba Baker",
         "Robert Deacon",
         "Greg Finley"
      ],
      "imdbMovieId": "0109040",
      "originalTitle": "Ace Ventura: Pet Detective",
      "genres": [
         "Comedy",
         "Mystery"
      ],
      "youtubeTrailerIds": ["JudjRVhIgns"],
      "plotSummary": "He's Ace Ventura: Pet Detective. Jim Carrey is on the case to find the Miami Dolphins' missing mascot and quarterback Dan Marino. He goes eyeball to eyeball with a man-eating shark, stakes out the Miami Dolphins and woos and wows the ladies. Whether he's undercover, under fire or underwater, he always gets his man . . . or beast!",
      "tmdbMovieId": 3049,
      "avgRating": 2.98881,
      "releaseYear": "1994",
      "numRatings": 45306,
      "posterPath": "/nZirljb8XYbKTWsRQTplDGhx39Q.jpg"
   }
}