{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "martial arts",
            "id": 779
         },
         {
            "name": "biography",
            "id": 5565
         },
         {
            "name": "sport",
            "id": 6075
         },
         {
            "name": "sensei",
            "id": 9362
         },
         {
            "name": "mixed martial arts",
            "id": 9917
         },
         {
            "name": "hong kong",
            "id": 12354
         }
      ],
      "imdb_id": "tt0092675",
      "video": false,
      "title": "Bloodsport",
      "recommendations": [
         10222,
         9594,
         9399,
         10134,
         9349,
         2019,
         17466,
         8831,
         9091,
         9405,
         12721,
         10413,
         9103,
         11667,
         9874,
         9268,
         9972,
         9618,
         3513,
         10861
      ],
      "backdrop_path": "/5xrZTFHhAdlg0WtjkkGDqf4Knck.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 11,
               "character": "Frank Dux",
               "gender": 2,
               "credit_id": "52fe447a9251416c750361e3",
               "name": "Jean-Claude Van Damme",
               "profile_path": "/t9to1GoMzx7IDSBXwzwe1huakFk.jpg",
               "id": 15111,
               "order": 0
            },
            {
               "cast_id": 14,
               "character": "Chong Li",
               "gender": 2,
               "credit_id": "52fe447a9251416c750361ef",
               "name": "Bolo Yeung",
               "profile_path": "/kChDa118ic0VcUo9kPMX7KsLzxG.jpg",
               "id": 58123,
               "order": 1
            },
            {
               "cast_id": 19,
               "character": "Senzo Tanaka",
               "gender": 0,
               "credit_id": "52fe447a9251416c75036205",
               "name": "Roy Chiao",
               "profile_path": "/6gBxdImc8eGHeDDEJGFiGrIwx6O.jpg",
               "id": 695,
               "order": 2
            },
            {
               "cast_id": 20,
               "character": "Captain Chen",
               "gender": 2,
               "credit_id": "52fe447a9251416c75036209",
               "name": "Philip Chan Yan-Kin",
               "profile_path": "/n1o0tAeQgZWJkJJZKkhIcP6PIjC.jpg",
               "id": 70591,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Ray Jackson",
               "gender": 2,
               "credit_id": "52fe447a9251416c750361e7",
               "name": "Donald Gibb",
               "profile_path": "/drLNhfpcY1A8WxTVUE05ja47K9q.jpg",
               "id": 70254,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Victor Lin",
               "gender": 0,
               "credit_id": "52fe447a9251416c750361eb",
               "name": "Ken Siu",
               "profile_path": "/iwVzP5JgHifEPu8VqE0GZRwmN8h.jpg",
               "id": 70255,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Janice Kent",
               "gender": 1,
               "credit_id": "52fe447a9251416c750361f9",
               "name": "Leah Ayres",
               "profile_path": "/1LF7Ldvr9gKYKHBwXAT1UT6HEqs.jpg",
               "id": 114809,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Helmer",
               "gender": 2,
               "credit_id": "52fe447a9251416c750361fd",
               "name": "Norman Burton",
               "profile_path": "/ezoKMuCDcWSnDaB5pVWMyj21E6H.jpg",
               "id": 10195,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Rawlins",
               "gender": 2,
               "credit_id": "52fe447a9251416c75036201",
               "name": "Forest Whitaker",
               "profile_path": "/4pMQkelS5lK661m9Kz3oIxLYiyS.jpg",
               "id": 2178,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe447a9251416c750361af",
               "name": "Newt Arnold",
               "profile_path": null,
               "id": 70250,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe447a9251416c750361b5",
               "name": "Sheldon Lettich",
               "profile_path": "/ecORUrI7PKBO3Mm0aVjen1dSng6.jpg",
               "id": 16590,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe447a9251416c750361bb",
               "name": "Mel Friedman",
               "profile_path": null,
               "id": 70251,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe447a9251416c750361c1",
               "name": "Christopher Cosby",
               "profile_path": null,
               "id": 70252,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe447a9251416c750361c7",
               "name": "Yoram Globus",
               "profile_path": "/bKbeXNvErtCQiK3pEEnFgmR9cvo.jpg",
               "id": 33009,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe447a9251416c750361cd",
               "name": "Menahem Golan",
               "profile_path": "/qGtHMLd4E7tRyw75H4lWTRelW7B.jpg",
               "id": 33008,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe447a9251416c750361d3",
               "name": "Paul Hertzog",
               "profile_path": null,
               "id": 64683,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe447a9251416c750361d9",
               "name": "David Worth",
               "profile_path": "/eelvhT2xXPSrk1ANkFZFwUFHegc.jpg",
               "id": 22012,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe447a9251416c750361df",
               "name": "Carl Kress",
               "profile_path": null,
               "id": 21821,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe447a9251416c750361f5",
               "name": "Mark DiSalle",
               "profile_path": null,
               "id": 64681,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe447a9251416c7503620f",
               "name": "Frank Dux",
               "profile_path": null,
               "id": 56985,
               "department": "Writing",
               "job": "Original Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe447a9251416c75036215",
               "name": "Frank Dux",
               "profile_path": null,
               "id": 56985,
               "department": "Crew",
               "job": "Martial Arts Choreographer"
            }
         ]
      },
      "genres": [{
         "name": "Action",
         "id": 28
      }],
      "popularity": 10.718371,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11690,
      "vote_count": 466,
      "budget": 10000000,
      "overview": "Frank Dux has entered the \"kumite\", an illegal underground martial-arts competition where serious injury and even death are not unknown. Chong Li, a particularly ruthless and vicious fighter is the favorite, but then again Dux has not fought him yet.",
      "similar": [
         55292,
         323677,
         7549,
         44865,
         11134,
         146,
         24,
         140300,
         8456,
         604,
         682,
         605,
         43959,
         14756,
         9462,
         9053,
         1578,
         10637,
         22881,
         45317
      ],
      "original_title": "Bloodsport",
      "runtime": 92,
      "poster_path": "/E4d48dFICxN1tcGywt1p5zBHYJ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/5jvFLUVXGXxkyszL9cqJN5hNhJ6.png",
         "name": "Cannon Group",
         "id": 1444,
         "origin_country": ""
      }],
      "release_date": "1988-02-26",
      "vote_average": 6.6,
      "belongs_to_collection": {
         "backdrop_path": "/1DXtjAAaK7597GV5MSZH6nn0uqS.jpg",
         "name": "Bloodsport Collection",
         "id": 36694,
         "poster_path": "/sTqv7FQalXNVGSpfSJaWek077w9.jpg"
      },
      "tagline": "The true story of an American ninja.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Newt Arnold"],
      "runtime": 92,
      "synopsis": "The movie begins with montages of various hopeful competitors training and practicing their fighting techniques. Interspersed with these montages are shots of the arena where the Kumite will be held. The hosts of the Kumite are rehearsing pageantry and preparing the arena for proper use. Frank Dux (Jean-Claude Van Damme), an army captain at his base, is summoned to a meeting with his colonel before going on furlough. The colonel has found out he plans to travel to Hong Kong while on furlough, and Dux's superiors want to stop him from entering the Kumite, in part because the Kumite is an illegal, underground fight. It is not sanctioned by world martial arts organizations, due to its particularly violent nature. Fatalities, though uncommon and frowned on, are considered part of the risk. Dux stages a daring escape from his base, going AWOL to travel to Hong Kong. The Army dispatches two MPs, Helmer (Norman Burton) and Rawlins (Forest Whitaker) to find Dux and bring him back. Dux first visits the home of his mentor and teacher, Senzo Tanaka (Roy Chiao). He is greeted warmly by Mrs. Tanaka (Lily Leung), who goes to tell her husband that Dux has arrived. Waiting in the living room, Dux becomes lost in thought looking at Tanaka's katana (samurai sword). He begins reminiscing about his long relationship with Tanaka: As a youth, Frank fell in with two unruly boys who made him come with them to try and steal the sword. The boys ran at the sound of people approaching, but Frank started to put the sword back on its stand when he was found by Tanaka and his son, Shingo. Tanaka admonished Dux for stealing, and Dux protested he wasn't going to steal it. Tanaka slices the visor off of Dux's baseball cap and is impressed that Dux didn't even flinch. Meeting with Dux's parents, he convinces them to let him train Frank in martial arts. At first, the young Dux becomes frustrated that he is only learning some of Tanaka's knowledge while Shingo is being trained far more intensively. Shingo is being groomed to represent his family in the Kumite as an adult. But tragedy strikes when Shingo dies as a young adult. A heartbroken Tanaka, having already lost his first family in Hiroshima, chooses to stop all training, believing his family is ended. Dux makes an impassioned plea for Tanaka to train him fully, to compete in the Kumite on Shingo's behalf, to honor both Shingo and Tanaka. Montages are shown of this training, becoming more and more intensive, until at the pinnacle, Dux is able to ignore pain and operate while blindfolded as if still fully sighted. Dux goes to see Tanaka, who is now an old man and showing the infirmities of old age. He tells Dux that when he fights, Tanaka's spirit will be there, fighting beside him, and in the Kumite, he will need it. Dux arrives at the hotel where most of the Kumite participants are staying. He meets Ray Jackson (Donald Gibb) playing a karate video game. The two play the game together and start to bond as friends and as fellow Americans. Jackson is a big, brawny, beer-swilling brawler with a scruffy beard. Not knowing anything of Dux, he likes the smaller man and treats him almost like a 'little brother.' Also at the same hotel, an American journalist named Janice Kent (Leah Ayres) is questioning two men about the kumite. She knows it is being held in Hong Kong over the next three days and is trying to get a story on it. The two men don't acknowledge even knowing what the kumite is. Helmer and Rawlins arrive at the Tanaka home to find out if Dux was there and if the Tanakas knew he was going to Hong Kong. Mrs. Tanaka says that Dux came by to pay his respects, but she doesn't know if he was heading to Hong Kong. Rawlins is sure she does know and tries to press her, but Helmer steps in, simply thanking Mrs. Tanaka for speaking to them. Dux and Jackson go to check in at their hotel and are told that a Victor Lin is looking to speak to them. Lin (Ken Siu) comes across Dux and Jackson at that moment and introduces himself, saying he is one of the Kumite agents and he's been assigned to assist them with their stay in Hong Kong. He leads them through the streets of the city to a run-down, seedy part of the city (no man's land, as Lin calls it), explaining that the Kumite is being held in Hong Kong at the permission of the \"Triad,\" the Chinese Mafia. At the entrance to a back alley being guarded by several tall, burly, stoic men. Victor speaks to them in Chinese, and the tallest of the guards, their leader, lets them all through with a condescending air toward the American foreigners. Victor leads them through the alley to the secret arena where the Kumite will be held. The first step is to properly register for the Kumite. Participation is by invitation only. As Jackson and Dux present their invitations, the officials stop and are very dubious of Dux, because his invitation lists him as being part of the Tanaka Clan. Clearly they know of Senzo Tanaka and are unwilling to believe, at face value, that Dux is a student of Tanaka's. They insist he prove this claim with a demonstration of the legendary \"Dim Mak\" pressure point strike. They show him where several bricks are stacked. To properly demonstrate the Dim Mak, Dux must shatter the bottom-most brick without damaging either of the two bricks stacked atop it. As all the other participants in the arena watch, Dux successfully demonstrates the Dim Mak. The officials accept Dux as authentic and complete his registration. The Kumite participants resume training and sparring, except for one-- a large, burly Chinese man named Chong Li (Bolo Yeung) who is not impressed, warning Dux, \"Bricks don't hit back.\" Helmer and Rawlins go to the Hong Kong police department and confer with Inspector Chen (Philip Chan). They give him a photo of Dux, explain that they are trying to stop him from competing in the Kumite, and they ask Chen to contact them if his men learn anything about Dux's whereabouts. Chen is very dismissive but tells the two MP's that he'll see what he can do. Back at the hotel, Dux and Jackson find Janice Kent trying to get a story on the Kumite from one of the participants, a Mid-Eastern fighter named Hossein (Bernard Mariano). Hossein and his friends are surly and condescending. Hossein is only willing to speak if he can take Janice to bed, a proposition she finds repulsive. Hossein is offended at her defiance and is about to slap her when Dux and Jackson intervene. Jackson is ready to melee, but Dux asks everyone if it's worth getting ejected from the Kumite over a woman. Despite Janice's indignant protests, Dux arranges an alternative contest-- he puts a coin in Hossein's hand and challenges him to close his hand into a fist around the coin before Dux can successfully snatch the coin out of his palm. Hossein is amused and overly cocky at the challenge, but the smirk is wiped off his face when Dux succeeds in grabbing the coin. Per the terms of the bet, Hossein and his friends have to leave Janice alone. Dux and Janice are talking as they take a walk, and Janice tells Dux about her ambition to get a story on the Kumite, which she describes as 'a cockfight, except with people.' Dux agrees te speak to Janice, and asks her to dinner in return. The first day of the Kumite arrives, and the opening pageantry is conducted and the host organization introduces itself, speaking about the traditional background of the contest. As the Kumite prepares for the first fight, Victor reminds Dux and Jackson that the contests are full-contact, and there are three ways to win-- knock the opponent out, knock them off the platform, or force the opponent to shout the word \"Matte,\" which is a cry of surrender similar to saying 'Uncle.' The first-round bouts are conducted, showing several participants standing out as victorious and forces to be reckoned with -- a Polynesian fighter named Parades (Michel Qissi), a Chinese kung-fu fighter named Chuan Ip Mung (Dennis Chu), a big and burly Japanese Sumo fighter named Pumola (David Ho), a Muay Thai kickboxer named Paco (Paulo Tocha), Jackson, and Chong Li, who is the current champion. Chong Li exults in hearing the crowd cheer his name, and enjoys finishing his matches by maiming and crippling his opponents. He is notorious for having killed a participant at the last Kumite. Chong Li easily dispatches his opponent, breaking his own world record for the fastest knockout. Dux's first opponent is none other than Hossein. The Syrian fighter is eager for a little revenge, but Dux not only knocks him out, but proceeds to break Chong Li's new record for fastest knockout in so doing-- and Chong Li is noticeably angered. Helmer and Rawlins are eating lunch when Inspector Chen comes to see them. He's found out the name of the hotel Dux is staying at. Helmer and Rawlins confront Dux in the lounge there as he is talking with Jackson. They pull taser stun-guns and order him to come with them immediately. A football tackle by Jackson takes them down and gives Dux time to run. He leads them on an amusing chase scene, seemingly toying with them before giving them the slip. Dux meets with Janice that evening for dinner. He tells her a little about the Kumite, but insists she cannot truly understand it without seeing it-- and the Kumite doesn't allow just anyone in, even as spectators-- they are especially strict about keeping press out. Janice asks Dux to pull some strings to let her come in and watch. She even sleeps with him as an incentive (and because she likes him). In the morning he kisses her goodbye and tells her that he cannot get her inside. But Janice quickly finds another way of entry, going \"undercover\" posing as a date to a wealthy patron. A number of Kumite bouts are shown, and Dux, Chong Li, Chuan Ip Mung, Pumola, and Paco stand out, eliminating various opponents. Chong Li fights Parades, whose longer reach lets him land various combination punches that jar Chong Li. But Chong Li adopts a counter-punching strategy and gets inside, landing brutal attacks that leave Parades completely dazed and stunned. Playing to the crowd, Chong Li executes a brutal stomping kick to his opponent's kneecap, breaking Parades' leg and presumably crippling him. More fights are shown, and more fighters are eliminated. Dux defeats Pumola by doing a split to get under Pumola's charge, and punching his groin. The crowd begins to chant Dux's name, which really gets Chong Li angry. Ray Jackson finds himself facing Chong Li. Jackson is remarkably confident and arrogant, and shrugs off warnings of caution from both Dux and Victor. Dux has noticed a weakness in Chong Li's fighting style-- Parades almost turned the tables on him by landing a stiff punch to Chong Li's belly. Dux advises Jackson to focus on punches to the stomach, and warns Jackson to stay away from Chong Li's right leg. Jackson brushes off the warnings and advice, saying he has everything under control. As the fight begins, Jackson pounds on Chong Li's head with several hammering blows that drive him to one knee. Jackson then turns away, thinking he has the fight in the bag, and plays to the crowd, trying to get them to chant his name the way they chant Chong Li's name. From ringside, Dux tries to call out to Jackson to focus on finishing Chong Li, who is still on one knee, nursing his bruises and recovering. But by the time Jackson turns back to face Chong Li, the burly Chinese fighter has risen back to his feet and is ready to show the whole crowd what happens to people who try to make a mockery of him. Chong Li lands a devastating kick that turns the tide of battle in a heartbeat. Not satisfied with merely defeating Jackson, Chong Li lets his rage bubble to the surface and delivers a frighteningly brutal stomp to the head of his prone opponent, as Victor struggles to hold Dux back from intervening. Jackson is unconscious and bleeding profusely from his mouth as Chong Li pulls off Jackson's biker bandanna and claims it as a trophy, shaking it in front of Dux as a dire warning. At the hospital, Jackson is being examined by doctors. Dux speaks to the unconscious Jackson, telling him he's lucky to have such a hard head, which saved him from being permanently maimed. Dux vows to get revenge on Chong Li. Janice is there as well, and she is horrified at the personal vendetta. The two argue passionately outside the hospital. Dux points out Janice's career as a reporter, and she is trying to be the best she can be-- Dux is doing the same; to be the best fighter he can be. Seeing she cannot budge Dux, Janice resignedly shouts that she only hopes Dux doesn't end up in a similar state as Jackson-- or even worse, before storming off. Lin goes up to Dux and admonishes him to forget Janice, as well as Jackson's injury and also about revenge. Dux has the chance to become the first fighter from the Western hemisphere to ever win the Kumite, but he needs to have a clear head. Desperate to see Dux spared from grievous injury, Janice turns to Inspector Chen. Knowing that the Kumite is illegal under Hong Kong law, Janice hopes to see the police get involved in stopping the competition. Inspector Chen is again dismissive, until Janice gives him Dux's name. Riding a bus back to his hotel, Dux is haunted by memories of the bout and mistakenly thinks he sees Chong Li's reflection in the bus window, glaring at him. Walking through the back alley for the final rounds of competition, Dux finds he has to fight his way through a gauntlet of Inspector Chen's police officers. After getting past them, he finds Helmer and Rawlins waiting at the doors to the arena with Chen and Janice. Helmer and Rawlins have their taser stun-guns at the ready. Dux uses a trash can lid to deflect the taser darts and grabs their weapons away. Knowing they cannot take Dux hand to hand, Helmer disgustedly enters the arena with Rawlins and Janice to observe the final bouts, hoping they do not have to scrape Dux up off the floor. In the arena, the officials are unaware of what is going on outside-- only that as a result of the melee, Dux is extremely late in showing up. They are just about to disqualify him when Dux enters. Dux's semifinal match is against Paco. As the fight begins, Paco extends his fists, motioning for Dux to touch knuckles with him. Warily, Dux finally does so, and is hit by a cheap shot from Paco. Recovering, Dux wades into battle and knocks Paco out. Chong Li's semi-final opponent is Chuan Ip Mung. Chuan gives Chong Li the stiffest resistance he's encountered in the Kumite, but even he cannot withstand the power of Chong Li's blows. Chong Li has Chuan supine and barely conscious on the ground, and starts to play to the crowd. But then, looking to send a message to Dux, Chong Li grabs Chuan's head and brutally snaps his neck. The crowd falls completely silent as the referee feels for breath and looks at Chong Li in appalled shock. Chuan is dead. The officials all stand and turn their backs to Chong Li, facing the wall and bowing their heads in a moment of silence. To Chong Li's disappointment the whole crowd, including Helmer, Rawlins and Janice, follow suit. Chong Li warns Dux that he is next, and Dux just glares back before joining the rest of the crowd in the moment of silence. As Chong Li prepares for the final bout, his trainer (Wilson Lee) carefully and stealthily slips a small chunk of a chalky substance into the waistband of his trunks. (Hinted to be cocaine but not stated definitively) Dux and Chong Li step onto the platform for the final bout to determine the Kumite's champion. Chong Li points to Jackson's bandanna, which he has tied around his calf, saying he plans to break Dux in return for Dux's breaking his record. Dux stares back unafraid. The bout begins and Dux quickly seizes initiative. He takes control following the advice he tried to give Jackson, focusing on repeated punches and kicks to Chong Li's stomach and watching for kicks from Chong Li's right leg. He knocks Chong Li down, staggering him. On one knee, using his body to shield the action, Chong Li carefully removes the chalky object from his trunks and crushes it into a powder in his hand. Rising to his feet, he throws a punch that falls well short of his mark but, unseen by everyone else, flings the powder right into Dux's eyes. Aside from his vision being completely clouded over, Dux appears to fall into a near stupor. The tables are turned and Chong Li takes the opportunity to enjoy beating Dux from pillar to post. On the mat, screaming in frustration, Dux suddenly clears his mind and appears to go into a meditative trance. Flashbacks are shown of his training with Tanaka, including training where he is blindfolded and learns to operate through his other senses as if he were fully sighted. Dux blocks a punch to his head and throws a ground side kick to Chong Li's stomach. Rising to his feet, Dux begins to step carefully around the arena, but always able to fend off Chong Li's attacks and land more blows to his stomach. Chong Li tries to throw Dux off by pushing the referee into him, but Dux, grabbing a handful of the ref's tunic, recognizes the ploy and carefully eases the referee behind him. He takes control of the match, hammering Chong Li's stomach and then going up to the head with leaping, spinning wheel kicks that knock the burly Chong Li completely for a loop. Dux refuses to settle for a mere knockout. He needs to establish absolute dominance-- meaning even Chong Li himself must declare it to the whole crowd. Dux grabs Chong Li's head and gradually twists his neck, shouting, \"Say it!\" He twists Chong Li's neck harder until it is clear that his neck will snap if he doesn't comply. With his very life on the line, Chong Li defeatedly shouts 'matte,' and the crowd goes wild as the referee gestures to signal Dux's victory. The closing ceremony shows the officials presenting Dux with a beautifully crafted Japanese katana with words of praise. The whole crowd, including Helmer, Rawlins and Janice, applaud as Dux looks up to the ceiling and says quietly, \"This is for you, Shidoshi.\" Dux and Janice visit Jackson at the hospital. Jackson has regained consciousness and is convalescing. He is notably impressed as Dux's victory-- forcing Chong Li to submit, no less-- but jokingly warns that Dux might have to fight him next time. Dux and Jackson give an emotional handshake, their bond having strengthened to near blood-brothers. Helmer and Rawlins are waiting at the airport in front of a plane to take Dux back to the United States. They wait, and finally they are convinced that Dux has given them the slip yet again. Suddenly they hear a whistle behind them and turn to see Dux just inside the plane's boarding doorway, telling them to hurry up. The two MP's are grudgingly amused as they board the plane. Just as Dux is about to re-enter the plane, a cab pulls up and Janice steps out. Looking up at Dux, she gives him the Chinese covered-fist salute. The camera freezes on Dux returning the salute and bowing his head to her. Captions proceed to give Dux's career fight stats in the Kumite over several years, saying he established four records that were still standing at the time of the movie's release, and that he retired undefeated, before establishing his own martial arts school. Fade out as the credits begin to roll.",
      "writers": [
         "Sheldon Lettich",
         "Sheldon Lettich"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0092675/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc0MzQ5Mzk2NV5BMl5BanBnXkFtZTcwOTY1OTEyMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Jean-Claude Van Damme, Donald Gibb, Leah Ayres | See full cast and crew »"],
      "reviews": [
         "Honestly... this is my favorite movie of all time. I'm a huge action fan and this movie remains to this day my favorite fighting movie... nay, favorite movie period, of all time. Granted, there is no good acting and there was no reason for all the splits the man performs, but damn it the tournament was the greatest in-movie fighting tournament I've ever seen. Never duplicated or improved upon. Yes, they did stereotype everyone in the world.... literally, but boy was it funny... and oh so entertaining to see how they put the fights together. Greatest fighting movie of all time... a perfect cult classic... and the ultimate treat for the Van Damm fan",
         "I had never seen a van Damme-movie before this one. And oh boy, I was surprised in a really positive way. The best thing about this movie is that it's from the 80's. That means really GREAT music, and in this movie, the music makes up a really magnificent atmosphere for the viewer through the whole film. Of course, the fighting is good. It's not just good, it's great. It was really exciting to see different fighting styles from all over the world. And Bolo Yeung did a really great job as the villain. He barely talks, but shows with his behavior that he is Mr. ruthless himself. The final fight with van Dammes trademark, the 360-kick, shown several times in slow motion, is a feast for the eye. Hong Kong is the location for the movie, and the city fits perfectly for it. Enjoy!",
         "This movie all about fighting,and the fact that it is based on a true story just makes it better. This is the first time Van Damme fights Bolo Yeung and it is a spectacular fight he also fights him in Double impact. Bolo is the perfect evil guy and his fighting style is one of a kind. They dont make movies like this anymore. Bad acting and story,but you gotto love it anyway.",
         "Bloodsport is, and always will be, Van Damme's greatest display of his martial talent. While it seems to have a similar storyline to other martial arts films, this one differs in that it is based on the true events of Frank Dux, who also assisted the fighters for this movie. Anyone at all that doubts Van Damme's talent as a fighter, should see this film. Bolo Yeung also makes a spectacular appearance as the evil one in the tournament. He acts about as cruel and heartless as one can get, and he makes the perfect climax for the film. If you are after a good quality martial arts film, and you haven't seen Bloodsport, then this is the one for you. If you have seen it, then you will know why it deserves the title of 'best martial arts film of the century'.",
         "My mother was on the verge of death a few years ago( boob cancer). In her hospital room there was TV and VCR, so i thought to bring her some movies. Well, I accidentally brought my copy of BloodSport-along with Fried Green Tomatoes. I left the videos with her, and when I returned the next day I was surprised to see her cheering along with Van Damme as he was beating the large Asian Man. A few days later, she was walking around and trying to perform some of the stunts she saw in her new favorite movie. I even saw the copy of Fried Green Tomatoes in the trash bin. The next week the Doctor came to me and said he witnessed a miracle. It seems my mother's cancer had disappeared. She checked out of the hospital and told me she had to meet the man who cured her of her wicked disease: Van Damme. So me and my mom set out in a beat up VW Bug and headed towards Hollywood. But that's a different story all together.",
         "Bloodsport is an excellent movie, which includes everything a martial arts fan can possibly dream off... Great fight-choreography, excellent filming, fine music and a good story. The movie takes you to a world of fighting where \"only the strongest wins\". Jean Claude van Damme as Frank Dux, a young, talented martial artist. This was THE movie for van Damme, beside Kickboxer, he has never preformed so well. Watch & Enjoy !!",
         "I love this man. His acting wasn't very good. (I do think though it improved over time... a little.) Bloodsport was inspiration for a whole generation to start learning martial arts. A Cult movie. I grew up some of my life in Asia and it amuses me to see those buff cliché white men jumping around through colourful, but grubby marketplaces/ back alleys. In fact the whole movie is simple and has even a nice tidy cliché structure: Man starts terribly, improves through tough training and develops into sexy fighting machine. Some people who commented on this movie said he is no Bruce Lee. But that is the beauty of it. He is somebody from a western country trying to measure up and fit into the eastern culture. Good stuff.",
         "I am not a huge Van Damme fan, but I have seen (and commented on) several of his movies. When you watch Van Damme, you want to see bad acting, bad accents, decent action, and several slow motion kicks to the face. Bloodsport delivers like no other. Let's just start with the acting. Van Damme was not quite full of himself at this point in his career, having played \"Gay Karate Guy\" in 1984's Monaco Forever, so he's actually not as bad as usual. His main supporting actor is Donald Gibb, best known for playing Ogre in the Revenge of the Nerds movies. He basically plays Orge in this movie, too, although he doesn't shout \"NERDS!\" He should have, but he didn't. That is why this is 8 out of 10 instead of 10 out of 10. Forest Whitaker is in this, too. Apparently, being a supporting actor in Platoon, Fast Times at Ridgemont High, Color of Money, Stakeout and Good Morning Vietnam was not enough credit to land him the coveted role of the main military policeman that is constantly outsmarted by Van Damme (!) in this film. Instead, the actor with the best film credits in the movie is the second-in-command military policeman who serves under the person that is constantly outsmarted by Van Damme. Either the casting director was racist, or he could see into the future and knew that Forest would eventually costar in Battlefield Earth and was thus deserving of punishment. Bolo Yeung, the Asian bad guy with the huge pecks, plays a suitably evil villain at the impressive age of 50. The soundtrack is pretty awesome, too. You have a nice blend of lame 80s music combined with a strange theme song that has the refrain \"Ku-mite! Ku-mite!\" The song is so good, it makes you wish Ah-Ha covered it. The plot of the movie is silly. To avenge the death of his Asian friend and make his mentor proud, the military-trained Van Damme sneaks off to Asia to compete in the Kumite. This is the world's most hard-core fighting tournament and it is ultra-secret. The military doesn't want Van Damme to fight, so two men are sent to Asia to get him. They fail frequently until they eventually decide to let him compete. There is a nosy reporter woman that wants to cover the Kumite. Naturally, her main purpose in the movie is to give us a reason to see Van Damme's ass. Van Damme and Ogre become friends after Van Damme beats him in a karate video game. Ogre (for reasons unbeknownst to me) identifies Van Damme's accent as American and the two become good friends. After a shot of Van Damme beating someone up is shown in slow-motion two or three times, Ogre stands up and shouts, \"That's the fastest thing I ever saw!\" You see, if he hadn't said that, the audience wouldn't have known it was fast; they would have had to rely on the timer above the ring that said \"new world record.\" Obviously, Van Damme has to fight a number of people, most of whom have comically unique styles of fighting. Just as obviously, Van Damme has to fight Bolo in the end. Van Damme has several slow motion kicks to the face and seven different times where he does the splits. Van Damme doesn't get much better than this. By the way, this is based on a true story. HA!",
         "If you look at the rating for this film it is only 5.8 percent at present that is a serious understatement of this films genius. This film deserves a much more higher rating. Okay its not an Oscar winner for acting, but who cares! its not about acting its about true martial arts and fighting on the big screen and Bloodsport brings this to you superbly. One of my favourite movies it also provides the Rocky pump, as in like Rocky it has the emotion both in action and through the films music and the fighting makes you want to get up and starting punching and kicking anything! and you don't get that sort of feeling with many films. Rocky had it and Bloodsport has it, and if a fighting film makes you get up and fight your living room wall then its a winner! Van Damme is excellent, his fighting manoeuvres are breathtaking, the range of different styles of fighters is great and well know martial artist Bolo Yeung's destruction of all opponents is wonderfully filmed, and as Van Dammes main contender we have a great adventure. All the fighters give great performances and the fighting scenes are superb. Great performance from big Donald Gibb as the hilarious Ray Jackson. His running punch on his first opponent is worth watching for that alone! Donald Gibb is excellent and brings humour to the role as well as some excellent and sometimes hilarious no nonsense fighting! The story too is superb, the kumite bringing the worlds greatest fighters together and by invitation only and the location also brilliant. Hiden in the depths of Hong Kong badlands. A winner in all departments. I remember watching this with friends and going out in the garden for some Bloodsport kicking and punching well not each other, thin air! but it makes you feel alive. Not many films do that. 10/10 for me. Fantastic film!",
         "This is one of the great movies of the 80s in MY collection that I think about all the time. Minor Spoilers Bloodsport is arguably Jean-Claude Van Damme`s best film next to Hard Target. It begins with such a cool intro with the fighters and cool music by Paul Hertzog. It has a few good songs too! It has very good fighting and it is a serious movie. Here is a brief look at the film`s best competitors that are most likely to win the Kumite. Bolo Yeung as Chong Li - Chong Li is the undefeated champion that holds many records and will do anything to win a match whether it is to break a man`s leg, knock him out or even kill his opponent. He has huge muscles and there is no telling how strong he is. Every fighter is in trouble when they step in the ring against him. Jean-Claude Van Damme as Frank Dux - Frank Dux is a great fighter taught by Tanaka. He a hansome,musclar,smart,and kind man that cares. He know just about it all when it come to fighting thanks to his great master. He really cares for his new friend Jackson. Paulo Tocha as Paco - There is one kickboxer type fighter named Paco. He is a great fighter but he doesn`t block well but he has two advantages. 1. Paco`s opponent`s should not trust him when he reaches out to shake hands because he is a cheater and 2. is when he grabs ahold of his opponent its all over with! Donald Gibb as Jackson - Jackson is a massive man with a bad attitude but is a good friend to Frank Dux. He is very tuff,strong, and is able to beat up anyone though he fools around too much and that`s his only mistake. Michel Qissi as Parades - Parades has big thick legs that hits his opponents hard but like Paco he is not a good blocker and that is his only flaw. Bloodsport has many other great figters but these are top ones in the Kumite. If you like Jean-Claude Van Damme and fighting films then be sure to check this awesome Jean-Claude Van Damme movie out soon because in MY opinion it is a classic!"
      ],
      "genres": [
         "Action",
         "Biography",
         "Drama",
         "Sport"
      ],
      "productionCompanies": ["Cannon International"],
      "summaries": [
         "Frank Dux has spent most his life being trained by Tanaka to participate in the Kumite, the ultimate martial arts tournament, where participants are seriously injured, even killed. Frank decides to go despite being told by his superiors in the army that he can't because they need him. Two army officers are sent to get him and the trail leads to Hong Kong but Frank eludes them. While Frank advances, he knows that he may have to face Chong Li, the defending champion, who has killed a few participants.",
         "Frank Dux has entered the \"kumite\", an illegal underground martial-arts competition where serious injury and even death are not unknown. In town for the fight are a number of fighters (all with different styles), as well as a journalist determined to get her story. Chong Li, a particularly ruthless and vicious fighter is the favourite, but then again Dux has never fought him before.",
         "Frank Dux is an American martial artist. His former teacher in the martial arts, gives him an invitation to \"The Kumite\", the secret martial arts tournament where only the world's best fighters are invited. Frank shows up in Hong Kong for the tournament, but his CO's in the US Army are right on his tail. Frank wins match after match, and shows promise that he may be the first person from the Western Hemisphere to win the tournament, until the defending champion gets his hands on Frank's friend, Jackson, and injures him in the Quarter Finals. Now Frank faces an uphill climb. His friend is hurt, the US Army is on his tail, and he is on the verge of making martial arts history. The question is, will he?",
         "As a child, a miscreant Frank Dux was taken in and trained by a champion martial artist, who went so far as to adopt Frank into his family after the premature death of his own son. Now, decades later, Frank is a skilled martial artist himself and a solider in the U.S. Military. Upon the death of his surrogate father and sensai, Frank is informed of a mysterious, no-holds barred, highly illegal martial arts tournament in Hong Kong known only as the \"kumeti.\" At the bidding of his sensai and against direct orders from his military superiors Frank travels to Hong Kong to participate and uphold his master's honor. In order to succeed not only will he have to win the tournament; he must also evade capture by two military police sent to arrest him and the prying questions of a nosy reporter eager for a story."
      ],
      "budget": 1100000
   },
   "movielensId": 3444,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1988-02-26",
      "dvdReleaseDate": "2004-06-01",
      "directors": ["Newt Arnold"],
      "runtime": 92,
      "movieId": 3444,
      "title": "Bloodsport",
      "mpaa": "R",
      "actors": [
         "Jean-Claude Van Damme",
         "Bolo Yeung",
         "Roy Chiao",
         "Philip Chan Yan-Kin",
         "Donald Gibb",
         "Ken Siu",
         "Leah Ayres",
         "Norman Burton",
         "Forest Whitaker"
      ],
      "imdbMovieId": "0092675",
      "originalTitle": "Bloodsport",
      "genres": ["Action"],
      "youtubeTrailerIds": ["inI1kPY7irA"],
      "plotSummary": "Frank Dux has entered the \"kumite\", an illegal underground martial-arts competition where serious injury and even death are not unknown. Chong Li, a particularly ruthless and vicious fighter is the favorite, but then again Dux has not fought him yet.",
      "tmdbMovieId": 11690,
      "avgRating": 3.18694,
      "releaseYear": "1988",
      "numRatings": 2137,
      "posterPath": "/E4d48dFICxN1tcGywt1p5zBHYJ.jpg"
   }
}