{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "china",
            "id": 478
         },
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "famine",
            "id": 4337
         },
         {
            "name": "epic",
            "id": 6917
         },
         {
            "name": "rural setting",
            "id": 11004
         },
         {
            "name": "farmer",
            "id": 154846
         },
         {
            "name": "locust",
            "id": 179566
         },
         {
            "name": "1910s",
            "id": 210184
         }
      ],
      "imdb_id": "tt0028944",
      "video": false,
      "title": "The Good Earth",
      "recommendations": [
         111883,
         32598,
         91727,
         127111,
         61430,
         31805,
         47452,
         19765,
         144425,
         42139,
         50071,
         43778,
         46278,
         4154
      ],
      "backdrop_path": "/3U7rdUGzYXev2fIGOkn6nxTQlwF.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Wang Lung",
               "gender": 2,
               "credit_id": "52fe45fe9251416c910456d7",
               "name": "Paul Muni",
               "profile_path": "/q3WSt8ZkN0D45CDiuVnOSfn0VQl.jpg",
               "id": 13352,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "O-Lan",
               "gender": 1,
               "credit_id": "52fe45fe9251416c910456db",
               "name": "Luise Rainer",
               "profile_path": "/kX4vs7uLsRwAV3wRsXlO86Q63MA.jpg",
               "id": 125482,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Uncle",
               "gender": 2,
               "credit_id": "52fe45fe9251416c910456df",
               "name": "Walter Connolly",
               "profile_path": "/mb832b3NGCavCnmrbVj9EJVOwwk.jpg",
               "id": 30156,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Lotus",
               "gender": 1,
               "credit_id": "52fe45fe9251416c910456e3",
               "name": "Tilly Losch",
               "profile_path": "/ylBcO0uwLztL8tgS86a1r6RydSE.jpg",
               "id": 125483,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Old Father",
               "gender": 2,
               "credit_id": "57a0ed05c3a3684764000250",
               "name": "Charley Grapewin",
               "profile_path": "/jUHnyU7byM0ajyrovvUXkWZnlAc.jpg",
               "id": 8517,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Cuckoo",
               "gender": 1,
               "credit_id": "57a0ed169251416767000281",
               "name": "Jessie Ralph",
               "profile_path": "/3WbeyazSk17SYVTiaKIeedaR7CQ.jpg",
               "id": 13965,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Aunt",
               "gender": 0,
               "credit_id": "57a0ed24c3a368470e000245",
               "name": "Soo Yong",
               "profile_path": null,
               "id": 124936,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Elder Son",
               "gender": 2,
               "credit_id": "57a0ed34c3a368471e0002d1",
               "name": "Keye Luke",
               "profile_path": "/sUW8C9x2ir0YTJ81GdiaDQpsx1a.jpg",
               "id": 16103,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45fe9251416c910456e9",
               "name": "Sidney Franklin",
               "profile_path": null,
               "id": 42060,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "53e0ef7d0e0a265a99006d70",
               "name": "Talbot Jennings",
               "profile_path": null,
               "id": 72062,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "53e0ef880e0a265a99006d72",
               "name": "Tess Slesinger",
               "profile_path": null,
               "id": 592459,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "53e0ef930e0a265a99006d77",
               "name": "Claudine West",
               "profile_path": null,
               "id": 14859,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "53e0efa10e0a265a86007235",
               "name": "Pearl S. Buck",
               "profile_path": null,
               "id": 1028266,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "5a485faac3a368191300c3aa",
               "name": "Albert Lewin",
               "profile_path": "/sj4EQdm5Fz1ebgGSUM27fr2nZBU.jpg",
               "id": 30252,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "5a485fba0e0a26489a00c53a",
               "name": "Irving Thalberg",
               "profile_path": null,
               "id": 1497,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.132176,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 36652,
      "vote_count": 14,
      "budget": 0,
      "overview": "The story follows Wang Lung (Paul Muni), a humble farmer, who makes an arranged marriage to a slave, O-Lan (Luise Rainer). The couple's great struggle is to procure--and then, against withering odds, keep--a piece of land, ownership of which makes the difference between self-determination and near-slavery. The film's physical production is truly eye-filling, with location shooting in China providing exterior shots and backdrops (and blending seamlessly with the footage shot in the U.S.). No wonder the great cinematographer Karl Freund won an Oscar for the photography, which includes an awesomely staged locust plague.",
      "similar": [
         281957,
         452507,
         11121,
         2675,
         769,
         4771,
         75780,
         157336,
         581,
         169917,
         346364,
         392044,
         4584,
         9598,
         2048,
         562,
         101299,
         49529,
         181283,
         207932
      ],
      "original_title": "The Good Earth",
      "runtime": 138,
      "poster_path": "/47jy8BYToPwmVSMiFajz78PuTdd.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1937-08-06",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "China . . . . Land of unrest . . . tomorrow they may Starve !",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": [
         "Sidney Franklin",
         "Victor Fleming"
      ],
      "runtime": 138,
      "synopsis": null,
      "writers": [
         "Talbot Jennings",
         "Tess Slesinger"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0028944/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjkwMTA2ODY5NV5BMl5BanBnXkFtZTgwODM0NjY1MjE@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Paul Muni, Luise Rainer, Walter Connolly | See full cast and crew »"],
      "reviews": [
         "In the 30s and 40s, MGM had a penchant for (then) contemporary Chinese-oriented stories ('The Son-Daughter', 'Dragon Seed', 'Thirty Seconds Over Tokyo', etc.), and whether this was a preference, or whether there were just a lot of Chinese-design sets to keep occupied at the studio, the results were strangely moving. 'The Good Earth' is of course the finest of its genre, for any number of reasons. From the very beginning of the picture, right after the lion's roar, we see the poignant tribute to Irving Thalberg, and we know that we are embarking on an important viewing experience. The scope of the story is very wide, and the filmmakers are up for the task. I was always struck by the abruptness of the final scene, but its power and beauty form an excellent example of the art achieved within the often cynical Hollywood film factory. And Lotus - the strangeness of her, and her dance, contrasted with the goodness of O-lan! Aside from the oft-mentioned attributes of acting, photography and special effects, a major element in 'The Good Earth' is the score. Herbert Stothart may not be in the ranks of Hollywood's 'mighty handful' (Alfred Newman, Steiner, Tiomkin, Waxman, Herrmann), but his 'MGM-sound' scores regularly deliver the goods. True, Stothart had no hesitation in applying the syrup at first opportunity (one can imagine Louis B. Mayer positively ordering it), but in this picture, syrup gives way to sympathy. One of the pleasures of Hollywood's Golden Age films is that all the elements of a given film support each other, and great scores support not only the characters, but the entire film. Stothart's score is so sympathetic and so sincere, from the Main Title all the way through, and it enhances the story and the performances so naturally and at times transparently, that it must be considered a classic score. No great 'tunes' specifically, but plenty of effective mood, atmosphere and unabashed emotion. Many of today's audiences may find little to enjoy in such a combination, or they may be embarrassed by it, but I revel in it, as cinema such as this, which is delivered with such heart and good will is, especially in these times, nothing short of a gift. The issue of non-Chinese playing Chinese characters has already been discussed on these pages, but I can only add: please, viewers, consider the film within the era that it was produced. The same kind of incongruity still happens today, perhaps not so much racially, but certainly culturally: Brad Pitt in 'Seven Years in Tibet', Keanu Reeves in 'Little Buddha', and other Americans getting plum roles in British-originated stories that become Hollywoodized, etc. When making 'Bhowani Junction', George Cukor considered using Indian actors, but vetoed any candidates in favor of familiar Hollywood faces. Never mind that in the 50s, as today, India had a huge film industry. It's just that those actors didn't fit into the Hollywood scheme of things. That speaks of box office more than political incorrectness. There is no doubt that fine actors like Philip Ahn should have gotten lead roles in pictures like 'The Good Earth', but at least we can enjoy them in supporting roles which carry a lot of weight in their own right. As time goes on, the context of past eras fades, while the films themselves, the really good ones, live on. There's plenty of opportunity for revisionist theses about issues like racial inequality in 1930s Hollywood, but for 138 minutes, it is compelling and moving to absorb onesself in the story and the atmosphere of 'The Good Earth'.",
         "Pearl Buck's story of the ups and downs of a Chinese peasant family is adapted for the screen in a stately and dignified manner. Extreme respect is paid to the characters, who are given ample screen time to mature and develop. The roles are filled by actors who are able to get inside their characters without ever giving the impression that they are `performing,' and their performances are all the richer for it. The story begins on the wedding day of Wang Lung (Paul Muni), a kind and gentle farmer. His wife, O-Lan (Luise Rainer), bears his sons and quietly encourages him to pursue his dreams, no matter what sacrifices they entail from her. The family lives through a famine and finally achieves prosperity and success. However, with success comes greed and corruption, and soon Wang is buying large plots of land and the Great Hall at which O-Lan was a servant. Eventually, he takes a second wife and breaks ties with all who were once close to him. It takes a tragedy for him to see the error of his ways. All the while O-Lan stands behind him, supporting every decision he makes in her own tranquil way. Rainer's Oscar winning portrayal, like O-Lan herself, is the glue that holds the story together. Muni, often prone to hamminess in his work, shows restraint here and contributes a beautiful, multifaceted performance. The cinematography, which also received an Oscar, is excellent, as are the special effects. A sequence which involves locusts, invading the crops by the million, is nothing short of unforgettable. It is storytelling in the grandest sense of the word, with strong characterizations, high production values, and an engrossing story which more than justifies `The Good Earth's status as a classic.",
         "Let's eliminate any discussion about the use of non-Asian actors playing Asian roles. The movie is 67 years old. In 1937 studio chiefs believed that any actor could/should be able to play any role. Actors were under contracts, and did not always have a choice about what role they played. End of story. This is a truly great epic story of love, individual rights, class strata, and men/women issues. The centerpiece of the film is two brilliant performances by Luise Rainer and Paul Muni. Muni plays Wang, a Chinese farmer, who is about to take a wife (Rainer). From the start, he treats her with respect, during a time when women were looked on as little more than hired help. Without giving too much of the movie away, they go through the highs and lows of all relationships, and even though the story may take place in late 19th/early 20th century,the story and much of their feelings, seems credible. Other than the fact that the movie is about 5-10 minutes longer than it needs to be, and the performances of Charley Grapewin and Walter Connolly are typical 1930's cartoon characters, this is a really wonderful movie that, unfortunately, has become a victim of political correctness. 9 out of 10",
         "Sure, 65 years have passed since Thalberg's last production was filmed. But fellow IMDB members, come on, this movie is surely one of the masterpieces of the 30's! It is a 10. This was the first movie I saw at New York's Museum of Modern Art, around 1970 (I was a teenager). Expensive looking yet with scenes of such poverty, masterfully photographed, often thrilling, and always engaging, to me it was MGM movie-making at its best. What did audiences feel when they glimpsed a locust attack, the person by person destruction of a mansion, the horrific poverty and then the splendor of wealth. Last week, those watching the Academy Awards had a glimpse of the \"senior\" Oscar winner in attendance, Luise Rainer. How grand to see an actress who arguably delivered one of the most masterful, haunting performances in history electing to return for a celebration. Ok, so she should not have won the year before (Great Ziegfeld), but don't blame Luise. Talkies were only a decade old when this was released, and her dialogue limited. But as Olan, her use of visual and vocal is memorable. Large scale and touching, what more could a movie lover want!",
         "What Irving Thalberg did in making this film today would never be attempted again. Making a Chinese story with occidental players even if they are of the caliber of Paul Muni, Luise Rainer, Charley Grapewin, and Walter Connolly among others. Perhaps it's partly because the story was written by a westerner, Pearl Buck who got a Pulitzer Prize for her novel in 1932. Ms. Buck, daughter of Chinese missionaries, probably brought China closer to the consciousness of America than any other person. Not the political struggles of China, but the lives and toil of the every day people we find in The Good Earth. Unfortunately later on, Pearl Buck became an apologist for the Kuomintang China of Chiang Kai-Shek in all its virtues and excesses. The rest of her literary output never matched The Good Earth. In The Sundowners there is a great description of comparing China to Australia by Peter Ustinov. When asked the difference, Ustinov said China was very big and very full and Australia was very big and very empty. That's what you see in The Good Earth, China very big and very full of people, more than she can deal with at times. The Good Earth tells the story of Wang Lung (Paul Muni) as a young man who purchases a wife from a large house where she was a slave. The woman O-Lan (Luise Rainer) bears him two sons and sees him through all the good times and bad they have, drought, famine, revolution, and a climatic locust plague. Luise Rainer won the second of two consecutive Oscars for portraying O-Lan. She may have set some kind of record in that it has to be the leading player Oscar performance with the least amount of dialog. Everything she does practically is done with facial expressions, her performance could have been on a silent film with very minimal subtitles. I think only John Mills in Ryan's Daughter had fewer words and he was playing a mentally retarded man. Muni is not always appreciative of how supportive she is in that male dominated culture. Rainer helps in the field, bears and raises the kids, does the housework. When Muni becomes a man of property he takes a Chinese second trophy wife who causes him a lot of grief. Still Rainer stoically bears it all. Still Muni is not a bad man and it's a tribute to the film and his acting and Buck's writing that you don't hate him and the culture gap is bridged. We've got a group of oriental players now who do more than just Kung Fu movies. I'm surprised The Good Earth of all films has not been remade at this point. I'll bet the Chinese government would even let some American company do it on an actual location. Till then we've got this great classic to appreciate and enjoy.",
         "I watched this movie with some curiosity. I wanted to see if 1) Paul Muni could play Chinese and 2) Luise Rainer deserved her Oscar. I came away from the film thinking YES! Having seen Muni in only one film where he was quite hammy, I expected the same type of performance here. I was happily proved wrong. Although some might criticize him as being too childlike and stereotypically simple in the Hollywood idea of Asians, I thought he was just right in the role. Keye Luke, if he'd been given the chance to play a lead role, might have played him in much the same manner. I was particularly impressed by the camera work and the use of crowd scenes, especially during the sacking of the palace where O-Lan was once a slave. The graphic and grim atmosphere of the firing squad and the drought made this an epic quite unlike others of the same time where it was all glitz and glitter. I watched this film from beginning to end enthralled. I can't say the same for the \"epics\" of today.",
         "This is where the term \"classic film\" comes from. This is a wonderful story of a woman's bravery, courage and extreme loyalty. Poor Olan got sold to her uncaring husband, who through the years learned to appreciate her. (Yeah right, A PEARL!!) Luise Rainer was the beautiful star who had won the Best Actress Oscar the year before for her small role (and what a waste of an oscar) in \"The Great Zigfield\". It really didn't show what, if any, talent she had other than her exotic beauty. But in \"Good Earth\" she shows that she can really act! Her beauty was erased and she had no great costumes either. People say that she didn't show any real emotions in this film. Like hell. Her character Olan is a shy and timid woman, with inner strength. She is quiet during parts of the film with only her eyes and body to convey her emotions. Example: those scenes during the fall of the city and when looters were being shot. If you people are saying that she doesn't act well in this film, you are NOT looking! Paul Muni shows that he can act as well. His character is not a likeable one to me. He never sees her for what she is, until the very end of the story. A sweet loving and dedicated wife and mother, with her own special beauty. The greatest one of all, the beauty from within, like a pearl. If you get a chance to see this film, watch it. You will see one of the best films that the golden age of Hollywood created.",
         "This film was released the year I was born and will be, like me, 70 in 2007. I watched it again last night having not seen it since high school. While it was full of 30's sentiment and the acting was a bit stereotyped, nevertheless, it was superb. Pearl S. Buck's story did come alive through the magic of the chemistry of Luise Rainer and Paul Muni. The novel which earned Ms. Buck the Nobel Prize for literature comes alive under the baton of Sydney Franklin which along with an excellent script recounts the story of peasant farmer, Wang Lung, whose father obtains a bride for him, a slave girl from the kitchen of a local landlord. In Buck's story, Wang's success is underwritten by his willingness to listen to his wife, most of the time, and the love of the land. In the end he comes to realize that his wife, like the land, is the source of his wealth, happiness and immortality. Buck's stories always had strong women cast in a critical spot to influence the outcome of events in the pre-feminist world. The German-born Luise Rainer brings a tentative but determined Peasant Chinese woman to life in her portrayal of Olan. Muni likewise captures the naive but honorable Wang, eventually caught between the two worlds of the wealthy and the peasant. Other classic characters include Charlie Grapewin, Dorothy Gale's Kansan Uncle Henry from the Wizard of Oz, Walter Connelly as the mewing, conniving uncle and Keye Luke as Number One Son-- but this time, not Charlie Chan's. A classic might be defined as a movie you can watch time and again and never tire of. If that's indeed the case, this film is a classic, no doubt whatsoever.",
         "\"The Good Earth\" is a great movie that you don't hear much about anymore. There are a lot of big disasters and events, but it is also a non-passionate love story. All of this happens in a little over two hours, which is short by today's standards. The special effects and costumes are very good for the time period. I am surprised that Luise Rainer received an Oscar for such a limiting role. She basically only has three emotions: submissive, hungry, and heart-broken. The performances by the Asian and Asian-American actors are terrific.",
         "This is a bit long (2 hours, 20 minutes) but it had a a lot of the famous Pearl Buck novel in it. In other words, a lot of ground to cover. It was soap-operish at times but had some visually dramatic moments, too, capped off by a locust attack at the end of the film. That was astounding to view. Considering this film is about 70 years old, the special-effects crew on this film did a spectacular job. Paul Muni and Luise Rainer were award-winning actors in their day and they don't disappoint here, both giving powerful performances. The only problem is credibility as all the Asians are played by Caucasions and some of them, like Walter Connolly, just don't look real. I'd like to see a re-make of this movie with all-Asian actors, not for PC reasons but to simply make the story look and sound more credible."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": [
         "The story of a farmer in China: a story of humility and bravery. His father gives Wang Lung a freed slave as wife. By diligence and frugality the two manage to enlarge their property. But then a famine forces them to leave their land and live in the town. However it turns out to be a blessing in disguise for them...",
         "Wang is a poor farmer who bears the brunt of living a hand to mouth existence. Into his life comes a new bride, O-Lan and his luck begins to change. Not only does she bear him a son, he soon makes enough money from his harvest to buy a bit more land. Forced to relocate to the city when famine sets in, it is again O-Lan that unexpectedly finds their fortune giving them the opportunity to return to the land that Wang holds so dear. With his new-found wealth however, Wang also decides to take a much younger and prettier second wife and again, his fortunes seem to change. It is only at the end that he realizes how important O-Lan was to the good life he has led.",
         "Wang, a poor Chinese farmer, marries Olan, a slave from the 'Great House' and starts raising a family. When famine hits, Wang takes his family south to the city in search of work. Olan stays with him through hard times and revolution and helps get enough money to return the family to their northern farmlands. Wang becomes prosperous but his passions sway to a younger woman. The young woman's indiscretions with Wang's now grown up son cause a family rift but Olan remains steadfast. Then a new challenge arrives - a plague of locusts."
      ],
      "budget": 2800000
   },
   "movielensId": 3447,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1937-08-06",
      "dvdReleaseDate": "2006-01-31",
      "directors": ["Sidney Franklin"],
      "runtime": 138,
      "movieId": 3447,
      "title": "The Good Earth",
      "mpaa": "",
      "actors": [
         "Paul Muni",
         "Luise Rainer",
         "Walter Connolly",
         "Tilly Losch",
         "Charley Grapewin",
         "Jessie Ralph",
         "Soo Yong",
         "Keye Luke"
      ],
      "imdbMovieId": "0028944",
      "originalTitle": "The Good Earth",
      "genres": ["Drama"],
      "youtubeTrailerIds": [
         "3iEREqQjjzU",
         "ikY9aQCAujw"
      ],
      "plotSummary": "The story follows Wang Lung (Paul Muni), a humble farmer, who makes an arranged marriage to a slave, O-Lan (Luise Rainer). The couple's great struggle is to procure--and then, against withering odds, keep--a piece of land, ownership of which makes the difference between self-determination and near-slavery. The film's physical production is truly eye-filling, with location shooting in China providing exterior shots and backdrops (and blending seamlessly with the footage shot in the U.S.). No wonder the great cinematographer Karl Freund won an Oscar for the photography, which includes an awesomely staged locust plague.",
      "tmdbMovieId": 36652,
      "avgRating": 3.70745,
      "releaseYear": "1937",
      "numRatings": 376,
      "posterPath": "/47jy8BYToPwmVSMiFajz78PuTdd.jpg"
   }
}