{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "gay",
            "id": 237
         },
         {
            "name": "drag queen",
            "id": 824
         },
         {
            "name": "homophobia",
            "id": 1013
         },
         {
            "name": "musical",
            "id": 4344
         },
         {
            "name": "van",
            "id": 4580
         },
         {
            "name": "australia",
            "id": 5657
         },
         {
            "name": "transgender",
            "id": 17975
         },
         {
            "name": "cult film",
            "id": 34117
         },
         {
            "name": "australian aborigine",
            "id": 193459
         },
         {
            "name": "australian outback",
            "id": 193760
         }
      ],
      "imdb_id": "tt0109045",
      "video": false,
      "title": "The Adventures of Priscilla, Queen of the Desert",
      "recommendations": [
         9090,
         236,
         13403,
         3033,
         3525,
         18203,
         12560,
         546,
         3586,
         12614,
         11000,
         10765,
         11257,
         11929,
         20242,
         10503,
         12151,
         11663,
         10631,
         11235
      ],
      "backdrop_path": "/1lwk7ezk7MknKCM47FEPNtIsWMP.jpg",
      "revenue": 11220670,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Ralph/Bernadette Bassenger",
               "gender": 2,
               "credit_id": "52fe436ac3a36847f8052acd",
               "name": "Terence Stamp",
               "profile_path": "/fyGkLjgVfyKIPBaMQs5Df3gMuOV.jpg",
               "id": 28641,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Anthony Belrose/Mitzi Del Bra",
               "gender": 2,
               "credit_id": "52fe436ac3a36847f8052ad1",
               "name": "Hugo Weaving",
               "profile_path": "/fZ3wXniGrqbHk4eRt9gE2pSz4Jy.jpg",
               "id": 1331,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Adam Whitely/Felicia Jollygoodfellow",
               "gender": 2,
               "credit_id": "52fe436ac3a36847f8052ad5",
               "name": "Guy Pearce",
               "profile_path": "/qB0BGUhMph48P1msl9wHRgL4AeT.jpg",
               "id": 529,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Bob",
               "gender": 2,
               "credit_id": "52fe436ac3a36847f8052ad9",
               "name": "Bill Hunter",
               "profile_path": "/zCWRTbsiCKiHapWm2JRjIUHrpbS.jpg",
               "id": 23,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Marion",
               "gender": 0,
               "credit_id": "563623129251413b4600c993",
               "name": "Sarah Chadwick",
               "profile_path": null,
               "id": 1230360,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Shirley",
               "gender": 0,
               "credit_id": "563627f5c3a3681b4d01cd41",
               "name": "June Marie Bennett",
               "profile_path": null,
               "id": 1530258,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe436ac3a36847f8052aa5",
               "name": "Stephan Elliott",
               "profile_path": "/qobPDsEV3ulgM48gqZMk8BY6lDb.jpg",
               "id": 27889,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe436ac3a36847f8052aab",
               "name": "Stephan Elliott",
               "profile_path": "/qobPDsEV3ulgM48gqZMk8BY6lDb.jpg",
               "id": 27889,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe436ac3a36847f8052ab1",
               "name": "Brian J. Breheny",
               "profile_path": null,
               "id": 31856,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe436ac3a36847f8052ab7",
               "name": "Guy Gross",
               "profile_path": null,
               "id": 26050,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe436ac3a36847f8052abd",
               "name": "Al Clark",
               "profile_path": null,
               "id": 30209,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe436ac3a36847f8052ac3",
               "name": "Michael Hamlyn",
               "profile_path": null,
               "id": 31857,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe436ac3a36847f8052ac9",
               "name": "Sue Blainey",
               "profile_path": null,
               "id": 31858,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe436ac3a36847f8052adf",
               "name": "Lizzy Gardiner",
               "profile_path": null,
               "id": 15329,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 7.467274,
      "production_countries": [{
         "iso_3166_1": "AU",
         "name": "Australia"
      }],
      "id": 2759,
      "vote_count": 233,
      "budget": 0,
      "overview": "Two drag-queens and a transsexual contract to perform a drag show at a resort in Alice Springs, a resort town in the remote Australian desert. They head west from Sydney aboard their lavender bus, Priscilla. En route, it is discovered that the woman they've contracted with is the wife of one of the drag queens. Their bus breaks down, and is repaired by Bob, who travels on with them.",
      "similar": [
         11000,
         449176,
         184352,
         16367,
         400547,
         9090,
         9800,
         142,
         376867,
         338189,
         258480,
         428493,
         9659,
         8810,
         9355,
         10806,
         455661,
         12614,
         468,
         152584
      ],
      "original_title": "The Adventures of Priscilla, Queen of the Desert",
      "runtime": 104,
      "poster_path": "/pmHRJPlAEiYATBIgKAa0IyY6Or7.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Português",
            "iso_639_1": "pt"
         }
      ],
      "production_companies": [{
         "logo_path": "/sOg7LGESPH5vCTOIdbMhLuypoLL.png",
         "name": "PolyGram Filmed Entertainment",
         "id": 1382,
         "origin_country": ""
      }],
      "release_date": "1994-05-31",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "She's back... Looking as gorgeous and outrageous as ever in a brand new frock.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Australia",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Stephan Elliott"],
      "runtime": 104,
      "synopsis": null,
      "writers": ["Stephan Elliott"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0109045/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc5MDU1NzcyN15BMl5BanBnXkFtZTcwMDA0ODYyNA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Hugo Weaving, Guy Pearce, Terence Stamp | See full cast and crew »"],
      "reviews": [
         "What unlikely trio to fall in love with, just as unlikely as the landscape. When a movie fits so well without a tag that links it to anything else in its historic film context, it can only be described as a happy accident. Premeditated for sure, but accident nonetheless. Terence Stamp, is an actor with a spectacular career. Varied and surprising. It defies description, but let me try. Peter Ustinov's \"Billy Budd\" William Wyler's \"The Collector\" Federico Fellini's \"Spirit of the Dead\" John Schlesinger's \"Far From The Madding Crowd\" Pier Paolo Pasolini's \"Teorema\" Joseph Losey's \"Modesty Blaise\" Oliver Stone's \"Wall Street\" Stephen Frear's \"The Hit\" Richard Donner's \"Superman\" \"Steven Sodebergh's \"The Limey\" Am I making my point? He is an actor for all seasons, beautiful beyond belief to boot. In \"The Adventures of Pricilla Queen of The Desert\" he unveils another unexpected side to his considerable talents. A Woman. And what a woman, a Meryl Streep with a past and, thanks to director Stephan Elliot, with a future. Dressed by geniuses. More human than ever. He is flanked by two spectacular Aussies. Hugo Weaving (The Matrix) giving a performance of such tenderness that even my brother in law, a homophobic macho man of the first order,loved him. And Guy Pearce (L A Confidential) He is such a beautiful,sexy, funny girl that made me long for a her/he all to myself. Some other monstrously cloned movies were rushed into production trying to capitalize on the success of Pricilla. They all failed miserably and rightly so. Frank Capra, accepting his AFI Lifetime Achievement Award sent a profound and heartfelt advise to young filmmakers. \"Don't follow trends, start new ones\" Well done Mr Elliot. Well done.",
         "1994 proved to be rather a good year for Australian movies, with both this and MURIEL'S WEDDING delighting international audiences with their cheeky over-the-top humour, panache, pathos, winning performances, and fun soundtracks. Both, of course, heavily featured the music of ABBA (Australia has long had a particular love-affair with the Scandinavian quartet - it was probably no coincidence that it was decided to shoot the group's own feature, ABBA: THE MOVIE, during the Australian leg of their 1977 world concert tour). In MURIEL'S WEDDING the band's music is perhaps treated with more reverence and respect - Muriel Heslop is, after all, a huge fan, and the film itself is of a far more serious, distinctly black nature. PRISCILLA, on the other hand, constantly revels in its own bitchiness and catty humour, and has countless memorable, and in many cases unprintable, lines of dialogue, including stabs at the supergroup - \"I've said it once and I'll say it again - no more f***ing ABBA\"; \"What are you telling me - this is an ABBA turd?\" Of course ABBA is merely one of MANY verbal targets for the film's three main protagonists, but far from this alienating us from any of them, we cannot help but be swept along by the sheer garish joy of the entire venture. The basic plot focuses on recently bereaved transsexual Bernadette (a magnificent, hardly recognizable Terence Stamp), who teams up with two younger drag artistes, sensitive Tick/Mitzi (Hugo Weaving) and screaming queen Adam/Felicia (Guy Pearce), so that they can travel half-way across Australia on board an all but dilapidated bus named \"Priscilla\", in order to perform a cabaret act at a remote casino run by an ex-partner of Tick's, soon revealed to be, horror of horrors, a WOMAN! Along the way they encounter all sorts of absurd situations and individuals almost as strange and unconventional as they themselves are, whilst Bernadette, against her better judgement, falls for gruff mechanic Bob (Bill Hunter, who also features in MURIEL'S WEDDING) that they pick up en route, and in so doing he loses his \"mail-order\" bride Cynthia (Julia Cortez), who in one especially memorable scene does things with ping-pong balls you just don't want to imagine! The performances are really the thing here - Terence Stamp (who won numerous accolades for his cast-against-type labours) is amazing and totally credible as the quietly dignified transsexual, and it is hard to believe that Weaving and (especially) Pearce have not worked as flamboyant, lip-synching drag queens all their professional lives! The gaudy, outrageous costumes won a well-deserved Oscar, and the photography of the barren, surreal landscape is also masterful, as is Stephan Elliott's creative direction and hilarious, ultimately poignant script. The soundtrack may not be to everyone's taste, but it has enough camp classics to satisfy anyone yearning to relive the tacky heyday of the '70s - including ABBA's \"Mamma Mia\", the Village People's \"Go West\", and Gloria Gaynor's superb \"I Will Survive\", given a gloriously inventive rendition to a bunch of appreciative aboriginals, with one of their number joining in most enthusiastically. A true kitsch classic, then - well worth re-visiting, again and again ... and again.",
         "This is a great movie! Not only are the actors wonderful but the dialogue keeps you watching the movie over and over again because you missed a great line the last time! The musical numbers are worth watching alone, but combined with the story and all the sub-plots and the funniest lines I have heard in a long time (The ABBA turd convo cracks me up every time), this is a movie to buy and watch over and over when you need to be entertained as well as dazzled!!!!!!!",
         "...and that's a GOOD thing. Basically, before I truly became aware of \"Priscilla\", I had only thought of its three central actors as just regular, boring guys who were fine enough at acting, but really weren't anything special. Wrong. I had heard about this mysterious movie once or twice, but had no idea who was in it, nor what it was about (beyond the rather vague concept of drag queens/transvestites), and when I decided to read more about it, and find out who was in the cast - SURPRISE! Guy Pearce (of whom I had had a bad first impression when I discovered him in that travesty \"The Time Machine\"), Hugo Weaving (Agent Smith himself!!!), and Terence Stamp (whom I don't think I ever saw in any films, but whom I still knew a fair bit about)! How genius is that? I had to see this to believe it, and when I did, I was not let down! Beautiful scenes, costumes, dialogue and music made this probably one of the most interesting and memorable movie experiences of my life! I wasn't the least bit uptight about it (as some people were turned off by the flamboyant behaviour and distasteful jokes, which I found refreshingly great!), and delighted in the campy antics of this fantastic trio! It's a beautiful, feel-good comedy that I recommend to anyone with a catty sense of humour (and a VERY open mind).",
         "This is a film that every straight person should see. The screenwriter created three drags queens from the cloth of everyday life \u0097 an older person (who happens to be transgendered), an average guy next door and a pretty muscle boy. You can say that this film is about \"the great reach of little lives\" (a comment originally applied by Donald Spoto to Tennesee Williams' \"The Glass Menagerie.\") We also see, in Anthony Bellerose's story, that sexuality is not a cut-and-dried affair. Underneath it all, we see that these people aren't much different from those we meet ion our daily lives. A screening of \"Priscilla\" would do more good than a hundred lectures to high school kids on the acceptance of diversity.",
         "This movie made laugh and does so every time I see it again. Perhaps it won't go down in history as a timeless classic is does deserve it so much. The original premise is a weird one, about transsexuals traveling through the desert of Australia. The sense of humor is very wicked and thank God for small favors not restrained to Hollywood standards. And I've never watched a game of table tennis without a smallish grin on my face which has little to do with the game in it self. The actors are great an absolute anti choice in the matters of typecasting . The scenery of the movie is great, the bus in the desert are two extra players that give this movie an extra beaut. The extra castmembers are great and unforgettable. Ever since when I watch an episode of Flying Doctors or things in his sort I wonder about the nutty folks out there. the costumes are great and gobsmacking, they perform very well in the musical numbers. I showed this to my mum, after the initial shock she was very amused and agreed with me that it was a very funny movie. I will watch this movie a lot in the future, why?? It keeps me laughing every time.",
         "Two drag queens (Guy Pearce as bitchy Felicia, and Hugo Weaving as Mitzi) and a transsexual (Terence Stamp, marvellous as the widowed Bernadette) make a trip to Alice Springs in a pink bus called Priscilla. Cue a soundtrack of mostly Abba songs (plus an off-the-cuff 'I Will Survive', and C E Peniston's 'Finally' - a great set-piece) and three towering performances. From the initial hilarious premise we follow the trio through the Australian desert and meet the various inhabitants of places they pass through. It remains fast-paced and touching within the comedy. Wonderful.",
         "i absolutely love this film, its one of my faves ever!!! i saw a small clip of it and it made me laugh so i bought the film and every time i watch it i sit there singing along to it and laughing so much that tears fall down my face.its hilarious the things that happen in it are great. the costumes are amazing and the acting is great they really did a good job. i swear that if you hear the opening song that you will sing it sometime without knowing it. I'm so glad i bought it if I'm bored or feeling down or sick them i watch this film and it cheers me up and i cant stop laughing; its that good. one of my faves in the film is with the \"4th member?\"",
         "This film goes down in my books as one of the best. The emotion involved with everything that happens is just heartwrenching. One moment i was laughing the next in tears. I would reccomend this film to anyone who wants a realistic look at gay life in the 80's. It's amazing how narrow minded people can be, but these people show us the true meaning of life, love, fatherhood, and most of all friendship and loyalty. Using humor and good natured prodding of controversial issues, the filmmaker is able to break through the barrier of bias, and get to the core of these three magnificent people. Fantastic Job! Chris Rogers",
         "A relatively low budget Australian film about drag queens took the world by storm, almost caused a riot at the Cannes film festival and drove a million young queens to the dressing up box in the hunt for sequins, sparkles and pink flip-flops! The Adventures of Priscilla, Queen of The Desert gave us such classic lines as, \"Just what this country needs, another cock in a frock on a rock!\" and \"Listen here you mullet, why don't you just light your tampon and blow your box apart, it's the only bang you're ever going to get, sweetheart\" It is without exception the best and arguably the most successful drag queen movie of all time, breaking box office records and capturing the top of the charts in numerous countries around the world. It was an Academy award winning extravaganza of glitter, glam and lip-syncing with the most outrageously camp costumes the world had seen outside Madame JoJo's or Funny Girls! Uproariously funny and yet deeply affecting it proved to be way more than just a camp outing of tried and tested queer humour. The late eighties was a bit of a coming of age time for Australia's gay population, especially Sydney, it really came alive and blossomed into one of the bigger gay populations in the world. Australia has a reputation for all the big butch manly men, which considering how the modern nation of Australia started, would seem pretty accurate, only it's not, it's completely different, ever so much more vibrant and colourful. It is that vibrancy, that colour and that hopefulness that is so perfectly depicted in Priscilla. Stephen Elliott, the director and writer, who incidentally has a small cameo in the movie as a cute door boy in Alice, says he saw drag shows in other places, like the US and England, which were essentially men in dresses lip-syncing to other peoples songs. In Australia they did the same, but took it in a completely new direction, it became a completely new strange variety of theatre, so much so that he even used to go to drag queen jelly wrestling, pushing the envelope to the maximum. It was this experience along with watching a drunken drag queen at the Sydney gay Mardi Gras, which gave birth to the movie idea, which took hardly any time at all to write. From the very opening you know this film has deep rooted soul, first shots of Hugo as Mitzi mouthing the words to the poignant Charlene song, 'I've been to paradise, but I've never been to me' give the impression of an emotively sad song, yet this is so rapidly defused by the appearance of a lethargic priest and Felicia nursing a baby rubber chicken. You have left in no doubt after that that is no ordinary Australian movie and the jokes and gags just tumble on from there in rapid succession. However it's not all giggles, there are some key moments of high emotion - seeing the graffiti sprayed on the side of the bus in pink paint the morning after shocks the trio along with the audience and strikes a chord with those of old enough to have lived through a time of such prejudice and discrimination and how true those word seem when they ring in our ears, that no matter how tough we think we are, such things still hurt. There are deeply moving scenes, such as the gay bashing of Felicia and the confrontation between Mitzi and his son in Alice, which really seem seep through the comedy to dance in your heart and make you fall in love with the film. ￼ One of the key aspects of the movie is the superb casting; Terrence Stamp previously typecast as your typical British villain, took a risk on the role of Bernadette and knocked it out of the water in a downbeat, down trodden put upon yet completely resilient way. Hugo Weaving is the less visually striking member of the trio and the central character of Mitzi, who really is the lynch pin between the two worlds. The role of Felecia is taken by the simply stunning Guy Pearce who had literally just left long running soap Neighbours, in which he played goodie two shoes Mike and was an inspired choice and oh so pretty. Guy's superb performance takes the movie to new heights and is so good that the he has had trouble-convincing people he is actually straight in real life, even to this day. Bill Hunter a massive Australian character actor shines outstandingly as the gruff and butch Bob, the mechanic and unlikely love interest for one of the three. Priscilla is a beautiful magical combination of humour, catty bitchiness, kitsch costumes, stunning disco soundtrack and subtle sentiment with provocative thoughtful scenes and a delicate brush of honesty. Some jokes are obvious so too is the stereotypical veneer of the characters upon first glance, yet look a little deep as the film rolls on, you see more and more layers being unpeeled and exposed in a gently moving and comical way. It is one of the most enjoyable gay movies of all time; each subsequent viewing cements that sentiment further into fact. Read more and find out where this film made it in the Top 50 Most Influential Gay Movies of All Time book, search on Amazon for Top 50 Most Influential Gay Movies of All Time, or visit - http://www.amazon.co.uk/dp/B007FU7HPO"
      ],
      "genres": [
         "Comedy",
         "Music"
      ],
      "productionCompanies": [
         "PolyGram Filmed Entertainment",
         "Australian Film Finance Corporation (AFFC)",
         "Latent Image Productions Pty. Ltd."
      ],
      "summaries": [
         "Two drag-queens (Anthony/Mitzi and Adam/Felicia) and a transexual (Bernadette) contract to perform a drag show at a resort in Alice Springs, a resort town in the remote Australian desert. They head west from Sydney aboard their lavender bus, Priscilla. En route, it is discovered that the woman they've contracted with is Anthony's wife. Their bus breaks down, and is repaired by Bob, who travels on with them.",
         "Three friends, three lives, one persuasion and a pink bus named Priscilla head into the Australian desert with their colourful, extravagant show in a road movie that brings culture clash to the forefront of a comedy of errors. A mixture of vast landscapes, narrow minds and a melancholy, reflective mood that with the help of a larger than life gal that is Priscilla she more than widens the comfort zones and finds not just new horizons but also finds that is lost.",
         "Two drag queens and a transsexual travel across the desert to perform their unique style of cabaret."
      ],
      "budget": 0
   },
   "movielensId": 345,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-05-31",
      "dvdReleaseDate": "2000-03-28",
      "directors": ["Stephan Elliott"],
      "runtime": 104,
      "movieId": 345,
      "title": "The Adventures of Priscilla, Queen of the Desert",
      "mpaa": "R",
      "actors": [
         "Terence Stamp",
         "Hugo Weaving",
         "Guy Pearce",
         "Bill Hunter",
         "Sarah Chadwick",
         "June Marie Bennett"
      ],
      "imdbMovieId": "0109045",
      "originalTitle": "The Adventures of Priscilla, Queen of the Desert",
      "genres": [
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": ["Jtz7jaBpSKk"],
      "plotSummary": "Two drag-queens and a transsexual contract to perform a drag show at a resort in Alice Springs, a resort town in the remote Australian desert. They head west from Sydney aboard their lavender bus, Priscilla. En route, it is discovered that the woman they've contracted with is the wife of one of the drag queens. Their bus breaks down, and is repaired by Bob, who travels on with them.",
      "tmdbMovieId": 2759,
      "avgRating": 3.62445,
      "releaseYear": "1994",
      "numRatings": 11776,
      "posterPath": "/pmHRJPlAEiYATBIgKAa0IyY6Or7.jpg"
   }
}