{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "martial arts",
            "id": 779
         },
         {
            "name": "hip-hop",
            "id": 898
         },
         {
            "name": "oakland",
            "id": 6219
         },
         {
            "name": "east asian lead",
            "id": 14988
         },
         {
            "name": "asian man",
            "id": 237849
         }
      ],
      "imdb_id": "tt0165929",
      "video": false,
      "title": "Romeo Must Die",
      "recommendations": [
         2140,
         10623,
         10796,
         10027,
         10431,
         9349,
         7549,
         8012,
         4141,
         11702,
         9884,
         11817,
         9604,
         8831,
         9594,
         9268,
         9460,
         17809,
         9691,
         10782
      ],
      "backdrop_path": "/51N8GQvpWKOxmq53UdkNRpBtXvg.jpg",
      "revenue": 91036760,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Hang Sing",
               "gender": 2,
               "credit_id": "52fe4333c3a36847f8042141",
               "name": "Jet Li",
               "profile_path": "/5himGJzSuLoHwqacTz7sXWqgeMt.jpg",
               "id": 1336,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Trish O`Day",
               "gender": 1,
               "credit_id": "52fe4333c3a36847f8042145",
               "name": "Aaliyah",
               "profile_path": "/9AUA7yvMocrm9A5TtaHZ12hxQjT.jpg",
               "id": 21352,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Mac",
               "gender": 2,
               "credit_id": "52fe4333c3a36847f8042149",
               "name": "Isaiah Washington",
               "profile_path": "/kK4nEwvY0MFwCsQ17E0w0El7G9P.jpg",
               "id": 21353,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Kai",
               "gender": 2,
               "credit_id": "52fe4333c3a36847f804214d",
               "name": "Russell Wong",
               "profile_path": "/fbQZoOocgmcNq88hUkBgHKhvycb.jpg",
               "id": 21354,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Silk",
               "gender": 2,
               "credit_id": "52fe4333c3a36847f8042151",
               "name": "DMX",
               "profile_path": "/eoAfTjFs6SiXGBmdlfasb0J9fHw.jpg",
               "id": 21355,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Isaak O`Day",
               "gender": 2,
               "credit_id": "52fe4333c3a36847f8042155",
               "name": "Delroy Lindo",
               "profile_path": "/uhjdTemc2kYbQj47bVqRb7OdVjH.jpg",
               "id": 18792,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Colin O`Day",
               "gender": 2,
               "credit_id": "52fe4333c3a36847f8042159",
               "name": "D.B. Woodside",
               "profile_path": "/deDzc1UEZsOvamdhvBPNbwrBSrM.jpg",
               "id": 21356,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Po Sing",
               "gender": 0,
               "credit_id": "52fe4333c3a36847f804215d",
               "name": "Jon Kit Lee",
               "profile_path": "/mbaz0eYZxaUVHS72fJsI1Y5b12b.jpg",
               "id": 21358,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Vincent Roth",
               "gender": 2,
               "credit_id": "52fe4333c3a36847f8042161",
               "name": "Edoardo Ballerini",
               "profile_path": "/2Xkuux55UDZ3LSlOx9tIkQLrDdQ.jpg",
               "id": 21359,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Maurice",
               "gender": 2,
               "credit_id": "52fe4333c3a36847f8042165",
               "name": "Anthony Anderson",
               "profile_path": "/xcMJimUAcQJGCSw25je1TLMy8rC.jpg",
               "id": 18471,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Dave",
               "gender": 2,
               "credit_id": "52fe4333c3a36847f8042169",
               "name": "Matthew Harrison",
               "profile_path": "/6uOg2aQBVe8TAmv41W2y3omn1Mr.jpg",
               "id": 21360,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "Kuang",
               "gender": 2,
               "credit_id": "52fe4333c3a36847f804216d",
               "name": "Terry Chen",
               "profile_path": "/jrzqH7uKK8goyAJcXuKz8DdCAbS.jpg",
               "id": 11677,
               "order": 12
            },
            {
               "cast_id": 22,
               "character": "Ch`u Sing",
               "gender": 2,
               "credit_id": "52fe4333c3a36847f8042177",
               "name": "Henry O",
               "profile_path": "/cJ7rk3cmGOc0m1T90oPgZylntcs.jpg",
               "id": 39829,
               "order": 13
            },
            {
               "cast_id": 23,
               "character": "Maurice's Crew",
               "gender": 2,
               "credit_id": "56f9a0f2c3a368193d000046",
               "name": "Gaston Morrison",
               "profile_path": "/hcIRaC03NEpbJydyDBEWMClZq7m.jpg",
               "id": 1597842,
               "order": 14
            },
            {
               "cast_id": 24,
               "character": "Overlord",
               "gender": 2,
               "credit_id": "56fa6aa7c3a368193d002240",
               "name": "Colin Foo",
               "profile_path": "/khuJ5PQUiqDu2vKHJT09Bs41Xv2.jpg",
               "id": 1228374,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4333c3a36847f804211f",
               "name": "Andrzej Bartkowiak",
               "profile_path": "/K2pgHC907AUCim8WOkHOJpqERC.jpg",
               "id": 10765,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4333c3a36847f8042125",
               "name": "Eric Bernt",
               "profile_path": null,
               "id": 21348,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4333c3a36847f804212b",
               "name": "John Jarrell",
               "profile_path": null,
               "id": 21349,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4333c3a36847f8042131",
               "name": "Stanley Clarke",
               "profile_path": "/lFXzQwokEU16B99FtSDTIshmTr9.jpg",
               "id": 9769,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4333c3a36847f8042137",
               "name": "Derek Brechin",
               "profile_path": null,
               "id": 21351,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe4333c3a36847f804213d",
               "name": "Lora Kennedy",
               "profile_path": "/iLrYUr57iX8LdHxnh3bflegzWuE.jpg",
               "id": 2953,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "52fe4333c3a36847f8042173",
               "name": "Glen MacPherson",
               "profile_path": null,
               "id": 22818,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 10.88813,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 2085,
      "vote_count": 406,
      "budget": 25000000,
      "overview": "Two warring gang families (one African-American, the other Chinese) maneuver for bragging rights to the Oakland, California, docks. Hang SIng and Trish O'Day uncover a trail of deceit that leaves most of the warring factions dead … or worse!",
      "similar": [
         11841,
         55292,
         9053,
         9461,
         146,
         11770,
         24,
         140300,
         604,
         682,
         605,
         65,
         9502,
         277216,
         7549,
         2024,
         98566,
         16320,
         27578,
         27582
      ],
      "original_title": "Romeo Must Die",
      "runtime": 115,
      "poster_path": "/4c5YlG72lFWdvCNkTJphc4OGjBX.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "普通话",
            "iso_639_1": "zh"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/gMQ3oAjFyLIToDgrMKZgSCta3gT.png",
            "name": "Silver Pictures",
            "id": 1885,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "2000-03-20",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "In the city ruled by criminals, two families have forgotten their fear. He will make them remember.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Andrzej Bartkowiak"],
      "runtime": 115,
      "synopsis": "Two rival gangs, one Asian, the other African American, are locked in a fierce and brutal turf battle, vying for control of Oakland's waterfront properties. But when the first casualty is the Asian warlord's son Po, the gang war becomes more dangerous than either side ever imagined. News of the murder gets back to Po's big brother Han (Jet Li - Lethal Weapon 4, Kiss Of the Dragon), a legendary ex-cop currently imprisoned in a Hong Kong jail. In a world of vicious rivalries and violent betrayals, Han has no choice but to escape and declare war himself. But unlike others, who can only use weapons, Han IS a weapon. And falling into his sightlines can be a deadly mistake.",
      "writers": [
         "Mitchell Kapner",
         "Eric Bernt"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0165929/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI5Nzg1MjA5M15BMl5BanBnXkFtZTYwNzAxNzg2._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Jet Li, Aaliyah, Isaiah Washington | See full cast and crew »"],
      "reviews": [
         "Not usually a fan of this type of all-out Action movie, \"Romeo Must Die\" knocked me off balance when I found it to be one of the best films I have ever enjoyed. Producer Joel Silver (Who also produced \"The Matrix\") describes the film as an \"Urban rendition of Romeo and Juliet\" and although this is a very simple way of looking at the film, it's not far off the mark. Like the great Shakespeare work, there are two opposing families in this film, each looking to make big commercial gains in the world of real estate development. Caught up in their lies, greed and violence are Trish O'Day (Played by Aaliyah) and Han Sing (Played by Jet Li). The story revolves around their quickly blooming relationship and the opposing families around them. The film boasts some serious eye candy with some of the best special effects you'll see. Luckily, this is not the only good thing going for the movie as the eye candy is wonderfully supported by some fantastic performances from the cast. In her first feature movie, Aaliyah is absolutely breath taking as Trish O'Day. Showing the kind of charm and 'x' factor that few will ever have, she alone makes this film a must see. Jet Li's performance is, as always, about his skills as a martial artist but his scripted acting continues to improve. Another stand out performance for me was that of D.B. Woodside who plays Trish O'Days brother - Colin. Although not such a major role, D.B. excels in this role. High end production values mean the film has a real style and \"gloss\" to it and everything fits in place and the story moves along at just the right pace. In fact, \"Romeo Must Die\" is a shining example of how good story telling does not need to be lost in a sea of special effects and glossy American values. Jonathon Ross describes the film as \"Fast, Furious, Fun\", which is definitely true, but there is more to this film that the audience can take away with them. The reason the film works is that it works on two levels - storyline and action. You can enjoy both aspects and take from them what you like. This is a brilliant film and I highly recommend it.",
         "\"Romeo Must Die\" is definetely the most violent \"interpretation\" of Shakespeare I`ve ever seen. Okay, interpretation is not the right word to use, but that is nevertheless what this movie at some point wants to be. I really liked Jet Li in this movie, and I`ve liked him since I first saw him in \"Lethal Weapon 4\" a couple of years ago. Fighting and betrayal is what \"Romeo Must Die\" is all about, and the fighting is very entertaining, although sometimes a bit cheesy, because some of the \"Matrix-scenes\", which is out of place outside the world of science-fiction. Still, \"Romeo Must Die\" is an actionflick you wouldn`t want to miss. It manages to be interesting enough, but the fighting is what makes it really good. 8/10",
         "ROMEO MUST DIE is one of those rare films which, while not particularly good for its genre, is surprisingly good for other reasons. Most of the black characters, even the villians, are sympathetically portrayed, even though the hero is Asian. Aaliyah is wholesomely sexy and quite beautiful. Russell Wong is phenomenal is a very short role. This guy has the looks, style, and presence of Russell Crowe. Jet Li, however, is very humane and appealing, though his character is underwritten. Most of the asian characters are shortchanged dramatically. However the white (primarily Jewish) characters are shortchanged the most. They receive the brunt of the ugly stereotyping. The kung-fu sequences are nothing special. They are too fast and too confusing to be completely effective. Though neat, the Xray effect detracted from the \"realism,\" sort of like the old split screen and slo-mo effects of the 1960s films. Bone-crunching is far more effective; and, would someone please dispense with this \"flying\" nonsense? I don't want to see anything up there or the screen that is not physically possible. Special note must be made of Francoise Yip, the Female bike / fighter. If Ms. Yip did all her own stunts, she's not only stunningly beautiful, she is also awesome. One quibble, which I feel follows a disturbing pattern in motion pictures. Though Jet Li and Aaliyah are quite obviously in love at the close of the film, they never kiss. In a film which shows two beautiful asian dances french kiss, and one bares the other's breast and kisses her erect nipple,would it have been too much to ask to have to people of different races who are obviously in love share a romantic kiss?",
         "jet Li rocks, and this film was great. Sure, it's silly, but it's never boring, there are some slick fight scenes, and the soundtrack is pretty neat. It manages to be a romantic film without being sappy and stupid, it manages to be an action film where the action rocks but isn't too over-the-top, and it manages to make good use of the Shakesphere story, ROMEO AND JULIET while still respecting the themes and the humor. Generally, the film is pretty silly. The acting isn't particularly good, the characters are two dimensional, the plot holes are numerous, and events are sometimes quite predictable. However, I don't regret watching it. I was entertained and was satisfied by the film as a whole. It worked really well. If you're looking for a good film that doesn't require a lot of thought and investment from the viewer but is at least entertaining and energetic, ROMERO MUST DIE is a good film to check out.",
         "I read some not-so-great reviews about \"Romeo must Die\" so I really didn't have my hopes up high. I only decided to watch it because I love Jet Li. Good thing I did watch it!! It was SO cool!! Jet Li didn't disappoint - not only was his fighting as 'wow' as ever (and I know, a lot of people think too much CGI was used, compromising his true abilities. I agree with that, but you have to admit, it still looked pretty dayam good), his dramatic acting is amazing too!! However, living in Hong Kong, I DO have a few problems with the film. Firstly, it REALLY exaggerates the whole Asian thing, making it seem like we Chinese all practice Kung Fu in our backyards while drinking Oolong tea every day...which in fact, is NOT what Hong Kong people do (yes, I'm sorry if I'm shattering some dreams here - Hong Kong people do too watch television and shop and do things other than learn Kung Fu. In fact, you'd be hard-pressed to find one person in Hong Kong who knows martial arts Jet Li style). The Chinese people in the film all have names like \"Po\" and \"Han\" and say things like \"let's show them our true strength\"...I'm surprised they didn't put some phrases like \"Let's summon our family's ancestral dragons\" in. ALSO, I was really confused when they showed Hong Kong. It was nothing like the Hong Kong and all but one person spoke in Mandarin (most people in Hong Kong speak cantonese). I'm not sure if that bit WAS actually Hong Kong but...if you're going to say that he's in prison in Hong Kong, why choose a place which does NOT give a proper image of Hong Kong? There must've also been some confusion with Chinese and Japanese because I swear, at times, Han's (Jet Li's character) dad seems more Jap than anything... Still, I liked the film. There wasn't enough development between Jet and Aaliyah but Jet Li still looked really cute. Jet Li really kicks something serious in the movie and so I let all the other things slide - even the idea that the Chinese guys turn out to be the bad guys and the black guys turn out to be actually...awww...really nice people. Lindo was good and Aaliyah was REALLY REALLY good. It's sad - she would have made a terrific actress and I'm happy that she did leave behind at least this movie. Watch this movie. I just realised that my review doesn't actually sound too positive but trust me - I really did like the film. In fact, I'm going to watch it again now!",
         "For those who like cross-culture, \"Romeo Must Die\", show be the one for you! Jet Li who was fresh from \"Leathal Weapon 4\" really delivers in this action-packed movie. Playing Han was a big one for him. Aaliyah(1979-2001), the R&B sensation really got her acting chops in gear playing the alluring Trish O'Day, who is being shadowed by the bumbling Maurice, played by the hilarious, Anthony Anderson. Everybody would call him MORON! Which I think is funny. I liked the X-ray effects of the movie whenever a fight was going to happen. I liked the part when Han refused to a fight a woman, he used Trish to fight her with. It looked more of a swing dance to me. Since Trish's words backed him up, the enemy was impaled through the heart. And after the final fight, Trish's father (Delroy Lindo), wanted to meet Han for himself, and I 'm glad he got that chance, I think it was silly for him to demand a handshake from him, but hey, he wanted to who the \"cat\" was, and make sure he did. Han never declined any offer only to know who was the troublemaker behind the \"war\". Before anyone remember seeing Aaliyah in \"Queen of the Damned\", check out this movie first. Rating 4 out of 5.",
         "I was surprised I enjoyed much of this since martial arts movies are okay but nothing I really get into often. Jet Li plays the only likable character in this Asians vs. Blacks gang story. Some of the stunts were tremendous. Some were so over-the-top, so unbelievable that they were funny. The movie certainly isn't one to be taken seriously. The wild action scenes, fairly involving story and nice colors and interesting sound track all make this movie a cut above the normal martial arts fare. The excellent surround sound and sharp picture make it a good one for DVD.",
         "There seems to be several films in this one. A story about corruption and property deals, a story about fathers and their children, a tentative Romeo and Juliet romance and of course martial arts and guns. The actors acquit themselves well. One hoped for more of Michael Wong and less of Anthony Anderson (his constant 'Dim Sum' refrain being quite irritating) but the actors act, the plot moves and the film is enjoyable enough. Jet Li is as usual very watchable and apart from his skill at martial arts (quick and effective but always graceful) he acts OK. His cab scene with Aaliyah is charming and funny and one wanted more of that but their relationship is underdeveloped in the script. It is a pity as Aaliyah is luminous and sassy. Her untimely death in real life was a tragedy. Not as good as 'Kiss of the Dragon' but better than 'The One' and 'Cradle 2 the Grave' but inferior to Jet Li's Hong Kong movies.",
         "Not trying to win Oscars here but it is kick ass fun. Aaliyah's best acting performance by far in her short life, Washington, Lindo and even Anthony Edwards helped Aaliyah's performance with great support and I must say DMX is not bad for a rapper/actor!!! Jet Li was Jet Li! Dialogue is bad often awful but the guy can really perform his martial arts! Romeo Must Die isn't the best Shakespeare adaptation but it is what it is and that is a good martial arts/love/action film 7/10",
         "What a movie! This is one of those films that you simply cannot ever be bored in. At the beginning you are as much in the dark as the hero, Jet Li, and as such your understanding develops as his does. By not explaining the film the director keeps the intrigue up while at the same time thrilling us with the camera. Jet Li is incredible in his largest role to date. He proves that not only can he kick but has some acting ability in there as well. Aaliyah is not great but fills the role nicely as Li's romantic interest. The other characters are left beautifully in the background until the necessary time when they spring to the limelight to steal the show, however briefly, from Li. Ok so it isn't his best martial arts movie (that was probably the Legend of Fong Sai-Yuk) but his fighting is coupled with an excellent story, one that is far more elaborate than a simple Romeo and Juliet, with less of the soppy love stuff too. For any martial arts, mystery, action, thriller, even dare I say sports (a wonderful American Football scene) film fan will love this film. Definitely one for any video collection!"
      ],
      "genres": [
         "Action",
         "Crime",
         "Thriller"
      ],
      "productionCompanies": [
         "Warner Bros.",
         "Silver Pictures"
      ],
      "summaries": [
         "In this modern day Romeo and Juliet, kung fu action star Jet Li plays Romeo to hip-hop singer, Aaliyah Haughton's Juliet. Li is an ex-cop investigating the murder of his brother, who had ties with the Chinese mafia in America. Aaliyah plays the daughter of the American mob boss. Neither side approves of their romance, so, obviously, kung fu action ensues, with a soundtrack by Aaliyah.",
         "The death of Han Sing's little brother catapults him out of a Hong Kong jail to the Oakland-San Francisco waterfront, where he vows to find his brother's killers. His quest lands him in the middle of a three-way deal between Chinese, Black and White \"businessmen\" who will stop at nothing to create a new money-making stadium. Han finds help from Trish, a woman with close connections to the Black mob, and together they work to find their brothers' killers.",
         "Han Sing is an ex-cop who went to prison in Hong Kong to let his father, a Chinese crime lord, and his brother escape to San Francisco. When his brother is killed, seemingly by a black gang headed by Isaak O'Day, Sing breaks out of prison and gets to America to discover his brother's killer and avenge his death.",
         "When a Chinese gang lord's son is murdered in Oakland, his brother, Han, breaks out of a Hong Kong prison to find out how it happened and to avenge his death. He arrives on controlled turf, a waterfront run by the rival gang-lords Ch'u Sing (Han's father) and Isaak O'Day, and their respective Chinese and African-American crime organizations. When it is clear that something bigger is involved, Han teams up with O'Day's daughter Trish to continue the hunt for justice.",
         "An avenging cop seeks out his brother's killer and falls for the daughter of a businessman who is involved in a money-deal with his father."
      ],
      "budget": 25000000
   },
   "movielensId": 3452,
   "movielens": {
      "languages": [
         "English",
         "普通话"
      ],
      "releaseDate": "2000-03-20",
      "dvdReleaseDate": "2000-08-01",
      "directors": ["Andrzej Bartkowiak"],
      "runtime": 115,
      "movieId": 3452,
      "title": "Romeo Must Die",
      "mpaa": "R",
      "actors": [
         "Jet Li",
         "Aaliyah",
         "Isaiah Washington",
         "Russell Wong",
         "DMX",
         "Delroy Lindo",
         "D.B. Woodside",
         "Jon Kit Lee",
         "Edoardo Ballerini",
         "Anthony Anderson",
         "Matthew Harrison",
         "Terry Chen",
         "Henry O",
         "Gaston Morrison",
         "Colin Foo"
      ],
      "imdbMovieId": "0165929",
      "originalTitle": "Romeo Must Die",
      "genres": [
         "Action",
         "Crime",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "_6QajoX9t2o",
         "rpy4lGGlDOA"
      ],
      "plotSummary": "Two warring gang families (one African-American, the other Chinese) maneuver for bragging rights to the Oakland, California, docks. Hang SIng and Trish O'Day uncover a trail of deceit that leaves most of the warring factions dead … or worse!",
      "tmdbMovieId": 2085,
      "avgRating": 3.02287,
      "releaseYear": "2000",
      "numRatings": 5115,
      "posterPath": "/4c5YlG72lFWdvCNkTJphc4OGjBX.jpg"
   }
}