{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "car race",
            "id": 830
         },
         {
            "name": "private school",
            "id": 3551
         },
         {
            "name": "diner",
            "id": 10738
         }
      ],
      "imdb_id": "tt0195778",
      "video": false,
      "title": "Here on Earth",
      "recommendations": [
         47608,
         41582,
         42486,
         33657,
         42580,
         12312,
         24940,
         38225,
         47881,
         27281,
         8986,
         31923,
         11065,
         18402,
         23438,
         35645,
         17770,
         20009,
         74718,
         10109
      ],
      "backdrop_path": "/p9YqoSqc8lCtaHmI99k8SYRmeDF.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Samantha Cavanaugh",
               "gender": 1,
               "credit_id": "52fe45789251416c750578ff",
               "name": "Leelee Sobieski",
               "profile_path": "/fAJ4H6Hi0SZPt6I82TfnfCl9i43.jpg",
               "id": 22290,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Kelvin Morse",
               "gender": 2,
               "credit_id": "52fe45789251416c75057903",
               "name": "Chris Klein",
               "profile_path": "/foKh17RAUIhmfNgZ3TIvHJrNkDR.jpg",
               "id": 21594,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Jasper Arnold",
               "gender": 2,
               "credit_id": "52fe45789251416c75057907",
               "name": "Josh Hartnett",
               "profile_path": "/y4PSud4TyFzLD7BR87TVkaUoDCT.jpg",
               "id": 2299,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Malcolm Arnold",
               "gender": 2,
               "credit_id": "52fe45789251416c75057911",
               "name": "Michael Rooker",
               "profile_path": "/bvmf7TIjCyRPrBNrmZ5qyePTL5y.jpg",
               "id": 12132,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Betsy Arnold",
               "gender": 1,
               "credit_id": "52fe45789251416c75057915",
               "name": "Annie Corley",
               "profile_path": "/cb2fKqpMAZ9NwMj8HXMfWV6VHci.jpg",
               "id": 6907,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Earl Cavanaugh",
               "gender": 2,
               "credit_id": "52fe45789251416c75057919",
               "name": "Bruce Greenwood",
               "profile_path": "/his8sEwC8FLC4dAxVSu9GNicE6Z.jpg",
               "id": 21089,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Jo Cavanaugh",
               "gender": 1,
               "credit_id": "52fe45789251416c7505791d",
               "name": "Annette O'Toole",
               "profile_path": "/vUsmxRy3CeyYEDNi8fgfAAzsmgH.jpg",
               "id": 1734,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Jennifer Cavanaugh",
               "gender": 0,
               "credit_id": "52fe45789251416c75057921",
               "name": "Elaine Hendrix",
               "profile_path": "/2usTUKG0PhNg6YUviYiESKjGvOb.jpg",
               "id": 55422,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "540eb0300e0a26419d000b13",
               "name": "Mark Piznarski",
               "profile_path": "/btn2vzCZF06BRvMbGnUYrMHwqB3.jpg",
               "id": 1219210,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5735227f925141672f00051a",
               "name": "Nancy Foy",
               "profile_path": "/blCkmS4dqNsbPGuQfozHE6wgWBw.jpg",
               "id": 4952,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "58fe452592514163ec034790",
               "name": "Michael Seitzman",
               "profile_path": "/5FKWDdhn1u1mosOxIj5fALB2y6P.jpg",
               "id": 58644,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "58fe452d925141642f034b62",
               "name": "Andrea Morricone",
               "profile_path": null,
               "id": 60628,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "58fe4534c3a3687a25033c29",
               "name": "Michael D. O'Shea",
               "profile_path": null,
               "id": 53840,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "58fe453a92514163ec03479d",
               "name": "Robert Frazen",
               "profile_path": null,
               "id": 65849,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Romance",
         "id": 10749
      }],
      "popularity": 3.935644,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 13539,
      "vote_count": 60,
      "budget": 0,
      "overview": "A rich college kid is taught a lesson after a joy ride ends up destroying a country restaurant.",
      "similar": [
         165,
         59861,
         9679,
         10483,
         10285,
         59,
         158,
         920,
         22881,
         49013,
         19912,
         51620,
         168259,
         105,
         796,
         241848,
         11451,
         2654,
         7459,
         77950
      ],
      "original_title": "Here on Earth",
      "runtime": 96,
      "poster_path": "/nE6cuxVJlOjq4Zxnu8FnGuBQIFO.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Friendly Productions",
            "id": 89439,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Fox 2000 Pictures",
            "id": 711,
            "origin_country": ""
         }
      ],
      "release_date": "2000-03-23",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Mark Piznarski"],
      "runtime": 93,
      "synopsis": null,
      "writers": ["Michael Seitzman"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0195778/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BOTc3MDk4NTk2Nl5BMl5BanBnXkFtZTcwMzc4NDE1MQ@@._V1_SY317_CR12,0,214,317_AL_.jpg",
      "actors": ["Stars: Chris Klein, Leelee Sobieski, Josh Hartnett | See full cast and crew »"],
      "reviews": [
         "OK, it was my weekly \"free\" rental, so it didn't have to be great. But I cannot understand all the highly negative criticism of \"Here on Earth.\" It has a very true theme, everyone deserves to find true love before they die. However, it plays more like a \"made-for-TV\" teen romance than a theater blockbuster. But it is better than many of the \"teem movies\" made recently. Sam (Leelee Sobieski) is a small town girl whose big plans to go to UM on a track scholarship got waylayed by a knee injury. She has a boyfriend Jas (Josh Hartnett) that she has known forever, he loves her (\"I know you better than anyone, Sam.\"), but we can see there isn't the passion one expects of true love. Along comes Kelley (Chris Klein), the smart (valedictorian) rich kid who is stuck on himself, the last person Sam's sister and parents want her to get mixed up with. But there is a spark of passion there, Sam starts to feel for the first time she might find true love. You see, she has a secret. The knee injury has affected her liver and she is on a fast path to death. Kelley and Jas are like two elk competing for the one fertile female at springtime. Verbal and physical challenges, an ill-advised car chase results in a crash into gas pumps and burning down the local hangout. Both of their sentences require them to work all summer to rebuild the restaurant. Kelley stays in the garage apt. When the summer is over, the restaurant rebuilt, Sam has been laid, Jas is no longer Sam's girlfriend, Kelley just boards the bus and leaves without visiting the dying Sam. He has things to attend to, a life to get on with. However, back at home he has second thoughts, sees yellow roses planted by his deceased mum, and goes back to be with Sam. At her funeral, he reads from poetry they both enjoyed. She found true love before she died, he learned about what is really important. The story is not novel, but it still is a pretty good one. Josh Hartnett is excellent as the unpolished bumpkin, Leelee as the philosophical girl looking for meaning in her short life. But Chris Klein looks out of his league. He still has a way to go before he can graduate from his teen gross-out roles in films like \"American Pie.\" I never felt totally immersed in the film, because some of the acting and some of the dialog didn't quite ring true. However I found it to be a pleasant 90 minutes and it probably deserves a rating somewhere around 5 to 7, which is where the IMDb votes cluster presently. To rate it a \"1\" as so many have, or to call it \"possibly the worst movie of all time\" are just absurd. The DVD was fine, with Dolby 5.1 sound, but the extras consist primarily of several trailers for other films put out by this company.",
         "This is a very unusual film which starts out with a rich dude getting a brand new sports car for graduation and decides to take it for a spin in the local town. Rich boy meets poor girl in 'Mabels Diner'who is a waitress and local boy friend gets very upset and a fight starts out. There is a car chase and all kinds of problems seem to take place and the Rich boy and Poor boy wind up having to do Community Service as ordered by the town judge. Rich boy and Poor boy just do not get along and the Rich boy winds up winning the heart and soul of the poor boy's girl friend. There are plenty of walks in the woods and poetry is quoted and some very deep thoughts about life. Poor Girl says, \"Some people go through life and never find Love, I can say that I found love and am holding on to It\". You will need some tissue's if you are sensitive, there are plenty of romantic scenes and I doubt very much if you will guess how this picture will end. The producer and director came up with a good idea and finally put an end to a film. If you like true to life stories with poetry and very sensitive subjects, this is your film.",
         "Dear Mr. Seitzman, Or Whomever I May Hold Responsible For Mr. Seitzman Not Meeting His Rightful Fate Of Being Eaten Alive by Rabid Wolverines; I do not know you, and so cannot comment on your character; for all I know, you give to charities and help little old ladies cross the street. Still, I must insist, for the common good, that you never write another screenplay as long as you live. Put down the pen, step away from the laptop! If you refuse to heed the pleading of wounded brains, I have watched a movie or two in my life, and I believe you will find my counsel helpful: 1. Do not include love scenes in which overwrought teenage boys name the body parts of their girlfriends after US states. If you must pen such a scene, please do not name the breasts \"New York\" and \"New Jersey\"; it causes unnecessary speculation as to which cities occupy the nipples. Also, it is almost incomprehensibly stupid and annoying. 2. Do not rely solely on John Hughes movies in order to reinforce class distinctions. 3. Do not bludgeon the audience over the head with exhausted clichés. Yes, yes, Kelley and Sam stand out in the rain, and it cleanses them of their cares. We get it. Yes, the roses continue to bloom in Kelley's dead mother's greenhouse, even though every other plant has begun to rot. It Is A Symbol Of Their Love. It is also very painful when applied via blunt-force trauma to the backs of our heads. For the love of God, Mr. Seitzman, we get it. We all get it, all across the land. Amish people, the hard of hearing, unborn babies - we all get it. 4. Do not require the actors to perform mime sequences. Ever. No, never. 5. Did I mention that you should ease up on the trite symbolism? Because the audience can draw the parallel between the rebuilding of the restaurant and the building of the relationship between Kelley and Sam without any help. Truly. We get it. 6. Go through your script, and cull out the following lines, and any lines resembling them: \"I don't know what we are anymore.\" \"I don't want to lose you.\" \"He's just like the rest of them!\" (And its corollary, \"Daddy, you don't even know him!\") 7. Yes, yes, she's in heaven, running around in a field. We get it. 8. And in other news, we get it. I have seen dozens of terrible movies in my life; I never expected to suffer for your art, and I would have just left the theater, but an elephant with the words \"DOOMED LOVE\" painted on its side fell from the sky and pinned me to my seat. In closing, your writing bites, you owe me ten dollars, and I hate you.",
         "Rich vs. poor. Big city vs. small town. White collar vs. blue collar. These things are not original themes in movies. So when one chooses to involve these themes, the situational story-line had better be very original, or very good. This one was neither. I never believed in the romance of the two young lovers in this movie. Neither convincing nor compelling, it just fell flat. Don't bother, even with a video rental.",
         "..that separate good, memorable movies from movies like this. Its not entertaining, touching, funny, interesting and at times feels a little sub-human. The principals act like they are other-worldly, in the worse way, when they are supposed to be relating to each other and the audience. Starts out conventionally enough. Rich kid gets new car for graduation but the dean says he can't have the car until after the ceremony. Goes joy-riding nonetheless, and stops in the diner on the wrong side of the tracks for a quick argument with the local yokels. Wise-asses the waitress/girlfriend of the head yokel. Shockingly, they play chicken until they accidentally burn down the diner they left three minutes earlier (aren't all diners five feet from the gas station?). They told they have to Pay The Price in court, so the only reason to get this 'fish out of water' to stay in town is to come up with the scenario that both boys have to assist in the rebuilding of the diner. Worse than that, the rich kid in staying with the family of the un-rich kid..in the room above the attic. That 'room above the attic' has rescued many a person in need of a bed.. Rich kid inexplicably is treated well by the girlfriend, who never mentions to him that he nearly killed her. This does not bode well, of course, with her boyfriend, and is never fully explained. You don't know why Sam (Leelee Sobieski) falls for Kelley (Chris Klein), or why Jasper (Josh Hartnett) allows it. Chris Klein is tolerable, Leelee completely intolerable, and Josh does not register much of an impression. The character with the most life is the judge that sentences Kelley and Jasper to help re-build the diner. She gets off at least one funny remark, which is more than anyone else does. Everyone is so morose and humorless that you will feel a little sill if you even think of smiling while the movie is on. The ending is one way to end the piece, not the most original, but at least it was over. I don't enjoy trashing a movie that some little girl somewhere in the world might really love, but since I am not one, I have to. The nicest thing I can say about this movie is that its not mean-spirited, and although it fails to compel, its innocence and home-spun, corny dialogue comes from a nice place. 4/10.",
         "To be fair, it has been several years since I watched the bile committed to celluloid known as \"Here on Earth,\" so forgive me if my memory of the film is a little sketchy. I'll stick with the main points which plague the soul of the unfortunate viewer. Scene One: Chris Klein, after having been thrown out of prep school (because he looks like a seventeen year old--yes, very believable), gives what I assume is his valedictorian speech...to a field. Let me repeat that for you--a field. I think we're supposed to be moved by the combination of shame and eloquence he is failing to express. Klein has the delivery and facial expressions of a cardboard cutout. He is a decent looking piece of cardboard, but little more. Scene Two: After some joyriding and teenage pyromaniac hijinks, Chris Klein and Josh Hartnett do some damage to the local diner, of which he is forced to rebuild. Of course. Because who better to help with construction than some random moron who crashed into it/ burned it in the first place. Better yet, let's have said random moron move in on Josh Hartnett's girl, Miss Sobeski, the girl he fancies for...her equally wooden line delivery? Scene Three: Chris Klein's character is making out with Leelee Sobeski's character and decides to name her various body parts after the states on the eastern seaboard. My soul weeps. Really, how can this scenario turn out well? Surely you must alienate several million people if you imply their home is equivalent to Miss Sobeski's more...erm...feminine areas. Secondly, naming her breasts after New York and New Jersey prompts some confusion as to whether Miss Sobeski is actually freakishly disproportionate. Scene Four: Leelee is running. She falls down. This gives her...knee cancer. \"We always knew it could come back,\" her father(?) says. Right. Knee cancer. From tripping. Perhaps I missed something. As I said, it's been a few years. Surely I missed something. Didn't I? For the love of God, please tell me the girl did not contract KNEE cancer from falling down. That scream you just heard was my soul dying.",
         "All I have to say is that this movie is the bomb. You are going to cry when you see this. I mean, this is a reminder for everyone how hard and easy it is to fall in love. It reminds you of the days during your youth when you were carefree and everything that was bad for you was washed away with a single kiss. Even though I am still a teen, this is how I live my life. When I am with that certain someone, everything that was negative in my mind was erased. So, I give this movie a 10 for it's heartfelt message and touching plot. Actors Josh Hartnett and Chris Klein I also give a 10 for having a cute face.",
         "My small town local theatre didn't get it in. Instead they opted for a comedy. I chose to go instead, to the next town over and see this. It was well worth it. This is a very touching story with enough humour to lighten the mood. Chris Klein is a wonderful actor and really played his part well. The man brought tears to my eyes. Leelee Sobieski was as good in this as she was in Joan of Arc. Josh Hartnett who plays her small town (boy)friend was so sweet you almost wanted him to get the girl. The 3 actors have very bright futures ahead of them. As long as they choose their roles as wisely as they chose these.",
         "This was a sad waste of two such promising actors. Chris Klein's character was unlikable from the start and never made an improvement. What did she see in him?? He was rarely kind, never thankful for what he does have...and a coward. Pass this one by on the shelves. You'll be glad you did.",
         "This film is a genuine five-hanky tearjerker that slathers on the schmaltz thick as marmalade. The story begins with a rivalry between a group of prep school boys and local townies that have a reckless car race that ends up burning down a local diner and gas station. The judge sentences the two drivers to a summer of community service rebuilding the diner. Kelley (Chris Klein) is a spoiled rich boy with attitude. Jasper (Josh Hartnett) is a local hick with a good heart and a bad temper. Needless to say, the two boys hate each other. To complicate matters, Jasper's girlfriend Samantha (Leelee Sobieski) is developing a serious case of the hots for Kelley. They begin an affair complete with dewy looks, running through fields, stolen glances and every other schmaltzy film technique ever invented. The prep/townie rivalry escalates into a love triangle with all the foreseeable showdowns and confrontations. Just when everyone is working themselves into a good lather it is discovered that Samantha is seriously ill. Pass the Kleenex. The film has some very sweet moments but the story is far too formulaic and predictable. It has the feel of a TV movie, which is not surprising since director Mark Piznarski has mostly TV projects on his resume. To his credit, the cinematography was beautiful and his choice of locations was superb. The overlook scenes were particularly lovely. Chris Klein gave an adequate performance, but was not very dynamic and a little stiff. I felt that he was much better in `American Pie' playing a more sincere character. He seems like too nice a guy to play this spoiled and arrogant rich kid. Leelee Sobieski was a good choice for Samantha. She comes across as very vulnerable and sweet. She was adept at capturing the delicate teenage balance between tentativeness and determination. I actually liked Josh Hartnett better than I did Klein. Perhaps he was better suited for his character, but he seemed a lot more believable as Jasper. This is a great chick flick. It is sentimental, romantic, endearing and sad. Guys are likely to spend most of the movie writhing in their seats. Unfortunately, it wasn't very original and suffered from too many clichés. I rated it a 6/10. Add one or two points if you like sentimental romances and another if you like a movie that makes you cry. A good film for girls' night out."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Fox 2000 Pictures",
         "Friendly Productions"
      ],
      "summaries": [
         "The lives of three young people - a rich student, a girl from the \"wrong side of the tracks\" and her boyfriend - unexpectedly intersect during one fateful summer in the romantic drama \"Here on Earth.\" Kelley Morse (Chris Klein), who is cocky and brash, normally would never have crossed paths with the residents of a small town near his posh private school. But when he takes his shiny new Mercedes out for a drive, he locks horns with some of the locals, including Jasper (Josh Hartnett). As Jasper's willful girlfriend Samantha (Leelee Sobieski) looks on, Kelley and Jasper engage in a dangerous car race that turns disastrous, leaving a popular diner owned by Samantha's mother in ruins. Kelley and Jasper are sentenced to a creatively ironic but fitting punishment: They must help rebuild the diner. Not only does this ruin Kelley's summer plans, he also must board at the home of his rival, Jasper. Kelley begins to fulfill his \"sentence,\" but refuses to have anything to do with Jasper and his parents. When Kelley again encounters Samantha, the attraction is immediate and strong. First love blossoms in the Berkshire woods (\"a little bit of heaven, here on earth,\" Samantha calls the pastoral setting), angering Jasper, who has known Samantha practically his entire life. These new feelings and the romantic triangle that develops are only the beginning of a new journey for Kelley, Samantha and Jasper, as they ultimately make life-changing discoveries about themselves and each other.",
         "A rich college kid is taught a lesson after a joy ride ends up destroying a country restaurant."
      ],
      "budget": 15000000
   },
   "movielensId": 3453,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-03-23",
      "dvdReleaseDate": "2000-08-08",
      "directors": ["Mark Piznarski"],
      "runtime": 96,
      "movieId": 3453,
      "title": "Here on Earth",
      "mpaa": "PG-13",
      "actors": [
         "Leelee Sobieski",
         "Chris Klein",
         "Josh Hartnett",
         "Michael Rooker",
         "Annie Corley",
         "Bruce Greenwood",
         "Annette O'Toole",
         "Elaine Hendrix"
      ],
      "imdbMovieId": "0195778",
      "originalTitle": "Here on Earth",
      "genres": ["Romance"],
      "youtubeTrailerIds": [],
      "plotSummary": "A rich college kid is taught a lesson after a joy ride ends up destroying a country restaurant.",
      "tmdbMovieId": 13539,
      "avgRating": 2.6003,
      "releaseYear": "2000",
      "numRatings": 678,
      "posterPath": "/nE6cuxVJlOjq4Zxnu8FnGuBQIFO.jpg"
   }
}