{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0146516",
      "video": false,
      "title": "Buddy Boy",
      "recommendations": [26126],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Gloria",
               "gender": 1,
               "credit_id": "52fe4abac3a36847f81de637",
               "name": "Emmanuelle Seigner",
               "profile_path": "/3L0jsBpxn9VKa04PqtgD89FPrli.jpg",
               "id": 8925,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Sal",
               "gender": 1,
               "credit_id": "52fe4abac3a36847f81de63b",
               "name": "Susan Tyrrell",
               "profile_path": "/2cQnK1bJxp9PldCeA05kohavPs8.jpg",
               "id": 59369,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Francis",
               "gender": 2,
               "credit_id": "52fe4abac3a36847f81de63f",
               "name": "Aidan Gillen",
               "profile_path": "/w37z62Ex1kxqLTyI3SRySmiVsDB.jpg",
               "id": 49735,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Vic",
               "gender": 2,
               "credit_id": "572460e09251415c13001609",
               "name": "Mark Boone Junior",
               "profile_path": "/riibKDljUzdSfIZygymhKx9yNPx.jpg",
               "id": 534,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Doctor",
               "gender": 2,
               "credit_id": "5726698c9251411e9f0042b5",
               "name": "Darryl Henriques",
               "profile_path": "/7QMHooY9ewNQlE24WKAOdwW0evU.jpg",
               "id": 1379424,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4abac3a36847f81de62d",
               "name": "Mark Hanlon",
               "profile_path": null,
               "id": 58278,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4abac3a36847f81de633",
               "name": "Mark Hanlon",
               "profile_path": null,
               "id": 58278,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.213721,
      "production_countries": [],
      "id": 109479,
      "vote_count": 4,
      "budget": 0,
      "overview": "An introvert relieves the tedium of caring for his invalid mother by spying on his neighbor.",
      "similar": [],
      "original_title": "Buddy Boy",
      "runtime": 105,
      "poster_path": "/4C8dg1oORq8JPVEU6g90YfrfunE.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1999-09-05",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mark Hanlon"],
      "runtime": 105,
      "synopsis": null,
      "writers": ["Mark Hanlon"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0146516/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNjU4NTMwNTQ3Nl5BMl5BanBnXkFtZTcwOTQwNjAzMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Aidan Gillen, Emmanuelle Seigner, Susan Tyrrell | See full cast and crew »"],
      "reviews": [
         "For those who can make the necessary suspension of disbelief and contend with the depressingly dark ugliness of this drama, \"Buddy Boy\" will prove to be a captivating and disturbing look at the troubled life of a homely, introverted, socially inept, stammering young man who dutifully tends to a disabled, alcoholic, and abusive mother while window peeping at a beautiful neighbor. Somewhere between quirky and surreal, \"Buddy Boy\" is a compelling character study which waxes doggedly toward a somewhat anticlimactic conclusion. Not for everyone, this flick is most likely to be appreciated by those who are into quirky dramas for quirkinesses sake.",
         "A dark and disturbing film about Francis (Aiden Giillen), who lives a lonely introverted holy life with his bed-ridden stepmother Sal. But all is not what it seems, and the twisting plot of this story manages to make you feel very uneasy. Most of the time you find yourself on the edge of your seat trying to map out the film, but the unexpected twists and turns and the addition of odd and frightening sub plots make this film addictive from the first minute. This is a film that will stay with you for a long time after you have watched it. It is quite frankly terrifying and spooky at times, when Francis' neighbour, a strict self-proclaimed vegan, who he grows to love, is not all she seems when she is seen hacking away and eating raw meat, which is concerningly similar to a piece of human flesh. The film leads to an underlying and alarming suspicion of cannibalism, violence and murder. At the same time, freaky sub plots emerge and a startling shock appears when Francis' stepmother Sal becomes involved with a plumber, and after an incident emerges, Sal is not all she appears to be. The further involvement of another curious subplot about an abducted girl who Francis keeps seeing, adds even more suspense. The Plot thickens when you're left with the feeling that Francis may be imagining things, but is he? I loved this film and the ending is a brilliant and extremely scary, and leaves you wondering. I found myself asking everyone I knew if they had seen it just to hear their theory's about what was going on. Without a doubt a must see film.",
         "I really enjoyed the film. I loved the repetition of shots and the plot twists. At first the film looked like it was going to be somewhat normal but then it turned into a darker, more twisted view of human nature. I felt that I was guessing what was going to happen next and had theories in mind before the ending came. And what an ending it was! I have a feeling I'm going to have to watch it again at least once more before I can come up with any solid theory. I give it an 8-9 out of 10.",
         "This disturbing and hilarious film achieves a delicate balance of the macabre and the absurd. At times it approaches satire, but its ultimate dramatic intensity belies a more serious study of faith and alienation. The performances of Aidan Gillen, as Francis, the lonely introvert voyeur, and Susan Tyrrell, his abusive mother, are exceptional. The production design and cinematography together create a strange and haunting world. One particularly interesting element is the use of sound to convey the protagonist's changing psychological perspective. Overall, this film has the unusual characteristic of staying with you long after you've seen it. I would highly recommend it.",
         "A bumpy story, but this is a good thing. I found myself saying, \"What the....?\" several times. After a slow start, the plot adds new ingredients which steer us into the muddy waters of a man's wild delusions and his equally bizarre reality. The lines blur without warning and the film securely carries us out of the normal boundaries and trappings of life. Well acted and written while the directing lacked nothing. To see Emmanuelle Seigner again (Ninth Gate) was a pleasant surprise. I'd probably need to see this one again. I liked it. 7 of 10",
         "This film offers such a vivid depiction of mental illness that I found myself slightly disturbed after I had done watching it (I'm OK now, though!!) It will appeal to those who are fans of unsettling psychological horror that explores one person's mental state. Other films that I'm sure this one carries the influence of, include: \"The Driller Killer\", \"Psycho\", \"Bad Boy Bubby\"... I'm no psychiatrist, but it struck me how it might be possible to get so wrapped up in one person, that you begin projecting your issues onto them once they've let you down; because up until then they'd been the only reliable, stable figure in your life. Throw in religious crises, which have the ability to make you even more uncertain, and you've got the recipe for one seriously messed-up individual. There is imagery contained within to turn your stomach and make your head spin. Take a chance on \"Buddy Boy\" if you're in the mood for a walk on the wild side; I just hope you come back unscathed... !",
         "1st watched 4/5/2007 - 7 out of 10(Dir-Mark Hanlon): Disturbing and fascinating story of a recluse who does nothing except take care of his ailing step mother until he meets his next door neighbor who he happens to be peeping at thru a hole in his basement on a daily basis. The peeping continues despite the fact that she falls in love with him and they spend many evenings together. She openly confesses to being a vegan, but Francis(the recluse) starts seeing things thru his peep hole that makes him think otherwise. Francis's life has been mixed up for awhile. His real mom&dad are dead -- his step mom is crazy & crippled, he lives a mundane life where he goes to work on the same bus everyday and doesn't really interact with people and knows very little about women until his next door neighbor comes along and disrupts his simple boring life. There is also a religious aspect to his life that does nothing but confuse him and gives him somewhere to confess his sins, but does nothing to help him in real life. Despite this, everything is going along OK until his step mom accidentally kills his boyfriend and Francis suspects his neighbor is killing men in her apartment and having a little snacky-poo from the remains(which is technically not being a vegan). OK, now that I've said this much, I still hope you will see this well done independent movie. It's compelling, creepy and a nice study on human existence for a few mixed up people.",
         "Buddy Boy is an amazingly twisted and brilliantly written piece. Hanlon is obviously a man possessing exceptional skill and an enviable creative mind. The film requires that its audience possess the intelligence and acumen in order to appreciate its complicated, dark beauty. One can only hope that he continues to provide the movie-going community with such wonderfully challenging material.",
         "The stutterer Francis (Aidan Gillen) is a lonely religious man that works processing photos and lives with his abusive stepmother Sal (Susan Tyrrell) that is invalid in a gloomy apartment. Francis has a dreadful solitary life and he works, takes care of Sal and goes to the Catholic Church and his relief is his faith in God. Francis is also a voyeur and spends his nights watching a beautiful neighbor in another building through a hole on the wall from the back stairs of his building and masturbating later. One day, Francis stumbles with the woman that is being robbed by a thief on the street and he helps her. She introduces herself as Gloria (Emmanuelle Seigner) and invites him to have dinner with her. Gloria explains that she is vegan and soon they have a love affair and Francis loses his virginity with Gloria that loves him. But Francis becomes obsessed to watch Gloria and he believes that she has other men and is cannibal, eating the flesh of her lovers. The schizophrenic behavior of the delusional Francis makes him see weird things in Gloria's apartment. \"Buddy Boy\" is a bleak tale of schizophrenia, with a dark story of a religious man that becomes insane and delusional. The director and writer Mark Hanlon makes a weird independent movie following the style of David Lynch and makes a tribute to \"The Tenant\", \"Rear Window\" and \"Blue Velvet\". It is unbelievable that \"Buddy Boy\" is the only work of this promising director. Aidan Gillen, Susan Tyrrell, Emmanuelle Seigner and Mark Boone Junior have exceptional performances. Emmanuelle Seigner is still in the top of her beauty and is difficult to find a reasonable reason for her love for the weird Francis. The colors in this movie are very dark, especially in the dingy apartment where Francis and Sal live. My vote is seven. Title (Brazil): Not Available",
         "Dark and quirky film about a real introvert that stays home to take care of his mother. He's extremely lonely and frustrated by his life and spends his time spying on his attractive neighbor. Sounds like a creepy film and it is but Susan Tyrrell who plays his mother is just terrific. Her performance elevates this film from a throw away to a real curio! Tyrrell has made a career out of playing these incredibly offbeat roles and no one does it better. One of the frustrating things about the story is when Emmanuelle Seigner's character is somehow attracted to Aiden Gillen and he doesn't seem to appreciate it. Then his paranoia starts to take over and he thinks she's a cannibal. Film has one of those ambiguous endings and its up to each viewers taste as to how you'll react to this. But Tyrrell is a standout. Former child actress Linda Manz (Days of Heaven, The Wanderers) appears in the film as well."
      ],
      "genres": [
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Independent Pictures (II)",
         "Woods Entertainment"
      ],
      "summaries": [
         "The story of a pious introvert whose religious conviction begins to crumble under the weight of a cruel and strange existence, Buddy Boy is a study of faith, obsession, alienation and madness. The film's title character, Francis, lives with his invalid, abusive mother in a dingy tenement apartment, and has suffered a life of unrelenting misfortune and brutality. Over time, he has withdrawn from the world and into himself, silently observing others rather than interacting with them. His only solace has been his Catholicism, but he has begun to question his faith in a loving God who could countenance so much evil and pain. When he discovers he can see into the apartment of a beautiful, mysterious woman from his own back stairs, Francis cannot stop watching her, even after he meets her and they become romantically involved. Unable or unwilling to believe that she could actually love him, he becomes ever more obsessive in his voyeurism. And it is what Francis sees - or thinks he sees - that leads ultimately to his undoing.",
         "The stutterer Francis is a lonely religious man that works processing photos and lives with his abusive stepmother Sal that is invalid in a gloomy apartment. Francis has a dreadful solitary life and he works, takes care of Sal and goes to the Catholic Church and his relief is his faith in God. Francis is also a voyeur and spends his nights watching a beautiful neighbor in another building through a hole on the wall from the back stairs of his building and masturbating later. One day, Francis stumbles with the woman that is being robbed by a thief on the street and he helps her. She introduces herself as Gloria and invites him to have dinner with her. Gloria explains that she is vegan and soon they have a love affair and Francis loses his virginity with Gloria that loves him. But Francis becomes obsessed to watch Gloria and he believes that she has other men and is cannibal, eating the flesh of her lovers. The schizophrenic behavior of the delusional Francis makes him see weird things in Gloria's apartment.",
         "An introvert relieves the tedium of caring for his invalid mother by spying on his neighbor."
      ],
      "budget": 0
   },
   "movielensId": 3455,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-09-05",
      "dvdReleaseDate": "2005-09-27",
      "directors": ["Mark Hanlon"],
      "runtime": 105,
      "movieId": 3455,
      "title": "Buddy Boy",
      "mpaa": "R",
      "actors": [
         "Emmanuelle Seigner",
         "Susan Tyrrell",
         "Aidan Gillen",
         "Mark Boone Junior",
         "Darryl Henriques"
      ],
      "imdbMovieId": "0146516",
      "originalTitle": "Buddy Boy",
      "genres": [
         "Drama",
         "Thriller",
         "Romance"
      ],
      "youtubeTrailerIds": ["EfqEH_rzOsQ"],
      "plotSummary": "An introvert relieves the tedium of caring for his invalid mother by spying on his neighbor.",
      "tmdbMovieId": 109479,
      "avgRating": 2.96429,
      "releaseYear": "1999",
      "numRatings": 28,
      "posterPath": "/4C8dg1oORq8JPVEU6g90YfrfunE.jpg"
   }
}