{
   "tmdb": {
      "original_language": "fa",
      "keywords": [
         {
            "name": "paradise",
            "id": 439
         },
         {
            "name": "children",
            "id": 10103
         },
         {
            "name": "blindness",
            "id": 164092
         },
         {
            "name": "tehran",
            "id": 232122
         },
         {
            "name": "father son relationship",
            "id": 240119
         }
      ],
      "imdb_id": "tt0191043",
      "video": false,
      "title": "The Color of Paradise",
      "recommendations": [
         43774,
         21334,
         78128,
         46785,
         34530,
         34528,
         46799,
         13432,
         30020,
         54254,
         896,
         187864,
         104852,
         52104,
         128442,
         32622,
         43423,
         112698,
         31416,
         19035
      ],
      "backdrop_path": "/efORAFMNrERBfM0E7oR0bMpampG.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Vater",
               "gender": 0,
               "credit_id": "52fe47039251416c7508b125",
               "name": "Hossein Mahjoub",
               "profile_path": null,
               "id": 135901,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Mohammad",
               "gender": 0,
               "credit_id": "52fe47039251416c7508b129",
               "name": "Mohsen Ramezani",
               "profile_path": null,
               "id": 1209927,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Großmutter",
               "gender": 0,
               "credit_id": "52fe47039251416c7508b12d",
               "name": "Salameh Feyzi",
               "profile_path": null,
               "id": 1209928,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Mohammads große Schwester",
               "gender": 0,
               "credit_id": "52fe47039251416c7508b131",
               "name": "Farahnaz Safari",
               "profile_path": null,
               "id": 1209929,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Mohammads kleine Schwester",
               "gender": 0,
               "credit_id": "52fe47039251416c7508b135",
               "name": "Elham Sharifi",
               "profile_path": null,
               "id": 1209930,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Dorflehrer",
               "gender": 0,
               "credit_id": "52fe47039251416c7508b139",
               "name": "Behzad Rafi",
               "profile_path": null,
               "id": 1209931,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Lehrer",
               "gender": 0,
               "credit_id": "52fe47039251416c7508b13d",
               "name": "Mohamad Rahmani",
               "profile_path": null,
               "id": 1209932,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Tischler",
               "gender": 0,
               "credit_id": "52fe47039251416c7508b141",
               "name": "Morteza Fatemi",
               "profile_path": null,
               "id": 1209933,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47039251416c7508b121",
               "name": "Majid Majidi",
               "profile_path": "/jA4bYd176iXVUyWYKFpXN5d1eus.jpg",
               "id": 110695,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47039251416c7508b147",
               "name": "Majid Majidi",
               "profile_path": "/jA4bYd176iXVUyWYKFpXN5d1eus.jpg",
               "id": 110695,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 2.529641,
      "production_countries": [{
         "iso_3166_1": "IR",
         "name": "Iran"
      }],
      "id": 17078,
      "vote_count": 38,
      "budget": 0,
      "overview": "The story revolves around a blind boy named Mohammed who is released from his special school in Tehran for summer vacation. His father, shamed and burdened by Mohammed's blindness, arrives late to pick him up and then tries to convince the headmaster to keep Mohammed over the summer. The headmaster refuses, so Mohammed's father eventually takes him home.",
      "similar": [
         12159,
         9388,
         6947,
         20352,
         20766,
         46705,
         150540,
         601,
         60243,
         342473,
         394823,
         394117,
         5876,
         9355,
         15373,
         77949,
         298312,
         1407,
         11637,
         5123
      ],
      "original_title": "رنگ خدا",
      "runtime": 90,
      "poster_path": "/rQ1t23NAGJDv9oNfHEAsxhuiAOG.jpg",
      "spoken_languages": [
         {
            "name": "Azərbaycan",
            "iso_639_1": "az"
         },
         {
            "name": "فارسی",
            "iso_639_1": "fa"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Varahonar Company",
         "id": 37740,
         "origin_country": ""
      }],
      "release_date": "1999-02-08",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Iran",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Majid Majidi"],
      "runtime": 90,
      "synopsis": "Eight-year-old Mohammad stays at an institute for blind children in Tehran. At the end of term, his widowed father Hashem asks Mohammad's teachers to keep the boy over the holidays. They refuse and Hashem reluctantly takes Mohammad back to their village in northern Iran. There, the boy is reunited with his grandmother and his young sisters Hanyeh and Bahareh. Hashem starts courting a young woman; her family agrees a marriage date and Hashem works hard to pay for the gifts. Hashem takes Mohammad away to be apprenticed to a carpenter. Mohammad's grandmother argues with Hashem over his selfishness; when she dies, Hashem's prospective in-laws cancel the wedding, believing he brings bad luck. Hashem collects Mohammad from the carpenter's and takes him home through a wood. A bridge collapses under them and Mohammad is carried down river through rapids. Swimming after him, Hashem wakes on a shore and is grief-stricken on finding Mohammad apparently dead, but the boy's hand responds to a ray of sunlight [http://www.bfi.org.uk]",
      "writers": ["Majid Majidi"],
      "originalLanguage": "Persian",
      "imdbLink": "http://www.imdb.com/title/tt0191043/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgyMTcwOTc0Nl5BMl5BanBnXkFtZTcwNjAyNTEzMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Hossein Mahjoub, Mohsen Ramezani, Salameh Feyzi | See full cast and crew »"],
      "reviews": [
         "This is the first Iranin film I have ever watched and I have made it a project of mine to watch many more. This movie is so sweet and loving, but most of all it is honest. Unlike American films, Iranian films seem to be very open and even brutally honest about thier pain and frustration. Maybe it's because for many thier situations are so dire and we in America are so jaded by therapy and talk show catch phrases to just open op and fully express how we feel. The pain that Muhammed and his family felt came accross as very real and genuine. The art direction was beautiful, I had no idea that Iran was such a beautiful place. It was so ironic that the best part of his home was the part that poor Muhammed could not see but he felt it deeply. I would strongly suggest that you watch this movie. Even if your not into subtitles. My boyfriend and I came accross this movie at 2AM one night and had no intention of watching it, but after the first ten minutes we were hooked and talked about it for days. It is magnificent.",
         "I've personally viewed over three thousand films. For many years, \"Les Miserables\" (French) with Jean-Paul Belmondo was my highest recommendation. \"The Bridge\" (German) was equally haunting. But having discovered \"Color of Paradise\" (I watched it every night for five nights)I bought the DVD. I don't imagine that I will ever see a more emotionally invasive film. I've joined IMDb simply to enjoin others who loved this film. For some months, I've been trying to find the words to help organize my impressions. Where other senses may become more acute with the loss of one, perhaps the congenitally blind don't realize how emotionally transparent they are. For me, this film really struck a nerve. It is a story-journey into the world in which we live but don't often see. It left me wondering who, in this world, are actually blind? This child, his grandma and two little sisters, are consummate. I must remind myself they were only acting. I must picture set, sound, lighting, script, direction etc. to decern that this is \"only a movie\". For everything this little boy appeared to need, he found ways to give real treasures to everything around him. The sound and cinematography were excellent. The pointed themes of this film were were heart rending. Six months later, they remain so.",
         "I urge you to try to see this movie. The acting is brilliant but totally natural. I don't recall ever seeing a child who is as fine an actor as the boy who played Mohammed, and not for a moment did his \"acting\" ever get in the way of the story. The cinematography is breath-taking. I'm sure no one who has not been to Iran has any idea at all that it is this beautiful. There is plenty of symbolism for any particular point of view, which makes it fun to talk about after you see it, and although it is probably intended to be religious from the Islam point of view, you could probably find in this movie your own brand of spirituality, or lack of it, if you cared to try. I, a typically cynical and jaded New Yorker, and my completely enthusiastic and non-jaded adolescent daughter, both loved it and hope to see it again. So go see it and make it a success so we can get more movies like it over here!!",
         "This is one of the most, if not the most, moving film you may ever see. The story of Mohammed will break your heart. At many points in the film even the most restrained viewer will find themselves in tears. Mohammed's hope, determination and good nature will inspire you and teach you lessons about how you face your own life. The happier scenes in the film, such as when Mohammed is playing with his sisters or spending time with his beloved grandmother, will touch you. Prepare for the ending of this film, as it will move you to tears.",
         "Majid Majidi, director and writer of the much-acclaimed \"The Children of Heaven\" has again proven to the world that he is able to demonstrate weighty ideas through simple depictions of everyday life in Iran. He shows audiences that his country is not just a place where reform movements, revolutions, and embassy seizing take place; but also where beautiful films are made. His new motion picture; \"The Color of Paradise\" is a real treat. It is about faith and belief, unconditional love and compassion, hardship and hope; and is both powerful and effective. The lead character is a blind 8-year-old boy named Mohammad (Mohsen Ramezani). He is filled with compassion and has unlimited abilities to reach out to the world around him. Mohammad attends a school for the blind in Tehran. The school is closing for the summer and students are being sent home to their parents; most of them eagerly await their kids at the front gate just outside their dormitories. Hashem (Hossein Mahjub), Mohammad's father, is not eager to see him. In fact, he shows up so much later than everyone else that Mohammad had almost lost hope of ever seeing him again. While waiting for his dad, the 8-year-old boy, although filled with anguish, did not shut himself down from the outside world. He successfully rescues a baby bird, climbs a tree, and returns it to its nest. All despite his inability to see. Mohammad's dad finally shows up and requests that the school keep his son. Being told that this is not possible, he reluctantly takes the boy home. This is where writer director Majid Majidi's cinematic brilliancy comes into play. His ability to let the audience experience both the visually impaired and visually unimpaired worlds without ever abandoning one for the other is simply remarkable. We can see and feel both, the beauties of the boy's surroundings, and his own world where touching and hearing replace seeing. The photography is breathtaking as father and son trek home from the busy streets of Tehran into traders' and jewelry shops, then to the green mountains and fertile plains in the heights of northern Iran. Mohammad's arrival spurs bursts of joy from his Granny (Salime Feizi), the matriarch and surrogate mother since his mom passed away; and his two sisters (Elham Sharifi and Farahnaz Safari) with genuine angelic smiles. They are happy to see him, as they are ready to share an active farm life with him. Mohammad's admiration for nature is almost addictive; whether it's walking through fields of flowers, or running his hand over ripening grain, or having fresh water running through his fingers, or hearing birds' songs, a donkey braying or examining the sound of a gathering storm; he literally finds the patterns of Braille in everything around him. Sounds like a loveable kid? Not so, according to his dad's needs. For him, the blind son is a burden, which prevents him from moving on with his life, and marrying a younger woman. Hashem is not a malevolent man. He is an impoverished, fast-aging, widowed, spiritually blind, hard-working charcoal maker who sees very little hope with the status quo. So despite the staunch opposition of his mother, he is determined to send Mohammad off to a blind carpenter for woodworking apprenticeship. But is he ready to bear the consequences of acting against Granny and the universal laws that govern the relationship between a parent and his offspring? \"The Color of Paradise\" takes viewers on an incredible journey of faith and love and creates a masterpiece of emotion that is so beautiful in its simplicity and elegance it touches one's heart. It is done without forcing anything on the audience until the very last frame. This film does not preach. And it does not need to; its richness lies in its ability to portray basic elements of nature in their ordinary state. In places where Hollywood counterparts would have inserted blasting soundtracks, this movie simply lets nature echo in the background. Its soundtracks mostly consist of nature's own. In times of great suspense, the sound of nature (not human-made music) helps its audience through the changing moods. Couple these facts with almost flawless acting, it's hard to compare this film with anything else in its league. It is simply Iranian cinema at its best. Mohsen Ramezani, who plays Mohammad, is excellent. A scene, in which he breaks down in tears over his tribulations and questions God for making his dad not wanting him, is brutally heart wrenching. Mohammad eventually shows us that it is possible to feel God's hand even if one can't see the color of paradise.",
         "Mohammad is a young blind boy getting his education in Tehran's institute for the blind. With only a father and a grandmother left in his family, he looks forward to summer with them once school has finished. Mohammad is full of life even though he cannot see and is constantly exploring with his hands and his grandmother loves him for this. His father is a different story and wants Mohammad out of the way so that he can remarry in an arranged ceremony with a woman who doesn't know about his son. However his plan to send Mohammad far away on an apprenticeship brings him directly into conflict with his son's grandmother. A popular choice for the Oscars in 2000, this film has developed this success and has garnered quite an audience as a result. The story is quite an emotionally involving one that is better than the basic description of the narrative suggests because this is driven by our sympathy/empathy for the characters involved. As such it works pretty well as it is easy to relate to the emotions of all of the lead three characters \u0096 even the bitterness of the father was something that could be understood and felt for, at no point was he simply a bad guy for feeling what he did. At times the story gets a bit too steeped in meaningful sentiment but for the majority it is a well observed and patient story that is quite touching at points. The acting is a big factor in this working as well as it did. Ramezani is the most obvious one to praise and indeed he is praiseworthy for making his character real and convincing while never letting it become a \"cute kid part\" as so many brats can't help but do \u0096 he may have been drawing on things within himself but this is still a very real performance. Mahjoub is as good for the very reason that he keeps us caring about his character even if what he is feeling is not anything we can condone. Feizi's grandmother is an unremarkable character but she delivers it well with a solid, if unimaginative, portrayal and performance. The support cast are also strong but it was the lead three that made it what it was. The direction is good, sharing an eye for detail and little daily realities with a talent for the bigger landscapes. Overall this is an impressive and enjoyable film that is beautiful to look at and has plenty to engage the heart. It may be a bit \"up itself\" at a few points but these are few and far between and the majority of the film succeeds thanks to well written characters and actors who deliver with an apparent good understanding of their characters.",
         "This film received a rare standing ovation at the New York Film Festival. People were overwhelmed. It is called \"Color of Heaven\" and it focuses on a blind boy. The boy is loved by all in his family, but his father has had a tormented life filled with grief. He feels that caring for a blind boy will ruin his chances for a good second marriage, and for a family to care for him when he gets old. So, despite the attachment of others in his family to the boy, he tries to keep the boy permanently at a school of the blind, and then in a woodworking apprenticeship. The sensual vibrant color images in the film--almost surreally technicolor--illustrate the boy's sense of the world. You become fully sympathetic to the boy, cry with him, long to be loved with him. The camera is totally inside the boy's sensibility. It is a luxuriant and fully satisfying journey to an unknown place.",
         "Majid Majidi's COLOR OF PARADISE is the best kind of cinema. Simple in concept but executed with incredible skill and detail. We enter the world of a blind child in an incredibly intimate way, exploring his world of sound and touch and the isolation his blindness brings about. Almost ironically, we're also treated to some stunning images of lush scenery and locations. Absolutely mesmerising cinematography that even out-does the exceptional audiography. Characters and their lives are simple but very believable, and the performances from every one of the actors is spot on. The movie exhorts us to appreciate life more, and makes a good case for doing so. Highest recommendations!",
         "When I repeatedly passed this film at the local library, I completely ignored it because it looked rather dull and I must admit I had a prejudice against Iranian films. I incorrectly assumed that the movie would somehow be anti-Western or full of Islamic anger. Boy, I am VERY glad I was wrong. In addition to watching this film, I watched a prior film by the same marvelous director (Children of Heaven) and found them both to be absolute joys. PART of the reason I think I enjoyed the film so much could be the subject matter since it hits so close to home. The lead is a very lovable child named Muhammad who has been dumped into a school for blind children and his very selfish father wants to leave him there--even during the summer break. I have a deaf daughter and know of MANY kids in deaf residential programs with similar families, so it REALLY hit close to home. So, about the film. What did I like? Pretty much EVERYTHING--the writing, the wonderful acting by REAL people (like the Italian Neo-Realistic films of DeSica), the exquisite cinematography and the sense of growth and change within the characters WITHOUT being unrealistic or over-the-top. This film will almost certainly make you cry as there are some incredibly sad and heart-rending moments BUT bear with it--you will be amply rewarded if you watch it to the very end. A fantastic, marvelous and wonderful film from a reviewer who is usually a bit of a cynic and RARELY rates anything this high!",
         "This film is one of the few films that can really touch everyone -- from the beginning to the end this movie gripped me, and made me sympathize with the main character on large levels. And not only was the film complete in its' development of the main character but it seems that each and every character that appear in this film are incredibly human and can be related to. The story alone is touching, and with the great work done in the filming and great acting performances, this is one of the films that will really stay with me. As far as films go, this is a must see for anyone and everyone -- a film that unfolds a sad, human story as well as a great hope for the future all at the same time."
      ],
      "genres": [
         "Drama",
         "Family"
      ],
      "productionCompanies": ["Varahonar Company"],
      "summaries": [
         "Mohammad, a boy at Tehran's institute for the blind, waits for his dad to pick him up for summer vacation. While waiting, he realizes a baby bird has fallen from its nest: he chases away a cat, finds the bird, climbs a tree, and puts it back. His father finally comes and takes him to their village where his sisters and granny await. The lad is a loving student of nature and longs for village life with his family, but his father is ashamed of him, wanting to farm the boy out to clear the way for marriage to a woman who knows nothing of this son. Over granny's objections, dad apprentices Mohammad far from home to a blind carpenter. Can anything bring father and son together?",
         "Blind adolescent Mohammad Ramezani attends a boarding school for the blind in Tehran. He is a bright boy with a zest for life. With the school closing down for the summer break, Mohammad returns to his small village where his widowed father, Hashem, his two sisters, Bahareh and Hanieh, and his paternal grandmother live. Mohammad is overjoyed to be at home with his family, its female members who are as equally happy to have Mohammad back for the three month school break. Hashem, on the other hand, feels ill-equipped to deal with Mohammad. Behind Mohammad's back, Hashem treats Mohammad as an embarrassment to the family and if he is a burden. He has not even told his fiancée about Mohammad's existence. He does whatever he can to pass on the responsibility of Mohammad to others, such as the blind carpenter in the neighboring town under who he would like Mohammad to apprentice. This action is much to the chagrin of Mohammad's grandmother, who is not as worried for Mohammad as she is for her own son. She is concerned about the unconditional love which seems to be missing from his heart - love that Mohammad so craves and deserves."
      ],
      "budget": 0
   },
   "movielensId": 3456,
   "movielens": {
      "languages": [
         "Azərbaycan",
         "فارسی"
      ],
      "releaseDate": "1999-02-08",
      "dvdReleaseDate": "2000-09-19",
      "directors": ["Majid Majidi"],
      "runtime": 90,
      "movieId": 3456,
      "title": "The Color of Paradise",
      "mpaa": "PG",
      "actors": [
         "Hossein Mahjoub",
         "Mohsen Ramezani",
         "Salameh Feyzi",
         "Farahnaz Safari",
         "Elham Sharifi",
         "Behzad Rafi",
         "Mohamad Rahmani",
         "Morteza Fatemi"
      ],
      "imdbMovieId": "0191043",
      "originalTitle": "رنگ خدا",
      "genres": [
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": ["3_RvGYkUhEk"],
      "plotSummary": "The story revolves around a blind boy named Mohammed who is released from his special school in Tehran for summer vacation. His father, shamed and burdened by Mohammed's blindness, arrives late to pick him up and then tries to convince the headmaster to keep Mohammed over the summer. The headmaster refuses, so Mohammed's father eventually takes him home.",
      "tmdbMovieId": 17078,
      "avgRating": 3.88041,
      "releaseYear": "1999",
      "numRatings": 439,
      "posterPath": "/rQ1t23NAGJDv9oNfHEAsxhuiAOG.jpg"
   }
}