{
   "tmdb": {
      "original_language": "de",
      "keywords": [
         {
            "name": "spain",
            "id": 514
         },
         {
            "name": "adultery",
            "id": 596
         },
         {
            "name": "bullfight",
            "id": 734
         },
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "nudity",
            "id": 2483
         }
      ],
      "imdb_id": "tt0098251",
      "video": false,
      "title": "Blood and Sand",
      "recommendations": [],
      "backdrop_path": "/5sdv5qiUCYXdhgzbYPD0NNP80na.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Doña Sol",
               "gender": 1,
               "credit_id": "52fe491ac3a368484e11a39f",
               "name": "Sharon Stone",
               "profile_path": "/n28skoawvqAymYr6gRSm2pfro0i.jpg",
               "id": 4430,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Juan Gallardo",
               "gender": 2,
               "credit_id": "52fe491ac3a368484e11a387",
               "name": "Christopher Rydell",
               "profile_path": null,
               "id": 111702,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Carmen Espinosa",
               "gender": 1,
               "credit_id": "52fe491ac3a368484e11a38b",
               "name": "Ana Torrent",
               "profile_path": "/xIpRwiCl2xAp2R3i9jV10ZfW2kC.jpg",
               "id": 24976,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Garabato",
               "gender": 2,
               "credit_id": "52fe491ac3a368484e11a38f",
               "name": "Guillermo Montesinos",
               "profile_path": "/7iwsYhQ8EWJbwHDU2xaukGLIxJK.jpg",
               "id": 35351,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Nacional",
               "gender": 0,
               "credit_id": "52fe491ac3a368484e11a393",
               "name": "Albert Vidal",
               "profile_path": "/uoeXjMX3HITO4FMIhY62N5RJvlx.jpg",
               "id": 256326,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 0,
               "credit_id": "52fe491ac3a368484e11a397",
               "name": "Sim Andreu",
               "profile_path": null,
               "id": 586412,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 2,
               "credit_id": "52fe491ac3a368484e11a39b",
               "name": "Antonio Flores",
               "profile_path": null,
               "id": 262444,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Antonio (as Simon Andreu)",
               "gender": 2,
               "credit_id": "52fe491ac3a368484e11a3a3",
               "name": "Simón Andreu",
               "profile_path": "/yLP9SQRjSxwqfmfXVDftEpDmDgs.jpg",
               "id": 24496,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "53ca12af0e0a2647420014a6",
               "name": "Javier Elorrieta",
               "profile_path": null,
               "id": 225945,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "53ca12bf0e0a2647420014aa",
               "name": "Rafael Azcona",
               "profile_path": "/gYOUk2TKJxe48oaoToiLiN24x9V.jpg",
               "id": 37590,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "53ca12cf0e0a26474b0014ea",
               "name": "Vicente Blasco Ibáñez",
               "profile_path": null,
               "id": 130705,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "53ca12e20e0a264753001472",
               "name": "Ricardo Franco",
               "profile_path": null,
               "id": 972173,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "53ca12f10e0a26473c0013ec",
               "name": "Thomas A. Fucci",
               "profile_path": null,
               "id": 1343564,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.640582,
      "production_countries": [
         {
            "iso_3166_1": "ES",
            "name": "Spain"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 75892,
      "vote_count": 5,
      "budget": 0,
      "overview": "Remake of the tale of an acclaimed matador who finds himself involved with a beautiful woman, jeopardizing both his marriage and career.",
      "similar": [
         1259,
         36630,
         27066,
         2149,
         11826,
         11027,
         10822,
         8067,
         226,
         24420,
         1024,
         10995,
         17612,
         2275,
         22705,
         11801,
         1433,
         979,
         13,
         627
      ],
      "original_title": "Sangre y arena",
      "runtime": 113,
      "poster_path": "/hi7E8e13xxz31X08ZbfKNW8Fvsh.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [{
         "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
         "name": "20th Century Fox",
         "id": 25,
         "origin_country": "US"
      }],
      "release_date": "1989-09-22",
      "vote_average": 3.4,
      "belongs_to_collection": null,
      "tagline": "His courage brought them together. Her desire tore them apart.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Spain",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Javier Elorrieta"],
      "runtime": 113,
      "synopsis": null,
      "writers": [
         "Rafael Azcona",
         "Vicente Blasco Ibáñez"
      ],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt0098251/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMyMzE1MjE3N15BMl5BanBnXkFtZTcwNTUwODc0MQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Christopher Rydell, Sharon Stone, Ana Torrent | See full cast and crew »"],
      "reviews": [
         "In fact, this movie is a touching drama. I have watched it three times between 1993 and 2003 and still like it. Here, I would like to write about five elements: 1-The subject, a story of a cocky young man, who dreams of glory, fame, adventure and fortune...plus true friendship, love and family relations by parents and wife who remain faithful to the hero until the end...whereas the fans who applauded for the brave \"matador\" will forget him very fast. Its an interesting phenomenon...sometimes people run after those who will hurt them and ignore those real persons who care for them! Another idea is that people should remain humble, modest and satisfy themselves with what they have in life, like say, loving woman, warm family, a job, etc, if you seek for more and don't appreciate the existing \"things\" then you may lose everything! Another idea is people's mentality...so unstable in their relationships and they approach you when you are BIG, at your height, rich etc and DUMP you the moment you fail...that goes right for women as well...well SOME women. Also the symbol of vicious, destructive woman is represented well thanks to Sharon Stone's acting skills. The Spanish simple life, colorful scenes and cultural sites,religious atmosphere and family ties are reflected well in this movie. The music is good, touching and suitable to the subject and scenes. No 2 below is a sort of SPOILER>>>>>>>>>SPOILER 2-Christoper Riddle doesnot convince us sometimes in his acting...It was not so convincing to see him change so quickly and go after alcohol addiction...why? Was it necessary..or he was tormented between Carmen's love and Sol's alluring sex appeal...?? 3-Sharon Stone's acting, as usual..but particularly in such roles, gives a huge boost to the movie. She is the typical sexy woman, without values, having fun and recklessly playing with other's destiny with her unbeatable weapons...beauty, eyes and sexy presence. 4-Carmen is great also in her role as a faithful wife and supporting partner and a person who suffers silently for the sake of his man... Juan's mother is a success so is his step father, who is an opportunist and nagging old man...with not much to do in life. 5-This movie seems very realistic, it could happen to anyone in different environments and settings (not necessarily a matador)...its the usual struggle of man to have more, to have everything and on the way to achieve that he/she loses himself/herself... Some of the dialogue is preaching...courage, fame, etc...but nevertheless, there are some good quotes like Sol's definition of men, and Juan's definition of his struggle with bulls (others including women)...and also Sol's \"convincing\" and \"consoling\" words to Carmen about having back her man forever..they sound real. I gave the movie 6/10, and I give Sharon Stone 8/10, the panoramic views 9/10 and the music 10/10 You may watch it and say \"Ole'\" ...",
         "An interesting remake of the original Blood and Sand (1914) is given an erotic and soapy revamp in the remake. Its the story of a cocky young bull fighter, who on the way to the top forsakes his loving wife for a sexy siren (Sharon stone) who eventually is responsible for his downfall. Chris Rydell seems very wooden in the role of the bullfighter while Stone manages to pull off a convincing part. The bullfighting sequences are quite interesting although the film on a whole has a very soapy and glossy feel to it.",
         "This 1989 re-telling of the life of Juan Gallardo, famed Matador, is actually the closest thing you will get to the book that it was based on. Of the three movies, this one has the deepest understanding of Spain's culture, and what the art of bullfighting means to the people of this land. It's also an incredibly sexy movie, filled with passion, violence and betrayal. Chris Rydell is perfectly cast as the young bullfighter, determined to make a name for himself in the arena, while following his dream. Things go well for him until Sol comes into his life. Played with typical erotic flair, Sharon Stone is the beautiful woman who enters Juan's life, threatening his marriage, as well as his career, for no other reason than her own personal pleasure. It's a heartbreaking love story as well, as Juan and his innocent wife are such likable characters. for this production, the story is adjusted so that it takes place in modern times. Surprisingly, that decision takes nothing away from the power of this wonderful film. Featuring gorgeous cinematography and a beautiful, capable cast, as well as an intoxicating score, this one should please fans of the 1922 original, starring Rudolph Valentino. Also featured are some impressive and sometimes bloody footage of Matadors and bulls in the arena. Scenes that were surprisingly heavily censored for the Spanish language video release. I'm not sure why this film is virtually unknown in North America, as it deserves attention. Perhaps it is due to the subject matter of bullfighting,, which holds little interest to most of the population, and the sport offends many animal rights activists as well. Still, for those with open minds, looking for an old fashioned tragic romance, \"Blood and Sand\" is worth tracking down. But be aware; you might need a cold shower afterwards.",
         "This movie, (English title Blood and Sand,) might be good if you love bull fighting, but probably not. And for the rest of us it is a definite skip it. Every scene, and almost every line in the movie is predictable. I had hoped that at least with Sharon Stone in the movie we'd have something nice to look at, but most of the movie her hair is frazzled like she stuck her finger in a light socket and even she doesn't look that nice."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "José Frade Producciones Cinematográficas S.A.",
         "Twentieth Century Fox Film Corporation"
      ],
      "summaries": ["Juan is a young Spanish man whose dream is to become one of the famous toreros. When he was caught making an illegal (and in fact for the real torero life endangering) night bullfight with one of the destinated bulls for the corridas on the property of the Sols he meets the daughter of the American landowner Dona Sol, half Spanish, half American, and falls desperately in love with her. She brings him in contact with a famous torero and thus converts Juan into one of the famous, too. Still in love with Dona Sol, although married to the beautiful Carmen, Juan celebrates triumphes until Dona Sol lets him down. Drinking and being desperate only Carmen would stand by his side when he tries to come back in the corrida buisiness..."],
      "budget": 0
   },
   "movielensId": 3458,
   "movielens": {
      "languages": [
         "English",
         "Español"
      ],
      "releaseDate": "1989-09-22",
      "dvdReleaseDate": "2000-03-14",
      "directors": ["Javier Elorrieta"],
      "runtime": 113,
      "movieId": 3458,
      "title": "Blood and Sand",
      "mpaa": null,
      "actors": [
         "Sharon Stone",
         "Christopher Rydell",
         "Ana Torrent",
         "Guillermo Montesinos",
         "Albert Vidal",
         "Sim Andreu",
         "Antonio Flores",
         "Simón Andreu"
      ],
      "imdbMovieId": "0098251",
      "originalTitle": "Sangre y arena",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["0km5zKJhxXI"],
      "plotSummary": "Remake of the tale of an acclaimed matador who finds himself involved with a beautiful woman, jeopardizing both his marriage and career.",
      "tmdbMovieId": 75892,
      "avgRating": 2.65385,
      "releaseYear": "1989",
      "numRatings": 26,
      "posterPath": "/hi7E8e13xxz31X08ZbfKNW8Fvsh.jpg"
   }
}