{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "opium",
            "id": 1632
         },
         {
            "name": "literature",
            "id": 2132
         },
         {
            "name": "frankenstein",
            "id": 6737
         },
         {
            "name": "mystery",
            "id": 10092
         },
         {
            "name": "drugs",
            "id": 14964
         },
         {
            "name": "lord byron",
            "id": 223106
         }
      ],
      "imdb_id": "tt0091142",
      "video": false,
      "title": "Gothic",
      "recommendations": [
         67298,
         49299,
         3581,
         42368,
         36835,
         121111,
         29129,
         11347,
         70842,
         47866,
         40955,
         81931,
         34094,
         33310,
         382212,
         32045,
         95380,
         51371,
         18125,
         38996
      ],
      "backdrop_path": "/1fFjhxv8a0HrnPpbxVI9zCDAkFm.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Byron",
               "gender": 2,
               "credit_id": "52fe451f9251416c9102842d",
               "name": "Gabriel Byrne",
               "profile_path": "/lFIH4De52Eg21m7pScPMXezZDUh.jpg",
               "id": 5168,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Shelley",
               "gender": 2,
               "credit_id": "52fe451f9251416c91028431",
               "name": "Julian Sands",
               "profile_path": "/hDb4UlbeTvvVK53Cmh7W0Ijo41h.jpg",
               "id": 6104,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Mary Shelley",
               "gender": 1,
               "credit_id": "52fe451f9251416c91028435",
               "name": "Natasha Richardson",
               "profile_path": "/d3V17LUillMkNYIM7JHRqtz7jZK.jpg",
               "id": 20162,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Claire Clairmont",
               "gender": 1,
               "credit_id": "52fe451f9251416c91028439",
               "name": "Myriam Cyr",
               "profile_path": "/AfC3TRkDWjyespGiNqEJvRA5ya9.jpg",
               "id": 30611,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Dr. Polidori",
               "gender": 2,
               "credit_id": "52fe451f9251416c9102843d",
               "name": "Timothy Spall",
               "profile_path": "/yMClxMrLdOXk37RGvrqJEWjg9ko.jpg",
               "id": 9191,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Murray",
               "gender": 2,
               "credit_id": "52fe451f9251416c91028441",
               "name": "Alec Mango",
               "profile_path": "/zx45t5A5G6keaZGPUflV5Jeyhs3.jpg",
               "id": 94271,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Fletcher",
               "gender": 2,
               "credit_id": "52fe451f9251416c91028445",
               "name": "Andreas Wisniewski",
               "profile_path": "/uZwfBgn0GBfmfjbxA69GDXctN5W.jpg",
               "id": 10673,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Rushton",
               "gender": 2,
               "credit_id": "52fe451f9251416c91028449",
               "name": "Dexter Fletcher",
               "profile_path": "/did9anJiAFYvTbeQyNZaxts7GaT.jpg",
               "id": 974,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Justine",
               "gender": 1,
               "credit_id": "52fe451f9251416c9102844d",
               "name": "Pascal King",
               "profile_path": null,
               "id": 110835,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Tour Guide",
               "gender": 2,
               "credit_id": "52fe451f9251416c91028451",
               "name": "Tom Hickey",
               "profile_path": "/wmgEm09lbMS8ULcscHD7e9WJYhk.jpg",
               "id": 107729,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Turkish Mechanical Woman",
               "gender": 0,
               "credit_id": "52fe451f9251416c91028455",
               "name": "Linda Coggin",
               "profile_path": null,
               "id": 110836,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Mechanical Woman",
               "gender": 0,
               "credit_id": "52fe451f9251416c91028459",
               "name": "Kristine Landon-Smith",
               "profile_path": null,
               "id": 110837,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Man in Armour",
               "gender": 0,
               "credit_id": "52fe451f9251416c9102845d",
               "name": "Chris Chappell",
               "profile_path": null,
               "id": 110838,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Young William",
               "gender": 0,
               "credit_id": "52fe451f9251416c91028461",
               "name": "Mark Pickard",
               "profile_path": null,
               "id": 110840,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Fuseli Monster",
               "gender": 2,
               "credit_id": "52fe451f9251416c91028465",
               "name": "Kiran Shah",
               "profile_path": "/uVRnNqciNP8u9WYPEm0wwZKCM33.jpg",
               "id": 5531,
               "order": 14
            },
            {
               "cast_id": 18,
               "character": "Shelley Fan",
               "gender": 0,
               "credit_id": "52fe451f9251416c91028469",
               "name": "Christine Newby",
               "profile_path": null,
               "id": 110841,
               "order": 15
            },
            {
               "cast_id": 19,
               "character": "Shelley Fan",
               "gender": 0,
               "credit_id": "52fe451f9251416c9102846d",
               "name": "Kim Tillesly",
               "profile_path": null,
               "id": 110842,
               "order": 16
            },
            {
               "cast_id": 20,
               "character": "Tourist",
               "gender": 2,
               "credit_id": "52fe451f9251416c91028471",
               "name": "Ken Russell",
               "profile_path": "/8LcmAJ2STZUmN0cFriDFtXug9Pz.jpg",
               "id": 32327,
               "order": 17
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe451f9251416c91028423",
               "name": "Ken Russell",
               "profile_path": "/8LcmAJ2STZUmN0cFriDFtXug9Pz.jpg",
               "id": 32327,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe451f9251416c91028429",
               "name": "Stephen Volk",
               "profile_path": null,
               "id": 110833,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Horror",
            "id": 27
         }
      ],
      "popularity": 3.823164,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 33516,
      "vote_count": 48,
      "budget": 0,
      "overview": "The year is 1816. A sprawling villa in Switzerland is the setting for a stormy night of madness.  On this night of the \"Haunted Summer,\" five famous friends gather around an ancient skull to conjure up their darkest fears.  Poets Lord Byron and Percy Shelley, Shelley's fiancée Mary Godwin, Mary's stepsister Claire Clairemont and Byron's friend John Polidori spend a hallucinogenic evening confronting their fears in a frenzy of shocking lunacy.  Horrifying visions invade the castle - realizations of Byron's fear of leeches, Shelley's fear of premature burial, Mary's fear of birthing a stillborn child - all brought forth in a bizarre dreamscape.  They share the terrifying fantasies that chase them through the castle that night.  The events of that night later inspired Mary Shelley to write the classic \"Frankenstein\" and Dr. Polidori to pen \"The Vampyre,\" which became the basis for the creation of Dracula..",
      "similar": [
         627,
         10474,
         39939,
         8363,
         9352,
         624,
         228066,
         100,
         396940,
         179144,
         23949,
         12271,
         19384,
         20289,
         9777,
         11004,
         45272,
         17899,
         3034,
         507
      ],
      "original_title": "Gothic",
      "runtime": 84,
      "poster_path": "/lsivD3aJXU3cfuotO1I1JIvCsKm.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Virgin Vision",
         "id": 4878,
         "origin_country": ""
      }],
      "release_date": "1986-11-30",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "Conjure up your deepest, darkest fear... now call that fear to life.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ken Russell"],
      "runtime": 87,
      "synopsis": "Through her half-sister Claire Clairmont [Miriam Cyr], Mary Godwin [Natasha Richardson] and her future husband Percy Shelley [Julian Sands] came to know Lord Byron [Gabriel Byrne]. During the summer of 1816, Lord Byron invited them to stay for a while at his Villa Diodati in Switzerland. There they met Byron's physician friend Dr John Polidori [Timothy Spall]. On June 16th, while a storm raged outside, the five of them amused themselves by telling ghost stories and revealing private skeletons. From Mary's previous experience of miscarriage came the desire to raise her child from the dead which led to the creation of the Frankenstein monster. From Polidori's homosexuality, suicidal thoughts, and fascination with vampires came the story \"The Vampyre\".",
      "writers": [
         "Lord Byron",
         "Percy Bysshe Shelley"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0091142/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTczMDAyMjMzNl5BMl5BanBnXkFtZTcwNzUzODAyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Gabriel Byrne, Julian Sands, Natasha Richardson | See full cast and crew »"],
      "reviews": [
         "Despite it's uninspiring title, Ken Russell's \"Gothic\" is actually an intriguing, and uniquely inspiring piece of cinema. Mary Shelly's \"Frankenstein\" is one of the stories that has helped to shape horror cinema, and so the story behind it is guaranteed to interest horror fans. This film isn't exactly the story of how the story came to fruition; but rather a compilation of ideas surrounding \"what could have happened\" (but quite clearly didn't). The film takes influence from the enigmatic Lord Byron more than anything, and it's always him that springs to mind as we watch the small cast delve into their imaginations, culminating in an orgy of sex and violence. The story is simple, and focuses more on imagery and the ideas behind what is happening on screen. We follow Percy Shelly and his wife to be, Mary; along with her sister Claire, who travel to the self-exiled home of Lord Byron. While there, the four of them; along with Byron's biographer, decide to indulge in the art of making up ghost stories. However, the fun gets out of hand when the quintet begins to believe that they have actually created a monster. The film has a very 'intellectual' flavour, but the fact is that there isn't a lot below the surface of this film. Gothic, to me at least, is a visual treat rather than food for thought - with Ken Russell's imagery providing more than any deep and complex substance. The imagery is stunning, and fits into the film very well. Russell's sets compliment the story excellently, and the atmosphere in which the film takes place is more important than the story itself. Lord Byron's house is almost a character within itself, and when combined with the actual characters; Russell has provided horror fans with a very surreal film indeed. The cast is excellent. Films with a small cast rely more on their actors, and this film certainly doesn't fall down in that respect. Gabriel Byrne leads the cast, and does an excellent job of holding the film together. Julian Sands, Natasha Richardson, Myriam Cyr and Timothy Spall, who all portray their characters excellently, join him. On the whole; I can easily see why people dislike this film; as it's somewhat messy, and doesn't adhere to common horror standards - but if you like your horror different, this is highly recommended.",
         "As this film seemed to be the first film (that I could find anyway) to describe how Mary Shelley came up with the idea for Frankenstein (published in 1818), I must give some consideration. However, the pains the film goes through in depicting a drug-induced, nightmarish landscape of horrors, is too far gone. Laudenaum, a popular hallucinogenic drug during the 19th century, brings to life the imagination of five manic individuals: Lord Byron, his physician Dr. Polidori, Percy Shelley, Mary Shelley, and Claire Claremont (Mary's half sister). When Lord Byron challenges them all to come up with the most horrific tale they can muster, each cultivate his/her own macabre web of self-torture. This film, in an attempt to show the frantic workings of the mind, comes off as merely comical at times. Some of the scenes, which are intended to shock and convey horror, seemed to simply repel. Gabriel Byrne aptly plays the decadent Lord Byron, but his character is overly vicious and twisted. Julian Sands plays Percy Shelley, who is like a lunatic pedant at best. If you can figure out one thing he says, as he seems to spout \"non-sensical intelligence\" (if there is such a thing), then kudos to you. Natasha Richardson does well in playing Mary Shelley, although the described \"free love\" she was supposedly a participant in I think was a bit of a stretch in this movie and could have been left out. I must admit, for all the reviews I read of the film, I expected more of a punch and more of a meat-and-potatoes thriller story. This film did little but disorient using a sexually-hedonistic Rubix cube. Perhaps that was the director's intention, but the film did little in translating its horror and madness to its characters. Thomas Dolby's score just grates the disorientation further into the bone. I will give the director credit for doing his homework in researching the odd amount of death that seemed to riddle Mary Shelley's biography. The marriage of Frankenstein's creation to this aspect as being nothing ironic is quite clever. All in all, I just think a better job could have been done with a brilliant idea. And somebody please give Julian Sands a role where he is not a blithering crybaby! 4/10",
         "It must be said, I love the work of Ken Russell. If he were of any other nationality or generation he'd be subject to a veritable tome of critical analysis; with amazing films like Elgar (1962), The Debussy Film (1965), Women in Love (1969), The Devils (1971) and Savage Messiah (1972) all standing out as some of the most radical, imaginative and visually impressive feature films of the last fifty years. Too often his excesses got the better of him, as in films such as Lisztomania (1975), The Lair of the White Worm (1987) and Salome's Last Dance (1988), but despite the overall quality of those films, the results were always interesting and visually unforgettable. Gothic (1986) has much in common with the latter collection of works, being somewhat messy and decadent whilst still trying to remain somewhat conventional in its approach to character and narrative. It is this aspect of the film that is the weakest, with the story and the characterisation often feeling somewhat weak or unformed, particularly in the first half. However, once the film gets going - and the wild images and hallucinations begin to accumulate - Russell's energetic style and talent for creating outré and unforgettable visual compositions and ideas really begins to take off; creating a film that is fascinating and open to deeper interpretations regarding the character of Mary Shelley and the unfortunate circumstances of her life that may have led to the creation of her classic and iconic horror story, Frankenstein. Naturally, the roots of the film are based in fact, taking place in June of 1816 - the \"year without summer\" - when the five central characters met at Lord Byron's Villa Diodati by Lake Geneva. From here, the film creates a fictional back-story to the wet and windy night that would give birth, not only to Shelley's Frankenstein, but also Polidori's celebrated novel, The Vampyre. What follows is a bizarre and overwhelming example of pure visual storytelling, which is all the more impressive when you take into account the obviously limited budget. However, if you can overcome this aspect - as well as the rather poor performances from Julian Sands as the exaggerated Percy Shelley and Myriam Cyr as Mary's half-sister Claire Clairmont - then the film will reward with a truly astounding final act filled with Russell's typically surreal and lurid imagery, an escalating sense of fever-dream-like horror and exaggeration and the three fine performances from Gabriel Byrne as the seductive Lord Byron, Natasha Richardson as the tortured Mary Shelly and Timothy Spall as the beleaguered Dr. John William Polidori. The tension is also heightened by the choice of location, with the film taking place almost entirely within the Byron estate, and almost entirely at night; although there are two separate framing devises, one of which takes place in the present-day and helps clarify some of the scenarios depicted in the film's aforementioned final act. These don't necessarily add much to the story - though neither do they detract - simply giving a certain sense of context before Russell gets on with the mind-blowing imagery and finely tuned atmosphere of eroticised dread. Some have likened the film to Dario Argento's classic supernatural thriller Suspiria (1977), with the use of Gothic locations, bold colours and a self-consciously visual approach to storytelling. These similarities stand, though you can also see the film as an extension of the earlier Altered States (1980) and Crimes of Passion (1984); both in certain thematic preoccupations, and in the actual visual presentation overall. The film works simply because of the intensity of the images, but ultimately going deeper than even that; tying the whole thing into the character of Mary Shelley and her own sense of personal tragedy. It gives the film that much needed emotional quality, helped along by the fine performance from the incredibly young Richardson in one of her first leading roles. She's complimented well by Byrne, who takes the role of Byron entirely seriously, even when spouting some incredibly pretentious dialog and attempting to seduce every character in the film. Nonetheless, the intensity of the role shines through and really establishes the character, with his fears and weaknesses going towards the creation of his own personal nightmare that will reverberate through time. The film suggests that by raising the spirits of the dead you fate yourself to an inescapable evil. This is reflected by the tragic circumstances that surrounded the characters - hinted at in that tour-de-force final - and their eventual fate as documented by history itself. It's very clever once you get past the awkward, slightly giddy and anachronistic-like feeling of the first few scenes and really get into the horror aspect and the more much rewarding sense of human interest. Naturally, it won't be to all tastes, as the factors that Russell tends to highlight in his work - religious symbolism, garishness, sex and sensuality, brutality and anachronistic humour - will obviously cause problems for viewers looking for a more conventional \"horror\" story. I liked the break in convention, though. After all, there are plenty of horror films that regurgitate the same old stock tactics and scenarios. Gothic goes for a different approach; one that is more eccentric, single-minded and unique, layering the fact and fantasy elements of Stephen Volk's imaginative screenplay with a lurid and sensational approach to the visual telling of the story, rife with his usual themes and obsessions. If you love Russell's work, and appreciate interesting and unconventional cinema, then Gothic is well worth checking out; if not for the bizarre visual aspects and exciting, nightmarish final, then certainly for the nicely judged performances of Richardson, Byrne and Spall.",
         "I've only seen two of Ken Russell's films (Gothic and Lair of the White Worm), but if they are anything to go by, he is one of the best horror directors of all time. It is so nice to see someone going against the mould and not making predictable slasher films or Hollywood 'Sixth-Sense' style horror-thrillers. It is about the weird night that Mary Shelly and her poet brother spent with Lord Byron, which supposedly inspired her to write Frankenstein. It is filled with hallucionations and erotic weirdness which bridges it much closer to the work of David Lynch or Cronenberg than to the traditional horror film. I absolutely loved this film and can't recommend it enough. Even if you hate it, you can't deny that it's an experience! 5/5",
         "I guess if you were Ken Russell in 1986, riding a crest of weirdity, you can do just about anything you want. I think that Russell was the first really wacko film director I got to know. I hadn't watched anything of his for a long time. This is one of those things that allows this director to take complete license. You have true historical figures who come together in the house of Lord Byron, a really colorful character. The lives of these people come out of boredom. They are misunderstood and a bit spoiled. So, according to Russell, they sit down one night and begin to tell their best horror story. This leads to a series of debauches, hallucinations, whatever. It is filled with images and sex and masochism and anything that the director could throw in there. Now, because you are producing in an accepting time, you can get away with all that. I guess I would watch this again, knowing what the whole of the thing presents, but when you play by no rules other than to do what you want, the results are like throwing paint on a canvass. We get a lot of paint, a lot of color, but no motif. So, while I thought this was a real head trip, I'm not so sure there is much coherence or even meaning to it.",
         "Films like Gothic, directed by Ken Russell, will not be to most people's taste. Russell is noted for a skewed view of life with very twisted imagery, such as his invariable trademark snake that slithers around in all his films. In this particular film he has devised a story that touches on reality in an unreal way as he brings the famous night that Percy Shelly, Mary Shelly, he half-sister Claire, Lord Byron and Dr. John Polidori spent together that brought about two of the great horror stories of all time about as a result. Between debauchery and Opium laced nightmares this could have been very much what it was really like as this quintet of famous or rather infamous people got together and brought the birth of a new kind of literature, years before Edgar Allen Poe began his writing. Polidori's \"The Vampyre\" which for many years was attributed to Byron was the forerunner and inspiration for Bram Stoker's Dracula. Of course, Mary Shelly was to go on and write \"Frankenstein.\" This is how it could have happened. This feature is intense and not for everyone. Definitely not for young people. But a true intellectual's horror tale.",
         "This is the type of film which makes you fall in love with movies. Ken Russell is a master filmmaker and one which always captivates, delights and challenges the viewer. I was lucky enough to catch him in Philadelphia in the 90's where he was given a filmmaker award for excellence in film. He's as interesting, humorous and intelligent as his movies. Other films by him I highly recommend WOmen in Love (1969), Lisztomania (1975), Altered States (1980), Salomé's Last Dance (1988), The Lair of the White Worm (1988), The Rainbow (1989) and there are probably many others - including his work for British TV - but I've yet to see them yet unfortunately. Gothic is a film which will enthrall, engage and frighten the viewer with excellent acting from ALL the actors - support and lead. Sad that this was Richardson's first major film and we have been denied the grace of viewing any future projects from such a wonderful actor. I highly recommend Gothic to any serious film goer. This is the type of film which will make wish to research further information about the main characters. Mary Shelley is brought to flesh through Russell's excellent direction and Richardson's beautifully nuanced intelligent interpretation.",
         "GOTHIC is a seductive and fascinating study of the four principle players in the turn-of-the-century origin of at least one, if not two, of the principle monster icons of popular culture: the vampire and the Frankenstein Monster. But despite the incredible (and true) historical significance of the writing challenge, to produce a ghost story apiece worthy of these literary personages, Mary and Percy Shelley, Lord Byron and Polidori, the film is brilliant in its fictional depiction of people whose minds are brilliant enough, creatively, that their ideas become tangible forces, released, and uncontrollable. The chaotic structure of GOTHIC is excellent, while the interplay between the actors is fabulous. GOTHIC's intellectual hysteria creates an atmosphere where ghosts and demons gain power and autonomous life from their creators, showing the formulation in Mary Shelley's mind of the Frankenstein story, and the tragic consequence of both the story and the real lives of Percy Shelley, Byron and Polidori. Well worth experiencing.",
         "...which undoubtedly explains my lack of appreciation, understanding, or any positive feeling I might muster against this extraordinary piece of rubbish. I love Mary Shelley's Frankenstein, the Frankenstein films(for the most part), and history but this film has virtually nothing to do with any of that. It looks like some guy on a big acid trip got a camera and some far-out crew and made this film coaxing some over-the-top performances from what normally would be a great cast. Yes, many will say I lost the point. I didn't get what director Ken Russell was trying to do. His vision is lost on me(thankfully I might add). The best part of this film is the beginning prologue and end epilogue of a tourist group in Switzerland seeing the place where Frankenstein was born. Pity, we had to endure the bit in the middle. The film lacks cohesion so to give you the story would virtually be impossible but here goes: five people(Lord Byron, Percy Shelley, Mary Shelley, some other girl, and Dr. Polidori)are vacationing in the Alps and taking part in all kinds of perversions that would make the Marquis de Sade quite happy. You might have been taught in school that they had a contest and each set out to write a ghost story. Here there is little screen time devoted to that. What we do get is intellectually pompous drivel devoid of any real substance - substantiative or artistic. The cast drives around like mad with Julian Sands parading naked on a roof top and looking more like an inmate of One Flew Over the Cuckoo's Nest rather than a great 19th century Romantic poet. Gabriel Byrne is sadistic as the great Byron. Timothy Spall is mad and disgusting as Polidori. Only Natasha Richardson give a somewhat subtle performance - if you can call it that for it lacks any direction at all. Ken Russell has always been intriguing as a director and if you are looking for something off the beaten track - this road is spotless and free of conventional transportation. Sometime; however, I would rather take the road more traveled.",
         "I didn't quite understand this film the first time I saw it. It was like a mass of confusion, but after watching it a few more times, I understand why it seemed as such. It can be difficult to tell what's real and what's just a hallucination (or a ghost). Gothic is definitely a thinking person's horror film. These people (Mary Shelley, Lord Byron, etc) were definately ahead of their time and very strange for lack of a better word. I was never a big fan of the story of Frankenstein, despite being a horror movie fan, but this film reeled me in to wanting to know more about Mary Shelley and the bizarre lifestyle of her and her friends. How true to their actual lifestyle this film actually is, I'm not sure, but it makes Mary Shelley's masterpiece make more sense. As for the film \"Gothic\" itself, words are hard to describe it as it is hard to understand it. But once one does get it, it is far more intriguing than \"Frankenstein\" in my opinion. With the insanity, freaky images, and the insight into the lives of these famous literary people, I would highly recommend this film to intelligent people who like horror films. It may be far from the best film ever made, but it is excellent for people with a mind. And as I tell people who haven't seen it, 'this movie will make you never want to do drugs again'!"
      ],
      "genres": ["Horror"],
      "productionCompanies": ["Virgin Vision"],
      "summaries": ["Story of the night that Mary Shelley gave birth to the horror classic \"Frankenstein.\" Disturbed drug induced games are played and ghost stories are told one rainy night at the mad Lord Byron's country estate. Personal horrors are revealed and the madness of the evening runs from sexual fantasy to fiercest nightmare. Mary finds herself drawn into the sick world of her lover Shelley and cousin Claire as Byron leads them all down the dark paths of their souls."],
      "budget": 0
   },
   "movielensId": 3459,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1986-11-30",
      "dvdReleaseDate": "2000-03-14",
      "directors": ["Ken Russell"],
      "runtime": 84,
      "movieId": 3459,
      "title": "Gothic",
      "mpaa": "R",
      "actors": [
         "Gabriel Byrne",
         "Julian Sands",
         "Natasha Richardson",
         "Myriam Cyr",
         "Timothy Spall",
         "Alec Mango",
         "Andreas Wisniewski",
         "Dexter Fletcher",
         "Pascal King",
         "Tom Hickey",
         "Linda Coggin",
         "Kristine Landon-Smith",
         "Chris Chappell",
         "Mark Pickard",
         "Kiran Shah",
         "Christine Newby",
         "Kim Tillesly",
         "Ken Russell"
      ],
      "imdbMovieId": "0091142",
      "originalTitle": "Gothic",
      "genres": [
         "Drama",
         "Fantasy",
         "Horror"
      ],
      "youtubeTrailerIds": ["haS7s4MI0mI"],
      "plotSummary": "The year is 1816. A sprawling villa in Switzerland is the setting for a stormy night of madness.  On this night of the \"Haunted Summer,\" five famous friends gather around an ancient skull to conjure up their darkest fears.  Poets Lord Byron and Percy Shelley, Shelley's fiancée Mary Godwin, Mary's stepsister Claire Clairemont and Byron's friend John Polidori spend a hallucinogenic evening confronting their fears in a frenzy of shocking lunacy.  Horrifying visions invade the castle - realizations of Byron's fear of leeches, Shelley's fear of premature burial, Mary's fear of birthing a stillborn child - all brought forth in a bizarre dreamscape.  They share the terrifying fantasies that chase them through the castle that night.  The events of that night later inspired Mary Shelley to write the classic \"Frankenstein\" and Dr. Polidori to pen \"The Vampyre,\" which became the basis for the creation of Dracula..",
      "tmdbMovieId": 33516,
      "avgRating": 2.73792,
      "releaseYear": "1986",
      "numRatings": 414,
      "posterPath": "/lsivD3aJXU3cfuotO1I1JIvCsKm.jpg"
   }
}