{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "hillbilly",
         "id": 14559
      }],
      "imdb_id": "tt0061765",
      "video": false,
      "title": "Hillbillys in a Haunted House",
      "recommendations": [
         109122,
         5926,
         28676,
         29419,
         31119,
         31244,
         86726,
         62855,
         52745,
         31116,
         89662,
         43120,
         31380,
         31265,
         47003,
         7237,
         37626,
         43715,
         29071,
         32652
      ],
      "backdrop_path": "/yv2xL7i89r49T5sSAGmkxho97YZ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Woody Wetherby",
               "gender": 0,
               "credit_id": "52fe4a249251416c750df2d5",
               "name": "Ferlin Husky",
               "profile_path": null,
               "id": 1019845,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Boots Malone",
               "gender": 1,
               "credit_id": "52fe4a249251416c750df2d9",
               "name": "Joi Lansing",
               "profile_path": "/zNFC2Z2S2CbpUH17em1W38Luy2k.jpg",
               "id": 55997,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Jeepers",
               "gender": 0,
               "credit_id": "52fe4a259251416c750df2dd",
               "name": "Don Bowman",
               "profile_path": null,
               "id": 1019846,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Dr. Himmel",
               "gender": 2,
               "credit_id": "52fe4a259251416c750df2e1",
               "name": "John Carradine",
               "profile_path": "/iv9pZ2JRddIUNe2RgYAKmUR55WO.jpg",
               "id": 8516,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Maximillian",
               "gender": 2,
               "credit_id": "52fe4a259251416c750df2e5",
               "name": "Lon Chaney Jr.",
               "profile_path": "/cnuHF4xkziyAsS7IOCfpWbgdycu.jpg",
               "id": 4072,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Madame Wong",
               "gender": 1,
               "credit_id": "52fe4a259251416c750df2e9",
               "name": "Linda Ho",
               "profile_path": null,
               "id": 101592,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Gregor",
               "gender": 2,
               "credit_id": "52fe4a259251416c750df2ed",
               "name": "Basil Rathbone",
               "profile_path": "/grjsDNr7wt6E57Bf2GDg0yaBsRo.jpg",
               "id": 8727,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Herself",
               "gender": 0,
               "credit_id": "52fe4a259251416c750df2f1",
               "name": "Molly Bee",
               "profile_path": "/aQpviuReQo4fP3YnPrjD31P4wxd.jpg",
               "id": 1019847,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4a259251416c750df2f5",
               "name": "Merle Haggard",
               "profile_path": "/tHpnYBGtB7vKbGhAfY4RAwvzNiO.jpg",
               "id": 201417,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4a259251416c750df2f9",
               "name": "Sonny James",
               "profile_path": null,
               "id": 214900,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4a259251416c750df2fd",
               "name": "Jim Kent",
               "profile_path": null,
               "id": 1019851,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Herself",
               "gender": 0,
               "credit_id": "52fe4a259251416c750df301",
               "name": "Marcella Wright",
               "profile_path": null,
               "id": 1019852,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4a249251416c750df2ad",
               "name": "Jean Yarbrough",
               "profile_path": "/mggQ51vYqvl78YRdb7DZYRvRpec.jpg",
               "id": 89745,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a249251416c750df2b3",
               "name": "Duke Yelton",
               "profile_path": null,
               "id": 1019840,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a249251416c750df2b9",
               "name": "Duke Yelton",
               "profile_path": null,
               "id": 1019841,
               "department": "Writing",
               "job": "Screenstory"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a249251416c750df2bf",
               "name": "Bernard Woolner",
               "profile_path": null,
               "id": 1019842,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a249251416c750df2c5",
               "name": "Hal Borne",
               "profile_path": null,
               "id": 1019843,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a249251416c750df2cb",
               "name": "Vaughn Wilkins",
               "profile_path": null,
               "id": 1019844,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a249251416c750df2d1",
               "name": "Holbrook N. Todd",
               "profile_path": null,
               "id": 52182,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 1.26695,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 99008,
      "vote_count": 11,
      "budget": 0,
      "overview": "Country singers on their way to Nashville have car trouble, forcing them to stop at an old haunted mansion. Soon they realize that the house is not only haunted, but is also the headquarters of a ring of international spies after a top secret formula for rocket fuel.",
      "similar": [
         75564,
         29861,
         43753,
         13523,
         6519,
         46838,
         11879,
         2163,
         10246,
         10669,
         16442,
         11041,
         6396,
         23626,
         30062,
         412762,
         20016,
         25693,
         25473,
         484237
      ],
      "original_title": "Hillbillys in a Haunted House",
      "runtime": 86,
      "poster_path": "/2ZqP8xJLOBNzjRIsNCpYldUPSJb.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Woolner Brothers Pictures Inc.",
         "id": 9233,
         "origin_country": ""
      }],
      "release_date": "1967-05-01",
      "vote_average": 1.5,
      "belongs_to_collection": null,
      "tagline": "They'll scare your pants off!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jean Yarbrough"],
      "runtime": 86,
      "synopsis": null,
      "writers": [
         "Duke Yelton",
         "Duke Yelton"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0061765/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAyMzU1OTExOF5BMl5BanBnXkFtZTcwMjY3MDEzMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Ferlin Husky, Joi Lansing, Don Bowman | See full cast and crew »"],
      "reviews": [
         "It is easy to dismiss this movie as something that belongs on the bottom half of a double bill or late night television; but I happen to enjoy it. Lon Chaney, John Carradine and Basil Rathbone together again for the first time since THE BLACK SLEEP (1956) and on far more equal terms than they were in the earlier film. Okay so they leave no cliche untouched, from the Oriental \"Dragon Lady\" top spy to the gorilla in a cage but there are good moments in the film too. Just watch the scene where Lon Chaney takes the secret plans away from the traitorous government worker. Lon waits for just a heartbeat before turning back into the room, pulling his gun and declaring \"If you'd betray your country you'd also betray us.\" and shoots the man dead. A great dramatic moment and not what you would expect from a musical comedy. Unfortunately the movie is very patronising of Southerners. Woody and Jeepers are your basic \"scared of everything\" backwoods boys. Boots (Joi Lansing) does not have a Southern drawl and at one point declares \"Well I for one do not believe in ghosts.\" making her the most level headed one in the group. As for the music, there is plenty. All Boots has to do is say \"Hey Woody, sing a song.\" for the plot to stop dead in its tracks so Ferlin Husky can warble another country tune. My biggest argument is that the movie goes on for another 20 minutes AFTER it should end! After the bad guys have been rounded up and the spies are in custody we get one whole REEL of country western singers performing their specialties at what is supposed to be a big Nashville Jamboree but looks like a high school auditorium. Granted this is probably the only chance many viewers will get to see old time singers like Molly Bee and Marcella Wright so just relax and enjoy the music.",
         "It is a sad sight indeed watching three veteran stars of the silver screen, and in particular the horror genre, be reduced to nothing more than scenery in an otherwise drab, dreary, dull film about a trio of country western singers holed up in a haunted house for the night. Ferlin Husky and Joi Lansing(as Boots Malone) and Don Hall inadvertantly stumble upon a haunted house being used by agents against an organization(MOTHER). When they are not running from being scared, each one 'entertains' us with a good ole country classic. All in all I counted no fewer than 14...yes count 'em....14 songs sung by the trio, a band of passers-by that just happen to sing as a group, two people on television sing for the Country Western Hour, and at the end of the film, when the story about the agents and the house has all been cleared up...at least six songs that go one after the other and the picture abruptly ends. This is not a horror picture. It is not even a picture with a real story. It is just an excuse to showcase what little talent the singers have. Now to be fair, Merle Haggard does a couple numbers, and a few of the songs aren't too terrible. But why make a movie like this....why star three of the genre greats and then give them little to do? Basil Rathbone certainly deserved better than this for his last(or next to last film). He is good in his small role and his scenes with John Carradine are fun to watch as they wade through the atrocious dialogue given to them. And what about poor Lon? It looks like he just woke up from a weekend bender. Again a shame for such a good actor! Despite these many...many shortcomings(and as I stated earlier there were at least 14)...Hillbillys in a Haunted House should be required viewing for serious genre fans just to have a few good real hearty laughs and to see those great men..even though not at their best...one last time. Other than that, the only other saving grace is easily Ms. Lansing and her stiffening blouse...a real treat for the eyes!",
         "Frankenstein met the Wolfman, and they both met Abbott and Costello, so why shouldn't country music greats Ferlin Husky and Merle Haggard meet Basil Rathbone and Lon Chaney, Jr? No reason a'tall. I was hoping for a real hoedown here, even though I'm not sure what a hoedown is. Well, actually, a hoedown seems to be a \"square dance.\" At least that's what the Merriam Webster link on my toolbar came up with, in which case a hoedown isn't what I was hoping for, after all. A Ferlin Husky-Lon Chaney, Jr. duet on a country classic, perhaps \"Your Cheatin' Heart,\" or something else from the pen of Hank Williams, would have been nice, but, alas, it was not to be. As a result, \"Hillbillies in a Haunted House\" fails to live up to its considerable potential. I suppose that for Basil Rathbone, who would die in the year of this film's release, appearing in this movie is no worse than doing an infomercial for a Helsinki baldness cure, which is what aged, down on their luck actors seem to do these days, although it would have been nice to see the screen's greatest Sherlock Holmes go out with more style than is evident here.",
         "I visited Nashville in 1998 and paid my respects to the great and the good of country music by spending an afternoon in the hallowed precincts of the Country Music Hall of Fame ,where one exhibit was devoted to the movies featuring the great names of the genre . I was left reflecting that by and large the movie industry has not been kind to country music and that most of the movies given exhibition space were low budget productions from poverty stricken regional studios ,rather than the big Hollywood companies . This lame brain picture exemplifies the kind of no brain movies they turned out and the patronising stance of such studios to their audience and the music it contained ,being a parade of stereotypes which pokes fun at country people and their music of choice Ferlin Husky plays a country singer who is stranded for a night in the eponymous house alongside his \" girl singer \" and business manager .It is a suitably creepy place -festooned with cobwebs and adorned with secret passages .It also happens to be the base for a spy network headed by a mysterious Oriental lady and her henchmen -slumming horror greats lon Chaney ,John Carradine and the wonderful Basil Rathbone .Not to mention a gorilla ! Do the musical trio triumph over their adversaries and make it to the big Nashville show ? Well , if you like country music and admire the work of the veteran actors I name checked earlier its just about worth watching to find out . By any objective standards this is dreadful but at least Rathbone and Carradine are worth watching although somewhat the worse for wear physically.However it is the presence of country music great Merle Haggard doing two numbers and the involvement of lesser but talented artists like Sonny James and Molly Bee that are mainly instrumental in sustaining interest The last 20 minutes are devoted to a concert that has nothing to do with the plot and is unimaginatively staged and shot but whose peformances are historically fascinating and help make me like the movie more than it really deserves . Now will someone in the movie industry treat this great music -The true national music of America -with the respect due to it ?",
         "HILLBILLYS IN A HAUNTED HOUSE (1967) * (D: Jean Yarbrough) A terrible film, badly directed by Yarbrough. His last film, and possibly Basil Rathbone's too (or perhaps AUTOPSY OF A GHOST). Lon Chaney Jr. and John Carradine can't help matters either - all three are wasted. They should have been put to better use even taking into account the low budget. Rathbone in particular appears disinterested (and who can blame him?) Just barely tolerable to see the three actors, but for completists only. Many awful tunes.",
         "I love exploitation flicks, but this is the bottom of the barrel. This sequel to LAS VEGAS HILLBILLYS is trash of a new kind. No MUNSTERS or BEVERLY HILLBILLIES episode was ever this lame. Ferlin Husky is terrible and the guy who plays Jeepers is a complete idiot. Joi Lansing, although pretty with a great body, is a poor replacement for Mamie Van Doren in the first film, as Boots Malone. I gave this a 2 instead of a 1 because of the title and John Carradine maintains his dignity (somehow). Basil Rathbone looks uncomfortable. Lon Chaney, Jr. looks to be in pain. Linda Ho is boring. Terrible music and creepy color. Best performance = Anatole the gorilla. LAS VEGAS HILLBILLYS was bad enough to be fun..but this one - sorry folks.",
         "For what it was, \"Hillbillies\" wasn't really all that bad. By this I mean that it isn't stultifyingly awful or technically incompetent like most of Jesse Franco's output. It isn't stupid and disgusting like Ted V. Mikels' films. Yes, it's pretty silly and the plot doesn't make a whole lot of sense - think \"Hitchcock filtered through 'God's Little Acre' and about 2 quarts of moonshine\". But it has a couple of real actors in it, and some genuine musical talent that distracts from the skimpy plot, and a person who wasn't feeling especially discriminating could conceivably enjoy it if he or she had a few drinks. But what distinguishes this movie as a cinematic train wreck is the fact that the last 20 minutes or so is pure filler.In fact the last 20 minutes should have been the middle 20 minutes. By this I mean that once the actual plot is over - the bad guys are captured and everything is wrapped up - the movie should be over, except for maybe a recap or a \"farewell\" coda. And normally in a movie like this at this point you'd expect the musician/actors to perform a number (to a wildly enthusiastic audience) as the credits roll. Instead, the screenplay does a \"Merry Widow\" and proceeds to parade a random bunch of folk and country music stars on camera who do their little musical turns and walk off. For 20+ minutes! I kept looking at my watch and thinking \"Surely this will be the last number...oh NOES, here they go AGAIN!\" It's the oddest sensation. For all I know, the uninterrupted musical \"concert\" at the end were the real reason for the movie, but surely the place for it should have been in the middle of the story, since the plot routinely came to a complete halt while someone sang a number anyway. This anomaly is extremely disorienting for anyone in a modern audience who expects a movie to be *over* when it's over. The oddest darned thing I've seen in a loooong time.",
         "In his day, Director Jean Yarborough worked with all the big names in bad movies (Abbott & Costello, The Bowery Boys, Rondo Hatton and Bela Lugosi.) He even did an unacknowledged adventure series with Mantan Moreland battling Nazis in the tropics (KING OF THE ZOMBIES, LAW OF THE JUNGLE.)Capping off his film career with the ignominious twilight of performers like Carradine, Rathbone and Chaney Jr. seems like a destiny chosen for him by the gods of the B-Movies. Is there something of Greek tragedy in this ending, or is it merely poetic justice? At any rate, it was good to see three actors who had all seen much better days putting in one more turn as despicable villains, and it was a fitting coda for a director whose career was always more remarkable for determination than artistry.",
         "Perhaps one of the stupidest, un-funny, non-scary, most insipid and tedious moovies ever filmed, further cementing John Carradine's reputation as one of the worst actors ever. I cannot fathom just who this moovie is aimed for - hicks? People who make fun of hicks? Country/Western buffs? Horror fans??? Not even Bad Cinema buffs can take much of this warmed-over cow pie. This would have made a tasty treat for MST3K to bash, and it would no doubt rival Manos, the Hands of Fate for the most awful, ickiest, dreckiest piece o' crapola ever. MooCow says ferget you ever herd about it. :=8P",
         "Of the 13 feature films in which John Carradine and Lon Chaney both appeared, 1967's \"Hillbillys in a Haunted House\" was not only the last, it was one of the few where they actually shared any scenes (shot under the working title \"Ghost Party\"). Joined in villainy by a game, 74 year old Basil Rathbone, the three actors offer the only real novelty to this tired rehash of old dark house clichés, dragged down by its abundance of country music. A sequel to the successful \"Las Vegas Hillbillys\" (note the spelling!), retaining stars Ferlin Husky and Don Bowman, but replacing the absent Jayne Mansfield with the equally photogenic Joi Lansing. En route to Nashville for a good old fashioned jamboree, the trio break down and have to spend the night in a house that's not really haunted; its actually the home base for spies trying to steal a top secret formula from a local rocket base. John Carradine alternately scowls and grimaces as Dr. Himmil, when he's not mercilessly teasing the gorilla Anatole belonging to Lon Chaney's Maximillian, who goes undercover by getting past an unsuspecting janitor (all he gets for his trouble is a formula combining nitroglycerin and antihistamine!). As Gregor, Basil Rathbone shares most of his scenes with Carradine, using phony ghosts and noises to try to scare off their dimwitted intruders, whom they mistake for agents from M.O.T.H.E.R. (Master Organization to Halt Enemy Resistance). A genuine ghost closes out the spy stuff at 67 minutes, leaving the final two reels open for yet more musical numbers. Chaney is clearly having a grand time, and Rathbone too, while poor Carradine has to remain sullen for the most part, fewer opportunities to be funny (he did enjoy stealing Anatole's banana!). As bad as the film's reputation is, consider how much worse it would have been without its heavyweight cast of screen villains."
      ],
      "genres": [
         "Comedy",
         "Family",
         "Horror",
         "Musical"
      ],
      "productionCompanies": ["Woolner Brothers Pictures Inc."],
      "summaries": ["Country singers on their way to Nashville have car trouble, forcing them to stop at an old haunted mansion. Soon they realize that the house is not only haunted, but is also the headquarters of a ring of international spies after a top secret formula for rocket fuel."],
      "budget": 0
   },
   "movielensId": 3460,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1967-05-01",
      "dvdReleaseDate": "2000-03-14",
      "directors": ["Jean Yarbrough"],
      "runtime": 86,
      "movieId": 3460,
      "title": "Hillbillys in a Haunted House",
      "mpaa": "",
      "actors": [
         "Ferlin Husky",
         "Joi Lansing",
         "Don Bowman",
         "John Carradine",
         "Lon Chaney Jr.",
         "Linda Ho",
         "Basil Rathbone",
         "Molly Bee",
         "Merle Haggard",
         "Sonny James",
         "Jim Kent",
         "Marcella Wright"
      ],
      "imdbMovieId": "0061765",
      "originalTitle": "Hillbillys in a Haunted House",
      "genres": [
         "Comedy",
         "Horror",
         "Music"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Country singers on their way to Nashville have car trouble, forcing them to stop at an old haunted mansion. Soon they realize that the house is not only haunted, but is also the headquarters of a ring of international spies after a top secret formula for rocket fuel.",
      "tmdbMovieId": 99008,
      "avgRating": 2.25,
      "releaseYear": "1967",
      "numRatings": 12,
      "posterPath": "/2ZqP8xJLOBNzjRIsNCpYldUPSJb.jpg"
   }
}