{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "child murderer",
            "id": 1468
         },
         {
            "name": "deserted island",
            "id": 155746
         },
         {
            "name": "dead children",
            "id": 170309
         },
         {
            "name": "south sea island",
            "id": 170310
         },
         {
            "name": "all male cast",
            "id": 170313
         },
         {
            "name": "flogging",
            "id": 170314
         },
         {
            "name": "survival skills",
            "id": 170319
         },
         {
            "name": "degeneration",
            "id": 170322
         },
         {
            "name": "adolescent boy",
            "id": 170325
         },
         {
            "name": "swine",
            "id": 170330
         },
         {
            "name": "innocence lost",
            "id": 170333
         },
         {
            "name": "whipping",
            "id": 170335
         },
         {
            "name": "asthmatic",
            "id": 170336
         },
         {
            "name": "aeronautics",
            "id": 170337
         },
         {
            "name": "rite",
            "id": 170339
         }
      ],
      "imdb_id": "tt0057261",
      "video": false,
      "title": "Lord of the Flies",
      "recommendations": [
         11773,
         10847,
         13384,
         36040,
         25508,
         43028,
         25103,
         11167,
         10785,
         3482,
         42179,
         34070,
         10299,
         20246,
         4579,
         50627,
         44190,
         3009,
         14776,
         32044
      ],
      "backdrop_path": "/chEIFJpFS8D6srbptxrgm1ebtWT.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 14,
               "character": "Ralph",
               "gender": 2,
               "credit_id": "52fe4551c3a36847f80c77e3",
               "name": "James Aubrey",
               "profile_path": "/hJbN3xiWSnrKEzKa1x7RW8e5Vd3.jpg",
               "id": 60990,
               "order": 0
            },
            {
               "cast_id": 17,
               "character": "Jack",
               "gender": 0,
               "credit_id": "52fe4551c3a36847f80c77f3",
               "name": "Tom Chapin",
               "profile_path": "/sAnTcrHTdBMZQGIskzbfEM2T7gZ.jpg",
               "id": 584137,
               "order": 1
            },
            {
               "cast_id": 18,
               "character": "Piggy",
               "gender": 0,
               "credit_id": "52fe4551c3a36847f80c77f7",
               "name": "Hugh Edwards",
               "profile_path": "/f42Yh7O488ObdjxegV0egfT5wv9.jpg",
               "id": 584138,
               "order": 2
            },
            {
               "cast_id": 19,
               "character": "Roger",
               "gender": 0,
               "credit_id": "52fe4551c3a36847f80c77fb",
               "name": "Roger Elwin",
               "profile_path": "/nFqqBxxKAWj3wL6XZVgp0uwQQJV.jpg",
               "id": 584139,
               "order": 3
            },
            {
               "cast_id": 20,
               "character": "Simon",
               "gender": 0,
               "credit_id": "52fe4551c3a36847f80c77ff",
               "name": "Tom Gaman",
               "profile_path": "/jY3esqSesgf7IDXEUeKcqOiRxrz.jpg",
               "id": 584140,
               "order": 4
            },
            {
               "cast_id": 21,
               "character": "Robert",
               "gender": 2,
               "credit_id": "589235529251412dcd00b74e",
               "name": "Nicholas Hammond",
               "profile_path": "/bKRxWiElErKqtWqXuFFksDsyMEW.jpg",
               "id": 29095,
               "order": 5
            },
            {
               "cast_id": 22,
               "character": "Peter",
               "gender": 0,
               "credit_id": "58adbe0bc3a368185e000047",
               "name": "Peter Davy",
               "profile_path": null,
               "id": 60996,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4551c3a36847f80c77a3",
               "name": "Gerald Feil",
               "profile_path": null,
               "id": 58812,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4551c3a36847f80c77a9",
               "name": "William Golding",
               "profile_path": "/4FnNMXYz3qupFQ4ezUTSgeQQpqL.jpg",
               "id": 60982,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe4551c3a36847f80c77af",
               "name": "Peter Brook",
               "profile_path": "/1xkrcl5YFJBELNWb4k0qxFmv27i.jpg",
               "id": 60981,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe4551c3a36847f80c77b5",
               "name": "Lewis M. Allen",
               "profile_path": null,
               "id": 18754,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4551c3a36847f80c77bb",
               "name": "Raymond Leppard",
               "profile_path": null,
               "id": 60983,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4551c3a36847f80c77c1",
               "name": "Gerald Feil",
               "profile_path": null,
               "id": 58812,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4551c3a36847f80c77c7",
               "name": "Jean-Claude Lubtchansky",
               "profile_path": null,
               "id": 60984,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4551c3a36847f80c77cd",
               "name": "Tom Hollyman",
               "profile_path": null,
               "id": 60985,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4551c3a36847f80c77d3",
               "name": "Michael McDonald",
               "profile_path": null,
               "id": 20990,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "52fe4551c3a36847f80c77d9",
               "name": "Terry Fay",
               "profile_path": null,
               "id": 60987,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "52fe4551c3a36847f80c77df",
               "name": "Al Hine",
               "profile_path": null,
               "id": 60986,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4551c3a36847f80c77e9",
               "name": "Peter Brook",
               "profile_path": "/1xkrcl5YFJBELNWb4k0qxFmv27i.jpg",
               "id": 60981,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4551c3a36847f80c77ef",
               "name": "Peter Brook",
               "profile_path": "/1xkrcl5YFJBELNWb4k0qxFmv27i.jpg",
               "id": 60981,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 7.913732,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 9960,
      "vote_count": 204,
      "budget": 250000,
      "overview": "Amidst a nuclear war, a plane carrying a group of schoolboys crash lands on a deserted island. With no adult survivors, the boys are forced to fend for themselves. At first they cooperate, but when the they split into two separate camps -- one led by the pragmatic Ralph and the other by militaristic Jack -- their society falls into disarray, leading to a disturbing examination of human nature and a chilling conclusion.",
      "similar": [
         8358,
         16608,
         337703,
         11210,
         41953
      ],
      "original_title": "Lord of the Flies",
      "runtime": 92,
      "poster_path": "/pTWtPWLKHzBsaDaGkePIQf4AW7e.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Two Arts Ltd.",
         "id": 41956,
         "origin_country": ""
      }],
      "release_date": "1963-08-13",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "Evil is inherent in the human mind, whatever innocence may cloak it...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Peter Brook"],
      "runtime": 92,
      "synopsis": null,
      "writers": ["William Golding"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0057261/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA1Mjc4MDA4MV5BMl5BanBnXkFtZTcwNDI2NTIyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: James Aubrey, Tom Chapin, Hugh Edwards | See full cast and crew »"],
      "reviews": [
         "What kid did not fantasize, at one time or another, being left alone, completely unsupervised, for a long, long, LONG period of time? To be allowed to say or do whatever he pleased, whenever he pleased. To eat anything he wanted, to go to bed late, to not go to school, to act or behave as he pleased without reproach. To be his own adult. Usually those kind of thoughts permeated our little minds right after a heavy-duty punishment. In 1990's \"Home Alone,\" we saw a broad, comical take on this fantasy. With 1963's \"Lord of the Flies,\" we get to experience the flip side. \"Lord of the Flies\" was required reading in junior high school. William Golding's dark, sobering allegory, set during wartime London, tells the story of a large group of young schoolboys airlifted out of England who are left to their own devices after a plane crash leaves them marooned on an uninhabited isle with no surviving adults. As the boys struggle to adapt to their crude but strangely exotic \"Robinson Crusoe\" existence, the troop begins to splinter into two opposing sects after failing to come to terms on an autonomous code of ethics. Most of the boys decide to revel in their unsupervised freedom, reverting to primitive, animal-like behavior while resorting to barbaric acts and ritualistic practices. A conch shell becomes the embodiment of power; a boar's head a symbol of lordly conquest. On the other side, a minority group try to repel the tempting force of evil by forming a more civilized commune. Eventually the \"survival of the fittest\" factor sets in as the anointed leader of the hostile group incites violence to force an autocracy. Golding's fascinating premise certainly does not hold much hope for the future of mankind. We are conditioned as a people to be civilized; it is an acquired trait, NOT an inherent trait \u0096 according to the author. And if and when the shackles of goodness and purity are at any time removed to the extent that we are allowed to become our own social and moral dictator, we will invariably revert back to what comes naturally. And with a child, who has been less-conditioned, it will take little time at all. Evil is stronger, easier, and much more seductive. When playing \"good guys and bad guys\" as a kid, which did YOU prefer to be? Boasting a surprisingly natural cast of amateur actors and directed by radical stage director Peter Brook (\"Marat/Sade\"), this lowbudget British effort impressively captures much of the novel's back-to-nature symbolism that I found so powerful and fascinating. The young masters representing good and evil, James Aubrey (\"Ralph\") and Tom Chapin (\"Jack\"), effectively portray the resolute leaders of the two disparate tribes, while butterball Hugh Edwards as the bespectacled, philosophical \"Piggy\" and towheaded Tom Gaman as the quietly sensitive \"Simon\" are touching as two of the weaker followers who become likely targets of the surrounding chaos and burgeoning brutality. What I love most about this cast is that they act like little boys, not little actors, grounding their often awkward actions and behaviors in reality. Trivia note: one of the secondary boy players is none other than Nicholas Hammond, who went on to play young Friedrich in the film classic \"The Sound of Music\" two years later. Brook's use of grainy black-and-white photography, plus the lack of any comprehensive musical score (remember Tom Hanks' \"Castaway\"?), accentuates the bleakness of its surroundings and feelings of isolation. The movie can hardly be expected to capture fully every single intention of this highly complex novel (most don't), but it does respect Golding's words and captures the very essence of what he wanted to say. For that alone it should be applauded. By the way, don't waste your time on the 1990 color remake featuring \"professionals\" like Balthazar Getty. The poetic beauty is all but dissipated in this haphazard, jarringly Americanized update. It makes me worship Peter Brook's version even more. And what story could BE more disturbing yet topical than \"The Lord of the Flies\" as it applies to today's \"latch-key\" society?",
         "Director Peter Brook delivered a very powerful and artfully done film based upon the classic book by William Golding. To those who have commented here about the differences between the book and this film: these are two very different mediums. Brook did not attempt a straight adaptation, he presented Golding's story through his own vision and emotional lens. The use of non-professional children is one of the things that make this a brilliant film, and vastly superior to the obnoxious 1990's version. If you pay attention to the opening minutes of Brook's film, you will notice that the world presented is nice, normal, clean, and functional. The boys deliver their lines well and the story flows smoothly. Once the boys are on the island, the scenes aren't nearly so smooth in transition, the speech becomes very awkward and the boys interaction with each other is stilted and unnatural. That is the point! These children know the direction they are going is wrong, to a boy they know this. Yet as individuals they are helpless to stand up to the group. Their awkwardness flows from their fear of being cast out, while yearning to be rescued and return to their homes. The nightmarish quality of the situation is well reflected in the hesitant speech and graceless movements. The uneasy stringing together of scenes makes the viewer squirm, hopefully making the connection to how ill at ease and unnatural the boys themselves must feel. I'm sure most of you have been around boys of this age at some point in your life. They are prone to being tongue-tied, have few social graces and lack physical co-ordination. That's what makes this film so utterly believable, the boys are real boys, not pimped-out Hollywood trick ponies, delivering their lines in perfect Shakespearean English, while nimbly doing complicated dance moves and mugging their perfect little faces square at the camera. Golding's book is a masterpiece that can be taken on several levels. Brook's film offers no fewer interpretations of the deeper meaning while presenting a realistic and horrific vision of the basic story. I know most people simply will not get this film. That's too bad because it is a classic.",
         "This is one of those rarest of rare birds: a film that is totally faithful to the novel upon which it is based. During his lifetime, William Golding was ever protective of his greatest creation. When it came to making a film of 'Lord of the Flies' some of the greatest screen writers and playwrights of the day had a go at producing a script for it - all of them being turned down by Golding himself. Finally, it was decided to attempt the film as a sort of Drama Workshop. Thus it was that 30+ boys, plus director Peter Brook, a film crew and the regulation chaperones found themselves living in a bunk house, which had been an old canning factory, on the island of Vieques off Puerto Rico, with little more than copies of the novel and an outline of the idea and the limitation of the school holidays in which to make the film. The result defies belief. This is a masterpiece of Youth Drama, years ahead of its time. Even today, 40 years on, it is still staggering in its truth and clarity. The powerful imagery, chilling in its simplicity, far transcends anything which could be achieved with present day digital trickery. Not for this film the obvious blood and guts of action horror; here we have the most unspeakable acts made far more terrifying by their very understatement. (Simon's death must be one of the foulest acts ever filmed - but then, in reality, it was not - it is all in the imagination of the viewer and becomes far more terrible than any actual depiction of the act of ritualistic murder could ever be!). When the great day of reckoning comes, this film will stand head and shoulders above all other film adaptations of novels.",
         "May I start by saying a pox on those who do not love the cast. I honestly can't see why you complain. I love the book; I didn't need to read it for school, but I read it anyway and enjoyed it. I understood the message Golding brought about. Then why am I not offended by this movie as I was by Lord of the Rings? This film is an excellent translation of Golding's novel. It is stark, bold and well directed. The young cast are frighteningly talented, especially Chapin and Edwards. This has everything I expected and much more. Perhaps I was wishing for a more vivid \"Lord of the Flies\" scene, but it brought it's message across and kept everything in the book alive. I marvel every time I see Edwards' Piggy. I can't understand the capacity the boy had at such an age. Jack was well portrayed also, as was Ralph. The ending was perfect. I admit the music did throw me off a tad but everything else just came so willingly. The emotions of the boys practically leaked out through to me, and that one little boy in particular (I've forgotten his name, I'm afraid - is it Percy?) looking up at the sea-captain just personified everything that the ending symbolised. This film is one of my favourites and I cannot see how anyone could fault it so drastically.",
         "After reading Golding's classic novel, my class watched this adaption of \"Lord Of The Flies\" in our literature class. I found it to be quite good, and a hell of a lot better than the 1990 version, which alters all too many important moments and characteristics of the book. Reading over these comments, I was very confused. 1. The story and moral of \"Lord Of The Flies\" is so haunting and powerful that it does not need an overly dramatic score. The tune that Jack and his choir sing around the island is just the right touch. 2. Of course the acting wasn't as amazing as it could have been! Everyone seems to be forgetting just how young and inexperienced these boys were. Besides, the character's in Golding's story are just as young, and act their age (however violent and disturbing it may be). I found the camera work to be quite lovely. The film uses beautiful shots, which only enhance it even more. The final scene is one of my favorites. My only bone to pick is how quickly the film goes through the events in the book. I really do wish it would have slowed down a bit, and concentrated more on such characters as Simon, as well as the boys transformation into savages. Overall I found this adaption of \"Lord Of The Flies\" to be fantastic. My advice to future viewers of this film is to read the book first, definitely watch this 1963 version afterwards,and completely avoid the 1990 version all together.",
         "Peter Brook's film adaptation of William Golding's \"The Lord of the Flies\" is still an interesting piece of cinema one doesn't get a chance to see too often. After more than forty years of its release, the film is still a good way to get to know Mr. Golding's masterpiece, as Mr. Brook stayed truthful with the screen play he wrote. The mere idea of children shipwrecked in an island to fend for themselves, as they make a world of their own, was quite revolutionary when Mr. Golding wrote the story. To witness what children are capable of doing in extreme circumstances is an eye opener. In fact, the children put into practice what they have seen of their society as they realize they are stuck in an island without any indication of anyone looking out for them. Although some criticism has been expressed in this forum about the way the accident happens, and the way the boys come from all parts as they first gather in the beach, Mr. Brook's intentions seem to be more into the theatrical staging of this scene as the different groups come together. The best scene being the group lead by Jack as they march on the beach singing Kirie Eleison in their sweet and melodious voices. Cruelty is the most notorious trait the boys display for one another. That, and the leadership that Jack wants to take away in forming his own tribe and the complete breakdown in the communication among the boys. Mr. Golding was telling us that given to certain circumstances, man, or children in this case, will revert into being savages and that perhaps society's role is to keep people controlled into what is known as a civilized world. Peter Brook made an excellent film, but perhaps his biggest achievement is the magnificent work he got out of the mostly unknown cast of young children. There are no false notes, especially in the principals. With the notable exception of James Aubrey, who plays Ralph, none of the other boys had a film career, although one sees the promise in some of them. Tom Chapin is good as Jack. Hugh Edwards gives a heart wrenching account of Piggy, the boy that is ridiculed by the rest and betrayed by Ralph in telling the new arrivals about his nickname. Tom Gaman as Simon also had some good moments. This film shows Peter Brook at his best.",
         "Peter Brook's rich film of Golding's \"Lord of the Flies\" is a stunning compilation of classic film imagery. Scenes surrealistic, beautiful and disturbing create a haunting atmosphere and a world of sights, sounds and ideas unlike any other film. The choir marching on the beach in full dress singing that catchy \"Kyrie Eleison\", the first sight of Jack in his almost shocking warpaint, Piggy's comic- pathetic persona, the floating body of Simon in the ocean drifting off the screen as the sun-dappled water glistens, the look on Ralph's face at the very end of the film, his countenance stamped with fear, horror, relief and profound sadness--all combine to form a mosaic of a classic contemporary fable. As the war in Vietnam was raging in the 60s and 70s, this film provided a distinct commentary on the times. Seeing the film recently again, with its disturbing picture of irrational fear culminating in spectacular tragedy, \"Lord of the Flies\" seems almost more relevant today--and almost more tragic than before.",
         "When William Golding's classic parable was originally published in 1954, critics gave outstanding reviews for a debut novel. The book was not only a first-rate adventure story, but a parable of our times. While back in 1954 kids killing each other took some strong believing, today you can see Golding's prediction being chillingly accurate. Nine years later, stage director Peter Brook would direct the film version that generated many mixed reviews. Some called it unprofessional and rushed, while others praised it as a classic. When the terrible American remake was released in 1990, many looked back at this version as a classic, and rightly so. Brook's film opens with a very creepy montage consisting of pictures of a British boarding school intercut with planes flying over London with a haunting school chorus playing in the background. We learn that the world has been caught in a nuclear war and all the kids in the school were evacuated on planes. One plane crashes into the sea during a thunderstorm. The only survivors are kids ranging from six to twelve years old. Knowing they are trapped on a deserted island, they decide to re-start civilization. The leader is Ralph (James Aubrey), one of the oldest kids who calls on assemblies with a conch. His buddy is Piggy (Hugh Edwards), a fat nerdy kid with glasses who is ignored by the other children even knowing he is the most mature. The bully is Jack (Tom Chaplin), a trouble chorus leader who quickly evolves to a Nero-like totalitarian leader and begins to lead the boys into savagery. The neutreal Christ-like figure is quiet Simon (Tom Gaman) who fails to fit in with others. The kids eventually split up to two tribes after many disagreements, one tribe consists of savage hunters led by Jack, while the other tribe led by Ralph is worried about being rescued. Like the book, Peter Brook's THE LORD OF THE FLIES is a parable of the world under different political views. Piggy and the conch represent order and are both eventually ignored. Ralph represents a democracy while Jack represents a totalitarian form of leadership. Simon represents Christianity, although he is also ignored for most of the time. The kids undergo many conflicts, most ending in tragic results. Today, Golding's novel is a subject in many school discussions, and some people today criticize it for being unrealistic and irrational. But after all, it is a parable. In real life, it is obvious the kids wouldn't last for very long. Not believing professional child actors would deliver acting strong enough to portray such characters, Brook decided to cast non-actors that lived close to the island of shooting. This benefits the film greatly since Brook coaches great performances out of the kids (were some of them really acting?) and the fact that the actors are all unknown adds to the realism (This technique could be compared to the recent CITY OF GOD.) But the film's secondary performances are not as good. The kids usually take long pauses in between their lines, and for most of the time they seem to be reading them. Poorly reading them, in fact. To make things worse, the movie was dubbed on post-production due to the low-budget. This makes some of the scenes awkward, mute, and out of synch. May I also add the scenes are edited abruptly, making the whole thing seem rushed. It's sad that the film had to be cut to 90 minutes, considering an extra 30 minutes of footage would improve it. This process slows down the film, making it sometimes boring and tiresome. This, by no means, is a bad movie. Brooks direction and Tom Hallimans cinematography put the 1990 remake to shame. The island locations (Puerto Rico) look dark and menacing in B&W, the kind of atmosphere the remake lacked. Brook is able to compose beautiful sad visuals. ***SPOILERS*** These include the kinetic editing during the hunt for Ralph, Simon's dead body floating in the water arranged by the sad school chorus (depressing moment), Piggy's tragic demise that puts the 1990s remake laughable mirrored scene to shame, and the very scary feast that occurs at night followed by the dance. That scene, consisting of quick images, scary close-ups on the savages painted faces, and disturbing screaming is very strong even for today's standards. Brook is also wise on deciding to omit the Lord of the Flies scene and only suggesting it. He does a batter job at it than Harry Hook did in the remake. Imagine the pain of actually filming that scene. ***END OF SPOILERS*** While the out-of-synch audio, some poor acting, and slow pacing might keep this movie away from the recent generation, it is still an underrated classic on its own right. It is disturbing, haunting, and visually wonderful. It really deserves to be seen twice to be really appreciated. Strongly recommended for those that never read the book and an essential preference over the remake. (4/5)",
         "WARNING: THIS REVIEW CONTAINS SPOILERS \"Lord of the Flies\" (1963) is a film based on William Golding's 1954 novel, which went by the same name. This film, like its written counterpart, can be taken two different ways. In one aspect, Lord of the Flies is an enjoyable adventure story, with several elements of horror, as well. From another point-of-view, the position William Golding obviously took when he wrote his novel, Lord of the Flies is an paradigm of human nature. The film does its novel justice in discussing both literally and figuratively the primordial nature of man and how the superego plays a major role. Symbolism is abundant in this film. Ralph, the protagonist, represents democracy and rightness, while Jack, the antagonist, represents totalitarianism and wrongness. Furthermore, the conch Ralph uses to attempt to establish rules represents governmental order and decorum. While Ralph struggles with a small amount of boys to build huts (representing safety and man's dependence on nature), Jack is out with his hunters killing pigs, signifying their fall into savagery. Piggy, Ralph's \"sidekick\" of sorts, is asthmatic and unwilling to help with chores, but nonetheless represents intelligence and clearsightedness. The fact that Piggy is mocked, ignored and the object of derision exemplifies the real life fact that true intelligence is usually not paid any attention. When Piggy is killed the conch is shattered into thousands of little fragments. This represents the complete termination of any sense of intelligence, rationality or order the island may have at once had. Simon, the most introspective of the characters and a true loner, represents Jesus Christ. He faints when the choir boys first meet Ralph and he offers some of his meat to Piggy when no one else would share with the corpulent young boy. Early in the novel a young boy with a mulberry birthmark raises the question of a beast, which he says he saw moving through the foliage one night. Simon says it was him going to meditate but the littlun's (the small children) are still nervous. When Simon finds a dead parachutist atop the island (which Sam and Eric saw and mistakenly believed was the beast) he staggers down the island's mountain to tell the boys that the \"beast\" is not real. This is reminiscent of Christ staggering under the weight of his own cross. However, Jack, his men, and even Ralph and Piggy, are caught up in a festive tribal dance. When Simon appears he is mistaken for a beast and beaten to death. When this occurs, wind causes the parachute atop the island to detach from the twigs which snagged it and the dead parachutist's body flies out to sea as Simon is dragged out to sea, as well. This shows that Simon was and forever will be the only one of the boys to truly know where the beast was the entire time: in their hearts. Roger, an inimical character representing the embodiment of pure evil and sadism, is the one who kills Piggy. He gets sadistic pleasure from torturing pigs, and he enjoyably kicks down sand castles the littlun's build and throws stones at Henry. Roger is the personification of the base stage of the human psyche: evil. Sam and Eric, twins collectively known as Samneric, represent society. They are naturally good and assist Ralph with collecting fruit and building huts. However, Jack eventually captures them and they are forced to join his tribe. When Jack and his men hunt Ralph near the end of the film, Samneric reluctantly give in and inform Jack of Ralph's hiding place, showing that anarchy caused them to lose all sense of loyalty to others. Lord of the Flies is truly a masterpiece. It exemplifies Freudian thought, observable human behavioral characteristics, and the incontrovertible reality of the human psyche. The superego, the part of our brain concerned only with our own survival, can take over if rules are not existent. Society keeps humans sane, and lack of civility will inevitably lead to savagery. Yes, Lord of the Flies is a great adventure story, but it is also the greatest representation of the human spirit ever created. Praise Golding for the invention, and praise Brooks for his wonderful interpretation.",
         "It has been three years since I read the book and saw the movie, and I have still not forgotten it. \"Lord of the Flies\" is one of the most harrowing film expiriences I have ever seen. You don't need Hannibal Lecter to make a movie scary, and this movie proves it. Actually, a film is most scary when it provokes fear on a most basic level. This is not a story that is scary because of plot twists or original characters. This film is scary because it uses techniques that will scare anyone in the deepest way. The plot is simple. School boys crash land on a remote island with no adults. The boys set up their own government, with Ralph in charge. But things start to fall apart very quickly. The set up is perfect. All the boys are perfectly cast, and their performances are strong all around. All the characters are likable in the beginning, which is important because as Roger Ebert (I think) said, a person is scarier when the viewer knows more about them. The directing is perfect. Even though the film is in black and white, the imagery still retains a sense of wonder and awe. Each shot is perfectly used to create the optimum effect. Pacing is key here, because if it is too slow, the film gets boring, but if it goes by too fast, the film feels rushed. The director nails it perfectly. He starts out slow but even, but as the story degenerates into madness, the intensity grows, which magnifies the fear."
      ],
      "genres": [
         "Adventure",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": ["Two Arts Ltd."],
      "summaries": [
         "A group of young boys are stranded alone on an island. Left to fend for themselves, they must take on the responsibilities of adults, even if they are not ready to do so. Inevitably, two factions form: one group (lead by Ralph) want to build shelters and collect food, whereas Jack's group would rather have fun and HUNT; illustrating the difference between civilization and savagery.",
         "After a plane crash in the ocean, a group of British students reach an island. The boy Ralph organizes the other kids, assigning responsibilities for each one. When the rebel Jack neglects the fire camp and they lose the chance to be seen by an airplane, the group split under the leadership of Jack. While Ralph rationalizes the survival procedures, Jack returns to the primitivism, using the fear for the unknown (in a metaphor to the religion) and hunger to control the other boys. His group starts hunting and chasing pigs, stealing the possession of Ralph's group and even killing people.",
         "A group of boys are marooned on an island after their plane crashes. With no adult survivors, they create their own \"micro-society\". Ralph is elected \"chief\", and he organises shelter and fire. Jack, the head of the choir takes his boys hunting for food (wild pigs). A bitter rivalry develops between Jack and Ralph as both want to be in charge. The \"hunters\" become savage and primal, under Jack's rule, while Ralph tries to keep his group civilised. The growing hostility between them leads to a bloody and frightening climax.",
         "Shipwrecked on an island, the castaway boys eventually revert to savagery despite the few rational kids' attempts to prevent that."
      ],
      "budget": 250000
   },
   "movielensId": 3461,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1963-08-13",
      "dvdReleaseDate": "2000-03-14",
      "directors": ["Peter Brook"],
      "runtime": 92,
      "movieId": 3461,
      "title": "Lord of the Flies",
      "mpaa": "",
      "actors": [
         "James Aubrey",
         "Tom Chapin",
         "Hugh Edwards",
         "Roger Elwin",
         "Tom Gaman",
         "Nicholas Hammond",
         "Peter Davy"
      ],
      "imdbMovieId": "0057261",
      "originalTitle": "Lord of the Flies",
      "genres": [
         "Thriller",
         "Adventure",
         "Drama"
      ],
      "youtubeTrailerIds": [
         "8w0ILjgHfhw",
         "c1x2wP5vP34",
         "8B0CUbmnsH0"
      ],
      "plotSummary": "Amidst a nuclear war, a plane carrying a group of schoolboys crash lands on a deserted island. With no adult survivors, the boys are forced to fend for themselves. At first they cooperate, but when the they split into two separate camps -- one led by the pragmatic Ralph and the other by militaristic Jack -- their society falls into disarray, leading to a disturbing examination of human nature and a chilling conclusion.",
      "tmdbMovieId": 9960,
      "avgRating": 3.5,
      "releaseYear": "1963",
      "numRatings": 3204,
      "posterPath": "/pTWtPWLKHzBsaDaGkePIQf4AW7e.jpg"
   }
}