{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0110629",
      "video": false,
      "title": "National Lampoon's Last Resort",
      "recommendations": [
         69853,
         156062,
         75141,
         92635,
         85195,
         36848,
         33388,
         33392,
         33390,
         65262,
         37938
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Sam",
               "gender": 2,
               "credit_id": "52fe478fc3a36847f813c579",
               "name": "Corey Feldman",
               "profile_path": "/odE8az9kgHCkWMtWzfmcDBuZiww.jpg",
               "id": 3034,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Dave",
               "gender": 2,
               "credit_id": "52fe478fc3a36847f813c57d",
               "name": "Corey Haim",
               "profile_path": "/viodPG7i2x0cJHGVHRVs6C8pIrE.jpg",
               "id": 17444,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Alex",
               "gender": 1,
               "credit_id": "52fe478fc3a36847f813c581",
               "name": "Demetra Hampton",
               "profile_path": "/4tzJq4SrePoLNEi7Cv0MCyj4eEE.jpg",
               "id": 42738,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Hemlock",
               "gender": 2,
               "credit_id": "52fe478fc3a36847f813c585",
               "name": "Robert Mandan",
               "profile_path": "/2yg2e5p34G4bxHDxfJNOzci72jt.jpg",
               "id": 115766,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Rex Carver",
               "gender": 2,
               "credit_id": "52fe478fc3a36847f813c589",
               "name": "Geoffrey Lewis",
               "profile_path": "/8BABD0pjhefIFpKEZwNnLrkn0wl.jpg",
               "id": 18071,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Bob",
               "gender": 2,
               "credit_id": "56e78a609251410914001226",
               "name": "Chris Barnes",
               "profile_path": "/dohfBZZwv2A6PQ75zJfvWAxXwAT.jpg",
               "id": 1591219,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe478fc3a36847f813c56f",
               "name": "Rafal Zielinski",
               "profile_path": "/5jl2PKKd1fdrrx64nd5WoAqxrcO.jpg",
               "id": 130424,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe478fc3a36847f813c575",
               "name": "Patrick Labyorteaux",
               "profile_path": "/bpT1Xkowt0YpsntbytgddnWDT9Q.jpg",
               "id": 114876,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 1.193641,
      "production_countries": [],
      "id": 49338,
      "vote_count": 9,
      "budget": 0,
      "overview": "Sam and Dave are living the boring life until they are beckoned to Sam's uncle's Island. When they get there (still not quite sure how that worked) they are compelled by beautiful women and a dastardly enemy of the Island. After accidentally convincing Sam's uncle to sign away rights to his island, they must somehow fix the problem.",
      "similar": [],
      "original_title": "National Lampoon's Last Resort",
      "runtime": 90,
      "poster_path": "/h3ycFo3qKhF9SDERN1PQq4bJeIv.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1994-04-29",
      "vote_average": 4.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Rumored"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Rafal Zielinski"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Patrick Labyorteaux",
         "Patrick Labyorteaux"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0110629/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYyODc4MTIxMV5BMl5BanBnXkFtZTcwNDQzMjIzMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Corey Feldman, Corey Haim, Maureen Flannigan | See full cast and crew »"],
      "reviews": [
         "I rented this film with a few good buddies and we fully expected to enjoy watching a lousy movie filled with unintentional comedy. Instead, what we labored our way through was 90 minutes of unwatchable garbage. The movie presents us with Corey Feldman and Corey Haim, and proceeds to tell us that they are cool guys who we should enjoy. Why?! It never shows us anything cool or enjoyable about them - it just asks us to assume that. Much like when a body rejects a donated organ, we reject the very notion that they are interesting or likable individuals. Was Feldman's outfit EVER cool-looking? Even in some parallel dimension? (Also, a note to any prospective screenwriters out there, costuming jokes are NEVER funny! \"Look, the sleeves of his suit are ripped off because he's on the beach!! HILARIOUS!\") Corey Haim spends his time dressed like a semi-retarded homeless person and spouting off about virtual reality. Huh? Where did that character paradigm come from? If you can believe it, the movie actually becomes less watchable when the two Coreys aren't on the screen. We're presented with a villain with an annoyingly altered voice, a mermaid with an annoyingly altered voice, and an retired couple intent on wasting our time with their weary jokes. A last note, we should have realized that the movie was going to be a failure while watching the opening credits - the names are piercingly flashed at us in neon colors. It was enough to almost send me into a seizure. People, trust me. If you're looking for a campy movie high on the unintentional comedy scale, look elsewhere. \"Last Resort\" only serves to p*** you off.",
         "Look, i'm a fan of stupid movies. Troll 2 for example, I thought was hilarious. But this movie was beyond garbage. There was absolutely no plot at all, NOTHING in this film makes sense, and nothing that ever happens can even be remotely considered funny. the only way this film could be considered comedic is how you'd be laughing your ass off when you gave this movie to someone you hated for Christmas or something. I'm not kidding, it's terrible in every aspect. I'd really like to know what was wrong with the retards that made this thing. Did you just wake up and decide you'd like to give the world a reason to hate you? I can't imagine anyone really liking this movie, except for a few really unpopular mental patients.",
         "I've been a comedy fan for as long as i can remember, and this is most definately the WIERDEST comedy i've seen in my life (& this said I own over 150 comedies, and have seen thousands). I was going through the videos in a local store when it was selling them off and shutting down after 15 years (i found some juicy &*$! in there), and i bought this film on it's National Lampoon connection, but this wasn't anything like i expected, but it ended up being really intriguing. My first impression in watching this was... What was the writer smoking when he came up with this? Whatever it was it had to be strong. Other people have explained the plot (if you want to call it that) but i just have a few questions for whoever has seen or had anything to do with this film. What was up with the villain guy's voice, Corey Feldmans outfits or hair, the evil guys hideout, or, hmmm, any other aspect of this film? All of this said, a few jokes do hit a mark, and despite the, poor scripting, plot, camera work and acting, there are some quite pretty girls. Pity about the rest. Ironically, if you like comedies, this is worth a look, because you will remember it as an experience, and to be truly different to any comedy (at least to me) that i've seen before",
         "This is without doubt the worst film I have ever seen. The entire cast (with the exception of Flash Mackenzie) are awful. Even the 2 Coreys fail to help this film. The erotic thriller they made together was worse than this. I've seen some pretty diabolical films in my time: Murdercycle Scorcher Crossworlds Flying Virus Fortune Hunters etc etc. but this one beats them all. Couldn't even muster a cameo from Mario van Peebles. AWFUL!! You should stay away from this film at all costs. Whats with the cheapo sets and props? Did they blow the entire budget on Feldmans wardrobe? (I kind of doubt it). Its a hell of a long way from such gems as 'licence to drive' and 'dream machine'. Absolutely diabolical",
         "Absolute garbage. Simply the worst film I have ever seen. Warning: If you ever see a copy of this in any store, throw it on the ground and stomp all over it. With the shattered remains, throw it in a bonfire. I rented this movie with the lowest of expectations, hoping for a few laughs but it couldn't even offer me that. As the movie progresses you think that it may get a bit better but no, it just keeps dragging on, no humor, no plot, no nothing! I watched it until about the 45 minute mark when I knew that it was just a waste of my time. Nothing at all went right for this movie and sadly, I could cough up a better concept for a film. Worst film in existence. 0/10. No effort was put in this movie, therefore I give it no stars.",
         "I would have at least given this film a 4/10 for effort but even at 90 minutes it really tries your patients. Rafal Zielinski (director of 'Fun (1994)' and the underrated 80's teen comedy 'Screwballs (1983)') attempts to capture the zany spirit of the 1960's 'Beach Party' movies but instead delivers a very flat movie. It's a 1990's MTV music video without the music. Another problem is that the Corey's and supporting cast (bar Robert Mandan and Geoffrey Lewis as the old movie star rivals) don't seem to know how to give the silly material the energy it needs to even make it passable. So the film feels like it's missing something from the beginning and after the 50 minute mark, the wacky antics, that try to disguise the films direction-less, will wear you down. By the last 20 minutes (if you're still watching) even a cameo by Zelda Rubinstein won't be any relief. Dread Zeppelin's play out the last few minutes (Before the credits even roll!!!) in a final pointless music video montage. Overall you would have to be an insane Corey's fanatic to sit through this. I don't give out 1/10 scores often but this film really did try my patients to breaking point.",
         "I give this film two. Why? Because it has the Coreys in it and occasionally they have their tops off. But other than that this film was absolute RUBBISH! I bought it only yesterday because I love the Corey's and I try to buy all their stuff. i knew it was going to be ridiculous, stupid, maybe irritating, but i thought I might actually enjoy SOME of it, seeing as I usually enjoy silly films. But this wasn't just bad it was god awful garbage! How could the Corey's have ever agreed to such an excruciatingly painful display of bad acting, screenplay, directing, producing, and everything else it requires to make a film. WHY? I seriously don't get it, because the Coreys are talented but no one who saw this film first would ever know that! It was torture to watch and i only put up with it for the sake of the Coreys. But never again. It will collect dust on my shelf for the rest of my life, only there so i can say I own most of their films. By far the worst film i've ever seen!",
         "So jaw-droppingly, eye-glazingly, mind-bogglingly abysmal that it changes the way you view all other movies thereafter. It's honestly that awful. It resets your gauge as you realize the films you thought were at the very bottom of the heap actually have a yawning chasm beneath then, at the very depths of which lies this alleged film. Now, whenever anyone says ANYTHING else is \"the worst movie ever made\", I tell them first place is locked up by \"Last Resort\" and the best (well, actually the worst, I mean) anyone else can ever hope for is second place. Please take my word for it. Do not subject yourself to this horrific idiocy.",
         "This always shows after midnight, mostly at 2 a.m. Strangely, at that ungodly hour I am drawn to watch this show, yet again. I have seen it many times over the years. I saw it again just two days ago. There is no plot. It has no jokes, unless they are puns on sex. The extras are badly painted cut outs. All of the characters seem to have no main objective. I not sure what the film makers wanted for me to get out of these 90 minutes. I'm not sure how it starts or how it ends. And truth be told, as distorted as the plot sounds, I don't believe this movie was drug inspired. It was set out to be cheesy. The part that has me up at night watching is it's unpredictable nature. Because I am uncertain of any action in the movie, the following action is even more confusing. Had they filmed this movie in any conventional way, It would have never been watched. Because it is so crazy and unpretentious, it works in it's capacity. Would I recommend it to a friend? As long as don't have to watch the movie with them.",
         "This movie is very aptly titled. If you go to the video store, and this movie is on the shelves, and NOTHING ELSE IS, and you don't expect to live past tomorrow, and you have three bucks to spare, and you are a masochist, rent it. It is truly the \"Last Resort\" when it comes to picking a movie to rent. I rented this movie way back in '94 or so when it came out because there was nothing else to rent (I was on an USAF base in the UK which had a VERY SMALL rental section in the little market they had on base). It took me three days to recover. I am dumber for having seen it. Run away. Run away fast."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Amritraj Productions",
         "Rose & Ruby Productions"
      ],
      "summaries": ["Sam and Dave are living the boring life until they are beckoned to Sam's uncle's Island. When they get there (still not quite sure how that worked) they are compelled by beautiful women and a dastardly enemy of the Island. After accidentally convincing Sam's uncle to sign away rights to his island, they must somehow fix the problem."],
      "budget": 0
   },
   "movielensId": 3463,
   "movielens": {
      "languages": [""],
      "releaseDate": "1994-04-29",
      "dvdReleaseDate": "2000-03-14",
      "directors": ["Rafal Zielinski"],
      "runtime": 90,
      "movieId": 3463,
      "title": "National Lampoon's Last Resort",
      "mpaa": "PG-13",
      "actors": [
         "Corey Feldman",
         "Corey Haim",
         "Demetra Hampton",
         "Robert Mandan",
         "Geoffrey Lewis",
         "Chris Barnes"
      ],
      "imdbMovieId": "0110629",
      "originalTitle": "National Lampoon's Last Resort",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Sam and Dave are living the boring life until they are beckoned to Sam's uncle's Island. When they get there (still not quite sure how that worked) they are compelled by beautiful women and a dastardly enemy of the Island. After accidentally convincing Sam's uncle to sign away rights to his island, they must somehow fix the problem.",
      "tmdbMovieId": 49338,
      "avgRating": 1.93506,
      "releaseYear": "1994",
      "numRatings": 77,
      "posterPath": "/mcVo71fGocAG08b3aEdxoWqjHP0.jpg"
   }
}