{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "fortune teller",
            "id": 663
         },
         {
            "name": "birthday",
            "id": 1421
         },
         {
            "name": "priest",
            "id": 10093
         }
      ],
      "imdb_id": "tt0092079",
      "video": false,
      "title": "That's Life!",
      "recommendations": [
         124296,
         116014,
         56385
      ],
      "backdrop_path": "/5twaiZzvGZyEoo4DvUBdURScmOY.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Harvey Fairchild",
               "gender": 2,
               "credit_id": "52fe484bc3a36847f816033b",
               "name": "Jack Lemmon",
               "profile_path": "/chZmNRYMtqkiDlatprGDH4BzGqG.jpg",
               "id": 3151,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Gillian Fairchild",
               "gender": 1,
               "credit_id": "52fe484bc3a36847f816033f",
               "name": "Julie Andrews",
               "profile_path": "/yQ0J92DMiLtQYoytLJ6CuBkdeN0.jpg",
               "id": 5823,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Holly Parrish",
               "gender": 1,
               "credit_id": "52fe484bc3a36847f8160343",
               "name": "Sally Kellerman",
               "profile_path": "/5MeWRlE2F8S6tGiPx3hZHdDGVml.jpg",
               "id": 9805,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Father Baragone",
               "gender": 2,
               "credit_id": "52fe484bc3a36847f8160347",
               "name": "Robert Loggia",
               "profile_path": "/7xtU12KT12xjy4UY1O6VKpw7FLx.jpg",
               "id": 1162,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Megan Fairchild Bartlet",
               "gender": 1,
               "credit_id": "56537226c3a36850fa000afe",
               "name": "Jennifer Edwards",
               "profile_path": "/lA3OGv3DNbe4cs6yOGULTh9NOlw.jpg",
               "id": 120412,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Steve Larwin",
               "gender": 2,
               "credit_id": "56537235c3a36850ea000a39",
               "name": "Robert Knepper",
               "profile_path": "/w40AttR4OPQvjYyTVanq5Rm5iOb.jpg",
               "id": 17343,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Larry Bartlet",
               "gender": 0,
               "credit_id": "5653724392514170250009f4",
               "name": "Matt Lattanzi",
               "profile_path": "/ewiB9BXaynLLibBXIrL56DTzOpL.jpg",
               "id": 22490,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Josh Fairchild",
               "gender": 2,
               "credit_id": "5653725292514170100009fe",
               "name": "Chris Lemmon",
               "profile_path": "/hUh5BrIJ1flA8i9h9httFuA6W4F.jpg",
               "id": 64933,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Janice Kern",
               "gender": 1,
               "credit_id": "5653726092514170150009f9",
               "name": "Cynthia Sikes",
               "profile_path": "/quFlIHnZDU2PcbDEhTtkE9lzS4h.jpg",
               "id": 96765,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Fanny Ward",
               "gender": 0,
               "credit_id": "5653726fc3a36850fa000b0f",
               "name": "Dana Sparks",
               "profile_path": "/pJSNG1lZ2XJz9lHFUcANkESBlel.jpg",
               "id": 1213066,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Kate Fairchild",
               "gender": 0,
               "credit_id": "56537280c3a3685100000a62",
               "name": "Emma Walton",
               "profile_path": null,
               "id": 1539864,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Madame Carrie",
               "gender": 1,
               "credit_id": "5653728fc3a36850fa000b16",
               "name": "Felicia Farr",
               "profile_path": "/mR52cAPHU5ZsTsEtOFotHwDOHBJ.jpg",
               "id": 76979,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Corey",
               "gender": 2,
               "credit_id": "5653729e9251417013000a39",
               "name": "Teddy Wilson",
               "profile_path": "/pT5g0ZOwNhPRd6utOTSBBeQrqjj.jpg",
               "id": 58649,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Andre",
               "gender": 0,
               "credit_id": "565372a8c3a36850ec000a2d",
               "name": "Nicky Blair",
               "profile_path": "/4bilPyH0hUWChq2ZznBCFFvp82C.jpg",
               "id": 16669,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Dr. Keith Romanis",
               "gender": 0,
               "credit_id": "565372bac3a36850f3000b0b",
               "name": "Jordan Christopher",
               "profile_path": "/n2wKdRZ3qOYx1Ix8kzI0imINVeB.jpg",
               "id": 200728,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe484bc3a36847f816032b",
               "name": "Blake Edwards",
               "profile_path": "/tQ13izDBcErAV2qSz9KGjQbV5p9.jpg",
               "id": 1927,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe484bc3a36847f8160331",
               "name": "Milton Wexler",
               "profile_path": null,
               "id": 146953,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe484bc3a36847f8160337",
               "name": "Blake Edwards",
               "profile_path": "/tQ13izDBcErAV2qSz9KGjQbV5p9.jpg",
               "id": 1927,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 3.51074,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 52961,
      "vote_count": 4,
      "budget": 0,
      "overview": "A wealthy architect struggles with a severe case of male menopause at the approach of his 60th birthday.",
      "similar": [
         9552,
         314365,
         2649,
         45054,
         154400,
         525,
         48171,
         9945,
         13363,
         411976,
         9946,
         11688,
         8836,
         1624,
         634,
         13223,
         251,
         1832,
         670,
         4248
      ],
      "original_title": "That's Life!",
      "runtime": 102,
      "poster_path": "/qdaieih8EVIRRDdd3I6mGM4Iy1V.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Blake Edwards",
         "id": 6407,
         "origin_country": ""
      }],
      "release_date": "1986-10-10",
      "vote_average": 4.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Blake Edwards"],
      "runtime": 102,
      "synopsis": null,
      "writers": [
         "Milton Wexler",
         "Blake Edwards"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0092079/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM0Nzg4Nzg3Ml5BMl5BanBnXkFtZTYwNTI1NDA5._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Jack Lemmon, Julie Andrews, Sally Kellerman | See full cast and crew »"],
      "reviews": [
         "Don't be surprised if you have never heard of \"That's Life.\" It came and went quickly in 1988. Jack Lemmon stars as a hypochondriac who is turning 60 and believes death is just around the corner. Of course nothing could be further from the truth. His wife is Julie Andrews as a singer who awaits the results of a test to see if she has cancer. But Lemmon is so wrapped up with his troubles his fails to realize his wife may be the one actually sick. I know the description makes the film sound down and depressing. Nothing can be further from the truth!! As directed by Blake (\"10,\" \"Pink Panther\") Edwards, the film is laced with comedy to relieve the tension for the audience as well as Julie Andrews. This is a film for adults. It tackles real issues in real ways. The performances are all terrific and the mixture of comedy and drama are just right. It makes the film a qualified success.",
         "THAT'S LIFE! is a lovely family drama from 1986 directed by Blake Edwards centering on an affluent family man named Harvey Fairchild (Jack Lemmon)who goes through an emotional roller-coaster due to his approaching 60th birthday. He is so busy wallowing in self-pity and depression that he not even aware of the fact that his wife, Gillian (Julie Andrews) is facing a life-threatening illness. This barely-seen and highly underrated film was an unexpected delight with an intelligent screenplay, sensitive direction by Edwards and a 100-megawatt star performance by Jack Lemmon in the title role. The film wreaks of nepotism with Chris Lemmon playing their oldest son, Blake Edwards' daughter Jennifer and Andrews' daughter, Emma Waltoon also appearing as siblings in the family. There is even a cameo by Lemmon's real life spouse, Felicia Farr, as a fortune teller. The home of Blake Edwards and Julie Andrews is even utilized as the Fairchild family home in the film. Edwards, Andrews, and especially Lemmon fans should definitely give this one a look if they haven't seen it...a quiet, affecting drama that effectively blends the smile and the tear.",
         "Many people dislike this film because of its melodramatic sentimentality, but I love it because Lemmon's performance is near perfect. I say this because as we see Harvey Fairchild suffer a mid life crisis, we see Jack Lemmon, the actor, suffer. This film was made in the years when Lemmon was going through problems of his own, with drinking and among other things. Lemmon captured numerous demons through the performance of Harvey, plus I think the film is good in general. Robert Loggia is another favorite of mine and he, along with his Oscar nod in the same year for \"Jagged Edge,\" is simply wonderful as Harvey's friend and priest who drinks as people give their confessions. Sally Kellerman is also a delight.",
         "There are some movies you just get a good feeling about, and this (for me) is one of them. In every comment I've read here, though, no one mentioned the scene between Julie Andrews and Emma Walton, who are mother and daughter in real life and in the movie. Emma's character has just broken up with her boyfriend, and she spends the whole weekend in a bad mood until she finally breaks down crying and must be comforted by Julie's character. Lifetime channel, take note: sappy mother-daughter scenes work out best when you: 1-get real-life mother-daughter pairs and 2-let the mother (regardless of whether #1 is true or not) just speak from her heart. That's what Blake Edwards had enough sense to do, and it makes for one of the most touching mother-daughter scenes ever. Granted, Blake Edwards actually lived with these two people, so he may have had a better knowledge of their relationship and what would work, but most older actresses are mothers and could probably be capable of something similar. The rest of the film is great as well, with great performances all around, and a hilarious rambling from Jack at the beginning while he describes to Julie how his day at work went. This is the first movie that made my laugh and cry simultaniously (when Jack says he wanted to \"bicycle himself to death\"), and for that and the scene between Julie and Emma, watch this movie. It's way better than the box office will lead you to believe.",
         "\"That's Life\" is supposed to be a story about a man just on the other side of a middle age crisis on his way to a breakdown. It stars Jack Lemmon who plays middle aged men on their way to a breakdown better than anyone. Julie Andrews is his loving, supportive wife, who is going through a crisis of her own. Directed by Blake Edwards, I thought this movie had real potential and couldn't wait to get to the theatre to see it. It turned out to be a painfully dull family reunion picture for the Lemmon's and Edwards'. Populated with many of the stars actual children, \"That's Life\" feels as though you are seeing some type of home movie. Thanks, but I'll stick with my own. It's hard to feel compassion or sympathy with Harvey Fairchild (Lemmon), when he has a beautiful house, beautiful family that loves him, fancy suits, three martini lunches... you get the picture. But Harvey is helplessly self-centered. Oblivious to all going on around him. He cannot even be happy at the prospect of being a grandparent. Nor does he pick up the signals that his wife may be sick. Watching Lemmon, I thought that his performance was a cross of \"Days of Wine and Roses\" and \"Save the Tiger\". It's all been done before. He is certainly not helped with a lame script by Edwards. The only saving grace in this movie is Julie Andrews. Stoic, strong, and courageous in the face of her own problems, as well as having to be strong for Harvey. Her performance is the only well-rounded, realistic one in the film. As for the other members of the Edwards and Lemmon families, the less said the better. 4 out of 10",
         "Submitted for your approval, one Harvey Fairchild. Husband, father, successful architect, the very image of success. This dreamer, this lover of beauty, this citizen blessed by the limitless possibilities of the American dream finds himself on a fearful journey into the unknown. His face, his body, his very soul ravaged by years of hard drinking and a multitude of sins against Man and God, no longer a man ready for any challenge, his glowing vitality once taken for granted a thing of the past. Cut off from his own passion for transcendence, we find him snapping under the pressure of the world's ceaseless demands. His body in shambles, Harvey Fairchild sees no reason to \"celebrate\" another birthday. He realizes his life of three martini lunches, expensive suits, casual indulgence in extramarital affairs, and even gourmet food from his personal chef have produced no lasting enjoyment. Angry, bitter, frustrated, his spirit crushed by the impossibly high expectations of those around him, Harvey Fairchild is a man in turmoil, unable to face or even understand the modern world, a world, he is beginning to realize, unimproved despite his lifetime of futile exertions. This shipwrecked, tortured soul, burned alive and left for dead on the social, sexual, and economic battlefields of modern times, is forced to face the ever nearing crisis of his own mortality. To be or not to be, that IS the question! Whether 'tis nobler in the mind to suffer the slings and arrows of outrageous fortune, or to take arms against a sea of troubles, and by opposing, end them... (Hamlet, Act 3, Scene 1) The pathos! The humanity! Oh! The castle of a man's life crumbling before our eyes, the flags bearing the names of his highest ideals--Honor, Faithfulness, Charity, Love--fraying and fading in the merciless glare of Time's cruel tyranny, falling into the corrupt mud of a pitiless universe. The very fabric of Being permeated with decay. The transitory nature of pleasure, if such a thing exists at all. Knowing, yea truly KNOWING how suffering found its way into his superficially \"perfect\" life, it is no wonder Harvey Fairchild sees the arrival of his own grandchild as a monstrous joke--the unstoppable wheel of pain clicking forward another gear, all to the hideous laughter of the gods. Weighed down by his dark epiphany of Life's tragic nature and trapped with a family torn apart by rivalry and suspicion, his every attempt to numb the pain only intensifies an already volcanic situation. In vain, he lashes out at everyone around him, seeking to match the heartless cruelty of Existence with his own obscene rage. If we must live in Hell, at least let it be of our own making! Thus the story unfolds before the unblinking mechanical Eye of Hollywood. All the customary flash, glitter, and commercialism stripped away to reveal the agonizing, hopeless thrashings of a man born to die. Watch and learn, my friends. Weep, yes weep at the sacrifices we all must make to survive, desperately playing the cards we're dealt in a casino where the rules keep changing and the House always wins. And take a moment to remember the Harvey Fairchilds of this world who struggle blindly for some shred of dignity. Attention must be paid!",
         "This is a movie about life! The title fits perfectly. The wife is doing her best (as most do) to keep things on an even keel, balancing home, and work while going through a scary medical crises, alone. She cannot tell her husband, because he is selfishly going through his own \"age\" crisis. He is a hypochondriac who refuses to believe there is nothing wrong with him, and he feels he is a failure in every part of his life. They have children who have lives and careers of their own, and are not very close personally. I get the feeling he was never close to his children, and his wife always had to run interference between him and them. I feel she would have liked to have had a much closer relationship with her children, but, with such a self centered husband, that was impossible. This movie is funny, sad, pathetic, and very,very realistic.",
         "The part of Gillian, which Julie Andrews portrayed in \"That's Life,\" gave me a queasy feeling: here was a character who was suffering from a possible career-threatening throat ailment. The film was made in 1986. In real life, ten years later, Andrews would be experiencing a like situation, and two years thereafter awaiting results of a throat operation with parallel consequences. This was not unlike a similar feeling I got when Elizabeth Taylor underwent her well-publicized brain operation in 1997. I vividly recalled her 1959 role of Catherine in \"Suddenly Last Summer,\" in which the crux of that script was built around Catherine's receiving a brain operation. As fine as both of those performances were, the art vs. life aspects were equally as impressive, and unnerving.",
         "I found \"That's Life\" a really enjoyable film. Besides, there's Julie Andrews and Jack Lemmon, two wonderful actors. Try not to miss it !!!",
         "An interesting misfire. Director and co-writer Blake Edwards tries for an autobiographical touch in this family-laden drama, and was rightly accused of narcissism by the critics (who probably wouldn't have pounced so hard had the picture been made with a bit more flavor). 60-year-old architect in Southern California expounds on life's woes while his too-patient spouse deals privately with her own agonies. Although Jack Lemmon does get to spout off with some well-written (if familiar) tyrannies, and Julie Andrews is allowed to put in her much-needed two-cents near the finish, I felt Edwards' film was far removed from reality. It seems to exist in a poor-sports netherworld in which only the wealthy are unhappy. Perhaps it's time for Edwards to get away from the beach-front condos of Malibu and see how the other half lives. *1/2 from ****"
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Blake Edwards",
         "Delphi V Productions",
         "Paradise Cove Productions"
      ],
      "summaries": ["Harvey and Gillian Fairchild face a very difficult weekend. Harvey, celebrating his 60th birthday, is stressed and depressed. Gillian is awaiting the results of a throat biopsy. Their lives are further complicated by their three grown children, a ditsy neighbor, a fortune teller, and an alcoholic priest."],
      "budget": 0
   },
   "movielensId": 3465,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1986-10-10",
      "dvdReleaseDate": "2000-03-14",
      "directors": ["Blake Edwards"],
      "runtime": 102,
      "movieId": 3465,
      "title": "That's Life!",
      "mpaa": "",
      "actors": [
         "Jack Lemmon",
         "Julie Andrews",
         "Sally Kellerman",
         "Robert Loggia",
         "Jennifer Edwards",
         "Robert Knepper",
         "Matt Lattanzi",
         "Chris Lemmon",
         "Cynthia Sikes",
         "Dana Sparks",
         "Emma Walton",
         "Felicia Farr",
         "Teddy Wilson",
         "Nicky Blair",
         "Jordan Christopher"
      ],
      "imdbMovieId": "0092079",
      "originalTitle": "That's Life!",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["ffVP8MM9v_4"],
      "plotSummary": "A wealthy architect struggles with a severe case of male menopause at the approach of his 60th birthday.",
      "tmdbMovieId": 52961,
      "avgRating": 2.77586,
      "releaseYear": "1986",
      "numRatings": 87,
      "posterPath": "/qdaieih8EVIRRDdd3I6mGM4Iy1V.jpg"
   }
}