{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "afterlife",
         "id": 6155
      }],
      "imdb_id": "tt0107091",
      "video": false,
      "title": "Heart and Souls",
      "recommendations": [
         3064,
         2612,
         9089,
         25562,
         12772,
         9090,
         17795,
         17258,
         10631,
         14370,
         26255,
         24073,
         2928,
         10608,
         20096,
         26180,
         14550,
         15556,
         42580,
         16384
      ],
      "backdrop_path": "/3GOpPpHRM8rRstJFfwMOwfVR3NA.jpg",
      "revenue": 16589540,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Thomas Reilly",
               "gender": 2,
               "credit_id": "52fe44c79251416c75040a63",
               "name": "Robert Downey Jr.",
               "profile_path": "/1YjdSym1jTG7xjHSI0yGGWEsw5i.jpg",
               "id": 3223,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Harrison Winslow",
               "gender": 2,
               "credit_id": "52fe44c79251416c75040a67",
               "name": "Charles Grodin",
               "profile_path": "/8lHT8QePWTpSfw0DQJ5k8YUuZt1.jpg",
               "id": 28164,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Julia",
               "gender": 1,
               "credit_id": "52fe44c79251416c75040a6b",
               "name": "Kyra Sedgwick",
               "profile_path": "/udLKlspMdXSC9LMdhygL5rcJ4XI.jpg",
               "id": 26467,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Anne",
               "gender": 1,
               "credit_id": "52fe44c79251416c75040a73",
               "name": "Elisabeth Shue",
               "profile_path": "/44AaIXkbZFkdhSW1kRdzCbfYk6c.jpg",
               "id": 1951,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Milo Peck",
               "gender": 2,
               "credit_id": "52fe44c79251416c75040a6f",
               "name": "Tom Sizemore",
               "profile_path": "/soINOuacuiThRb2LyPD4tTWve7C.jpg",
               "id": 3197,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Penny Washington",
               "gender": 1,
               "credit_id": "52fe44c79251416c75040a9b",
               "name": "Alfre Woodard",
               "profile_path": "/aCAjUOrV2WG3OaLUvQHVkyk8S2P.jpg",
               "id": 1981,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44c79251416c75040a5f",
               "name": "Ron Underwood",
               "profile_path": "/6Que5sFtOzJ0q4D7vrFqG60sdzG.jpg",
               "id": 33485,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44c79251416c75040a79",
               "name": "Brent Maddock",
               "profile_path": null,
               "id": 26475,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44c79251416c75040a7f",
               "name": "Sean Daniel",
               "profile_path": null,
               "id": 7779,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe44c79251416c75040a85",
               "name": "Nancy Roberts",
               "profile_path": null,
               "id": 67021,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44c79251416c75040a8b",
               "name": "Marc Shaiman",
               "profile_path": "/aesoPh8jPR5qDKjjt7o5uj9kS3W.jpg",
               "id": 9251,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44c79251416c75040a91",
               "name": "Michael W. Watkins",
               "profile_path": "/3PepN0KsLEnLkZh72QXxyvu0d7C.jpg",
               "id": 40575,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44c79251416c75040a97",
               "name": "O. Nicholas Brown",
               "profile_path": null,
               "id": 16593,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 5.132806,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 12187,
      "vote_count": 107,
      "budget": 0,
      "overview": "A businessman is reunited with the four lost souls who were his guardian angels during childhood, all with a particular purpose to joining the afterlife.",
      "similar": [
         12159,
         251,
         1649,
         795,
         745,
         3064,
         4011,
         8967,
         8839,
         285,
         354912,
         12186,
         28162,
         397567,
         1551,
         1933,
         7980,
         228326,
         34647,
         44603
      ],
      "original_title": "Heart and Souls",
      "runtime": 104,
      "poster_path": "/rAdLIzWXcBbul2LRvcB1RARakge.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/7ZymELJwuWR4k5p0oeZ3d3WAhO3.png",
            "name": "Alphaville Films",
            "id": 11462,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Stampede Entertainment",
            "id": 3853,
            "origin_country": ""
         },
         {
            "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
            "name": "Universal Pictures",
            "id": 33,
            "origin_country": "US"
         }
      ],
      "release_date": "1993-08-13",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "The story of four souls who needed a body and one guy who needed some soul.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ron Underwood"],
      "runtime": 104,
      "synopsis": null,
      "writers": [
         "Gregory Hansen",
         "Gregory Hansen"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0107091/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ1MTI5MzI3Nl5BMl5BanBnXkFtZTcwMTQ0MTkxMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Robert Downey Jr., Charles Grodin, Alfre Woodard | See full cast and crew »"],
      "reviews": [
         "Robert Downey Jr. is wonderful as the man who became the medium for 4 people who died in a bus accident at the same moment the hero was born. As a child these \"friends\" were known only to him, eventually leading to psychiatric evaluations because parents, teachers et al insisted something had to be wrong with this child. While still a small child, the \"spirits\" decide it's time for him to be \"without his special fiends\"...until at about age 30 they suddenly make contact again. They need a favor; 4 favors. Each one of the foursome died before they could take care of some important unfinished business. In order to go to Heaven and rest in peace, their \"little friend\" would need to allow each of them to enter his body (since they are only souls) to accomplish their missions. The 4 scenarios are beautiful expressions of love and kindness, and although disrupting the young man's (love) life immensely, in the end he too is richer from the turbulence's. -- This is a wonderful fantasy, a big winner with romantic movie lovers. I have watched this film several times and will enjoy it again and again. The widescreen DVD version is particularly enjoyable. This is a sparkling gem of a movie!",
         "This movie has it all. I loved it the first time I saw it and still do every time I see it. The casting was perfect and the actors all have a wonderful chemistry together. I will never get tired of watching certain scenes, like the (last) stamp scene with Milo, when Penny realizes who the cop is and when Thomas hugs the cop (hilarious!!), when Thomas sings finally, when Milo has to say goodbye, there are just so many great scenes in this movie. And Robert Downey, Jr. just does a tremendous job - he is so talented. When the four spirits enter his body (at different times), it's amazing how well he portrays each one with such accuracy (especially as Penny), like he's really that person. The humor never misses a beat. This movie will probably always be in my top 5!!",
         "This was another winner in a fantastic year for movies: 1993. In fact, there were so many good movies in this year that films like this were buried. If you can just ignore the typically off-the-wall Hollywood version of death and heaven and just enjoy the wonderfully-sentimental and humorous fantasy- romance-drama story, you'll be very entertained. The story is nicely told, entertaining start-to-finish in its 103 minutes. It really takes off after Robert Downey Jr. has become an adult and the \"spirits\" return to him. As much humor as in here, in addition to fantasy and drama, the final 15-20 minutes are tear-jerking.",
         "Heart and Souls would have to be the most heart-warming, funny, tear-jerking, feel-good movie of all time. I can't understand why no-one I know has heard of it till I rave about it and insist they watch it. After several viewings I feel that Julia, Harrison, Penny and Milo are people I know and care about, and as for Robert Downey Jr, every time I watch it I pray that he straightens out his own life, such a waste of talent to be in and out of jail. Heart and Souls ranks up there, for me, with Baghdad Cafe, Five Easy Pieces and Wings of Desire.",
         "Robert Downey Jnr & the supporting talent have made this sheer magic and a thrill to relive whenever it's shown. The plots soars and soars and finally settles firmly in rediscovery. The four lost souls drift about not knowing their purpose though firmly tied to RDJ but they are without cause when they finally discover their unfulfilled purpose, they manage to use their their one earthly link to try and accomplish all they had unfinished on earth. Robert Downey Jnr sails ahead of the story and cast and it takes the wit, earthiness, sass and charm of Sizemore,Grodin,Woodward and Sedgwick respectively to keep up with him which they do without dominating or underplaying their roles. The underlying themes of repentance for Sizemore, personal victory for Grodin, rediscovery & bonding for Woodward and self forgiveness and sacrifice for Sedgwick are beautifully visited so much so that you're unaware of the depth till the the credits start rolling. The final scene was a fitting climax for this simple but deeply stirring movie. Never leave till tomorrow what you may able to do today,always live your dreams and follow your destiny but do so with your feet terra firma!!! Hearts And Souls scores soundly : 9/10",
         "I thoroughly enjoyed this movie. I laughed at its funny bits and cried in the sad bits. Robert Downey Jnr was excellent as the leading character and the bus passengers provided some light relief. Everyone should have friends like these! Marvellous!",
         "I never even knew this movie existed until they showed it on TV here ... and I'm so glad they did! If they hadn't, I'd have missed out on something great. The story was wonderful, not just a comedy, but a meaningful comedy ... with laughter, tears, ... it says a lot about life. This is one movie which deserves more recognition.",
         "\"Hearts and Souls\" is a pleasant and thoroughly enjoyable romantic comedy that I really didn't expect when I first watched the film years ago. Robert Downey, Jr. plays a young man whose life is going very well: he's engaged to Elisabeth Shue, he's got a lot of money working as a lawyer or such...until some old friends of his drop in--imaginary friends, that is. Sort of. Dead imaginary friends that only he can see. Many years ago, some people boarded a bus, including Charles Grodin and Tom Sizemore. The bus flipped over a bridge and everyone died, going to heaven. But then they came back down involuntarily to Downey as a child and stayed with him for a few years. Every time they tried to leave him, they were pulled back to him. Until he was about eight, then they somehow managed to leave because they were influencing his schoolwork and life (I don't remember how they got out of it). Now they're back to haunt him again, because they need him to help get to heaven. I haven't seen this movie in a few years, so I'm a bit rusty on the plot summary, but I remember that I found it enjoyable and sweet. There aren't any big complexities here, just some good old fashioned fun. Robert Downey, Jr. is convincing in his role, as is the rest of the cast. I've liked Charles Grodin and Tom Sizemore for quite some time, and they got to show off their talent here. Too bad Grodin left the showbiz scene, because I really did enjoy him in films. He wasn't over the top of crazy: he seemed very normal, and played very normal characters (\"Beethoven,\" \"Midnight Run\"). I think that this is the perfect example of romantic comedies that have both wit and respect for the audience. In a time of cheap teen flicks and so-called romantic comedies, the rare FUNNY romantic comedy that comes along is usually very good (\"When Harry Met Sally,\" \"Sleepless in Seattle,\" \"While You Were Sleeping,\" \"As Good as it Gets,\" etc.). While \"Heart and Souls\" isn't a great romantic comedy, it's above average, and definitely recommendable. 3.5/5 Stars",
         "Just call me a sentimental sap, but This one is one of my favorite movies. Robert Downey Jr., Alfre Woodard, Kyra Sedgwick, Charles Grodin, Elisabeth Shue, Tome Sizemore, Dave Paymer where all excellent! What a Great combination! I saw this movie before my youngest son was born and it made such a lasting impression on me that it caused me to make bedtime rituals with him (Prayer, and what he calls his Lu-Lu's (a song We made up)). I've seen this movie maybe a half dozen times and stop and wait any time I see that it's on TV. THis movie made me a Robert Downey Jr. fan, and it made me a little more sympathetic to his personal issues. I'm happy to see that he may have finally turned the corner on his recovery.",
         "In 1959, in San Francisco, the telephone operator Penny Washington (Alfre Woodard) leaves her three children to work in her night shift. The shy singer Harrison Winslow (Charles Grodin) is afraid of the stage and quits his audition. The waitress Julia (Kyra Sedgwick) is proposed by her boyfriend and she does not accept; then she regrets and leaves her job to seek him out. The smalltime thief Milo Peck (Tom Sizemore) tries to retrieve a valuable collection of stamps that he had stolen from a boy. They embark in a bus and the driver Hal (David Paymer) distracts while driving and has a serious accident, and driver and passengers die. Meanwhile, Frank Reilly (Bill Calvert) is driving his pregnant wife Eva Reilly (Lisa Lucas) to the hospital. Frank successfully escapes from the bus but Eva is nervous and delivers her baby in the car. The souls of the four passengers become the guardian angels and the invisible friends of the boy Thomas Reilly. Seven years later, Penny, Julia, Harrison and Milo conclude that they are harming the boy and they decide to become invisible also to him. Thirty and something years later, Hal returns with his bus to take them four and the quartet learns that they had all those years to resolve the issues of their lives. They ask Hal to stall and give some more time for them to resolve their unfinished lives and they decide to come back to Thomas (Robert Downey Jr.), who is now a tough businessman and indecisive in his relationship with girlfriend Anne (Elisabeth Shue), and ask him to help them to resolve their issues and become free souls. In the end, Thomas also becomes a better man. \"Heart and Souls\" is one of the most adorable films of the 90's. The writer uses the central idea of the successful \"Ghost\" (1990) to make a witty and delightful comedy, with state-of-art special effects in 1993. Kyra Sedgwick, Tom Sizemore, Alfre Woodard, Charles Grodin and Robert Downey Jr. show an amazing chemistry and they really seem to have fun while shooting this film. Kyra Sedgwick shows a beautiful smile and Robert Downey Jr. is hilarious. The cameo of B.B. King is a plus that gives the status of cult to this film. The message in the end is very nice and I do not recall how many times I have seen \"Heart and Souls\" on VHS in the 90's. Yesterday I saw it on DVD for the first time and I only regret that there are no extras, only the film. My vote is nine. Title (Brazil): \"Morrendo e Aprendendo\" (\"Dying and Learning\")"
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Fantasy",
         "Romance"
      ],
      "productionCompanies": [
         "Universal Pictures",
         "Alphaville Films",
         "Stampede Entertainment"
      ],
      "summaries": [
         "In 1959, in San Francisco, the telephone operator Penny Washington leaves her three children to work in her night shift. The shy singer Harrison Winslow is afraid of the stage and quits his audition. The waitress Julia is proposed by her boyfriend and she does not accept; then she regrets and leaves her job to seek him out. The smalltime thief Milo Peck tries to retrieve a collection of stamps that he had stolen from a boy. They embark in a bus and the driver Hal distracts while driving and has a serious accident, and driver and passengers die. Meanwhile, Frank Reilly is driving his pregnant wife Eva Reilly to the hospital. Frank successfully escapes from the bus but Eva is nervous and delivers her baby in the car. The souls of the four passengers become the guardian angels and the invisible friends of the boy Thomas Reilly. Seven years later, Penny, Julia, Harrison and Milo conclude that they are harming the boy and they decide to become invisible also to him. Thirty and something years later, Hal returns with his bus to take them four and the quartet learns that they had all those years to resolve the issues of their lives. They ask Hal to stall and give some more time for them to resolve their unfinished lives and they decide to come back to Thomas, who is now a tough businessman and indecisive in his relationship with girlfriend Anne, and ask him to help them to resolve their issues and become free souls. In the end, Thomas also becomes a better man.",
         "In 1959, four people, Milo, Harrison, Penny and Julia get on a bus. The bus driver got distracted and smashed the bus. Everyone on the bus dies. They're now spirits, the driver goes up, Milo, Harrison, Penny and Julia remain on Earth. At the same time, the Reillys, a couple who were on their way to the hospital because the wife is about to give birth. Gives birth right there to a boy. The four of them find themselves attached to their son, Thomas who for some reason can see them. When Thomas is seven and people think he is acting weird because of their presence, they decide to disappear. 25 years later, Thomas grows up and is slightly jaded businessman who has a girlfriend, Anne. One day a bus appears, driven by the driver who caused the accident that led to their death. He says he's come to bring them up. They're irate at him for what he did. But he says that they were given the chance to resolve their lives, which is why they were attached to Thomas because they need him to do what they can't. But they are not aware of this, so the driver thinks he can buy them some time so they can do their stuff. So first they have to make themselves visible to Thomas, which they do. But he stills feels bad that they \"deserted\" him. Eventually he agrees to do it. So he has to steal some stamps Milo stole from a boy for a crook, he then has to get Harrison to perform on stage because he has great stage fright, and he has to find out what happened to Penny's children but because it was during the 50s, all the records are sealed and to tell Julia's boyfriend whom she kept pushing away that she's sorry. But at the same time all of this actions threatens his relationship with Anne.",
         "Harrison, Penny, Julia, and Milo all have unfinished business in this life. Unfortunately they find themselves all aboard a city bus that takes a tumble causing their four early deaths. At the same time, Thomas is born and the spirits of the unfortunate four are delightfully intertangled with Thomas' consiousness. When the four discover that they are to use Thomas to finish their business here on earth, they learn of what was important to each one of them and Thomas learns a lesson too.",
         "In 1959, Milo, Penny, Julia, and Harrison board a bus that later crashes, and all of them die but do not go to heaven right away. A baby is born in town at the same moment the bus crashes. The four dead passengers are tied to the baby, who would be named Thomas. For some reason Thomas can see them, and Thomas grows fond of them but when people think that Thomas might have something wrong with him, they decide not to let Thomas see them, which devastates him. Thirty years later Thomas is all grown and a little jaded when it comes to letting people into his life, and the four of them are still with him even though he can't see them. One day they simultaneously appear to him, and stay by his side until each one completes the final task of their personal lives.",
         "A businessman is reunited with the four lost souls who were his guardian angels during childhood, all with a particular purpose to joining the afterlife."
      ],
      "budget": 0
   },
   "movielensId": 3466,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1993-08-13",
      "dvdReleaseDate": "1998-11-17",
      "directors": ["Ron Underwood"],
      "runtime": 104,
      "movieId": 3466,
      "title": "Heart and Souls",
      "mpaa": "PG-13",
      "actors": [
         "Robert Downey Jr.",
         "Charles Grodin",
         "Kyra Sedgwick",
         "Elisabeth Shue",
         "Tom Sizemore",
         "Alfre Woodard"
      ],
      "imdbMovieId": "0107091",
      "originalTitle": "Heart and Souls",
      "genres": [
         "Fantasy",
         "Drama",
         "Comedy",
         "Science Fiction",
         "Romance"
      ],
      "youtubeTrailerIds": ["t4YFsWqNPEs"],
      "plotSummary": "A businessman is reunited with the four lost souls who were his guardian angels during childhood, all with a particular purpose to joining the afterlife.",
      "tmdbMovieId": 12187,
      "avgRating": 3.45948,
      "releaseYear": "1993",
      "numRatings": 1197,
      "posterPath": "/rAdLIzWXcBbul2LRvcB1RARakge.jpg"
   }
}