{
   "tmdb": {
      "original_language": "fr",
      "keywords": [],
      "imdb_id": "tt0074718",
      "video": false,
      "title": "Jonah Who Will Be 25 in the Year 2000",
      "recommendations": [
         46994,
         70090,
         47430,
         4443,
         24588,
         46210,
         67535,
         47450,
         216658,
         69910,
         146521,
         46750,
         85924,
         4962,
         69911,
         23676,
         212596,
         148782,
         216729,
         139169
      ],
      "backdrop_path": "/mxdqUzEfpGo2chiG0C33jjtRXR4.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Mathilde",
               "gender": 1,
               "credit_id": "52fe45f6c3a36847f80e4991",
               "name": "Myriam Boyer",
               "profile_path": "/quLXmjxo9nGiTOPtqKonux2QeVq.jpg",
               "id": 120571,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Max",
               "gender": 0,
               "credit_id": "52fe45f6c3a36847f80e4995",
               "name": "Jean-Luc Bideau",
               "profile_path": "/q977v7I75dvrfR5iCms6XQiAS8V.jpg",
               "id": 38898,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Marie",
               "gender": 1,
               "credit_id": "52fe45f6c3a36847f80e4999",
               "name": "Miou-Miou",
               "profile_path": "/oqTRzZm0h7KDTQEy5K4DSskaBrm.jpg",
               "id": 4274,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Mathieu",
               "gender": 2,
               "credit_id": "59b5fa73c3a3682a84007a30",
               "name": "Rufus",
               "profile_path": "/bbMPwEFZaALc3VqBPZ8od2rmRuv.jpg",
               "id": 2407,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45f6c3a36847f80e498d",
               "name": "Alain Tanner",
               "profile_path": null,
               "id": 236362,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "57ffce2f9251411ad20015a1",
               "name": "Renato Berta",
               "profile_path": null,
               "id": 19054,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [],
      "popularity": 0.293467,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "CH",
            "name": "Switzerland"
         }
      ],
      "id": 42237,
      "vote_count": 4,
      "budget": 0,
      "overview": "The European equivalent of \"The Return of the Secaucus 7,\" this Swiss film looks at the lives of several men and women in their 30s as they confront the slim gains of the \"revolutionary\" sixties. Max, a dissatisfied copy editor; Myriam, a redhead into tantric sex; and Marie, a supermarket checker who gives unauthorized discounts to the elderly, search for renewed meaning on a communal farm. The title character, a six-year-old child, is the carrier of their hopes for the future.",
      "similar": [],
      "original_title": "Jonas qui aura 25 ans en l'an 2000",
      "runtime": 116,
      "poster_path": "/bILUr2F8FUDCZ6tK1hyBG6FDJH3.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [],
      "release_date": "1976-01-01",
      "vote_average": 8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Alain Tanner"],
      "runtime": 116,
      "synopsis": null,
      "writers": [
         "John Berger",
         "Alain Tanner"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0074718/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQxMTc5MjI4NF5BMl5BanBnXkFtZTcwNDY1NDMyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Myriam Boyer, Jean-Luc Bideau, Miou-Miou | See full cast and crew »"],
      "reviews": [
         "How was this film ever made? It presents many aspects of the left wing of politics genuinely, as they see themselves; not as reinterpreted through a capitalist middle-class filter or stereotype. Film has been such a capital intensive medium that it seems none ever get made without the approval of some millionaire or corporate backer, and that all structure themselves, and the worldviews they express, to win this approval; consequently people on the left get used to caricature or demonization as their only screen presence. Not so in \"Jonas...\". In a way the characters are archetypes, representing: sexual freedom, generosity and social consideration, intellectual expansiveness instead of reductionism, atheism, naturalistic identification, communality in spirit, stoicism etc; but I find identification with the characters easy. But it is not Utopian; the consequences for generosity of spirit in a greedy context are dramatized in the story of imprisonment and persecution. As with all good politics, the underlying message is not a mere power squabble; but a reflection on cosmic order, what the right tends to call \"spiritual\" concerns. The inflowing of people into the energy of the birth of Jonas and the disintegration of that unity after the event has transpired makes \"Jonas...\" a profoundly philosophic and satisfying story. After 30 years this is still one of my favourite movies.",
         "While Jonah is generally referred to as a comedy, it is not. It does have some, perhaps many, funny moments. Comedy is certainly a part of it. But the film is a serious and almost perfect meditation on the post-revolutionary era and what's in store for the future. It is also a document on the passage of time, the ways in which the world changes around us, the ways in which we as individuals evolve, or devolve. The different characters negotiate their existences in different ways, with different philosophies. The mood of the film is very sad, but in the gentlest way possible. There's a hope for the future, but it's not a big one. It's quite pessimistic. The musical score, by Jean-Marie Senia, is exquisite, one of the best ever written for the cinema. The camera moves beautifully. 10/10.",
         "This movie elegantly captures the zeitgeist of ca 1975, seen through individual lives of some Genevans who in minor ways attempt to keep the sparkle of rebellion alive while their dreams from 1968 fade away, facing the reality of the 1970s. Its blend of tongue-in-cheek comedy and melancholy sadness makes it impossible to forget once you've seen it.",
         "Nice, small, intellectual film that criticizes the political system of its time. Even though the situation hasn't changed much yet. It even more criticizes the consumer society and economy for its lack of humanity. It makes clear, that the government has complete control over the masses, over me and over you - we have nothing. Economy is going to eat itself up until chaos will rule again and nobody has control anymore. The characters in the film try to change something, but it seems to go nowhere. They have good intentions, but simply lack the power. Just as these characters, we also get suppressed by our government. This film is not just about Switzerland of France. It's about democracy and free market economy. The film can make people realize how hopeless our existence is. How decadent our lives are... Watching this film certainly isn't a waste of time. If you like your films a little more ambitious, it doesn't fail to entertain. And even if you can't begin \"doing\" anything with its message, the film is full of interesting facts about society and simply about the way it is. 9/10 for a smart, critical film that is able to change opinions and views. PS: If you ask yourself whether you should watch it on TV today, or not...DON'T MISS IT! BECOME SOMEONE ELSE!",
         "And I thought I was a radical activist in my student years of the late 60's. I was aware of rising social consciousness, rebellion against materialism and corporate greed. I was not aware back then how world wide the phenomenon was. I am still surprised when I find evidence that breaks with tradition and convention were going on in Poland, France, and well, yeah, Switzerland? And from the mid 70's on, I can relate to the pressures to find our place in a world of work - constantly seeking meaningful employment in a system that rarely reflects our new values. These characters, Organic Farmers, Creative History Professor, Sketcher of Animals, Proofreader, Grocery Cashier, and more are still seeking meaningful lives and relationships. Even in unorthodox sexual experimentation they seek meaningful respectful relationships. I am Labor. With my intellectual pursuits, study of French Language and foreign Cultures, Humanitarian Concerns, Respect for Nature - I thought I would be so much more in my life. As these characters, who seem to slowly accept the existential realities of that post 60's burst of Hope - we now pass those hopes on silently to our children.",
         "I first saw this film when it was new. When I saw the title in a local video store, I couldn't resist the chance to see it again on the eve of Jonah's 25th birthday. Some of the political rhetoric is dated, but in some ways it's amazing how little has changed. The film is in some ways about taking stock of one's life. And seeing it twice, almost 25 years apart, certainly helped me to do that.",
         "For a French-speaking American younger than Jonas would now be, I couldn't always easily connect with the collection of colorful individuals (among others, an unorthodox high school teacher, a couple of organic vegetable farmers, a laid-off type-setter, a disillusioned journalist, an eccentric cashier with a compassionate bent, and a redhead captivated by tantric sex) that got together in this film, post Paris manifestations of May '68, to share their frustrations, their ruminations and their fantasies. But the film chewed on heaps of intriguing controversial issues of the time - many lines taken directly from Octavio Paz and Pablo Neruda - which continue to stir emotion in any thinking, feeling individual. The film is also personal, full of heart and full of intellectual stimulation. It's melancholic and nostalgic, yet wistfully optimistic. Recommended to anyone interested in the provocative issues that fomented the famous student demonstrations around the world just a few years before this film was conceived.",
         "\"Jonah Who Will Be 25 in the Year 2000\" may be the only Swiss movie that I know about, but it's a great one. It focuses on several aging radicals and their realization that maybe the world couldn't eventually be like they had one day hoped for. They had participated in the 1968 uprising in Paris - and everything surrounding that - but are now trying to figure out where exactly they belong in this changing world of the 1970s. Alain Tanner really created something impressive here. We see how, although they understand that their goals were probably unattainable, they have not abandoned their political views. \"JWWB25ITY2000\" is what great film-making is all about.",
         "The end titles somewhat cheekily credit Jean Piaget and Jean Jacques Rousseau among others, but Jonah Who Will Be 25 in the Year 2000 has neither the philosophical heft nor the dry tone of the work of such thinkers. Instead, the film attempts to give its viewer a new perspective on contemporary society by portraying characters from various social strata and their failure to reconcile their idealistic outlooks with the harsh reality of a capitalist system. The film is structured as a series of disjointed scenes that gradually reveal a number of loosely connected narrative strands. Perhaps the most affecting strand is the one about Marie, a grocery store checkout girl who gives away as much food as she sells. Although some of her gifts to customers seem arbitrary, she also makes it a point to help elderly people with small pensions. Like several other characters, Marie herself is stuck with a menial job even though she seems to be capable of something more challenging and fulfilling. She even has to live in one country and work in another due to a scarcity of employment. Of course, her behavior is inevitably noticed and it garners her a harsh punishment. The same happens to an honest teacher who attempts to impart lessons about the failings of the capitalist way of life to high school children and (to a lesser degree) to the environmentalists who attempt to run an organic farm. The technical aspects of the film are fairly well handled, although some of director Alain Tanner's choices were puzzling. He frequently splices in real life footage and he also switches to brief monochrome shots at fairly arbitrary intervals. This seems to have been an attempt to add a Cinéma vérité feel to the venture, but whatever the reason for its implementation, it often falls flat. Still, there are some strangely affecting images here, particularly in the bicycle sequence that incorporates some of the film's only landscape shots to make the human built structures appear forlorn and dingy against the natural backdrop. Jonah Who Will Be 25 in the Year 2000 is captivating but uneven, thought provoking but not profound.",
         "Marcel, the newly elected history teacher in high school, starts his course with \"The structure of time\" in Alain Tanner's most famous film \"Jonas\". Starting not from history as substance (which he sees correctly as a manifestation of time), but with its \"shape\" in the sense of post-Einsteinian physics, he uses blood-sausage from his father's butcher store, forming a long pipe or a corridor which he asks one of his students to cut conforming with the ticking metronome on his desk. So do people \"create\" their time, by hazard \"splitting\" it into longer or shorter, but arbitrary pieces. However, taken the blood-sausage as a whole, one sees not only its continuum, but all the folds, creases and pleats: these dis-continua are what we call the \"events\", the events that need time and shape time at once. The sum of events in time we call history. Tanner's whole film is a complex example of how all these 68er people, now in a post-revolutionary confusion, try to understand the structure of time and their own position in it. Social critique philosophy is always existentialism, not on the trivial reason that a society consists of individuals, but because Being differs from existence by including the component of time into reflection. Since time cannot be structured by an individual alone, conflicts emerge, and conflicts are usually \"solved\" with fights and battles - as we know from history. However, a society in which conflicts can be analyzed into theses and anti-theses in order to be neutralized in syntheses, would be a society that is conscious that history starts with a metaphysics of time - as taught in the movie by Marcel. But Marcel loses his job, teaches in an old age home the \"Temps Des Cerises\", and history still starts with the enumeration of single battles - we have still not learned that the topic of history is not the fragile product of mankind - but the time and its structure."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Action Films",
         "Citel Films",
         "Société Française de Production (SFP)"
      ],
      "summaries": [
         "The European equivalent of \"The Return of the Secaucus 7,\" this Swiss film looks at the lives of several men and women in their 30s as they confront the slim gains of the \"revolutionary\" sixties. Max, a dissatisfied copy editor; Myriam, a redhead into tantric sex; and Marie, a supermarket checker who gives unauthorized discounts to the elderly, search for renewed meaning on a communal farm. The title character, a six-year-old child, is the carrier of their hopes for the future.",
         "Documentary-like social and family analysis, based on the lives of eight people who were together in 1968, and found themselves connected with Jonas, a child of that turning-point year for so many, and who will be 25 y-o in the far distant year 2000... They called themselves \"the minor prophets\", and the way they \"predict\" the future is by their daily, common lives."
      ],
      "budget": 0
   },
   "movielensId": 3473,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1976-01-01",
      "dvdReleaseDate": null,
      "directors": ["Alain Tanner"],
      "runtime": 116,
      "movieId": 3473,
      "title": "Jonah Who Will Be 25 in the Year 2000",
      "mpaa": "",
      "actors": [
         "Myriam Boyer",
         "Jean-Luc Bideau",
         "Miou-Miou",
         "Rufus"
      ],
      "imdbMovieId": "0074718",
      "originalTitle": "Jonas qui aura 25 ans en l'an 2000",
      "genres": [""],
      "youtubeTrailerIds": ["N8fhqHyRj6M"],
      "plotSummary": "The European equivalent of \"The Return of the Secaucus 7,\" this Swiss film looks at the lives of several men and women in their 30s as they confront the slim gains of the \"revolutionary\" sixties. Max, a dissatisfied copy editor; Myriam, a redhead into tantric sex; and Marie, a supermarket checker who gives unauthorized discounts to the elderly, search for renewed meaning on a communal farm. The title character, a six-year-old child, is the carrier of their hopes for the future.",
      "tmdbMovieId": 42237,
      "avgRating": 3.51695,
      "releaseYear": "1976",
      "numRatings": 118,
      "posterPath": "/bILUr2F8FUDCZ6tK1hyBG6FDJH3.jpg"
   }
}