{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "leap in time",
            "id": 4820
         },
         {
            "name": "suspense",
            "id": 9937
         },
         {
            "name": "serial killer",
            "id": 10714
         }
      ],
      "imdb_id": "tt0117468",
      "video": false,
      "title": "Retroactive",
      "recommendations": [
         24206,
         9636,
         10690,
         169644,
         267457,
         76171,
         42158,
         71456,
         21151,
         80346,
         392660,
         294538,
         49763,
         37019,
         7269,
         12236,
         26962,
         39128,
         83412,
         8875
      ],
      "backdrop_path": "/caFlSsy1TsjhlNF0STkGC2zV2pa.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Frank",
               "gender": 2,
               "credit_id": "52fe4514c3a368484e047399",
               "name": "Jim Belushi",
               "profile_path": "/AplV1ikSo3Zn93hhy5ht7Y7sQio.jpg",
               "id": 26485,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Karen",
               "gender": 1,
               "credit_id": "52fe4514c3a368484e04739d",
               "name": "Kylie Travis",
               "profile_path": "/rhVtN91Rf9NBZqZGCmJyDP4gUME.jpg",
               "id": 96043,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Rayanne",
               "gender": 1,
               "credit_id": "52fe4514c3a368484e0473a1",
               "name": "Shannon Whirry",
               "profile_path": "/ylaZzzKoz2Ajqxu4tqgPxALlDXp.jpg",
               "id": 81287,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Brian",
               "gender": 2,
               "credit_id": "52fe4514c3a368484e0473a5",
               "name": "Frank Whaley",
               "profile_path": "/ma1lgPwUHUlgdt9BIcIbEPjdx0h.jpg",
               "id": 11805,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Jesse",
               "gender": 2,
               "credit_id": "52fe4514c3a368484e0473a9",
               "name": "Jesse Borrego",
               "profile_path": "/cJkz421gRMJPWWMd7nLxgSuUZfY.jpg",
               "id": 58647,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Sam",
               "gender": 2,
               "credit_id": "52fe4514c3a368484e0473ad",
               "name": "M. Emmet Walsh",
               "profile_path": "/dLf79xlsmE40rog0gryjxsZJzml.jpg",
               "id": 588,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Truck Driver",
               "gender": 2,
               "credit_id": "52fe4514c3a368484e0473b1",
               "name": "Roger Clinton, Jr.",
               "profile_path": "/koUQ5MbvfA6PysH8orZpSqfS6kB.jpg",
               "id": 51707,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Trooper",
               "gender": 2,
               "credit_id": "578d5ab79251410848008011",
               "name": "Sherman Howard",
               "profile_path": "/x722T5hnCqS0y9AO7vdIqIBYgIz.jpg",
               "id": 54859,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Bud",
               "gender": 2,
               "credit_id": "578d5ae29251415407003cf3",
               "name": "Guy Boyd",
               "profile_path": "/ahvU3lBt1Ydauz8qOyWdz4RGnXa.jpg",
               "id": 19752,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Paul",
               "gender": 0,
               "credit_id": "578d5d16c3a3685b4400d184",
               "name": "Robbie Thibaut Jr.",
               "profile_path": null,
               "id": 1652960,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4514c3a368484e047383",
               "name": "Louis Morneau",
               "profile_path": null,
               "id": 65420,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4514c3a368484e047389",
               "name": "Michael Hamilton-Wright",
               "profile_path": null,
               "id": 96040,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4514c3a368484e04738f",
               "name": "Robert Strauss",
               "profile_path": null,
               "id": 96041,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4514c3a368484e047395",
               "name": "Phillip Badger",
               "profile_path": null,
               "id": 96042,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "578d5d87c3a3685b4400d1b2",
               "name": "David Bixler",
               "profile_path": null,
               "id": 60587,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "578d5dbe925141545700421d",
               "name": "Brad Krevoy",
               "profile_path": null,
               "id": 51702,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "578d5dfc9251416a2f0039b7",
               "name": "Michael Nadeau",
               "profile_path": null,
               "id": 115355,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "578d5ebfc3a3680d3400374a",
               "name": "Tim Truman",
               "profile_path": null,
               "id": 1102479,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 5.925997,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 26689,
      "vote_count": 52,
      "budget": 0,
      "overview": "A psychiatrist makes multiple trips through time to save a woman that was murdered by her brutal husband.",
      "similar": [
         274,
         39874,
         2832,
         948,
         10285,
         10781,
         12521,
         371608,
         984,
         9272,
         9411,
         5486,
         12662,
         10092,
         1359,
         1991,
         189,
         1949,
         10585,
         949
      ],
      "original_title": "Retroactive",
      "runtime": 91,
      "poster_path": "/cIWR7BgNyXqVbd3dB476xK9Obam.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/wOMD2jDmY6wU2oScXOEgq9hqeNN.png",
            "name": "Orion Pictures",
            "id": 41,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Cohiba Pictures",
            "id": 4561,
            "origin_country": ""
         }
      ],
      "release_date": "1997-01-01",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Louis Morneau"],
      "runtime": 91,
      "synopsis": null,
      "writers": [
         "Michael Hamilton-Wright",
         "Robert Strauss"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0117468/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkxODIwNDA3Nl5BMl5BanBnXkFtZTcwNDEyNzUyMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: James Belushi, Kylie Travis, Shannon Whirry | See full cast and crew »"],
      "reviews": [
         "Rating: *** out of **** A word of warning before the review: I highly recommend Retroactive and suggest you go out of your way to see it in widescreen because the numerous action scenes and breathtaking desert cinematography are cramped and a pain to watch in pan-and-scan. Relegated to a straight-to-video release, Retroactive is a smart and entertaining thriller that deserves a wider audience. The film features a relatively simple but clever premise: Superhottie Kylie Travis stars as Karen Warren, a police negotiator who's on vacation in Texas. She gets into a car accident and has to hitchhike with a somewhat odd, but seemingly friendly couple, Frank and Rayanne (James Belushi and Shannon Whirry). But everything goes horribly wrong when Frank discovers Rayanne has been cheating on him and he murders her right in front of Karen's eyes, who proceeds to run to the nearest building, a government-owned complex run by a single occupant, a scientist named Brian (Frank Whaley). There, he accidentally activates the time travel device he was working on, sending Karen back twenty minutes, just as she's been picked up by Frank. She then becomes determined to stop the horrible crime for occurring, but unfortunately, the body count grows even larger and she must go back again to prevent an even larger massacre. Retroactive's appeal holds mainly to sci-fi action fans. The plot has a lot of twists and turns, which keeps the film unpredictable and suspenseful. But the real treat is for action fans, who should strap in for an adrenaline-pumping thrill ride. From the moment Travis is sent back in time, the film deliver non-stop excitement. There are tense shootouts and fast-paced car chases, the latter of which boasts some of the most exhilarating stunts since The Road Warrior. From a visceral point-of-view, Retroactive surpasses most of Hollywood's recent summer blockbusters. The film still has its flaws, none of them surprisingly having to do with a sense of repetition, considering each action setpiece has the same basic setting and situation (car chase on a lonely desert highway, shootout at a gas station). Credit director Louis Morneau for keeping each sequence fresh and taut with suspense. The set-up may be the same, but the results and resolutions considerably differ. Rather, what I do have a problem with is some technical error during the shootouts. Belushi is shown firing a six-bullet revolver at one point, but clearly fires more than ten rounds. Another similar blatant miscalculation occurs again near the end. Plot holes and leaps of logic are expected in this kind of film, but the number of shots fired from a gun shouldn't be that hard to keep track of. As the film's tough heroine, the absolutely gorgeous Kylie Travis is refreshingly intelligent and strong-willed. She occasionally has trouble holding back that British accent of hers, but still comes across quite well (looks great in that black tank-top, too). James Belushi is a lot of fun as the psychotic villain, clearly relishing the over-the-top role, even though his character does lose menace through some ridiculous one-liners. Frank Whaley is quite good as the young scientist, hampered only by a single scene that requires him to forget the logic of his own device which Travis corrects him on. With blistering, fast-paced action and a fun story, Retroactive proves to be a highly enjoyable way to spend ninety minutes. Most of the running time features a tight tank-top and pants wearing Kylie Travis kicking ass, so that alone is enough to recommend the film.",
         "Interesting premise. If you could relive a moment that went wrong, how could you \"fix\" it? It's not as simple as it may seem, and that is the point. Karen relives the moment that went wrong numerous times and every time she tries to \"fix\" it, it gets even worse! Very enjoyable. It is the imperfect ways that she tries to fix things that ring true. James Belushi is convincing as a red-neck creep who has neither class nor morals. The fundamental premise (turning back time) is a real stretch. However, that is not a real drawback, since you only have time to ponder it in retrospect. Also, anyone who watches this will have their own ideas of how they would have \"fixed\" the problem. However even though it's not a perfect movie, it's still one that interestingly and entertainingly explores it's premise.",
         "I didn't! This movie is truly non-stop action, with the possible exception of during Frank's belt buckle joke. I can watch this movie everytime it's on. I remember it coming on once while I was visiting some peoples house and someone was passing through the living room just as it started, they stopped there, staring and didn't move from that spot until the credits rolled. This movie just keeps pulling you in, deeper and deeper, making you wonder where it's going to go next with all the twists and turns. Even with these plot twists and inside out/upside down turns, it's easy to stay up with what's going on.",
         "I had picked up the DVD at a store not knowing much about the film, and was surprised that the film was as good as it was. I like Belushi. I think he played this part very well. I had never heard of Kylie Travis before, but I thought she was very good in this film. I thought she played the tough woman part well. I like the movies where there's a tough heroine. Like the Alien movies. Of course, it didn't hurt that Kylie's good looking too. The plot was interesting. I won't divulge the rest of the movie, but suffice it to say, if someone likes adventure and science fiction together, this movie might fill the bill. If you find it at your local video store, I would suggest buying it and adding it to your collection. My summary is that it's a better than average film. I recommend it.",
         "This film is great from the first moment. I love James Belushi as a baddie. There are so many time travel films out there and this one is a stand out. Cinematography is beautiful. This film deserved to be shown on the big screen. If you are looking for a good film at the video story, Retroactive is an excellent rental title. No one will be disappointed.",
         "In the wake of an unfortunate incident which lead to six people losing their lives, smart, gutsy, but severely guilt-ridden hostage negotiator Karen Warren (strongly played by Kylie Travis) quits her job and goes driving cross country to get her head together. Problems arise when Karen wrecks her car in the middle of a swelteringly hot and empty stretch of barren Texas backroads. Karen's given a lift by foul, boorish, obnoxiously hostile and hot-tempered redneck psycho criminal Frank Booth (a fabulously forceful and flamboyant portrayal by James Belushi) and his timid, browbeaten wife Rayanne (a topflight turn by erstwhile 90's direct-to-video erotic thriller starlet Shannon Whirry). Frank kills Rayanne in a fit of rage when he finds out she's cheating on him. Karen narrowly avoids being bagged by Frank, seeking shelter in a secret government compound where token nerdy scientist Brian (a charmingly boyish Frank Whaley) is experimenting with time travel. Karen goes back twenty minutes in time and attempts to stop Frank from killing Rayanne with even more disastrous results. Bound and determined to get things right, Karen goes back in time again. And then again when things go even more awry ... Director Louis Morneau, working from a highly sharp-witted and imaginative script by Michael Hamilton-Wright, Robert Strauss and Philip Badger, ingeniously blends elements of a gritty crime thriller, a grungy road movie, and your basic ripping'n'rousing actionfest with a nifty central science fiction premise into an excitingly dynamic, absorbing and oftentimes literally explosive handy dandy multi-genre combo synthesis. The extremely exhilarating action sequences are staged with heart-stopping brio and ability, the suspense is dexterously stoked to the nerve-frying ninth degree, the admittedly funky special effects are used with laudable judiciousness, and the furiously forward-ho headlong pace never once flags or falters during the film's fiercely zesty 91 minute running time. George Mooradian's bright, sun-bleached cinematography adds considerably to the sweaty tension. Ditto Tim Truman's lively, rattling, pulse-pounding score. Kudos as well to the uniformly first-class acting from a swell cast. The always welcome and invigorating M. Emmet Walsh contributes a cogent cameo as a weaselly gas station proprietor. James Belushi's deliciously rip-roaring hog-wild histrionics as the dangerously volatile Frank are a riot to watch, injecting a hilariously crude'n'rude sense of black-as-coal humor to the generally serious proceedings. Most impressive of all is Kylie Travis' fiery performance as Karen, whose deep-seated need for redemption and exceptional bravery make her a very moving and sympathetic tragic heroine. A multiple award winning feature at numerous foreign fantasy film festivals, this bang-up terrific indie sleeper favorite deserves all the acclaim and accolades it has garnered abroad. It's a sheer delight that's eminently worthy of cult status.",
         "This movie has a fascinating premise- what if you could go back in time, and change what you've done? Would it make things better, or worse? Some of Jim Belushi's best acting is in this film- his \"stream of consciousness\" comments are a riot, and also horrifying, given their context. I've heard that he had just gotten out of a tough divorce, and the director let him ad lib at length, to really show the anger and madness in the character of Frank. Of course, the lingering camera shots of Kylie Travis flying through the air in her black tank top and tight pants do nothing to detract from the overall watchability of this action/psychodrama thriller. I'd give this one 8/10.",
         "Whoever came up with the title to this film should be taken to one side and taught a thing or two about movies. There is no getting away from the fact that the title is BAD! The title suggests that you are about to watch every bad sci-fi movie you have ever seen, but what lies behind the title is an entertaining time travel film which is actually quite good. James Belushi is quite good as the bad guy and Kylie Travis plays the feisty female cop well. There is great pleasure in watching the main characters failing miserably at changing their situation as they travel back again and again to fix things, when it seems all manage to do is make a bad situation worse. The ending is surprisingly downbeat and refreshingly rewarding, which makes a change for Hollywood these days. All in all not the best of films ever made, but if you just leave you critical faculties and high expectations at home you will be pleasantly surprised.",
         "Retroactive was an unusual movie title for this sci-fi flick, but made up for it. With only one real mainstream, recognizable name in the film it proved that the small guys can make a good movie too. Although a few points of this movie were poor, it was a good median-type film with that downplayed ending that was another aspect that set it apart from the usual Hollywood commando ending. Overall, I enjoy the idea of time machines and this was a practical way of approaching the idea. Kylie Travis takes the female lead with a feminine heroism; Shannon Whirry the abused, soft-spoken wife. Frank Whaley as the neurotic scientist plays the part just as well as the polar end of James Belushi as the loud-mouthed hired courier. If you want to see a few new faces and go on a ride back in time, rent Retroactive.",
         "A Chicago cop has car trouble on a remote Texas highway, but is picked up by a murderous man (James Belushi) and his tormented wife. Before she can do anything to stop it, Belushi has murdered several people, including his wife. The cop (Kylie Travis) escapes to the inside of the Superconducting Supercollider, and manages to go back in time to try to rectify the situation. Unfortunately, her first trips back in time cause more murders, not less. James Belushi shamelessly chews up the scenery in this one (or should I say shoots up), but Kylie Travis is wonderful in her role as the troubled policewoman. The film has an interesting time-travel premise which is similar to GROUNDHOG DAY and a certain STAR TREK NEXT GENERATION episode. Unfortunately, this means that we get to see Belushi murder the same people in slow motion multiple times. Still, if you overlook some of the silliness in the execution of the plot, the premise of the policewoman's dilemma is a compelling one. By the way, the SuperCollider is not out in the desert in West Texas, but underneath farmland in east Texas, and the area is not that deserted. Also, the US Government shut down the project several years ago because it was too expensive."
      ],
      "genres": [
         "Adventure",
         "Crime",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": ["Cohiba Pictures"],
      "summaries": [
         "Karen has to take a ride in Frank's car. He's travelling with his wife, on his way to sell computer chips, which he obtained illegally. He suspects his wife is being unfaithful and tragic things happen, following a discussion. Karen escapes, reaching a lab where a scientist has discovered how to go back in time, and she returns by accident some minutes before the violent events. Then she tries to make things better, but things tend to become worse, as time cycles keep being repeated.",
         "A woman, whose car breaks down on the highway, is picked up by a crazed stranger and his obviously threatened girl friend. Despite potential escape opportunities, she stays with the couple who is involved in some kind of unexplained thievery involving a computer disk. After a series of murders, including the girl friend, the woman manages to escape to a scientific lab where time travel is being experimented with. Here she asks to go back in time to try to stop the killings. Repeated attempts results in the same deaths.",
         "A psychiatrist makes multiple trips through time to save a woman that was murdered by her brutal husband."
      ],
      "budget": 0
   },
   "movielensId": 3474,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-01-01",
      "dvdReleaseDate": "1999-08-24",
      "directors": ["Louis Morneau"],
      "runtime": 91,
      "movieId": 3474,
      "title": "Retroactive",
      "mpaa": "R",
      "actors": [
         "Jim Belushi",
         "Kylie Travis",
         "Shannon Whirry",
         "Frank Whaley",
         "Jesse Borrego",
         "M. Emmet Walsh",
         "Roger Clinton",
         " Jr.",
         "Sherman Howard",
         "Guy Boyd",
         "Robbie Thibaut Jr."
      ],
      "imdbMovieId": "0117468",
      "originalTitle": "Retroactive",
      "genres": [
         "Science Fiction",
         "Thriller"
      ],
      "youtubeTrailerIds": ["dezQPotEYHU"],
      "plotSummary": "A psychiatrist makes multiple trips through time to save a woman that was murdered by her brutal husband.",
      "tmdbMovieId": 26689,
      "avgRating": 3.05839,
      "releaseYear": "1997",
      "numRatings": 137,
      "posterPath": "/n5wMjQC4n1KFqZ5JFN4J7gGd4wu.jpg"
   }
}