{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "cupcake",
            "id": 169151
         },
         {
            "name": "twenty something",
            "id": 169152
         },
         {
            "name": "gameboy",
            "id": 169160
         },
         {
            "name": "money bag",
            "id": 169161
         },
         {
            "name": "sidewalk",
            "id": 169171
         }
      ],
      "imdb_id": "tt0112950",
      "video": false,
      "title": "Empire Records",
      "recommendations": [
         9430,
         15037,
         9536,
         13342,
         11443,
         9611,
         15413,
         8873,
         2293,
         10878,
         9452,
         10642,
         9844,
         11310,
         10276,
         9571,
         2255,
         10218,
         11522,
         26255
      ],
      "backdrop_path": "/wShqFcDhw59Qm8l7sTylfOfwkmK.jpg",
      "revenue": 303,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Joe Reaves",
               "gender": 2,
               "credit_id": "52fe45779251416c750576db",
               "name": "Anthony LaPaglia",
               "profile_path": "/22sOEc37TsxxcnIl1XmucuW3IDl.jpg",
               "id": 57829,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Jane",
               "gender": 1,
               "credit_id": "52fe45779251416c750576df",
               "name": "Debi Mazar",
               "profile_path": "/8i1RkV4iIvTh6BXOgclylwZehEk.jpg",
               "id": 5578,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Rex Manning",
               "gender": 2,
               "credit_id": "52fe45779251416c750576e9",
               "name": "Maxwell Caulfield",
               "profile_path": "/x0lq13DjVXDmfvrTiuBVk7MRmxF.jpg",
               "id": 101908,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Corey Mason",
               "gender": 1,
               "credit_id": "52fe45779251416c750576ed",
               "name": "Liv Tyler",
               "profile_path": "/jDxaBShnipKE2wvRaHavTtZb0qk.jpg",
               "id": 882,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Debra",
               "gender": 1,
               "credit_id": "52fe45779251416c750576f1",
               "name": "Robin Tunney",
               "profile_path": "/oQGr5vfYbkarmJQmhGmSpIhSapL.jpg",
               "id": 17346,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Gina",
               "gender": 1,
               "credit_id": "52fe45779251416c750576f5",
               "name": "Renée Zellweger",
               "profile_path": "/aeUnfem148WrhpQcmiUuSRGhCYU.jpg",
               "id": 9137,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Mark",
               "gender": 2,
               "credit_id": "52fe45779251416c750576ff",
               "name": "Ethan Embry",
               "profile_path": "/btE5T04gKo8isQ2UekgXmZIMXmA.jpg",
               "id": 58019,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Berko",
               "gender": 0,
               "credit_id": "52fe45779251416c75057703",
               "name": "Coyote Shivers",
               "profile_path": "/fpbbMbIoQ0VgUDBBUTwdpKZ5nqQ.jpg",
               "id": 552457,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Warren",
               "gender": 2,
               "credit_id": "52fe45779251416c75057707",
               "name": "Brendan Sexton III",
               "profile_path": "/kQsOIQuGcqwdpolSEzLV7RfYVsV.jpg",
               "id": 2839,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Mitchell Beck",
               "gender": 2,
               "credit_id": "52fe45779251416c7505770b",
               "name": "Ben Bode",
               "profile_path": "/poIqF5jBLaY9ZqUk2dy7FjzNWbV.jpg",
               "id": 144165,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Lucas",
               "gender": 2,
               "credit_id": "52fe45779251416c7505770f",
               "name": "Rory Cochrane",
               "profile_path": "/nSwd3TTKPCgZyuO5DqGAzAXQUnF.jpg",
               "id": 51792,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "A.J.",
               "gender": 2,
               "credit_id": "586fab7fc3a3686dc20041df",
               "name": "Johnny Whitworth",
               "profile_path": "/xkeywGnloZXCsHjKz6eqbKoClrh.jpg",
               "id": 73589,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45779251416c750576e5",
               "name": "Allan Moyle",
               "profile_path": null,
               "id": 55790,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe45779251416c750576fb",
               "name": "Carol Heikkinen",
               "profile_path": null,
               "id": 65872,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 7.968004,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 13531,
      "vote_count": 234,
      "budget": 0,
      "overview": "The employees of an independent music store learn about each other as they try anything to stop the store being absorbed by a large chain.",
      "similar": [
         13950,
         296096,
         34016,
         13168,
         86555,
         13776,
         14022,
         249916,
         221488,
         16060,
         28141,
         340616,
         419887,
         338648,
         273962,
         363882,
         214632,
         476499,
         396728,
         300598
      ],
      "original_title": "Empire Records",
      "runtime": 90,
      "poster_path": "/dgIoujnLYHUM36M9zXNhxZLcovT.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Monarchy Enterprises B.V.",
            "id": 676,
            "origin_country": ""
         },
         {
            "logo_path": "/hNuGhsKVlmhnwSRcmOejDBDjh6w.png",
            "name": "New Regency Pictures",
            "id": 10104,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1995-09-22",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "They're selling music but not selling out.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Allan Moyle"],
      "runtime": 90,
      "synopsis": "Empire Records is a small independent record shop managed by Joe (Anthony LaPaglia). His employees are all high-schoolers and young adults. The store, like the employees, is eclectic and unique. The staff is very much a self-created family, with Joe as the reluctant and perpetually exasperated father figure. Joe selects Lucas (Rory Cochrane) to close the store for the first time. While counting the days receipts, Lucas discovers that Empire Records is about to be converted into a branch of Music Town, a large and generic franchise music store. Lucas has an epiphany, and in an attempt to save the store, takes the day's cash receipts to Atlantic City. While initially very lucky, he loses the entire amount. The next morning, Mark (Ethan Embry) and AJ (Johnny Whitworth) find Lucas asleep behind the store, still perched on his motorcycle, and quickly deduce that Lucas has made a grievous mistake while entrusted with the store money. Lucas adopts a bizarre, almost zen-like attitude towards his actions. AJ and Mark feign ignorance as to the missing money when Joe discovers the night deposit was never made, and the money is missing. Joe is distracted from dealing with this immediate crisis due to a scheduled publicity stunt. Rex Manning (Maxwell Caulfield), a pompous, fading pop singer, is due to arrive to sign autographs and promote his new album. No one is really looking forward to \"Rex Manning Day\" except cashier Corey (Liv Tyler), a overachieving student headed for Harvard University who has a schoolgirl crush on Rex, and plans to lose her virginity to him. Corey's friend and fellow cashier Gina (Renée Zellweger), a more adventurous and free spirit than Corey, encourages Corey in her pursuit of the much older Manning. Empire's owner, Mitchell Beck (Ben Bodé), arrives to collect the missing deposit, but Joe covers for Lucas and plays for time by handing Mitchell a bag full of loose receipts. AJ confides in Joe that he loves Corey, and has chosen Rex Manning Day as the day he tells her. Lucas returns and rather than show repentance or guilt, calmly and repeatedly insists that everything will somehow work out, much to Joe's growing confusion and frustration. Joe forbids Lucas to leave the store (or even the couch in the break room) until he is able to repay the $9,000. Deb (Robin Tunney), another store employee, arrives. She, as usual, is hostile and anti-social to the rest of the staff. She immediately locks herself in the bathroom, where she impulsively shaves her head. As she exits the bathroom, AJ sees that her wrists are bandaged and she admits that she attempted suicide. It's revealed that Berko (Coyote Shivers), a local rock musician and another store employee, has just broken up with her, but Deb insists that he wasn't the reason for her suicide attempt. A young shoplifter who identifies himself only as Warren Beatty (Brendan Sexton III) is apprehended outside the store by Lucas. Soon after, Rex Manning arrives with his assistant Jane (Debi Mazar). Manning is condescending toward Joe, the rest of the staff, and his fans. Corey, after demanding (at the top of her lungs) that she be allowed to bring Rex his lunch, awkwardly attempts to seduce him during his lunch break. When Manning responds with a crude pass, Corey runs off, crying in embarrassment. A lovesick AJ finally attempts to tell Corey how he feels about her. Corey, emotionally overwhelmed by her encounter with her idol, tells AJ that she cannot handle his admission. Crushed, AJ abandons his plan. When Corey later attempts to assuage AJ's feelings by telling him she doesn't think of his that way, he rebuffs her. In the meanwhile, both Joe and Berko attempt to reach out to Deb, who refuses to explain her behavior or the circumstances that led to her bandaged wrists. Deb buries herself in work, but is clearly upset. As the afternoon progresses, the plan to convert Empire Records into a Music Town is revealed, and Joe admits that he had hoped to buy Mitchell out. However, Joe will now have to use his money to replace what Lucas lost, and Empire Records is now doomed to become a Record Town. Joe finally pummels Lucas in frustration. The afternoon continues to spiral downward. Corey accuses Gina of encouraging her ill-advised behavior around Rex, implying Corey's effort to emulate Gina's promiscuity was Gina's idea and ultimately at fault for the failed seduction, and that Corey doesn't have to 'behave that way' around men. Outraged at the accusation and seeking to hurt Corey, Gina seduces Rex Manning, much to the horror of her friends. AJ attacks Rex, who leaves after getting in a lucky punch against AJ. When Corey confronts her, calling her a slut, Gina retaliates by revealing Corey's secret amphetamine habit, which helps her stay up all night studying. Corey has a hysterical episode and has to be physically restrained by Joe. Uncharacteristically, Deb shows sympathy towards the always perfect Corey having a near melt-down and helps calm her. Corey, after hearing about Deb's suicide attempt, arranges a \"funeral\" for her where all her friends gather around and say things that they love about her. Lucas reveals that Joe actually rescued him from the orphanage as a teen, and was trying to repay him for his kindness. Deb admits she tried (and failed) to kill herself with a disposable razor...with a moisturizing strip. During the mock funeral, \"Warren\" returns with a gun and holds up the store. Deb boldly confronts Warren, confusing him and distracting him from his plan, and the rest of the staff persuade Warren into admitting that he only returned because he because he felt kinship with the rest of the misfits in the store, leading Joe to offer him a job. After the police leave, Lucas admits defeat, and suggests calling Mitchell. However, his friends an co-workers (along with Jane, who has quit working for Rex), pool their resources to replace the missing money. Despite their best efforts, they are thousands short. Suddenly inspired, Mark runs out of the store and impulsively jumps in front of a news crew covering the hold up and announces a late night benefit party/concert to save Empire. Between AJ's art, various money raising efforts by the rest of the staff, a rooftop concert featuring Berko and Gina (who is finally fulfilling her longtime ambition to front a band), enough is made to replace the money Lucas lost. Joe and Lucas return the money to Mitchell, and promptly quit. Mitchell, appalled at the debacle and the prospect of managing the store without Joe, offers to sell it to him...cheap. Joe agrees. Corey tells AJ that she really does love him too, but that she now hates him for waiting so long to tell her how he felt. AJ tells her he has quit the store, and has been accepted to an art school in Boston, and they finally kiss. Underneath the closing credits, Mark and a local pizza restaurant employee and friend, Eddie, discuss music while sitting on the curb outside the store.",
      "writers": ["Carol Heikkinen"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0112950/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE5NzgxODA2OV5BMl5BanBnXkFtZTcwMDE4NjUxMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Anthony LaPaglia, Debi Mazar, Maxwell Caulfield | See full cast and crew »"],
      "reviews": [
         "with the recent release of the special edition dvd of this film, i'd suggest you go watch it. yeah, this movie is a light, fluffy gen-x teen movie with its music video moments. however, what was eight years ago just a normal teen movie has gained some semblance of social relevance -- compared to today's teen movies, this film can be seen as some sort of masterpiece. for one thing, you never see films anymore where teens are actually fighting for something except for a date to the prom. the characters in empire records, yes, are submerged in their overdramatic romantic escapades, but their main prerogative in the film is to prevent a large corporation from buying out their independent record store. are there films that spark that kind of activist spirit in middle- and high- schoolers today? no. we're going backwards. also, the humor in this film offers up some absurdist wit, which you never find in teen movies now. a kid glues some quarters to the floor so he can laugh at the poor saps who later try desperately to pick them up. a shoplifting teenager gives the fake name of 'warren beatty'. do kids today even know who warren beatty is? i doubt it. this film was made in 1995, right before many of the laws allowing corporations to buy and control multiple media outlets were passed. the years since '96 have shown us a homogenization of music and movies, especially in the teen sphere, and it is turning today's teens into a bunch of celebrity-obsessed idiots. compared to your sons and daughters, the kids in empire records can be now seen as role models.",
         "I love this movie. This movie is the kind of movie I watch movies for (um....did you follow that?). I would make one suggestion, however....watch it twice before you decide if you like it or not. If you're like me you'll probably be lukewarm the first time you see it but like it more each time you see it after that. The reason for seeing it twice is because the film's strong points become more evident the second (and beyond) time around. Each character is well-defined, with individual traits and idiosynchracies, but this can be lost the first time through because you're trying to follow the story. There is a very strong soundtrack for the movie, but you appreciate it more the second time through, because you better understand how the music applies to the scene. The actors have great chemistry and the character interactions are great. The movie never takes itself very seriously and it's just a lot of fun to watch. You'll find yourself rewinding it to see certain scenes again and again. I grant you the movie will never win any Academy nominations. The plot is simplistic and the \"neat\" ending (all problems solved perfectly in just one day) is unrealistic (not that this bothered me....I personally loved the ending....if I want \"reality\" I'll watch the evening news). Also, trying to follow the storyline tends to take away from the character interaction the first time you see it; hence, the suggestion to see it at least twice. I actually didn't care for it the first time I saw it because I was looking at it strictly story-wise. The second time I saw it I concentrated on the characters and the dialogue(which I loved), and that's when I realized the appeal. If you're into serious movies that reflect real life and real suffering, you'll probably want to pass on this one. However, if you watch movies to have fun and laugh, watch this one. Also, if you like music- especially a moderately wide variety- you'll enjoy it. It's worth your time, but save the beer for the second viewing. \"Sugarhigh\" is awesome- Well done, Gina! Hot voice.... Oh, and Damn the Man! 9 out of 10.",
         "For me, Empire Records is a very conflicting movie. On the one hand, it's hysterically funny. On the other hand, it attempts to make great revelations about America's youth. Somehow, though, it all works! Sure, there are some \"sappy\" predictable parts that you're not sure whether to laugh or cry at, but the timing of these scenes is fantastic. One thing that really struck me about this film is the amazing use of music. Certain songs can be heard repeatedly throughout the movie which really help to distinguish parallel story lines. All in all, I think it's great.",
         "This movie is awesome. The best thing is the music. Excellent. It's the greatest collection of songs put into a movie. Even better than Pulp Fiction. There should be a BEST COMPILATION Oscar given to a music supervisor. That's hard but in this kick-ass movie, it seems so effortless. The acting is also top-notch. Renee Zellweger, Liv Tyler, Anthony LaPaglia, Robin Tunney, Johnny Whitworth, Max Caulfield, Debi Mazur, and Rory Cochrane, one of the coolest people alive. The script is really good. Directing, also good. Everything was pretty invisible, and I absolutely mean that in a positive way. Just like in the old days, when it was invisible, they put you in the movie. I felt like I was with these characters the whole way. The new \"Remix! Special Fan Edition\" is probably better. I can't decide. They're both superb. 10/10",
         "This movie follows the stories of many people who work at Empire Records, a music store on the brink of closing. All the characters are memorable, even the boy who steals a CD and is caught and hit by the door of a car. The drama, comedy, and music work well together all around. Liv Tyler really impressed me in her role. She was very convincing as an intelligent young lady on her way to Harvard. All the actors were great in their roles and I can't imagine anyone else taking their places. And the soundtrack is AWESOME!!!!! :) All-in-all a cute film that you can watch again and again.",
         "I love this movie very much. I don't own a lot of movies but this is one that I do. Like any film, it has it's problems but in general it is great. The film was well casted, each actor fit and made the best of his or her role. Maxwell Caulfield played Rex Manning, the character you love to hate. Anthony LaPaglia played Joe who was one of the best managers that you could work for. The actor's attitude toward his role was very well displayed. Rory Cochrane played Lucas, who is my favorite character in this movie. Then there is Johnny Whitworth, now everybody sort of disinclueds him or doesn't like him but I think that he did a good job as AJ, I could not see anyone else there, maybe someone could have done a better job but he did well. The rest of the cast was fantastic. The plot of the film was a little non existent, it's more like a series of events that just go one after the other with no really flow. Anyways, take the movie for what it is: teenagers working at a record store, dealing with life issues with good music playing in the background. This is a great film.",
         "I had heard a lot about this movie, that it was one of those really great but under-appreciated 90's movies, so I decided to watch it. It is now one of my favorite movies and I'm really glad that I saw it. Every actor does a great job - they make you feel like you've known them forever and you really go through the troubles that they are going through. I especially liked Ethan Embry as Mark and Johnny Whitworth as A.J. I was really surprised with how well Liv Tyler acted the part. The characters themselves are really relate able, and made me want to work at that store so badly. Also, it had one of the best soundtracks I have ever heard. I loved how they incorporated the music into each scene - it was part of what was going on, not just background noise. Overall, this was a really great movie - ***** out of 5.",
         "This is a films that you can easily watch over and over again and not get sick of. If you are a teenager and havent seen this.. where have you been. Go rent this baby today. This film reminds me of my days working in a certian franchise doing little as possible and slacking off at any time possible. AHHH those where the days..... The acting overall is quite good and along with the pumping soundtrack makes this a joy to watch. GO GET THIS NOW!!!",
         "what are you talking about, this film is great. the characters ARE just slacker idiots, thats the point, it means more people can possibly identify with them. the soundtrack is amazing too and the use of it is done best in this film since possibly pulp fiction, the music in most film is just used as background noise, in this film it is part of it and is used to emphasise the story. thisis th ebest film ive seen in ages and i watch alot of movies.",
         "Empire Records is directed by Allan Moyle and written by Carol Heikkinen. It stars, Anthony LaPaglia, Maxwell Caulfield, Debi Mazar, Johnny Whitworth, Liv Tyler, Renée Zellweger, Rory Cochrane, Robin Tunney & Ethan Embry. Plot centre's on one day at independent record store Empire Records. With the store under imminent threat of a take over by a corporate chain, this is no ordinary day. For on the day that the store will be visited by a fading pop star, they are forced to confront their personal issues, and maybe, just maybe, learn something about the people they work with. The film was a box office failure and was met with mostly negative reviews from the professional critics. Coming as it does from the director of critical/cult darling Pump Up the Volume, many were expecting a better and more hard edged picture than what they got. It also had to compete with certain 80's favourites brought to the cinematic world by John Hughes. While coming fast on the heels of the immensely popular Clerks (94) didn't help its cause either. Was it a case of bad timing? Is the film really just poor? And or, as mooted at the time: a career killer for those involved? Personally I think it's a film that needs revisiting now some 15 odd years after its release. In fact time has actually been kind to it and it now appears to have a good solid cult following. So unless you are judging it against the superior, record shop set, High Fidelity, you may find it's a film that's hard to dislike. Some of the complaints against it are fair, with the main one about it not having fully developed characters being as true as day is a day. While calling it one long stitched together music video has some substance when taking it at face value. Yet what is there is worthy of a second glance, they are interesting characters, and their respective hang-ups and pressures are evident enough for us to hang our hats on; even if it's set up to be accompanied by still more hipster indie rock music. There's also been much guff written about the film as regards calling it a teen angst film. Yes it is, but have these reviewers forgotten about the adults in the movie? LaPaglia's store owner, the father figure, trying to remain cool as his charges come under threat. Or Mazar, needing a wake up call from her job/career ignorance; and the big one, the delightful Caulfield (splendid bit of casting) as fading pop singer Rex Manning, imposter? Indeed. It's all relative as to why Empire Records deserves more than a once only viewing. As for the music, it does indeed rock, with each track carefully selected to be at one with the scene it accompanies. My favourite? AC/DC-If You Want Blood, a ball busting track for a vibrant and kicking scene. As for it being a career killing movie? The ladies of the piece have done rather well for themselves, Zellweger, Tunney and Tyler have made their marks in the industry, while Mazar has never been without work prior or post Empire Records. The guys haven't hit the heights of Zellweger and Tyler, which in the case of the excellent Rory Cochrane is not only a surprise, but also sad. Cochrane's Lucas is the key character and the glue in the middle of it all, always on hand with a dry quip or some philosophy, he's also supremely cool. Cochrane can be seen in serious mode leading 2006 thriller Right at Your Door. LaPaglia has always worked since 95, playing a number of different supporting characters, and Embry has appeared in big release's such as Vacancy and Eagle Eye. Caulfield has turned into the go to guy for TV shows and Whitworth, who quit acting for a while, pops up from time to time in minor roles such as in 3:10 To Yuma and The Rainmaker. So, not a career killer then. Stick it to the Man, Baby, Empire Records is a vibrant and funny movie. 7.5/10"
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Music"
      ],
      "productionCompanies": [
         "Monarchy Enterprises B.V.",
         "New Regency Pictures",
         "Regency Entertainment"
      ],
      "summaries": [
         "A day in the life of the employees of Empire Records. Except this is a day where everything comes to a head for a number of them facing personal crises - can they pull through together? And more importantly, can they keep their record store independent and not swallowed up by corporate greed?",
         "Empire Records is going to be turned into a Music Town. It is up to the wacky employees to figure out a way to raise enough money to help their boss Joe keep the store from changing hands. They also deal with problems amongst themselves, love, and a has-been spoiled rock star named Rex Manning.",
         "The employees of an independent music store learn about each other as they try anything to stop the store being absorbed by a large chain."
      ],
      "budget": 0
   },
   "movielensId": 3477,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-09-22",
      "dvdReleaseDate": "2003-06-03",
      "directors": ["Allan Moyle"],
      "runtime": 90,
      "movieId": 3477,
      "title": "Empire Records",
      "mpaa": "PG-13",
      "actors": [
         "Anthony LaPaglia",
         "Debi Mazar",
         "Maxwell Caulfield",
         "Liv Tyler",
         "Robin Tunney",
         "Renée Zellweger",
         "Ethan Embry",
         "Coyote Shivers",
         "Brendan Sexton III",
         "Ben Bode",
         "Rory Cochrane",
         "Johnny Whitworth"
      ],
      "imdbMovieId": "0112950",
      "originalTitle": "Empire Records",
      "genres": [
         "Music",
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["uvIsvZlk4GE"],
      "plotSummary": "The employees of an independent music store learn about each other as they try anything to stop the store being absorbed by a large chain.",
      "tmdbMovieId": 13531,
      "avgRating": 3.39528,
      "releaseYear": "1995",
      "numRatings": 3180,
      "posterPath": "/dgIoujnLYHUM36M9zXNhxZLcovT.jpg"
   }
}