{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "lover (female)",
            "id": 1808
         },
         {
            "name": "talent",
            "id": 2276
         },
         {
            "name": "mafia boss",
            "id": 6220
         },
         {
            "name": "author",
            "id": 10818
         },
         {
            "name": "playwright",
            "id": 10965
         },
         {
            "name": "broadway",
            "id": 156028
         },
         {
            "name": "1920s",
            "id": 207876
         }
      ],
      "imdb_id": "tt0109348",
      "video": false,
      "title": "Bullets Over Broadway",
      "recommendations": [
         11448,
         30890,
         28384,
         9684,
         11562,
         10569,
         2639,
         15867,
         9716,
         8217,
         10440,
         12762,
         10849,
         11337,
         22478,
         22477,
         19200,
         8288,
         11561,
         9466
      ],
      "backdrop_path": "/8VQdlFcdUdDSBzNVlhSMFxtT1DW.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "David Shayne",
               "gender": 2,
               "credit_id": "52fe44359251416c7502c8c9",
               "name": "John Cusack",
               "profile_path": "/uKydQYuZ9TnCzvbQLtj6j98vWAT.jpg",
               "id": 3036,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Helen Sinclair",
               "gender": 1,
               "credit_id": "52fe44359251416c7502c8cd",
               "name": "Dianne Wiest",
               "profile_path": "/sWm7Oar69rHGJzKgcP4iutwUmLb.jpg",
               "id": 1902,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Olive Neal",
               "gender": 1,
               "credit_id": "52fe44359251416c7502c8d1",
               "name": "Jennifer Tilly",
               "profile_path": "/bNB0BTnPAdAAHuCQSprMk4smBMD.jpg",
               "id": 7906,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Cheech",
               "gender": 2,
               "credit_id": "52fe44359251416c7502c8d5",
               "name": "Chazz Palminteri",
               "profile_path": "/d9VkmkEO50zP0kww6aLLFpu5Ovh.jpg",
               "id": 9046,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Ellen",
               "gender": 1,
               "credit_id": "52fe44359251416c7502c8fd",
               "name": "Mary-Louise Parker",
               "profile_path": "/3e72qs1QuqMlpieIm2JZtX1WNg2.jpg",
               "id": 18248,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Julian Marx",
               "gender": 2,
               "credit_id": "53d0aa54c3a3687771009a75",
               "name": "Jack Warden",
               "profile_path": "/pD98exbwlD4f9QmQd0N8Sa7j6pw.jpg",
               "id": 5251,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Sheldon Flender",
               "gender": 2,
               "credit_id": "52fe44359251416c7502c907",
               "name": "Rob Reiner",
               "profile_path": "/2zw9Iq9uo4vZiTQNQWdNFwbA1TA.jpg",
               "id": 3026,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Eden Brent",
               "gender": 0,
               "credit_id": "52fe44359251416c7502c90b",
               "name": "Tracey Ullman",
               "profile_path": "/mwaLg97HsIyoxOgdqEnyQVR0bBv.jpg",
               "id": 30364,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Nick Valenti",
               "gender": 2,
               "credit_id": "52fe44359251416c7502c90f",
               "name": "Joe Viterelli",
               "profile_path": "/3HhSpMcoWk4fucH6DSTU66x2D0g.jpg",
               "id": 60023,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Warner Purcell",
               "gender": 2,
               "credit_id": "53d0aa6bc3a368777a009831",
               "name": "Jim Broadbent",
               "profile_path": "/50TV6UKJKjmqdn1GQNuuCIYHLzP.jpg",
               "id": 388,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Sid Loomis",
               "gender": 2,
               "credit_id": "52fe44359251416c7502c913",
               "name": "Harvey Fierstein",
               "profile_path": "/eh53YLoB8SeTUD0prET8lCo0Cfo.jpg",
               "id": 7420,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Lorna",
               "gender": 1,
               "credit_id": "5a64b77b0e0a2619fb0276a0",
               "name": "Edie Falco",
               "profile_path": "/3cPF1o5oag20UXtCYkZeCTtcTFx.jpg",
               "id": 36190,
               "order": 11
            },
            {
               "cast_id": 21,
               "character": "Violet",
               "gender": 1,
               "credit_id": "5a64b788c3a3687fa3022ae7",
               "name": "Debi Mazar",
               "profile_path": "/8i1RkV4iIvTh6BXOgclylwZehEk.jpg",
               "id": 5578,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44359251416c7502c8db",
               "name": "Woody Allen",
               "profile_path": "/wpcOUlaszvJoVRf1yLbDtu7u4FI.jpg",
               "id": 1243,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44359251416c7502c8e1",
               "name": "Robert Greenhut",
               "profile_path": null,
               "id": 3658,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44359251416c7502c8e7",
               "name": "Douglas McGrath",
               "profile_path": "/A5O1d5Zo3RJ7p1yvT7fjMS4B7UH.jpg",
               "id": 32983,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44359251416c7502c8ed",
               "name": "Woody Allen",
               "profile_path": "/wpcOUlaszvJoVRf1yLbDtu7u4FI.jpg",
               "id": 1243,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe44359251416c7502c8f3",
               "name": "Susan E. Morse",
               "profile_path": null,
               "id": 10440,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44359251416c7502c8f9",
               "name": "Carlo Di Palma",
               "profile_path": "/i9bOfpLR2V68gGYv0yqJkjF6qiT.jpg",
               "id": 15194,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44359251416c7502c903",
               "name": "Charles H. Joffe",
               "profile_path": null,
               "id": 6993,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "571946b2c3a3680160004f38",
               "name": "Santo Loquasto",
               "profile_path": null,
               "id": 23966,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 9.395392,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11382,
      "vote_count": 169,
      "budget": 0,
      "overview": "Set in 1920's New York City, this movie tells the story of idealistic young playwright David Shayne. Producer Julian Marx finally finds funding for the project from gangster Nick Valenti. The catch is that Nick's girl friend Olive Neal gets the part of a psychiatrist, and Olive is a bimbo who could never pass for a psychiatrist as well as being a dreadful actress. Agreeing to this first compromise is the first step to Broadway's complete seduction of David, who neglects longtime girl friend Ellen. Meanwhile David puts up with Warner Purcell, the leading man who is a compulsive eater, Helen Sinclair, the grand dame who wants her part jazzed up, and Cheech, Olive's interfering hitman / bodyguard. Eventually, the playwright must decide whether art or life is more important.",
      "similar": [
         1574,
         30197,
         1421,
         705,
         32489,
         1816,
         31777,
         5816,
         265610,
         482262,
         270352,
         15810,
         265600,
         265613,
         409191
      ],
      "original_title": "Bullets Over Broadway",
      "runtime": 98,
      "poster_path": "/tfplmiNdTDHHbZZ8AGmXBiB1xJj.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/sNhxHhbyJ0xo52nr9xI2cJKkWFO.png",
         "name": "Miramax Films",
         "id": 14,
         "origin_country": ""
      }],
      "release_date": "1994-10-14",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Woody Allen"],
      "runtime": 98,
      "synopsis": null,
      "writers": [
         "Woody Allen",
         "Douglas McGrath"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0109348/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI2MDU5NTgyM15BMl5BanBnXkFtZTYwMTEwNjc5._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: John Cusack, Dianne Wiest, Jennifer Tilly | See full cast and crew »"],
      "reviews": [
         "In 1920's New York a young author, David, manages to get his play off the ground with funding from mobster Valenti. The money allows David to get actors of the caliber of Helen Sinclair and Warner Purcell, however there's a catch. Valenti wants his screechy girl friend Olive to play a key part. This problem is compounded by Olive's minder Cheech who has plenty of constructive criticism on how the play could be better. David tries to balance all these in the name of art. It's rarely new ground that Woody Allen walks \u0096 but how come he manages to make it so damn sparkly and witty? Here he delivers wonderful spoof on theatre people and the assumptions we all make about characters based on what they do or how they talk. The writing is spot on, Allen delivers tonnes of great lines but also creates characters that he expands over the film. It is very watchable and it rarely suffers from the fate on some of Allen's recent comedies \u0096 feeling too light or whimsical for it's own good. Instead it is funny but has some points to make. Of course it always helps if you have a great cast and this does. With people like Warden, Broadbent, Wiest, Tilly, Parker, Fierstein, Reiner, Falco and Palminteri it's hard not to have at least the majority of the cast giving good performances \u0096 Wiest, Tilly and Palminteri were my favourites. Cusack was good as the overpowered writer but the one thing I didn't like is the same with many actors who do the traditional Woody role \u0096 he gives a slight impression at times rather than cutting out the role as his own. Overall Woody Allen may not be everyone's cup of tea \u0096 but for fans this is him at his whimsical best. Not a classic comedy but a warm Allen film that sparkles in nearly every scene.",
         "Sadly, I've been let down by most of Woody Allen's recent comedies. So it was most rewarding indeed to see the Woodman back again true to form (after a lengthy drought) with 1994's Bullets Over Broadway.\" Fun, foamy, and clever, it has everything we've come to love and expect from the man. While \"Take the Money and Run\" and \"Bananas\" first turned trendy audiences on to his unique brand of improvisational, hit-and-miss comedy episodes, and the more neurotic, self-examining cult hits like \"Annie Hall\" and \"Manhattan\" cemented his Oscar-winning relationship with Hollywood, the comedy genius has stumbled mightily in this last decade. Attempting to contemporize his image with the coarse, foul-mouthed antics of a Coen or Farrelly brother (see \"Mighty Aphrodite\") is simply beneath him, and has been about as productive as Stevie Wonder taking a turn at hip-hop. Moreover, casting himself as a 65-year-old romantic protagonist with love interests young enough to be his grandchildren (see \"Curse of the Jade Scorpion\") has left a noticeably bad aftertaste of late. With \"Bullets Over Broadway,\" however, Allen goes back to basics and wisely avoids the pitfalls of excessive toilet humor and self-aggrandizing casting, and gives us a light, refreshing bit of whimsical escapism. Woody may not be found on screen here, but his presence is felt throughout. Though less topical and analytical than his trademark films, this vehicle brings back a purer essence of Woody and might I say an early innocence hard-pressed to find these days in his work. John Cusack (can this guy do no wrong?) plays a struggling jazz-era playwright desperate for a Broadway hit who is forced to sell out to a swarthy, aging king-pin (played to perfection by Joe Viterelli) who is looking to finance a theatrical showcase for his much-younger bimbo girlfirend (Jennifer Tilly, in a tailor-made role). The writer goes through a hellish rehearsal period sacrificing his words, not to mention his moral and artistic scruples, in order to appease his mob producers who know zilch about putting on a play. The rehearsal scenes alone are worth the price of admission. Aside from Allen's clever writing, brisk pace and lush, careful attention to period detail, he has assembled his richest ensemble cast yet with a host of hysterically funny characters in spontaneous banter roaming in and about the proceedings. Cusack is his usual rock-solid self in the panicky, schelmiel role normally reserved for Woody. But even he is dwarfed by the likes of this once-in-a-lifetime supporting cast. Jennifer Tilly, with her doll-like rasp, is hilariously grating as the vapid, virulent, and thoroughly untalented moll. Usually counted on to play broad, one-dimensional, sexually belligerent dames, never has Tilly been give such golden material to feast on, putting her Olive Neal right up there in the 'top 5' fun-filled film floozies of all time, alongside Jean Hagen's Lina Lamont and Lesley Ann Warren's Norma Cassady. Virile, menacing Chazz Palminteri as the fleshy-lipped Cheech, a \"dees, dem and dos\" guard dog, reveals great comic prowess while affording his pin-striped hit man some touching overtones. Dianne Wiest, who has won bookend support Oscars in Woody Allen pictures (for this and for \"Hannah and Her Sisters\") doesn't miss a trick as the outre theatre doyenne Helen Sinclair, whose life is as grand and exaggerated off-stage as it is on. Her comic brilliance is on full, flamboyant display, stealing every scene she's in. Tracey Ullman is a pinch-faced delight as the exceedingly anal, puppy-doting ingenue, while Jim Broadbent as a fusty stick-in-the-mud gets his shining moments when his actor's appetite for both food and women get hilariously out of hand. Mary-Louise Parker, as Cusack's cast-off mate, gets the shortest end of the laughing stick, but lends some heart and urgency to the proceedings. While the play flirts with a burlesque-styled capriciousness, there is an undercoating of seriousness and additional character agendas that keeps the cast from falling into one-note caricatures. And, as always, Woody's spot-on selection of period music is nonpareil. With healthy does of flapper-era Gershwin, Rodgers & Hart, Cole Porter, Hoagy Carmichael, not to mention the flavorful vocal stylings of Al Jolson and Eddie Cantor, Allen, with customary finesse, affectionately transports us back to the glitzy, gin-peddling era of Prohibition and slick Runyonesque antics. I remember the times when the opening of a new Woody Allen film was a main event. As such, \"Bullets Over Broadway\" is a comedy valentine to such days. In any respect, it's a winner all the way, especially for Woodyphiles.",
         "Woody Allen had the inspired idea to let another actor played what would have been a tailor-made he wrote for himself. As a director, Mr. Allen has always done well. Of course, there are exceptions, but in \"Bullets over Broadway\" show an inspired Mr. Allen doing what he does best. This comedy, written in collaboration with Douglas McGrath, is a happy take on a situation that only this director would have been able to create. We are shown two different worlds. In one, the roaring twenties gangsters have the control of all illegal activities in Manhattan. On the other, we meet an idealistic writer, David Shayne, who wants to have his play produced. Enter the capo Nick Valenti. This man has enough money to buy his current paramour, the dizzy Olive Neal, whatever her little heart desires. Thus, the vehicle chosen is the drama David has written. Thus begins a frantic comedy of errors where the theater and the mob intermingle with funny results. We watch as the play gets produced on Broadway how the different factions come together, each one with a different idea as to what to do with the play. The cast is first rate. John Cusack, as the ambitious playwright, does some of his best work in showing what this man is going through. Dianne Wiest, one of the most accomplished actresses around, makes a splash with her take on Helen Sinclair, the first lady of the American theatah! Jennifer Tully is excellent as Olive Neal, the girl from the provinces with high aspirations, but no talent. Chaz Palmintieri, as Cheech, the mobster that understands what's wrong with the play is hilarious. The late Joe Venturelli was born to play his mobster Nick Valente. Jack Warden is perfect as the producer. Tracey Ullman and Jim Broadbent are simply marvelous as the cast members of the play in production. Mary Louise Parker and Harvey Fierstein, Rob Reiner are also seen in smaller roles. \"Bullets over Broadway\", as most of Mr. Allen's films has a great musical score of the jazz songs of the era. Mr. Allen, in taking a seat behind the camera, delivers one of his best and funniest films to date.",
         "Of all the Woody Allen films that I have seen (not that many, I confess) this movie and \"Everyone says 'I Love You'\" are the ones that I have enjoyed the most. \"Bullets Over Broadway\" is a very funny, clever, and entertaining comedy. The acting is top-notch; Dianne Wiest is fantastic, Jennifer Tilly and Chazz Palminteri are great and John Cusack is as good as ever, that is: he is extremely good. So, I enjoyed this film immensely, I laughed a lot, and I thoroughly recommend it.",
         "Set in 1920's New York City, \"Bullets over Broadway\" (1994) tells the story of a young playwright David Shayne who tries to produce his first play. He \"stands on the brink of greatness. The world will open to him like an oyster. No... not like an oyster. The world will open to him like a magnificent vagina\" but he needs to find money for production first. The money comes from the gangster Nick Valenti on one condition - Nick's stunningly untalented bimbo girlfriend Olive (\"She ruins everything she's in. She ruins things she's not even in\") has to play a psychiatrist. Olive is accompanied to each rehearsal by hit-man/bodyguard Cheech who knows how the real people talk and turned to be a greater writer than David. David's leading man, Warner Purcell eats compulsively every time he gets nervous (and there are plenty of reasons for him to get nervous). David's relationship with the girlfriend Ellen suffers when he begins an affair with the talented leading lady Helen Sinclair (\"I'm still a star. I never play frumps or virgins.\") who is \"in the last couple of years... better known as an adulteress and a drunk.\" \"Bullets over Broadway\" is one of my favorite comedies by one of the favorite directors/writers, Woody Allen (I love you Woody, always have, always will - please make your gems, and I will be there to watch them). It has everything I look for in a comedy - brilliance, wit, clever writing, hilarious and sinister twist in the plot, amazing performances, authentic feel of the era and great musical score. \"Bullets over Broadway\" is pure delight from the beginning to the end. The best I could describe the film - to paraphrase the famous line from John F. Kennedy's Inaugural Address: \"Ask not what Art can do for you \u0097 ask what you can do for Art\". 9.5/10",
         "Woody Allen is a genius indeed. Once more in this movie he presents us with a mixture of intelligence and humour conveyed by his famous witty dialogues where the characters seem to play with serious things but are indeed giving us through humour an image of what people think and feel about life nowadays and about the relationships that spring among them. This story mix up with considerable success two ingredients that \"a priori\" seem not to combine very well: the world of theatre with the world of mafia and gangsterism in the crazy twenties of last century. All the characters are very typical and greatly performed: the young playwright looking for a place in the sun, the ham actress who overacts a lot even in real life, the mafia boss who imposes his girlfriend on the playwright as an actress, the Greenwich Village intellectuals and so on. In my opinion however the feeblest character is the one of the gangster who becomes also playwright from a certain moment on. Some of his interventions lack authenticity. But this is only a minor flaw in the whole. Like all the other Woody Allen's movies this one seems superficial at first sight but it's well made and deep enough to amuse us and simultaneously make us think and feel life in it.",
         "A Woody Allen written and directed film that does not include him in a single frame. It may seem strange, but it's true. Allen's \"Bullets Over Broadway\" deals with a struggling stage writer (John Cusack) who is so desperate to get one of his plays on Broadway in the 1920s that he reluctantly enlists the help of the local mafia crime lord to fund the play. Of course there is a large stipulation. The crime lord's girl must be in the play (hilariously played by Jennifer Tilly in an Oscar-nominated role). Needless to say she's terrible and Cusack struggles with her in the play. However, he has booked A-list actress Dianne Wiest (in her second Oscar-winning role) who is an alcoholic who has seen better days in her career. Tilly's bodyguard (Chazz Palminteri, also in an Oscar-nominated role) sees the play rehearsed firsthand and gives Cusack some directions on the project that Cusack cannot refuse. Palminteri is street smart and knows how people really talk, while Cusack is so educated that his words make no sense to the normal audience. This film is what \"The Godfather\" would have been like if Allen had directed it. The screenplay is outstanding and Allen's direction has rarely been better. Cusack is fun and hilarious, but it is the supporting cast that makes the movie work. Other than the aforementioned Oscar-nominated actors, there are great turns by several others. Mary-Louise Parker, Tracy Ullman, Jim Broadbent, Jack Warden, Rob Reiner, Harvey Feinstein, and Joe Viterelli are all superb in well-calculated supporting roles. 4 out of 5 stars.",
         "These last two words were what SHOULD have been added to the last line of the film to make this excellent movie even better. John Cusack, in one of his better roles, plays an aspiring playwright during the 1920s, and considers himself to be a great one--although he later learns that he really isn't. Like his Marxist-inclined intellectual friend Flender (Rob Reiner, looking very much the part), Cusack thinks that art is of supreme importance, perhaps even more important than human life itself. Discussing art in a Greenwich Village cafe, Reiner gives the analogy of a burning building: if you could rush in and save only one of two things--a human being or the last known copy of Shakespeare's works, which would you save? His answer, of course, is Shakespeare's works. Why say such a horrible thing? Because to intellectuals, art \"lives.\" You'd have no right to \"deprive the world of this great art\" just to save the life of \"an anonymous human being,\" he says. Cusack agrees. But this belief is put to the test when in order to save a work of art, gangster Cheech (well-played by Chazz Palmentieri) actually commits murder. Cusack then realizes that no work of art is worth a human life after all. At this point, Cusack says, \"I'm NOT an artist.\" This, I think, is the film's underlying, Dostoevskian theme: that because intellectuals deal in art and ideas, they place far too much value on such abstractions, and correspondingly too little value on human life. Didn't the 20th century prove how deadly this insane notion can be? Now we see Deep Greens telling us that the life of a human being is no more valuable than the life of a tree or a dog! I wish all the Deep Greens would watch this fine movie and be disabused of their inhumane notions. For my part, I can also say that if art is to be considered more important than human life, \"I'm not an artist--Thank God.\"",
         "Woody Allen sends up the world of Broadway and the gangsters who love it in this Runyonesque comedy, one of his very best. John Cusack is the Allen surrogate, a nebbish playwright who's struggling to remain true to his artistic vision amongst countless obstacles. Those obstacles include: a gangster's girlfriend (Jennifer Tilly) who Cusack is forced to cast in a lead role; her bodyguard (Chazz Palmienteri), who reveals quite a few dramatic instincts; a high-maintenance diva (Dianne Wiest, uproarious); a leading man who eats too much (Jim Broadbent); and a dithery actress very much in love with her dog (Tracy Ullman). Because Allen sets his movie in a world he knows well (NY theatre), this feels like one of his strongest and most realized screenplays. The whole thing is a riot. Between Wiest, Tilly and Ullman, I still can't decide who's funniest. Grade: A",
         "Now this is something sort of rare, though not really: Woody Allen mixing satire and drama, and the satire actually even more convincing than the drama. The opposite was in a more serious affair, Crimes and Misdemeanors, where art and murder and infidelities all get into one big pot of personality crises. This is the same case with Bullets Over Broadway, though this time Allen's tackling of the ego-maniacal crutches of the Broadway scene- the aging star Helen Sinclair (Dianne Wiest, one of her very best performances, funniest too), the bumbling boob Olive Neal (Jennifer Tilly, appropriately annoying- and then how it sort of infects the outsiders to the major Broadway scene, one the protagonist David Shayne (John Cusack, excellent here), and Olive's bodyguard, Cheech (Chazz Palminteri, a character he could play in his sleep, but played pretty well anyway). Cheech is hanging around during rehearsals of David's first play he's writing and directing, following getting funding (on the condition of Olive as a psychiatrist) from a heavy-duty mobster, and soon he's suggesting ideas, and in the process becomes David's uncredited collaborator. But meanwhile infidelities are abound, with David falling for the wonderfully self-indulgent Helen, and a goofy romance between Olive and the thespian Warner Purcell (Jim Broadbent), leading to a purely ironic climax. Allen's skills at navigating the neuroses of all the characters is very skilled, and sometimes the one-liners are surprisingly funny, all based on the personalities (Wiesst especially, in a voice that is a little startling at first, gives a classic line about the world 'opening' up, and her running gag with \"don't speak\"). Even with the more dramatic connections, which doesn't seem to be as much of Allen's concerns since it's pretty one-note with the mob side of things (and, frankly, the fates of Olive and Cheech sort of seem a little too contrived for the sake of the irony par for the course), we do get a very memorable bit to make things worth the while, like David and Cheech's down to earth talk at the bar. But if there's anything else to recommend more strongly it's for the sharpness of the script in the theater scenes, the backstage banter, the hilarious tension stirred up by grudges and ill-timed romances. Plus, there's a bit of an added treat for fans of past Allen films, where he casts Rob Reiner in a role sort of similar to that of Wallace Shawn in Manhattan. Not a masterpiece, but a very enjoyable work that's successful on its dark-light terms."
      ],
      "genres": [
         "Comedy",
         "Crime"
      ],
      "productionCompanies": [
         "Miramax",
         "Sweetland Films",
         "Magnolia Productions"
      ],
      "summaries": [
         "Set in 1920's New York City, this movie tells the story of idealistic young playwright David Shayne. Producer Julian Marx finally finds funding for the project from gangster Nick Valenti. The catch is that Nick's girl friend Olive Neal gets the part of a psychiatrist, and Olive is a bimbo who could never pass for a psychiatrist as well as being a dreadful actress. Agreeing to this first compromise is the first step to Broadway's complete seduction of David, who neglects longtime girl friend Ellen. Meanwhile David puts up with Warner Purcell, the leading man who is a compulsive eater, Helen Sinclair, the grand dame who wants her part jazzed up, and Cheech, Olive's interfering hitman / bodyguard. Eventually, the playwright must decide whether art or life is more important.",
         "David Shayne, a neurotic playwright, has just found a way to have his play produced. Mob boss Nick Valenti has faith that the play will bring in big bucks. Nick is a little stubborn, and demands that his wannabe actress girlfriend, bimbo Olive have a large part, but Olive is a terrible actress and a conceited moron. Above all that, David is caught in an affair with lead actress Helen Sinclair and constantly at odds with the cast and crew. Soon he finds himself taking writing tips from Olive's bodyguard Cheech, who turns out to be a great writer himself. When the cast is introduced to Cheech's rewrite (thinking it's David's) David starts getting amazing compliments. Knowing whom the real writer is, David starts to question whether or not he is a true artist.",
         "In 1920s New York, a struggling playwright is forced to cast a mobster's talentless girlfriend in his latest drama in order to get it produced."
      ],
      "budget": 20000000
   },
   "movielensId": 348,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-10-14",
      "dvdReleaseDate": "1999-04-20",
      "directors": ["Woody Allen"],
      "runtime": 98,
      "movieId": 348,
      "title": "Bullets Over Broadway",
      "mpaa": "R",
      "actors": [
         "John Cusack",
         "Dianne Wiest",
         "Jennifer Tilly",
         "Chazz Palminteri",
         "Mary-Louise Parker",
         "Jack Warden",
         "Rob Reiner",
         "Tracey Ullman",
         "Joe Viterelli",
         "Jim Broadbent",
         "Harvey Fierstein",
         "Edie Falco",
         "Debi Mazar"
      ],
      "imdbMovieId": "0109348",
      "originalTitle": "Bullets Over Broadway",
      "genres": [
         "Action",
         "Comedy",
         "Thriller"
      ],
      "youtubeTrailerIds": ["6BDr_9S5ZwU"],
      "plotSummary": "Set in 1920's New York City, this movie tells the story of idealistic young playwright David Shayne. Producer Julian Marx finally finds funding for the project from gangster Nick Valenti. The catch is that Nick's girl friend Olive Neal gets the part of a psychiatrist, and Olive is a bimbo who could never pass for a psychiatrist as well as being a dreadful actress. Agreeing to this first compromise is the first step to Broadway's complete seduction of David, who neglects longtime girl friend Ellen. Meanwhile David puts up with Warner Purcell, the leading man who is a compulsive eater, Helen Sinclair, the grand dame who wants her part jazzed up, and Cheech, Olive's interfering hitman / bodyguard. Eventually, the playwright must decide whether art or life is more important.",
      "tmdbMovieId": 11382,
      "avgRating": 3.68226,
      "releaseYear": "1994",
      "numRatings": 8551,
      "posterPath": "/tfplmiNdTDHHbZZ8AGmXBiB1xJj.jpg"
   }
}