{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "priest",
            "id": 10093
         },
         {
            "name": "student",
            "id": 12105
         }
      ],
      "imdb_id": "tt0073327",
      "video": false,
      "title": "Autopsy",
      "recommendations": [
         105663,
         87335,
         40261,
         28402
      ],
      "backdrop_path": "/jsmbukXK9gGfSIp0acekoBbcs0o.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Simona Sana",
               "gender": 1,
               "credit_id": "52fe49a59251416c750ceaa1",
               "name": "Mimsy Farmer",
               "profile_path": "/bL3q0LNqWrqrd6EDclyHyLQUUZ8.jpg",
               "id": 36938,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Father Paul Lenox",
               "gender": 2,
               "credit_id": "52fe49a59251416c750ceaa5",
               "name": "Barry Primus",
               "profile_path": "/A5Uqoi17cM2DeNlxV5livnuUX7c.jpg",
               "id": 73194,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Edgar",
               "gender": 2,
               "credit_id": "52fe49a59251416c750ceaa9",
               "name": "Ray Lovelock",
               "profile_path": "/4pJv4V1e7ovrsF4x8jqQ90EbX8q.jpg",
               "id": 105337,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Lello Sanna",
               "gender": 0,
               "credit_id": "58be62dac3a3686686050a28",
               "name": "Carlo Cattaneo",
               "profile_path": null,
               "id": 1343994,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Danielle",
               "gender": 0,
               "credit_id": "58be62f0925141607705bc8f",
               "name": "Angela Goodwin",
               "profile_path": "/7yJLaRhRt3dxCNj7aQetb7YgL9s.jpg",
               "id": 105352,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Betty Lenox",
               "gender": 0,
               "credit_id": "58be62fc925141340700db69",
               "name": "Gaby Wagner",
               "profile_path": null,
               "id": 1004879,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Gianni Sanna",
               "gender": 2,
               "credit_id": "58be6308925141609b059818",
               "name": "Massimo Serato",
               "profile_path": "/vQlY5M9F1KERGi5xr35ynderDMy.jpg",
               "id": 14148,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Ivo",
               "gender": 0,
               "credit_id": "58be631392514132a200da6c",
               "name": "Ernesto Colli",
               "profile_path": "/AnfceBCkJGzSZcNKQ5jriSkE7Z7.jpg",
               "id": 103106,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Inspector Silvestri",
               "gender": 0,
               "credit_id": "58be6321925141609b059832",
               "name": "Antonio Casale",
               "profile_path": "/iqa0pritPmbuNpRK94IpgsV7l0c.jpg",
               "id": 5818,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Professor Mari",
               "gender": 0,
               "credit_id": "58be632e925141606b05c9da",
               "name": "Giovanni Di Benedetto",
               "profile_path": null,
               "id": 99446,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe49a59251416c750cea91",
               "name": "Armando Crispino",
               "profile_path": null,
               "id": 31603,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe49a59251416c750cea97",
               "name": "Lucio Battistrada",
               "profile_path": null,
               "id": 239904,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe49a59251416c750cea9d",
               "name": "Armando Crispino",
               "profile_path": null,
               "id": 31603,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 0.560673,
      "production_countries": [],
      "id": 96167,
      "vote_count": 5,
      "budget": 0,
      "overview": "A pathology med student and a priest team up to investigate a wave of suicides blamed on sun spots and discover a number of them to be actual murders.",
      "similar": [
         357096,
         15069,
         984,
         8090,
         948,
         807,
         75780,
         445954,
         21484,
         10359,
         10651,
         11423,
         10781,
         2749,
         123109,
         18587,
         26390,
         15762,
         293670,
         37645
      ],
      "original_title": "Macchie solari",
      "runtime": 85,
      "poster_path": "/fm50h66OwtewieRq1OnEExQhxeG.jpg",
      "spoken_languages": [{
         "name": "Italiano",
         "iso_639_1": "it"
      }],
      "production_companies": [],
      "release_date": "1975-01-18",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Armando Crispino"],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "Lucio Battistrada",
         "Armando Crispino"
      ],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0073327/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc0OTEyMzMzM15BMl5BanBnXkFtZTcwMzE3MzI0MQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Mimsy Farmer, Barry Primus, Ray Lovelock | See full cast and crew »"],
      "reviews": [
         "Aside from Dario Argento gialli, Autopsy (or Macchie solari, which translates as Sun Spots) is my favorite giallo. It's truly weird, quirky, trashy and unlike anything I've ever seen. Some might be disappointed by the fact that it doesn't have a gloved killer or the murders aren't as spectacular as those in Argento's movies but I personally liked the fact that everything in this giallo was so uncommon. For once, the typically convoluted giallo story-line wasn't on cruise control. What also stands out in this film is the sleaze factor and its almost machine gun delivery, which made me wonder what drug the director was on. The list of sleazy stuff is endless. There's nudity and several sex scenes. I've lost count on the number of up-skirt shots on Mimsy Farmer's dress. How many times Farmer's clothes were riped off. Farmer's boyfriend (handsome Ray Lovelock) trying to force himself on her. Her coworker trying to rape her, whom she ferociously attacks back at. Gratuitous shots of the young woman's beautiful naked body in the morgue. The hallucination in the morgue at the beginning (great!). The photos of real dead people in the museum. The slide show, which includes dubious erections. The tempestuous race-driver turned priest (the not so handsome Barry Primus) whom Mimsy falls in love with (blasphemy!). Everyone in the movie is sorta crazed and on edge. The suicides during the opening are startling in it's rapid-fire delivery. In fact, the whole film's direction teeters on delerium. It feels like the sun had affecting everyone, including the director, the screenwriter and the editor. I love the fact that the director deliberately leaves out bits of information and as we watch the movie, we quickly assume this and that, and then the director sneaks-in the missing info, we suddenly feel a bit silly or ashame over what we thought at first. For example, when we see the man swimming in the pool. We don't know who he is. As he swims to the edge, the camera pans up on Mimsy (and that quasi up-skirt shot) which makes us think that the man was trying to take a peek or is attracted to her in a sexual way. The next scene, the man is shown to be Mimsy's father. Okay! The director continuously pulls the rug from under us, throws-off our expectations throughout the movie with EVERY little detail imaginable, which makes for a trippy experience. We're never sure who's who or what's what. The really funny part about all of this is the director deliberately mixes and remixes everything as to create confusion but when the killer's identity is revealed, it's done in the most calm, concise and matter-of-fact way. The killer is the sanest person amongst the sun-stroked bunch. Does this quirky direction automatically make AUTOPSY a great movie? Not really but it IS unique. I've never seen a deliberatly chaotic direction like this. There were so many dull giallos made in the 1970s, all of which look too glossy and artificial, like the dreadfully kitschy CASE OF THE BLOODY IRIS or boring TORSO, that AUTOPSY stands out because of its sleazy and gritty direction. It's not your typical giallo. If Joel Schumacher is to CASE OF THE BLOODY IRIS, then Martin Scorcesse (of the 1970s) is to AUTOPSY: Brash, over-the-top, lurid and with a chip on its shoulder. There are several stand-out scenes in AUTOPSY, including the suicides, the hallucination scene at the morgue, and the whole moment at the museum, where there's a booby trap rigged to kill Mimsy. The dialogue is at times uproariously bad. And when you think you lost track of the story, everything eventually falls together. AUTOPSY is a whirlwind of images, sounds (great Ennio Morricone soundtrack!) and questionable stuff that makes for a memorable viewing experience. In the end, it's not really great but its unique direction sure makes up for its obvious shortcomings. If you're game, you'll enjoy it. If you're not game, well, you'll be annoyed or turned-off by it.",
         "Armando Crispino's `Autopsy' is an authentic Giallo\u0085but slightly more complex and diverse than your ordinary experiences in this field of horror. The constant mix of mystery, suicides and twisted characters makes this film one of the most ambitious Italian flicks of the early 70's. Closely living up to Dario Argento's films when it comes to originality and suspense, but a lot more modest when it comes to violent images. Autopsy contains a downright brilliant opening and the first 5 minutes (showing a series of repulsive suicides in the city of Rome) already were enough for me to consider this film a success. The story loses much of its initial grip, of course, but there still is a lot of imaginativeness to discover throughout the whole film. Compared to many other Gialli, Autopsy features a believable, solid plot and it sticks to it without the overuse of unnecessary plot-twists. The score (by Ennio Morricone) gives you cold shivers and the main characters are creatively presented. How about a depressed pathologist who has visions about the living dead copulating? Or a racecar-driver turned priest and out for vengeance? Autopsy is a lot more suspenseful than it is gory, even though the DVD-cover leads you to believe otherwise. Tension-highlights include a compelling sequence inside the `Death Museum' and an atmospheric experiment upon an entirely paralyzed victim. Add a bit of stylish nudity to all this and you've got yourself an undiscovered and ignored cult-gem. It may not satisfy horror-rookies on a quest to see tons of blood, but it'll sure please the more experienced horror fans. If you're searching for a top-macabre and unsettling horror film, this is the one.",
         "Finally this rare giallo hit the stores on DVD in March 2000 thanks to Anchor Bay - it was about time that this almost forgotten giallo masterpiece was released in its uncut version (the former US-version on tape was trimmed for almost 15 minutes of story!). I searched for it unsuccessfully for about five years; I had great expectations, and - oh, boy! - they were NOT disappointed at all! Already the first twenty minutes deliver more than many other thrillers during their entire running time. The plot is very twisted, and there are so many red herrings that literally every character becomes a suspect during this film. There are fine performances of Mimsy Farmer, Barry Primus and especially Ray Lovelock of 'The Living Dead at Manchester Morgue'-fame. This really is a brilliant movie and a real MUST SEE for the fan of stylish European cinema. Not to be missed!",
         "'Autopsy' is a very strange and confusing giallo that has to be seen to be believed! Newcomers to the genre best steer clear, but buffs will find this one totally fascinating. Mimsy Farmer (Fulci's 'The Black Cat') stars as an uptight doctor who between wrestling with freaky hallucinations of horny corpses(!) investigates a series of suicides supposedly caused by sunspots(!). A mysterious car racer turned priest (!) (Barry Primus of Scorsese's 'Boxcar Bertha') gets involved in the mystery, though she is unsure whether he is an ally or a suspect. Also in the cast is Ray Lovelock ('The Living Dead In Manchester Morgue') as Farmer's moody and cynical boyfriend. The brief plot synopsis doesn't give you any idea of just how convoluted and nutty this one is. Many will probably find it too flamboyant to stick with until the end, but personally I found it impossible to resist. Easily the most bizarre giallo I've ever seen!",
         "I must admit, the cover, the stars, and the gruesome story description will grab you. But that's just one more wrench thrown into the confusion of the film known in English as Autopsy. For me, three things convinced me to get the DVD: Ray Lovelock, who starred later in the zombie classic Let Sleeping Corpses Lie (Non si deve profanare il sonno dei morti), the score is by Ennio Morricone, and the fact that 15 minutes was restored and the film is presented uncut for the first time here in the United States. I'm also a fan of the Italian giallos, which is what Autopsy really is, but I didn't know that because the cover makes it appear as a possible zombie-oriented horror film, and the first ten minutes alone will have you believing that. We're given the idea that something like sunspots and flares are the force behind a sudden wave of suicides and that, along with exhaustion, are why medical examiner Mimsy Farmer is having hallucinations of corpses in the hospital coming to life and taunting her. Apparently this same sun problem is what sets off a killer to start killing people (that Mimsy happens to know) and making it look as if these killings were actually just another suicide. As it turns out he does have a motive, but this sun/suicide bit cand throw you. Like many giallos, there is an obligatory explanation at the climax that flashes back to a traumatic experience the killer had as a child (this kind of thing also happened in Don't Torture A Duckling, aka \"Non si sevizia un paperino\" and Torso, aka \"I Corpi presentano tracce di violenza carnale\"). It actually took a second viewing for me to understand the sun thing, the suicides, and the killings and put it all together--this film has so much going on that there are many distractions particularly of a sexual nature, you are drawn this way and that which is why connecting the plot points gets difficult at times. Is that a good thing? Well, this film doesn't hold back and has a generous amount nudity, even full frontal. There is a scene where Ray Lovelock shows Mimsy a slide show of \"vintage\" erotic photographs that, in two of the quickly passing close-up photos you'll find yourself saying \"oh man, was that actually what I THOUGHT I saw?\" and while not really pornographic will nonetheless surprise you since this film was made in 1973. Two sexual interludes (interrupted as they are) also add to the \"this is getting gratuitous\" element and an art gallery featuring photos of human torture are also present (I found these particular photos shocking and I thought I was jaded to these kinds of things). It wasn't difficult for me to see what was cut for domestic release in the states--this film packs a visual punch and just keeps going. All in all, I am glad I have this film as part of my collection because it is a curiosity that really can't be ignored. Call it a guilty pleasure if you will. After understanding it from the second viewing, I started looking deeper into Autopsy and realizing it has its own personality and more of a story to offer than, say, the basic \"let's get women naked then kill them\" mood of Torso. While Mimsy Farmer is a little difficult to warm up to with her once nice then cold moods, her part is played competent enough we still hope she gets through the ordeal. Barry Primus behaves like one of those people you hope doesn't sit next to you on the bus--a bit on edge and prone to bursts of anger. Ray Lovelock is always interesting to see, particularly because of the choice of dubbing for his part--I'm wondering if some day I'll get to hear his actual voice in a film! He also conveys an early 1970's example of the masculine and sexual leading guy: bearded and real, instead of the cookie cutter cutie boys put in lead roles in films these days. Anchor Bay gets points for taking these Italian gems and getting them restored so well that the picture looks better than most Hollywood film transfers. Some audio portions of Autopsy were not recorded in English, so a couple brief scenes are in Italian with English subtitles. An unusual move, but I appreciate the fact that at least the film is intact. One scene involving a newspaper headline and discussion of the sun is a key scene for the plot, and was one that was cut in American distribution because it wasn't recorded in English. Now that it's back in, it really makes a difference. Autopsy is not a perfect film, not a bad film, basically one of those films that manage to grab your attention at any cost. For collectors of 1970s Italian giallos it has merit, for other folk, well, be prepared--you'll be raising your eyebrows so much your face will hurt by the ending!!",
         "The opening of this film might leave one wondering as to what the remaining story could be about. Turns out the director must have felt the same way, since the beginning has little to do with the rest of the film. The blatant use of simulated autopsy footage is what the American distributor played off of when they retitled the film \"Autopsy\". If you check out the trailer, you can see they were trying to pass this off as centering on reanimated corpses or...well, I'm not sure exactly what they were aiming for, but it's all a clever disguise, since the film is yet another tepid giallo. I have to give the director credit for giving this the feel of a nightmare, but that may also be simply a poorly conceived narrative and a choppy script. Argento can get away with those kinds of things sometimes due to his visual flair, but in this case it falls flat.",
         "Armando Crispino's \"Macchie Solari\" aka. \"Autopsy\" of 1975 is an underrated and quite unusual Giallo that lovers of Italian horror can not afford to miss. Great suspense, bizarre elements and very interesting, often troubled characters come along with a menacing atmosphere and a great, very eerie score by none other than Ennio Morricone. The film already starts out excellently, with several nasty suicides. Rome has been struck by a heat wave, which leads to increased suicidal tendencies among the population. Being constantly surrounded by disfigured corpses is becoming too much for young pathologist Simona (Mimsy Farmer), who is writing a thesis about suicide and murder. Simona, whose job is giving her nightmares and terrible visions, doesn't believe that all of these violent deaths were suicides... \"Autopsy\" features many frightening and often bizarre sequences, a quite complex plot and elaborate characters. The storyline is sometimes quite complex to follow, especially since the scene changes often seem quite abrupt, but this only makes the film less predictable, and everything makes perfect sense as a whole. The performances are entirely very good. Mimsy Farmer is excellent in the lead, and portrays her character's fears and nightmares in a very believable manner. Another great performance is delivered by Barry Primus, who plays a quite unusual catholic priest. The cast furthermore includes Ray Lovelock, a regular to Italian genre cinema, and Ernesto Colli, who should be known to Italian Horror buffs for his role in Sergio Martino's 1973 giallo masterpiece \"Torso\" (aka. \"I Corpi presentano tracce di violenzia carnale\"). It should be said that \"Autopsy\" is not the gore-fest the DVD cover might make you think. Even though there are some very violent sequences and many repulsive images, the violence is quite tame compared to many other Gialli of the mid 70s. The movie's main intention is suspense and it definitely succeeds in being suspenseful. \"Autopsy\" is a stylish, atmospheric and very suspenseful Giallo, that no lover of Italian Horror should allow himself to miss. Highly Recommended!",
         "A rather confusing giallo and I think in part this is because of rather lazy direction and a poor performance from Mimsy Farmer who seems to get the wrong look most times and leave us in doubt as to what she is thinking or feeling. One essential in giallo is some sort of empathy for the lead, even if that eventually turns out to be misplaced! Here I don't feel many are very concerned for what happens to Mimsy. And plenty does, that's for certain. Is there another movie where the lead actress gets so much abuse and groping, not to mention attempted rape and up skirt shots!? Of course the Morricone score is first rate and for all the confusion this is a very varied and very different giallo that maintains the interest throughout.",
         "The first half of this film is incredibly creepy. The suicides in the beginning separates by shots of solar flares and Ennio Morricone's suitably atmospheric music set the stage perfectly. The scene in the autopsy room when the first corpse (the black man) suddenly smiles also send chills. As does the sudden close-up of the dead woman on the beach. The (real) photos of accident and murder victims in the 'death' museum was also a bit frightening. After that...it all went downhill. The characters were hardly original. And they seemed to just add more of them for no reason. Add a new face, act like we've known him or her all along, then kill him off without warning. I got the impression the director was told he had 48 hours to finish it or he loses his fee. So he packs the conclusion in a day. As a result, mass confusion. It should have been better.",
         "Armando Crispino's \"Autopsy\" is a very fascinating and puzzling film,which both amuses,grosses out and confuses.This is surely one of the most complicated giallos ever made.After watching it,I'm still very confused about how everything fits together in the plot.\"Autopsy\" is not a horror film-I'd rather call it a giallo with some horror elements.There is plenty of sleaze and nudity,so fans of Italian exploitation should be pleased.The score by always reliable Ennio Morricone is excellent.The acting is very good with Mimsy Farmer(\"Camping del Terrore\",\"The Black Cat\",\"The Perfume of the Lady in Black\")giving an outstanding performance as a forensic pathologist Simona.A must-see for fans of Italian giallos."
      ],
      "genres": [
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": ["Clodio Cinematografica"],
      "summaries": [
         "Simona Sana is a young pathologist whom works in a morgue in Rome, Italy which gets with with a wave of violent suicides which are attributed to a summer heat wave. Driven to exhaustion from the intense heat and the long hours worked, Simona struggles to complete her college theses about natural deaths when one suicide victim is brought in the morgue in which a young Catholic priest named Paul Lenox who identifies the corpse as his sister, but that did not commit suicide, but was murdered and set up to look like a suicide. Simona teams up with Father Lenox to solve the mystery and stay one step ahead of a mysterious killer who now begins to stalk her when Simona gets a little too close to the truth of the suicides.",
         "A pathology med student and a priest team up to investigate a wave of suicides blamed on sun spots and discover a number of them to be actual murders."
      ],
      "budget": 0
   },
   "movielensId": 3485,
   "movielens": {
      "languages": ["Italiano"],
      "releaseDate": "1975-01-18",
      "dvdReleaseDate": "2000-03-21",
      "directors": ["Armando Crispino"],
      "runtime": 85,
      "movieId": 3485,
      "title": "Autopsy",
      "mpaa": null,
      "actors": [
         "Mimsy Farmer",
         "Barry Primus",
         "Ray Lovelock",
         "Carlo Cattaneo",
         "Angela Goodwin",
         "Gaby Wagner",
         "Massimo Serato",
         "Ernesto Colli",
         "Antonio Casale",
         "Giovanni Di Benedetto"
      ],
      "imdbMovieId": "0073327",
      "originalTitle": "Macchie solari",
      "genres": [
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": ["JDMr-iryM0E"],
      "plotSummary": "A pathology med student and a priest team up to investigate a wave of suicides blamed on sun spots and discover a number of them to be actual murders.",
      "tmdbMovieId": 96167,
      "avgRating": 2.55556,
      "releaseYear": "1975",
      "numRatings": 27,
      "posterPath": "/fm50h66OwtewieRq1OnEExQhxeG.jpg"
   }
}