{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "killer robot",
            "id": 1373
         },
         {
            "name": "flying saucer",
            "id": 3243
         },
         {
            "name": "invasion",
            "id": 4278
         },
         {
            "name": "ufo",
            "id": 9738
         },
         {
            "name": "beautiful woman",
            "id": 9767
         },
         {
            "name": "robot as menace",
            "id": 10009
         }
      ],
      "imdb_id": "tt0046907",
      "video": false,
      "title": "Devil Girl from Mars",
      "recommendations": [
         31280,
         53157,
         70259,
         29393,
         99008,
         38908,
         42780,
         27115,
         20121,
         31679,
         110980,
         54287,
         31258,
         53050,
         49158,
         37626,
         23045,
         34084,
         75506,
         28586
      ],
      "backdrop_path": "/qNYG1cUHjFzSnkag3UNsWPxUMx1.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Michael Carter",
               "gender": 0,
               "credit_id": "52fe448ac3a368484e028a31",
               "name": "Hugh McDermott",
               "profile_path": "/15k664Kfjhg4qS1IXSGHo5iV7SV.jpg",
               "id": 91361,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Nyah",
               "gender": 1,
               "credit_id": "52fe448ac3a368484e028a35",
               "name": "Patricia Laffan",
               "profile_path": "/cJafnzFy3Psg4SLP0NdFH8u4LhP.jpg",
               "id": 101497,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Ellen Prestwick",
               "gender": 1,
               "credit_id": "52fe448ac3a368484e028a39",
               "name": "Hazel Court",
               "profile_path": "/arrnJNt1mJqH7NEwyYr7Mxz0eeY.jpg",
               "id": 101499,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Robert Justin / Albert Simpson",
               "gender": 0,
               "credit_id": "52fe448ac3a368484e028a3d",
               "name": "Peter Reynolds",
               "profile_path": null,
               "id": 101500,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Doris",
               "gender": 1,
               "credit_id": "52fe448ac3a368484e028a41",
               "name": "Adrienne Corri",
               "profile_path": "/fEO6V3zvvyWpviIvEdJ8jSLkTL1.jpg",
               "id": 2265,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Prof. Arnold Hennessy",
               "gender": 0,
               "credit_id": "52fe448ac3a368484e028a45",
               "name": "Joseph Tomelty",
               "profile_path": null,
               "id": 101501,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Mr. Jamieson",
               "gender": 2,
               "credit_id": "52fe448ac3a368484e028a49",
               "name": "John Laurie",
               "profile_path": "/fOo2XHmHSDSeo7TUpm0l64C6ZOq.jpg",
               "id": 3673,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Mrs.Jamieson",
               "gender": 1,
               "credit_id": "52fe448ac3a368484e028a4d",
               "name": "Sophie Stewart",
               "profile_path": "/cfP5Q74zmMNWrAbLz2CoStVpYqe.jpg",
               "id": 33272,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Tommy",
               "gender": 0,
               "credit_id": "52fe448ac3a368484e028a51",
               "name": "Anthony Richmond",
               "profile_path": null,
               "id": 101502,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe448ac3a368484e028a57",
               "name": "David MacDonald",
               "profile_path": null,
               "id": 106629,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe448ac3a368484e028a5d",
               "name": "Edward J. Danziger",
               "profile_path": null,
               "id": 661623,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe448ac3a368484e028a63",
               "name": "Harry Lee Danziger",
               "profile_path": null,
               "id": 607081,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe448ac3a368484e028a69",
               "name": "James Eastwood",
               "profile_path": null,
               "id": 91358,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe448ac3a368484e028a6f",
               "name": "Edwin Astley",
               "profile_path": null,
               "id": 73248,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe448ac3a368484e028a75",
               "name": "Jack E. Cox",
               "profile_path": null,
               "id": 7386,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe448ac3a368484e028a7b",
               "name": "Brough Taylor",
               "profile_path": null,
               "id": 1187811,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe448ac3a368484e028a81",
               "name": "Norman G. Arnold",
               "profile_path": null,
               "id": 1187812,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "578cdf07c3a3685b4400a0f9",
               "name": "Betty Forster",
               "profile_path": null,
               "id": 1649176,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 2,
               "credit_id": "578cdf41c3a3685acb0094b5",
               "name": "Jack Whitehead",
               "profile_path": null,
               "id": 1603462,
               "department": "Crew",
               "job": "Special Effects"
            },
            {
               "gender": 2,
               "credit_id": "578ce47ec3a3682bb20117ed",
               "name": "Gerry Anderson",
               "profile_path": "/1NYWJXXgT3M83x78Z4epBotWitG.jpg",
               "id": 1213685,
               "department": "Sound",
               "job": "Sound Editor"
            },
            {
               "gender": 0,
               "credit_id": "578ce8429251416a2f000f2f",
               "name": "George Partleton",
               "profile_path": null,
               "id": 38060,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            }
         ]
      },
      "genres": [{
         "name": "Science Fiction",
         "id": 878
      }],
      "popularity": 2.446098,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 24212,
      "vote_count": 8,
      "budget": 0,
      "overview": "An uptight, leather-clad female alien, armed with a raygun and accompanied by a menacing robot, comes to Earth to collect Earth's men as breeding stock",
      "similar": [
         602,
         840,
         10200,
         49849,
         601,
         607,
         608,
         16866,
         10679,
         20424,
         401513,
         828,
         10122,
         271404,
         11954,
         13820,
         11309,
         52199,
         10640,
         15613
      ],
      "original_title": "Devil Girl from Mars",
      "runtime": 77,
      "poster_path": "/rYQrxfPwM7h7Ba0iW0f0iogUHrL.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Danziger Productions Ltd.",
         "id": 5078,
         "origin_country": ""
      }],
      "release_date": "1954-05-01",
      "vote_average": 4,
      "belongs_to_collection": null,
      "tagline": "Invasion from Outer Space!...Sights too weird to imagine! Destruction too monstrous to escape!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["David MacDonald"],
      "runtime": 77,
      "synopsis": "Opening scene A passenger plane is destroyed in mid flight in a shower of sparks. Scene switches to an isolated Inn somewhere in the Scottish Highlands. On the radio, a broadcast explains a bright light seen last night was a meteor. Tommy (Anthony Richmond) is then sent to bed by his aunty, Mrs. Jamieson (Sophie Stewart) As he goes to bed aunty explains that despite what the radio said, the meteor has landed some ways a way. The radio report concludes with the announcement that noted astronomer Prof Hennessy, has gone to the area to look for the meteor. Nearby, Prof Hennessy and Michael Carter (Hugh McDermott) an American reporter are stopped on the side of the road. In the background the cars radio warns that Robert Justin (Peter Reynolds) has escaped from jail and is considered dangerous. Back at the inn Doris (Adrienne Corri) hears a knock at the door. It is Justin; shes surprised to see him and asks if hes been released. He explains hes escaped, Doris is still puzzled, but a clear romantic connection pushes her to help him. Mrs. Jamieson interrupts the reunion; panicked Doris introduces him as a stranger on a hiking tour who has lost his wallet. Mrs Jamieson agrees to give him lodgings in return for odd jobs. Left alone again, Doris and Justin continue their conversation. Hed been sent to jail for murdering his wife, Doris laments why he ever chose the other women over her. Ellen Preswick (Hazel Court) a fashion model from London joins the couple for a drink. She takes an instant interest in Justin, and is convinced she has seen his face before. Justin is unsure of Preswicks motives and decides to leave the two women to their thoughts Hennessy and Carter arrive at the inn looking for lodgings. Carter sees Preswick and is immediately attracted to her. The moment is interrupted when Miss Preswick she sees a flash of light through one of the windows. Hennessy is condescending and suggests that she either imagined it or it was nothing to worry about. Dinner is served and Carter recognizes Justin who is their waiter. He is about to tell the others when a huge spaceship flies low over the Inn sending everyone scrambling for cover. They see the craft land in a nearby field. Carter decides it is an alien space craft, and begins trying to contact the outside world. Hennessy is more skeptical and wants to investigate before deciding. He notices the object is red hot and theyll have to wait some hours before approaching. In the confusion Justin slips away and escapes. Carter and Hennessy try to reach a nearby village, but struggle to start their car. Returning, Justin pulls Doris aside, she shows him an abandoned room to hide in, she declares her love for him, and he considers the options the couple may have to escape. Now alone in his room, Justin watches a female figure emerge from the ship. He also catches sight of a worker from the Inn approaching the woman. The alien kills the man without question and continues towards the inn. Giving up on the car Hennessy and Cater return to the inn. They are troubled to find Doris unresponsive and in a zombie like state. The alien arrives at the inn and introduces herself as Nyah (Patricia Laffan) she is from Mars. She explains that she wanted to land directly in London, but the ship sustained damage in the decent. Due to the war of the sexs on Mars, the male population is dropping, and she needs human males to bolster breeding stock. It is realized that a worker is missing, Nyah admits to killing him. Before returning to her ship, Nyla warns the group of an invisible wall around the inn to prevent them from escaping. Carter spends more time Miss Prestwick and learns shes is in the area to escape a relationship with a married man. Shed run away in the past, but her partner always found her. Carter then opens up and tells of his own experiences as a combat reporter. Both seem drawn together by the possibility of their common destruction Professor Hennessy comes back injured, hed found the invisible barrier by falling against it. Frustrated Mr Jamieson finds an old gun and gives it to Carter. They make a plan to either capture Nyah or kill her. Suddenly she returns to the inn, Carter empties the gun at the alien without result. She orders everyone to the ship so they can understand the power she wields. Still hidden, Justin sees Tommy wandering around. The boy wants to go to the ship and Justin agrees. Nyla triggers another hatch to open and a huge box like robot emerges. Nyla orders the robot to fire a beam that destroys a tree, then car and finally a storage shed. Nyla discovers Justin and the boy hiding and orders the boy into the ship. Justin tries to stop her, but is hypnotizing and sent back to the inn. Hennessy then gets an opportunity to see inside the ship, Nyla wants to show off her power, the professor is looking for any weakness he can exploit After seeing the negative atomic energy, and perpetual motion system; Hennessy realizes the sort of power he is up against and returns to the inn. The, rest of the group have set a trap to electrocute Nyla. She triggers trap and remains completely unaffected, but is annoyed enough at the attempt to warn them any further attempts will result in the death of Tommy. Nyla then disappears by transferring herself to the 4th dimension. Carter decides to go alone to the ship and rescue Tommy. Nyla stops him at the hatch and demands to know what he wants. Carter offers to exchange himself for the sake of the child. Nyla agrees to the deal and Tommy returns to the inn. Once there, he tells everyone what he has seen, Hennessy becomes more convinced than ever that he can destroy the ship. Meanwhile Doris finds Justin wandering still in his hypnotized state and muttering about preparing for the new rulers of Earth. Carter returns to explain the deal hes struck with alien. Doris explains Justins unusual behavior; Carter goes to check on him and is violently attacked. He manages to subdue Justin and tie him up. Later Hennessy pulls Carter aside and explains how it might be possible to destroy the aliens craft, but it would mean the death of whoever tries. Nyla comes to the inn and collects Carter, he considers what Hennessy said. At the ship Carter takes Nylas controller but is defeated by her robot. Nyla decides Carter is untrustworthy and returns him to the inn and tells everyone they are going to die because of Carters trickery Desperate Hennessy offers to be a guide for Nyla in London. Initially rejects the offer but sees some worth in the idea. Nyla will return later and chose someone. The rest will be killed. The thought that the end is near draws Prestwick to declare her love for Carter. They discuss what the future may have been, and decide that it is now all over Doris finds Justin, who appears back to normal. She explains the reason for him being tied up. Meanwhile Hennessy has written down instructions on destroying the ship so whoever is chosen to go, will be able to achieve their aim of destroying the ship. Doris releases Justin and he promises to stay safe, however Nyla comes back and assumes Justin is the person to come with her. Together they return to the ship. All seems well as the craft launches and begins to climb into the air without incident. Just before it disappears from view it explodes. Doris bursts into tears realizing Justin is dead, but his sacrifice saved the world.",
      "writers": [
         "John C. Mather",
         "James Eastwood"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0046907/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTQ0NzYxOTIyMF5BMl5BanBnXkFtZTcwMTc5MzQyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Patricia Laffan, Hugh McDermott, Hazel Court | See full cast and crew »"],
      "reviews": [
         "There's no other movie quite like Devil Girl from Mars. It's cheesy and low-budget, unfolding like a stage-play ineptly filmed, with a script dulled by timid ideas and old-school misogyny. Yet in Patricia Laffan, the British actress who plays Nyah the Devil Girl, this picture presents a space-queen unrivaled in the annals of B-movie campiness. Her dominatrix boots and patent-leather cape, not to mention her highbrow imperious accent, easily outclass the features on display from those Venusian babes in Queen of Outer Space (1958) or the Martianettes in Flight to Mars (1951). And check out that Devil Girl headgear, a cross between medieval helmet and Egyptian sphinx! In silhouette, Nyah is the image of Darth Vader, striding about with cape swirling to do something unspeakably naughty. But before you conclude that Ms. Laffan's over-the-top performance is an instance of bad acting, consider this: there's no way to play a character like Nyah with psychological depth. The Devil Girl is a comic-book villainess, an icon, somebody who has to be bigger than big. Patricia Laffan is the perfect drama queen to meet the challenge. If you like her in this movie, be sure to see her in Quo Vadis? (1951), a glorious sword and sandal epic that also features the burning of Rome and the martyrdom of the Christians. In that film Laffan plays Poppaea, wicked Empress of Rome, opposite Peter Ustinov's even more formidable Emperor Nero. From bride of the Roman Antichrist to warrior-woman of Mars is just a small step -- or should I say, it's a small step for Patricia Laffan, but a giant leap for anyone else.",
         "At first you may think this is another fifties low budget sci-fi saga, the type Hollywood churned out by the truckloads(and still do.) The big difference here is the fact that its actually a brit production and that makes it rather rare. The English take their movie making seriously(sometimes to seriously) so the production values, writing, lighting, etc. are a notch above that of the typical Hollywood production. The wildest thing about the movie is the alien babe who is pretty darn sexy in that freaky outfit she wears. The biggest negative is probably the robot who must have been made out of an old refrigerator. However, to the robots credit he has a cool disintegration ray. First his head lights up , a beam of light shoots out and anything it hits glows then disappears leaving only a bit of smoke. This is by far the best special effect and this technique showed up later on many American sci-fi shows including THE INVADERS and STAR TREK. As i recall from my childhood, the aliens glowing and disappearing after being killed was the coolest thing about THE INVADERS. The robot appears to be really huge also and that alone might have scared the bejesus out of its audience back in the day. I can imagine that back in the fifties most people who put down their change to see THE DEVIL GIRL FROM MARS left feeling they got their money's worth and then some. Its still pretty entertaining. Better than most from that era no doubt!!!",
         "An odd little cinematic gift from England -- but don't take it too seriously. The story is set in an isolated English inn where a flying saucer lands and surrounds the area in an invisible force field. From the spacecraft emerges a fifteen-foot-tall robot and an evil Martian woman who announces that the matriarchal Martian society has sent her to select Earth men for breeding purposes. The Martian men have been subjugated ever since they lost a war with the women, and during the intervening centuries the males have grown weak and useless. (American men take note: this could happen to you, too!) All this is played absolutely straight by the cast. No cutesy sex jokes. On the negative side: bogus scientific terms saturate Miss Laffan's dialogue. The robot looks too much like a refrigerator with a police light for a head. The entire films is shot on an indoor set, causing it to resemble the original stage production on which it was based (yes, a British sci-fi PLAY!) On the positive side: The concepts described by the bogus scientific dialogue are key elements in the plot -- which means the viewer has to pay attention to keep up with what's going on. The Scenes of the woman and the robot coming out of the huge spacecraft are flawlessly matted and very impressive -- and so is the robot's demonstration of its death ray. Patricia Laffan (the Martian women) overacts outrageously, but her performance is still enjoyable. Her shiny black outfit is comprised of black boots, short skirt, long cape, and black skullcap. The supporting players do a fine job, including the lovely Hazel Court. Praiseworthy music score by Edwin Astely. The story contains some good concepts. For example, the spacecraft is made of `organic metal' that repairs its own damage. Unfortunately, we don't get any special effects depicting this marvel. In some ways, this one is more fun to watch than a few of the more well-regarded sci-fi entries. It's available on pre-recorded VHS, and worth the few bucks it costs -- IF your expectations have been properly adjusted. I hope I succeeded in doing this. Let me know if I've succeeded.",
         "The War between the Sexes. Other than that Riggs-King tennis match and some jokes floating across the internet, it's been relatively harmless. Apparently, things didn't go quite as well on Mars, where men and women began shooting at each other in an all-out war. That is the premise behind DGfM. Nyah, dominatrix extraordinare, lands in the Scottish highlands to procure men to help repopulate Mars. (This begs an obvious question: At some point, doesn't mean a dilution of the Martian race, since most offspring from this point will have at least half Terran blood?) Her ship is hit by a meteor, otherwise she would have landed in London, where the pickings would be a lot better. DGfM introduces us to a truly futuristic concept of a spaceship made of organic metal and powered by reverse atomic explosions. The drawback is the hokey robot, whose arms makes Tom Servo's look downright authentic. Nyah is shown way too many times thrusting open the patio doors to intimidating music. In our sex-obsessed world, this movie if made now would focus on men falling all over themselves to get on board to mate with Martian women. As this movie is done, it focuses more on man's free will and his natural aversion to submit to things more powerful than he than on sex, something that would be lost in any remake. The cold, calculating Nyah's desire for breeding stock contrasts nicely with the three examples of human love expressed by those couples in the inn. Another interesting contrast is that of the arrogant scientist, who refuses to believe that which does not fit his worldview, with that of the wide-eyed wonderment of the child, who accepts what he sees on faith and doesn't question Nyah's strength or power. The ending is an imperfect allegory of Christ's saving work for sinful mankind, but only because of who sacrifices themselves for the benefit of the others. Overall, this is a quality movie that is both thought-provoking as well as entertaining. Sterno says follow Nyah \"of your own free will.\"",
         "Nyah(Patricia Laffan), a Martian woman, is forced to land her ship in the Scottish highlands instead of her intended target London but decides to continue her mission to select healthy male subjects, to be used for breeding purposes, to return with her to Mars. There's things I like about this movie. I like the hulking robot, even if it is a little clunky and clumsy-looking. I like the spaceship with its unique spinning top design. I like the ideas at work in the film including an organic spaceship, a self-perpetuating fuel source and the whole inward atomic fission bit. I like the look of the outdoors settings. And I like Patricia Laffan's portrayal of Nyah as a sort of Martian dominatrix clad in black leather. She certainly makes a lasting memorable impression on the viewer. Then there's a number of things for which I do not care. I don't like that the film is so set-bound and talky, with far too many grand opening the curtain entrances by Nyah. A large part of the problem with this film is they seemed to be, most inadequately I must say, trying to add a comedic element to the proceedings when our performers were far more capable at playing it straight. Hugh McDermott is particularly bad at delivering his often over-the-top lines. This could have been better but I have to admit I enjoy it more than most others I know. I suspect Patricia Laffan's leather clad dominatrix has something to do with that along with the luscious miss Hazel Court.",
         "I'd been wanting to see this classick Brit piece of sci-fi for many decades, and must say that it was almost worth the wait. This flick is almost like a poor man's \"Day the Earth Stood Still,\" except that instead of Michael Rennie, we get a British lassy playing some kind of Martian dominatrix, and instead of the wonderful Gort, we get one of the most lumbering and ridiculous-looking robots in film history. Still, the acting is fair, especially the always wonderful Hazel Court, and the effects pretty cool...especially the incredible explosion at the film's end. All in all, not the worst time killer that one could imagine, and a must for all fans of British sci-fi and/or Martian dominatrix movies.",
         "\"Devil Girl From Mars\" (1954) looks like a strange cross between \"Quatermass Xperiment\" (1955) and \"Queen of Outer Space.\"(1958). Then throw in a little of \"Mars Needs Women\" (1967) and \"The Mysterians\" (1957) for good measure. So if you don't like any of these films you might consider avoiding contact with \"Devil Girl\". This is the earliest film I know of with aliens seeking Earthlings for breeding stock. It is played perfectly straight. Naya (Patricia Laffan) is an emotionless Martian space explorer. She has the Michael Rennie role here, but she is not visiting Earth for reasons that will benefit mankind. Still she is beautiful and her black leather costume and \"Ming the Merciless\" helmet must have caused quite a sensation back in 1954. Like Rennie she arrives in a flying saucer with a robot. The saucer looks interesting but Chani the robot looks like a mailbox with a hood ornament. It's one of a handful of 50's English science fiction films. It's real claim to fame is that it's the adaptation of a radio play. All the action (and there is not very much) takes place on the moors of Scotland and involves a varied collection of Earthlings staying at the remote Bonnie Charlie Inn whose proprietress speaks the immortal line: \"While we're still alive, we might as well have a cup of tea\". Actually the film is not nearly as bad as its reputation. The film stock is excellent (at least judging by the 1990 Rhino VHS release) even if it does rely too much on wide master shots, with beautiful Hazel Court as one of the guests a few close-ups would have been nice. The production design and the special effects are more than adequate for the period of the film. As a radio play the story by necessity adopts the remote house with an unlikely group of strangers dynamic. But it explores new territory by making a woman the invincible extraterrestrial visitor. She is a woman from a planet of women who indulges herself and the viewer with lengthy very humorous lectures on the inferiority of Earthlings. And she even expounds at length about the fusion reactor (probably films first reference to this) that powers her ship. Then again, what do I know? I'm only a child.",
         "Devil Girl From Mars is one of the relatively few science fiction movies that the UK made in the 1950's. A motley collection of people at a remote hotel in the Scottish Highlands including a scientist, journalist, a small boy and an escaped murderer are visited by a female alien in a tight leather suit from Mars. She lands in a atomic powered flying saucer and is armed with a ray gun and is accompanied by a robot. She has come to Earth to collect men for breeding purposes on Mars! After terrorising everyone and putting a force field around the hotel, she takes the escaped murderer with her at the end and the flying saucer explodes. The cast includes horror regular Hazel Court (The Curse Of Frankenstein, The Masque of the Red Death), John Laurie (Dad's Army), Adrienne Corri (Corridors of Blood) and Patricia Laffan as the Devil Girl, Nyah. I found this movie quite enjoyable, despite the low budget and cheap looking props, especially that robot. A good way to spend just over an hour one evening. Rating: 3 stars out of 5.",
         "A couple things upon which we can all agree: At the time of this production, Patricia Laffan had an absolutely wonderful set of gams, and those gams were very nicely displayed by her Martian costume. Another thing we can all agree upon is that within the parameters of this very genteel English 'Invasion Literature' flick, there is a window into some of the kinky thoughts lurking within the very genteel English writer who penned this yarn. Certainly, this is the one of the quietest and perhaps dullest of the Alien Invader films of the 1950's...the opening credits telegraph this when they tell the audience that this film was based upon the PLAY of the same name. That fact alone, that somewhere upon the British Stage in the early 1950's, someone produced a play titled 'Devil Girl From Mars', is a thing very amusing to contemplate. So yes, this film is quite talkative, and filled with recognizable stage play types as our cast of characters, and containing a prominent subplot involving a romantic and perhaps redeemable escaped murderer...these are the elements that keep this extra-terrestrial tale unduly Earth-bound. Worse, there appears to be a kind of gentlemen's agreement in effect between the eponymous Devil Girl and her earthly opponents to avoid any serious attempts to overcome the other, until the last moments of the film. And after about the first 20 minutes of the story, it is impossible to stop one's mind from repeating the question: Why doesn't the Devil Girl simply liquidate these annoying people since they are of no use to her? But weaknesses aside, it is impossible to hate a 1954 British B-movie about an outer-space dominatrix with fabulous gams wearing shiny black leather and visiting Earth in search of male breeding stock. And besides giving her credit for great gams, I should also credit Ms. Laffan for giving what is actually a very good performance, radiating intelligence and menace, and seeming to be both simultaneously prim and lusty. Also of interest to scifi fans would be the flying saucer design, which is interesting, and the robot, which is not bad. Additionally, Gerry Anderson worked on this pic, as a sound editor, thus beginning his long career in British celluloid scifi. As I said previously, this opus began it's life as a stage play. The same thing is true of the 'Rocky Horror Picture Show,' which also featured a black clad quasi-dominatrix from outer space, stuck in the English countryside. I have to think that the Devil Girl helped pave the way for Dr. Frankenfurter.",
         "The title role in Devil Girl From Mars is played by Patricia Laffan who is probably best known to film viewers as the sultry and evil Poppaea in Quo Vadis. That is all except those who favor camp science fiction. And this film is camp from the opening credits. As is the normal Mars is the infinitely superior planet to Earth, but they've divided their society by sex and the men lost the war to the women years ago. In being enslaved for generations, something's taken the old mating urge out of the male Martians (think about what happened in Zardoz). Patricia Laffan has been sent to Earth to bring back breeding stock and apparently her target is London. But she collides with a meteor and is forced to make a landing in the highlands of Scotland to make repairs. The ship lands on the property of the Bonnie Charlie Inn, a nice country establishment with a few guests, some of whom happen to be scientists. The film other than its Martian connection plays like one of those old closed circle English murder mysteries and this select group of people are going to try to save Earth from being enslaved for their male members. The film is a laugh riot with all the cast playing it so absolutely straight that it comes out funny. Patricia Laffan in that tight get up is an unforgettable sight. Could mating with her and others like her be all that bad? No great production values went into this, but someone in creating it had a great sense of humor."
      ],
      "genres": ["Sci-Fi"],
      "productionCompanies": ["Danziger Productions Ltd."],
      "summaries": ["An uptight, leather-clad female alien, armed with a ray gun and accompanied by a menacing robot, comes to Earth to collect Earth's men as breeding stock."],
      "budget": 0
   },
   "movielensId": 3486,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1954-05-01",
      "dvdReleaseDate": "2000-03-21",
      "directors": ["David MacDonald"],
      "runtime": 77,
      "movieId": 3486,
      "title": "Devil Girl from Mars",
      "mpaa": "",
      "actors": [
         "Hugh McDermott",
         "Patricia Laffan",
         "Hazel Court",
         "Peter Reynolds",
         "Adrienne Corri",
         "Joseph Tomelty",
         "John Laurie",
         "Sophie Stewart",
         "Anthony Richmond"
      ],
      "imdbMovieId": "0046907",
      "originalTitle": "Devil Girl from Mars",
      "genres": ["Science Fiction"],
      "youtubeTrailerIds": ["hOBn-g5VTfM"],
      "plotSummary": "An uptight, leather-clad female alien, armed with a raygun and accompanied by a menacing robot, comes to Earth to collect Earth's men as breeding stock",
      "tmdbMovieId": 24212,
      "avgRating": 2.48438,
      "releaseYear": "1954",
      "numRatings": 64,
      "posterPath": "/rYQrxfPwM7h7Ba0iW0f0iogUHrL.jpg"
   }
}