{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sheriff",
            "id": 798
         },
         {
            "name": "ranch",
            "id": 2752
         },
         {
            "name": "liquor",
            "id": 3423
         },
         {
            "name": "settler",
            "id": 3591
         },
         {
            "name": "revolver",
            "id": 188944
         },
         {
            "name": "two guns belt",
            "id": 222782
         }
      ],
      "imdb_id": "tt0061619",
      "video": false,
      "title": "El Dorado",
      "recommendations": [
         26593,
         15263,
         301,
         16211,
         12584,
         3089,
         17529,
         22201,
         30462,
         11617,
         21717,
         37347,
         13909,
         18647,
         11697,
         22383,
         11897,
         14551,
         17538,
         11209
      ],
      "backdrop_path": "/1PODaFULjnsbkgirmFfm9i0cJB1.jpg",
      "revenue": 6000000,
      "reviews": [{
         "author": "John Chard",
         "id": "5626ef0bc3a368277a000ad1",
         "content": "Big heavyweight movie all round.\r\n\r\nDirected by Howard Hawks and starring John Wayne & Robert Mitchum, it's safe to say that El Dorado comes with some pretty tough credentials. Thankfully the expectation that comes with such a teaming is well and truly met. The plot is a familiar one in the context of Wayne & Hawks, if you have seen Rio Bravo? And liked it? The chances are you will like this one too.\r\n\r\nWayne is Cole Thornton, a hired gun who is asked to come on the payroll of El Dorado landowner Bart Jason (Ed Asner), who is involved with a land struggle with the MacDonald family. But Cole finds his old friend J.P. Harrah (Mitchum) is sheriff of the town, and J.P. advises his old pal that any involvement with Jason will result in J.P. enforcing the law. As it transpires, circumstances between the MacDonald's and Cole lead to Cole taking arms against Jason and his thug followers. So the sheriff, an old Indian fighter called Bull Harris (Arthur Hunnicutt) & a young gambler, who's handy with a knife, called Alan Bourdillion 'Mississippi' Traherne (James Caan), aim to bring down the might of Jason together.\r\n\r\nAdapted from the book The Stars in Their Courses by Harry Brown, this was the second to last film that Howard Hawks would direct. And coming as it did in the late 60s it appears to be somewhat undervalued on the great director's CV. Probably due in no small part to the regard that Rio Bravo is held, of which this is pretty much a remake of. Yet, and I whisper it quietly, El Dorado is arguably the better film in terms of performances and the telling of Hawksian themes.\r\n\r\nGiven that Wayne & Mitchum were good friends away from the screen, it's no great surprise to find the chemistry between them is top dollar. They feed of each others' machismo to deliver a tough picture, yet one that's still joyously fun. The end result is a pic that manages to deftly portray many themes, such as loyalty, togetherness, forgiveness, respect and professionalism. The two principal stars are aided by both Caan and Hunnicutt, who offer a notable young & old side of the mythical West, with age, and ageing, a prominent point of note played out by the knowing director.\r\n\r\nEl Dorado looks to be a film where all involved are comfortable in what they are making. Nothing feels forced or hindered by pointless filler. It's true that the film is more in favour of dialogue over bravado action; though what action there is is adroitly handled by the old hands and the youthful Caan with his sawn off shotgun. This is a story without gimmicks, one which isn't ambling along as an excuse for a shoot out come the end. There's a lot to be said for good old fashioned story telling, and we get that here. Intelligence and sincerity throughout, and it's damn funny to boot, El Dorado is a fine movie that holds up very well in each and every decade that passes. 8/10",
         "url": "https://www.themoviedb.org/review/5626ef0bc3a368277a000ad1"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Cole Thornton",
               "gender": 2,
               "credit_id": "52fe4461c3a36847f8092901",
               "name": "John Wayne",
               "profile_path": "/iw9gHSQj1l3TQeiJb5tNK2N8k2w.jpg",
               "id": 4165,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Sheriff J.P. Harrah",
               "gender": 2,
               "credit_id": "52fe4461c3a36847f8092905",
               "name": "Robert Mitchum",
               "profile_path": "/q8imDThRFNQnfyRxadlBrKzGp4u.jpg",
               "id": 10158,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Mississippi",
               "gender": 2,
               "credit_id": "52fe4461c3a36847f8092909",
               "name": "James Caan",
               "profile_path": "/g4bxNXWft1jLZX8gKk4G6ypkTUf.jpg",
               "id": 3085,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Maudie",
               "gender": 1,
               "credit_id": "52fe4461c3a36847f809290d",
               "name": "Charlene Holt",
               "profile_path": "/sakwwfzGw1GQLmyXSGrtGYBXudd.jpg",
               "id": 50970,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Dr. Miller",
               "gender": 2,
               "credit_id": "52fe4461c3a36847f8092911",
               "name": "Paul Fix",
               "profile_path": "/5uySf96UVra95Ru24YvbjLuiBS5.jpg",
               "id": 8496,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Bull Harris",
               "gender": 2,
               "credit_id": "52fe4461c3a36847f8092915",
               "name": "Arthur Hunnicutt",
               "profile_path": "/iqpMPCj3IMycWhsDgbuOxYgTVJk.jpg",
               "id": 50971,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Josephine MacDonald",
               "gender": 1,
               "credit_id": "52fe4461c3a36847f8092919",
               "name": "Michele Carey",
               "profile_path": "/qI2Lh8azdLw8Mp3m46OcRxKaVBa.jpg",
               "id": 50972,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Kevin MacDonald",
               "gender": 2,
               "credit_id": "52fe4461c3a36847f809291d",
               "name": "R.G. Armstrong",
               "profile_path": "/iyOD1sUIX4SAPbfF4C9C7cI3ayP.jpg",
               "id": 1107,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Bart Jason",
               "gender": 2,
               "credit_id": "52fe4461c3a36847f8092921",
               "name": "Ed Asner",
               "profile_path": "/nUnDLli9zmGQu6UCEU3G4FUdYqQ.jpg",
               "id": 68812,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Nelse McLeod",
               "gender": 2,
               "credit_id": "52fe4461c3a36847f8092925",
               "name": "Christopher George",
               "profile_path": "/fLUsMbuCmXOCQspKNg2vKSuhDMu.jpg",
               "id": 29312,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Maria",
               "gender": 1,
               "credit_id": "52fe4461c3a36847f8092929",
               "name": "Marina Ghane",
               "profile_path": "/eAXzjw65dE6eVaActjWRWBZhlQj.jpg",
               "id": 50973,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Milt",
               "gender": 2,
               "credit_id": "52fe4461c3a36847f809292d",
               "name": "Robert Donner",
               "profile_path": "/6GXjsXEC5a0BoFwq1pad5OqJ5M9.jpg",
               "id": 13875,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Pedro",
               "gender": 2,
               "credit_id": "52fe4461c3a36847f8092931",
               "name": "John Gabriel",
               "profile_path": null,
               "id": 50974,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Luke MacDonald",
               "gender": 2,
               "credit_id": "52fe4461c3a36847f8092935",
               "name": "Johnny Crawford",
               "profile_path": "/lqdYjY2tX39Y7yfROz9OVx1UZkG.jpg",
               "id": 50975,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Matt MacDonald",
               "gender": 2,
               "credit_id": "52fe4461c3a36847f8092939",
               "name": "Adam Roarke",
               "profile_path": "/5IdiAw6U0djj52cZ09Sx0hWUcHD.jpg",
               "id": 39770,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4461c3a36847f80928f7",
               "name": "Harry Brown",
               "profile_path": null,
               "id": 4357,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 1,
               "credit_id": "52fe4461c3a36847f80928fd",
               "name": "Leigh Brackett",
               "profile_path": "/zJ4NaZQAAPbsHbpNuCJjfsSItUo.jpg",
               "id": 4298,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4461c3a36847f809293f",
               "name": "Howard Hawks",
               "profile_path": "/yekSHa7JRzGMg0M7X4HP530GeyV.jpg",
               "id": 11435,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4461c3a36847f8092945",
               "name": "Howard Hawks",
               "profile_path": "/yekSHa7JRzGMg0M7X4HP530GeyV.jpg",
               "id": 11435,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4461c3a36847f809294b",
               "name": "Nelson Riddle",
               "profile_path": null,
               "id": 4360,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4461c3a36847f8092951",
               "name": "Harold Rosson",
               "profile_path": "/iaCiQJnVexTWFyfcvnamRICx8XQ.jpg",
               "id": 9057,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4461c3a36847f8092957",
               "name": "John Woodcock",
               "profile_path": null,
               "id": 50976,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4461c3a36847f809295d",
               "name": "Carl Anderson",
               "profile_path": null,
               "id": 31204,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "52fe4461c3a36847f8092963",
               "name": "Paul Helmick",
               "profile_path": null,
               "id": 95744,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4461c3a36847f8092969",
               "name": "Hal Pereira",
               "profile_path": null,
               "id": 5188,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 1,
               "credit_id": "56ba24689251417186000025",
               "name": "Charlsie Bryant",
               "profile_path": null,
               "id": 17916,
               "department": "Directing",
               "job": "Script Supervisor"
            }
         ]
      },
      "genres": [{
         "name": "Western",
         "id": 37
      }],
      "popularity": 8.809697,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 6644,
      "vote_count": 127,
      "budget": 4653000,
      "overview": "Cole Thornton, a gunfighter for hire, joins forces with an old friend, Sheriff J.P. Hara. Together with an old indian fighter and a gambler, they help a rancher and his family fight a rival rancher that is trying to steal their water.",
      "similar": [
         9394,
         49849,
         11509,
         301,
         11897,
         11967,
         9086,
         12501,
         9825,
         68077,
         5698,
         37414,
         22660,
         13496,
         49397,
         26502,
         15264,
         84900,
         208897,
         111942
      ],
      "original_title": "El Dorado",
      "runtime": 120,
      "poster_path": "/jnbUOe6dAXK4Hs6dhYgvmdr5CbO.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
            "name": "Paramount",
            "id": 4,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Laurel Productions",
            "id": 10697,
            "origin_country": ""
         }
      ],
      "release_date": "1966-12-17",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "It's The Big One With The Big Two!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Howard Hawks"],
      "runtime": 126,
      "synopsis": "In the Broken Saloon at El Dorado, two old friends meet up again. Sheriff J.P. Harra (Robert Mitchum) greets Cole Thornton (John Wayne) with a pointed rifle.They've both been friends since before and during the civil war.But J.P has heard his friend now works for Bart Jason (Edward Asner). Thornton admits that Jason has offered him good money, but he doesn't know what he has to do to earn it. J.P explains \"Jason showed up here around the end of the civil war with a pocketful of money and nobody could find out where he got it, but everybody else around here was broke Having money, he started to grow, but now he needs more water There's only one place to get it; trouble is, somebody was there ahead of him, about 20 years ahead - his name is Kevin MacDonald (R. G. Armstrong).MacDonald has four boys and a girl. The whole family have worked real hard.Hung together through the rough times; now things were looking up, MacDonald was not ready to sell, so he's holding out and Jason was pushing, and now I'm standing right in the middle\". Saloon owner Maudie (Charlene Holt) walks in and throws her arms around Cole.She bursts out laughing when she realises that her old flame and her current one are friends.Cole gave her a stake some time earlier to help her sort out her money problems when her gambling husband was killed. Thornton goes off to Jason's ranch to tell him that he's not going to work for him.Warned that Thornton has gone to Jason's, MacDonald has left his youngest boy Luke out on the hills to do a man's job and look out.But whilst keeping watch,he falls asleep and when he wakes up he jumps and shoots down at Thornton.Instinctively Thornton shoots him down.Thornton rides to him and is upset to see the boy's age.He tries to make him feel comfortable but Luke is in agony.While Cole has his back turned to him,he pulls out his gun and kills himself. Thornton takes the body to Luke's father's place and explains what happened.Luke's sister, Joey (Michele Carey), a tomboyish,wild cat in buckskin pants doesn't believe him and tries to kill him. Her brother stops her and her father asks her to get in the house.But she angrily rides off. Macdonald thanks Cole for returning his boy but Cole feels guilty and rides off.On his way back,Joey ambushes Cole at a creek, dropping him with a rifle bullet. He manages to get back on his horse and escapes to Maudie's place, where Doc Miller (Paul Fix) treats him. The bullet is lodged dangerously close to his spine,but the elderly doctor says he's not equipped to deal with it and to find a better surgeon for the bullet's removal.After a short time,Thornton leaves El Dorado,much to Maudie's disappoinment. Several months later,Cole arrives in a town near the Mexican border and has dinner a the local cantina.A young man nicknamed Mississippi (James Caan) enters and confronts one of four men sitting at a dinner table, reminding him if he remembers him or if he remembers the black hat he is wearing? Mississippi's closest friend,mentor and father figure was accused of cheating at cards two year earlier and was killed.He says he caught up with the man's other three companions and he killed them all. He asks the last of the murderers to stand up.Mississippi isn't wearing a gun,Instead he kills the man with a knife.As one of the men tries to shoot him,Cole shoots his hand and steps in.One of the men sitting at the table is Nelse Macleod (Christopher George),a dark thin faced man with a scar down the left side of his eye and cheek.Along with Cole and J.P he's one of the most dangerous gunslingers in the territory.Cole discovers that he's the latest gunslinger that Bart Jason has offered good money to work for him.Not only that but he also tells him that J.P won't be a threat because he's been an alcoholic for months.Cole and Mississippi get ready to walk out of the cantina,but Cole stops him.He knows Macleod will have some men waiting for them to shoot and he tells him to call the men off.Mississippi feeling grateful that he's saved his life twice,joins him for a meal. Cole soon finds out that Mississippi cannot shoot a all.He stops off at at an old friend's and gets him a shotgun to use.Cole and Mississippi arrive in El Dorado and stop off at Maudie's to find out if any strangers have been hanging around.She says no and she tells him the full extent of J.P's alcoholism.Cole goes over to the sheriff's office with Mississippi and finds Bull on guard outside - who has been trying to keep law and order all on his own for the last few months.Cole goes inside to wake up J.P who's asleep in the cell.He throws some water over him to wake him up.J.P punches him and and Cole knocks him out with a pan to his head.Mississippi makes some special drink in order to keep him off the booze.With the black looking liquid in his system,any alcohol J.P drinks afterwards will just make him feel sick. The next afternoon,Bart Jason arrives in town and waits in the saloon for Nelse Macleod to turn up.At the same time,the Macdonald family arrive for their weekly town shopping.Bull goes off to keep an eye on the Macdonald's and tells Colt he'll blow on his trumpet if there's any trouble.Later at night,J.P gets up,looking for some alcohol.Cole tells him they've got rid of it all.J.P goes over to the saloon to get a bottle of whiskey and Bart and Macleod start laughing at him.He walks back in shame.Gunshots are heard and Bull blows the trumpet.Cole and Mississippi run out and find one of Macdonald's boys wounded.Cole,J.P,Mississippi and Bull search the town for the gunmen responsible.A woman comes to the window and tells Missisisppi that she saw a few men take off down the street towards he church.A gunfight breaks out and two of the men are killed but the man with the limp gets away.They follow him into Jason's saloon.JP is angry from the humilitating he had earlier and he wants to prove what he's made of.Everyone denies seeing a man enter but the pianist looks nervous.J.P tells him to get out of the way and begins firing his rifle at the piano.The gunman comes out from hiding and starts shooting but J.P kill him.The barman goes for a gun but J.P shoots the top of the bar and a load of wooden splinters go through his hand.J.P approaches the men who were laughing at him earlier.He hits one man in the stomach with the rifle and whacks Jason over the face.He's ready to shoot him but Cole intervenes.J.P calms down and arrests him. As they are taking him to jail,Mississippi sees someone pointing a gun at them from the stable and goes to check it out.He grabs the person and sees it's a woman,in fact Joey,who was trying to get a shot at Bart for revenge.He takes her over to the jail to confirm that it's her.She asks J.P if Jason will get what he deserves.He says it's up to the judge.She thanks them for what they've done and leaves. Cole and Mississippi walk around the town on nightwatch and some of Jason's men come riding along.Mississippi dives into the street right in front of the horses hooves.The horses jump over him and he shoots one of the men.J.P comes running out of the office and takes a bullet in the leg.As Cole tends to his wound inside,he asks Mississippi why he dived under the horses and he tells him that you can't shoot properly while your horse is jumping in the air and an horse won't step on a person. The doctors are in the office removing the bullet from J.P's leg.They tell Cole that it would be a good idea for him to have the bullet removed from his back.Cole tells them if he survives all the trouble with Jason's men,he'll have it taken care of. J.P is feeling restless and frustrated and trying to control his need to drink.He comes up with the idea to lock themselves away in the office with some food and water until the U.S marshal arrives to pick Jason up.Bull recommends that he cleans himself up if they're going to be confined together.While J.P takes a bath,Joey and Maudie bring some things around for them to last them unil the marshal's arrival.Cole gets angry with her and tells her that it's best for her to stay away because Jason's men might use her to get Jason back from them. Later at night,a friend of Maudie's arrives with a note from Maudie saying that Macleod's men have been hanging around her place and that she's heard that they've got something planned.Cole and Mississippi go over to to the saloon but a gunman starts shooting at them.They chase him through the saloon,out to the back door.Two men tell them the person went out the back door.Mississipi recognises the men as Milt and Pedro.Mississippi remembers the incident from their previous encounter.Cole asks if him anyone's waiting outside for them.Milt says no but Cole tells him to ealk out.Milt doesn't want to but Cole shoots him in the arm and tell him to go.Milt says he lied,there's somebody out there.Cole shoots him in the leg.With no choice,Milt runs out of the doors shouting not to shoot but he is blown away.Cole tells Pedro to go next but as he is trying to force him out the doors,he starts suffering with the numbness down his arm again.He falls to the floor in pain.Pedro goes for his gun and Mississippi kills him but is knocked out from behind. Mississippi and Maudie go to the office through the back door to tell them what's happened.Macleod has Cole and wants to trade him for Jason.J.P reluctantly agrees.He frees Jason and he,Cole,bull and Mississppi flee town and hide out at his place.Bull is suspicious that Macleod let them get out of town too easily. Joey turns up to tell them that her brother Saul has been kidnapped by Jason and he will only be returned if the Macdonald ranch is handed over to him.With Bull's age,Mississippi's poor shooting skills and Cole and J.P's crippled condition,the odds are stacked against them.Cole realises he can still use a rifle with one hand so they hatch a plan. They ride back into town.Cole arrives on a wagon in front of the saloon to confront Macleod who has Jason and a few men at his side,while a few of the other men keep watch over Saul in the saloon.J.P,Mississippi and Bull go through the back door to get behind them.Bull fires an arrow into the back of one of Macleod's men and blows his bugle which distracts Macleod long enough for Cole to jump from the wagon and gun him down.J.P and Mississippi handle the rest of the men inside.Jason goes to grab one of Macleod's guns to kill Cole but Joey is hiding in the distance and shoots him first.Cole thanks her for saving his life.He walks over to Macleod as he lays dying.He says to him \"You never gave me a chance at all did you\".Cole replies \"No I didn't.You're too good to give a chance to\".Macleod dies. The story ends as Cole has his leg wrapped up from scatter shot from Mississppi who accidentally caught him with his shotgun during he gunfight..Mississippi goes off to talk to Joey,Cole goes off to see Maudie and J.P and Bull have a drink while J.P tells him he needs him as his deputy.The story ends with Cole and J.P both now limping down the street as Cole prepares to leave town and J.P has gained his self respect back.",
      "writers": [
         "Leigh Brackett",
         "Harry Brown"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0061619/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNjEwNTQwMjM1Ml5BMl5BanBnXkFtZTgwMzIwOTYxMTE@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: John Wayne, Robert Mitchum, James Caan | See full cast and crew »"],
      "reviews": [
         "Unless you count their joint appearance in The Longest Day, El Dorado deserves its place in Hollywood history for being the only co-starring effort of John Wayne and Robert Mitchum. Besides being good friends Wayne and Mitchum were both known for being able to drink just about anyone else in the film business under the table and still report to work in the morning, lines letter perfect. But Mitchum was not allowed in the Wayne home because Pilar Wayne never forgave him for ruining their honeymoon when Mitchum backed out of Blood Alley and Wayne had to star as well as produce it. I also think that the Duke was leery about Mitchum stealing too many scenes which he does when they are on the screen together. In this tighter and faster remake of Rio Bravo, Wayne is his usual stand up hero, rough and tough, but who lives by a code. Mitchum is the flawed one. During an interlude of several months in the film, Mitchum becomes enamored of an unseen woman, loses her, and becomes a drunk. Which leads me to one of the funniest scenes ever in a Wayne film. When Christopher George and fellow gunmen are hired by villain Ed Asner to run R.G. Armstrong and his family off their ranch, Wayne has to sober up Sheriff Mitchum and fast. Every time I watch El Dorado, I get hysterical every time I watch James Caan pour a homemade remedy down Mitchum's throat with Wayne and Arthur Hunnicutt holding him down. And the reactions afterwards, absolutely priceless. This is where Mitchum steals the movie. As in many a Howard Hawks film, there is a theme of professionalism that runs through it. Whether it's Cary Grant and his fellow pilots flying over treacherous terrain in South America, Humphrey Bogart with his charter boat business in the Caribbean, or Wayne and Mitchum going up against fellow professional Christopher George, it's doing the job and doing it well for it's own reward. The final gunfight is also a classic. Let's just say that Mitchum and Wayne are not at their best, but they make up for it with some help from interested friends. This is one of the best films, in the top 10 for both these guys and shouldn't be missed.",
         "every once and a while me and my father will buy a classic western no matter how cheesy or weird it may look, today he came home with this movie El Dorado, at first i was expecting not too much due to how many westerns that were made, though i should have thought better whenever i saw that it starred two great film actors John Wayne and Robert Mitchum. i may be young(16) but i know good actors when i watch them on screen these two played beautifully off each other and so did another great actor James Caan all the characters were played to perfection, even though anyone can play an alcoholic sheriff with a broken-heart Mitchum really made the role shine, of course John Wayne did wonderful as The Hired Gun, but my favorite role was that of Mississipi played by James Caan, in my opinion he did an astonishing job in this role and the scenes with him and Wayne were glorious. Now some older ladies and gents may find it hard to follow the recommendation of a 16 year old but it is seriously one of my favorites of the ones me and my father have seen in a lil side note the action scenes were done really well and there was also a slight editing issue during one of the scenes I'm sure you'll notice(but you must take into consideration the time when the movie was made) thank you and you really must see this movie that could never be done today due to the fight between stars in leading roles.",
         "This was a pretty solid western, one I enjoyed more than I thought I would. What I liked about it were the interesting characters and the fact it was nicely filmed, as westerns tend to be. People focus on the big stars of this film and often miss how good the visuals are in here. John Wayne, Robert Mitchum and James Caan all played characters that were fun to watch. When I first saw this about 10 years ago, it was a shock to see how young Caan looked. It had to be one of his first films. Six years after this, he made it big in \"The Godfather.\" Wayne and Mitchum, of course, were already major motion picture celebrities and I liked the way they traded off each other in this movie. It was really good to see these two guys in the same film. With those two, and the nice photography, this would be a good pickup on DVD.",
         "As someone who has run a cultural cinema for over thirty years and programmed thousands of great films from the whole history of the cinema from Lumiere Bros forwards, I am often asked what I regard as the greatest film ever made. El Dorado is NOT the greatest film ever made (though it deserves consideration), but it IS my favourite of the thousands and thousands of films that I have seen. Why is this? Firstly, it is heroic. It announces this in the credit sequence of Olag Wieghorst's paintings of the old west, and delivers throughout its length right up to the final adrenalin gushing walk of the two old and failing gunfighters along the street in a town that they have made fit to live in. Secondly, it is sensationally subtle in its mise en scene. Look at the scene where the crippled Cole Thornton is exchanged for Bart Jason. After the exchange has been made, Cole is seen on the right hand side of the screen lit in warm hues by the table lamp. JP and Bull, who made the exchange, on the other hand are coolly lit (cool meaning not hot, please) by the greenish oil lamp. I cannot think of a more subtle use of lighting to express emotional relationships in all cinema. Camera and character movement within the frame are also brought to a new high. Look at the shot when Bull announces that Cole is leaving. It follows naturally from his (Bull's) spectacular entrance and results in a two-shot with Maudie whom we know loves Cole... then Bull, having, unknowingly, dropped the bombshell of Cole's departure moves out of frame to the right and the camera moves just far enough to put Maudie centre frame as we see the pain that the news gives her... Thirdly, it integrates its humour throughout the long and complex drama. Structurally the use of Bull and Mississippi as foils for JP and Cole is a complete masterstroke. Finally it is one of the most emotionally satisfying films I can remember. I weep in the closing moments every time I see it because I realise that I am about to lose these wonderful, wonderful characters who have transported me into a kind of heaven for the past two hours. So who do we mainly thank for this most magnificent film? I really must read Harry Brown's novel from which the screenplay was adapted... but I do know that as far as I am concerned Leigh Brackett is the greatest female script-writer - indeed greatest female film artist behind the camera - and not just because of this work. And when she worked with Howard Hawks glory almost invariably followed. I've already mentioned Olaf Wieghorst's paintings, which are also monumentalised by the title song - praise be to Nelson Riddle and John Gabriel (who plays Pedro) - which I would feel honoured to have played at my funeral. Then there is the small matter of John Wayne and Robert Mitchum - two towering stars who had by then become great actors, and magnificently naturalistic cinematography by Harold Rosson whose career spanned to almost 150 films as cinematographer with credits including Docks of New York, The Wizard of Oz, Singin' in the Rain and this, his last film, into which he put all of his love and artistry. Which brings us to Howard Hawks, the most unpretentious artist of the cinema, and one of its greatest. I know this film is a kind of remake of Rio Bravo, and he went on to do it again with Rio Lobo, but for me, this is his last full work - his health was failing on the shoot of Rio Lobo. There is something special in the last works of (some)truly great directors ... look at Gertrud, or Family Plot, or The Dead. It as though they are saying to us... 'OK... I'd like to do it over a dozen or so films, but I'm going to show you the real cinema in just one, because I might not get another chance....' So just the same as in Family Plot were Hitchcock's generosity and artistry come together in the biggest slice of cake he ever delivered, here Hawks gives us a kind of sublime perfection of cinematic structure and expression. One film to a desert island? This is it...",
         "In the Broken Saloon at El Dorado, two old friends, each with a reputation, meet again\u0085 But Sheriff J.P. Harrah (Robert Mitchum) greets Cole Thornton (John Wayne) with a pointed rifle\u0085 Harrah has heard his friend works now for Bart Jason (Edward Asner). Thornton admits Jason offered him good money but he doesn't know what he has to do to earn it\u0085 Harrah explains that Jason showed up here around the end of the war with a pocketful of money and nobody could find out where he got it, but everybody else around here was broke\u0085 Having money, he started to grow\u0085 But now he needs more water\u0085 There's only one place to get it\u0085 Trouble is somebody was there ahead of him, about 20 years ahead\u0085 His name is Kevin MacDonald (R. G. Armstrong). MacDonald got four boys and a girl\u0085 All worked real hard\u0085 They hung together through the rough times and how things were looking up, MacDonald was not ready to sell\u0085 So he's holding and Jason was pushing, and the sheriff was standing right in the middle\u0085 Warned that Thornton has gone to Jason's, MacDonald has left his youngest boy out there to do a man's job\u0085 He went to sleep\u0085 When Cole came by, Luke (Johnny Crawford) woke up, jumped up and started firing his gun\u0085 All Cole was seeing was somebody shooting at him from the rocks\u0085 Thornton, thinking himself the target, shoots and drops the boy \u0085 Luke explains the error then\u0085 To escape the pain of his mortal wound, he kills himself\u0085 Thornton takes his body to his fathers' place, and after he explains what happened, his sister, Joey (Michele Carey), a wild cat in buckskin pants who didn't believe him, tried to kill him\u0085 Her brother stops her and her father asks her to get in the house\u0085 After Thornton leaves the ranch, Joey (Michele Carey) ambushes Cole at a creek, dropping him with her riffle bullet\u0085 He manages to get back on his horse and escapes to Maudie's place, where Doc Miller (Paul Fix) treats him\u0085 The bullet was dangerous up against his spine, however, as Doc advises him to find a better surgeon for the bullet's removal\u0085 After a short time, Thornton leaves El Dorado\u0085 One of the best moments in the film came in a Cantina near the Mexican border when James Caan (Mississippi) enters the place and calls one of four men sitting at a dinner table, reminding him if he remembers him or if he remembers the blue hat he is wearing? Mississippi says he caught up with his other three companions and he killed them all, and that he was the last of the four\u0085 He asks him to stand up\u0085 and as the audience observed, Mississippi wasn't wearing, at all, any gun\u0085 Obviously, when Jason just brought his outfit into town, the action started\u0085 Robert Mitchum is 'the tin star with a drunk pinned on it.' He was too mad to be scared and too sick to worry about it.. Charlene Holt plays Maudie the gambler's widow who throws her arms around Cole, sees Harrah, and bursts out laughing when she finds her old flame and her current one are friends\u0085 She tells the sheriff that Cole gave her a stake, and helped her get on her feet\u0085 Michele Carey plays Joey, the wild girl who thinks that Mississippi looks a lot better without that silly hat\u0085 Christopher George plays Nelse McLeod, a dark, thin-faced man with a scar on his eye\u0085 \"El Dorado\" was the third of four Westerns that Howard Hawks made with John Wayne\u0085 Hawks' massive reputation as a director of Westerns virtually rests on just two films (\"Red River\" & \"Rio Bravo\") but these two are sufficient to reveal a highly skilled, intuitive filmmaker, and one who has managed to satisfy large audiences and serious critics alike within a commercial system\u0085",
         "\"El Dorado\" pairs up two great movie stars in their element-the western. This was the first time John Wayne and Robert Mitchum had co-starred in a western, and the result was good, solid western entertainment. One wishes it could have happened again. The Duke plays Cole Thorton, a gunman, who has been hired by a land baron in Texas to assist in taking over some much-needed water land, and, if necessary, put an end to interference that the sheriff, played by Mitchum, would offer. Unbeknownst to the land baron, Thorton and J.P.Harrah are friends from the war, and Thorton decides to ride away from the job. A few months later, Thorton returns to El Dorado to warn Harrah that a new threat will be coming to the town, and he finds that the sheriff has become the town drunk, due to a fouled-up romance. Thorton now has to help J. P. get his skill back, prevent the range war from busting out, while keeping a young sidekick, Mississippi, played by James Caan, alive and healthy. There is also a good performance turned in by Arthur Hunnicutt, as Bull, J.P.'s deputy who stands by the sheriff, even in times of drunken sprees. There are some similar elements to other Wayne films, notably \"Rio Bravo\" and \"Rio Lobo\", but the chance to watch two big stars work off each other, makes this one easy to take.",
         "The credits claim that Leigh Brackett's screenplay for 1967's \"El Dorado\" is based on a novel, \"The Stars in Their Courses\" by Harry Brown. The on-screen evidence indicates it was based on Brackett's own script for 1959's \"Rio Bravo,\" in which John Wayne is a gunfighter joined by his buddy, a drunken sheriff, in guarding a town against a corrupt cattle baron. They are joined by a callow but dangerous youth, and a curmudgeonly deputy. In \"Rio Bravo,\" these roles were admirably filled by Dean Martin, Ricky Nelson, and Walter Brennan. In \"El Dorado,\" the Duke once again takes on the gunfighter role, but is joined this time by Robert Mitchum, James Caan, and Arthur Hunnicutt. Nothing wrong with that lineup, even though Caan can't sing like Ricky (Mitchum could probably do a fair imitation of ol' Dino, though). Like \"Rio Bravo,\" this one is directed by Howard Hawks who liked to steal from his own movies. Several scenes in \"El Dorado\" are nearly exact duplicates of moments from \"Rio Bravo\" (Mitchum blasts holes into a piano when he suspects that the pianist's off-key playing denotes fear of the killer hidden behind it, whereas Martin found his prey in a saloon balcony after spotting blood dripping into a shot glass). \"El Dorado\" is faster paced than the first film, but then it has a shorter running time. It's a pleasure through and through, but \"Rio Bravo\" is superior. In the latter film, you almost feel that you're holed up with the Duke, Dino, Ricky, and Walter, rather than just watching them.",
         "This many not be the best western ever made, but it looks like an epic and is more fun than most movies by a hoot and a holler. It's got direction by Howard Hawks, characters, and people who actually talk to each other in intelligent dialogue and have to think, all set in a beautiful Western locale. John Wayne ably plays a man who has faces several challenges, in this fine screenplay by Leigh Brackett (of \"The Big Sleep\" and \"Rio Bravo\" fame). The challenges have to do with helping his hard-drinking friend, the Sheriff played by Robert Mitchum, combating a gang of badmen headed by powerful Edward Asner, and the fact that he's been shot in the back by mistake and that the pain causes him to be unable to move at inconvenient times. The production has a fine title sung by the great Ed Ames, titles by noted western artist Olaf Weighorst (who also appears as a gunsmith),; and its technical production is truly outstanding in every department Other actors contributing to this near-masterpiece of entertaining film-making include Arthur Hunnicutt, R.G. Armstrong, Christopher George and Charlene Holt in her best screen role ever. Outstanding contributions were made by Nellie Manley and Wally Westmore on hair and makeup, Edith Head on costumes and many others. Altogether a very-satisfying, adult and physically beautiful color western; writer Brackett was asked by Wayne to include the saloon scene from \"Rio Bravo\" in a rewritten version, and it works just as well here; the major change is James Caan as Alan Trehearne, plus the change of cast to Mitchum, Hunnicxuut and Holt, who are all very good indeed.",
         "Another western which has a theme of a greedy rancher who wants to grab a neighbor's land for water rights and uses his hired guns to achieve his ends. Enter John Wayne with his fast draw and sense of fair play to even the odds in a good but predictable movie. The picture has a talented cast and beautiful vistas of the old west and good action as the two ranchers and their men are locked in a range war with high stakes for the winner. The picture mixes gunslinging with touches of humor along the way to good effect. Robert Mitchum is okay as a drunken sheriff, a departure from his usual tough-guy roles. Arthur Honnicutt and James Caan have nice roles and tomboy Michelle Carey is okay as a wild cowgirl. The music and vocals are good and the watercolor paintings shown during the opening credits depict nice wild west scenes.",
         "It's hard not to smile as you watch this film play itself out. There are just too many fine actors and top notch performances contained in this film for it to be anything but outstanding. Howard Hawks knows just how to harness this story and give each actor room enough to strut his stuff. John Wayne plays a hired gun who comes to the aid of a drunken sheriff played to perfection by Robert Mitchum. By Wayne's side is a young man (James Caan) packing a nasty scatter-gun, and also at their disposal is a grizzled Indian fighter deputy (Arthur Hunnicutt). The four do battle with an evil land owner (Ed Asner), his hired gun (Christopher George), and several other gunslingers looking for trouble. A rival family of landowners named the MacDonalds are being pressured by Asner and his cronies. Wayne and Co. take their side, and all hell breaks loose in El Dorado. The film is crisply paced, well-written, and the acting as good as you might expect. Even actors like Caan and Asner who might seem out of their element fit right in and hold their own. Wayne is as watchable as ever. It's a treat just to hear him say the word \"Mississippi\" every time he refers to Caan. Mitchum has the more demanding of the two lead roles, and it's no wonder Wayne wanted that role for himself. The toughest thing our heroes are faced with is sobering him up as he has become the laughing stock of the town he is supposed to protect. Arthur Hunnicutt, as Mitchum's deputy, seems to get a lot of the good lines and more than proves his worth when things get tough. Another person who stands out is Michele Carey who portrays one of the MacDonald clan. I'd never really heard of her before, but the woman is stunningly beautiful. She plays a resourceful woman out to kick some Asner butt. Between the numerous shootouts, there are wonderful scenes where you can tell the stars are just happy to stand together in front of the camera. There are a few scenes that really weren't beaten to death by the genre and actually look original. A shootout involving church bells was something I hadn't seen before, though I'm hardly an expert in western lore. I wouldn't be surprised to find that someone had done it before, but it really worked in this film. Also, it was neat to see Caan blow some of the bad guys to shreds with his shotgun. That was an under-utilized weapon in old western films. His brief impersonation of a Chinaman is bound to offend some, but it's actually quite entertaining. If you love a good western, you must not miss El Dorado. Even if you don't normally watch them, you might also find it more than worth your time. 9 of 10 stars. The Hound."
      ],
      "genres": ["Western"],
      "productionCompanies": [
         "Paramount Pictures",
         "Laurel Productions"
      ],
      "summaries": [
         "Hired gunman Cole Thornton turns down a job with Bart Jason as it would mean having to fight an old sheriff friend. Some months later he finds out the lawman is on the bottle and a top gunfighter is heading his way to help Jason. Along with young Mississippi, handy with a knife and now armed with a diabolical shotgun, Cole returns to help.",
         "Cole Thornton, a gunfighter for hire, joins forces with an old friend, Sheriff J.P. Hara. Together with an old Indian fighter and a gambler, they help a rancher and his family fight a rival rancher that is trying to steal their water."
      ],
      "budget": 0
   },
   "movielensId": 3487,
   "movielens": {
      "languages": [
         "English",
         "Español"
      ],
      "releaseDate": "1966-12-17",
      "dvdReleaseDate": "2000-03-21",
      "directors": ["Howard Hawks"],
      "runtime": 120,
      "movieId": 3487,
      "title": "El Dorado",
      "mpaa": "NR",
      "actors": [
         "John Wayne",
         "Robert Mitchum",
         "James Caan",
         "Charlene Holt",
         "Paul Fix",
         "Arthur Hunnicutt",
         "Michele Carey",
         "R.G. Armstrong",
         "Ed Asner",
         "Christopher George",
         "Marina Ghane",
         "Robert Donner",
         "John Gabriel",
         "Johnny Crawford",
         "Adam Roarke"
      ],
      "imdbMovieId": "0061619",
      "originalTitle": "El Dorado",
      "genres": ["Western"],
      "youtubeTrailerIds": [
         "pS6NbxZYU9o",
         "cfyNKlxDz6k"
      ],
      "plotSummary": "Cole Thornton, a gunfighter for hire, joins forces with an old friend, Sheriff J.P. Hara. Together with an old indian fighter and a gambler, they help a rancher and his family fight a rival rancher that is trying to steal their water.",
      "tmdbMovieId": 6644,
      "avgRating": 3.63805,
      "releaseYear": "1966",
      "numRatings": 565,
      "posterPath": "/jnbUOe6dAXK4Hs6dhYgvmdr5CbO.jpg"
   }
}