{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "radiation",
            "id": 1618
         },
         {
            "name": "lizard",
            "id": 5703
         }
      ],
      "imdb_id": "tt0052888",
      "video": false,
      "title": "The Hideous Sun Demon",
      "recommendations": [
         44693,
         44586,
         3165,
         100661,
         38260,
         27304,
         92804,
         112481
      ],
      "backdrop_path": "/ar2YlbMteHklArpA9tMrx5s2UWP.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Dr. Gilbert McKenna",
               "gender": 2,
               "credit_id": "52fe45b1c3a36847f80d54d5",
               "name": "Robert Clarke",
               "profile_path": "/9xnaWYIQUKdgFVrn76yeIg0H0RG.jpg",
               "id": 30453,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Ann Russell",
               "gender": 0,
               "credit_id": "52fe45b1c3a36847f80d54d1",
               "name": "Patricia Manning",
               "profile_path": null,
               "id": 125312,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Trudy Osborne",
               "gender": 1,
               "credit_id": "52fe45b1c3a36847f80d54e5",
               "name": "Nan Peterson",
               "profile_path": null,
               "id": 97574,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Dr. Frederick Buckell",
               "gender": 2,
               "credit_id": "52fe45b1c3a36847f80d54e9",
               "name": "Patrick Whyte",
               "profile_path": null,
               "id": 151895,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Dr. Jacob Hoffman",
               "gender": 0,
               "credit_id": "52fe45b1c3a36847f80d54ed",
               "name": "Fred La Porta",
               "profile_path": null,
               "id": 1054351,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45b1c3a36847f80d54db",
               "name": "Tom Boutross",
               "profile_path": null,
               "id": 1006929,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45b1c3a36847f80d54e1",
               "name": "Robert Clarke",
               "profile_path": "/9xnaWYIQUKdgFVrn76yeIg0H0RG.jpg",
               "id": 30453,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45b1c3a36847f80d54f3",
               "name": "E.S. Seeley Jr.",
               "profile_path": null,
               "id": 1007265,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe45b1c3a36847f80d54f9",
               "name": "Robert Clarke",
               "profile_path": "/9xnaWYIQUKdgFVrn76yeIg0H0RG.jpg",
               "id": 30453,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 0.495094,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 41038,
      "vote_count": 6,
      "budget": 0,
      "overview": "After exposure to radiation, an atomic research scientist finds himself changing into a murderous, lizard-like creature every time he is exposed to sunlight.",
      "similar": [
         93856,
         988,
         9738,
         44896,
         201088,
         154,
         12502,
         1678,
         193687,
         188924,
         11071,
         21168,
         12516,
         4953,
         52454,
         3160,
         18274,
         29959,
         29062,
         27895
      ],
      "original_title": "The Hideous Sun Demon",
      "runtime": 74,
      "poster_path": "/pV463n3nL8iH78PQC7MvHIpsRGB.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Clarke-King Enterprises",
         "id": 22220,
         "origin_country": ""
      }],
      "release_date": "1958-08-28",
      "vote_average": 4.3,
      "belongs_to_collection": null,
      "tagline": "The Blaze Of The Sun Made Him A Monster!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": [
         "Robert Clarke",
         "Tom Boutross"
      ],
      "runtime": 74,
      "synopsis": null,
      "writers": [
         "E.S. Seeley Jr.",
         "Doane R. Hoag"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0052888/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk1Mzc2MTEzMl5BMl5BanBnXkFtZTcwMjg3MzEyMQ@@._V1_SY317_CR9,0,214,317_AL_.jpg",
      "actors": ["Stars: Robert Clarke, Patricia Manning, Nan Peterson | See full cast and crew »"],
      "reviews": [
         "Talk about a family project! In addition to writing, directing, editing and starring in this film Robert Clarke got his own family, his in-laws and even close family friends involved! It just goes to show what a family can accomplish if they stick together. Many people include this movie when talking about Bad \"B\" Films. Well it isn't so bad, in fact it is quite imaginative and has one of the better monster costumes. Okay so the dialog could have used a re-write but some of the lines are instantly classic. What lines? How about: \"I've told him before that bourbon and water go together, not bourbon and radiation!\". The plot? Clarke is a scientist who cannot stay off the booze and as a result gets a mega-dose of radiation. Quicker than you can say \"Oh and now I suppose he's going to mutate.\" he sure does. Sunlight causes him to evolve backwards and change into a scaly lizard like monster. This is because, as a doctor explains, we pass through many stages of evolution while we are in the embryonic stage. At one time we even resemble lizards. Gosh I never knew that; who says movies aren't educational? The movie does have a few legitimate scary moments. Take that scene where Ann Russell goes to the door expecting to see Clarke but instead the Sun Demon rushes right into the camera! That scene scared the heck out of me when I was a kid. Our first look at the Sun Demon is well staged too. We only get a 1 second glimpse but we know something terrible has happened. Okay so Clarke goes a little overboard acting-wise sometimes but remember that a lot of us might react in the same way of we found ourselves in that position. (Then again a lot of us would probably run to the nearest hospital after the first transformation too but just keep repeating \"It's only a movie . . .\") DVD prints have restored the infamous \"rat scene\" which was clipped for TV. The Sun Demon picks up a rat in one scene and crushes it in his hand. In reality the rat was not harmed, Clarke took a real rat and just covered it with ketchup and that is what's dripping between his fingers. Did you know that when this film was brand new it played on a double bill with PLAN 9 FROM OUTER SPACE? I'm sorry I was not around then, I certainly would have paid 25 cents to see that combo! Oh one other thing, listen carefully to the music. Some of it turned up a few years later in NIGHT OF THE LIVING DEAD.",
         "6 reasons why you should watch it? 1. Robert Clarke's quasi convincing performance during the \"why me? Why Me? WHY ME?\" scene. Quasi. 2. The worst fake-piano playing (by Trudy-Nan Peterson) in the history of cinema. Mind you, you don't notice it the first time round. You're too busy looking at something else. 3. Watch the Sun Demon slaughter a dog. Definitely not politically correct. 4. Does the Sun Demon make love with Trudy on the beach? We'll never know. 5. The Sun Demon's car. It's brilliant. Too bad we don't know the make. 6. The Sun Demon didn't really run over the policeman. Or did He? I could go on but I don't want to spoil the movie.",
         "This semi-professional low-budget horror film is worth seeing for two reasons: The tormented performance of Robert Clarke in the title role, and the terrific creature makeup. The film does have its weaknesses; the low budget shows, and we see (or, rather, we hear) several good examples of why a film's dialog track is rarely recorded on location but usually dubbed in later in a studio: Several of this film's locations were acoustically unsuitable, as the soundtrack clearly reveals. Nevertheless, I still insist that this film, with a title creature that's certainly original, offers rewards for patient viewers.",
         "I bought the movie and watched it yesterday..I thought it was above average for a B-movie..I have seen recent movies a lot worse then this..a little slow in parts but I felt kind of saddened for the guy/monster in the end for him,since he didn't ask for this radiation accident..but all in all I felt it was worth the money and to have it as a collection,since I am a huge fan of 50's science fiction movies.Just remember,you have to realize this was made back in the 50's..so the special effects aren't like they are computerized or anything like now,but I thought they did a good job with the costume as a lizard man.Actually it was harder work for everyone then to make a monster then now.There certainly where some very exciting/creepy/scary moments throughout the movie and making it black and white really added to the horror of it all.",
         "This one is for you Bob! When you consider that Robert Clarke was working on a very low budget, I think he did a great job! Also considering that Clarke not only starred in the film, but he also directed it. The camera work is excellent the music is good, and the Lizard man costume is one of the seven best monster costumes of the 1950s! The artist (Richard Gianabattista Cassarino) who designed the realistic costume also was the police officer on the top of the tower, at the end of the film.In a reverse theme to the werewolf legend we have the rays of the sun turning Clarke into the Lizard man! There are many good scenes, there is a scene where Clarke as the lizard man, enters into a Railroad warehouse and confronts a resting hobo, as he is standing there in the dark of the warehouse there is some sunlight coming in, and you can see his eyes moving back and forth in the dark mask, it looks real and accommodating eerie. The film has plenty of action, with Clarke running around in that costume under the hot sun,it must have been no picnic! From what I can see Clarke was doing most of his own stunts in that costume, with all things considered this is not a bad film at all!",
         "In some ways, it seems that if you've seen one '50s B sci-fi movie, you've seen 'em all. But \"The Hideous Sun Demon\" elicits a certain charm, showing how the guy's condition affects him emotionally. Specifically, a scientist (Robert Clarke, who also directed) gets exposed to atomic isotopes and develops a condition that turns him into something resembling a giant pine-cone whenever he gets exposed to the sun's rays. I should say that the acting is pretty bad, and I wonder how accurate their scientific references were. But these movies are always a pleasure to watch, partly because they're full of really hot babes (you'll see what I mean by that scene on the beach). Worth seeing maybe once...or more if you like to get horny. PS: that road next to the beach is the Pacific Coast Highway, also featured in \"It's a Mad, Mad, Mad, Mad World\".",
         "Clarke, the Robert Taylor of Z-movies, is actor/director/writer in this touching tale of the lizard that is inside all of us; the lizard who wants to break free, and break a few bones while he runs away from the unfeeling cops. Cops have always chased lizards, come to think of it. Little do they know that what they are chasing is themselves... B-movies have a reputation for being educational and it's no different with this particular gem. We learn from the movie's scientists that Clarke has \"devolved\" back to the lizard-state - not the ape-state - for, you see, it is not apes which are our distant cousins: it's the lizards. \"Darwin never even scratched the surface,\" says Clarke. (Whereas Clarke doesn't even see the surface.) He is depressed because, just as he was having a wonderful chat with an old woman in a hospital, he turned into a member of GWAR! She shrieked. He ran. He never had any musical ambitions, so this sudden involuntary recruitment into the ranks of GWAR came as a shock. What does that strange R'n'R lifestyle hold for the future? No... No! I don't even play an instrument, he must have thought. But, Clarke... You don't need to play an instrument to be in GWAR. You can be a GWAR-slave. B-movies aren't only educational for US. Even this movie's scientists learn - from one another. For example, Clarke's colleagues get a Basic Biology lesson from a doctor; he explains to them the magical secrets of life, evolution and silly dialogue. After that it's Clarke sitting in a bar, depressed about being a R'n'R star, and a heavy metal one at that. What will that nice Baptist family next door think? But Clarke's thoughts soon divert to a chesty blonde who sings something bluesy. (What breasts!) Soon Clarke is fighting over her with her manager(?)/pimp(?)/ boyfriend(?) in a fist-fight full of near-hits and pulled punches. Next thing we know, he has completely forgotten about GWAR, inner-lizards, and Darwin, and is smooching on the beach with that chesty blonde! Everything seems okay. But - oh, no... The next morning it's GWAR again; the inner lizard in Clarke is calling him to meet his relatives in the swamps of Florida. Clarke brusquely rejects this invitation and runs in panic, back to his scientist friends. The next day it's more of the same. Clarke is back in that bar; depressed, drinking, and again has a near-fight experience with the blonde's boyfriend/manager/pimp. The blonde's wishy-washiness becomes apparent at this point: first she was with Pimpy, then dumped him for Clarke, then felt rejected by Clark and went back to Pimpy, only to switch sides again when Pimpy started near-hitting him. But no matter. Minutes later Clarke turns into a GWAR member again and this is the last we see of the blonde. No - she wasn't killed. She simply became a forgotten character. The rest of the movie has no cleavage to speak of, so let's sum it up very briefly: Clarke doesn't join GWAR for its U.S. tour, but instead decides to go solo. His first tour-date was with a small girl in a barn. She gave him away, and soon the lizard in him was chased by lizard-hating cops. And we all know that what cops don't know is that when they chase a lizard what they are really doing is chasing the lizard in themselves \u0096 the lizard that is in us all\u0085",
         "Memorable independently produced 50s monster fare has Clarke (who sci-fi fans will remember from the equally memorable \"The Man From Planet X\") as a scientist whose exposure to radioactive isotopes causes him to become a monster whenever exposed to the sun. The film is extraordinary in that its focus is on the effect the transformation has on Clarke's character, emotionally and morally; his excessive drinking and his search for nightlife exemplify this. Having been forced by his vampire-like condition to avoid the sun and the \"good girl\" he knows in town, he has no option but to live the other way. By taking a floozy out for a moonlit walk (she seems really surprised when he says he actually wants to take a walk, perhaps expecting a mere pickup) he shows how he wants to make his night world into a respectable one, but can't (the sun again turns him into the demon). Good makeup, nice performances in the B-mode all around. If you're a fan of these kind of movies, this is the movie you're looking for -- one of the best of its kind.",
         "My score of 3 doesn't really mean that I hated this film. In fact, I enjoy watching cheesy 1950s and 60s horror films. However, no matter how much I enjoy them, I have to be realistic and admit that their technical merits are usually horrendous. With THE HIDEOUS SUN DEMON (a rather inappropriate title, by the way), the budget was next to nothing and it really shows. The script also is not particularly inspired or original, though the film is watchable. Actor Robert Clarke stars in this film he also wrote and co-directed. While his name is probably not one you've heard of before, he did a ton of TV appearances over the years--particularly in the 1960s in such shows as \"Dragnet\". He's a competent actor though given the budget, you really can't blame him for coming up with a silly film. This is another nuclear radiation film where a scientist is exposed to the stuff. But, instead of turning really big (THE AMAZING COLOSSAL MAN) or tiny (THE AMAZING SHRINKING MAN), here the guy cannot go into sunlight or he becomes a hideous looking monster--at least until he's left the sunlight and allows himself to become normal once again. To me I kept wondering why Clarke's character was so stupid that he'd \"forget\" and suddenly realize it's becoming daytime throughout the film. People with Porphyria learn to avoid sunlight, yet this dummy keeps making the mistake of being out too long. Unfortunately, when he is out in the sun, he seems to become a bit emotionally unstable, though he's nothing like a \"sun demon\". He's more like a guy who's a bit cranky and stupid, that's all! Overall, very watchable for fans of the genre but don't expect it to be among the best. Just a typical film you'd find on a typical exceptionally tiny budget. By the way, look at the box art that is shown on IMDb. I think the yellow artwork might just rank as the ugliest in film history.",
         "Robert Clarke wrote, directed, and starred in this film about a scientist that is exposed to a special radioactive isotope that makes him change into a lizard-like man everytime he is touched by the rays of the sun. Clarke is the scientist that has a drinking problem and an overactive libido as well. The film is VERY cheaply made, and most of the actors(okay, all of the actors) could have really benefited from a few acting lessons. The film nonetheless is very entertaining. There are some scenes which will make you laugh and cry( a higher level of laughter) because of their ineptitude and improbability. The scene where our evolution from fish and lizards being described is a gem, as are the two scenes where Clarke really goes overboard screaming \"Why Me!\" and the like. There are some well-shot scenes too. The ending is very nicely done, and the scenes with Clarke and a little girl have some poignant moments. The gal playing Trudy, a night club singer that Clarke dates in the middle of an evening trying to help him forget his plight no doubt, is Nan Peterson and a REAL knockout! Peterson shows more than ample cleavage to keep even the most hardened of critics entertained. All in all required film viewing for the aficionado of le bad cinema."
      ],
      "genres": [
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": ["Clarke-King Enterprises"],
      "summaries": ["After exposure to radiation, an atomic research scientist finds himself changing into a murderous, lizard-like creature every time he is exposed to sunlight."],
      "budget": 58500
   },
   "movielensId": 3488,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1958-08-28",
      "dvdReleaseDate": "2000-03-21",
      "directors": [
         "Tom Boutross",
         "Robert Clarke"
      ],
      "runtime": 74,
      "movieId": 3488,
      "title": "The Hideous Sun Demon",
      "mpaa": "",
      "actors": [
         "Robert Clarke",
         "Patricia Manning",
         "Nan Peterson",
         "Patrick Whyte",
         "Fred La Porta"
      ],
      "imdbMovieId": "0052888",
      "originalTitle": "The Hideous Sun Demon",
      "genres": [
         "Horror",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [
         "4AZQksTf41I",
         "yJC3gWJ3qKI"
      ],
      "plotSummary": "After exposure to radiation, an atomic research scientist finds himself changing into a murderous, lizard-like creature every time he is exposed to sunlight.",
      "tmdbMovieId": 41038,
      "avgRating": 2.10417,
      "releaseYear": "1958",
      "numRatings": 72,
      "posterPath": "/pV463n3nL8iH78PQC7MvHIpsRGB.jpg"
   }
}