{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0091579",
      "video": false,
      "title": "My Chauffeur",
      "recommendations": [
         103604,
         41732,
         83907,
         37223,
         126243,
         67976,
         40169,
         31919,
         57665,
         30489,
         47342,
         283749,
         99977,
         28287,
         3122,
         221434,
         51465,
         106052,
         40129,
         21136
      ],
      "backdrop_path": "/6gCtvkgXyxcTjjRQ632QVIhqo0R.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Casey Meadows",
               "gender": 0,
               "credit_id": "52fe47169251416c91069a25",
               "name": "Deborah Foreman",
               "profile_path": "/qMhBRDfWOlQVGlHtLaGcDBEJCIv.jpg",
               "id": 79741,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Battle (as Sam Jones)",
               "gender": 2,
               "credit_id": "52fe47169251416c91069a29",
               "name": "Sam Jones",
               "profile_path": "/w0C7aONaeB6a5DqdzTa23TzcvPm.jpg",
               "id": 33321,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "McBride",
               "gender": 2,
               "credit_id": "52fe47169251416c91069a2d",
               "name": "Howard Hesseman",
               "profile_path": "/AvzHr1Ul5xmcoGvmGW8t9mrwBTG.jpg",
               "id": 35516,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Witherspoon",
               "gender": 2,
               "credit_id": "52fe47169251416c91069a31",
               "name": "E.G. Marshall",
               "profile_path": "/iQnivIob2OiXuVCepECf72xS2tQ.jpg",
               "id": 5249,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Bone",
               "gender": 2,
               "credit_id": "52fe47169251416c91069a35",
               "name": "Penn Jillette",
               "profile_path": "/zmAaXUdx12NRsssgHbk1T31j2x9.jpg",
               "id": 37221,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Abdul",
               "gender": 0,
               "credit_id": "52fe47169251416c91069a39",
               "name": "Teller",
               "profile_path": "/rOa7BSHV1Opk1mnOFhJTP2Hi38X.jpg",
               "id": 74296,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Giles",
               "gender": 2,
               "credit_id": "52fe47169251416c91069a3d",
               "name": "John O'Leary",
               "profile_path": "/4DWRI16denoba5UJkwJ7jh4fH6Q.jpg",
               "id": 53552,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "O'Brien",
               "gender": 2,
               "credit_id": "52fe47169251416c91069a41",
               "name": "Sean McClory",
               "profile_path": "/4eOjjwyxE73LoG4eaivI5AgT0Ed.jpg",
               "id": 30501,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Johnson",
               "gender": 2,
               "credit_id": "58c3324e9251417ca4000ac1",
               "name": "Julius Harris",
               "profile_path": "/vhyuxFmam4SQSjTOLPStOVYMgbb.jpg",
               "id": 6772,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Jenkins",
               "gender": 2,
               "credit_id": "58c332599251417c89000a93",
               "name": "Laurie Main",
               "profile_path": null,
               "id": 93310,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Colleen",
               "gender": 0,
               "credit_id": "58c33265c3a36837f9000b0b",
               "name": "Elaine Wilkes",
               "profile_path": null,
               "id": 193597,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Blue Lady",
               "gender": 1,
               "credit_id": "58c332749251417cb8000a26",
               "name": "Diana Bellamy",
               "profile_path": "/3Kh5XkSp2dPB5YdVbYWmLVOA2PF.jpg",
               "id": 157986,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Bimbo",
               "gender": 1,
               "credit_id": "58c3327fc3a368380e000a8e",
               "name": "Robin Antin",
               "profile_path": "/bODRWZbIDG9CBxIsXNmKh5qSO5I.jpg",
               "id": 420741,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Beebop",
               "gender": 0,
               "credit_id": "58c3328bc3a3683816000a2a",
               "name": "Cindy Beal",
               "profile_path": "/v3zkciuEner2dFRjMKavqCStDc5.jpg",
               "id": 97797,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Party Girl",
               "gender": 0,
               "credit_id": "58c332abc3a368380e000aad",
               "name": "Leslee Bremmer",
               "profile_path": "/pUW48Nzp6vtc04hPfsbvu2KSmz4.jpg",
               "id": 103968,
               "order": 14
            },
            {
               "cast_id": 18,
               "character": "Party Girl",
               "gender": 1,
               "credit_id": "58c332bac3a36837f9000b53",
               "name": "Jeannine Bisignano",
               "profile_path": "/bTSLI4y7xVXtdzKe2VLksqIR3PJ.jpg",
               "id": 1389037,
               "order": 15
            },
            {
               "cast_id": 19,
               "character": "Party Girl",
               "gender": 0,
               "credit_id": "58c332c49251417cc1000abf",
               "name": "Sheila Lussier",
               "profile_path": "/ziOXtZF7VO0GwQ2FjcB6EANCVXW.jpg",
               "id": 103969,
               "order": 16
            },
            {
               "cast_id": 20,
               "character": "Party Girl",
               "gender": 0,
               "credit_id": "58c332d3c3a36838030009d7",
               "name": "Vickie Benson",
               "profile_path": null,
               "id": 1298539,
               "order": 17
            },
            {
               "cast_id": 21,
               "character": "Fryer",
               "gender": 0,
               "credit_id": "58c332de9251417cb8000a71",
               "name": "Daniel Hirsch",
               "profile_path": "/yHXP1SPfPMbhZV0LIxycYWQ9s0N.jpg",
               "id": 105183,
               "order": 18
            },
            {
               "cast_id": 22,
               "character": "Doughboy",
               "gender": 2,
               "credit_id": "5a3e698f9251411fd500d147",
               "name": "Mark Holton",
               "profile_path": "/vQJ3iEDVhVOJX7biIbIG5R6QByq.jpg",
               "id": 44818,
               "order": 19
            },
            {
               "cast_id": 23,
               "character": "Downs",
               "gender": 2,
               "credit_id": "5a3e6aa2c3a3680ba60130ee",
               "name": "Stanley Brock",
               "profile_path": "/juKmPM9EAxDY1J55kbgdw0uuw17.jpg",
               "id": 157444,
               "order": 20
            },
            {
               "cast_id": 24,
               "character": "Doolittle",
               "gender": 0,
               "credit_id": "5a3e6b739251411fd200d1be",
               "name": "Vance Colvig",
               "profile_path": "/juqxvZnX5lBKDbuUv6ovI9GTRNK.jpg",
               "id": 1180873,
               "order": 21
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe47169251416c91069a47",
               "name": "David Beaird",
               "profile_path": null,
               "id": 121760,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe47169251416c91069a4d",
               "name": "David Beaird",
               "profile_path": null,
               "id": 121760,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.0518,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 39406,
      "vote_count": 6,
      "budget": 0,
      "overview": "A feisty young woman accepts a mysterious offer to become a chauffeur for a Beverly Hills limousine business, much to the chagrin of her older male coworkers and the disbelief of her customers.",
      "similar": [],
      "original_title": "My Chauffeur",
      "runtime": 97,
      "poster_path": "/scrgxBx4ZyGvXVzhGjF0q5oWa2.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Marimark",
         "id": 7751,
         "origin_country": ""
      }],
      "release_date": "1986-01-24",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "He fell in love with the help... Beverly Hills will never be the same.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["David Beaird"],
      "runtime": 97,
      "synopsis": "Casey Meadows (Deborah Forman) is a free-spirited young woman working as a dishwasher in an upscale restaurant in downtown Los Angeles. One day she receives a hand-delivered job offer as a driver for Brentwood Limousine Service. The company manager, Charles McBride (Howard Hesserman), is appalled at Casey's young, brash presence... and the fact that she's a woman in an all-male establishment. McBride soon learns that Mr. Witherspoon (E.G. Marshall), the company owner, personally handpicked her and offered the letter of employment. McBride reluctantly agrees to hire her, but warns her that she will be fired if she steps out of line. Casey experiences sexism and chauvinism from her fellow, (mostly older) limo drivers. While frustrated at her lack of acceptance and tolerance amongst her new co-workers, she does manage to find some kindness and support in Jeremy O'Brien (Sean McClory), an older Irish driver. Jeremy convinces her to tough it out and give the change-hating men time to adjust to her presence. She agrees to stay. Casey is routinely given bad assignments that are engineered to get her fired. Her first job is driving a high, oversexed and hung-over British punk rock singer named \"Cat Fight\" (Leland Crooke) to his concert. Casey finds Cat Fight in a motel bed with his three women backup dancers in a drug-induced stupor. Realizing she'll be fired if she doesn't deliver him to the concert, she takes a cooler full of ice water and dumps it on Cat Fight's bed and manages to get Cat Fight and the three women into the car. During the drive to the concert, Cat Fight flees from the limousine to a local park where he tries to steal the panties off an overweight woman wearing a blue dress which as part of his \"game\" is worth 20,000 points. Despite the distraction, Casey manages to bring him into the arena just in time for the concert. Casey is then assigned to transport Battle Witherspoon (Sam J. Jones), an arrogant, heartless, workaholic executive who is stalking his ex-girlfriend. The angry ex tells him she can no longer stand to be with him and says she is pregnant with another man's child. Casey, sympathetic, offers visibily devastated Battle some liquor from the onboard bar. After consuming an excessive amount, Battle runs out of the car and strips his clothes off, running through a park stark naked, making a huge nuisance of himself. He finally returns to the limo and passes out. Not knowing where Battle's residence is, Casey takes him to her apartment so he can recover from the day's events. The following morning, he awakens and reverts back to his old hateful self, hurtfully insulting Casey before leaving. Unbeknownst to Casey, Battle Witherspoon is actually the son of the Mr. Witherspoon, the owner of the limo company. Mr. Witherspoon orders Battle to check out another of his companies upstate in Sonoma. Casey is assigned to drive Battle up north, much to their mutual displeasure. Halfway through the trip, the car overheats and breaks down in a remote location on the highway. Battle and Casey walk off in search of a phone. After walking and bickering for several hours, night falls and they get caught in a rainstorm. Casey sprains her ankle and is unable to walk. Battle continues his walk while carrying Casey in his arms. They finally find a rustic cabin occupied by a hillbilly couple, who invite them to spend the night. Both are put in a bedroom with a single bed and after another one of their arguments, Battle kisses her. They both have sex. The following morning, Battle proposes marriage but Casey refuses, fearing he will return to his emotionally-distant ways. Casey is next assigned to transport a Middle Eastern sheik from his hotel to a meeting. The sheik Abdul (Teller) is approached by a local pimp and con artist named Bone (Penn Jillette) out for a wild night on the town. The rambling Bone then forces Casey to drive them to a local nightclub while swindling the mute Abdul out of all his cash and valiables with magic tricks and card tricks. Bone and Abdul pick up a number of loose women and transport them around in the limo for some more drinking and stripping before Casey manages to drop Abdul back at the hotel. After Casey returns the next morning, she is fired by McBride after learning that police and government agents have been searching for the missing sheik. Realizing that he's fallen for Casey, Battle starts making some positive changes in his life and continues his efforts to court Casey. He slowly wins Casey over and takes her home to meet his father. When she arrives at the estate, she experiences Deja Vu, recalling the times she played in the Witherspoon mansion as a child. It turns out that Casey's mother was formerly employed by Witherspoon. But shockingly, Witherspoon reveals that he is Casey's biological father, making Battle and Casey siblings. Jeremy then comes into the room with Giles, another limo driver, ordering Giles to confess what he knows about Casey's paternity. He reveals Witherspoon is not Casey's biological father, Giles is. Giles was in a relationship with Casey's mother before she and Witherspoon spent their \"little weekend together\". Giles (who was especially hostile to Casey) reveals that he denied paternity in order that Casey would receive stable financial support as an heiress to the Witherspoon fortune. The movie ends with Battle and Casey's wedding. As they climb into the back of a Brentwood Limousine. The driver is McBride, who has finally received his comeuppance for his mysogynic treatment of Casey.",
      "writers": ["David Beaird"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0091579/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA2OTg1NTQ4NV5BMl5BanBnXkFtZTcwNzI0NzMzMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Deborah Foreman, Sam J. Jones, Sean McClory | See full cast and crew »"],
      "reviews": [
         "Quite possibly the best film ever made! Okay, maybe i'm exaggerating but it's a really fun film filled with wacky characters and that distinct LA 80's feel. What sets this film apart is the dynamic lead performance by Deborah Foreman (where have you gone, Debbie?) In terms of comic timing and just being so damn adorable she rivals Katherine Hepburn in Bringing Up Baby (a film which My Chauffeur most resembles) David Baierd's direction keeps things brisk and light yet there are demented touches here and there which give the film a unique off-balanced vibe. Check this film out if you can and expect a pleasant surprise. I'll re-watch it again and again and have a blast each and every time.",
         "OK, so it's no epic piece of cinematic history, and sure it's a formulaic and derivative romantic comedy, but I still rank it as one of my all-time favorite films because it possesses a wonderful plot structure, engaging vignettes (\"A blue lady with a blue dog! That's 20,000 points!\"), well-drawn characters, witty dialog, a lot of heart and a lot of laughs - not to mention a finger-snapping, so-80s soundtrack from a seemingly never-to-be-heard-from-again band called The Wigs \"My Chauffeur\" is all-around well written and well realized. Watching this film, you can tell the people involved both in front of and behind the camera really put their imaginations and talents into crafting something special. Deborah Foreman is quirky-cute-cool as Casey Meadows, an aspiring limo driver who shakes up the stuffy status quo of Brentwood Limousine Company when she's hush-hush hired by its reclusive owner (E.G. Marshall). She faces the cold shoulders of all of the older male drivers, save for a paternal Irish gent (played marvelously by Sean McClory) who takes her under his wing. Sam Jones is marvelous as Battle Witherspoon, the dictatorial corporate suit who's all business and no pleasure - until he meets Foreman's Casey and slowly melts for her. The romance that ensues between them is surrounded by a wonderful cast of characters who populate the movie's tangental scenes, such as the one that features the film debut of Penn & Teller (as a con man and a Middle Eastern prince, respectively). Myself, I get a little choked up every time I see the scenes where Casey comes to the transportation rescue of a young man being berated by his girlfriend for not having a car, and where Battle finally realizes what a jerk he's been and commands his long-suffering, single-mom secretary to march down to human resources the following Monday and name her own raise. Touching, heartfelt, sincere stuff. Yeah, it's a fairy tale film filled with other little fairy tales, but that's what makes it so much fun. Even more fun: \"My Chauffeur\" has one of the most fall-down laughing drunk scenes I've ever seen. After Jones' character gets dumped by his girlfriend, he gets rip-roaring blotto in the back of Casey's limo. Chugging scotch, primal screaming and spewing venom he declares his freedom and commences to streak stark naked through a neighborhood park. In terms of sheer hilarity it rivals the scene in \"The Money Pit\" where Tom Hanks laughs himself into hysterics after the bathtub plunges through the bathroom and shatters on the first floor. It's just movie magic. As you can tell, I've seen this film a few times, and will undoubtedly see it a few more in my lifetime. But everytime I see it, there is some bittersweetness that manifests itself as the credits roll at the end as I ask myself \"where are they now?\"",
         "A quirky, fun-filled, romantic romp of a movie with unforgettable lines like \"Gawd, it's hot. But thank gawd it's not sticky!\" \"You are now a prisoner of Brentwood Limousine,\" \"If I see something I haven't seen before, I'll throw a rock at it,\" and \"a one-legged nun walking a goat.\" Major 80s nostalgia in the music. Deborah Foreman's Casey Meadows character is adorable. Annoying Penn and Teller were the only low point.",
         "I love this movie....I've loved it since I first saw it at age 10...If you pride yourself on your love for off-beat movies, and have never seen this..please do..I can't promise you'll have the same love for it as I do...but I truly believe I would love it just as much if I saw it today for the first time....Deborah Foreman is perfect in this role..open enough to be such a great character. All roles are distinct, no one gets lost in the chaos. I hope you have fun..now get up go rent it..I'd loan you my copy, but I don't know you stranger!!",
         "This is a light-hearted, cute movie about a girl whose father works in a snobby, stuffy chauffeur company. Things quickly change as she joins, turns the company inside out, and falls in love with one of the customers. Okay, so it's not THE best movie, but most people should like it. I give it a B+. It's got some good jokes, one-liners and a reasonable plot.",
         "This is my all-time favorite movie. Most definitely a feel good movie. When I'm stressed or down, I watch this movie and it always brings a smile to my face and makes me laugh when I think nothing could. Deborah Foreman is brilliant as a quirky, adorable female chauffeur who upsets the \"gentleman\" chauffeurs boring, stuffy existence and brings some light in their lives. This movie is a great one to see when you just want to sit back and enjoy a good movie without investing too much emotion or thought process into it. Try it, sit back and enjoy!!!!",
         "This movie has many highlights -- the blue lady walking a dog scene, the tar pit scene, the hillbilly hospitality scene, the car thief scene and on and on including the entire Bone & Abdul (i.e. Penn & Teller) routine. There are no low points. Deb is in top form -- cute, coy and adorable. Aside from a couple of minor continuity flaws, the movie is perfect. And if your wondering where I got my name from, watch the movie. Yes, Deb, I wanna be your dog! :-)",
         "OK this movies is good for girl meets boy, they fall in love plot, that in it self is enough of a reason to watch it and no \"Flash Gordon\" or \"April Fools Day\" involved. The second reason and third is that rich guy grows up and becomes a human being and a \"man\" when he is forced to be a human and deal with human side of common person life. He finds out the real meaning in life, love, is much more important then money. And he learns the fact that having emotions is a good thing instead of the robot he starts out as. It also was a Cinderella story, poor girl gets a big break, then meets her prince and her father she thought was long gone. all in all a great romantic comedy I would recommend to any one looking for a good movie to see with a special person",
         "You know what? It's true. Deborah ('Valley Girl') Foreman IS damned cute and so she can damned well ACT damned cute if she wants to. And she's even cuter when she's doing her omigod-this-is-crayzee grin. But it doesn't get any cuter when it is the ONLY mannerism she is allowed to display in response to EVERY situation through the entire running time of a feature comedy with her in virtually every scene. And - especially since Foreman strikes me as more of a comedienne than an actress - let me mention that this sort of thing is supposed to be the DIRECTOR'S job, guys!! I was even less impressed with hateful hunk Sam Jones, whose assitude quickly mutates into a plot problem: she watches him be a complete unredeemed creep for a while, then falls in love. And to hell with spoilers, you're not gonna see it: put yourself in Foreman's shoes for the big climactic revelations: the guy you want to marry, and have in fact screwed (if that's what those three shots of bed-ridden, slow-motion kissing is supposed to symbolize) is your BROTHER; your BOSS is your FATHER; no wait your CO-WORKER - who hates your guts! - is in fact your FATHER so you can get married after all. I would not only not dance around the room - I would, I'm sure, undergo an immediate and public nervous breakdown. And how could I forget the screen debut of Penn and Teller, sullying their mystique as a talkative racist creep and random imaginary Arab, respectively.",
         "Let's be real - a cast of has beens or could bes is not going to make Oscar caliber films on a shoestring budget. But this movie is HILARIOUS. There are one liners galore and hysterical visual antics. It's a fun way to pass the time and you will forever be quoting this movie to the chortles of your friends. Deborah Foreman is spectacular and her comedic timing is impeccable. The wise assed Howard Hesseman with his dour timing is a perfect foil. There is a great 80s soundtrack (make sure and check out The Wigs), and the movie moves at a brisk clip. I have to admit that I enjoy the kitsch of it, but also that it is just genuinely funny. I still text my college roommate every time this is on because I can't help laughing through the whole thing. Now, not really family friendly with a few sexual references that are a little trashy but mostly its fine for older tweens and teenagers."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Crown International Pictures",
         "Marimark Productions",
         "Marimark Productions"
      ],
      "summaries": ["A free-spirited young woman (Deborah Foreman) upsets the status quo at a stuffy Brentwood limousine service."],
      "budget": 0
   },
   "movielensId": 3491,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1986-01-24",
      "dvdReleaseDate": "2000-03-21",
      "directors": ["David Beaird"],
      "runtime": 97,
      "movieId": 3491,
      "title": "My Chauffeur",
      "mpaa": "R",
      "actors": [
         "Deborah Foreman",
         "Sam Jones",
         "Howard Hesseman",
         "E.G. Marshall",
         "Penn Jillette",
         "Teller",
         "John O'Leary",
         "Sean McClory",
         "Julius Harris",
         "Laurie Main",
         "Elaine Wilkes",
         "Diana Bellamy",
         "Robin Antin",
         "Cindy Beal",
         "Leslee Bremmer",
         "Jeannine Bisignano",
         "Sheila Lussier",
         "Vickie Benson",
         "Daniel Hirsch",
         "Mark Holton",
         "Stanley Brock",
         "Vance Colvig"
      ],
      "imdbMovieId": "0091579",
      "originalTitle": "My Chauffeur",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A feisty young woman accepts a mysterious offer to become a chauffeur for a Beverly Hills limousine business, much to the chagrin of her older male coworkers and the disbelief of her customers.",
      "tmdbMovieId": 39406,
      "avgRating": 2.70814,
      "releaseYear": "1986",
      "numRatings": 221,
      "posterPath": "/scrgxBx4ZyGvXVzhGjF0q5oWa2.jpg"
   }
}