{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "ransom",
            "id": 1336
         },
         {
            "name": "sheik",
            "id": 6377
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "revenge",
            "id": 9748
         },
         {
            "name": "silent film",
            "id": 154802
         }
      ],
      "imdb_id": "tt0017416",
      "video": false,
      "title": "The Son of the Sheik",
      "recommendations": [],
      "backdrop_path": "/71Ez3un3KIG8RX7TA4uADB3PpAz.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Ahmed, the Sheik's Son / Sheik Ahmed Ben Hassan",
               "gender": 2,
               "credit_id": "52fe49559251416c910a9f31",
               "name": "Rudolph Valentino",
               "profile_path": "/c3haf3X3LGE1ysuOyZlFofbV2Eo.jpg",
               "id": 116367,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Yasmin, André's Daughter",
               "gender": 1,
               "credit_id": "52fe49559251416c910a9f35",
               "name": "Vilma Banky",
               "profile_path": "/zbObQJpdaoahZ2d4gnGUrhdG5Z5.jpg",
               "id": 932465,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "André Romez",
               "gender": 2,
               "credit_id": "52fe49559251416c910a9f39",
               "name": "George Fawcett",
               "profile_path": "/qyfdMPLSa6NnyEZWmt2mf6al2XT.jpg",
               "id": 262394,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Ghabah",
               "gender": 2,
               "credit_id": "52fe49559251416c910a9f3d",
               "name": "Montagu Love",
               "profile_path": "/j4lOtL9TTR60lblXCK6McgdIcXe.jpg",
               "id": 92907,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Diana - Wife of the Sheik",
               "gender": 0,
               "credit_id": "52fe49559251416c910a9f41",
               "name": "Agnes Ayres",
               "profile_path": "/6JsTdznewAM5OXldx4fA9rXXHII.jpg",
               "id": 148821,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Ramadan",
               "gender": 2,
               "credit_id": "547324ffc3a368058e00186d",
               "name": "Karl Dane",
               "profile_path": null,
               "id": 29978,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Mountebank",
               "gender": 0,
               "credit_id": "54732532c3a368058e001870",
               "name": "Bull Montana",
               "profile_path": null,
               "id": 29265,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Mountebank (as Binunsky Hyman)",
               "gender": 2,
               "credit_id": "5473254b925141196b001957",
               "name": "Bynunsky Hyman",
               "profile_path": null,
               "id": 1357778,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe49559251416c910a9f27",
               "name": "George Fitzmaurice",
               "profile_path": "/8RNRlp2qTONhFlqGRrtU7Hol1MY.jpg",
               "id": 114337,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe49559251416c910a9f2d",
               "name": "Frances Marion",
               "profile_path": "/eKSqAU7PxO3VCHU9o27CkyKDEkk.jpg",
               "id": 34741,
               "department": "Writing",
               "job": "Adaptation"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.257111,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 85689,
      "vote_count": 4,
      "budget": 0,
      "overview": "Ahmed, son of Diana and Sheik Ahmed Ben Hassan, falls in love with Yasmin, a dancing girl who fronts her father's gang of mountebanks. She and Ahmed meet secretly until one night when her father and the gang capture the son of the sheik, torture him, and hold him for ransom.",
      "similar": [
         281957,
         11121,
         3134,
         979,
         14869,
         241554,
         956,
         226,
         445954,
         9654,
         49524,
         101,
         245891,
         260346,
         320,
         275,
         281,
         238636,
         359940,
         395834
      ],
      "original_title": "The Son of the Sheik",
      "runtime": 68,
      "poster_path": "/5uDB4rtXsftoXMWLSBBBFVVCvDb.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Feature Productions",
         "id": 13914,
         "origin_country": ""
      }],
      "release_date": "1926-09-05",
      "vote_average": 4.8,
      "belongs_to_collection": null,
      "tagline": "\"An eye for an eye-a hate for a hate-that my girl, is the law of the tribe.\"",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["George Fitzmaurice"],
      "runtime": 68,
      "synopsis": null,
      "writers": [
         "Edith Maude Hull",
         "Frances Marion"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0017416/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNjQxMTc4NjUzNF5BMl5BanBnXkFtZTgwNzk4MDgwMjE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Rudolph Valentino, Vilma Bánky, George Fawcett | See full cast and crew »"],
      "reviews": [
         "THE SON OF THE SHEIK (United Artists, 1926), directed by George Fitzmaurice, reunites the leading players of Rudolph Valentino and Vilma Banky, most recent stars of THE EAGLE (UA, 1925), in what has become one of the most popular films from the silent era, mainly because of it not only being Valentino's final screen performance, but is where the legend of Valentino began. A sequel to his earlier success, THE SHIEK (Paramount, 1921), Valentino's career up to this point consisted of hit and miss stories over the next few years until THE EAGLE not only brought renewed interest in Valentino, but reassured it with THE SON OF THE SHEIK. Since sequels were a rarity during that time, Valentino, as did Douglas Fairbanks with the sequel to his immensely popular, THE MARK OF ZORRO (1920), DON Q, SON OF ZORRO (1925), Valentino reprises his original role as well as portraying his own son, Ahmed. Agnes Ayres, Valentino's leading lady in THE SHEIK, is offered special billing in the opening credits, who also re-enacts her original role as Diana, this time as wife and mother. The story begins with the opening titles that read as to the location, \"Not East of Suez, but South of Algiers.\" Yasmin (Vilma Banky) is the daughter of Andre(George Fawcett), a renegade Frenchman and leader of a group of thieves. She supports them through her dancing publicly. In the marketplace (as recalled by Yasmin via flashback), she meets Ahmed (Valentino), a handsome young sheik, and the two fall in love. After meeting with Yasmin secretly one night, Ahmed is captured by her father's renegades and held captive in a building where he hangs by his tied-up wrists placed on the window bars, and subject to whip torture for not revealing the name of his father and other information. After being freed by his men, Ahmed, believing Yasmin as his betrayer, abducts the girl and subjects her to his methods of torture, with one scene looking at Yasmin with vengeance in his eyes, and (off camera) putting her through the process of rape. It would be his father, Ahmed Ben Hassan (Valentino) who orders him to release the girl. After learning the truth from Ramadan (Karl Dane), Ahmed tries to win back Yasmin, who has returned to the dance hall, and now wants nothing to ever do with him. In many ways, a much more interesting story than its predecessor, and brief to the point at 68 minutes. Aside from the fine chemistry between Valentino and Banky, the supporting villain as played by Montagu Love, along with sandy sets with production designs by William Cameron Menzies, THE SON OF THE SHEIK is Valentino's film from start to finish. And with this film as well does the Vilma Banky name remain legendary. But who knows how far Valentino's screen career would have gone had it not been for his untimely death at the age of 31 shortly following the film's release. THE SON OF THE SHEIK did enjoy frequent theatrical revivals for a number of years, usually on a double bill with THE EAGLE, as well as television showings during the early to mid 1960s. It became one of the selected films shown during the summer months on weekly public television series, \"The Silent Years\" (1971), hosted by Orson Welles (New York City area, WNET, Channel 13, on July 13, 1971). In spite of its popularity and the legend behind it, what's interesting to note is that while the twelve movies featured on \"The Silent Years\" did enjoy rebroadcasts up till the mid 1970s, THE SON OF THE SHEIK wasn't included in the reruns. Some years would pass before its availability onto video cassette and/or DVD (Blackhawk and/or Kino), the best being from the Killiam Collection accompanied by a theater organ score by Jack Ward. THE SON OF THE SHEIK, which played as part of its silent film collection on American Movie Classics around 1996, can be currently seen and studied whenever played on Turner Classic Movies. For those interested in the legend of Valentino, THE SON OF THE SHEIK, which provides two Valentinos for the price of one, as well as being an important part in cinema history, is worthy screen entertainment. (***)",
         "In the south of Algiers, in a camp of outcasts, the Frenchman André (George Fawcett) leads a troupe of mountebanks and thieves. His daughter Yasmin (Vilma Banky) is the dancer of the group and is promised to the cutthroat Moor Ghobah (Montague Love). However, Yasmin meets Ahmed (Rudolph Valentino), who is the Sheik's son but she does not know, and they fall in love for each other. When the young couple secretly dates in the ruins of Touggourt, where Yasmin dances, the criminals attack Ahmed, beat up and capture him, expecting to ask for a ransom. Ghobah poisons Ahmed, telling that Yasmin is a bait to lure victims for them. Ahmed escapes, and he abducts Yasmin and despises her. When he knows the truth, he fights against the gang of criminals trying to rescue her from Ghobah. \"The Son of the Sheik\" is the last movie of Rudolph Valentino and a delightful adventure with romance, action and drama. The cinematography is impressive, and I particularly liked very much the sequences when Vilma Banky dances in Touggourt beginning with a close and opening to the whole place, and when Ahmed chases Ghobah and Yasmin in the desert. Considering the equipment available in 1926, big, heavy and with serious limitations, it is amazing how these scenes were shot. Rudolph Valentino is fantastic in the role of the son of the Sheik, and his agility recalled me Errol Flynn, when he fights in the bar of Touggourt, jumping on the chandelier. The beautiful Vilma Banky dances magnificently well, shows a great chemistry with Rudolph Valentino and has also a great interpretation. The intense music of Arthur Gutmann gives a perfect dynamic to this wonderful underrated film. My vote is nine. Title (Brazil): \"O Filho do Sheik\" (\"The Son of the Sheik\")",
         "This was Valentino's last film, and he is excellent in it, but it is far from being his best film (as many critics claim). Certainly \"Camille\", \"The Four Horsemen of the Apocalypse\", \"The Eagle\" and \"The Conquering Power\" are much better films. This was designed as a rollicking and sexy adventure film, with large doses of cheap slapstick humour, and on that level succeeds admirably. That famous scene where Valentino ravishes Vilma Banky is extraordinary, and Valentino shows real talent in portraying both the son and the father (he is almost unrecognisable in the latter role). Great split screen work allows the two Valentinos to inter-relate well too. The film makes you wonder what this talented and beautiful man may have achieved had he lived. Would he have made it in talkies? It's hard to believe such charisma would ever fail.",
         "It is sadly appropriate that in his final movie Valentino plays a stronger and more nuanced version of his signature character: Sheik Ahmed, the impassioned lover who is initially impetuous, self centred and brutal, but who gradually matures into an admirable man. In this case, the male lead is actually the son of the original sheik, but Valentino also plays, just as engagingly, the father who is now middle aged, wiser (this is essentially the adviser role Adolphe Menjou had in the original movie) but still commanding and able to wield a sword. As wasn't the case with \"The Sheik,\" the script acknowledges the luridness of its material in a tongue-in-cheek manner (one memorable title card reads \"The night was young at the Café Maure. Not a knife had been thrown\u0097so far\") while not mocking it to the point at the movie would lapse into parody and lose its pulpy charms. For example, in one of the most famous scenes the sheik tries to put his rebellious son in his place by bending an iron bar; the son replies by straightening it out. This is deliberate camp that nonetheless clearly establishes the strength of character and body of both men. The film also departs from the original in the frank comic relief it provides in the form of a nasty but amusing little mountebank who seems to get on the good and bad characters' nerves in equal measure. For those expecting titillation, the film does not disappoint. Valentino and the leading lady Vilma Banky, were involved in real life and it shows in the spooning scenes. The film also has plenty of the rougher, even perverse sexuality that in one form or another is present in nearly all of Valentino's films (even \"The Eagle,\" the closest to a family picture Valentino ever made, has that brief scene with the hero flourishing a whip before the frightened female lead). Here we have Ahmed's rape of Yasmine which is far racier than the merely hinted at ravishment of Lady Diana in \"The Sheik,\" and a striking (and homoerotic) sequence in which Valentino, tied up, his tailored white shirt torn to shreds, is subject to a prolonged whipping by a gang of thieves, the most sadistic of whom addresses him as \"My young lion.\" To me, this is the quintessential Valentino film and the one to show people who are curious about this actor's enduring mystique.",
         "Valentino with tongue in cheek offers this sequel to his famous THE SHEIK. He appears here in a dual role - as a repeat of his earlier role as a tempestuous young Englishman/Desert Prince and his father, the aged version of his earlier character. Here he shows a true acting gift, ably impersonating a man in his fifties or sixties, as well as doing his usual best in the romantic leading man mode. He looks for all the world like John Barrymore with his greying beard and make-up. There are some fine split screen special effects for the two characters to be on the screen at the same time, including a marvelous moment when the older Sheik throws a piece of iron which falls at the younger man's feet, who then picks it up. There are many more close-ups in this film than in the original and film has obviously advanced as an atmospheric art in the five years between the two. The orchestral score (Tchaikovsky, Grieg) and sound effects are added as this print I viewed is the re-issue version (alas minus the rape scene). It is a hoot to see the exteriors of the Sheik's desert tent and the vast interiors - they don't match in the least, the latter about three times the size of the former. A fun adventure film - the simple plot involves the daughter of the bad guys falling for the Sheik, with his alienation based on his belief that she betrayed him into a kidnaping, when she was an innocent dupe. Agnes Ayres revives her original role as the old Sheik's love and Vilma Banky does well as the dancing girl. A fun film - and sadly, Valentino's last.",
         "This was a truly amazing film. TCM just played this along with four others for Valentine's Day. While \"Camille\" (What was with Nazimova's hair?), \"The Eagle\", \"Four Horsemen\", and \"Conquering Power\" were all good, \"Son of the Sheik\" was the best for Valentine's Day. The pure raw sensuality that Valentino portrayed was exciting. I've only been into the silent films for the past fours years, and as I'm only 22, one would think I have no appreciation for \"old\" people. However, this film had me online for a few hours finding pictures of Valentino in this film. HUBBA HUBBA!!! It really is a shame he didn't live longer. He very well could have made talkies, as the song I heard him record sounded lovely.",
         "I only just watched 'Son of the Sheik' on dvd last night and was amazed at the textures of cinematography and the natural un-histrionic flow of the performances. While it may not be very profound or innovative, it never set out to be, and it is a far better flick than I expected, very rounded and organic and effortless. Vilma Banky is lovely and appropriately lowkey, and Valentino is every bit as exciting to watch as his celebrity maintained. Ahmed is NOT a character performance, Oscar material or anything, but Valentino instills this cardboard figure with the warmth of life, a quickening of the pulse, all very controlled and tasteful and humanly affecting rather than superhumanly virile. Of course he looks gorgeous, but so does the film itself. Some of the slapstick may seem dated by now, but then what about 'American Pie'.",
         "If anyone has heard about Valentino and wants to see what all the fuss was about, The Son of the Sheik is an excellent way to do so. Here he is five years past the overacting he exhibited in parts of the earlier installment. To top it off, he plays dual roles: the son and the father. And he does both admirably. The shots of the two characters in the same frame - touching each other, no less - are flawlessly executed. Generally, this is standard melodrama culminating in physical battles between the good guys and the bad guys and a final chase. Along the way we get a lot of exotic set pieces, lavishly furnished desert tents, horses racing across the dunes, smoky cafes in which dancing girls wriggle for tossed coins and a grand palace with spacious rooms and shiny floors. The intimate scenes between Valentino and the beauteous Vilma Banky are more sensuous than those of the previous film. Clips from these scenes will be familiar to anyone who has ever seen Valentino references in documentaries. Agnes Ayres reprises her role from The Sheik as Diana Mayo, now the wife of the older sheik and mother of his son, and she appears to have aged 20 years but is no less attractive. For Valentino, Banky and Ayres alone this is a treat.",
         "In sands \"Not East of Suez -- but South of Algiers,\" handsome Rudolph Valentino (as Ahmed) and beautiful dancing girl Vilma Bánky (as Yasmin) fall in love. Mr. Valentino learns that Ms. Bánky must dance for coins, which her wicked father George Fawcett (as André) gambles away. Mr. Fawcett and Montagu Love (as Ghabah) are part of a band of renegade thieves. Valentino wants Bánky for his own, but Fawcett isn't about to part with the goose that brings in the golden coins. Valentino is kidnapped, strung up, whipped, and held for ransom. Turns out, he's \"The Son of the Sheik\"... Valentino is freed, with a lot of help from his friend Karl Dane (as Ramadan). Valentino thinks Bánky betrayed their love; and, he vengefully abducts her. Meanwhile, Ahmed's father Rudolph Valentino (in a dual role, as the original Sheik) and mother Agnes Ayres (as Diana) are preparing an arranged wedding for the younger Valentino. Father and son clash, over love and lust\u0085 An indelible, essential film, \"Son of the Sheik\" finds Valentino at the top of his profession. George Fitzmaurice (direction), George Barnes (photography), William Cameron Menzies (sets), and George Marion Jr. (title cards) are all outstanding. Bánky and the supporting cast are excellent. The filmmakers create a rich, dreamy, and imaginary world; note how the opening \"title card\" refuses to be precise. This goes even further than the original \"The Sheik\" (1921) in establishing the films as something incompatible with reality; of course, both films suffer when taken without a grain of sand. Valentino's characterizations are startlingly well-crafted; no doubt, many original film goers missed the nuances present in the younger Ahmed, and would not have even guessed, unless alerted, Valentino was also portraying the older Sheik. The \"split screen\" appearance of the two Valentinos is technically brilliant; and, even with make-up, Valentino's portrayal of the older Sheik shows an extraordinary range. In fact, Valentino could have essayed a double career as a dashing older man. Had he lived, Valentino might have been awarded his own best acting \"Medal of Honor\" for his performance, which was at least equal to John Barrymore's 1925 win, for \"Beau Brummell\". ********** Son of the Sheik (7/9/26) George Fitzmaurice ~ Rudolph Valentino, Vilma Banky, George Fawcett, Agnes Ayres",
         "I recently saw the Son of the Sheik at an old movie house in Los Angeles. It was complete with the Wurlitzer theater pipe organ -- live accompaniment for this rare gem! I was in awe at how sophisticated and enchanting this movie was. I remarked to my husband that it reminded me of one of my trashy love novels. It was so perfect. I remember reading somewhere that Rudolph Valentino's fame came from the fact that he was so dark and handsome and muscular as opposed to the little pasty boys that had existed before him in the cinema. The scene where he exacts his revenge on Yasmin and ravishes her....was wonderful. His dark eyes as he looked at her in the close-ups.......ahhhhh. This movie truly was a treat. The desert scenes, the lush scenery and sumptuous costumes create a wonderful lavish movie. Valentino was taken from the cinema world far too early....but at least we have these lavish movies to remember him by."
      ],
      "genres": [
         "Adventure",
         "Drama"
      ],
      "productionCompanies": ["Feature Productions"],
      "summaries": [
         "Men and women, fathers and children. Ahmed, son of Diana and Sheik Ahmed Ben Hassan, falls in love with Yasmin, a dancing girl who fronts her father's gang of mountebanks. Among the cutthroats is Ghobah, a villainous Moor to whom Yasmin is promised. In ruins near Touggourt, the city where Yasmin dances, she and Ahmed meet secretly until one night when her father and the gang capture the son of the sheik, torture him, and hold him for ransom. Will Ahmed believe that Yasmin set him up for capture? Even if true love finds a way through webs of deceit, what will the vigorous and imposing sheik say about his son consorting with a dancing girl?",
         "In the south of Algiers, in a camp of outcasts, the Frenchman André (George Fawcett) leads a troupe of mountebanks and thieves. His daughter Yasmin (Vilma Banky) is the dancer of the group and is promised to the cutthroat Moor Ghobah (Montague Love). However, Yasmin meets Ahmed (Rudolph Valentino), who is the Sheik's son but she does not know, and they fall in love for each other. When the young couple secretly dates in the ruins of Touggourt, where Yasmin dances, the criminals attack Ahmed, beat up and capture him, expecting to ask for a ransom. Ghobah poisons Ahmed, telling that Yasmin is a bait to lure victims for them. Ahmed escapes, and he abducts Yasmin and despises her. When he knows the truth, he fights against the gang of criminals trying to rescue her from Ghobah.",
         "The son of the sheik and a dancing girl fall in love, but when he is made to believe she has betrayed him he seeks revenge."
      ],
      "budget": 0
   },
   "movielensId": 3492,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1926-09-05",
      "dvdReleaseDate": "2000-03-21",
      "directors": ["George Fitzmaurice"],
      "runtime": 68,
      "movieId": 3492,
      "title": "The Son of the Sheik",
      "mpaa": "",
      "actors": [
         "Rudolph Valentino",
         "Vilma Banky",
         "George Fawcett",
         "Montagu Love",
         "Agnes Ayres",
         "Karl Dane",
         "Bull Montana",
         "Bynunsky Hyman"
      ],
      "imdbMovieId": "0017416",
      "originalTitle": "The Son of the Sheik",
      "genres": [
         "Action",
         "Adventure",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Ahmed, son of Diana and Sheik Ahmed Ben Hassan, falls in love with Yasmin, a dancing girl who fronts her father's gang of mountebanks. She and Ahmed meet secretly until one night when her father and the gang capture the son of the sheik, torture him, and hold him for ransom.",
      "tmdbMovieId": 85689,
      "avgRating": 3.25595,
      "releaseYear": "1926",
      "numRatings": 84,
      "posterPath": "/5uDB4rtXsftoXMWLSBBBFVVCvDb.jpg"
   }
}