{
   "tmdb": {
      "original_language": "it",
      "keywords": [
         {
            "name": "swamp",
            "id": 4551
         },
         {
            "name": "psychopath",
            "id": 6259
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "serial killer",
            "id": 10714
         },
         {
            "name": "masked killer",
            "id": 11040
         },
         {
            "name": "whodunit",
            "id": 12570
         },
         {
            "name": "prostitution",
            "id": 13059
         }
      ],
      "imdb_id": "tt0069920",
      "video": false,
      "title": "Torso",
      "recommendations": [
         6591,
         30903,
         3699,
         2993,
         11226,
         69578,
         39993,
         63025,
         20465,
         39988,
         39982,
         26504,
         28050,
         49361,
         69872,
         27346,
         8690,
         16825,
         28051,
         29130
      ],
      "backdrop_path": "/5oXVjDGyq8JhkAalUYaLL1Yop0b.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Jane",
               "gender": 1,
               "credit_id": "52fe44909251416c910151c5",
               "name": "Suzy Kendall",
               "profile_path": "/pOE9OKrZ8ivSQ987MLj0U1JyRDu.jpg",
               "id": 93476,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Daniela",
               "gender": 1,
               "credit_id": "52fe44909251416c910151c9",
               "name": "Tina Aumont",
               "profile_path": "/s1QuuoZyCUA5fQ7xlSxfud5Fw6o.jpg",
               "id": 109142,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Roberto",
               "gender": 2,
               "credit_id": "52fe44909251416c910151cd",
               "name": "Luc Merenda",
               "profile_path": "/uSM73n88qekWYfcReVv9CROsvH6.jpg",
               "id": 36913,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Prof. Franz",
               "gender": 2,
               "credit_id": "52fe44909251416c910151d1",
               "name": "John Richardson",
               "profile_path": "/esmjGJyeVTNyYu39utLcGRSf2fK.jpg",
               "id": 31545,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Stefano Vanzi",
               "gender": 0,
               "credit_id": "52fe44909251416c910151d5",
               "name": "Roberto Bisacco",
               "profile_path": "/p6zlcPq6gHrBARtlWc3KHQiB3Ya.jpg",
               "id": 32314,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Katia",
               "gender": 0,
               "credit_id": "52fe44909251416c910151d9",
               "name": "Angela Covello",
               "profile_path": "/idosbYm02AC2jA1OIL5OC53dyZj.jpg",
               "id": 111278,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "A hawker",
               "gender": 0,
               "credit_id": "52fe44909251416c910151dd",
               "name": "Ernesto Colli",
               "profile_path": "/AnfceBCkJGzSZcNKQ5jriSkE7Z7.jpg",
               "id": 103106,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Ursula",
               "gender": 0,
               "credit_id": "550243d2c3a3685ba6003d41",
               "name": "Carla Brait",
               "profile_path": null,
               "id": 103116,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Carol Peterson",
               "gender": 0,
               "credit_id": "550243e192514174f6000310",
               "name": "Conchita Airoldi",
               "profile_path": "/fdPfiB98wHHKnr7KQYrLzKDAt1o.jpg",
               "id": 7700,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Florence Heineken",
               "gender": 1,
               "credit_id": "550243f3c3a3685ba2004238",
               "name": "Patrizia Adiutori",
               "profile_path": "/wInyBcPrpYYtGvdXxZW5wkTiKJD.jpg",
               "id": 31701,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Motorcycle guy #1",
               "gender": 0,
               "credit_id": "55024406925141282f00302c",
               "name": "Luciano Bartoli",
               "profile_path": "/4ZiwZI4ZjOlnZ3e7jI16ak0Yonh.jpg",
               "id": 101201,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Motorcycle guy #2",
               "gender": 0,
               "credit_id": "550244159251413d9b0039b2",
               "name": "Luciano Bartoli",
               "profile_path": "/4ZiwZI4ZjOlnZ3e7jI16ak0Yonh.jpg",
               "id": 101201,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Inspector Martino",
               "gender": 0,
               "credit_id": "55024429c3a36826b90022d0",
               "name": "Luciano De Ambrosis",
               "profile_path": null,
               "id": 233176,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Village idiot",
               "gender": 0,
               "credit_id": "550244389251413da8003cf3",
               "name": "Enrico DiMarco",
               "profile_path": null,
               "id": 1438756,
               "order": 13
            },
            {
               "cast_id": 27,
               "character": "Prostitute",
               "gender": 1,
               "credit_id": "58a849aac3a3686654007f6d",
               "name": "Rosaria della Femmina",
               "profile_path": "/7KtXFAFVoUXbPOpKVOHjDzc4KfM.jpg",
               "id": 1760382,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44909251416c910151c1",
               "name": "Sergio Martino",
               "profile_path": "/h5a7h7reC707iilWZ77MPSeWiLg.jpg",
               "id": 21227,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5502444c9251414ea6001ac6",
               "name": "Ernesto Gastaldi",
               "profile_path": null,
               "id": 50818,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5502445bc3a3685b9b003807",
               "name": "Sergio Martino",
               "profile_path": "/h5a7h7reC707iilWZ77MPSeWiLg.jpg",
               "id": 21227,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "55024466925141275c0034cf",
               "name": "Sergio Martino",
               "profile_path": "/h5a7h7reC707iilWZ77MPSeWiLg.jpg",
               "id": 21227,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "55024474c3a3685ba2004246",
               "name": "Antonio Levesi Cervi",
               "profile_path": null,
               "id": 1438757,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "550244829251414ea6001ace",
               "name": "Carlo Ponti",
               "profile_path": "/zgCkHXt5HdXjaiIk8kOcZyQJlZh.jpg",
               "id": 3778,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5502448fc3a3685b9e003725",
               "name": "Guido De Angelis",
               "profile_path": null,
               "id": 18836,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "5502449b9251413d9b0039bb",
               "name": "Maurizio De Angelis",
               "profile_path": null,
               "id": 18837,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "550244a99251413d9f003c08",
               "name": "Giancarlo Ferrando",
               "profile_path": null,
               "id": 21232,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "550244b4c3a3687b69003182",
               "name": "Eugenio Alabiso",
               "profile_path": null,
               "id": 5821,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "550244c2c3a3687b69003184",
               "name": "Giantito Burchiellaro",
               "profile_path": null,
               "id": 32311,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "550244c8c3a3687b69003186",
               "name": "Giantito Burchiellaro",
               "profile_path": null,
               "id": 32311,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 3.500867,
      "production_countries": [{
         "iso_3166_1": "IT",
         "name": "Italy"
      }],
      "id": 31624,
      "vote_count": 49,
      "budget": 0,
      "overview": "A series of sex murders shock a college campus, and four beautiful young girlfriends head for the safety of an isolated country villa. But as they succumb to their own erotic desires, their weekend of pleasure becomes a vacation to dismember at the hands - and blade - of the lecherous maniac.",
      "similar": [
         10781,
         15069,
         12521,
         2832,
         10285,
         238636,
         445954,
         984,
         30833,
         357096,
         123109,
         1696,
         49797,
         24124,
         8090,
         9299,
         1991,
         4771,
         281957,
         948
      ],
      "original_title": "I corpi presentano tracce di violenza carnale",
      "runtime": 97,
      "poster_path": "/xDQUXVzCbOEJm485GTc5HbUvRz3.jpg",
      "spoken_languages": [{
         "name": "Italiano",
         "iso_639_1": "it"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Compagnia Cinematografica Champion",
         "id": 10000,
         "origin_country": ""
      }],
      "release_date": "1973-01-04",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "It saturates the screen with terror!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Sergio Martino"],
      "runtime": 89,
      "synopsis": "Over the opening credits a man is with two women, all of them nude and on a bed fooling around, while a camera is taking photographs. After the credits, a professor is speaking with his students, and Jane (Suzy Kendall) an American exchange student attending college in Rome, Italy speaks with the professor after class. Stefano (Roberto Bisacco) offer's Jane's friend, Dani (Tina Aumont), a ride home, but she turns him down. She later tells Jane and the man seem to be always following her. Later, Flo (Patricia Adiutori), another one of Jane's friends, is with Sean, making out in a parked car at an overpass. Sean sees someone wearing a ski mask watching them. Sean gets out of the car and runs after the person. Flo gets out of the car, turns on the headlights and looks for Sean. When the headlights are turned off, Flo heads back to the car where the man with the ski mask stabs her in the chest. The next day, Dani shows Carol (Cristina Airoldi) the news of Flo's death. Classes are canceled for the day and Jane goes to see Professor Franz (John Richardson). The two of them have a drink at a local bar and Franz invites Jane to a concert. Across town, Stefano picks up a prostitute, but seems reluctant to do anything with her. When she demands that Stefano pay, regardless of his actions, Stefano hits and chokes the woman. She leaves behind an unsettled Stefano. The next day, Dani watches Carol being taken away by two bikers. They gloved killer is driving around, passing Dani who looks right at the driver. At a hippy party, Carol is kissing the two men and smoking dope, but when one of them tries to further the interaction, she puts her joint out on his chest. Carol leaves and ends up in a marshy area. She sees the masked killer standing a short distance away in the fog and runs away, but the killer catches up with her and knocks her down to the ground. Carol is strangled with a scarf and her head is pushed underwater. When Carol is dead, the killer gets a knife and cuts into Carol's eyes. The next day, the police show the students of the art class the scarf that connects the two recent murders. Dani tells Jane that the two bikers who took Carol and that they had no scarfs. At her house, Dani gets a phone call in which the killer threatens her about her scarf knowledge. Dani's uncle comes home (Jane had seen the man earlier talking to Carol) and suggests that Dani go to the country house in Perugia for a few days to hide out and relax. Meanwhile, Inspector Martino interviews a vender and ask him if he remembers selling a scarf. The man denies any recollection, but after the inspector leaves, the vender gets on a pay phone can tells someone that he wants money to keep quiet about a transaction concerning the scarf in question. A little later, Stefano talks to Dani saying that she \"belongs\" to him. Dani remembers Stefano wearing the scarf. She gets away from Stefano, calls Jane and asks her to come over. After Dani tells Jane about Stefano, his scarf and the threatening phone call, Jane says she will be coming to the country house a little later then the rest of them. That evening, the \"scarf seller\" is walking at night with a healthy chunk of cash when he is chased down by a car and crushed against a wall. The killer then takes the cash that he had apparently given the vendor earlier. The next morning, Jane goes to see Stefano and after she lets herself into his house, she sees a doll (recalling the doll flashing in the killer's mind during the murders). A neighbor woman tells Jane that Stefano was not home last night and that he might be out of town. Meanwhile, Dani and her two friends, lesbian couple Ursula and Katia, are traveling by train to Perugia. A friendly doctor named Roberto (having occasionally been seen around the university in Rome) enters their compartment and sits by Dani. The three of them arrive in Perugia and draw some attention with their revealing modern clothing as they purchase goods at a local grocery store for the week they are at a villa over looking the town. That night, Jane arrives outside Perugia in her car at an Esso gas station to ask for directions to the villa and for her car to be worked on. The mechanic says that he cannot work on the car until tomorrow for the garage is closing for the night, so he gives Jane a ride in his car up to the house on the hill. At the house, Jane tells Dani that Stefano probably did not commit any murder. Dani remembers Stefano's scarf design was slightly different for the scarf he was wearing had red stripes on a black background, not the black stripes on a red background as described by the police, but she knows that she saw a man driving a car earlier wearing the scarf but cannot remember who it was. A weird guy from the village arrives at the villa and watches through a window as Ursula and Katia lie on a bed and making out with each other. The weirdo sees the killer with his knife, so he runs and hides, but the unseen killer finds him and finishes him off. The next day, a man comes to deliver some groceries. When Jane runs down the stairs to greet him, she slips and twists her ankle. Roberto visits the house to check on Jane's ankle and Dani remembers him from the train. With Jane disabled, the three other women walk to a spring behind the villa to skinny dip. While swimming, Dani think she sees Stefano and calls out to him, but Ursula and Katia do not see anyone. That evening, the women say goodnight to the bedridden Jane. Downstairs, Dani decides to call Stefano and discovers that the phone is dead. The door buzzes and Stefano is standing in the doorway with his scarf, but he drops dead to reveal the masked killer behind him (clutching onto Stefano's scarf). Dani and the other two women scream. The next morning, Jane awakes up, limps to the door and calls out to her friends. She slowly walks down the stairs and screams when she sees Ursula and Katia dead in the living room, having been stabbed multiple times. Dani appears and reaches out to Jane, but she falls to the floor also from being stabbed and left for dead, but she dies before she can tell Jane anything. When she sees the front door being unlocked, Jane hides. The unseen black-clad killer enters the living room and begins sawing Ursula's corpse with a saw as Jane cringes in her hiding spot behind a door from the sight and sounds of it. Just then, the delivery man arrives with his groceries and leaves when no one answers to his knocking on the front door. After the man leaves, the killer resumes sawing up Ursula, puts her disembodied remains in a plastic bag and walks out. Jane comes out of her hiding place and heads for the stairs, and freezes when the door is opened again but the killer is only throwing in the bread and milk delivery left behind. Finding the telephone dead and the front door locked, Jane goes upstairs, despite the intense pain from her sprained ankle, resting at the top and not realizing that her slippers have come off. Jane goes to her bedroom window and sees the town below. She tries to signal someone using her cosmetics mirror reflecting sunlight. Roberto, still in town, looks up at the house and sees the reflection of the sunlight. He checks a phone directory at a local payphone and calls, but receives no answer. Jane, seeing the killer coming back, quickly cleans up the bedroom and hides all her clothes and other stuff to give the appearance of no one being there. She sees that her slippers are gone and looks out the bedroom door and sees the killer sawing up the dead body of Katia. Just then, the gas station owner arrives with Jane's car and knocks on the front door. With the killer again freezing and Jane unable to make a sound out of fear of being discovered, the gas station man leaves. As Jane goes to the window to try to signal a warning, she knocks over a chair. The killer comes upstairs forcing Jane to hide behind a drawer. After looking around the room and finding no one or any belongings, the killer then locks the bedroom door, with Jane still inside and leaves the key in the door. The killer then finds Jane's slippers on the steps, but he instinctively picks them up and throws them onto a bathroom floor. Jane is now locked in her own room while the killer goes back downstairs to resume sawing up Katia and Dani's dead bodies and leaves with them to bury them in a field a short distance away. When he is finished with burying the bodies of Stefano, Ursula, Katia and Dani, the killer then cleans up the house, washing away the blood and leaves while Jane watches, but she is still locked in her bedroom. At night, the grocery man tries to convince a group of local men that there are four women at the house as opposed to three the men had seen arrive. The killer is nearby and overhears the men. At the same time, Roberto goes to the gas station to get fuel before driving away and sees Jane's car there. The gas station manager tells him that although no one answered the door when he went to drop off Jane's car earlier, he also says that he did not see any of the other women leave. Back at the house, Jane, still locked in her bedroom, slides a newspaper under the door and pushes the key through the keyhole. The key misses the paper, but the killer graciously places the key on the paper for her. When Jane retrieves the key and finally gets the door open, Franz grabs her. Both of them are surprised to see each other and Franz tells Jane that \"he had to do it\", and that the women \"were only dolls\". A flashback shows a young Franz with his brother and a girl, and his brother, wishing to see the girl in an intimate ways, goes for her doll at the edge of a cliff and falls to his death. This made Franz see women who bring nothing but bad things for men. Franz also tells Jane that Flo and Carol seduced him and blackmailed him (they were the three people in the beginning), and they he had to kill Dani because she would have eventually remembered him and his scarf. Franz says he never wanted to hurt Jane, but since she knows that he is the killer, he must kill her to keep his secret intact. Just as Franz begins to strangle Jane with the red and black scarf, Roberto arrives and he and the crazed professor struggle which leads out the front door and into a barn. The struggle leads to the edge of a cliff that the barn sits right beside. Jane stumbles outside and hears someone fall. She watches warily as Roberto returns to her claiming that Franz is dead and the two of them leave to get the police.",
      "writers": [
         "Ernesto Gastaldi",
         "Sergio Martino"
      ],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0069920/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg3NjU4NjI5OV5BMl5BanBnXkFtZTcwMTY2NjQ3Mg@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Suzy Kendall, Tina Aumont, Luc Merenda | See full cast and crew »"],
      "reviews": [
         "Sergio Martino's \"Torso\" is one of the most underrated giallos ever made.A series of sex murders shock a college campus,and four young beautiful girlfriends(Jane,Daniella,Ursula and Katia)head for the safety of an isolated country villa.Soon a mysterious black-gloved killer begins to kill them one by one.\"Torso\" is filled with plenty of sleaze and graphic violence,so fans of Italian exploitation won't be disappointed.The murders are stylish and properly gory,and Martino has populated the film with several strikingly beautiful women,all of whom,with the exception of Suzy Kendall,take off their clothes.Martino managed to generate a fair amount of suspense,especially during the breathtaking climax as Jane and the masked murderer engage in a chilling contest of cat-and-mouse.The score by Guido and Maurizio DeAngelis is pretty effective too.A must-see for fans of Italian giallos!",
         "What more can I say? This is by far one of the best Slasher/Giallo's I've happened upon in years! Violent, atmospheric, stylish, moody and did I mention violent? Yes violent is definitely the word, because this packs it on like hamburger joints pack in salad.... Tons! Slashings, stabbings, eye poking, strangulation, drowning, etc, etc, etc... Don't listen to people whine about the only uncut version being Italian. I can assure you that once this bad boy starts playing, you won't care one bit!!! \"Bodies Bare Traces of Carnal Knowledge\" gets a very BIG 10/10",
         "I Corpi Presentano Tracce di Violenza Carnale/Torso(1973) is an overlooked and stylish giallo that doesn't get any respect. A portion of the people who responded to the film with negative comments are probably the same who thought that the Scream trilogy were clever and good. Sergio Martino fills the screen with beautiful women, black glove assassain, good music, and outstanding murder set pieces. I wouldn't have like this film if the director had done an Argento copycat. Although the video is said to be uncut, it still has the look of a movie with some scenes trimmed. One example is the first murder. Another example is the murder of the woman in the woods. What also gives the impression of a trimmed film are the sudden jump cuts in certain spots during the movie. Suzy Kendall and Tina Aumont are stunning as the main female characters. The murder of Dani is a little shocking because the film teases the viewer with the idea that she will be the main heroine. Torso(1973) seems to be the main blue print for the plot of Prom Night(1980)(another film that deals with a person who kills because of something from the past). Torso(1973) would provide an influence on American slasher flicks including Friday the 13th(1980), Friday the 13th Part 2(1981), Halloween(1978), I Know What You Did Last Summer(1997), Maniac(1980), My Bloody Valentine(1981), and Scream 2(1997). The opening scene is shot with some terrific camera angles. Torso(1973) is one of the top ten giallos of the 1970's. The combination of sex & violence in Torso(1973) is a prime example of the bread and butter of the genre. The scene where Suzy Kendall has to hide from the murderer is less on suspense and more on tension. The murder scene in the woods is shot with an atmospheric touch. The musical score by the DeAngelis brothers is as good as anything by Goblin. The make up effects are above average. My favorite part are the final twenty minutes. the story is well written by Ernesto Gastaldi who is also known for some memorable Italian flicks as The Horrible Dr. Hitchcock(Freda), The Whip and the Body(Bava), I am Sartana, Your Angel of Death(Carnimeo), and Sahara Cross(valerii). This is Martino's third terrific giallo right after The Blade of the Ripper(1970), and The Tail of the Scorpion(1971). The image and sound of the video are terrific. There are some elements from the giallo format that the teen slasher genre has yet to pick up.",
         "I'm not sure why some of the comments for this film were so unenthusiastic; I usually jump all over a slow horror film, though I don't believe this to be one at all. Anchor Bay's print is great, and the film is beautifully photographed. The scene in the muddy birch forest is alone worth the price of owning this. Sure, the standard giallo plot of a mad killer, driven to kill due to a childhood trauma is no surprise, but that's not really the point is it? This is also not a gorefest, but many great giallos are not. The very essence of giallo, as I understand it, is visual style (and extremely beautiful women) over plot substance, and that certainly defines this film, which sits comfortably in my Italian horror top 15, if not top 10.",
         "With a title like 'Torso' one would expect this Italian horror film to either be very bloody or very lurid. In this case, it's both. Murders at a Rome college forces a group of lady friends to retreat to an isolated house in the hills. But little do they know the killer has followed them... While director Sergio Martino isn't Dario Argento or Mario Bava his direction in this film is pretty well done. He makes the most of a simple storyline with some lush filming locations, solid scenes of tight suspense, and an all-around attractive cast. Particularly great is the beautifully atmospheric stalking sequence with Carol in the woods, as well as the highly intense scene where Jane must hide from the killer while he dismembers one of her friends. This effort will be most entertaining to the exploitation fans, as the film has plenty of female nudity and the occasional bit of gore. The cast is fairly decent, Suzy Kendall is the biggest stand-out though as a young woman trapped by the killer. Over all a good horror effort that would later influence the slasher genre. Torso isn't for all tastes, but for the game giallo or slasher fan it's a great treat. *** out of ****",
         "A killer is killing coeds and Jane (Suzy Kendall) gets stuck in a rented house with him in this VERY unjustly under-rated thriller giallo. The last third of the film when Suzy is trying to hide from the killer is worth the price of admission alone, not to say what comes before that isn't good as well. This Sergio Martino directed film could hang out with the films of Bava and Argento any day. A must for anyone who really loves the genre. My Grade:B+ DVD Extras: International and American Trailers (one of the few times, i actually like the American trailer better) Eye Candy: Patrizia Adiutori, Cristina Airoldi, Carla Brait, and Angela Covello all show much flesh",
         "In many ways this is a fairly average Italian slasher pic, but it stands out from the rest by having possibly the most beautiful women ever to have featured in this type of film. The gore effects are extremely unconvincing, especially a pathetic eye gouging seen and a head being smashed against a wall by a car. Apart from the poor effects there are a few atmospheric scenes, a nice soundtrack and the dubbing isn't as bad as it could be. Overall it's a decent film and worth checking out if your into this sort of thing. I viewed this film on the uncut/unrated DVD released by Anchor Bay.(nice picture, although a bit grainy in darker scenes)",
         "I admire this piece of giallo cinema because of its great style and how director Sergio Martino contrasts the gorgeously beautiful Italian countryside with the bloody activities of a mysterious gloved killer. In this film, the killer is unique because he/she casts a very unique, eerie presence whenever hinted at or briefly shown onscreen, usually wearing some sort of ski mask to hide his/her face. I also like the plot revolving around the red and black scarf, and how it ties in with the identity of the murderer. The story follows a group of young, gorgeous Italian coeds frightened when their friends start dropping like flies at the hands of a brutal slasher, who likes to strangle, stab and fondle the nude bodies of his victims (another sick, effective touch which makes the film all the more nasty). Four of the girls flee to a villa in a small, scenic village to get away from all the atrocities committed on campus. Of course, the killer has followed them there and is set on killing them off one by one. This film is very perverted in ways, the killings are all sexually sadistic in nature, and the motive basically revolves around the dangerous sexual games played by the beautiful coeds. I can't say more without revealing clues which may give away the killer's identity. \"Torso\" is also loaded with female nudity, as the film starts right off with a wild orgy going on as the credits roll, complete with close up shots of naked breasts. There is also a slight lesbian subplot involving two of the girls, although we don't see anything that graphic at all. No male nudity is present, which is too bad, I was really waiting for one of my fav hot actors, John Richardson, to take something off, but no such luck. Again, this movie is creepily effective, well-acted, and has great photography, and even if you do find it slow-moving, keep with it, as the finale is probably the best part of the film as the heroine has to watch the killer carve up her friends, one of the most unnerving sequences I have ever seen captured on film. The music is pretty good for the most part, but at times it seems like music better suited to a porno flick. And another thing to mention is, the uncut version of this movie doesn't seem to have that much gore at all, I just figured it would since such a big deal was made about it being uncut with all the \"grisly violence\" finally restored. It still seems like you're watching the R-rated version. Oh, well. This is still a fun movie, especially for those who love Italian horror.",
         "- Torso may not be the best giallo that Sergio Martino ever made, but I'll argue that it has some of the most intense moments found in any of his films. The last 30 minutes or so are as edge-of-your-seat, tension filled as you'll see. The movie kicks into high gear when Jane (Suzy Kendall) wakes-up only to find all of her friends slaughtered. But the nightmare doesn't end there. The killer is still in the house, taking his own sweet time to dismember the bodies. Jane hides just inches away from the killer. This is incredible stuff. - It's too bad the rest of the movie isn't as good as the finale. Sure, there are some nice scenes - the girl being stalked though the swamp - but these moments can't compare with Jane's plight at the end. The first two-thirds of the movie are reasonably entertaining, just not the best you'll see from Martino.",
         "I was surprised at how well this movie was made. The direction is first rate. I saw a restored and \"uncut\" Danish DVD. It looked great. Although I'm not sure about the \"uncut\" part, as the are still images with full frontal nudity which do not appear in the movie. But there are plenty of attractive topless females. There's also plenty of violence and gore. But the story is good, too. Females are stalked by a violent psychopathic killer. They seek refuge in an isolated mansion. The police is on the trail of the killer. They story is well-written and shows the characters as having some intelligence. The only thing missing is more character development of the females. One doesn't sympathize much with any of them because we don't get to know them all that well. There's also a good explanation given for the killers motives. Overall a surprisingly good achievement."
      ],
      "genres": [
         "Horror",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": ["Compagnia Cinematografica Champion"],
      "summaries": ["Someone is strangling coeds in Perugia. The only clue is that the killer owns a red and black scarf, and police are stumped. American exchange student Jane and her friends decide to take a break from classes by going up to Danielle's uncle's villa in the country. Unfortunately the killer decides to follow, and the women begin suffering a rapid attrition problem."],
      "budget": 0
   },
   "movielensId": 3493,
   "movielens": {
      "languages": ["Italiano"],
      "releaseDate": "1973-01-04",
      "dvdReleaseDate": "2000-03-21",
      "directors": ["Sergio Martino"],
      "runtime": 97,
      "movieId": 3493,
      "title": "Torso",
      "mpaa": "R",
      "actors": [
         "Suzy Kendall",
         "Tina Aumont",
         "Luc Merenda",
         "John Richardson",
         "Roberto Bisacco",
         "Angela Covello",
         "Ernesto Colli",
         "Carla Brait",
         "Conchita Airoldi",
         "Patrizia Adiutori",
         "Luciano Bartoli",
         "Luciano Bartoli",
         "Luciano De Ambrosis",
         "Enrico DiMarco",
         "Rosaria della Femmina"
      ],
      "imdbMovieId": "0069920",
      "originalTitle": "I corpi presentano tracce di violenza carnale",
      "genres": [
         "Horror",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": ["AVxoiIZ8l0o"],
      "plotSummary": "A series of sex murders shock a college campus, and four beautiful young girlfriends head for the safety of an isolated country villa. But as they succumb to their own erotic desires, their weekend of pleasure becomes a vacation to dismember at the hands - and blade - of the lecherous maniac.",
      "tmdbMovieId": 31624,
      "avgRating": 2.92593,
      "releaseYear": "1973",
      "numRatings": 54,
      "posterPath": "/xDQUXVzCbOEJm485GTc5HbUvRz3.jpg"
   }
}