{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "bounty hunter",
            "id": 801
         },
         {
            "name": "man hunt",
            "id": 10958
         }
      ],
      "imdb_id": "tt0065126",
      "video": false,
      "title": "True Grit",
      "recommendations": [
         6644,
         16211,
         15263,
         301,
         3110,
         3089,
         11697,
         12584,
         995,
         17538,
         14551,
         11901,
         3090,
         37347,
         21717,
         11897,
         3109,
         14881,
         488,
         10747
      ],
      "backdrop_path": "/2GFwBXjyHCpUylaQSU00MGPmh1t.jpg",
      "revenue": 14250000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Marshall Reuben J. 'Rooster' Cogburn",
               "gender": 2,
               "credit_id": "52fe472f9251416c750907f9",
               "name": "John Wayne",
               "profile_path": "/iw9gHSQj1l3TQeiJb5tNK2N8k2w.jpg",
               "id": 4165,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Mattie Ross",
               "gender": 1,
               "credit_id": "52fe472f9251416c750907fd",
               "name": "Kim Darby",
               "profile_path": "/reo1PpebXN5YwX4YZ88CHjvRxM0.jpg",
               "id": 15655,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Emmett Quincy",
               "gender": 2,
               "credit_id": "52fe472f9251416c75090801",
               "name": "Jeremy Slate",
               "profile_path": "/w9SPBkH6XvFSMCDCOUA28BIZGgN.jpg",
               "id": 78690,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Moon",
               "gender": 2,
               "credit_id": "52fe472f9251416c75090805",
               "name": "Dennis Hopper",
               "profile_path": "/rq1n4dbFRXkaBspAbNzmNgyFMp.jpg",
               "id": 2778,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Ned Pepper",
               "gender": 2,
               "credit_id": "52fe472f9251416c75090809",
               "name": "Robert Duvall",
               "profile_path": "/1aBC7NxPy10ofng6HsJBecJ1vMZ.jpg",
               "id": 3087,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "La Boeuf",
               "gender": 2,
               "credit_id": "52fe472f9251416c75090813",
               "name": "Glen Campbell",
               "profile_path": "/zCvplw7hFXuyrciN012GqEXg7b.jpg",
               "id": 86110,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Goudy",
               "gender": 0,
               "credit_id": "52fe472f9251416c75090841",
               "name": "Alfred Ryder",
               "profile_path": "/y9AcwedephR2UFKBzKHSjVpF8Y8.jpg",
               "id": 15620,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Colonel G. Stonehill",
               "gender": 2,
               "credit_id": "52fe472f9251416c75090845",
               "name": "Strother Martin",
               "profile_path": "/64R2JqNX6MQMBZZK8wkXXKM9pTF.jpg",
               "id": 8260,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Tom Chaney",
               "gender": 2,
               "credit_id": "52fe472f9251416c75090849",
               "name": "Jeff Corey",
               "profile_path": "/qchQWDmKLhr6QRDIsUFyjezXXT.jpg",
               "id": 9596,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Captain Boots Finch",
               "gender": 2,
               "credit_id": "52fe472f9251416c7509084d",
               "name": "Ron Soble",
               "profile_path": "/rt0rehPLz50IzXolpI20MjkpTJF.jpg",
               "id": 161405,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Lawyer Daggett",
               "gender": 2,
               "credit_id": "52fe472f9251416c75090851",
               "name": "John Fiedler",
               "profile_path": "/wjhOLcxWaum0JIBIRMZaQQjrhQw.jpg",
               "id": 5247,
               "order": 10
            },
            {
               "cast_id": 23,
               "character": "Judge Parker",
               "gender": 2,
               "credit_id": "52fe472f9251416c75090855",
               "name": "James Westerfield",
               "profile_path": "/s8Ian9N1Y5VVvB8C8OchOoQzRwk.jpg",
               "id": 9866,
               "order": 11
            },
            {
               "cast_id": 24,
               "character": "Sheriff",
               "gender": 2,
               "credit_id": "52fe472f9251416c75090859",
               "name": "John Doucette",
               "profile_path": "/fgxqNmMIQHHCy0uxN1XXEon9eLq.jpg",
               "id": 34130,
               "order": 12
            },
            {
               "cast_id": 25,
               "character": "Barlow",
               "gender": 2,
               "credit_id": "52fe472f9251416c7509085d",
               "name": "Donald Woods",
               "profile_path": "/A9PoBFa8pDZbVLaxhxgNl8Gi898.jpg",
               "id": 118022,
               "order": 13
            },
            {
               "cast_id": 26,
               "character": "Mrs. Floyd",
               "gender": 1,
               "credit_id": "52fe472f9251416c75090861",
               "name": "Edith Atwater",
               "profile_path": "/uHdVrHbTrqRvEDhJXj88cVg0xqP.jpg",
               "id": 14577,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe472f9251416c7509080f",
               "name": "Henry Hathaway",
               "profile_path": "/aHXD9EFWbtftnaBzPYfO2dkLLKd.jpg",
               "id": 37360,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe472f9251416c75090819",
               "name": "Marguerite Roberts",
               "profile_path": null,
               "id": 39760,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe472f9251416c7509081f",
               "name": "Charles Portis",
               "profile_path": null,
               "id": 562919,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe472f9251416c75090825",
               "name": "Paul Nathan",
               "profile_path": null,
               "id": 1091871,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe472f9251416c7509082b",
               "name": "Hal B. Wallis",
               "profile_path": null,
               "id": 4123,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe472f9251416c75090831",
               "name": "Joseph H. Hazen",
               "profile_path": null,
               "id": 1029442,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe472f9251416c75090837",
               "name": "Elmer Bernstein",
               "profile_path": "/3H3AqKesJnkwJzWFJY9hyFwci5m.jpg",
               "id": 7182,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe472f9251416c7509083d",
               "name": "Lucien Ballard",
               "profile_path": null,
               "id": 3351,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Western",
         "id": 37
      }],
      "popularity": 7.35979,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 17529,
      "vote_count": 248,
      "budget": 0,
      "overview": "The murder of her father sends a teenage tomboy, Mattie Ross (Kim Darby), on a mission of \"justice\", which involves avenging her father's death. She recruits a tough old marshal, \"Rooster\" Cogburn (John Wayne), because he has \"grit\", and a reputation of getting the job done. The two are joined by a Texas Ranger, La Boeuf (Glen Campbell), who is looking for the same man (Jeff Corey) for a separate murder in Texas. Their odyssey takes them from Fort Smith, Arkansas, deep into the Indian Territory (present day Oklahoma) to find their man.",
      "similar": [
         335,
         922,
         11942,
         27644,
         429,
         33,
         938,
         273248,
         68718,
         10159,
         78,
         97630,
         27573,
         335984,
         223485,
         199373,
         576,
         9923,
         2069,
         3595
      ],
      "original_title": "True Grit",
      "runtime": 128,
      "poster_path": "/rF3rQO7a44AvLYkQJWUUPKkK0l9.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1969-06-11",
      "vote_average": 7.4,
      "belongs_to_collection": null,
      "tagline": "The strangest trio ever to track a killer",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Henry Hathaway"],
      "runtime": 128,
      "synopsis": "Young tomboy Mattie Ross (Kim Darby) loves her father. But when this father gets killed by a tramp called Tom Chaney (Jeff Corey), she is determined to see him hang. She goes to Fort Smith and discovers that Tom Chaney has fled in the Indian territory, where only a marshall can get him. A marshall who has true grit, in order to vanquish not only Chaney, but also the group of outlaws he has connected with, led by the notorious bandit Ned Pepper (Robert Duvall) and including Moon (Dennis Hopper) and Quincy (Jeremy Slate). So Mattie finds the toughest marshall of the West : the one-eyed Reuben J. \"Rooster\" Cogburn (John Wayne), who's never known a dry day in his life, and hires him - with $100 - to go after Chaney and Pepper. Rooster soon pairs with young Texican La Boeuf (Glen Campbell) who also looks for Chaney as he had killed a Texas-senator before murdering Mattie's father. Mattie and La Boeuf are soon at odds, as the latest doesn't want her to join the chase, but Mattie hangs on and Rooster lets her come with them. Strong-headed Mattie, fast talking La Boeuf and sharp Rooster engage themselves in a battle of wits and, at the same time, on Chaney's tracks. After an ambush where Moon and Quincy are killed, Mattie gets face to face with Chaney and wounds him before being kidnapped by Ned Pepper. Ned forces Rooster and La Boeuf to withdraw and leaves Mattie with Chaney as a hostage. But La Boeuf comes back and captures Chaney. Mattie and La Boeuf witness the last fight between Ned Pepper and three of his men on one side, Rooster all alone on the other. They all charge on their horses and Rooster kills three men and injures Pepper before his horse (Bo) is killed under him. He desperately tries to get his gun as the dying Ned comes closer. At the very last moment, La Boeuf fires from the hill he stands on with Mattie and shoots Ned before Rooster gets killed. Chaney then escapes and hits La Boeuf on the head with a big stone, only to get shot again by Mattie. With the gunfire, she falls in a pit where a deadly snake threatens her. Rooster arrives at that moment, kills Chaney who was still trying to hurt Mattie and goes down the pit to save Mattie. The snake bites her and Rooster's unable to go up the pit with the unconscious Mattie. La Boeuf wakes up just a little while to pull them out with a horse and a rope, before falling dead. Rooster leaves him on the field and kills his horse under him to bring Mattie to a doctor. At the end of the movie, Mattie is back to her ranch where she heals slowly. Rooster comes and visits her. She shows him the cemetery where her father rests and she offers him, as he has no family, to rest beside her after his death. He takes on the offer with a joke and departs, jumping over a fence and yelling: \"Come and see a fat old man sometime!\"",
      "writers": [
         "Charles Portis",
         "Marguerite Roberts"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0065126/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYwNTE3NDYzOV5BMl5BanBnXkFtZTcwNTU5MzY0MQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: John Wayne, Kim Darby, Glen Campbell | See full cast and crew »"],
      "reviews": [
         "Like most Americans, I have seen hundreds, maybe thousands of westerns in my life. I don't care for them much, primarily because I usually can't fall for them. In movies, the desire to please as wide an audience as possible seems always to win out, effectively robbing most westerns of the motion picture's essential gambit; the suspension of disbelief. It's very hard to lose oneself in a tale of the late 1800's when the female lead's eye-liner and coiff are pure 1950. Or 1940, 1960, whatever. In True Grit, very little of 1969 is allowed to intrude on this rather simple tale of justice and revenge. This movie is anchored by two very strong themes, shared by all the actors, across most of the scenes. The first, is language. The dialogue is an absolute delight. Crack open anything by Mark Twain, Henry James or any other late 19th century author, and you will see that people really did speak differently 150 years ago. That the dialogue in 99% of westerns is straight from the time of their filming is a travesty, at best. Second, is innocence. Not that of any one character however, but the innocence of the human race as a whole. It is probably almost impossible for any of us now, in this day and age, to truly imagine what it must have been like to live back when. But one thing's sure, people were much more naive. There was no such thing as mass-communication, a good percentage of the population didn't read, and newspapers, the only \"organized\" form of news at the time, were hard pressed to report on anything more than a day's ride from town. This basic, shared innocence is achingly portrayed by Robert Duvall in two short sentences near the end of the movie when he's caught Mattie and he's attempting to threaten her. Study those two lines, and you'll see that \"Lucky\" Ned Pepper, the worst villain in the story, really has no idea of what he could possibly do to a slip of a girl. He's totally at a loss. The unspeakable, modern-day atrocities we consume every day with our coffee and bagels are so far from contemplation by Duvall's character, that all he can do is assure her, \"I'll do what I have to\". It's a priceless moment - frighteningly accurate commentary wrapped in two lines of simple dialogue, delivered with dead-on interpretation. The only other western I can think of at the moment that delivers with such viscerally historic accuracy is \"Unforgiven\". MjM",
         "\"Come see a fat old man sometime!\" John Wayne's parting comment in this film is directed as much at us the viewers as it is at the young woman his Rooster Cogburn character is addressing. In a way, Wayne throughout the film plays off the image he cemented in dozens of great and near-great westerns, with a nod that by 1969, he along with the western genre had fallen behind the times, that his shoot-first approach to law and order had worn thin with the critical establishment just as it does in Judge Parker's courtroom. In that way, playing a character of such dogged homicidal cussedness as the hard-drinking, one-eyed ex-Quantrill Raider Rooster Cogburn and giving him a teenaged girl seeking justice to play off so as to showcase his essential decency seems a clever means to win Wayne an Oscar, which he finally did here, a sentimental triumph over some more heralded performances. With such an attitude, you might think \"True Grit\" would come off a bit of a one-trick pony 37 years on. But it doesn't. In many ways, both the film and Wayne's performance come off better than ever. Helping matters a lot is the support Wayne receives from two women. As the heroine, Matty Ross, Kim Darby provides Wayne with a fantastic foil, doughty to the point of rudeness, forever finding fault in others but earning your good will through her simple faith in justice and loyalty to the memory of her slain father, for whom she wants Rooster's help avenging. As she is told by a horse dealer she banters with: \"I admire your sand.\" The other is Marguerite Roberts, whose adaptation of Charles Portis' novel bristles with good humor and an ear for the period. \"If ever I meet one of you Texas waddies who ain't drunk water from a hoofprint, I think I'll... I'll shake their hand or buy 'em a Daniel Webster cee-gar,\" Rooster tells his braggart riding companion, a young Texas Ranger played by country singer and ex-Beach Boy Glen Campbell. Campbell may be a novice and a third wheel in the interplay between Wayne and Darby, but he acquits himself well and delivers a worthy performance in a cast stacked with talented actors like Robert Duvall, Jeremy Slate, and Strother Martin, not to mention Dennis Hopper, hiding the long hair he made famous in \"Easy Rider\" that same year. Some of these actors portray bad guys, but Roberts' script and director Henry Hathaway's languid pacing allow them to present some humanizing qualities that go a long way toward making \"True Grit\" more than your typical shoot-em-up oater. Even Jeff Corey, who plays a no-account named Chaney who shot Matty's father, has a funny scene when he tells Matty how to cock her pistol, then whines after she shoots him with it: \"Everything happens to me!\" About the only fault I can find with the film is Elmer Bernstein's bombastic score, which employs overly ornate orchestration like kettledrums when Matty has her showdown with Chaney and is tuneless apart from the title song, which is Campbell's best moment here. Hathaway's direction is somewhat pedestrian but serves the script, and showcases some incredible autumnal vistas of tall birch and pine where Rooster and Matty search for Chaney, photographed by Lucien Ballard in a style akin to (but more dreamy than) his work on the same year's \"The Wild Bunch.\" 1969 was the last great year for westerns, with this, \"The Wild Bunch,\" \"Butch Cassidy And The Sundance Kid,\" \"Support Your Local Sheriff\" and \"Once Upon A Time In the West,\" and its interesting how Ballard, Corey, and Strother Martin turned up in more than one of them. But good westerns never really go out of style, they just sit on the shelf awhile like an old Stetson waiting to be rediscovered. Nobody wore a Stetson better, or deserved an Oscar more, than John Wayne. \"True Grit\" does the double duty of showing why he was a star and further burnishing his luster.",
         "Surely one of the purest westerns ever made, a simple tale of a lawman tracking down an outlaw. This film is raised way above the norm in almost all respects: The photography is superb, with the hills, mountains, valleys and forests being the real stars; the acting is first rate, with not a weak performance in sight from even the lowliest minor character; the direction is well paced as we ride along with the 3-person-posse through the landscape and experience the minor twists of the actual hunt, as well as the evolution of the relationships between the group. The episode in which they take over a cabin by a stream and then ambush the following villains is even better than the well known finale. Why this film hasn't had more votes and a higher rating in imdb is a complete mystery to me. I'm English, and I always thought the Americans really loved their westerns and John Wayne in particular. Can anyone explain please?",
         "Now personally there are John Wayne performances in terms of acting that I like better than True Grit. Among others Fort Apache, The Searchers, Red River, The Horse Soldiers, to name a few. And certain films like The Commancheros and McLintock and Big Jake I find to be more entertaining. What True Grit does is succeed on both levels, being both great entertainment and giving John Wayne the acting role of a lifetime in the person of Rooster Cogburn. Mattie Ross from Darnell and Yell County Arkansas personified by Kim Darby has come to Fort Smith seeking the killer of her father Jeff Corey. Turns out he's also killed a State Senator in Texas so Texas Ranger Glen Campbell informs her. Both of them team up with United States Marshal Rooster Cogburn who resides in Fort Smith with Chin Lee and my favorite movie cat, General Sterling Price. Corey is now in the outlaw band headed by Robert Duvall at large in the Indian Nation Territory that became Oklahoma. True Grit's plot is the trio's pursuit of Duvall, Corey and the rest of the gang. But oddly enough True Grit isn't really about plot. It's about the creation of a character. Like Margaret Mitchell who wrote Gone With the Wind with Clark Gable in mind for Rhett Butler, Charles Portis wrote the novel True Grit with only John Wayne in mind as Rooster Cogburn. It must have been one singular delight for Charles Portis to see the Duke flesh out Rooster Cogburn exactly as he conceived him. Tough old Rooster, likes an occasional drink, isn't above a little larceny, but has one stern moral code about real bad guys. Bring him in dead or alive and make sure you shoot first coming up against them. And he's got quite the colorful past as he relates tales of his younger days to Campbell and Darby on the trail. In other reviews I've said that John Wayne had one of the great faces for movie closeups. You can see a perfect example of that in that scene with John Fiedler who plays Darby's lawyer J. Noble Daggett. A man who rates high in the legal profession in that area having forced a railroad into bankruptcy. The camera is facing Fiedler as he's talking to Wayne about his visit with Darby who's life Wayne saved. Wayne's got about a third of his face to the camera. But even with that third, your eyes are focused on the Duke and his reactions and then as the camera slowly pans around to Wayne in full face his reaction shots are hysterical. You don't work with scene stealing character actors like Chill Wills, Walter Brennan, and Gabby Hayes for 30 years without learning something. John Wayne was up against some stiff competition in 1969 for the Best Actor Oscar. It was his second nomination, the first being for Sands of Iwo Jima. He was facing Richard Burton as Henry VIII in Anne of a Thousand Days and a couple of newcomers named Dustin Hoffman and Jon Voight for Midnight Cowboy. He was certainly the sentimental favorite. If in no other place in our lives, sentiment does have its place in cinema. It was an honor well deserved, not just for one performance but for a lifetime of achievement in cinema being the player who put more people into movie seats than any other person ever. So many of the Duke's contemporaries like Edward G. Robinson, Errol Flynn, Tyrone Power were never even nominated for an Oscar much less win one. Because the Motion Picture Academy has deemed this John Wayne's grandest cinematic achievement, it's almost a command to support this fine western and the man who defined the western hero and is still defining it.",
         "There isn't a false note in this film. Charles Portis' book of the same name is practically adapted verbatim to the screen; this is the purest book to movie transfer I've yet seen, and this assures its success. John Wayne worked for 50 years to get to this role, and no one else could have played it. He becomes Rooster Cogburn; it revitalized his career and made everyone finally take notice of his skills as an actor. I love Wayne in anything, but this movie has a special place in my heart. Kim Darby is also a surprise. She's more than capable of handling Wayne in each and every scene. They made a very good team. Glen Campbell is not as good as these two, but then he really isn't an actor. He does have his moments, though, and acquits himself with aplomb as the Texas Ranger. Strother Martin is a real hoot as Stonehill, the horse trader; he's always a great asset to any film, and this must have been his 10th appearance in a Wayne movie. Robert Duvall is very good and very harried as Lucky Ned Pepper. He's not a wanton killer; he doesn't kill, or even hurt, Kim Darby. He's just a thief who wants to be left alone, and you can see by his worried expression that he knows Rooster won't ever let him go. Dennis Hopper and Jeremy Slate have a small, very fine scene in the middle of the movie, where they are partners in crime who don't see things in the same way. A previous review talks about the low amount of votes on this film by people in the US. I would chalk that up to the age group that saw this film and loved it. Most of those people are not into computers yet, and probably don't know about the IMDB. Believe me, it's considered a classic, and rightfully so. This is a fine family film that everyone should see. Rent it, buy it, or borrow it, but do watch it. It will make anyone a John Wayne fan. And be sure to read the book; I couldn't put it down.",
         "This movie came out when I was just a wee gal. My grandfather was a big western fan, so I am sure I saw it at his house in between episodes of Gunsmoke. I don't remember the first time I saw it, but I remember how I came to love John Wayne. When he died in the late 70s I was crushed. I still watch this movie at least once a year, (it is on TNT or some other Turner channel at least monthly). Rooster Cogburn is, to me, the archetype of all Western heroes. He is the undeniably flawed, crochety old man that hides his tenderness behind a facade of toughness. He roams all over the west in search of bad guys, and he drinks to fill the hole inside him that loneliness has created. It is important to say that he is not a killer, or interested in revenge. His whole being, his soul, rests on the cause of justice. He is the bravest character ever created in a writer's imagination. At the end, when he jumps his horse over the fence and tells Maddie to come and see an old fat man sometime, I cry. Everytime. Despite his politics, and the fact that he was just an actor, to me John Wayne is the lone western hero that will remain in my heart for all my life.",
         "\"True Grit\" deals with one of the classic Western themes, indeed one of the classic themes in all literature- revenge. A teenage girl, Mattie Ross, is looking for someone who will help her track down Tom Chaney, the man who murdered her father. The man Mattie chooses is Rooster Cogburn, a US Marshal. Cogburn is elderly, fat, one-eyed and a heavy drinker, but Mattie chooses him because she has heard that he has \"true grit\". The two of them set out into the Indian Territory in search of Chaney, accompanied by La Boeuf (shouldn't that be Le Boeuf?), a Texas ranger who wants to arrest him in connection with another murder. This is perhaps best remembered today as the film for which John Wayne won his only Oscar. Halliwell's Film Guide rather ungraciously refers to it as a \"sentimental Oscar, for daring to look old and fat\", but there is more to Wayne's performance than that. The Academy, in fact, had tended to overlook Wayne, just as they overlooked the Western genre which provided him with most of his roles; well over a hundred films had only brought him two previous nominations. Cogburn, however, was one of his best roles. On the surface a hard-bitten, irascible old man, he has hidden depths to his character- not only the courage and determination implied by the phrase \"true grit\", but also a sense of humour and a capacity for tenderness. Cogburn is a lonely man, divorced from his wife and alienated from his only son, and his only friends are a Chinese storekeeper (a rare acknowledgement from Hollywood that not every inhabitant of the West was either white or an Indian) and his cat. A close relationship, however, grows up between him and the orphaned Mattie, for whom he becomes a substitute father. In turn, she becomes the daughter he never had- or perhaps even a substitute son. Mattie is a complex character. There is much about her that is androgynous- her tomboy looks, her short hair, even her name, which can be short for Matthew as well as Matilda or Martha. She is brave and determined (there is a suggestion that the phrase \"true grit\" applies to her as well), but can also be a pain in the neck, especially to Cogburn. She is at times wise in the ways of the world and at others strangely innocent. She is part avenging angel, part bookish intellectual (shown by her rather formal language) and part vulnerable child. It is a role that called for an outstanding performance and got one from Kim Darby who was able to bring out all the various facets of Mattie's character. (This is the only film of hers that I have seen, but it seems strange on the strength of this that her subsequent cinema career has been so patchy). Unfortunately, Glenn Campbell, a singer with little previous acting experience, made a weak La Boeuf. It is probably as well that John Wayne did not get his way when he wanted Karen Carpenter, a singer with absolutely no previous acting experience, to play the role of Mattie instead of Darby. Great actors do not always make great casting directors. \"True Grit\" does not perhaps have the depth of meaning of some of the truly great Westerns, such as \"High Noon\", \"Unforgiven\" or Wayne's last film, \"The Shootist\", but it is a very good one. It is a fast-moving and exciting adventure, notable for some beautiful photography of mountainous landscapes (although it is ostensibly set in relatively flat Oklahoma, it was actually filmed in Colorado and California), for one of the great iconic moments of the Western (the scene where Cogburn gallops alone into battle, guns blazing, against four opponents) and for two excellent performances in the two main roles. 7/10",
         "Henry Hathaway's \"True Grit\" can stand up very well as Western adventure on its own account\u0097the story of a young girl (Kim Darby) coolly hiring an old lawman (John Wayne) to seek out the murderer (Jeff Corey) of her father\u0085 Texas Ranger Glen Campbell rides along in the hope of collecting reward money\u0085 Suspense, action\u0097the film has more than its share\u0097and the practiced hand of Hathaway sees that justice is done in these terms\u0085 But when this has faded, when perhaps even the engaging and forceful Kim Darby has extent in time, Wayne's portrait of that fat, mean, greedy, eye-patched, Whisky drinking and yet in some strange way lovable lawman will remain\u0085 It will remain as a fine comedy performance, not as self-parody of his many Western roles, as has been rather ungraciously suggested... Marshal Rooster Cogburn is a kind of a tough U.S. Marshal with a cutting edge\u0085 Without any doubt the West knew characters like him... John Ford would know exactly what Wayne was about in this role\u0085 When he says in the declining moments of this picture: 'Come and see a fat old man some time,' that's a standing invitation\u0085 Audiences will want a peek at this portrait for some considerable time to come\u0085",
         "First on UK BBC1 on Christmas Day 1974 and shown again many times since has meant I never bothered taping this classic - now I've seen it umpteen times it still leaves me smiling. The relentlessly eccentric badinage between the 3 main characters and others should be enough to make anyone smile, even with a little violence and a few serious points raised along the way. A tough man on a tough hunt for a gang of toughs - it's John Wayne's film all the way, with this he passed into his last phase in the saddle with a continuous wink at the cowboy parody he had become and which no-one else will ever match. By now after 40 years he was an American legend, your giant avuncular instant-lawman starring in his next horse opera - True Grit would really be nothing special without him, with the fat old man it's a nice Western comedy. We in the audience knew he had Grit before he came on, Kim Darby was just too slow on the uptake. I never understood why the script was so uncharitable to the Texican horse-killing son of a bitch Campbell, he's belittled right up to the scenes in Mattie's family graveyard. Overall a shot in the arm (or leg!) if seen every few years - even in 1969 entertaining action films could still be made!",
         "I have a kind of synchronistic relationship with this movie. I had dinner in a Chinese restaurant in Washington, DC, called \"Chin's\", and the next day sensed in the theater that the Chinese guy would be called \"Chin.\" A bit later I bought a worn paperback copy of the novel in Mrs. Cohen's bookstore in South Windsor, Connecticut, not expecting much. The dialogue in the movie was stilted. I figured the novel was just some exercise in style. But that was wrong. The novel is even better than the movie. Charles Portis has got Arkansas of circa 1890 down pat. I looked up in the DARE all those expressions that didn't immediately click with me -- \"blue john\", \"that's a big story,\" \"barlow knife,\" \"dogfall,\" \"Christmas gift\" -- and they all work. Portis hit every nail on the head, and not only with respect to lexicon. The novel as a whole is beautifully done. Not to denigrate the movie, though. Kim Darby and the other players are good. John Wayne is excellent as a character actor. His performance here ranks up there with his Captain Brittles in \"She Wore a Yellow Ribbon.\" Why in God's name, after this, did he go back to his usual heroic roles in dismissable efforts like \"The Train Robbers.\" Every word he utters here is \"Rooster Cogburn,\" not \"John Wayne,\" except for one exchange on horseback about Quantrell. Hoarse, drunk, smelly, weighty -- he embodies the part. The cinematography is without equal. Sharp, smooth. A viewer almost smells the junipers and pinon pines of the Colorado mountains and feels the nightly chill in the air and whiffs the campfire smoke. A marvelously done novel turned into as good a movie as possible. At one point, with nothing much being made of it, Kim Darby says of alcohol, \"I would not put a thief in my mouth to steal my brains.\" Portis shouldn't get credit for that because it is a quote from Shakespeare. I won't identify the play."
      ],
      "genres": [
         "Adventure",
         "Western",
         "Drama"
      ],
      "productionCompanies": [
         "Paramount Pictures",
         "Hal Wallis Productions"
      ],
      "summaries": [
         "The murder of her father sends a teenage tomboy, Mattie Ross, (Kim Darby), on a mission of \"justice\", which involves avenging her father's death. She recruits a tough old marshal, \"Rooster\" Cogburn (John Wayne), because he has \"grit\", and a reputation of getting the job done. The two are joined by a Texas Ranger, La Boeuf, (Glen Campbell), who is looking for the same man (Jeff Corey) for a separate murder in Texas. Their odyssey takes them from Fort Smith, Arkansas, deep into the Indian Territory (present day Oklahoma) to find their man.",
         "In 1880, in Dardanelle, Yell County, the farmer Frank Ross heads with his employee Tom Chaney to Fort Smith to buy some ponies. However, he is murdered by Chaney that steals his money and flees to the Indian Territory. Frank's teenager daughter and book keeper of the family business Mattie Ross travels with one employee to bring the body of her father back home. Before meeting the undertaker, they see the hanging of three men sentenced by the tough Judge Parker. The stubborn Mattie seeks out the sheriff that tells her that he does not have authority in the Indian Nation. She asks who the best Marshall is and the sheriff recommends Reuben J. \"Rooster\" Cogburn, an old big fellow with eye pad that has grit to bring criminals from the Indian Territory. Mattie hires the drunken Rooster and when they are ready to depart, the Texas Ranger La Boeuf visits Rooster and tells that there is a huge reward for Tom Chaney in Texas for the murder of a senator. La Boeuf joins Rooster and Mattie and the unlikely trio begins their dangerous journey seeking out Tom Chaney in the Indian Territory.",
         "A drunken, hard-nosed U.S. Marshal and a Texas Ranger help a stubborn young woman track down her father's murderer in Indian territory."
      ],
      "budget": 0
   },
   "movielensId": 3494,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1969-06-11",
      "dvdReleaseDate": "2000-03-21",
      "directors": ["Henry Hathaway"],
      "runtime": 128,
      "movieId": 3494,
      "title": "True Grit",
      "mpaa": "G",
      "actors": [
         "John Wayne",
         "Kim Darby",
         "Jeremy Slate",
         "Dennis Hopper",
         "Robert Duvall",
         "Glen Campbell",
         "Alfred Ryder",
         "Strother Martin",
         "Jeff Corey",
         "Ron Soble",
         "John Fiedler",
         "James Westerfield",
         "John Doucette",
         "Donald Woods",
         "Edith Atwater"
      ],
      "imdbMovieId": "0065126",
      "originalTitle": "True Grit",
      "genres": ["Western"],
      "youtubeTrailerIds": [
         "tN-j4GDqjv4",
         "VyYJw50Yjuk"
      ],
      "plotSummary": "The murder of her father sends a teenage tomboy, Mattie Ross (Kim Darby), on a mission of \"justice\", which involves avenging her father's death. She recruits a tough old marshal, \"Rooster\" Cogburn (John Wayne), because he has \"grit\", and a reputation of getting the job done. The two are joined by a Texas Ranger, La Boeuf (Glen Campbell), who is looking for the same man (Jeff Corey) for a separate murder in Texas. Their odyssey takes them from Fort Smith, Arkansas, deep into the Indian Territory (present day Oklahoma) to find their man.",
      "tmdbMovieId": 17529,
      "avgRating": 3.63494,
      "releaseYear": "1969",
      "numRatings": 2038,
      "posterPath": "/rF3rQO7a44AvLYkQJWUUPKkK0l9.jpg"
   }
}