{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "baby",
            "id": 1009
         },
         {
            "name": "cancer",
            "id": 10163
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "death",
            "id": 34079
         },
         {
            "name": "expectant mother",
            "id": 160946
         },
         {
            "name": "reconciliation",
            "id": 163976
         }
      ],
      "imdb_id": "tt0107630",
      "video": false,
      "title": "My Life",
      "recommendations": [
         11465,
         24742,
         47359,
         33695,
         69007,
         51515,
         14550,
         106143,
         48287,
         47045,
         61418,
         263091,
         26333,
         18713,
         20096,
         38554,
         51333,
         30690,
         50020,
         17770
      ],
      "backdrop_path": "/cCyKdSgekJyIqcNDi7XyOlW0bYL.jpg",
      "revenue": 27484464,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Bob Jones",
               "gender": 2,
               "credit_id": "52fe45d8c3a36847f80dda0d",
               "name": "Michael Keaton",
               "profile_path": "/myVdrYNGTgqunLfUSaM8DuVD7DL.jpg",
               "id": 2232,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Gail Jones",
               "gender": 1,
               "credit_id": "52fe45d8c3a36847f80dda11",
               "name": "Nicole Kidman",
               "profile_path": "/1ammEgq5D6qw5mM4WkgUmnxQ7Uy.jpg",
               "id": 2227,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Paul Ivanovich",
               "gender": 2,
               "credit_id": "52fe45d8c3a36847f80dda15",
               "name": "Bradley Whitford",
               "profile_path": "/66brylvzWLg94TRMd6QFrVyMOei.jpg",
               "id": 11367,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Theresa",
               "gender": 1,
               "credit_id": "52fe45d8c3a36847f80dda19",
               "name": "Queen Latifah",
               "profile_path": "/ht52no1SMDhYBwRAmWL9a5YCss1.jpg",
               "id": 15758,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Bill Ivanovich",
               "gender": 2,
               "credit_id": "52fe45d8c3a36847f80dda1d",
               "name": "Michael Constantine",
               "profile_path": "/fZXfSyDEeIWzGudVhgwG3f9HTl0.jpg",
               "id": 14884,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Young Bill Ivanovich",
               "gender": 2,
               "credit_id": "52fe45d8c3a36847f80dda21",
               "name": "Richard Schiff",
               "profile_path": "/gHFxL7MIGvmcbg5hhTNrbjIttQN.jpg",
               "id": 31028,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Dr. Mills",
               "gender": 0,
               "credit_id": "5452480d0e0a2639fe006c54",
               "name": "Mark Lowenthal",
               "profile_path": null,
               "id": 1224662,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Mr. Ho",
               "gender": 2,
               "credit_id": "57cae98592514135140031ef",
               "name": "Haing S. Ngor",
               "profile_path": "/dwvHUD5Q85IgxvDSEFXUlTtQq61.jpg",
               "id": 8976,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45d8c3a36847f80dda27",
               "name": "Bruce Joel Rubin",
               "profile_path": "/jgSFvY1hTFONlIkbfGHHnH6DW50.jpg",
               "id": 3431,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "545247fbc3a3680245006860",
               "name": "Bruce Joel Rubin",
               "profile_path": "/jgSFvY1hTFONlIkbfGHHnH6DW50.jpg",
               "id": 3431,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 4.704307,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 41659,
      "vote_count": 60,
      "budget": 0,
      "overview": "It seems that Bob Jones has everything a man could want, namely a fulfilling job and a beautiful, pregnant wife, Gail. But Bob's life is turned upside-down when he is diagnosed with cancer and given four months to live -- not even enough time to see his first child's birth. To cleanse himself of demons in his remaining days, Bob makes a video diary, hoping to pass along some wisdom to his future child. Along the way, he discovers a lot about himself.",
      "similar": [
         74997,
         205,
         2142,
         400,
         3134,
         4141,
         948,
         298312,
         238636,
         1427,
         4771,
         769,
         8456,
         281,
         201085,
         281957,
         339692,
         452507,
         395834,
         806
      ],
      "original_title": "My Life",
      "runtime": 114,
      "poster_path": "/ajxovQmbEC5x6rpCqbrzZn7tRbp.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Zucker Brothers Productions",
            "id": 2851,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Capella Films",
            "id": 36859,
            "origin_country": ""
         },
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         }
      ],
      "release_date": "1993-11-12",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "Every moment counts.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Bruce Joel Rubin"],
      "runtime": 117,
      "synopsis": null,
      "writers": ["Bruce Joel Rubin"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0107630/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BODc1NDMwMDE4OF5BMl5BanBnXkFtZTcwOTAzMTkyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Michael Keaton, Nicole Kidman, Bradley Whitford | See full cast and crew »"],
      "reviews": [
         "This film is one which really makes us sit back and evaluate our lives and our relationships with those we love. Michael Keaton turns in a superb performance as the career man who is struck down by terminal cancer while his wife is expecting their first child. The film then charts his efforts to make a video tape, for his unborn child, of his life and then discovers that it is not what it should be. With the help of a spiritual healer (Haing S. Ngor) and his wife (Nicole Kidman) he sets about trying to set things right with his family and his life. Although the ending at the after life is a little bit dreamy after the reality of the film, this is still a superb piece of movie making with winning performances from all the cast and a wonderful script. Definitely not a film to relax to of an evening, it is one of those films, like Philadelphia, that should be watched every now and again just to remind us that life is too short for arguments and should be cherished.",
         "I generally don't enjoy films that deliberately pull on your heart strings, I usually really resent that, in fact. Generally my main criteria in watching a movie is that I must be entertained. However, this powerful, affecting movie really pulled me in. I don't know why I started watching it, the subject matter would normally repel me, but I simply couldn't stop watching because most things in the film were just so believable. Michael Keaton gives an absolutely killer performance as a businessman dying of untreatable cancer. The story is pretty simple-- he basically is on a quest for inner peace, after a holistic healer convinces him he can die happier if he can let go of his anger. The fact is, part of what makes this movie so good is that the baggage Keaton carries around from childhood is nothing earth shattering; in fact it's fairly mundane and similar to what most of us feel. I found myself sobbing, even weeping, for the last half hour of the film-- watch this one alone if you don't want anyone else to see you doing this! Not a fun movie you can watch over and over, but very thought provoking and worth while. I have no idea how Keaton was overlooked for an Oscar nomination in this fine film.",
         "I lost my father as a very small boy.So small,in fact,that I have no recollection of him whatsoever.This fact is what drew me to view this movie,otherwise it would have been overlooked.My father's death was sudden,so he really had no time to prepare in the way that Michael Keaton's character did here.Bob Jones did what he had to do to make sure his newborn son would not grow up without him,and this is what touched my heart about this movie.Also,the scene where a near death Jones limps to his son's room,up to his crib,touching him gently, and explaining to him that \"this whole dying thing wasn't my idea\". This one,short moment,was enough to console me through my lifelong sadness of having to grow up without my own dad.His dying wasn't his idea.From a reviewer's standpoint,this perhaps is not a great film, (the ending was unbelievably sappy),but it will always have a special place in my heart for personal reasons.Those of you with fathers, those of you who have lost fathers,and those of you who are fathers should see this movie.",
         "This is my first time commenting on a movie, but after reading some reactions to this movie, I needed to say something. A few people have suggested that the movie is contrived or false. This is not so. Six days prior to my 16th birthday, my father died of cancer. He had been diagnosed three years prior and had fought it all the way. I have never seen anything as accurate as \"My Life\". No, there is nothing funny about death, but the comedy is true. It was there in my father, and it has been there in others that I have known. The faith healers go nowhere. They rarely do. That is the point. I have seen this movie only once, and I doubt I will ever have the courage to watch it again. If it were anything but accurate, I don't believe it would have had this effect on me. Keaton performed brilliantly, and the reactions around him were all believable. That being said, this movie is only made to draw tears, and does so well.",
         "This is one of those movies that comes along sometimes and knocks you to the floor by absolute surprise. Sad to say, this is the most underrated film I have ever seen. This is the one film that can break you down into tears every time you watch it. It has a really touching theme as well. The theme is of course, make it count, and that is exactly what Bob, Michael Keaton, does. I think the most beautiful part of the film is when Bob notifies his wife at the amusement park that it was his due date for death and that he was living on borrowed time. Living on borrowed time from the prayer he made earlier in the film. This film is one of my all time favorites and is a must-see for strong, hard hitting tear jerkers.",
         "In my personal, yet almost humble opinion, Michael Keaton is the most underrated actor out there. It seems like this man could star in a movie portraying himself and the critics would still claim that he wasn't believable. The first time I ever saw Michael Keaton was in 'Night Shift' and I thought to myself, \"This guy is one of the funniest people on Earth\". He put in terrific performances in 'Beetlejuice' and 'Clean & Sober' in 1988, but yet wasn't even nominated for those roles. MY THEORY: Maybe the judges felt that his portrayal of a recovering alcoholic in 'Clean & Sober' would strike too close to home for many of the recovering alcoholics in the Shrine Auditorium, but that's not my point. From his portrayal of Bruce Wayne/Batman in 1989 (and again in 1992) to his remarkable bad guy in 'Pacific Heights' in 1990, Keaton has continued to amaze me with the range of acting that he has. In November 1993, I saw 'My Life' and I could just feel that he was going to win an Academy Award for it. Come February 1994, the nominations are announced and Keaton isn't even on the list. What the...? I guess cancer wasn't the cool disease that year, since in the end, Tom Hanks won for 'Philadelphia'. Stepping down from my soapbox: 'My Life' is a great film. It's funny, thought provoking and yes, VERY SAD. I love this show and I hope that you check it out when you get a chance because I think you will be pleasantly surprised.",
         "Learning from a Doctor, that you only have months to live, would have to be one of the hardest pills anyone could swallow. Yet in the 1993 drama, \u0091My Life', our hero is facing the end of his life, and doing it in the best way he can. The world we live in today is full of people who are dying from cancer just like Bob Jones, but no movie has showed what a struggle it is. Here is a movie that does not shrug away from any of the underlying issues Bobs has to face, as he is living his final days. We all need to watch this film and cherish what an experience it really is. Meet Bob and Gail Jones, a happily married couple expecting their first child, who are passionately devoted to one another. But tragedy strikes their otherwise untroubled middle-class home when Bob learns he has advanced terminal cancer. Faced with this profound crisis and the realisation that his child may never know him, Bob decides to make a video documenting his life so that his son will have some knowledge of his father. Creating the video proves to be an emotionally and mentally Herculean task, as Bob discovers he is as shallow as the public relations material he produces for a living. Before he can successfully complete the video, Bob has to make peace with himself, reconcile with his estranged parents, and accept what is happening to him is inevitably going to kill him. What a great story for a movie. I like the way we see Bob Jones struggle through the entire movie, as I am sure that is how it is for all cancer victims. The story is also beautifully filmed, with the shots where Bob is making up the video for his son, done exceptionally well. This movie was written and directed by Bruce Joel Rubin, and was his directorial debut. I feel that this story had a part of his own life within it, (his mother, Sondra, was in the film and the film is dedicated to her memory), but in no way did this take away from the viewing experience. In fact, I feel that it enhanced it all the more. The movie stars two wonderful actors in Michael Keaton and Nicole Kidman. They share a very unique bond on this movie as you really believe they are in love. They also show that they are struggling with what ultimately will be the end of their fulfilling marriage. Keaton's performance is one of his best, as I feel he was a great choice to play Bob. I like how we see that Bob is filled with anger towards his family, especially his parents (which would have to be contributing to how sick he is becoming). The scenes we see with Bob's family are great, as they build real tension, and show that Bob's life is not content as it needs to be. Other important characters in \u0091My Life' include the Chinese healer, Mr. Ho (Haing S. Ngor), who tells Bob that he needs to get his life in order, before it is too late. Bob is unsure how to take the healer, accusing him of \u0091doing something'. Mr. Ho is a vital character to the final make-up of the movie. I also have to mention baby \u0091Brian' that Bob and Gail had. The twins, Brian and Andrew Camuccio, were great babies to use in the role of the Jones baby. Considering the point that the movie was at, their happiness helps to balance the sadness that is taking place as Brian's father is close to death. This leads to some of the great scenes in \u0091My life'. As I have said all of the video documentary scenes are great, as they give both the audience and Brian a great insight into the life of Bob Jones. The scenes that show Bob's anger towards his family are great, as we get to see that his life was not and is not what it should be. This is no more apparent than at Bob's brothers wedding reception, where he lets fly with some scathing attacks at his entire family. Yet it is also good to see that Bob has made peace with his family towards the end of the film, as he can finally rest in complete peace. The end of this movie, while it is difficult to watch, was a great and fitting conclusion. Showing Bob near to death and extremely sick, was a game move that I feel worked. I can understand people not liking it, but you have to be prepared to be confronted by this man's death, with death always being confronting in any movie or circumstance. In closing this is a movie I will always return to when I want to get \u0091my life' back into some sort of prospective, as it helps you to make sensible choices about your future. It points out to its audience that we should all appreciate life while living on this earth. If we don't, we run the risk of dying an unfulfilled life. I never had the chance to meet my mum's mum, as she died before I was born. In a way I am glad I did not see her before she died, because she died a most unpleasant death, from smoking related emphysema. So from watching this movie, I can imagine what her last few days on this earth would have been like. I also like the way that baby Brian, keeps Bob's legacy alive, as he is a happy child, just his Dad was before he died. The tagline to this movie is so true, when it comes to the end of human life, \u0091every moment counts'. We all need to do this, as we never know when our last day on this earth could be upon us. CMRS gives \u0091My Life': 4.5 (Very Good \u0096Brilliant Film)",
         "I'm not a very big fan of these kind of movies, but this one stands out. Watching Bob (Michael Keaton) record advices to his son to watch later in life was indeed very touching, and his struggle to make up with his parents... I can recognize his feelings in myself sometimes... Very good and touching movie.",
         "This movie was a great movie. I am a big Michael Keaton fan. I think the casting was great. I think the plot plot was good. The theme is excelent. It's a very very sad story. But it's one you enjoy watching and will probably become an instant favorite. I highly recommend!",
         "Every once in a while, there's a movie that slaps us in the face and tells us to dump the materialism and cherish life. This is one of those movies. Being a person who has lost a family member to Cancer, this movie is intense, very powerful, and some viewers were sobbing so hard they had to leave the theater. It's a movie about family, love and the joy of taking pleasure in the little moments. Definitely a tear-jerker."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Capella Films",
         "Columbia Pictures Corporation",
         "Zucker Brothers Productions"
      ],
      "summaries": [
         "Life is going well for Bob Jones: great job, beautiful loving wife and a baby on the way. Then he finds out that he has kidney cancer that will leave him dead within months. He sets out to videotape his life's acquired wisdom for his child, and ends up on a voyage of self-discovery and reconciliation.",
         "Bob and Gail Jones are expecting their first child, but Bob has been diagnosed with kidney cancer which will possibly take his life before his child is born. Heartbroken at the prospect of not ever getting to know his child, he decides to make a video about himself and his life so that his child will know him.",
         "Bob is dying of cancer. His wife, Gail, is expecting their first child. With a prognosis of only a few months of life left, Bob decides to record just about every aspect of his life on video tape.",
         "A terminally ill man prepares for his death."
      ],
      "budget": 0
   },
   "movielensId": 3502,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1993-11-12",
      "dvdReleaseDate": "2001-04-24",
      "directors": ["Bruce Joel Rubin"],
      "runtime": 114,
      "movieId": 3502,
      "title": "My Life",
      "mpaa": "PG-13",
      "actors": [
         "Michael Keaton",
         "Nicole Kidman",
         "Bradley Whitford",
         "Queen Latifah",
         "Michael Constantine",
         "Richard Schiff",
         "Mark Lowenthal",
         "Haing S. Ngor"
      ],
      "imdbMovieId": "0107630",
      "originalTitle": "My Life",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["uFMQKA9iGK4"],
      "plotSummary": "It seems that Bob Jones has everything a man could want, namely a fulfilling job and a beautiful, pregnant wife, Gail. But Bob's life is turned upside-down when he is diagnosed with cancer and given four months to live -- not even enough time to see his first child's birth. To cleanse himself of demons in his remaining days, Bob makes a video diary, hoping to pass along some wisdom to his future child. Along the way, he discovers a lot about himself.",
      "tmdbMovieId": 41659,
      "avgRating": 3.39109,
      "releaseYear": "1993",
      "numRatings": 606,
      "posterPath": "/ajxovQmbEC5x6rpCqbrzZn7tRbp.jpg"
   }
}