{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "poker",
            "id": 383
         },
         {
            "name": "roommate",
            "id": 1253
         },
         {
            "name": "friendship",
            "id": 6054
         },
         {
            "name": "friends",
            "id": 9713
         },
         {
            "name": "comedy",
            "id": 10267
         },
         {
            "name": "classic",
            "id": 11020
         },
         {
            "name": "new york city",
            "id": 14512
         },
         {
            "name": "apartment",
            "id": 33632
         },
         {
            "name": "neurotic",
            "id": 175357
         },
         {
            "name": "cleanliness freak",
            "id": 238382
         },
         {
            "name": "neat freak",
            "id": 238410
         }
      ],
      "imdb_id": "tt0063374",
      "video": false,
      "title": "The Odd Couple",
      "recommendations": [
         1888,
         990,
         987,
         2075,
         11591,
         27472,
         5506,
         981,
         11787,
         1594,
         20758,
         488,
         6949,
         24807,
         15794,
         93,
         10178,
         41521,
         18331,
         10141
      ],
      "backdrop_path": "/lnwhVAC3wIJgvAfE7xMCwpP2leq.jpg",
      "revenue": 44527234,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Felix Ungar",
               "gender": 2,
               "credit_id": "52fe442f9251416c7502bc15",
               "name": "Jack Lemmon",
               "profile_path": "/chZmNRYMtqkiDlatprGDH4BzGqG.jpg",
               "id": 3151,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Oscar Madison",
               "gender": 2,
               "credit_id": "52fe442f9251416c7502bc19",
               "name": "Walter Matthau",
               "profile_path": "/xJVkvprOnzP5Zdh5y63y8HHniDZ.jpg",
               "id": 6837,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Vinnie",
               "gender": 2,
               "credit_id": "52fe442f9251416c7502bc1d",
               "name": "John Fiedler",
               "profile_path": "/wjhOLcxWaum0JIBIRMZaQQjrhQw.jpg",
               "id": 5247,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Murray",
               "gender": 0,
               "credit_id": "52fe442f9251416c7502bc21",
               "name": "Herb Edelman",
               "profile_path": "/v11kEIY1NpJ6vb7DR5XjttpAJuZ.jpg",
               "id": 14832,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Roy",
               "gender": 0,
               "credit_id": "52fe442f9251416c7502bc3d",
               "name": "David Sheiner",
               "profile_path": "/mSaS01WRTnbxrXO0fxRou7SGw8b.jpg",
               "id": 51348,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Speed",
               "gender": 0,
               "credit_id": "52fe442f9251416c7502bc41",
               "name": "Larry Haines",
               "profile_path": "/hbH6uKK1Gi42T3JnfG9p7FID18q.jpg",
               "id": 178874,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Cecily Pigeon",
               "gender": 1,
               "credit_id": "52fe442f9251416c7502bc45",
               "name": "Monica Evans",
               "profile_path": "/hp8qc9ZB0U3hehc6mseyHVd8j0p.jpg",
               "id": 143770,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Gwendolyn Pigeon",
               "gender": 1,
               "credit_id": "52fe442f9251416c7502bc49",
               "name": "Carole Shelley",
               "profile_path": "/pRoft0VyYrVphGqn0FeA7YFcnSR.jpg",
               "id": 58770,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Waitress",
               "gender": 1,
               "credit_id": "52fe442f9251416c7502bc4d",
               "name": "Iris Adrian",
               "profile_path": "/lLZZYHBg14NJ9aUt7BqeCQri36q.jpg",
               "id": 34509,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe442f9251416c7502bc27",
               "name": "Gene Saks",
               "profile_path": "/svPlh0Jj0yvKJA2Tvqsogci0M85.jpg",
               "id": 69300,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe442f9251416c7502bc2d",
               "name": "Howard W. Koch",
               "profile_path": "/ocnNi4vGIENHuQFzv2ecoLjP9pB.jpg",
               "id": 3428,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe442f9251416c7502bc33",
               "name": "Frank Bracht",
               "profile_path": null,
               "id": 16751,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe442f9251416c7502bc39",
               "name": "Neal Hefti",
               "profile_path": null,
               "id": 16891,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe442f9251416c7502bc53",
               "name": "Neil Simon",
               "profile_path": "/qZ5iSAEcV7hCVYIOrOD4CI2J5Wi.jpg",
               "id": 584535,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "59cff57a925141141e004ac3",
               "name": "Robert B. Hauser",
               "profile_path": null,
               "id": 41411,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "59cff5aa925141142f0047ea",
               "name": "Jack Bear",
               "profile_path": null,
               "id": 22031,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 10.354116,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11356,
      "vote_count": 155,
      "budget": 0,
      "overview": "Felix Ungar has just broken up with his wife. Despondent, he goes to kill himself but is saved by his friend Oscar Madison. With nowhere else to go, Felix is urged by Oscar to move in with him, at least for a while. The only problem is that Felix is neat, tidy, and neurotic, whereas Oscar is slovenly and casual.",
      "similar": [
         862,
         8839,
         397422,
         13523,
         435126,
         1429,
         68718,
         180863,
         28178,
         9382,
         80038,
         121986,
         9576,
         214030,
         9986,
         2882,
         3116,
         18885,
         17887,
         260001
      ],
      "original_title": "The Odd Couple",
      "runtime": 106,
      "poster_path": "/9rK0dPPynwRp9ggYE8iWMQdKtXi.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1968-02-07",
      "vote_average": 7.6,
      "belongs_to_collection": {
         "backdrop_path": "/kY2nJgcvBgjLuAJxygbXYv1el2h.jpg",
         "name": "The Odd Couple Collection",
         "id": 221966,
         "poster_path": "/iSRzUpJBro5vgskqVlCNOvXNxjh.jpg"
      },
      "tagline": "...Say no more.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Gene Saks"],
      "runtime": 105,
      "synopsis": null,
      "writers": [
         "Neil Simon",
         "Neil Simon"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0063374/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYyNDQwOTc5NF5BMl5BanBnXkFtZTYwNjk5OTM5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jack Lemmon, Walter Matthau, John Fiedler | See full cast and crew »"],
      "reviews": [
         "I simply can't get over how brilliant the pairing of Walter Matthau and Jack Lemmon is. It's like the movie doesn't even need additional characters because you can never get tired of the dialog between these two. Lemmon had already been in several well-known films like Mr. Roberts and The Apartment and Matthau was fresh off his Oscar win for The Fortune Cookie (another Billy Wilder film also with Lemmon). That particular movie wasn't as great as this one because the story couldn't sustain such a long running time (I think it was almost 2 hours). However, this goes by at a brisk hour and a half, even though the introduction of the events leading up to Lemmon ending up at Matthau's apartment is a tad long (so was this sentence). That's a minor quibble though and for the rest of the running time you have a marvelous time. I have already written a comment about how the follow-up to this film sucked and I won't go deeper into that. The reason why this is such a joy is probably that the movie was made just as the innocence of American movies was beginning to fade fast into oblivion. There are some sexual references but they are dealt with in such an innocent way that you couldn't even get a \"Well, I never...\" out of the most prudish person out there. It is kind of fun to see a movie from a long lost era and that was probably why the sequel didn't work because you had Matthau and Lemmon say quite a few f-words and that just doesn't fit them. Of course, now they are both gone and you can just be happy that you still can enjoy them in a marvelous film like this. I think the only male actor in this film who is still alive is John Fiedler. Edelman died recently. So there you have it. Simply one of the best comedies and films ever. Add: I have just learned recently that John Fiedler has died so to all the fans of him I am deeply sorry. I didn't mean any disrespect and I will try to be more careful of what I am blah blah blahing next time.",
         "Buddy comedies always come down to two things: actors and their scripts. \"The Odd Couple\" works because it has two endearing characters and an often hilarious and always down-to-earth script, making it one of the best odd couple films of all time -- inspiring but not surpassing movies that share its genre, such as John Hughes' \"Planes, Trains and Automobiles\" (1987) and Martin Brest's \"Midnight Run\" (1988). And, in some ways, even Barry Levinson's \"Rain Man\" (1988), a more dramatic buddy comedy that nevertheless takes a lot of pointers from this one. Plots always help buddy comedies, of course, but it really depends on whether the two actors -- when confined to a solitary confinement -- can interact and make the audience laugh. Jack Lemmon and Walter Matthau, two legendary screen comedians, can do just that. Their comedic chemistry in this film has often been mimicked by other rip-offs, such as \"Grumpy Old Men.\" But this remains their ultimate combined-effort comedy. This is the type of movie that is often referenced as the pinnacle buddy movie. Sure, it may not be the best, but it did inspire the entire odd couple genre, and I would definitely place it in the top five buddy comedies list if I ever made such a thing. Felix (Jack Lemmon) has just been left by his wife, and so he goes to live with long-time poker pal Oscar (Walter Matthau), a grumpy and filthy slob who is the exact opposite of Felix, an uptight orderly man with a fetish for cleaning. In fact, he does just that in Oscar's apartment, which drives Oscar to the point of ultimate frustration. If these guys can't get along much longer, they'll just have to move along and forget their friendship. But things don't always turn out the way they appear. Neil Simon's \"The Odd Couple\" is full of inspired lunacy. It has some truly hilarious moments with great gags and interaction between its two lead stars, whose screen chemistry is undeniable -- there's a reason Hollywood paired Lemmon and Matthau together an uncountable number of times. The film is lacking the humanity and sorrow of its characters that shines through in \"Planes, Trains and Automobiles\"; there are few -- if any -- moments where the characters become so frustrated with each other that they blow up and then realize that they're not exactly how they thought. Remember the scene in the motel when Neal Page (Steve Martin) lashed out against Del Griffith (John Candy)? But after the comedy tirade ended, and as we laughed, the film took an unexpected turn when it revealed the Del character's utter hurt inside. Then we stopped laughing and we started crying. That's lacking in \"The Odd Couple,\" making it inferior to Hughes' comedy masterpiece, but it's a clever little film that inspired it all. Perhaps the best gag in the entire movie is one that was quite controversial at the time: Oscar finds a note next to his bed from Felix that says they're out of cereal, and the last two letters of the note are, \"F U.\" Of course, the two letters \"F U\" are Felix Ungar's initials, but as Oscar implies, just imagine what he thought it meant when he first read the note. I love comedies where you lock down a small number of people -- preferably a pair of opposites -- in a room and let their characters take over. I like when the dialogue is rich and funny and so very real. I guess I just like subtle character comedies -- overblown special effects comedies aren't always favorites of mine. \"Dumb and Dumber\" is one of my favorite buddy comedies, and it's not because it's crude or silly but because I like the pairing of its two stars, Jim Carrey and Jeff Daniels, and I like the situations they get into. \"The Odd Couple\" (based on the stage play by Simon) is the odd comedy that puts a smile on your face and delights the viewer. It's a fun movie, a great comedy, one of the finest and arguably the most acknowledged buddy film of all time. I saw it years ago and I've been laughing ever since. And despite its inferiority to some of the other buddy films that followed in its path, \"The Odd Couple\" is a delightful character comedy that will inspire similar comedies for years to come. Lord knows it already has. 5/5.",
         "This cordial comedy confronts a few bizarre characters. Especially, of course, the two leading characters. Jack Lemmon plays Felix, a hypochondriac whose wife lost him because she couldn't stand his cleaning and cooking attacks any longer. So he tries to kill himself but every attempt fails. Walter Matthau plays Oscar, his friend, an untidy, unreliable sports-reporter who lives in divorce from his ex-wife in a bachelor apartment. He offers his distressed friend Felix a new home in his apartment. And soon the trouble begins because two such contrary characters can't live together for a long time. Felix turns Oscar's disorderly flat into a clean exhibition flat. He cleans and cooks the whole time. After a short while, Oscar feels persecution mania ... Filmed in a theatrical way and excellent acted. Above all, Jack Lemmon's play is wonderful. He is the perfect clown. He makes us laugh but in a tragi-comic way. Look for the wonderful scene when both men invite their two female neighbours for supper, because Oscar has to touch something more softer than a bowling-ball. While he is preparing the drinks, Felix sits with the two young ladies in the living-room. To get out of this embarrassing situation, he starts to talk about the weather. A minute later, he changes the subject and talks about his ex-wife and children. Suddenly he begins to weep and when Oscar comes back with the drinks, there are three weeping people in the living-room. The film is full of such amusing and at the same time touching scenes. An intelligent, entertaining comedy with much heart. 10 out of 10!",
         "SPOILERS In the words of Jean-Paul Sartre, \"Hell is other people\". In \"The Odd Couple\", Jack Lemmon and Walter Matthau demonstrate just how accurate this can be. As Felix Ungar and Oscar Madison, Lemmon and Matthau respectively create two good friends who decide to live together. As the two begin to slowly grow more and more frustrated with each other, the laughs come thick and fast, before Felix departs, leaving Oscar a changed and more cleanly individual. Jack Lemmon as Ungar is absolutely superb as the neurotic, cleaning obsessed divorcee coping with life as a single man. Walter Matthau in contrast to Lemmon's character is equally as good as the slobbish sports writer who simply wants to play poker to earn money for his child benefits. Lemmon and Matthau are magnificant in their selected parts, to some degree dependent upon the beautiful script by Neil Simon, and simultaneously because they work well as a team. As two friends who are inherently different in lifestyles, although similar in relationships with ex-wives and children, these two, late, great actors create a partnership which is practically impossible to recreate. So great in fact, that the world screamed out so much for something similar, that two years before Matthau's death and three before Lemmon's, the characters were reunited in an inferior sequel. This idea, whilst following Hollywood's irritating obsession with sequels, might have worked to a certain degree, but at the same time, it could never come close to replicating the genius of this original film. Ultimately it's not really possible to say anything else. With Simon's amazing script, filled with humour and laughter, the creators of this film were already onto a hit. The casting of Jack Lemmon and Walter Matthau as Felix Ungar and Oscar Madison though, is the most important part of this film. \"The Odd Couple\", with it's traditional soundtrack (which even gained a tribute in \"The Simpsons\"), it's excellent script and it's genius leading men, is a tribute to cinema and a feature for history to remember.",
         "I have seen this film many times and I like all bad teachers want to give it ten out of ten but feel that it would be unfair to other good films. However, I do think that this is one of those rare gems: a perfect comedy. It is I would venture one of the greatest comic films of all times. Matthau and Lemmon are perfectly matched and mismatched. The script is so sharp that you need to staunch the bleeding. The story is well known and has already been described in other comments. The two leads give extraordinary performances, the girls are superb and the situations are side-splittingly funny. Not one swear-word in sight (mark that Hollywood, you don't have to swear to be funny, you have to be witty) and the move from stage to film is seamless. They don't make'em like this any more. Timeless.",
         "\"The Odd Couple\" is one of those movies that far surpasses its reputation. People all know it, they hum the theme song, they complain of living with a sloppy \"Oscar\" or a fastidious \"Felix\"...but they're under-selling the film without knowing it. This isn't just about a neat guy living with a sloppy guy; it's a portrait of two friends helping each other through the agony of divorce. It's also damn funny from start to finish, but it's the kind of comedy that arises from realistic, stressful, and just plain awful situations. So, some viewers have actually found the film to be a bit uncomfortable, but I think its verisimilitude is its strength. Besides, Matthau's bulldog face just cracks me up! My favorite comedy, by a country mile.",
         "A man ( Jack Lemmon ) intending to commit suicide books into a seedy hotel room. His name is Felix Ungar. After straining his back trying to open a window, he goes to a strip club, and from there on to the apartment of his friend Oscar Madison ( Walter Matthau ). A poker game is in session. Oscar and his friends have heard that Felix's wife Frances threw him out, and try to prevent him from doing away with himself. Felix moves in and the two men - who are of diametrically opposed personalities - drive each other nuts. Oscar is one of Nature's slobs, while Felix is tidy to the point of obsession. He is also a hypochondriac, forever complaining of sinus trouble. They are bound to drive one another mad in the end, and do... Based on the stage play by Neil Simon, 'The Odd Couple' has not been opened out much for the big screen, and that's one of its strengths. Walter Matthau and Jack Lemmon are brilliant as Oscar and Felix, and the supporting cast are wonderful, particularly John Fielder as 'Vinnie'. Cute Monica Evans and Carole Shelley giggle their way through the film as 'Cecily and 'Gwendolyn' - the cuckoo 'Pigeon' sisters who live upstairs, and whom Felix later moves in with ( lucky guy ). Even now after all these years, certain moments can reduce me to tears of laughter - Felix interrupting Oscar in the middle of a ball game with a dinner request, Oscar cracking up and chasing Felix around the apartment, the Pigeon Sisters brought low by Felix's sob stories, and of course, the legendary cafeteria scene ( later ripped off by Nora Ephron's 'When Harry Met Sally' ). Razor-sharp dialogue too. When the boys think Felix has taken an overdose, Oscar says: \"They could be vitamins! He could be the healthiest one in the room!\". Neal Hefti's theme will be going round in her head for days after you see this. Later spun off into a long-running television series starring Tony Randall as 'Felix' and Jack Klugman as 'Oscar', with Evans and Shelley reprising their movie roles. In 1998, 'The Odd Couple 2' appeared. It had its moments but could not compete with the original.",
         "The Odd Couple is a comic gem. One the funniest script ever committed to celluloid - exceeded only by Strangelove, Spinal Tap and Lebowski! Lemmon and Matthau are best friends: obsessive compulsive Felix and sloppy, irresponsible Oscar. Oscar's wife has already left him because he is impossible to live with due to his irresponsible attitude. Felix's wife leaves him at the start of the movie, and after an aborted suicide attempt he moves in with poker buddy Oscar. Thats when the fun begins. The entire script is brilliant and filled with brilliant one-liners. You are probably already familiar with the \"F.U.\" joke but it still works brilliantly due to Matthau's comic timing. My favorite moments are when Lemmon tries to clear his sinus in the diner and when the Pigeon sisters are being charmed by a very suave Matthau and Lemmon is totally out of his element. This one requires repeat viewings!",
         "Simon's best comedy is superbly crafted by director Gene Saks and given life by the immense talents of Lemmon and Matthau. No one delivers these lines better. No one times them better. Nobody does it better.",
         "Often laugh out loud, sometimes sad story of 2 working divorced guys -- Lemmon a neurotic clean \"house husband\" and Matthau a slob sportswriter -- who decide to live together to cut down on expenses. Nicely photographed and directed. The script is very barbed -- that is, there's always more than one side to almost every line. Particularly funny scene involves 2 british sisters (Evans and Shelley) who seem amused by everything anyone says, but when Lemmon busts out his photos of kids and, yes, ex-wife-to-be, he has the girls sobbing along with him before Matthau can show up with the promised drinks! Very entertaining."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": ["Paramount Pictures"],
      "summaries": [
         "Felix Ungar has just broken up with his wife. Despondent, he goes to kill himself but is saved by his friend Oscar Madison. With nowhere else to go, Felix is urged by Oscar to move in with him, at least for a while. The only problem is that Felix is neat, tidy, and neurotic, whereas Oscar is slovenly and casual.",
         "Two friends try sharing an apartment, but their ideas of housekeeping and lifestyles are as different as night and day."
      ],
      "budget": 0
   },
   "movielensId": 3507,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1968-02-07",
      "dvdReleaseDate": "2000-12-12",
      "directors": ["Gene Saks"],
      "runtime": 106,
      "movieId": 3507,
      "title": "The Odd Couple",
      "mpaa": "G",
      "actors": [
         "Jack Lemmon",
         "Walter Matthau",
         "John Fiedler",
         "Herb Edelman",
         "David Sheiner",
         "Larry Haines",
         "Monica Evans",
         "Carole Shelley",
         "Iris Adrian"
      ],
      "imdbMovieId": "0063374",
      "originalTitle": "The Odd Couple",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["A58OtN9h918"],
      "plotSummary": "Felix Ungar has just broken up with his wife. Despondent, he goes to kill himself but is saved by his friend Oscar Madison. With nowhere else to go, Felix is urged by Oscar to move in with him, at least for a while. The only problem is that Felix is neat, tidy, and neurotic, whereas Oscar is slovenly and casual.",
      "tmdbMovieId": 11356,
      "avgRating": 3.89848,
      "releaseYear": "1968",
      "numRatings": 3428,
      "posterPath": "/9rK0dPPynwRp9ggYE8iWMQdKtXi.jpg"
   }
}