{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "loss of loved one",
            "id": 697
         },
         {
            "name": "daughter",
            "id": 5600
         },
         {
            "name": "friendship",
            "id": 6054
         },
         {
            "name": "mute",
            "id": 10392
         },
         {
            "name": "housekeeper",
            "id": 17997
         },
         {
            "name": "xenophobia",
            "id": 160910
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0109484",
      "video": false,
      "title": "Corrina, Corrina",
      "recommendations": [
         12121,
         20096,
         35645,
         42580,
         11894,
         11157,
         49478,
         47608,
         41582,
         21352,
         17894,
         2928,
         9079,
         4587,
         2925,
         3587,
         11630,
         47939,
         26255,
         12280
      ],
      "backdrop_path": "/vnzRNZ0bruLZEtxtSOaFvWNssxF.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Corrina Washington",
               "gender": 1,
               "credit_id": "52fe43759251416c750111db",
               "name": "Whoopi Goldberg",
               "profile_path": "/n3lF8w4X4rDa4J2LMDIxMEcuUeH.jpg",
               "id": 2395,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Manny Singer",
               "gender": 2,
               "credit_id": "52fe43759251416c750111df",
               "name": "Ray Liotta",
               "profile_path": "/o4jJSH3sri9dSIJwsCgT4de1535.jpg",
               "id": 11477,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Molly Singer",
               "gender": 1,
               "credit_id": "52fe43759251416c750111e3",
               "name": "Tina Majorino",
               "profile_path": "/kGzCUaPddOm84cRlExLKOvZEoqP.jpg",
               "id": 53930,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Jonesy",
               "gender": 1,
               "credit_id": "52fe43759251416c750111e7",
               "name": "Joan Cusack",
               "profile_path": "/3jcrXcFYoSKEUvokzqrQ2UJGtw.jpg",
               "id": 3234,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Sid",
               "gender": 2,
               "credit_id": "52fe43759251416c750111eb",
               "name": "Larry Miller",
               "profile_path": "/xA8zCxNrwtamLaLWNBkLyX5tGtU.jpg",
               "id": 1211,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Brent Witherspoon",
               "gender": 2,
               "credit_id": "52fe43759251416c7501122b",
               "name": "Brent Spiner",
               "profile_path": "/gYaOWwycKcSEPQzUOITt9DA5AcY.jpg",
               "id": 1213786,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Bratty Boy",
               "gender": 2,
               "credit_id": "595d172d92514121f0058301",
               "name": "Tommy Bertelsen",
               "profile_path": "/vSlRndjzrZhicsVsWqlmckwDlYv.jpg",
               "id": 1063614,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe43759251416c750111f1",
               "name": "Jessie Nelson",
               "profile_path": "/u63xiwuHHpp0gcwMAOfSg9Jwr7G.jpg",
               "id": 16853,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe43759251416c750111f7",
               "name": "Jessie Nelson",
               "profile_path": "/u63xiwuHHpp0gcwMAOfSg9Jwr7G.jpg",
               "id": 16853,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe43759251416c750111fd",
               "name": "Bernie Goldmann",
               "profile_path": null,
               "id": 65377,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe43759251416c75011203",
               "name": "Paula Mazur",
               "profile_path": null,
               "id": 65378,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe43759251416c75011209",
               "name": "Jessie Nelson",
               "profile_path": "/u63xiwuHHpp0gcwMAOfSg9Jwr7G.jpg",
               "id": 16853,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43759251416c7501120f",
               "name": "Steve Tisch",
               "profile_path": null,
               "id": 29,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43759251416c75011215",
               "name": "Ruth Vitale",
               "profile_path": null,
               "id": 65379,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43759251416c7501121b",
               "name": "Rick Cox",
               "profile_path": null,
               "id": 65380,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43759251416c75011221",
               "name": "Bruce Surtees",
               "profile_path": "/dJsO0sdSi2tM4ZTKVdZrvufiAuO.jpg",
               "id": 792,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43759251416c75011227",
               "name": "Lee Percy",
               "profile_path": null,
               "id": 2866,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 5.425759,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10464,
      "vote_count": 117,
      "budget": 0,
      "overview": "When Manny Singer's wife dies, his young daughter Molly becomes mute and withdrawn. To help cope with looking after Molly, he hires sassy housekeeper Corrina Washington, who coaxes Molly out of her shell and shows father and daughter a whole new way of life. Manny and Corrina's friendship delights Molly and enrages the other townspeople.",
      "similar": [
         858,
         634,
         10054,
         376660,
         334,
         112,
         11631,
         40807,
         49519,
         112160,
         13,
         88,
         425,
         137106,
         142,
         773,
         2288,
         4347,
         11012,
         244264
      ],
      "original_title": "Corrina, Corrina",
      "runtime": 115,
      "poster_path": "/lUmJNC3RAW0OxAtDP8CDEld9pFq.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [{
         "logo_path": "/iaYpEp3LQmb8AfAtmTvpqd4149c.png",
         "name": "New Line Cinema",
         "id": 12,
         "origin_country": "US"
      }],
      "release_date": "1994-08-12",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jessie Nelson"],
      "runtime": 115,
      "synopsis": null,
      "writers": ["Jessie Nelson"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0109484/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI2MTM0MjE1Nl5BMl5BanBnXkFtZTcwOTcwMzEyMQ@@._V1_SY317_CR11,0,214,317_AL_.jpg",
      "actors": ["Stars: Ray Liotta, Whoopi Goldberg, Tina Majorino | See full cast and crew »"],
      "reviews": [
         "Although I had heard of this film title for quite a while, I never felt inclined to see it as I wasn't a particular fan of any of its cast. However, having asked friends for recommendations for a wholesome film to watch, Corrina, Corrina was suggested, so I decided to give it a go. And how pleased I am that I did! Bearing in mind the subject matter, this movie could have been one of those tearjerkers that leaves you feeling absolutely drained and depressed but I found it uplifting with just the right amounts of levity, tragedy and romance. I am fan of the Fifties music and fashion and this made me feel as though I was transported back to that era. I had a whole rush of emotions watching this, most of which were positive. There are touches in this film which make me feel warm inside - the whole movie radiates warmth. Both Whoopie Goldberg and Ray Liotta (I didn't think he ever played such roles) were great, but the revelation for me was little Tina Majorino! So believable - her laughter so infectious! I've watched this film time and time again and never tire of it! I love it! A very pleasant surprise indeed!",
         "Whoppie Goldberg excels in this thoroughly entertaining film. Ably supported by Ray Liotta, this duo clicks nicely in a surprisingly believable romantic comedy/drama. Jessie Nelson's script reflects on a somewhat forgotten, yet thoroughly accurate, 50's neighborhood setting which existed in many parts of the country -- an environment generally overlooked by film subjects. There's a nice lilt to the story, a surprising warmth projected to character portrayals, and an ingratiating blend of humor and drama. All in all, a very pleasant, relaxing family film, nicely directed by Nelson, and with an intelligent and sensitive performance by Goldberg.",
         "Corrina, Corrina Manny Singer (Ray Liotta) is a struggling songwriter for a company that makes television commercials, who also has a loving wife and a daughter, Molly (Tina Majorino). When his wife dies, Manny's whole life falls apart, his daughter stops speaking, and he develops a creative block on his jingle-writing skills that threatens to get him fired. To solve one of these problems, he starts looking for a nanny for Molly, reluctantly settling on Corrina Washington (Whoopi Goldberg), a woman who has recently moved into town to stay with her sister, and who also happens to be black. Though far from the most efficient housekeeper in the town, Corrina clicks instantly with Molly, who eventually starts to speak again. Manny also takes a shine to Corrina, and a friendship soon forms between the two widows, but they can't seem to agree on what is best for Molly. As easy as it may be to classify 'Corrina, Corrina' as a fifties-set drama, I'm inclined to resist this temptation, for two main reasons. Firstly, aside from the underlying comments about race, the fifties setting is used only as a backdrop, with the focus on a very heartfelt dramedy, which leads me to my second point. 'Corrina, Corrina' is certainly moving, and there are times when you may feel the need to reach for a box of tissues. But it's also quite hilarious as well, and writer/director Jessie Nelson finds a fine balance between the dramatic and comedic beats to make a remarkable motion picture. Liotta, Goldberg and Majorino give wonderful performances, and these really do feel like real characters. A real winner. ~ 8/10 ~",
         "A captivating drama / comedy that casts Ray Liotta as 'Manny Singer', a man who recently lost his wife and has his daughter Molly (Tina Majorino) to take care of, who was too sad and heartbroken to talk to anyone after her mother's death. As Manny tries to find a suitable 'nurse maid' for Molly so he can go back to work, Corrina Washington (in the form of Whoopi Goldberg) comes into the picture and eventually gets hired by Manny to take care of the little girl. The funny thing is, what the Singers weren't expecting was for Corrina to bring magic back into their lives. An endearing little treasure, 'Corrina, Corrina' is a motion picture filled with heart and laughter, that's sure to send your spirits soaring. Wendy Crewson is great in her supporting role as the not-so-nice and aggressive 'Jenny Davis'. Goldberg is absolutely terrific in the title role. A highly-recommended motion picture. Rating: Three 1/2 out of Five Stars (Very Good).",
         "This movie was great and Tina Majorino did a beyond excellent job as Molly, the little girl who lost her mother and is coping with it by becoming mute and withdrawn. Whoopi Goldberg did wonderful as the nanny and girlfriend of the little girl's father. The little girl and nanny form a bond that noone would've thought, especially in the 1950's. I loved it!! Be ready to pull out the box of Kleenex for this one!! I know I did!!",
         "I loved this movie. The acting was excellent, especially the three main stars, Whoopie, Ray and Tina, but the subject matter was handled well too. I think this movie shows that love has no color or financial restraints - it's about compassion, understanding, honesty, and companionship. I, too, have watched it again and again and still love it as much as the first time. And yes, Ray Liotta can act in just about any type of picture. I first saw Ray on soaps way back when and he has developed into one of my favorite actors. If he's in a picture, I want to see what he does with the role. Much like Don Cheadle. Massive talents that go largely unnoticed. And Ray's parents in the movie were excellent as well. It's just such a charming picture with strong, understated performances. I can't recommend it highly enough.",
         "This is a wonderful film with wonderful Christian values. Whoopie Goldberg plays a good woman who is sent to help a family deal with the horrible reality of death. She not only brings love back into the household, but also magic. This is a great movie for all ages. My kids loved it. They wanted to watch it again and again. Enjoy!",
         "My wife Rebecca is a fan of Ray Liotta so when this movie appeared on cable TV it had to be viewed. And what a surprise! The rapport between Ray and Whoopi Goldberg was very noticable. I don't know if it is so but there seemed to be a considerable amount of ad lib-ing. Some of the things that happened on screen could not have been scripted or the director's instructions. And the rapport between Whoopi and Molly (Tina Majorino later to be seen in \"Waterworld\") was just as impressive. But the theme of two minority groups (Jewish and Negro) coming together in the way they did was done in absolutely good taste and a delight to any liberal thinking viewers. It could have become a weepie but, for sure, I'm glad it didn't. I can't wait to see it again.",
         "This is a very endearing and heartwarming movie, I readily feel that it captures the delicate issue of mixed race relations during the 1950's with the right amount of poignancy and humor. Whoopi Goldberg is a delight and the whole cast works very well together. The film's setting had an added impact to me as it was filmed in my old neighborhood in Long Beach, California where i grew up and even though i grew up in the seventies i could easily identify with the events and characters. I fully recommend this as a film for the whole family.",
         "Thoughtful family movie. Makes you aware of how and why we like people.... for who they are, the total person, rather than exterior physicality. How and why we care for someone is the result of trust and liking that person. And having that person in your life, completes who you want to be."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["New Line Cinema"],
      "summaries": ["When Manny Singer's wife dies, his young daughter Molly becomes mute and withdrawn. To help cope with looking after Molly, he hires sassy housekeeper Corrina Washington, who coaxes Molly out of her shell and shows father and daughter a whole new way of life. Manny and Corrina's friendship delights Molly and enrages the other townspeople."],
      "budget": 0
   },
   "movielensId": 351,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1994-08-12",
      "dvdReleaseDate": "1999-12-21",
      "directors": ["Jessie Nelson"],
      "runtime": 115,
      "movieId": 351,
      "title": "Corrina, Corrina",
      "mpaa": "",
      "actors": [
         "Whoopi Goldberg",
         "Ray Liotta",
         "Tina Majorino",
         "Joan Cusack",
         "Larry Miller",
         "Brent Spiner",
         "Tommy Bertelsen"
      ],
      "imdbMovieId": "0109484",
      "originalTitle": "Corrina, Corrina",
      "genres": [
         "Comedy",
         "Drama",
         "Family",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "When Manny Singer's wife dies, his young daughter Molly becomes mute and withdrawn. To help cope with looking after Molly, he hires sassy housekeeper Corrina Washington, who coaxes Molly out of her shell and shows father and daughter a whole new way of life. Manny and Corrina's friendship delights Molly and enrages the other townspeople.",
      "tmdbMovieId": 10464,
      "avgRating": 3.30548,
      "releaseYear": "1994",
      "numRatings": 3889,
      "posterPath": "/lUmJNC3RAW0OxAtDP8CDEld9pFq.jpg"
   }
}