{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "transplantation",
            "id": 741
         },
         {
            "name": "love of one's life",
            "id": 2038
         },
         {
            "name": "veterinarian",
            "id": 2735
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0122459",
      "video": false,
      "title": "Return to Me",
      "recommendations": [
         35645,
         42580,
         21349,
         11777,
         14758,
         9685,
         83330,
         10631,
         15592,
         23570,
         15148,
         20551,
         19176,
         9263,
         16297,
         11860,
         17439,
         8986,
         16384,
         8866
      ],
      "backdrop_path": "/kAtj97FUf0gOAYGPbNd05jVihRI.jpg",
      "revenue": 36609995,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Bob Rueland",
               "gender": 2,
               "credit_id": "52fe4360c3a36847f804fb9d",
               "name": "David Duchovny",
               "profile_path": "/tvgkGpKXMz7SzjUkTwZ0FMjQxlO.jpg",
               "id": 12640,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Grace Briggs",
               "gender": 1,
               "credit_id": "52fe4360c3a36847f804fba1",
               "name": "Minnie Driver",
               "profile_path": "/iWqTeFmdoY8V8RLcH89K75AKeQN.jpg",
               "id": 6613,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Marty O'Reilly",
               "gender": 2,
               "credit_id": "52fe4360c3a36847f804fba5",
               "name": "Carroll O'Connor",
               "profile_path": "/odTJd5NX5wJ2kTn2wavsypuwmZq.jpg",
               "id": 26512,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Angelo Pardipillo",
               "gender": 2,
               "credit_id": "52fe4360c3a36847f804fba9",
               "name": "Robert Loggia",
               "profile_path": "/7xtU12KT12xjy4UY1O6VKpw7FLx.jpg",
               "id": 1162,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Joe Dayton",
               "gender": 2,
               "credit_id": "52fe4360c3a36847f804fbad",
               "name": "Jim Belushi",
               "profile_path": "/AplV1ikSo3Zn93hhy5ht7Y7sQio.jpg",
               "id": 26485,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Megan Dayton",
               "gender": 1,
               "credit_id": "52fe4360c3a36847f804fbb1",
               "name": "Bonnie Hunt",
               "profile_path": "/7spiVQwmr8siw5QCcvvdRG3c7Lf.jpg",
               "id": 5149,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Charlie Johnson",
               "gender": 2,
               "credit_id": "561cfae7c3a3682256003e28",
               "name": "David Alan Grier",
               "profile_path": "/5tkt3qRZTco4sz604aTIarQ0m8W.jpg",
               "id": 58563,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Elizabeth Rueland",
               "gender": 1,
               "credit_id": "561cfaf69251415a6b003791",
               "name": "Joely Richardson",
               "profile_path": "/fgjpKio6sMD5AxOWQwAdgJQErhm.jpg",
               "id": 20810,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Emmett McFadden",
               "gender": 2,
               "credit_id": "561cfb03c3a3682251004016",
               "name": "Eddie Jones",
               "profile_path": "/g8ZDq6LFNWc12w24oo0r0FfeiIg.jpg",
               "id": 8692,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Sophie",
               "gender": 1,
               "credit_id": "561cfb2292514177d70000fd",
               "name": "Marianne Muellerleile",
               "profile_path": "/5Qex2uBzsjqSRUFeeW4sT7FhuYH.jpg",
               "id": 543,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Wally Jatczak",
               "gender": 2,
               "credit_id": "561cfb30c3a3682261003916",
               "name": "William Bronder",
               "profile_path": null,
               "id": 3043,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Mike",
               "gender": 2,
               "credit_id": "561cfb3d9251415a6b0037a7",
               "name": "Brian Howe",
               "profile_path": "/bIyWNR7ZRKE7e8OZCwv6orqzrpu.jpg",
               "id": 1990,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Adam Dayton",
               "gender": 0,
               "credit_id": "561cfb5d9251415a720038eb",
               "name": "Adam Tanguay",
               "profile_path": null,
               "id": 1522156,
               "order": 13
            },
            {
               "cast_id": 19,
               "character": "Karson Dayton",
               "gender": 0,
               "credit_id": "561cfb6cc3a3682256003e37",
               "name": "Karson Pound",
               "profile_path": null,
               "id": 1522157,
               "order": 14
            },
            {
               "cast_id": 20,
               "character": "Jeff",
               "gender": 2,
               "credit_id": "56e7894fc3a368409400120e",
               "name": "Chris Barnes",
               "profile_path": "/dohfBZZwv2A6PQ75zJfvWAxXwAT.jpg",
               "id": 1591219,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe4360c3a36847f804fb93",
               "name": "Bonnie Hunt",
               "profile_path": "/7spiVQwmr8siw5QCcvvdRG3c7Lf.jpg",
               "id": 5149,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe4360c3a36847f804fb99",
               "name": "Bonnie Hunt",
               "profile_path": "/7spiVQwmr8siw5QCcvvdRG3c7Lf.jpg",
               "id": 5149,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4360c3a36847f804fbb7",
               "name": "László Kovács",
               "profile_path": "/qvsRxyAPJw9Kv8ubV2AKWLiUcz8.jpg",
               "id": 8862,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4360c3a36847f804fbbd",
               "name": "Don Lake",
               "profile_path": "/zwm0HhAhxay84Co22rSkHwhJPBG.jpg",
               "id": 27530,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 11.0647,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 2621,
      "vote_count": 85,
      "budget": 24000000,
      "overview": "It took a lot of cajoling to get Bob (Duchovny), a recently widowed architect, to go on a blind date at a quirky Irish-Italian eatery. Once there, he's smitten instantly not with his date but with the sharp-witted waitress, Grace (Driver). Everything seems to be going great until an unbelievable truth is revealed, one that could easily break both of their hearts for good.",
      "similar": [
         858,
         258480,
         2255,
         587,
         112160,
         141,
         634,
         401898,
         437557,
         244772,
         242224,
         1919,
         5123,
         370663,
         43923,
         1635,
         297762,
         27586,
         1360,
         8967
      ],
      "original_title": "Return to Me",
      "runtime": 115,
      "poster_path": "/3HvUbZLA9laGje1IFq4Lvj5mqWZ.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "JLT Productions",
            "id": 65402,
            "origin_country": ""
         },
         {
            "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
            "name": "Metro-Goldwyn-Mayer",
            "id": 21,
            "origin_country": "US"
         }
      ],
      "release_date": "2000-04-07",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "A comedy straight from the heart",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Bonnie Hunt"],
      "runtime": 115,
      "synopsis": "Bob Rueland (David Duchovny) and his wife Elizabeth (Joely Richardson) are deeply in love. She is a dedicated animal psychologist specializing in great apes, who has for 16 years worked with a gorilla at the Chicago zoo. Bob is a builder, and he is very committed to a project to build a wonderful new gorilla exclosure at the zoo, to his wife's design. Grace Briggs (Minnie Driver) is an orphan who has been brought up by her devoted grandfather Marty O'Reilly (Carroll O'Connor) who is proprietor of an Italian restaurant, the chef being Marty's dear friend Angelo Pardipillo (Robert Loggia). Grace's great friend is Megan Dayton (Bonnie Hunt), married to the chauvisnistic but clumsily chivalrous Joe (James Belushi). Grace has a weak heart, caused by incurable disease, and needs a transplant. One night, after a gala with guest in evening dress, Elizabeth is fatally injured and dies in the hospital. She's a donor and her heart is transplanted into Grace. Bob is devastated and so is Elizabeth's dog Mel, which pines for her in their apartment hallway for months. During this time Grace gradually recovers from surgery with her new heart, and after much thought writes a letter to the donor family of her heart, for forwarding by the donor/transplant agency as the arrangement is anonymous. Grace creates a garden full of varied flowers, in Marty's back hard in the city; and she paints pictures, of the city scene around her but also of scenes of an Italian city, though she has never been abroad. She gets around the city on her bicycle, and often visits Megan. They go with Megan's children to the zoo, and --- mysteriously, because he doesn't do it for anybody else --- the gorilla comes over and gives Grace a \"high-five\" with his hand on the divider through which visitors look at him. Grace even passes close to Bob in the crowd around the existing gorilla enclosure, and he seems to experience some frisson as though he can feel Elizabeth's heart still beating but now inside Grace. At last, after a year or so, one of Bob's best friends Charlie Johnson (David Alan Grier) persuades him to come out on a foursome date. Charlie is a veterinary expert at the zoo, involved with the care of the gorilla. On top of all his other projects (on which he is always the man in charge of the whole operation), Bob has been working intensively on the new gorilla enclosure and has been seeing a lot of Charlie, who also knew Elizabeth very well but has grown increasingly concerned about Bob's state of mind since her death. The place they pick for the four-way date, about which Bob is still doubtful, is O'Reilly's Italian restaurant. Bob turns up late and is dismayed by the fussy, bossy personality of the woman who is his blind date; however he is rather taken with Grace, who comes to take their order. He even asks her whether they have met somewhere. Bob finally contrives a mobile phone call and claims he must rush back to work on one of his projects which has hit a crisis needing him on site immediately although it's late. Grace gives him a dinner to take away, and he escapes to eat it on his own. He leaves his mobile phone on the counter and only realizes the next day that he has mislaid it. He goes back the next night after hours, and is greeted by Mary, Angelo and their two elderly friends, one of whom is the apple in the eye of O'Reilly's other waitress, the amply proportioned Sophie (Marianne Muellerleile). These four repeatedly debate the relative merits of Sammy Davis, Dean Martin, Bing Crosby and Frank Sinatra, and play cards. Grace has gone to bed and is unaware that Bob has arrived in the now closed restaurant. She goes downstairs in her dressing gown and shower cap, and is horrified to find Bob there seeing her en deshabille. However Bob is undisturbed and, as he helps her cover the flowers in her precious garden against an expected gale, asks her out the next evening. The couple are in love but Grace gets increasingly obsessed with the idea that he must not find out she has had heart surgery. Then, on first being invited back to his apartment, she discovers her own letter \"to the donor family\" on his deak, and realizes this is the man whose dead wife's heart is now inside her. She goes to pieces, takes the letter, and leaves. Bob goes to see her and she shows him the letter. This time, it is Bob who leaves abruptly. All this time, Grace has had an airline ticket to Italy which Marty got for her. The next time Bob calls, she says she is going away, to Italy, to paint. Bob presents her with a new bright red bicycle, and she takes it to Italy with her. But, sitting in her room or with her easel on a rooftop with her artist's easel in front of her, she thionks only of Bob and can't get anything done. An avuncular Italian waiter comes and offers her refreshment. WHen she declines he offers to listen to her story. Meanwhile Bob is distracted, can't concentrate on his work, and the next thing we see he is on an Italian street. That morning, Grace encounters a trio of nuns who admire her beautiful red bicycle. She offers one a ride on it. Off the nun pedals into the crowd. The scene shifts to Bob, a little way off in the same town, who finds himself looking at random at cyclists as they speed past him. Then a nun comes by, and he thinks he recognizes the bike so he runs after her. We go back to Grace and the other two nuns; when the third returns on the bike, she is riding on the fron and a man is behind her pedalling. It is Bob. Grace is so moved that he flew all the way to Italy to find her. (They have only been separated a few days.) Back in the USA the gorilla enclosure has a grand opening. Then at O'Reilly's there is a wedding: it is Sophie and Wally getting hitched.",
      "writers": [
         "Bonnie Hunt",
         "Don Lake"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0122459/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjIwNDEzODU3Nl5BMl5BanBnXkFtZTcwMjI0NzU2NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: David Duchovny, Minnie Driver, Carroll O'Connor | See full cast and crew »"],
      "reviews": [
         "Return to Me is a movie you will want to own. It is a story of inspiration and family love that appeals to all ages. The story, though seemingly impossible, aspires to divine intervention when a man looses his wife in a tragic accident and finds that love again in the woman who receives his wife's heart. David Duchovny and Minnie Driver give warm hearted performances as the designated to-be-lovers who meet by chance. But the real story lies in the friends and family around them who love and support them in times of trial. Carol O'Connor as Minnie Driver's grandfather, is authentic in every scene. Bonnie Hunt as the friend whose wit and encouragement underlines Minnie as a 'sister' is funny yet warm in the scenes especially with James Belushi as her husband. Classic scenes and writing makes this story so enjoyable and touching to watch over and over again. Thank you for making a movie that demonstrates families and friends as close knit caring people who love each other through difficult times.",
         "I just watched this move for the 5th or 6th time and am still in love with it. It still makes me cry and sing and worry and celebrate. I almost wrote Bonnie Hunt a letter to tell her how much I love it. David Duchovny's grief scene is so flippin real!!! Minnie Driver is so natural and honest. My favorite line is when Duchovny says \"I miss Elizabeth but I ache for Grace\". Oh man! I'm crying just thinking about it. ALSO... Bonnie Hunt and Jim Belushi are sooooooooooooo the perfect Chicago area couple!! I know them I swear! I'm related to them I'm sure. This movie is in my three times a year rotation!!! I'd watch it once a week but I'm afraid I'd get too used to it!!! I always want to make it a special day when I watch it!!",
         "When I saw the trailer for this film, I said out loud to no one in particular \"this film is going to bomb.\" I also said that about THE MATRIX and look at what happened there. Now I am not a box office guru by any stretch but I usually have a pretty good gut about what is going to be good and what is going to really suck. In this case I was blinded by my complete and utter apathy towards David Duchovney. Let me put it to you a different way: I don't like his as a person ( from what I have read of him in interviews, he is unbelievably pre-madonna like and he is full of himself considering all he has done is X-Files ) or as an actor. PLAYING GOD was a really poor film but he came off thinking that for some reason he deserved big bucks on the big screen. But I am happy to say that even though those things may still be true about the man, Return To Me is delightful and has it's heart in the right place. Bonnie Hunt has directed a beautiful story and she has told it with class and grace. This is one of the most romantic films I have seen and even though it may seem to be a bit sad and maudlin in its premise, give it a chance and you will be hooked. It has to be said ( and this pains me to do so ) that the reason this film works so well is because of the story and the cast. Duchovney and Driver are so wonderful and believable here that I honestly wanted to cry along with them. There is one particularly powerful scene when Duchovney comes home after his wife has died and he slumps down on the floor of his house. As it always does, the family dog looks to the door to wait for his wife to come walking in. She doesn't and with his shirt collar still stained with blood, Rob ( Duchovney ) tells him that she is not coming home, ever. He then calls the dog over to him and they seem to share a cry together. The dog lets out a small moan and then Rob cries. And this is one of the most realistic moments of pain I have ever seen in any character in any movie. You can feel his pain and at that moment I forgot I was watching an actor that I generally don't like, and I felt that I was watching someone that I knew moarn the loss of his beloved. This is powerful stuff. Another strength of the film is the supporting cast. Bonnie Hunt has combined an ethnic melting pot of Irish and Italian characters that share a common bond. They share a pub called O'Reilley's Italian Pub. That is a delicious name all by itself. And heading the diametric scale of clashing cultures is Carol O'Connor and Robert Loggia. These are two proud old men that love their homeland but love their granddaughter and niece ( I think it is ) respectively. And that is the character played by Minnie Driver. This scenario is ripe for comedy and Hunt doesn't miss anything here. Bonnie Hunt and James Belushi also share some funny moments together as the middle aged married couple and Belushi gets top points as he accepts humility gracefully and shows off his ample keg of a stomach for laughs. With his family consisting of three or four kids, there is very little time for him and the wife to have quality time. And again Hunt handles this with perfect elegance. This is a wonderful story of finding true love, knowing how lucky you are to have true love and the power of friendship and family. Return To Me is a wonderful romance and even though I still don't have a great admiration for David Duchovney, I have to admit that he was perfect in this role and I could not picture anyone else playing his character. He was sensitive and believable and the movie was good because of him, not just because of him, but he sure added to the flavour. If you are a sucker for a good romance and you want a good cry, then this is the film for you. 8.5 out of 10 I will see anything that Bonnie Hunt puts out with her in the director's chair.",
         "My two daughters (ages 11 and 13) and I were lucky enough to see a screening of this movie last night. We were all pleasantly surprised to see how entertaining and funny this movie was. David Duchovny was very appealing as the male lead and Minnie Driver gave her usually competent performance. Some of the scenes are laugh out loud funny - especially one scene Minnie Driver has with a fellow \"transplant\" donee. I liked the fact that it was a movie that I could watch with my children and I wasn't embarrassed by any scene whatsoever. Everyone in the movie theater was laughing and enjoying themselves. Thumbs up Bonnie Hunt!",
         "I watched this movie again yesterday with a 20-year-old intern from my office (OK - it was the quiet day after Thanksgiving) and we both loved it. I love the unique plot, David Duchovny, David Allen Greer, and the way the dog keeps waiting at the door. Isn't part of each of us just like that dog after someone we love dies? I also love the old folks at the restaurant - they remind me of some of the older people around Southern New England, where your ethnic group is a very important topic of discussion. And I love the wedding at the end. Minnie Driver is great in this movie - and Bonnie Hunt should have won an award for everything. Bonnie - make more movies!",
         "I love this movie! It has everything! Bonnie Hunt did a fantastic job co-writing, directing and co-starring in this film. David Duchovny is just plain hot. and Minnie Driver is as cute as ever. combine all that talent with David Allen Grier, Carol O'Connor, Robert Loggia, Joley Richardson, and Jim Belushi you have a Oscar worthy movie! I'm surprised they didn't get one. if you haven't seen it, go rent the DVD, watch it once then put directors commentary on...Bonnie Hunt is Fabulous!",
         "I saw this movie with my mother, and I loved it! It was such a sweet story, (Not to mention funny because of the supporting cast!) They never make movies like this...ever! My favorite part is when Grace(Minnie Driver) finds out about her boyfriend's wife's death, and that she has the deceased wife's heart and she screams, \"WHAT WAS GOD THINKING?\" I do believe everyone(No matter who you believe in) has thoughts like that once in awhile. But while it's very sappy, it just might make you believe in true love and destiny for once and for all.(Sigh) The comedic timing between Bonnie Hunt and Jim Belushi will just make you crack up(especially in the aforementioned scene, it's terrible, and yet so funny!). They make a good pair, and I hope to see them again in something soon. 10/10 Stars",
         "I LOVE THIS MOVIE!!! This beautiful, charming love story drew me in immediately with its lovable characters and heart-warming romance. I became so attached to the characters throughout the film that I felt as if I knew them personally. The storyline is very enchanting, and it brought me to tears in several touching moments. Duchovny and Driver have a very cute, chaste relationship that you can't help getting involved in. This one's worth watching more than once, and showing to all your friends. I'm just curious, why wasn't this a big hit? I give this a 10 out of 10! Spectacular film! (And this is coming from a guy who thinks that 9 out of 10 movies aren't even worth watching.)",
         "May contain spoilers If there is anything negative to say about this film, it's that you can see the ending of the movie coming by a long shot. It's one of the most predictable movies I've ever seen simply based on the setup-a guy's wife dies and another woman gets a heart transplant from her donated heart-guy falls in love with woman with heart transplant; the plot isn't rocket science-yet this movie moved me to tears-it's such a sweet story. Plus, Carroll O' Connor is in his last screen performance and Jim Belushi is hilarious. I loved this movie so much and I can't understand why. It's one of my favorites of all time.",
         "RETURN TO ME / (2000) ***1/2 Starring: David Duchovny, Minnie Driver, Bonnie Hunt, David Alan Grier, Joely Richardson, James Belushi, Robert Loggia, Eddie Jones, and Carroll O'Connor. Directed by Bonnie Hunt. Written by Bonnie Hunt and Don Lake. Running time: 113 minutes. Rated PG (for language and thematic elements). \"Return to Me\" is a warm and fuzzy romantic comedy with heart-in metamorphic and literal terms. Unlike a lot of recent romances, this film is not suggestive or sexy, but gentle and gradual. Director, writer and star Bonnie Hunt is descriptive in believable methods, detailing human emotions and the bitterness loneliness. This is one of the most effective, if somewhat formulaic, comedy-dramas this year. David Duchovny stars as Bob Rueland, a modern day construction consultant. He and his wife, Elizabeth (Joely Richardson), are a happily married, offspring-free couple living a life of honesty and hard work. Elizabeth is in the process of founding a natural habitat for gorillas currently living in enclosed captivity. Bob's best friend, Charlie Johnson, (David Alan Grier) supports the Rueland's whenever need may be. \"Return to Me\" contains two separate story lines before narrative connection in the second act. The secondary story centers on a young woman named Grace Briggs (Minnie Driver), who requires a heart transplant in the very near future. Megan and Joe Dayton (Bonnie Hunt and James Belushi) support her. This family owns an Italian Restaurant in which Bob and Grace meet one night. This is an excellent setup containing thoroughly developed characters, a clear dramatic premise, emotional and physical conflicts, and an unusual structure. Although we do not witness some of the important narrative actions, (Grace's recovery from surgery, an automobile accident resulting in the death of a character), the film firmly paces itself with various plot elements and emotional qualities. \"Return to Me\" inhabits many enormously likable characters. Both central characters, Bob Rueland and Grace Briggs, empathetic and believable, are in a homespun situation. They both contain chemistry-rich elegance and gracefulness. There are very funny moments planted by Megan and Joe's comically dysfunctional family. This family appears somewhat unfocused but wisely portrayed as background characters developing Grace's lifestyle with more depth. The film's humor is handled with delicacy and knowledge. The filmmakers are careful not to travel over the top in hilarity; this is not a story about slapstick issues but about heartfelt secrets and personal fears. Comedy is not overabundant nor overwhelming and does not distract the story from developing its themes. Every funny moment in \"Return To Me\" is scattered throughout the context of the plot. David Duchovny and Minnie Driver pair up for the perfect unlikely romantic couple. The inspirational performance by Driver induces lovable charm and imagination. Duchovny is also engagingly sweet, filling his character with polished humility. Likewise, the background performances are magically funny and heartwarming. The actors paint their characters beautifully. \"Return to Me\" is the kind of date movie where the characters and the audience go home happy and warm. Bonnie Hunt is on target with this comedy straight from the heart, leaving viewers with a cuddly feeling of satisfaction. \"Return to Me\" is brought to you by MGM Productions."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "JLT Productions",
         "Metro-Goldwyn-Mayer (MGM)"
      ],
      "summaries": [
         "The film opens with a loving husband and wife preparing for a very important fund raising dinner. The evening ends with the loss of the wife. In a hospital a weak young woman who may die soon if she can not get a new heart. Jump ahead one year the young woman received a heart and is trying to adjust to a life no longer counted by hours or days, she can actually make plans. The grieving husband and his dog are still trying to adjust to life without his wife. His friends keep trying to pry him from his \"work is my life\" existence by setting him up on blinds dates. Finally he actually shows up for one at an Irish-Italian restaurant where he finds himself more attracted to the waitress than his blind date. He finds an excuse to return to the restaurant in hopes of seeing the waitress again, there's just something attractive about her. Unknown to both the attraction they both feel for one another is Grace has the heart of Bob's dead wife. What can you say after that! Carroll O'Connor says exactly the right thing to Bob after he finds out this ironic coincidence.",
         "Bob Rueland, a Chicago building contractor, cherishes life with his veterinarian wife until she is tragically killed in an automobile accident. Meanwhile the family and friends of Grace Briggs, a waitress at a local Italian restaurant, are overjoyed when they learn that Grace will finally get a replacement heart (the heart of Bob's wife). Both Bob and Grace struggle to maintain normal lives after these traumatic events, until fate intervenes and brings them together.",
         "In this comedy-drama which shows us how the tragic death of one human being can still save the life of another, a happily-married man (David Duchovny) is struck with tragedy when his wife (Joely Richardson) dies from complications of a car accident. In her death, however, another is given life, as another young woman (Minnie Driver) with an ailing heart is given a transplant. Finally able to live a normal, happy life for the first time in years, she joins her grandfather in helping to run an Irish-themed restaurant, where she meets the widower, never imagining that the heart beating in her chest belonged to his wife. They slowly fall madly in love with each other, but when she learns the shocking truth, she is torn by whether or not she should let him know about the transplant she received and who it came from.",
         "A man who falls in love with the woman who received his wife's heart must decide which woman it is who holds his heart."
      ],
      "budget": 24000000
   },
   "movielensId": 3512,
   "movielens": {
      "languages": [
         "English",
         "Italiano"
      ],
      "releaseDate": "2000-04-07",
      "dvdReleaseDate": "2000-10-31",
      "directors": ["Bonnie Hunt"],
      "runtime": 115,
      "movieId": 3512,
      "title": "Return to Me",
      "mpaa": "PG",
      "actors": [
         "David Duchovny",
         "Minnie Driver",
         "Carroll O'Connor",
         "Robert Loggia",
         "Jim Belushi",
         "Bonnie Hunt",
         "David Alan Grier",
         "Joely Richardson",
         "Eddie Jones",
         "Marianne Muellerleile",
         "William Bronder",
         "Brian Howe",
         "Adam Tanguay",
         "Karson Pound",
         "Chris Barnes"
      ],
      "imdbMovieId": "0122459",
      "originalTitle": "Return to Me",
      "genres": [
         "Romance",
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["ZQNifpPNmTk"],
      "plotSummary": "It took a lot of cajoling to get Bob (Duchovny), a recently widowed architect, to go on a blind date at a quirky Irish-Italian eatery. Once there, he's smitten instantly not with his date but with the sharp-witted waitress, Grace (Driver). Everything seems to be going great until an unbelievable truth is revealed, one that could easily break both of their hearts for good.",
      "tmdbMovieId": 2621,
      "avgRating": 3.56279,
      "releaseYear": "2000",
      "numRatings": 2994,
      "posterPath": "/3HvUbZLA9laGje1IFq4Lvj5mqWZ.jpg"
   }
}