{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0172632",
      "video": false,
      "title": "Joe Gould's Secret",
      "recommendations": [
         100196,
         16155
      ],
      "backdrop_path": "/l1FjRqGXKfQ1O1DZIe7Ys2wRJmQ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Joe Gould",
               "gender": 2,
               "credit_id": "52fe4accc3a368484e167a13",
               "name": "Ian Holm",
               "profile_path": "/27SAk1v043GdOeAxT5pPoMUYhGg.jpg",
               "id": 65,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Joe Mitchell",
               "gender": 2,
               "credit_id": "52fe4accc3a368484e167a17",
               "name": "Stanley Tucci",
               "profile_path": "/omGlTJF2IW5r3L3c5y0qkCt3hFr.jpg",
               "id": 2283,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Therese Mitchell",
               "gender": 1,
               "credit_id": "53938e24c3a3686446001cd3",
               "name": "Hope Davis",
               "profile_path": "/m1RBUwfxms0o4PAOaHYaGT0DpAj.jpg",
               "id": 15250,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Elizabeth Mitchell",
               "gender": 1,
               "credit_id": "55e73066c3a36837890002b3",
               "name": "Sarah Hyland",
               "profile_path": "/pRKChfdyIjWukhoXwL0TqsTo41T.jpg",
               "id": 91351,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Nora Mitchell",
               "gender": 1,
               "credit_id": "55e7308a9251416c16000281",
               "name": "Hallee Hirsh",
               "profile_path": "/6uwREt8OqKig4afvAFPuochl94P.jpg",
               "id": 43894,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Sarah",
               "gender": 1,
               "credit_id": "52fe4accc3a368484e167a1f",
               "name": "Celia Weston",
               "profile_path": "/s1PvoXw5lfVCeqpBpjOwKnc51LJ.jpg",
               "id": 1989,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Alice Neel",
               "gender": 1,
               "credit_id": "52fe4accc3a368484e167a23",
               "name": "Susan Sarandon",
               "profile_path": "/sT6zE3Bpa2HR5lAS44tB6rWDEtP.jpg",
               "id": 4038,
               "order": 6
            },
            {
               "cast_id": 7,
               "character": "Vivian Marquie",
               "gender": 1,
               "credit_id": "52fe4accc3a368484e167a27",
               "name": "Patricia Clarkson",
               "profile_path": "/10ZSyaUqzUlKTd60HmeiGhlytZG.jpg",
               "id": 1276,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Helen",
               "gender": 1,
               "credit_id": "53938e2fc3a3686446001cd5",
               "name": "Alice Drummond",
               "profile_path": "/f1O8suDhVloKdPvhyltj017SPTo.jpg",
               "id": 17488,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Charlie Duell",
               "gender": 2,
               "credit_id": "59e392f79251410b670002c6",
               "name": "Steve Martin",
               "profile_path": "/rI2EMvkfKKPKa5z0nM2pFVBtUyO.jpg",
               "id": 67773,
               "order": 9
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4accc3a368484e167a0f",
            "name": "Stanley Tucci",
            "profile_path": "/omGlTJF2IW5r3L3c5y0qkCt3hFr.jpg",
            "id": 2283,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.65069,
      "production_countries": [],
      "id": 125709,
      "vote_count": 6,
      "budget": 0,
      "overview": "Around 1940, New Yorker staff writer Joe Mitchell meets Joe Gould, a Greenwich Village character who cadges meals, drinks, and contributions to the Joe Gould Fund and who is writing a voluminous Oral History of the World, a record of 20,000 conversations he's overheard. Mitchell is fascinated with this Harvard grad and writes a 1942 piece about him, \"Professor Seagull,\" bringing Gould some celebrity and an invitation to join the Greenwich Village Ravens, a poetry club he's often crashed. Gould's touchy, querulous personality and his frequent dropping in on Mitchell for hours of chat lead to a breakup, but the two Joes stay in touch until Gould's death and Mitchell's unveiling of the secret.",
      "similar": [],
      "original_title": "Joe Gould's Secret",
      "runtime": 104,
      "poster_path": "/t6em7AcZBgTlODGHSp0HzA88t7d.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2000-01-21",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Stanley Tucci"],
      "runtime": 104,
      "synopsis": null,
      "writers": [
         "Joseph Mitchell",
         "Howard A. Rodman"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0172632/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY2OTk4MTQ1NV5BMl5BanBnXkFtZTcwNDYzNDQzMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Ian Holm, Stanley Tucci, Hope Davis | See full cast and crew »"],
      "reviews": [
         "With all the garbage that's been coming out in the theaters recently, I've taken to staying home and renting movies that never made a big splash at the box office. With Joe Gould's Secret, I lucked out and enjoyed a movie that was better than I could have imagined. All the performances, most notably Ian Holm's, are stellar. The scenes of 1940's New York will fill you with nostalgia, even if (like me) you were born well after that time. Occasional appearances by the always wonderful Susan Sarandon and Steve Martin only heighten the pleasure of a perfectly-acted, -filmed, and -directed gem of a movie. But, in the end, it is the character of Joe Gould -- brilliant, mad, heartbreaking -- that makes Joe Gould's Secret so perfect. He is the farthest thing imaginable from the \"cute homeless guy\" stock character of your typical insulting Hollywood script. Do yourself a big favor and see this movie.",
         "It's no accident that the opening scene of \"Joe Gould's Secret\" is an all-American family having a normal conversation over breakfast. The head of this household, author Joseph (Joe) Mitchell (director Stanley Tucci) is about to have his world turned upside-down by a person whom he's at first merely intrigued by, but then finds himself friends with: Joe Gould, a homeless beggar who \"speaks seagull.\" Gould (Ian Holm) is himself an author, claiming to have recorded a staggering volume recounting the conversations of strangers he calls the 'Oral History' or simply 'O.H.' One portion of the OH is his own thoughts on these conversations, which he keeps with different people he knows all over New York City. The other is the actual conversations, which he claims to have hidden away under lock and key. Gould won't let anyone read it because it's too personal to him. Over the course of the story, Mitchell starts to suspect that these writings don't even exist. He also finds that he's got a lot more in common with this mentally ill tramp than he'd care to admit. The heart of the story is the friendship between Gould and Mitchell. Both men are well portrayed and given great depth by the actors who play them. That the script is the best of any produced this year doesn't hurt either. Mitchell treats Gould as a story he's writing, as merely an interesting character for people to read about, and not a human being. Mitchell thinks he's done Gould a great service, but finds that all he's done is take away even more of Gould's humanity. Most of his `friends' treat him in a similar fashion: they love how he entertains them with his craziness, but when it comes to helping him, the most they're willing to do is make a contribution to the \"Joe Gould fund.\" Holm's performance is mesmerizing. Behind all of Gould's ravings is a sadness that he always manages to keep just below the surface. Holm brings across several levels of a man's personality, sometimes in no more than a glance. His work here is a perfect, once-in-a-lifetime achievement I hope he is remembered for. There is much more to Joe Gould's Secret than a message about how we treat the homeless in America. It has so many levels, you could watch it several times and find a different story in it each time. Tucci has several points to make, but doesn't do it at the expense of storytelling. His love and understanding of the story and characters shines through, like a kid finding a stray puppy, running home with it, and announcing, \"look what I found!\" Grade: A",
         "This is a well made and acted adaption of Joseph Mitchell's two pieces on Joseph Ferdinand Gould,a New York character from the 20's into the early 50's who claimed to be writing the \"longest book in the English language,Joe Gould's Oral history.\" He haunted Village bars and coffee houses cadging drinks and handouts to sustain his existence.He says \"We all suffer from delusions,his is the delusion that he is Joseph Ferdinand Gould.Tucci is excellent as Joseph Mitchell,but Ian Holm steals the show as Joe Gould,although he looks a little too well fed.Trivia:early in the film when Tucci is in the Minnetta Tavern,we see a painting of the REAL Joe Gould! What a shame this movie didn't get a wider audience,which it richly deserves.",
         "What a line that was. Likely the best movie I've seen in ten years. Joe Mitchell's clear, lucid writing comes through so well one wonders why this hasn't been done before. Being familiar with the stories on which this film is based helped. Ian Holm brings Gould to life, and Tucci plays the bemused, then overwhelmed journalist wonderfully well. (I could quibble about his \"generic southern\" rather than North Carolina accent, but that really is just a quibble.) It made me think (always a sign of any good work of art) about the brief celebrity brought onto persons by well-meaning journalists. We see a slice of their lives, their 15 minutes of fame, but their lives continue on, following their daily routines, which may now be altered by their brush with fame. It also brings out the dance between madness and genius. How many mumbling street people have we seen and passed, never realizing that there is a life, perhaps wisdom, lurking beneath the tattered clothes, sheltered in their cardboard boxes? I like movies that are well-written, and this one certainly is. And the New York of the 40's and 50's is a character in the film to. To see the Village Vandguard's sign, knowing that beneath this sign passed Miles Davis, Charlie Parker, Coltrane... Highly recommended.",
         "This is one of those marvelous movies where almost nothing happens. Noone dies, noone gets blasted by aliens, noone get mushed by Bruce Willis or Harrison Ford. Just a quiet movie about an interesting guy (damn, Ian Holm is good) who doesn't do much. The scenography is awesome, and the details of the surroundings are pretty good. Anyone with an understanding of the pre-beat scene in NYC (or curiosity, ferchristssake) will love this quiet, interesting movie. Some of the characters could have been painted with a little more color. One becomes curious about the photographer-wife, the beat-artist (Saranden), and the sleazy publisher (Steve Martin, ferchristssake), but our questions remain questions. If you like quiet movies, thoughtful movies, you'll thoroughly enjoy this one. Rent it.",
         "Starring one of the best actors in the world, Ian Holm; and Stanley Tucci, who also does a great job in this period drama based on a true story about one of the most unusual New York writers in modern history (Joe Mitchell), and his attempt to write a feature story on one of New York's most notable philosopher characters- a street person who is well-known in writer circles. Joe Gould claims to have written a massive volume that is the complete history of the world based on countless conversations he has heard from people- overheard in the street, and in conversations with friends and strangers. It is never revealed whether Gould really ever had such a manuscript, or if he was a total hoax- possibly somewhere in between. But the effect he has on Joe Mitchell (an actual top feature writer for the New Yorker during the 1940s), is profound. This is an outstanding drama- one of the best of a couple years ago (2000). <p>As reported on NPR after this film release, Joe Mitchell later unexpectedly stopped writing anything, and became a recluse himself. He would never reveal Joe Gould's secret to anyone. Now this film is inexplicably out of print on DVD, which adds a touch of irony to this important piece of American literary history.",
         "Joe Gould's secret, for me, regardless of what it was for the real-life or the movie JG, is this: nobody wants to be a nobody. We want our banal conversations and interactions--the stuff of our lives---to mean something, we want there to be a connection between ourselves and what's labeled \"history\", the big picture. In this film from a real life story, everyone wants Gould's oral history of the little people to exist--to thrive, to be published. What a grand idea! The nobodies will be somebodies and their words will form a picture of their times from the street level, rather than the lofty perspective of the usual published histories. The poignancy in the film is double-barrelled. When Joe Mitchell's character confronts Joe Gould about his self-deluding ways, questioning whether his oral history is a fabrication, he punctures the man and his entire mode of existence, calling cap in hand on any and all sympathetic souls for contributions to his \"fund.\" The capper, however, is that once Mitchell himself finally reveals Gould's secret, writing about him years after his death, he himself is silenced as a writer. The suggestion from scenes in the film is that Mitchell may have found too much in common between himself and the madman/would-be artist whose grandiosity he documented. In the film, Gould says to Mitchell, in his sadly sane time in a mental hospital, \"it was never a question of laziness\", trying to refute Mitchell's harshest accusation. He needs to assert that even if he has failed, it's not for want of trying. In a sense, every artist has to be a little mad, to hold onto a vision of their work and a sense of self-importance stronger than the barriers the conventional world erects to creative endeavour. The possibility of failure has to be thrust aside, a kind of delusion has to be maintained, that denies the possibility of failure. The fact that Mitchell was silenced by recording Gould's colourful and memorable failure is a shocking footnote in the closing moments of the film. Gould's laughable claiming of Mitchell as his biographer early on not only becomes the truth, but the biographer appears to be brought to ground by the subject of his biography. Gould's secret becomes Mitchell's denouement, \"nobody wants to be a nobody, but everyone actually is a nobody, and what can I say to you about anything, as a nobody?\" Joe's secret is everybody's secret, his history is ours, it's Mitchell's, and it's an everyman tragicomedy.",
         "Was he a brilliant and misunderstood bohemian, or merely a mentally deranged hobo with scant moments of lucidity? This is one of the questions broached by this thought provoking period piece based on a true story. Joe Gould (Ian Holm) became a local legend of sorts in the 1940's and \u009150's as he lived on the streets of Greenwich Village in Manhattan during that section's most outlandish and offbeat era. According to the legend, Gould was writing the `Oral History of the World' supposedly scratching down his thoughts and the conversations of common folks in composition books. This story follows the relationship developed between Joe Gould, a Harvard graduate cum decadent; and Joe Mitchell (Stanley Tucci), a prominent writer for New Yorker Magazine during the period, who wrote the book on which this film is based. Gould was generally well liked, and he could be charming and engaging when doing his bohemian act for the locals, who were wont to enjoy the raw humanity of it. Thus, despite his disheveled and odoriferous attributes, he was often welcome at parties given by affluent socialites. He had a symbiosis with the neighborhood, a mutually parasitic relationship where he used them for their money and they used him to indulge their desire to consider themselves avant-garde by consorting with free spirits. He easily manipulated various residents into contributing significant alms, which he would promptly squander on alcohol. This became even truer after Mitchell wrote an article about him in New Yorker Magazine and his celebrity mushroomed. The film tells his story without over-romanticizing him and unabashedly presents his dark side (bordering on sociopathic) marked by alcoholism, temper tantrums, belligerent outbursts and generally disturbed behavior. Stanley Tucci's direction of this film again bears his trademark attention to human details, presenting a very perceptive look at the human condition. As always, his work with the actors to get the right feelings on film was excellent. He also captured the period precisely in his use of costumes, props and Greenwich Village locations, most of which are unchanged from 50 years ago. He does a good job of peeling away Gould's façade, which begins with a look at him as a colorful and interesting character and reveals him ultimately as grossly imbalanced. If there were criticisms of Tucci's presentation, they would have to be about pace and content. The film isn't excessively long, but at times, it feels that way. Though this was a wonderfully in-depth character study, it trod over the same ground repeatedly, rather than offering an array of fresh perspectives. The acting was exceptional. Ian Holm gives a brilliant performance as Gould. It is difficult to imagine a more complex and demanding character. Holm was engaging, charming, cantankerous, belligerent and occasionally insightfully deep. Holm was fully immersed in his character and he gave a truly inspired portrayal. Stanley Tucci was also very good as the sullen and impassive journalist. His southern accent was only passable, but his genteel southern style was excellent and his conflict and concern came across as genuine. This film requires a patient and intelligent viewer. I rated it an 8/10 on the strength of the acting and the insightful character study, despite its sluggish pace. If you enjoy human-interest stories and probing character studies, I would recommend you try it.",
         "I just caught this \"little\" gem on the IFC. They are currently showing it in heavy rotation, around the dinner hour. Other reviews have given a great overview, so no need to repeat. If you enjoy intelligent movies that actually have something to say, DO NOT pass this one up. -And don't worry, this is not a dry, artsy-fartsy movie. There is quite a bit of subtle comedy. In fact, the movie could correctly be classified as a comedy, although miles away from any Jim Carrey effort. If you are a huge fan of said Mr Carrey, then you will likely hate this movie. It is quite deep, and demands a lot of attention and thought from its audience. One thing I want to mention, that I haven't seen written previously, is how brilliant I think the whole concept of Joe's \"oral history\" is. This concept is spot-on. Formal history is simply a glorified, selective record written by the powers that be. It's written by the winners and often bears little resemblance to the truth. True history is the collective thinking, over time, of the general masses. What we think is what is, and that's different for everyone. Wonderful.",
         "This quiet and gentle movie sneaks up on you and by the end you are left with an appreciation of how little difference there is between the quite disparate lives of the two protagonists. With a few differemt turns, circumstances, and choices an intelligent man can easily become a bohemian. I think it is for this reason that Joseph Mitchell, a staff writer for \"The New Yorker\" magazine, became drawn to Joe Gould, a somewhat mad homeless man with occasional flashes of unique insight and a flare for histrionics. Gould claims to be writing an \"Oral History of the World.\" Mitchell admits to sympathizing with Gould's statement that he is at home \"among the cranks and the misfits and the one-lungers and the has beens and the would-bes and the never wills and the god knows whats.\" Indeed, how could you not be a little interested in a man who could write that? And Mitchell comes to identify with Gould in another significant way, and that way is in fact Joe Gould's secret. In the process of writing a profile of Gould for his magazine Mitchell develops a relationship with Gould that results in Gould's ultimately becoming somewhat of a pest. As Gould says, \"When you lie down with dogs, you have to live with fleas.\" In a dramatic scene Mitchell gives Gould an honest appraisal of the status of his \"history\" that creates a rift in their relationship. But the bond is never completely severed as some of the final scenes indicate. The period setting of New York City in the early 1940s lends an air of nostalgia. This is a movie that Woody Allen could have made if he could ever dial his nervous anxiety back several notches. The music is suitably subdued and melancholic. The casting is perfect and the performances are excellent. Every aspect of the filming gives evidence to a loving commitment. This is a movie about dreams realized and unrealized. In a letter to Mitchell, one of Gould's friends states that, \"the City's unconscious may be trying to speak to us through Joe Gould. The people who have gone underground in the City, the City's living dead. People who never belonged any place from the beginning, people sitting in dark bar-rooms, the ones who are always left out, the ones who were never asked.\" Such words leave you with an unspecified yearning. Maybe a yearning to read Mitchell's original \"New Yorker\" articles \"Professor Seagull\" and \"Joe Gould's Secret\" upon which this movie was based."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Bohemian Productions",
         "First Cold Press Productions",
         "October Films"
      ],
      "summaries": ["Around 1940, New Yorker staff writer Joe Mitchell meets Joe Gould, a Greenwich Village character who cadges meals, drinks, and contributions to the Joe Gould Fund and who is writing a voluminous Oral History of the World, a record of 20,000 conversations he's overheard. Mitchell is fascinated with this Harvard grad and writes a 1942 piece about him, \"Professor Seagull,\" bringing Gould some celebrity and an invitation to join the Greenwich Village Ravens, a poetry club he's often crashed. Gould's touchy, querulous personality and his frequent dropping in on Mitchell for hours of chat lead to a breakup, but the two Joes stay in touch until Gould's death and Mitchell's unveiling of the secret."],
      "budget": 0
   },
   "movielensId": 3514,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-01-21",
      "dvdReleaseDate": "2000-09-26",
      "directors": ["Stanley Tucci"],
      "runtime": 104,
      "movieId": 3514,
      "title": "Joe Gould's Secret",
      "mpaa": "",
      "actors": [
         "Ian Holm",
         "Stanley Tucci",
         "Hope Davis",
         "Sarah Hyland",
         "Hallee Hirsh",
         "Celia Weston",
         "Susan Sarandon",
         "Patricia Clarkson",
         "Alice Drummond",
         "Steve Martin"
      ],
      "imdbMovieId": "0172632",
      "originalTitle": "Joe Gould's Secret",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Around 1940, New Yorker staff writer Joe Mitchell meets Joe Gould, a Greenwich Village character who cadges meals, drinks, and contributions to the Joe Gould Fund and who is writing a voluminous Oral History of the World, a record of 20,000 conversations he's overheard. Mitchell is fascinated with this Harvard grad and writes a 1942 piece about him, \"Professor Seagull,\" bringing Gould some celebrity and an invitation to join the Greenwich Village Ravens, a poetry club he's often crashed. Gould's touchy, querulous personality and his frequent dropping in on Mitchell for hours of chat lead to a breakup, but the two Joes stay in touch until Gould's death and Mitchell's unveiling of the secret.",
      "tmdbMovieId": 125709,
      "avgRating": 3.29651,
      "releaseYear": "2000",
      "numRatings": 258,
      "posterPath": "/t6em7AcZBgTlODGHSp0HzA88t7d.jpg"
   }
}