{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0183503",
      "video": false,
      "title": "Me Myself I",
      "recommendations": [
         6174,
         20718,
         16151
      ],
      "backdrop_path": "/eIrinlrNrz0KCRHXC55wld9wFiL.jpg",
      "revenue": 369975,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Pamela Drury",
               "gender": 1,
               "credit_id": "55e804399251413e3a001961",
               "name": "Rachel Griffiths",
               "profile_path": "/eufpAqIIViSBe0ZpMRs47drKiQw.jpg",
               "id": 3052,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Robert Dickson",
               "gender": 2,
               "credit_id": "55e80500c3a3682c5d001be1",
               "name": "David Roberts",
               "profile_path": "/shYTmEKuTg4R4xRUYS5EHbjh0Ty.jpg",
               "id": 77553,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Ben",
               "gender": 0,
               "credit_id": "55e8050cc3a3682c670019e0",
               "name": "Sandy Winton",
               "profile_path": null,
               "id": 1344406,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Stacy",
               "gender": 1,
               "credit_id": "55e805169251413e41001979",
               "name": "Yael Stone",
               "profile_path": "/kNgJQXUwbqqPu9GwgrlDNfcc9Rn.jpg",
               "id": 1028560,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Douglas",
               "gender": 0,
               "credit_id": "55e80521c3a3682c6400173d",
               "name": "Shaun Loseby",
               "profile_path": null,
               "id": 1504492,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Rupert",
               "gender": 0,
               "credit_id": "55e8052cc3a3682c6b001984",
               "name": "Trent Sullivan",
               "profile_path": null,
               "id": 1230458,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Terri",
               "gender": 1,
               "credit_id": "55e80537c3a3682c670019e8",
               "name": "Rebecca Frith",
               "profile_path": null,
               "id": 240289,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Deirdre",
               "gender": 1,
               "credit_id": "55e80545c3a3682c760017fe",
               "name": "Christine Stephen-Daly",
               "profile_path": "/7fPVy0HHjuGH2ga552aY5l1Mh4c.jpg",
               "id": 145314,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Geoff",
               "gender": 2,
               "credit_id": "55e805cc9251413e32001968",
               "name": "Felix Williamson",
               "profile_path": "/eMseHN84sD3NxaMjfMdP86sLQuS.jpg",
               "id": 125564,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Janine",
               "gender": 0,
               "credit_id": "55e805dfc3a3682c5f001bd2",
               "name": "Ann Burbrook",
               "profile_path": null,
               "id": 1223138,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe47a3c3a36847f814076b",
               "name": "Pip Karmel",
               "profile_path": null,
               "id": 33438,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "55e8041f9251413e4100195a",
               "name": "Pip Karmel",
               "profile_path": null,
               "id": 33438,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.718973,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 49721,
      "vote_count": 12,
      "budget": 0,
      "overview": "Pamela Drury is unhappy, and alone. On her birthday she stumbles across a photo of Robert Dickson, and wonders what would've happened had she said yes to his proposal. A freak accident causes Pamela to live out the life she could've had, but is the grass on the other side always greener?",
      "similar": [],
      "original_title": "Me Myself I",
      "runtime": 104,
      "poster_path": "/6GTzoxfOa60Hu4sPqrZh0jqIdow.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Pусский",
            "iso_639_1": "ru"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/weCaiLyIQXuN7T5SH7zQEjQgUFs.png",
            "name": "Gaumont",
            "id": 9,
            "origin_country": "FR"
         },
         {
            "logo_path": null,
            "name": "Gaumont Production",
            "id": 45441,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Australian Film Finance Corporation",
            "id": 1380,
            "origin_country": "AU"
         }
      ],
      "release_date": "2000-04-20",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "I deserve the best and I accept the best.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Pip Karmel"],
      "runtime": 100,
      "synopsis": "Pamela Drury (Rachel Griffiths) is single and works as a serious journalist. She is unsatisfied and looking for a man in her life, but keeps thinking of Robert Dickson (David Roberts), to whom she said no 13 years ago. She then meets an interesting man, Ben (Sandy Winton) and follows him home, only to see him in a family situation through the window. Later she is hit by a car. The woman who drove the car is Pamela Dickson (Rachel Griffiths) - herself in another possible life, married to Robert. She takes her home, and the two of them talk in the kitchen. Suddenly the kids come home and Pamela Dickson disappears, leaving 'our' Pam in a house she has never seen before with three children she does not know! The children assume she is their mother, although they do not quite recognize her sometimes. She soon finds out that her alter ego Pamela Dickson lives in a dull marriage, and writes lightweight articles for a mainstream ladies magazine. She happens to meet Ben again, who in this time-line is a widower. She also manages to wake up Robert's interest and possibly enliven her marriage, but at the end of the movie the two women are switched back to their fomer lives. Pamela Drury is single again, but goes toward a happy end, when she meets Ben again, and finds out he is divorced (and that he seems to have dated the other Pamela for a while!).",
      "writers": ["Pip Karmel"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0183503/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY4NzY4ODgwNl5BMl5BanBnXkFtZTYwMzI0NDg4._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Rachel Griffiths, David Roberts, Sandy Winton | See full cast and crew »"],
      "reviews": [
         "Pamela Drury, a journalist in her thirties, is in a rut. She suddenly remembers her love for Robert Dickson, a man who went to marry another woman and appears to be happily married now. Pamela wonders how her life would have turned out had she married Robert. Ben, a kind soul, who wants to pursue his interest in Pamela, arrives in her life at the time when her vivid imagination takes her to change places with the real Mrs. Dickson. Needless to say, the sophisticated Pamela Drury, sticks out like a sore thumb among this well adjusted family living an uncomplicated life in their spacious home. Pamela relives her passion for Robert, a man that turned out to be not everything she remembered. She gets much more than what she bargained for, until the day she sees the family celebrating in their favorite restaurant and she realizes she doesn't fit in that picture, at all. Pip Karmel created a charming film, which even on a second viewing, leaves the viewer smiling. It helps to have a good cinematographer to enhance the movie, something that Graham Lind does with great style. The movie score by Charlie Chan works well in the context of the film, but ultimately, Ms. Karmel shows she has quite a knack for directing this winning comedy. The main reason for watching \"Me, Myself, I\" is Rachel Griffiths. This wonderful actress runs away with the picture. She is unique in that she can play comedy and drama with equal amounts of intelligence and wit. David Roberts makes a pleasant Robert Dickson and Sandy Winton is good as Ben. Highly recommended because of the combined talents of Pip Karmel and Rachel Griffiths.",
         "If Rachel Griffiths keeps this up, she is going to be a potent force in feature films. She continues to show her versatility in both dramatic and comedic roles. This delightful comedy reinforces the notion that you need to be careful what you wish for. Pamela Drury (Rachel Griffiths) is a successful journalist whois having a mid life crisis as another birthday rolls around. She is afraid that despite all she has accomplished, she might have been happier if she married Robert Dickson and raised a family. One day, through mechanisms unexplained other than the magic of cinema, she is hit by a car while crossing the street by her twin, Pamela Dickson, whom I can only assume is living in some parallel universe. Drury discovers that Dickson is actually living the life she wondered about, married to Robert with three children. Suddenly Dickson disappears, leaving Drury in her place. Now Pamela begins to discover the multidimensional joys of marriage and family from the front lines. She is so ill equipped for the experience, that it produces a parade of comical situations that range from mildly amusing to absolutely hysterical. This is a virtuoso performance by Griffiths, who has impressed me in every role I've seen her play. She was outstanding in `Hillary and Jackie' delivering a compelling dramatic performance of a complex character in a supporting role. In this film, she has the lead and she runs with it. At various times she is called upon to be dynamic, sexy, compassionate, affectionate, independent, helpless and despondent and she handles this incredible range fabulously in every case. She is a terrific comedian with excellent timing and a knack for physical comedy. This is a very funny and enchanting film. `What If' movies seem to be popping up everywhere lately, and this is the best one I've seen. I rated it a 9/10. It is extremely entertaining and I recommend it highly. It is a shame it didn't reach a wider audience.",
         "This movie is a true hidden gem. I cannot say too strongly - see it, see it see it. The premise of the movie might seem a little strained... and perhaps also overused - it's very much the same basic idea as the Nicholas Cage vehicle \"Family Man\", but with a female rather than a male protagonist. But this movie really works, on so many levels. Rachel Griffiths (Brenda from Six Feet Under) gives a lovely performance as the central figure, who finds herself at the verge of mid-life confronting and changing paths with an \"alternate self\". The movie is very funny in parts, in a slightly exaggerated but \"spot on\" way rather reminiscent of Bridget Jones' Diary. But I think this film actually manages to do as much in this way as BJD, whilst going considerably further in connecting with emotional realities and the sense of choices and consequences in life. It's not astoundingly deep, I guess. But it's very funny, moving and true. And fair, as well - it never gets preachy, or comes down with a trite \"moral\" on one side of a complex issue. I suppose the movie's most obvious appeal would be to women of a certain age either single and (to some degree) wishing they were married or married and (to some degree) wishing they were single. But I'd have no hesitation in recommending it to anyone.",
         "I have been keeping a close eye on the rising career of Australian actress Rachel Griffiths. Of course she is best known in her role of Rhonda in the great Aussie film, \u0091Muriel's wedding'. She certainly is talented, and continues to astound many TV and moviegoers around the world, who are captivated by what she can do onscreen. In the Aussie film \u0091Me Myself I', Griffith's takes on a double role which she handles beautifully. Pamela Drury is an attractive, intelligent thirty-something award winning Sydney journalist. Yet Pamela has missed the love boat, and is resigned to the odd porno flick and blind date. She could have had it all thirteen years ago, when she turned down \u0091Mr. Right', Robert Dickson. On the edge of despair, Pamela literally collides with her other self - the Pamela who married Robert thirteen years ago - and comes complete with three kids, dog, goldfish and a white picket fence. When the married Pamela disappears, the career Pamela is left with the family she almost had, and the man she always wanted. As she struggles to cope with a family oblivious to the switch, she is challenged by poignant, humorous and ultimately enlightening experiences. \u0091Me Myself I', is a film which you have to look at closely, to really enjoy. Its story while it might be simple to some degree has merit. The way we see Pamela go from one world to the next is quite good. The comparison to \u0091Sliding Doors' is noticeable. Although it might not be as good as what Sliding Doors is, the way it uses the question of \u0091what if?' in this story is pretty good. The director/Writer of \u0091Me Myself I' was Pip Karmel. With Karmel, I got the feeling that she put some of her own life experiences into the story and in the character of Pamela. Pip has been a part of good movies such as Shine and Hearts in Atlantis. There was a pretty good cast in this Australian movie. Griffith's is the standout performer in this one, as she takes on many facets to each side of her character. I like how we meet up with her two characters at the start and the end of the movie. Her husband Robert (David Roberts) was another interesting character. He really has to adjust to what the \u0091other' Pamela is like. When he finds out what she wants, he is more than satisfied with her. Yet the young cast of the Dickson family was surprisingly good. I enjoy how the story focused on Stacey (Yael Stone), and how her mother helps her come to grips with womanhood. Then there is the funny scene with Douglas (Shaun Loseby), who is told in no uncertain manner that calling Mum a \u0091dumb head' or the like is just not on. Yet the character of Rupert (Trent Sullivan) is most vital to the story, as he points out to the audience many times that he realises Pamela 2 is not his real mum. However, Pamela 2 does help him grow up immensely. Outside of the Dickson family there are many interesting characters which we get to meet. The dinner scene is quite funny, as we get to see how sleazy a guy Geoff (Felix Williamson) really is, and that the other Pamela is as unfaithful as her own husband is. Then there is the character of Ben, who has taken a liking to Pamela 2. Pamela is strongly attracted to Ben (Sandy Winton), and she can not control her feelings towards him either. This then leads me to the important lessons that this movie points out to its audience. The question of \u0091What If?' is of great significance all the way through out the film, as Pamela 2 is thinking that at one stage \u0091Why did I let you go?' in reference to Robert. Then in the blink of an eye, Pamela 2 is placed into the very situation that she thought she had lost 13 years ago. I am sure that we have all wondered at one stage or another, how a different decision might have effected our future. \u0091Me Myself I' also asks other questions like \u0091what is more important, a family or career?'. In the fantasy world that this film is set in, Pamela 2 gets to experience the best of both worlds. Then there is the idea of love and relationships. Pam and Robert both talk of how difficult their relationship/marriage has and continues to be. Pamela 2 also shows what effect a \u0091risk' can or could have had on her life if she enters into a relationship or not. The rewards certainly outweigh the risks that were presented to her. In conclusion, this was a very enjoyable film to watch, and while Rachel Griffiths has done many small-time films that we have probably all overlooked, she is one actress who demands that people take notice of. After seeing \u0091Me Myself I', it has made me appreciate this Aussie gals talents all the more. I will continue to look out for her with keen interest in her upcoming movie roles. \u0091Me Myself I' allows us all to look at who we really are, the \u0091individual' that is inside us all. The finale to this one is a great look at just that. I also like the new remix on the song \u0091Me Myself I', which was performed by Marie Wilson. Take the \u0091risk' when you are next looking for a good Aussie film and view \u0091Me Myself I'. You will kick yourself if you don't! CMRS gives \u0091Me Myself I': 4 (Very Good Film)",
         "i thought this movie was wounderful. it teaches you how if you envy one persons life they may envy yours and it isn't allways better then yours. It made me think of if given the opportunity would you go back and change something that you have felt that you did wrong, and if so would you change it?",
         "No denying the talents of Rachel Griffiths and her turn in this \"dual\" role shows that she is quite capable of carrying a film. Also, a great comic turn, with a flush of drama. The film goes where we would all like to go, (It's a Wonderful Life style) the path not taken. Answers to the \"what if's\" that plague a person over time. Terrific handling of the subject matter and great performances by the supporting cast.",
         "\"Me, Myself and I\" is for fans of \"little romantic Australian movies\" like \"Hotel de Love\" and \"Muriel's Wedding\" (which I am a sucker for) or \"alternative universe/what if movies\" like \"Sliding Doors\" and \"Twice Upon Yesterday\" or sort of \"Next Stop Wonderland\" (of which I am also a sucker for) or even \"mid-life crisis movies\" like \"Metroland\" (which I deeply went through when I turned 40 so can really relate to). Except for a tacked-on romantic ending in the closing moments, this is a charming tour de force for Rachel Griffiths (Hilary of \"Hilary and Jackie\") as she plays both \"what if's\" in her life. I liked that each parts of herself learn from the switch. I would think that both singles and confirmed marrieds would enjoy what each self goes through as they seemed realistic to me. Well to women at least (the women in the audience were rolling in the aisles at the scenes of the single woman suddenly having to cope with how a married woman deals with birth control). (originally written 4/8/2000)",
         "Based on the popularity of the TV show, \"Six Feet Under\", Rachel Griffiths is now getting the popular and critical recognition she deserves. But to really appreciate her breadth as an actress you must watch some of her earlier films, and \"Me Myself I\" is a good candidate. For one, it's almost a one-woman show, and Griffiths actually plays two parts. We all wonder what would have happened if we'd made a critical life-decision differently. Driven, single professional, Pamela Drury (Griffiths), gets the chance to actually experience this 'what if'. Through some weird event, Pamela is thrust into an alternate reality where her new life is as if she had married her childhood sweetheart and settled down to some serious homemaking. At the same time, her double (the homemaker from the parallel reality), trades places with her and assumes the life of a single professional. I know it's confusing, and I can't explain it any better. If it sounds intriguing, rent the movie.",
         "On her 30th birthday, Pamela Drury is given the chance to see what might have happened if she had married \"Mr Right\" 13 years ago. In a sequence that could have been endlessly corny if badly handled, Pamela is transported to her \"married life\" where she discovers what would have happened if she had chosen marriage over her journalistic career. The writers did not take the obvious route of making her husband out to be a rat, and the moment she discovers that she was the one that had been unfaithful is very telling. All the cast are very strong, with Trent Sullivan as four-year-old Rupert stealing every scene he is in. Rachel Griffiths is totally believable as Pamela, in both her incarnations, and combines humour with pathos and credibility. Somehow this film manages to avoid over-sentimentality, and reassures the viewer that regret is futile. Very funny and rather touching in places.",
         "I really like this movie. Maybe I also related myself a lot with the Pamela but anyway it is brilliant. We already know that the life is all depend our choices. And aren't we all wonder sometimes what would happened if we choose the other path.It really made me thinking over my personal choices and asked myself the question ''what if...?''. And I think it is good to think over again our choices, imagine what would have happened, would i be more happier or miserable. but the beauty is we cannot tell. that is one of the mystery that will remain forever. So it is not the final goals of your's what makes you happy in your life but it is the journey that takes you there. And it is this journey that makes you who you are."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Gaumont",
         "Gaumont Production",
         "Australian Film Finance Corporation (AFFC)"
      ],
      "summaries": ["Pamela Drury is unhappy, and alone. On her birthday she stumbles across a photo of Robert Dickson, and wonders what would've happened had she said yes to his proposal. A freak accident causes Pamela to live out the life she could've had, but is the grass on the other side always greener?"],
      "budget": 0
   },
   "movielensId": 3515,
   "movielens": {
      "languages": [
         "English",
         "Pусский"
      ],
      "releaseDate": "2000-04-20",
      "dvdReleaseDate": "2000-09-19",
      "directors": ["Pip Karmel"],
      "runtime": 104,
      "movieId": 3515,
      "title": "Me Myself I",
      "mpaa": null,
      "actors": [
         "Rachel Griffiths",
         "David Roberts",
         "Sandy Winton",
         "Yael Stone",
         "Shaun Loseby",
         "Trent Sullivan",
         "Rebecca Frith",
         "Christine Stephen-Daly",
         "Felix Williamson",
         "Ann Burbrook"
      ],
      "imdbMovieId": "0183503",
      "originalTitle": "Me Myself I",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Pamela Drury is unhappy, and alone. On her birthday she stumbles across a photo of Robert Dickson, and wonders what would've happened had she said yes to his proposal. A freak accident causes Pamela to live out the life she could've had, but is the grass on the other side always greener?",
      "tmdbMovieId": 49721,
      "avgRating": 3.15235,
      "releaseYear": "2000",
      "numRatings": 1339,
      "posterPath": "/6GTzoxfOa60Hu4sPqrZh0jqIdow.jpg"
   }
}