{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0016640",
      "video": false,
      "title": "The Bells",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Mathias",
               "gender": 2,
               "credit_id": "52fe4ccd9251416c7512604d",
               "name": "Lionel Barrymore",
               "profile_path": "/5BsoVPE4FBzmiRsPQK14LdcbGCK.jpg",
               "id": 17753,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Catharine",
               "gender": 0,
               "credit_id": "52fe4ccd9251416c75126051",
               "name": "Caroline Frances Cooke",
               "profile_path": null,
               "id": 30164,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Jerome Frantz",
               "gender": 2,
               "credit_id": "52fe4ccd9251416c75126055",
               "name": "Gustav von Seyffertitz",
               "profile_path": "/v1mnrEVtPdSqTpOBHjLPmb2FElm.jpg",
               "id": 13345,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Hans",
               "gender": 0,
               "credit_id": "52fe4ccd9251416c75126059",
               "name": "Lorimer Johnston",
               "profile_path": null,
               "id": 1167815,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "The mesmerist",
               "gender": 2,
               "credit_id": "52fe4ccd9251416c7512605d",
               "name": "Boris Karloff",
               "profile_path": "/3kY1eEgGFAoVyy8MjNolCS5wouj.jpg",
               "id": 2922,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Christian",
               "gender": 0,
               "credit_id": "58414fdac3a36865ad00608d",
               "name": "Eddie Phillips",
               "profile_path": null,
               "id": 117584,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Annette",
               "gender": 0,
               "credit_id": "58414ff59251417d59005cba",
               "name": "Lola Todd",
               "profile_path": null,
               "id": 1405588,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Fortune Teller",
               "gender": 1,
               "credit_id": "584150129251417d56005ca4",
               "name": "Laura La Varnie",
               "profile_path": null,
               "id": 150190,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Mesmerist Announcer (uncredited)",
               "gender": 2,
               "credit_id": "5945f38f9251413fb101e3e1",
               "name": "John George",
               "profile_path": "/gEhNTzAQ2EoZzpAQWMYQuOVkSpF.jpg",
               "id": 97999,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4ccd9251416c75126063",
               "name": "James Young",
               "profile_path": null,
               "id": 150184,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "58414f489251417d4d0059e7",
               "name": "James Young",
               "profile_path": null,
               "id": 150184,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "58414f60c3a36865bf0057f1",
               "name": "Alexandre Chatrian",
               "profile_path": null,
               "id": 1717302,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 0,
               "credit_id": "58414f71c3a36865c9005a2d",
               "name": "Emile Erckmann",
               "profile_path": null,
               "id": 1717303,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 2,
               "credit_id": "58414f889251417d5f005b5c",
               "name": "I.E. Chadwick",
               "profile_path": null,
               "id": 1347788,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "58414f9bc3a36865b6005f8a",
               "name": "L. William O'Connell",
               "profile_path": null,
               "id": 34342,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Horror",
            "id": 27
         }
      ],
      "popularity": 0.364735,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 184885,
      "vote_count": 2,
      "budget": 0,
      "overview": "Mathias, an Alsatian innkeeper, murders a rich Pole staying at his inn But Mathias' conscience will not let him rest, and the murdered man's spirit drives the innkeeper nearly mad. The victim's brother calls for an inquest and brings with him a sideshow mesmerist supposedly able to read minds. Mathias, as burgomaster, is called upon to conduct the inquest, but under the intuitive eye of the mesmerist cannot resist torment of his own conscience.",
      "similar": [],
      "original_title": "The Bells",
      "runtime": 68,
      "poster_path": "/crONJfKpdhb5S2SlXWEbM81vLGr.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Chadwick Pictures Corporation",
         "id": 48490,
         "origin_country": ""
      }],
      "release_date": "1926-07-29",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["James Young"],
      "runtime": 68,
      "synopsis": null,
      "writers": [
         "Alexandre Chatrian",
         "Emile Erckmann"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0016640/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNzEzMzk5NzIwOF5BMl5BanBnXkFtZTcwMjAzNjMyMQ@@._V1_SY317_CR11,0,214,317_AL_.jpg",
      "actors": ["Stars: Lionel Barrymore, Caroline Frances Cooke, Gustav von Seyffertitz | See full cast and crew »"],
      "reviews": [
         "\"The Bells\" is a very fine silent movie from 1926 that is not at all creaky and should manage to impress modern-day viewers. As revealed in my beloved \"Psychotronic Video Guide,\" this story was, remarkably, filmed no less than four times prior to this 1926 version, and three times subsequently in 1930s Europe! It made a huge star of British actor Henry Irving in 1872, when performed on stage. Anyway, the plot is a simple one, and concerns family man Mathias (here played by the great Lionel Barrymore, looking younger than you've probably ever seen him), who, in order to pay off his mortgage debt, kills a wealthy Polish Jew merchant for the gold in his money belt. He soon goes insane with guilt, and begins to hallucinate the ghost of the Polish Jew, hear the bells of his victim's sleigh, dream of himself on trial in court and, in one impressive scene, play cards with the murdered man. It is an excellent performance from Barrymore. The FX in this film are pretty fine, too, and director James Young makes the film visually striking by filling his frame with great detail and constant movement. And Boris Karloff, six years before his Frankenstein breakthrough, is memorable in his small role as a freaky-looking mesmerist. To add to the viewer's pleasure (at least on the disc that I just watched), the fine folks at Image Entertainment have given us a very crisp- and clean-looking DVD, with beautiful color tinting. (I'm still not sure why I despise colorization for old talkies but don't seem to mind it for silents!) Two problems, though: The film ends kind of abruptly, and although the picture is widely quoted as being 92 minutes long, the film I saw last night was just a shade over 70 minutes in length. What's up with that?",
         "Although more than one promoter has been quick to exploit the idea that THE BELLS was inspired by the 1848 Edgar Allen Poe poem of the same name, nothing could be further from the truth. Originally created in 1867 as LE JUIF POLONAIS by the incredibly prolific French dramatists Emile Erckmann and Alexandre Chatrain, it was translated, adapted, and re-titled THE BELLS by English playwright Leopold Lewis. Actor Henry Irving's 1871 performance as Mathais was a sensation on the English stage, and in consequence the play was widely performed in the Victorian era. As the 20th Century began, the stage version of THE BELLS was still so well-remembered that it was adapted to the silent screen at least six times. Little, if any, information is available about these adaptations--with a single exception: the 1926 film starring Lionel Barrymore (1878-1954), brother of stars John and Ethel Barrymore and a noted artist in his own right. Modern audiences will likely find the story clunky and obvious, but in 1926 it, like the original stage version, was considered a great shocker. Mathais (Barrymore) is an inn-keeper who is in debt to the sinister Gustav von Seyffertitz (Jerome Frantz), who seeks to leverage Mathais' inability to pay into a marriage with Mathais' daughter Annette (Lola Todd.) In order to pay off the debt and secure his bid for the position of burgomeister, Maithas kills and robs a wealthy merchant who stops at the inn on Christmas--and is thereafter tormented by his own guilt and most particularly by the sound of bells, which recall the sleigh bells his victim held when killed. Today the film is best known for Boris Karloff, who appears in the small but distinctly creepy role of \"The Mesmerist;\" even so, it is really Lionel Barrymore who endows the thing with interest. Acting styles of the early silent era tended to be very broad, and THE BELLS OFFERS scope for a great deal of scenery chewing, but Barrymore is comparatively restrained in his approach and the entire cast follows suit. In this sense, the film is quite watchable. At the same time, however, the story has been reworked so many times that even here it feels excessively old fashioned and slightly tired. The print offered here is hardly pristine, but it is very good, and the score is also very well done. The DVD presents a short 1922 French film fantasy, THE CRAZY RAY, which is mildly entertaining as well. But for all the history and celebrated names involved, THE BELLS is a competent film rather than a good or great one, and its appeal will be largely confined to hardcore silent movie fans. Recommended to them. GFT, Amazon Reviewer Comment | Permalink",
         "Contrary to the title and to popular belief, this 1926 feature is not based on or inspired by Edgar Allan Poe's poem \"The Bells,\" which, truth be told doesn't offer much literal plot material for a film adaptation. Instead it is based on a stage melodrama very popular in the nineteenth century and the first part of the twentieth. From what we can tell here, despite its fall from popularity, it was so popular because it is damn good as a melodrama -- a disturbing and tense psychological tale of the motives for a murder and the consequences of that same murder. It is most famous now as an early appearance of Boris Karloff in a significant macabre role, but it is really a vehicle for the talents of Lionel Barrymore, who gives as extraordinary performance as Mathias, the innkeeper who wants to be generous with credit despite the wishes of his wife and father-in-law so he can win enough goodwill to become Burgomaster, but who is driven to murder to pay his debt and then tormented with guilt. He gives a very subtle and multidimensional performance as Mathias, constantly (and increasingly) worried, but still charming. He's perfectly underplayed by still expressive early, so it is so much more effective later when he plays up. It's essential that he manages to convey the innkeeper's tortured thoughts about his debt before the murder itself, because no time is devoted to the decision itself, and Barrymore's acting makes it unnecessary. Karloff, in a smaller but important role as the mesmerist who haunts Mathias with his supposed ability to cause criminals to confess. He's very powerful, magnetic, and harrowingly weird. As a mysterious man who may or may not have dangerous powers of the mind, you can't get much more effective. The direction sometimes seems a little plain in a few of the scenes, but this is more than made up for in a good number of symbolic shots (plain objects coming to resemble nooses) and trick scenes that memorably show what is inside Mathias' mind (blood appearing on his hands as he retrieves some of his money, a argument with a spectral appearance of his dead victim). As this is a silent film adaptation of a stage play, however, some of the talkiness inherent in the stage medium and impossible in the silent film medium has to come through some outlet. This leads to some unnecessarily wordy title cards that tend to distract. In addition, much of the acting, apart from that of Barrymore and Karloff, is overplayed to an unnecessary degree that begins to detract. The ending, while goodhearted, is indeed quite rushed, and leaves several plot threads hanging. It would have been much more satisfying if the film had been extended past this point for a little while. This is a flawed but still very memorable film with elements that make it highly compelling, and one that will hold up very well for most viewers.",
         "Fits more properly into the category of gothic melodrama than of horror, but lately it has been distributed as horror (perhaps owing to the presence in the supporting cast of the great horror actor Boris Karloff, and to the film's gothic style). It claims to be from an Edgar Allen Poe story, but this concoction of suspicious wives and somnambulists is really little more than a rip-off of Germany's \"Cabinet of Dr. Caligari\" (which was perhaps itself a take-off on the venerable, much-abused Poe). Barrymore serves admirably as the film's central character, though he hasn't really learned good film technique yet, making his performance one in the \"high theatrical\" mode.",
         "Monday January 19, 7:00pm The Paramount, Seattle Desperate to save his livelihood and public standing, a congenial businessman, Mathais (Lionel Barrymore), murders a wealthy stranger for his gold to pay an insurmountable debt. As a mountain blizzard rages, an axe is swung, blood stains the snow and sleigh bells ring from the hand of the dying man. Tormented by his guilt and visions of his victim, Mathais is ultimately caught and stands trial for his crime, or does he? Based on the play Le Juif Polonais written by Emile Erckmann and Alexandre Chatrain in 1867 and adapted for Sir Henry Irving who starred in a much heralded British stage production, The Bells was brought to the big screen no less than seven times. In addition to Barrymore, the 1926 Chadwick Pictures release stars Gustav von Seyffertitz in a typically sinister role, as the holder of Mathais' debt and Boris Karloff as a creepy sideshow performer, 'The Mesmerist'.",
         "This silent film kept my interest from the very beginning to the end and this was the first time I was able to view this film with Boris Karloff playing the role as a Mesmerist who had great powers of elevating people and being able to read the minds of guilty men who commit crimes. This story mainly deals with Lionel Barrymore, (Mathias) playing the role as an innkeeper who wants to become the mayor of his small town and is always giving free drinks to most of his customers or loaning money to them. However, Mathias is deeply in debt to a man who threatens to take his inn away from him and force him and his family into the street. Boris Karloff did have a brief role in this film but his great talent along with Lionel Barrymore made this a great silent film classic. If you like good Silent films, this is one of the best. Enjoy",
         "After reading the Edgar Allen Poe poem, this film seems like an adequate representation of its original moods and feelings. Plus, you've got great talents like Lionel Barrymore and Boris Karloff (even though he has a small role) moving this picture down its macarbe path. So, if you enjoy silent films, this one will probably float your boat. The only complaint I have is in the the 1998 release's choice of music. It seems overly cheesy to be associated with Edgar Allen Poe. Although, the use of silence and sleigh bells adds a lot to the impact of the film. Intriguing with a good pace (plus, it's only 67 minutes, so if you can't sit through long silent films like \"Birth of a Nation,\" then this one is for you.).",
         "This is quite a decent silent horror film. The print I watched was quite rich. It is a story, not unlike \"Crime and Punishment,\" where a man beset by debt through his own shortsightedness, kills a kind old Jew and lives it up on his money. He spends on his daughter's wedding, buying clothes for his wife, and playing the part of the Burgomaster. Unfortunately, the bells in the title are the sleigh bells of the shay that the old man was driving when he was murdered. One of the strangest things is the appearance of Boris Karloff as a mesmerist. This was years before his appearance in \"Frankenstein.\" He has thick glasses and this hideous grin. He has the power to get people to talk about their worst actions. Everything plays out, but I'm still not sure about the conclusion. It is a very interesting film and it has Lionel Barrymore playing something other than a bent over old curmudgeon.",
         "Burgomaster is from the German word 'bergermeister'--a word that means 'mayor' in English. I mention this because the main player in this film, Mathias (Lionel Barrymore) plays an innkeeper who longs to become the town's next Burgomaster. To do so, he ingratiates himself to everyone--extending credit left and right to his patrons in an attempt to buy their votes. However, he simply cannot afford to do this and is deeply in debt--in debt to another man who wants this same job. Eventually, when all seems lost, Mathias comes upon a solution when he kills a traveler who he knows is loaded with gold. Unfortunately, while this does immediately solve things and Mathias wins the election, he cannot live with himself for such an evil deed. Later, the dead man's brother returns to town with a mesmerist (this term is now knows as a hypnotist and is played by Boris Karloff). This hypnotist supposedly has the power to read minds and make confess. At first you may not recognize Karloff in his garb, as he's dressed almost exactly like the evil mesmerist, Dr. Caligari, from the famous German film. As for Mathias, he's so convinced that the ghost of the dead man is haunting him that by the end of the film he's ready to do anything to make this stop--even if it means confessing. This follows a particularly vivid and crazy dream in which the mesmerist prosecutes him for murder. While this was an exceptional film, I did feel that perhaps the ending could have been done a bit better--as Barrymore's stumbling about as if in the throes of death took way too long and was clearly overdone and it all seemed a bit old fashioned and hokey. Still, an interesting silent film and one that fans of the genre will no doubt enjoy.",
         "I'm taking an interest in silent horror films at the moment, so far I have seen this film and Nosferatu. Nosferatu is of cause much better, with a real style and sense of horror. This movie is rather dull and boring in places although it does have points of note. The starting of the film is good introducing all the characters and the setting, but then it takes a little while to get into the plot. The murder and the lead up to it is another high point, with a good use of tinting to show where things are turning bad. The use of the sleigh bells is important to outline the bells the innkeeper is haunted by. The ending is rather short and rather unsatisfying with not enough explanation of what happens at the end. Overall not bad but not really more than average."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Horror"
      ],
      "productionCompanies": ["Chadwick Pictures Corporation"],
      "summaries": [
         "Mathias, an Alsatian innkeeper, murders a rich Pole staying at his inn But Mathias' conscience will not let him rest, and the murdered man's spirit drives the innkeeper nearly mad. The victim's brother calls for an inquest and brings with him a sideshow mesmerist supposedly able to read minds. Mathias, as burgomaster, is called upon to conduct the inquest, but under the intuitive eye of the mesmerist cannot resist torment of his own conscience.",
         "An innkeeper murders a wealthy guest to pay off his debt, but his conscience will not allow him to get away with the crime so easily."
      ],
      "budget": 0
   },
   "movielensId": 3517,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1926-07-29",
      "dvdReleaseDate": "2000-03-28",
      "directors": ["James Young"],
      "runtime": 68,
      "movieId": 3517,
      "title": "The Bells",
      "mpaa": "",
      "actors": [
         "Lionel Barrymore",
         "Caroline Frances Cooke",
         "Gustav von Seyffertitz",
         "Lorimer Johnston",
         "Boris Karloff",
         "Eddie Phillips",
         "Lola Todd",
         "Laura La Varnie",
         "John George"
      ],
      "imdbMovieId": "0016640",
      "originalTitle": "The Bells",
      "genres": [
         "Drama",
         "Crime",
         "Horror"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Mathias, an Alsatian innkeeper, murders a rich Pole staying at his inn But Mathias' conscience will not let him rest, and the murdered man's spirit drives the innkeeper nearly mad. The victim's brother calls for an inquest and brings with him a sideshow mesmerist supposedly able to read minds. Mathias, as burgomaster, is called upon to conduct the inquest, but under the intuitive eye of the mesmerist cannot resist torment of his own conscience.",
      "tmdbMovieId": 184885,
      "avgRating": 2.91667,
      "releaseYear": "1926",
      "numRatings": 24,
      "posterPath": "/crONJfKpdhb5S2SlXWEbM81vLGr.jpg"
   }
}