{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "women",
            "id": 515
         },
         {
            "name": "gun",
            "id": 1419
         },
         {
            "name": "traitor",
            "id": 2052
         },
         {
            "name": "nazi",
            "id": 2652
         },
         {
            "name": "bridge",
            "id": 3450
         },
         {
            "name": "major",
            "id": 9052
         },
         {
            "name": "colonel",
            "id": 10786
         },
         {
            "name": "sergeant",
            "id": 11400
         },
         {
            "name": "battle",
            "id": 14643
         },
         {
            "name": "partisan",
            "id": 15182
         },
         {
            "name": "task force",
            "id": 15186
         }
      ],
      "imdb_id": "tt0077572",
      "video": false,
      "title": "Force 10 from Navarone",
      "recommendations": [
         11372,
         9967,
         10911,
         11046,
         5902,
         17657,
         19403,
         20681,
         1654,
         7010,
         10015,
         13783,
         9080,
         12651,
         11589,
         11851,
         14911,
         6341,
         11509,
         18886
      ],
      "backdrop_path": "/oeJHW3H8b60TszYYY6PLCvMierd.jpg",
      "revenue": 7230000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Lieutenant Colonel Barnsby",
               "gender": 2,
               "credit_id": "52fe471e9251416c7508e46f",
               "name": "Harrison Ford",
               "profile_path": "/7LOTdRfHU1H1qHBxpUv3jT04eWB.jpg",
               "id": 3,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Maj. Keith Mallory",
               "gender": 2,
               "credit_id": "52fe471e9251416c7508e473",
               "name": "Robert Shaw",
               "profile_path": "/jJpquJQB2XGqZ1Mrc35VmgT2UcR.jpg",
               "id": 8606,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Maritza Petrovich",
               "gender": 1,
               "credit_id": "52fe471e9251416c7508e477",
               "name": "Barbara Bach",
               "profile_path": "/EYYNEUN0CmLDto4cDEesM7pS4V.jpg",
               "id": 10458,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Miller",
               "gender": 2,
               "credit_id": "52fe471e9251416c7508e48d",
               "name": "Edward Fox",
               "profile_path": "/iNk3GvWMWm37PjsidHY9M6Unmwm.jpg",
               "id": 9126,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Lescovar",
               "gender": 2,
               "credit_id": "52fe471e9251416c7508e491",
               "name": "Franco Nero",
               "profile_path": "/lwXfTQrFqAw4zcVjrhgq3THfWCg.jpg",
               "id": 22383,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Weaver",
               "gender": 0,
               "credit_id": "52fe471e9251416c7508e495",
               "name": "Carl Weathers",
               "profile_path": "/xOpDfVa83R1EdiNkWPNITfCH67e.jpg",
               "id": 1101,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Drazak",
               "gender": 0,
               "credit_id": "52fe471e9251416c7508e499",
               "name": "Richard Kiel",
               "profile_path": "/wop4KV2ywl6gdYnCUs1OthtGylM.jpg",
               "id": 10460,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Petrovitch",
               "gender": 2,
               "credit_id": "52fe471e9251416c7508e49d",
               "name": "Alan Badel",
               "profile_path": "/77IvpKDvxUqkXnAJxhSNZdelfXv.jpg",
               "id": 39065,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Schroeder",
               "gender": 2,
               "credit_id": "52fe471e9251416c7508e4a1",
               "name": "Michael Byrne",
               "profile_path": "/rmgL88xFEk0iBOcCr7d9V6WfaOi.jpg",
               "id": 742,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Jensen",
               "gender": 2,
               "credit_id": "52fe471e9251416c7508e4a5",
               "name": "Philip Latham",
               "profile_path": null,
               "id": 81247,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Reynolds",
               "gender": 2,
               "credit_id": "52fe471e9251416c7508e4a9",
               "name": "Angus MacInnes",
               "profile_path": "/qftkol8hj7yBBP3KCxRWYkhRyLC.jpg",
               "id": 58475,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Sgt. Bauer",
               "gender": 2,
               "credit_id": "52fe471e9251416c7508e4ad",
               "name": "Michael Sheard",
               "profile_path": "/a29SbacT0kV8WWuoAMp2FHI5Y7I.jpg",
               "id": 70417,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Marko",
               "gender": 0,
               "credit_id": "52fe471e9251416c7508e4b1",
               "name": "Petar Buntić",
               "profile_path": null,
               "id": 113900,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe471e9251416c7508e47d",
               "name": "Guy Hamilton",
               "profile_path": "/nfpwznE0b2NMgoPRsgJoNkRAETD.jpg",
               "id": 9915,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe471e9251416c7508e483",
               "name": "Robin Chapman",
               "profile_path": null,
               "id": 113899,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe471e9251416c7508e489",
               "name": "Alistair MacLean",
               "profile_path": "/u9ryHJIiiikAUn5XhGG20S1W2z8.jpg",
               "id": 67450,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "War",
            "id": 10752
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 7.345469,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 17339,
      "vote_count": 109,
      "budget": 5000000,
      "overview": "Mallory and Miller are back. The survivors of Navarone are sent on a mission along with a unit called Force 10, which is led by Colonel Barnsby. But Force 10 has a mission of their own which the boys know nothing about.",
      "similar": [
         2253,
         613,
         16869,
         5925,
         228150,
         1771,
         339259,
         351339,
         369885,
         409,
         424,
         44943,
         14574,
         637,
         423,
         289222,
         13813,
         8741,
         152760,
         1654
      ],
      "original_title": "Force 10 from Navarone",
      "runtime": 118,
      "poster_path": "/hcvhw7ev8uxtMCtaXG8iWesZ2fw.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [{
         "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
         "name": "Columbia Pictures",
         "id": 5,
         "origin_country": "US"
      }],
      "release_date": "1978-11-01",
      "vote_average": 6.4,
      "belongs_to_collection": {
         "backdrop_path": "/quXPBggya3DoHnxZZ6urOR9e6vR.jpg",
         "name": "Navarone Collection",
         "id": 366826,
         "poster_path": "/vCZqWt03pj8Tydt04H12XiJ0NZk.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Guy Hamilton"],
      "runtime": 118,
      "synopsis": "In 1943, after their successful mission in Navarone, MI6 agents Mallory (Robert Shaw) and Miller (Edward Fox) are sent to find and kill \"Nicolai\". Originally thought to be a traitor who informed the Germans about Miller and Mallory during the Navarone mission, Nicolai is now known to be a dedicated German spy, and is believed to be disguised among the Yugoslav Partisans as a Captain Lescovar (Franco Nero). Mallory and Miller's new mission is to get to Yogoslavia, find Nicolai, and kill him. To get to Yugoslavia the two men pair with \"Force 10\", an American sabotage unit led by Lt. Col. Barnsby (Harrison Ford) and having with its own mission in German-occupied Yugoslavia. To maximize security, Force 10 steals a plane from Termoli Airfield in Italy rather than requisitioning one, but are spotted by US M.Ps before takeoff. Weaver (Carl Weathers), a US Army sergeant under arrest by the MP's, joins with Force 10 and forces his way onto the plane. Barnsby and crew successfully \"escape\" Termoli only to be shot down by German night fighters over Yugoslavia. Only Barnsby, Mallory, Miller, Weaver and Reynolds (Angus MacInnes) manage to escape the crippled plane. On the ground, the five survivors run across a group they believe to be Communist Yugoslav Partisans, their allies. Led by a hulking Yugoslav named Captain Drazak (Richard Kiel), Force 10's rescuers are soon revealed to be collaborationist Chetniks (nationalist Serb guerrillas) under German control. The Germans take the team into custody, but do not know what their mission is. Mallory and Barnsby tell the German commander, Major Schroeder (Michael Byrne), that they are deserters and criminals fleeing Allied authorities. To keep Schroeder from opening Miller's suitcase, which contains his special explosives, Mallory tells him that it contains a \"new\" drug called penicillin. The next morning, the prisoners are told that Schroeder has opened the case, finding it full of firewood. Mallory and Barnsby improvise, \"admitting\" they buried the samples. Schroeder sends Mallory and Barnsby out to retrieve them, under the guard of his concubine, Maritza (Barbara Bach), and three of his soldiers. Miller, Weaver and Reynolds are left in a cell in camp. Far from camp, Maritza kills the Germans, revealing herself to be a partisan spy. She directs Mallory and Barnsby towards the real partisans under the command of her father, Major Petrovich (Alan Badel). Mallory and Barnsby escape, ambushing and killing two of Drazak's Chetniks - men bandaged to hide burns from flamethrowers. Eventually, the two meet a patrol of real Yugoslav Partisans led by a man Mallory recognizes as his target Captain Lescovar, AKA: Nicolai. While Mallory assumes that Lescovar has recognized him, he and Barnsby are nevertheless taken to the partisans. Mallory and Barnsby both realize their location when they recognize a wide river and a large hydroelectric dam near the Partisan camp. Skeptical, Major Petrovich dismisses Mallory's story about Lescovar being Nicolai - assuring Mallory that they had executed the real 'Nicolai' months earlier. He reproves the men for killing the bandaged Chetniks, as the men were partisan infiltrators in the Chetnik camp and his only link to Maritza. Petrovich's principle worry is an impending assault by the Wehrmacht. The Germans are massing their forces nearby, and only a ravine separates as many as three German divisions from the outnumbered partisans. Only a single concrete arch bridge links each side of the ravine, but the partisans have been unable to destroy it. Convinced that no bridge is impregnable, Barnsby reveals that this bridge is in fact Force 10's target. Knowing Miller's expertise in demolitions, Mallory convinces a reluctant Petrovich to help mount a rescue mission using Lescovar and the Partisan Marko (Petar Buntic). The four re-enter the camp at night, Mallory and Barnsby posing as captives and the partisans disguised as the bandaged men. Before they complete their mission, Drazak arrives with the bodies of the real bandaged men and, since Maritza had always been seen with them, concludes she was a partisan as well and savagely beats her up. A gun battle breaks out in the cell block. Schroeder and Reynolds are killed, but Mallory, Barnsby, Miller, Weaver, Lescovar and Marko escape in a truck with a badly beaten Maritza and the recovered explosives. Having made it to the Partisans, Miller reveals that the bridge really is impregnable to explosives. Mallory hits upon the idea of destroying the upstream dam they saw earlier, with the sudden onrush of several millions of gallons of water being enough to destroy the bridge. A night time air drop is arranged to replace Force 10's lost supplies, but Lescovar sabotages the air drop by calling in German planes. Maritza spots Lescovar betraying the partisans, but Lescovar kills her before she can warn the others. German planes bomb the illuminated drop zone. Petrovich, angered by the botched air drop, orders the men to be sent to Marshall Tito's headquarters for transport back to Italy. The team decides to infiltrate the German marshaling yards at Mostar to steal explosives, taking Lescovar and Marko. Lescovar again betrays them alerting a German sergeant to their presence, identifying himself as an Abwehr officer. Marko overhears the plan and sacrifices himself to save the others from the Germans. The others escape with Lescovar aboard a train leaving for Sarajevo. Lescovar's hasty cover story doesn't fool Mallory or Barnsby; Barnsby had observed Lescovar's interactions with the German sergeant who, fatally, salutes the other man even though Lescovar's uniform only made him out to be a corporal; Mallory had noticed a map showing that their train passes within a half-mile of the dam - a fact Lescovar \"neglected\" to bring up. Though Lescovar denies treachery, Mallory is convinced, and he kills Lescovar. Jumping the train near the dam, the team splits up: Miller and Weaver set off diversionary explosives while Mallory and Barnsby sneak into the dam. Weaver runs into Drazak in the woods, and kills him after a knife fight. Mallory and Barnsby set their charges within the dam, but realize that they are out of time. With the German assault only minutes away - they are forced to set a short fuse, leaving them no time to escape. Mallory and Barnsby are caught in the explosion, yet nevertheless survive. The dam appears undamaged, but soon begins to disintegrate; with its barely maintained structural integrity disrupted, the dam wall collapses, releasing millions of tons of water in a wave that topples the bridge. The German assault is thwarted, saving the Partisans. Mallory and Barnsby rejoin Miller and Weaver, but the jubilation is short-lived. Mallory reminds the men that they're now trapped on the wrong side of the river, with no supplies and no way of contacting or reaching the partisans. As the end credits roll, the four men begin a strenuous journey back to friendly lines. In this movie appears Wolf Kahler who will later play Ludendorff, chemist and Fritz Shimon Haber's close friend in Haber.",
      "writers": [
         "Alistair MacLean",
         "Robin Chapman"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0077572/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEyMjE5NzI3Ml5BMl5BanBnXkFtZTcwMTUxNzczNA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Harrison Ford, Robert Shaw, Edward Fox | See full cast and crew »"],
      "reviews": [
         "If you love the \"Guns Of Navarone\" as one of the greatest, and more importantly most literate WWII action films of all time, then this \"sequel\" is really going to cause some painful moments, and I wouldn't recommend watching the two films back-to-back under any circumstances. Owing to the fact that it took original \"Guns\" producer Carl Foreman a decade to get the \"Force 10\" film project off the ground, Gregory Peck and David Niven were both Social Security eligible by the time the film was ready to go, and that meant we'd have to see a new cast. And for the most part, despite the borrowing of footage of the first film's climax at the beginning you might as well watch this film pretending the first one never happened. The \"Nicolai\" connection to the first film is weak and barely explored, and we probably could have done without that plotline altogether. And whereas \"Guns\" was deadly serious in tone, filled with some rich character studies and literate exploration of the moral questions that get raised even when fighting a good cause, \"Force 10\" is really more of an escapist war film, punctuated with moments of light comedy, and with no depth whatsoever in the characters and script. If one is willing to accept the film on that level, then it can be enjoyed as an entertaining diversion, but no more. It is interesting to see Harrison Ford in his first post-Star Wars role working alongside the great Robert Shaw in his last film, and Edward Fox appears to emulate most of David Niven's mannerisms quite well. Carl Weathers though, was an annoying distraction and the scene where he demanded \"answers\" while the enemy was approaching was just plain dumb. By it's very title though, \"Force 10\" is always going to have the problem of it's magnificent predecessor hanging over it. Too bad the sequel possibility wasn't cashed in on sooner when Peck, Niven and Quinn could have still done their parts (I always hoped they'd lead a new mission to rescue Anthony Quayle!)",
         "My Take: Often lambasted, but fast-paced and highly entertaining sequel to the classic adventure film. Honestly, I think \"Force 10 from Navarone\" was more fast-paced, action-packed and hilarious as it's predecessor, \"The Guns of Navarone\", but then, it also lacks the stronger elements that made its predecessor better. But it seems unfair to compare a sequel to its predecessor when the film is a sequel in name only. Other than the opening which re-tracks the memorable final scenes from the original, FORCE 10 FROM NAVARONE mostly flies solo. The cast was excellent. Robert Shaw and Edward Fox are good replacements to Gregory Peck and David Niven in the roles of Keith Mallory and Major Miller. Harrison Ford absolutely amazing as Lt. Col. Barnsby. Carl Weathers is usually out of place, but he's fine enough. While Barbara Bach and Richard Kiel offer fine performances after their roles in \"The Spy Who Loved Me\". There will be a few hate remarks from fans of the original, but seeing it as not a sequel to the classic film and more of a film that uses 'Guns' as its inspiration, this \"sequel\" is fun, exciting and occasionally excellent. Rating: **** out of 5.",
         "Some time after the successful mission to destroy the huge guns on the island of Navarone, Mallory and Miller are sent to Yugoslavia to kill Nikolai, a German agent who nearly blew the Navarone operation, and who has now infiltrated the Partisans. To get there they are attached to Force 10 led by Col. Barnsby, who have their own mission to destroy a vital bridge. From the outset things go wrong, as they steal a Lancaster from an airfield in Termoli, are joined by Sgt. Weaver (escaping US MP's), then get shot down, bail out, and are captured by Chetniks who are loyal to the Germans. By the time this sequel to 'The Guns Of Navarone' was made, 17 years had passed. Gregory Peck and David Niven were too old to reprise their roles, so Robert Shaw and Edward Fox took over. Harrison Ford, fresh from 'Star Wars', played Col. Barnsby, Franco Nero signed on as Nikolai, and Richard Kiel, Barbara Bach, and Carl Weathers all came from recent box office hits - the former two from 'The Spy Who Loved Me', the latter from 'Rocky'. Guy Hamilton was hired to direct (Goldfinger, Battle of Britain, Live and Let Die etc.) This film has been much maligned over the years, somewhat unfairly. It could never hope to emulate its predecessor, and therefore takes a different approach. While 'Guns' had a taut, serious tone, this adopts a more tongue in cheek feel. Some of the interplay between Shaw and Fox is quite deadpan and amusing, with the actors obviously not taking proceedings too seriously. Harrison Ford looks uneasy at the start, but settles into his role as things progress. The use of the stunning Yugoslavian countryside gives the film a unique feel, and it appears to have had a decent budget. The score harks back to the type of Boys Own adventures that were so popular a decade earlier. There are some flaws, yes. Possibly more tension could have been injected at some points, and Mallory seems to have lost the ability to speak fluent German since 'Guns'. It's not in the same league as that film or the marvellous 'Where Eagles Dare', but it's an enjoyable way to pass a couple of hours on a cold, wet winters' night.",
         "I actually saw this movie before I saw \"The Guns of Navarone\", and I have to say, I prefer \"Force 10\". It seems like it always comes on TV on a rainy Saturday afternoon, and I'll always get sucked right in. I've probably seen it about 10 times. Despite some laughable special effects, and otherwise dated production value, this war movie packs a good action punch. Not many WW2 movies are set in Yugoslavia, and that's one of the interesting elements of the film. The story itself is a classic \"Against the Odds\" type affair, involving a covert Allied mission with a dual purpose. The great Robert Shaw is a standout, and a young Harrison Ford shows why he eventually became the superstar he is. Rousing music, tense action sequences, shootouts, knife fights, bombings,rescues,deceit and trickery make \"Force 10\" a lot of fun.",
         "In the late 70's the war genre saw a revival and Harrison Ford starring in not one but two movies of the period, the romantic drama HANOVER STREET (1979) with Lesley-Anne Down and the more commercial FORCE 10 FROM NAVARONE (1978). Over the years, the film has got some unfair press in my view and is regarded as sub-standard compared to the infinitely more successful GUNS OF NAVARONE. However, the chemistry of all concerned is just right for this film, which involves a group of soldiers trying to blow up a bridge in Yugoslavia and the search for a traitor from the original film's mission. There are some good action sequences, and the dialogue exchanges between Ford, Edward Fox and the late Robert Shaw are passable. Carl Weathers (coming quick off ROCKY), racism issue aside, still seems out of place in the film, although he has one or two good moments. Barbara Bach and Richard Kiel, hot off THE SPY WHO LOVED ME, are stereotypes. Ron Goodwin's score keeps the film moving.",
         "FORCE 10 FROM NAVARONE...I don't know what to say apart from the fact that I enjoyed it as a kid, and I'm looking forward, in years to come, to sitting down with my son (now 2) and watching it with him. With the exception of the original Navarone, and WHERE EAGLES DARE, FORCE 10 is far-and-away the greatest book-to-movie translation in it's genre. The critics got it wrong, they always do!(How many people saw Titanic because they said it was so great? They didn't mention the steam coming from a decorative smoke stack, or the digital watches, did they?!) FORCE 10 generally has a good feel about it, it isn't too serious. Shaw, as he'd proved with JAWS and THE STING, was the contender for one of the greatest British actors ever, only Burton or Olivier have been close to that title. With the recent success of Shaw's JAWS and, obviously, Ford's STAR WARS, it was prime casting...no question. Don't take it to seriously, and with the fast-paced story, Top-Notch cast and brilliant Ron Goodwin score...you should really enjoy it, if you like the genre! Roll on six or seven years time, my son is in for a treat!!!",
         "This is a pretty solid World War II movie, a belated followup to the very successful (and, yes, better) \"The Guns Of Navarone.\" This time a force, mostly British soldiers but led by a young American colonel (Harrison Ford) is sent over to Yugoslavia to blow up a bridge the Nazis use. In addition, two other Brits (Robert Shaw and Edward Fox) go along on another assignment to kill a double agent. Well, half of the team is shot down before they even reach their destination as their airplane is crippled. They are killed in air-fire or upon landing on the ground. That leaves just a small group, the above-mentioned stars of the movie plus an addition, Carl Weathers (of \"Rocky\" fame) picked up on the ground, and the double-agent (well-played by Franco Nero) who is assigned to go with them after he is \"cleared\" of charges. Anway, this re-assembled team goes on to complete their mission, or at least attempt to and are thwarted numerous times by sabotage. I won't give away the ending. Overall, a good story and definitely worth a rental and possibly a purchase. The DVD transfer was a bit grainy at first but got better as the film went along.....as the story did.",
         "World War II has spawned so many stories, films, books, songs, TV shows, from garbage to genius, that one could easily spend an a lifetime absorbed in them. Here is a basic WWII movie that tells a very straight forward story about a small group of soldiers trying to blow up a bridge in enemy held territory. It doesn't try to be Bridge on the River Kwai, another film where a small group of special forces travel (on foot I might add) to destroy a bridge important to the enemy forces. On the plus side is that the action takes place in Yugoslavia, not the setting of too many war movies made in Hollywood, so that gives this some interesting moments (how many movies have Croatian Chetniks in them?). Also, Robert Shaw, good in anything, and Edward Fox have a great rapport, trading lines with impeccable timing. It would be easy to believe they are lifelong friends in real life the way they portray their characters. Harrison Ford gives a solid performance as a young overachieving officer, helping the subplot of the new blood clashing with the old veterans. Barbara Bach is beautiful, but not much other reason for her to be around. Carl Weathers actually gives a nice performance as the rebellious black soldier, implausibly brought along by weirdly improbable circumstances. Facing the fact that the Armed Forces were segregated during WWII, it seems like the makers wanted to have a black included in the movie and had to make up some way to do that, coming up with a ridiculously contrived way to have him along. It's unfortunate they couldn't come up with something better because, though Weathers is likable and his character brings something to the party, they way they did it undermines the plotline. The action is okay, though the payoff at the end, clever as it is, ultimately fails because of the special effects--they just weren't that well done; they seemed like they came from a grade b movie. If you've seen some WWII movies like A Bridge Too Far, Kelly's Heros, Battle of the Bulge, the Devil's Brigade, or Where Eagles Dare and liked them, definitely give this one a try. Not a classic, but a decent addition to the crowd.",
         "I just saw this movie on cable again last night for the umpteenth time and was reminded of why it is one of my all-time favorites. While hardly a masterpiece of cinema, Force 10 is a well-paced war adventure/buddy picture that doesn't take itself too seriously and really tries it's best to entertain the audience. It's just an awful lot of FUN. The plot concerns a mismatched group of commandos who are sent into Nazi-occupied Yugoslavia in order to kill a very elusive enemy agent and destroy a strategically vital bridge. There are lots of enjoyable plot twists and the action scenes are very well-staged. Given that this was released in 1978, the special effects are decent too. By 1970s standards, the cast is also pretty high-powered including Robert Shaw (R.I.P), a post-Han Solo Harrison Ford, Seventies uber-babe Barbara Bach, and the wonderful Edward Fox as the aristocratically eccentric explosives expert Miller (definitely my favorite character in the film). If you are looking for deep and meaningful ponderings on the nature of war and suchlike, then go someplace else. If you want a top-notch WW2 popcorn movie then you really can't do much better than this. BTW the original book by Alistair MacLean is a good read also.",
         "Force 10 felt like a James Bond reunion. The director is Guy Hamilton (Goldfinger, Diamonds Are Forever, Live and Let Die, The Man With the Golden Gun). Robert Shaw (From Russia With Love) is the star. Barbara Bach (The Spy Who Loved Me) is a love interest. Even Richard Kiel (Jaws in The Spy Who Loved Me) is here as a heavy. Unfortunately this film is not as enjoyable as a typical Bond film not to mention equaling or surpassing the Gregory Peck classic, The Guns of Navarone, to which it is a followup. The film is not an entire waste however. A young Harrison Ford is very convincing action star even here and is almost enough to save this disappointing effort. The only really gripping part of this film was the racial tension between Keil's character and Carl Weather's (Predator) character. Average film, 6/10. This review was based on the widescreen version on the DVD which had a few extra minutes."
      ],
      "genres": [
         "Action",
         "Drama",
         "War"
      ],
      "productionCompanies": [
         "Columbia Pictures Corporation",
         "Navarone Productions",
         "American International Pictures (AIP)"
      ],
      "summaries": [
         "Mallory and Miller are back. It seems that there was traitor with them at Navarone, whom they thought was executed. But it seems that not only was he not executed, and he was not a traitor but a German spy. Intelligence believes he made it to Yugoslavia and is now with the Partisans. So, Mallory and Miller being the only ones who can positively identify him are sent along with a unit called Force 10, which is led by Colonel Barnsby, who objects to their presence. It seems that Force 10 has a mission of their own which Mallory and Miller know nothing about. When their plane is shot and most of the team is killed, they mistakenly believe that some of the locals they meet are Partisans but in reality are German Allies, so they are taken prisoner, and have to convince the German commander that they are not spies or else they will be killed.",
         "In the darkest days of World War II, Hitler's armies are storming through Europe, annihilating all opposition in their path. But U.S. Colonel Barnsby plots to strike a crippling blow to the brutal Nazi forces. To succeed, he'll need the help of the most skilled and lethal soldiers in the world: the Force 10 squad, fresh from its triumphant mission at Navarone. But when the team's plan goes awry in a firestorm of blistering battles, Barnsby and the squad's hard-driving Major Mallory are forced to devise a new and even more dangerous scheme to attack the Nazi war machine . . . or risk losing the rest of Europe to its awesome, destructive power.",
         "During World War II, several oddly assorted military experts are teamed in a mission to raid and destroy a bridge vital to enemy strategy."
      ],
      "budget": 5000000
   },
   "movielensId": 3519,
   "movielens": {
      "languages": [
         "English",
         "Español"
      ],
      "releaseDate": "1978-11-01",
      "dvdReleaseDate": "2000-03-28",
      "directors": ["Guy Hamilton"],
      "runtime": 118,
      "movieId": 3519,
      "title": "Force 10 from Navarone",
      "mpaa": "PG",
      "actors": [
         "Harrison Ford",
         "Robert Shaw",
         "Barbara Bach",
         "Edward Fox",
         "Franco Nero",
         "Carl Weathers",
         "Richard Kiel",
         "Alan Badel",
         "Michael Byrne",
         "Philip Latham",
         "Angus MacInnes",
         "Michael Sheard",
         "Petar Buntic"
      ],
      "imdbMovieId": "0077572",
      "originalTitle": "Force 10 from Navarone",
      "genres": [
         "Action",
         "Adventure",
         "War",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "Ho6FFhtTfkI",
         "W8IeyxgPpxY"
      ],
      "plotSummary": "Mallory and Miller are back. The survivors of Navarone are sent on a mission along with a unit called Force 10, which is led by Colonel Barnsby. But Force 10 has a mission of their own which the boys know nothing about.",
      "tmdbMovieId": 17339,
      "avgRating": 3.30208,
      "releaseYear": "1978",
      "numRatings": 1104,
      "posterPath": "/hcvhw7ev8uxtMCtaXG8iWesZ2fw.jpg"
   }
}