{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "black people",
            "id": 577
         },
         {
            "name": "1970s",
            "id": 1228
         },
         {
            "name": "jazz musician",
            "id": 3017
         },
         {
            "name": "dysfunctional family",
            "id": 10041
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "teacher",
            "id": 10508
         },
         {
            "name": "urban",
            "id": 10616
         },
         {
            "name": "parenthood",
            "id": 11093
         },
         {
            "name": "street kid",
            "id": 193430
         }
      ],
      "imdb_id": "tt0109504",
      "video": false,
      "title": "Crooklyn",
      "recommendations": [
         49471,
         34006,
         34322,
         117129,
         26156,
         36739,
         41480,
         82545,
         43812,
         22289,
         43269,
         32686,
         157036,
         39125,
         41823,
         24664,
         24081
      ],
      "backdrop_path": "/fRzBLTKVNJ9Ymrb4jQHSV9CSCtz.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Carolyn Carmichael",
               "gender": 1,
               "credit_id": "52fe45589251416c9102f171",
               "name": "Alfre Woodard",
               "profile_path": "/aCAjUOrV2WG3OaLUvQHVkyk8S2P.jpg",
               "id": 1981,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Woody Carmichael",
               "gender": 2,
               "credit_id": "52fe45589251416c9102f175",
               "name": "Delroy Lindo",
               "profile_path": "/uhjdTemc2kYbQj47bVqRb7OdVjH.jpg",
               "id": 18792,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Tony Eyes / Jim",
               "gender": 2,
               "credit_id": "52fe45589251416c9102f179",
               "name": "David Patrick Kelly",
               "profile_path": "/ujvmeyBvEJ7gkvww0OYDBlbxOTT.jpg",
               "id": 1737,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Troy",
               "gender": 1,
               "credit_id": "52fe45589251416c9102f17d",
               "name": "Zelda Harris",
               "profile_path": null,
               "id": 112037,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Clinton",
               "gender": 2,
               "credit_id": "52fe45589251416c9102f181",
               "name": "Carlton Williams",
               "profile_path": null,
               "id": 112038,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Wendell",
               "gender": 2,
               "credit_id": "52fe45589251416c9102f185",
               "name": "Sharif Rashed",
               "profile_path": null,
               "id": 46396,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Joseph",
               "gender": 0,
               "credit_id": "52fe45589251416c9102f189",
               "name": "Tse-Mach Washington",
               "profile_path": null,
               "id": 112039,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Nate",
               "gender": 2,
               "credit_id": "52fe45589251416c9102f18d",
               "name": "Christopher Knowings",
               "profile_path": null,
               "id": 112040,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Tommy La La",
               "gender": 2,
               "credit_id": "52fe45589251416c9102f191",
               "name": "José Zúñiga",
               "profile_path": "/uD8aacPO6Zqsr4f3yAkqgT6G4wS.jpg",
               "id": 10963,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Vic",
               "gender": 2,
               "credit_id": "52fe45589251416c9102f195",
               "name": "Isaiah Washington",
               "profile_path": "/kK4nEwvY0MFwCsQ17E0w0El7G9P.jpg",
               "id": 21353,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Jessica",
               "gender": 0,
               "credit_id": "52fe45589251416c9102f199",
               "name": "Ivelka Reyes",
               "profile_path": null,
               "id": 112041,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Snuffy",
               "gender": 2,
               "credit_id": "52fe45589251416c9102f19d",
               "name": "Spike Lee",
               "profile_path": "/2LmTDMa6ewhkyP4LDBWFdDYDfUv.jpg",
               "id": 5281,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Hector",
               "gender": 2,
               "credit_id": "52fe45589251416c9102f1a1",
               "name": "Manny Pérez",
               "profile_path": "/hIM6huonhBNgxwfKc7t23pW60Ns.jpg",
               "id": 72983,
               "order": 12
            },
            {
               "cast_id": 14,
               "character": "Neighbour",
               "gender": 2,
               "credit_id": "52fe45589251416c9102f1a5",
               "name": "Richard Whiten",
               "profile_path": "/qqyO4jSRT4X6OszqkO5oroIhKHm.jpg",
               "id": 112042,
               "order": 13
            },
            {
               "cast_id": 15,
               "character": "Bodega Woman",
               "gender": 2,
               "credit_id": "52fe45589251416c9102f1a9",
               "name": "RuPaul",
               "profile_path": "/gNwa8c7XmYWXxa0i9fGF3OXazL4.jpg",
               "id": 78589,
               "order": 14
            },
            {
               "cast_id": 18,
               "character": "Cornell",
               "gender": 0,
               "credit_id": "55036f7dc3a36862da0000d8",
               "name": "Keith Johnson",
               "profile_path": "/k68JrXQzCiDaZgyZ1jKCoO8m5wN.jpg",
               "id": 1234850,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45589251416c9102f1af",
               "name": "Spike Lee",
               "profile_path": "/2LmTDMa6ewhkyP4LDBWFdDYDfUv.jpg",
               "id": 5281,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45589251416c9102f1b5",
               "name": "Cinqué Lee",
               "profile_path": null,
               "id": 13603,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "578525bd92514137c20047ee",
               "name": "Joie Lee",
               "profile_path": "/oWREZ1vjXxycfdwV5wlDwqZnODo.jpg",
               "id": 13602,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 3.440352,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 34152,
      "vote_count": 39,
      "budget": 0,
      "overview": "From Spike Lee comes this vibrant semi-autobiographical portrait of a school-teacher, her stubborn jazz-musician husband and their five kids living in '70s Brooklyn.",
      "similar": [
         68924,
         873,
         52449,
         437670,
         233063,
         400928,
         527,
         27586,
         44945,
         103663,
         7340,
         1444,
         11564,
         9451,
         13008,
         18148,
         20178,
         7214,
         8841,
         26405
      ],
      "original_title": "Crooklyn",
      "runtime": 115,
      "poster_path": "/iFqe07F78SO0SIBzWcK4I5MwNvP.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "40 Acres & A Mule Filmworks",
            "id": 4319,
            "origin_country": ""
         },
         {
            "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
            "name": "Universal Pictures",
            "id": 33,
            "origin_country": "US"
         }
      ],
      "release_date": "1994-05-13",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Spike Lee"],
      "runtime": 115,
      "synopsis": "Set in the early 1970s in a racially mixed New York City neighborhood, nine-year-old Troy (Zelda Harris) and her older brothers Clinton (Carlton Williams), Wendell (Sharif Rashed), Nate (Chris Knowings), and her younger brother, Joseph (Tse-Mach Washington) are introduced as their father Woody (Delroy Lindo) is blowing a horn to call them in from playing to eat dinner. Their mother, Carolyn (Alfre Woodard) is introduced as well. Dinner takes place during which we find out that the Carmichaels' next-door neighbor, \"Tony Eyes\" (David Patrick Kelly) seems to be somewhat of a nuisance to the family, which includes continuously singing while they are eating dinner. During the dinner, Carolyn tells the children to clean the kitchen before they go to bed as she is going out with Woody for the night and the children need to start pulling their own weight. Troy urinates in her brothers' room while she is asleep, but Nate wakes her up. Carolyn comes home and comedically wakes all of the children up out of their sleep because the kitchen was not cleaned. There's some argument naturally on the part of the children to which Clinton says, \"I'd rather have a father than a mother any day\". The neighborhood junkie drug dealers are introduced: Snuffy (Spike Lee) and Right Hand Man (N. Jeremi Duru), who are glue sniffers. Tommy La La (José Zúñiga), Clinton, Nate and a couple of their neighborhood friends are sitting on the Carmichael stoop while listening to the radio and playing a baseball board game. Tommy La La takes a bottle and throws it at the door of Tony Eyes while yelling homophobic slurs. This starts an argument because Clinton says the Carmichael children always get blamed for the mess on his property. The argument ends as Vic Powell (Isaiah Washington), a Vietnam war vet, comes home and greets everyone. Vic is renting the upstairs apartment from the Carmichaels. Troy and her friends are sitting on a stoop at the same time having on and off arguments before deciding to jump-rope. Some neighborhood boys lure a cat away from a doorstep while the girls are jump-roping. One kid swings the cat over his head by its tail and throws it on one of the girls. This starts another argument and shoving match between the girls and the boys. Troy singles out one the boys, Greg (Peewee Love) for being a \"welfare case\" and calls him a \"stupid ass dummy.\" Nate is sitting at the table with Carolyn standing over him waiting for him to finish his black-eyed peas. Woody comes home with ice cream and sand cake for dessert. Nate is happy until Carolyn tells him that he isn't getting any dessert until he finishes his black eyed peas. This causes his brothers to make fun of him and rub it in his face telling him how good their cake is. Joseph's cake is eaten by the family dog Mutley, so Nate's piece of cake is split in half by Woody to share between Nate and Joseph. Carolyn, tired of standing at the table waiting for Nate to eat, tells him one last time to finish his black-eyed-peas. Nate finally takes a bite of them and promptly throws up, which causes everyone runs from the table. Wendell is taking the trash out and decides to take some of it in Tony Eyes' area. Carolyn comes out to see what is wrong, and Tony Eyes tells her that Wendell and her kids are always throwing trash into his area. Carolyn responds by telling him that he and his home are nasty. The arguments continue as the neighborhood kids jump in. Tony Eyes is still yelling and arguing when Vic comes downstairs and tells him to shut up. In anger, he punches Tony in the face and goes back into the house. Troy sneaks out and goes to the corner store to get candy. While in the store, she is intrigued by a woman (RuPaul) and one of the store owners dancing erotically in the store. As Troy leaves the store to walk back home, she sees Vic getting arrested for punching Tony Eyes. Troy gets back home and her brothers bully her into sharing her candy. Clinton and Wendell want to watch the Knicks game but because they are outnumbered, they are stuck watching The Partridge Family which they dislike. Troy and her friend, Minnie (Tiasha Reyes), go to the neighborhood store where Minnie steals an ice cream bar by putting it under her shirt and walking out. Troy tries to do the same thing with a bag of potato chips, but she gets caught. The boys are sitting in Troy's room watching the Knicks game while Troy is in the bathroom stuffing her shirt with toilet paper. Woody and Carolyn are downstairs arguing because Woody's music is not providing for the family and Carolyn, a schoolteacher is the sole provider. They are also arguing because Woody caused the family to have bounced checks. The argument escalates as Carolyn yells upstairs for the children to turn off the TV because it is a school night. She charges upstairs with Woody following and turns off the TV. A defiant Clinton argues with Carolyn and turns on the TV. Carolyn grabs him up for disobeying and disrespecting her and Woody grabs her and carries her out of the room. Everyone is in on the fight as Woody is dragging Carolyn down the stairs and Nate is jumping on Woody's back. The other children have a hold of Carolyn pulling her in the opposite direction and Carolyn hurts her ankle in the struggle. Woody yells and everyone gets quiet as he expresses his need to respect for his work in the house. Carolyn kicks him out of the house. Woody comes over the next morning and brings flowers for Troy to give to Carolyn. Troy suggests that Woody ask Carolyn out on a date. Troy brings the flowers to Carolyn, who is still in bed and hurt, and asks Carolyn for a quarter. The next scene shows Troy searching the house for money and she goes into Clinton's room and finds his buffalo nickels and takes them all for cash, as well as taking his Knicks tickets for starting the fight between their parents. With the stolen money, Troy buys herself and Minnie ice cream cones. Clinton comes home and upon discovering his tickets are gone confronts Troy about them. She gives them back but also tells him that she spent \"those funny looking nickels of yours also.\" After coming in from playing outside, Troy is confronted by Carolyn about the nickels to which Troy lies to her twice. While Troy is in the bathroom, Greg comes to Carolyn who is sitting by the window and tells her all the mean things that Troy has been saying about him. Troy has to apologize to him for all the ugly things she said about him. Carolyn sends Troy to the store to get dinner with food stamps. Troy, embarrassed, doesn't want to go. In the store, Tory steals a package of meat and 6 cloves of garlic by hiding them in her shirt so she won't have to use food stamps. She witnesses a neighborhood girl, Peanut (Kewanna Bonaparte) getting caught for shoplifting. As Troy leaves, she is attacked by Peanut, but the grocer breaks up the fight and Troy heads for home, without the food stamps. That night, Troy has a nightmare that Snuffy and Right Hand Man make her get high. She wakes up in a sweat with Woody wiping her face, assuring her that everything is going to be ok. Woody and Carolyn get back together and they all decide to go on a trip to get out of the neighborhood but as they are leaving a worker from Con Ed comes by to shut off the electricity because the bill is unpaid. The trip is postponed and because of the situation, the family has to use candles for light. A few days later, the family leaves Brooklyn to take Nate and Troy down South to stay with relatives. Troy stays with her cousin Viola (Patriece Nelson), who was adopted by Uncle Clem (Norman Matlock) and Aunt Song (Frances Foster). Troy doesn't want to stay, but she does it to appease her mother. Troy eventually starts having fun with Viola despite a dislike of Aunt Song and her beloved dog, Queenie. On Troy's 10th birthday, she gets a letter from Carolyn (who narrates it) telling her about the happenings in the neighborhood since the weeks she's been away. After reading the letter, Troy decides she wants to go home. Meanwhile, Aunt Song has been looking for Queenie all day, but to no avail. Later that day, Troy has a birthday party. Upset because she hasn't found Queenie, Aunt Song snaps at two of Troy's birthday\\sleepover guests as she pulls the couch out for them to sleep on. When she opens the couch, a dead Queenie (likely killed by Viola) pops out which deeply upsets Aunt Song. Troy later goes home and is picked up from the airport by her Aunt Maxine (Joie Lee) and Uncle Brown (Vondie Curtis-Hall). Aunt Maxine and Uncle Brown don't tell Troy at first how Carolyn is, but Troy figures out that Carolyn is ill. She visits Carolyn in the hospital, who is weak and ill from cancer. Later, Woody takes Troy home and Troy decides to clean & mop the kitchen without being told. Later that evening, Woody tells the kids that Carolyn's condition is not well and she has to stay in the hospital for more tests. The boys cry, but Troy remains silent. In the next scene, it is presumed that Carolyn succumbed to her illness. Nate and Joseph are walking up some stairs with Troy following behind, singing a Christian song she learned from Viola. Joseph says, \"I hope we don't have to dress up for Mommy's funeral.\" As Troy watches television, Aunt Maxine comes in with clothes and shoes for Troy to wear at the funeral. Troy doesn't say anything until Aunt Maxine tries to coax her into putting on the clothes. Troy's response is that her mother would never let her wear polyester. When Woody tells Troy it is time to go to the funeral, Troy tells him she is not going. Woody has a talk with Troy, convincing her to go to church because it's what Carolyn would've wanted. At the house gathering after the funeral, Clinton and Troy have a moment when he tries to get Troy to talk, and holds her hand because she's unresponsive to everyone else around her. Joseph comes inside crying, saying that Snuffy and Right Hand Man are making fun of him saying, \"His mama's dead, his mama's dead\" and they robbed him. Following her mother's wishes to protect her younger brother, Troy goes outside with a baseball bat and hits Snuffy in the head. When Snuffy asks her why she did it, Troy tells him, \"I'm tired of you and Right Hand terrorizing the neighborhood. Go sniff on your own block.\" In the middle of the night, Troy is sleeping, but she is restless as she dreams she's hearing her mother's voice shouting. She goes downstairs to tell her mother to please stop fighting only to find that it is her father who is making a lot of noise trying to kill a rat in the kitchen. Woody tells her that her mother is gone and that it's ok to cry. Troy runs to the bathroom and throws up as Woody comes into the bathroom to console her. Troy tells him that she wants to stay with him and not move away with her Aunt Maxine and Uncle Brown. Troy asks Woody if Carolyn was in a lot of pain, and he tells her that she was. Troy states, \"Then it's good that she died so she wouldn't suffer anymore. There are scenes of the neighborhood continuing to play much like the beginning of the movie. Troy is sitting in Carolyn's chair with Joseph sitting on her while she combs his hair the way Carolyn did. Then, Carolyn is sitting the stoop seemingly narrating a letter she wrote to Troy telling her she can't believe that she's 10 now, that she misses her very much, and how she's proud of the way she's growing up. The memory is interrupted when the neighborhood kids come to the window and asks Troy if Joseph can come out and play. Troy tells him not to go far because dinner is almost ready. The last scene is of the neighborhood being watched by Troy as she's looking out the window much like Carolyn used to do.",
      "writers": [
         "Cinqué Lee",
         "Joie Lee"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0109504/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIxMzI2OTYzM15BMl5BanBnXkFtZTYwOTM4Mjg5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Alfre Woodard, Delroy Lindo, David Patrick Kelly | See full cast and crew »"],
      "reviews": [
         "I didn't hear much about this film when it was released, but the general consensus was that it was one of Spike Lee's minor efforts. That said, I've just caught it on late night TV and I was impressed with what I saw. Crooklyn tells the story of a family of seven in early seventies Brooklyn from the perspective of the only daughter and, er, that's about it. But I was amazed at how much of this film 'rang true' considering the number of oddly filmed, surreal scenes (the glue-sniffing scene near the start was fantastic). I think it works because of the uniformly excellent performances and spot-on art direction, but also because of the characters themselves. Everyone is different in subtle ways, and they seem like a real community instead of a bunch of strangers who dress the same like in other movies. I do agree with one of the criticisms posted here: Crooklyn is about 15 minutes too long. Also, Lee is harder on Aunt Song than on the other characters, and I could never quite work out why. The (simulated) cruelty to animals was also a shame from my perspective because it threw me out of the movie; I have trouble concentrating on the story when I see animals being mistreated. But these are minor quibbles because Crooklyn features many beautifully observed moments of family life, and for non-Americans like me the wonderful vintage television (\"Afro-Sheen!\") is the icing on a very satisfying cake. Highly recommended.",
         "This was the first movie done by Spike Lee that I have ever seen, and I saw this movie by accident. Out of all of his films, why is this one of the least known? It is worth seeing, because so many things work. It's definitely one of the most thematic movies I have ever seen, and I can definitely relate to many of Spike Lee's memories. It is sad, but it is also hopeful. Alfre Woodard was awesome, and I definitely think that she is one of the best unrecognized actresses in the US today. Delroy Lindo played his character well too. The relationship between Troy and her brothers was especially memorable and so universal! The best scenes in the movie showcase the children in front of the television. This movie was on the verge of greatness but it didn't capture it just because some parts of the movie were melodramatic and drawn out. The movie itself was about 15 minutes too long.",
         "CROOKLYN isn't Spike Lee's greatest, but it comes very close. Parts of the film hit so close to home with me - the sense of community so vividly depicted, and the 70s soul music (which is nearly ubiquitous through CROOKLYN) makes this film something much like a musical, with the grit and intimacy of Lee's visual realism constantly balanced against the idealism and romanticism of the music. As slice-of-life Americana, this is about as good as it gets. I disliked the scenes with the Aunt & Uncle - I felt that they were being ridiculed mercilessly, for no good reason (they are the living embodiment of the idealism contained in at least some of the music heard at other times in the film, whether they know it or not), and I wished those scenes were handled with more subtlety - Lee, like his NYC bretheren Martin Scorsese and Woody Allen has major issues with suburban types (this hits a peak in Lee's later BAMBOOZLED - an almost brilliant, but also almost cruel expression of rage at the excesses of the entertainment industry that also aimed merciless fury at uncritical audiences - audiences of any and every race and class). But this scene aside, the remainder of CROOKLYN is so strong, and very well-made - I'd still offer a recommendation.",
         "Crooklyn is an engaging film that stands out in Spike Lee's filmography, not only for Lee's seamless storying of everyday life in 70's Brooklyn, but also because of his interesting and innovative cinematic imagery. The cinematography Lee employs in Crooklyn helps to create fantastic -sometimes even cartoon-like- environments in which his characters spring to life and thrive. His dollying techniques (placing actors on dollies), lens choice, and manipulation of color conspire to add special characteristics to this film. This is a great film to watch not only for Lee's ability to highlight the beauty of the quotidian in his storytelling, but also for the aesthetic qualities that Lee produces with his rich filmic vocabulary.",
         "I remember seeing an interview with Neil Simon once who said that he remebers that during the run of his play \"Brightom Beach Memiors\", a black usher would crack up at every performance. When Simon asked him why he laughed at every performance, the usher told him \"That's my family.\" \"Crooklyn\" had the same effect on me. Just as a black ushers family must have been light years away from a pre war Jewish family in Brightom Beach, I can assure you that my childhood was lightyears away from the Charmichles. True, I grew up in Brooklyn, but I grew up in a upper middle class white neighborhood in the early eighties. This world was light years away from the world of Lee's film, but certain aspects of childhood ring true wether your from Sachrimento or Siagon. I think this is Spike's best film after \"Do The Right Thing\". In some ways even better. It's one of the best films ever made about childhood. You have the joy of staying up late and watching \"The Partidge Family\". The pain of losing your Mom and having your Dad thrown out of the house. The humor, as when one of the boys hits a girl with a cat. This is a magical movie in all respects.",
         "I thought this was a very personal, heartwarming and funny movie that also touched on very real social issues. It deals with the complications involved in family life like love, break up, sibling rivalry and making ends meet while also trying to lead a happy fulfilling life. It deals with the pains of loss and of struggle, the issues facing urban communities....self-perceptions and growing. Spike does all of this while giving a light and loving perspective to some hard issues. It is comical and endearing as you see all of these situations played out through the eyes of a young girl, trying to grow up. The odd struggle and perceptions of reality that we all face coming up...the embarrassment of a family, the neighborhood bully, etc....all gets played out in this summer classic. --Not to mention the cinematography is wonderful and interesting.",
         "Ahhh who can forget the good Ol' days of Spike Lee films that had heart as well as insight? Who can forget this gem? Crooklyn is loosely based on Spike Lee's life growing up. Its mostly a story that mostly details the struggles of a family growing up in Brooklyn as seen through the eyes of Troy(played by Zelda Harris). There are beautiful performances to be seen here. Alfre Woodard's presence is felt as the stern but loving mother of four kids and Delroy Lindo's is great as the father who is also dealing with pressure as a struggling musician and trying to pay the rent on time. They go through the normal strife that any black family has to go through in poor areas but they still find a way to maintain. I remember as a kid that the last scene with the mom passing on had me choked up. Troy and her brother holding hands at the reception for the funeral was a touching scene too. They drove each other crazy but it was still love in the end. Crooklyn has brief moments of awareness like one scene in particular: Troy's aunt comparing troy's hair to her adopted child's hair saying that the adopted child's hair was good hair and that Troy's hair was rough was a subtle form of self-hatred but most people wouldn't pick up on that. Of course Spike Lee has to make an appearance in the movie. He plays a junkie who chases kids around trying to steal money from them. In short Crooklyn stands out as one the best dramas of all time and one of Spike Lee's best work. The characters are ones that you care about, their struggles are real and anybody who has been there can also relate. Two thumbs up for Spike Lee's work of art on film.",
         "Growing up as a teen in today's age ( I'm 18 ) I love watching movies that take place in the 60's and 70's that showcase what it was like growing up in those days.\"Now and Then\" \"Cooley High\" and \"Dazed and Confused\" ring a bell when it comes to this genre . \"Crooklyn\" has to be one of my favorites out of this group of movies because of the bittersweet story of an interesting enjoyable lead character Troy (Zelda Harris). This young lady bought something special to the movie along with Alfre Woodard and Delroy Lindo. The movie starts off to be a fun loving look in the eyes of Troy. While she goes through dealing with her annoying brothers, her parents marital issues, and just being a kid in Brooklyn. The entire movie had me laughing from the beginning to when Troy stays with her southern family members. Even though the distorted camera work is annoying, those were my favorite scenes in the movie. The movie takes a change of pace when Troy returns to NYC to find out her mother is sick with cancer. The lightheartedness of the movie is replaced by sadness when her mother dies. The scene at the funeral when Troy's older brother sits next to her and holds her hand was one of the most touching scenes in the movie. Despite the death of her mother (which was very sad) the ending wasn't exactly displeasing because in the end Troy had a father who truly loved her and her brothers. I kinda felt that in the long run Troy and her family would make it through in life with their mother's memories and what they learned from her. This movie will continue to be one of my favorite movies ever. The characters, comedy, and charm of this movie will make it a good one for viewing pleasure.",
         "Although I wouldn't say this is a great Lee film, it is still very solid. There isn't a story as such, instead it is a love letter to childhood and family life in Brooklyn. Imagine Radio Days, including the sentimental streak. The actors are great and this movie only goes to prove that Delroy Lindo is one of the best actors around. Zelda Harris as the young girl, Troy, is also brilliant. Alfre Woodard is the pivot of the film, around which most of the film revolves around - even if she has less than Troy. Tonally the film doesn't quite click. Sometimes the original music is quite sour and does not fit with the images. Some scenes seem forced. But the amazing soundtrack helps put things right. Even though the film isn't perfect, it has a great soundtrack and a very unique take on things.",
         "I love this movie. It reminded me of when I was a young girl growing up in the 70's. We should have more movies like this one. Good work Spike. I watch this movie with my two children who was born in the early part of the 80's and they enjoyed it as well, asking me all kinds of questions,Brought a smile to my face as I told them about me and my siblings growing up in the 70's. You can actually see how times has change, making up your own games and finding some positive things to do with your time.Like playing jump rope.what about marbles or Jacks. Do they even make them anymore? Then I really love the part when Mom came home and woke up everyone in the house.Now that was a blast from the past."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Universal Pictures",
         "40 Acres & A Mule Filmworks",
         "Child Hood Productions"
      ],
      "summaries": ["From Spike Lee comes this vibrant semi-autobiographical portrait of a school-teacher, her stubborn jazz-musician husband and their five kids living in '70s Brooklyn."],
      "budget": 14000000
   },
   "movielensId": 352,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-05-13",
      "dvdReleaseDate": "2003-04-01",
      "directors": ["Spike Lee"],
      "runtime": 115,
      "movieId": 352,
      "title": "Crooklyn",
      "mpaa": "PG-13",
      "actors": [
         "Alfre Woodard",
         "Delroy Lindo",
         "David Patrick Kelly",
         "Zelda Harris",
         "Carlton Williams",
         "Sharif Rashed",
         "Tse-Mach Washington",
         "Christopher Knowings",
         "José Zúñiga",
         "Isaiah Washington",
         "Ivelka Reyes",
         "Spike Lee",
         "Manny Pérez",
         "Richard Whiten",
         "RuPaul",
         "Keith Johnson"
      ],
      "imdbMovieId": "0109504",
      "originalTitle": "Crooklyn",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["KnYl1TfWD-U"],
      "plotSummary": "From Spike Lee comes this vibrant semi-autobiographical portrait of a school-teacher, her stubborn jazz-musician husband and their five kids living in '70s Brooklyn.",
      "tmdbMovieId": 34152,
      "avgRating": 3.2631,
      "releaseYear": "1994",
      "numRatings": 1393,
      "posterPath": "/iFqe07F78SO0SIBzWcK4I5MwNvP.jpg"
   }
}