{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "hotel room",
            "id": 922
         },
         {
            "name": "memphis",
            "id": 3702
         },
         {
            "name": "widow",
            "id": 4129
         },
         {
            "name": "elvis",
            "id": 5694
         },
         {
            "name": "firearm",
            "id": 6112
         },
         {
            "name": "independent film",
            "id": 10183
         }
      ],
      "imdb_id": "tt0097940",
      "video": false,
      "title": "Mystery Train",
      "recommendations": [
         339,
         469,
         37997,
         1554,
         8284,
         17905,
         26851,
         922,
         2742,
         11502,
         6404,
         20620,
         7975,
         11911,
         1847,
         29452,
         778,
         9343,
         15244,
         34070
      ],
      "backdrop_path": "/lOBGMT4hR91Jp7QyXzvYjHnTCVC.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jun",
               "gender": 2,
               "credit_id": "52fe44229251416c75029ecb",
               "name": "Masatoshi Nagase",
               "profile_path": "/tfLSQKMo7ocCGbzFWJeQvjqF93l.jpg",
               "id": 68973,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Mitsuko",
               "gender": 1,
               "credit_id": "52fe44229251416c75029ecf",
               "name": "Youki Kudoh",
               "profile_path": "/dQHHbR7spJQXp2bi2YQQkMPk3H3.jpg",
               "id": 16145,
               "order": 1
            },
            {
               "cast_id": 13,
               "character": "Johnny aka Elvis",
               "gender": 2,
               "credit_id": "52fe44229251416c75029f0b",
               "name": "Joe Strummer",
               "profile_path": "/1OnNvVlWmtyqDfjQTsQ8lQOYEo9.jpg",
               "id": 58296,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Luisa",
               "gender": 1,
               "credit_id": "52fe44229251416c75029ed3",
               "name": "Nicoletta Braschi",
               "profile_path": "/KVd8Wj5PXrZ4XhtnWzbdqvQLIu.jpg",
               "id": 9235,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Charlie the Barber",
               "gender": 2,
               "credit_id": "52fe44229251416c75029ed7",
               "name": "Steve Buscemi",
               "profile_path": "/ieDyVKnQHo7eMGu1GOE7YYr2Fk4.jpg",
               "id": 884,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Night Clerk",
               "gender": 2,
               "credit_id": "534c20a5c3a3682dfe0032c1",
               "name": "Screamin' Jay Hawkins",
               "profile_path": "/nAg40A8HNGLCgmRqOTxdpVqvnwA.jpg",
               "id": 942004,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Man in Station",
               "gender": 2,
               "credit_id": "534c20b7c3a3682dd1003163",
               "name": "Rufus Thomas",
               "profile_path": null,
               "id": 23310,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Bellboy",
               "gender": 2,
               "credit_id": "534c20c8c3a3682dfe0032c4",
               "name": "Cinqué Lee",
               "profile_path": null,
               "id": 13603,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Man in Arcade Diner",
               "gender": 2,
               "credit_id": "55dc6364c3a3680c09001f48",
               "name": "Tom Noonan",
               "profile_path": "/cpINV4Q8IeVgSLyKz9ldzzAGr5n.jpg",
               "id": 119232,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Dee Dee",
               "gender": 1,
               "credit_id": "55dc63859251416607001f96",
               "name": "Elizabeth Bracco",
               "profile_path": "/wjubjA4eLOA7iwVF9LyyRZlY57p.jpg",
               "id": 54887,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Radio D.J",
               "gender": 2,
               "credit_id": "574cd2b692514144710000ef",
               "name": "Tom Waits",
               "profile_path": "/3XXe20xrdgUaOchQt5YOQqqSH6u.jpg",
               "id": 2887,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44229251416c75029edd",
               "name": "Jim Jarmusch",
               "profile_path": "/kCGt4RCjVyyhusGeKsZp97HAxfQ.jpg",
               "id": 4429,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44229251416c75029ee3",
               "name": "Jim Jarmusch",
               "profile_path": "/kCGt4RCjVyyhusGeKsZp97HAxfQ.jpg",
               "id": 4429,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44229251416c75029ee9",
               "name": "Kunijiro Hirata",
               "profile_path": null,
               "id": 68974,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44229251416c75029eef",
               "name": "Jim Stark",
               "profile_path": null,
               "id": 4834,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44229251416c75029ef5",
               "name": "Hideaki Suda",
               "profile_path": null,
               "id": 68975,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44229251416c75029efb",
               "name": "John Lurie",
               "profile_path": "/izPEjdTrWUy3gPEdJ8f2OOnBW3f.jpg",
               "id": 6394,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44229251416c75029f01",
               "name": "Robby Müller",
               "profile_path": "/d9Fz3vBIBBYUXYbPTIxo2FwYGSL.jpg",
               "id": 1632,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe44229251416c75029f07",
               "name": "Melody London",
               "profile_path": null,
               "id": 6406,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 10.520656,
      "production_countries": [
         {
            "iso_3166_1": "JP",
            "name": "Japan"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 11305,
      "vote_count": 119,
      "budget": 2800000,
      "overview": "Three stories are connected by a Memphis hotel and the spirit of Elvis Presley.",
      "similar": [
         2142,
         3134,
         298312,
         11564,
         483,
         13885,
         205,
         23483,
         769,
         4771,
         281,
         339692,
         281957,
         395834,
         445954,
         10285,
         431,
         681,
         948,
         8810
      ],
      "original_title": "Mystery Train",
      "runtime": 113,
      "poster_path": "/vcr6pBGeHWfjiWH6HarEEXdJIlG.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         },
         {
            "name": "日本語",
            "iso_639_1": "ja"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Mystery Train",
            "id": 60620,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "JVC Entertainment Networks",
            "id": 4248,
            "origin_country": ""
         }
      ],
      "release_date": "1989-09-06",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Jim Jarmusch"],
      "runtime": 110,
      "synopsis": null,
      "writers": ["Jim Jarmusch"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0097940/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTAxNTgyMTkxODJeQTJeQWpwZ15BbWU3MDAzNzMxMzM@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Masatoshi Nagase, Yûki Kudô, Screamin' Jay Hawkins | See full cast and crew »"],
      "reviews": [
         "'Mystery Train' is probably the most entertaining, interesting and understated of indie-fave Jim Jarmusch's early work (i haven't seen 'Coffee and Cigarettes' yet). The films portrayal of Elvis' birthplace of Memphis, possibly one of the most featureless, gritty and desolate representations of urban America ever committed to film, is a deceptively clever and substantial take on American subcultures. Without doubt, it is the first of the films three vignettes that makes the film stand out a little more than Jarmusch's other quirky offerings. Two Japanese tourists besotted with the King's legacy and 1950's American retro-culture in general, decide to visit Memphis, where they experience the superficiality his iconic status has been reduced to. The over-excitable and optimistic teenage girl, along with her more austere, cooler-than-cool boyfriend, are equally unimpressed with what the town has to offer. It's quite impressive that 15 years after its release, Jarmusch's depiction of alternative culture manages to capture the pretentious but proudly on-the-edges attitudes probably more apparent in today's retro-obsessed climate than ever before. Jarmusch's signature eclectic cast is another reason for repeated viewing, the subtleties of, in particular, Steve Buscemi's stuttering and nervous performance, are worth looking out for. As is the linking theme of Elvis' ghost in all three vignettes, a brilliant example of how to take a simple theme, and continually parodize its implications until its every mention leads to some sort of in-joke. The cool, laid-back pace of the film allows the humour to hit you unexpectedly, and the timing is often genius. Very, very, very watchable.",
         "Jim Jarmusch's follow-up to 1986's \"Down By Law\" is an engrossing trio of stories revolving around one night in a run-down Memphis hotel. Continuing his tradition of casting musicians as actors, he enlists Joe Strummer as a British Elvis and the late Screamin' Jay Hawkins as the hotel night clerk. R&B great Rufus Thomas appears in the train station, and Tom Waits is the voice of the radio DJ. John Lurie provides the score, along with a fabulous soundtrack of classic Memphis music (from Elvis Presley to the Bar-Kays). The stories are intertwined, with certain events being shown from the perspective of each of the three sets of characters. The town has fallen a bit since its heyday as a musical hotbed, but the spirits of its past can be sensed in the delapidated buildings and landscapes, all lovingly embraced by Jarmusch's lens. All of the night shots were actually filmed at night, and some scenes are subtitled in Japanese and Italian. As is typical with Jarmusch's work, the action unfolds at a leisurely pace, and not without some humor. The film's juxtaposing of cultures is a popular theme with the director, and one he would use again in his next anthology piece, \"Night On Earth.\"",
         "Mystery Train is the type of movie that is over before you know it. Serious and funny at the same time. I like the layout of the picture, how all the people's live inter-mingled without touching each other and time started over when the next group of people started their adventure. Made in 1989, this movie still lives today, just like Elvis! Actually, this movie will be around for a very long time. With quirky being the \"norm\" for TV and movies now, it fits into the current movie atmosphere even more. I think this one fell in between the time of Twin Peaks & Northern Exposure on network TV and Six Feet Under and Dead Like Me on cable movie channels. This one ranks way up there with Momento as one of my favorite movies.",
         "I've seen all of Jarmusch's films with the exception of Night on Earth. While all of them (even Dead Man and Year of the Horse, movies that boggled my mind with how strange they were) carry a level of off-beat, original, and fresh kind of film-making prowess, I think my favorite (hard to say 'best' with this director) is with this film, Mystery Train. Plot-wise, it's the obvious precursor to Tarantino's Pulp Fiction (and it's understandable that QT saw this- he did, after all, include Elvis as a practical spiritual adviser for Clarence in True Romance, beside the point). The idea behind both films is very similar, but of course executed in entirely different trajectories - one person or place has a level of importance for what will happen to the characters in the film (with 'Pulp' it was Marsellus Wallace; with 'Mystery' it's the Hotel run by Screaming' Jay Hawkins, and the song Blue Moon on radio). On its own terms, Mystery Train comes out entertaining if one doesn't want to think about the timing of the plot, even if that is carefully, almost architecturally constructed. Although the second and third stories are linked by character associations, the first is a stand-alone segment that looks like if it was just on paper could make for a calm, witty short story. As it is in the film, the Japanese couple \"Far from Yokohama\" featuring actors Masatoshi Nagase and Yôki Kudô, is an inviting first part of the film, almost entirely in Japanese subtitles, and playing off of the lady's love of Elvis, and the guy's quiet love for Carl Perkins (a name I didn't really know until I asked around). A steady pace is kicked off by Jarmusch, working more on mood than on a conventional story, and it is something that works rather well. Interesting still is how he sets up other little bits with supporting characters as the leads unfurls- this being an occasional couple of lines between Hawkins and down-beat bellboy Cinque Lee (there are also very quick shots of Steve Buscemi as a barber, the only small connection to the other two stories, and Rufus Thomas at the station). Sometimes the couple bicker, but never with a rush of intensity, and when the scene comes to a passionate close, it's really wonderful how it can be touching at being subtle. The second story, \"Ghost\", is faster, with more of a high-key for humor. Nicoletta Braschi (Roberto Benigni's wife in most films as in life) is astray in Memphis on a flight, and instead of seeking out Elvis gets it delivered to her in a vision while in a hotel room with a talky Jersey Girl (Elizabeth Bracco). It's a complete kind of surreal scene that acts as the fine top-off to a set of odder circumstances that bring her to the hotel (in particular Tom Noonan in one of the funniest small roles I've seen in any Jarmusch film). Once again, the little things keep this thing floating with a stack of magazines, and of course, all that music on the radio. The third story, \"Lost in Space\", is when Jarmusch turns up the energy, which means not as far as you might expect. What he does get is a kind of three-character triangle that some-what reminded me of a sequence in The Last Detail: three characters that are totally smashed, with nothing else except to crash in the hotel. But with this story, two performances shine through unexpectedly: Joe Strummer as a fuming, gun-toting Brit and Steve Buscemi in his early days as his \"brother in-law\". The climax to this scene- in essence the climax to the whole film- is one that is on par, at least comparable, to the climax of Pulp Fiction, as a wild, dead-serious and dead-funny accumulation of events tying things together. Two facets that make Jarmusch's vision work are, for one thing, that he has Robby Mueller, a bit of a God in the world of modern European cinematographers. His scenes are lit sometimes with all the realism and fantasy of a European fantasy film, but also with a careful eye in composition and getting unusual angles on things a simple as photographing two people in bed or a person walking alone with Memphis in the backdrop. The other facet includes the city itself, with its quality of attracting and leading in people who are unique to the city, and (sometimes) particular to the music. On top of Jarmusch regular John Lurie on the guitar and harmonica, he brings in songs that remind me how much I can get into this kind of music with the right setting. They- Elvis, Orbison, and Sam Phillips among others- contribute just as much as the actors do. Mystery Train may be one of the quintessential 80's indie films (which can be said of Stinger than Paradise and Down by Law as well), that welcomes anyone who might be interested to watch, and if you don't like it, it's not at the worst offensive to taste. It's a keen film on people, music, and devotion.",
         "Mystery Train is a moody and atmospheric gem surrounding a flea-bag Memphis hotel. Great performances are dished out (Screamin' Jay Hawkins and Cinque Lee are hilarious in an argument over exotic fruits from foreign lands) all around, but I favor the dynamic duo of Youki Kudoh and Masatoshi Nagase. Their characters are \"far from Yokohama,\" but love will find its way to Tennessee. The lighting of a cigarette, an impressive t-shirt collection, an argument over the merits of Carl Perkins versus The King, the smearing of some crimson lipstick, and an exhilarating invitation to bed -- the minutiae of a special bond beyond mere chemistry. The combination of Nagase's dour, glowering sourpuss and Kudoh's charming, enthusiastic pixie makes for a volcanic cocktail.",
         "\"Mystery Train\" is a witty look at different aspects of one of the crazes of our time, the worship of Elvis Presley. The cast includes cult performers like Tom Noonan (the serial killer in Michael Mann's \"Manhunter\"), Steve Buscemi, and singer Tom Waits (heard on the radio), and it is directed by one of America's leading independent directors. \"Mystery Train\" is possibly Jim Jarmusch's most immaculate film, and though the movie gets steadily darker in its comic tone, it is his least bleak work to date. The patterning is precise, the film growing richer as the three strands are finally woven together, or perhaps unwoven, as the characters go their separate ways. Robbie Muller, the great Dutch cameraman who shot Alex Cox's \"Repo Man\" and Wim Wenders' \"Paris, Texas\", once more brings an outsider's perspective to the American landscape, giving the night scenes and hotel interiors a Hopperesque look and endowing a dilapidated section of Memphis with an elegaic sadness.",
         "I liked this movie, yet it's hard to say exactly why. It was very realistic in it's overall story line yet very original in the way it presented it. The actors almost appeared real in that one was just observing them in real life. I think that was because of the story line, script and direction. Also this entire movie is like a well thought out three-act play that takes place all at the same time. It is cleverly connected and dramatically effective at getting the viewer's interest in these character interactions over this one night period of time in Memphis. Attention to detail was as good as it could get. If you are big fan of very high quality and original indie films you should not miss this one. It has the makings of a true classic.",
         "I just got done watching \"Dead Man\" in my Development of Film class at the school, so I was curious about Jarmusch's early work. I saw \"Night on Earth\" and \"Ghost Dog,\" and I was very impressed with those two films. I wasn't too impressed with \"Dead Man,\" but I still felt curious to check out this movie. \"Mystery Train\" moves along at a pace identical to that of \"Night on Earth.\" It has those usual Jarmusch trademarks: characters from a foreign country, culture clashes, episodic rhythm, etc. Jarmusch is a very talented screenwriter, and he's good at engaging his audience with dialogue that is crisp (and sometimes quite funny) but at the same time brutally realistic. You can never watch a Jarmusch film and say to yourself, \"Man, people don't talk like that in real life!\" Though highly identical to \"Night on Earth,\" I found that film much more engaging in comparison, and I could've help but ponder that while watching this movie. Don't get me wrong, I liked \"Mystery Train,\" but NOE had a certain quality that made it a lot more entertaining, despite the fact that it was two hours long (give or take). I guess I just found the interactions between the characters in that movie more interesting. In this film, I found them interesting as well, but the scenes would drag out at points. Both films move at a leisurely pace, but the minutes seem to go by slower when watching this one. Nevertheless, it was well-made, with some nice uses of 3-figure composition. Jarmusch makes good use of the camera, preventing us from feeling like we're watching a photographed play--even though many scenes fixate on one location. The soundtrack is cool, and it's interesting how Jarmusch used The King to tie the stories together. The performances are good, and one of my main curiousities--before viewing the film--was seeing Steve Buscemi in one of his early roles. I love Steve, he's one of our coolest actors. Overall, I recommend the film. It definitely has its moments. I just thought it dragged at points, and if you had the choice between this movie and \"Night on Earth,\" I recommend you choose the latter. My score: 7 (out of 10)",
         "Jim Jarmusch (Ghost Dog: The Way of the Samurai, Broken Flowers) delivers films that are true indy's. They don't fit any norm, and this one is over before you even realize it. It is three stories that are tied together by a seedy motel. The characters never intersect. There must be a point there somewhere, but I sure missed it. I did like the picture of America that we usually don't see unless we go looking for it. Most cities are lit with fast food signs and an endless string of car lots. Getting down on the back streets with stores shuttered, bars where everyone knows your name, and seedy motels that should have closed long ago, is an adventure that most do experience. The blues music and the Elvis theme that runs through the movie is an exciting backdrop. Steve Buscemi is fun to watch as always, and I really liked the Japanese teen, Youki Kudoh, and, of course Robby Müller's (Paris, Texas) cinematography is always good. Jarmusch fans will love it.",
         "Memphis is the setting, and the specter of Elvis pervades a trio of stories in `Mystery Train,' written and directed by Jim Jarmusch. The three episodes that make up the movie are told separately and in their entirety, though they happen simultaneously in time, and share nothing more than a common local which serves as the hub around which the stories revolve. And with them, Jarmusch does what he does best: he invites the audience in to share some time with the individuals who populate his landscape, as he places them under the microscope to study the minutiae of their lives. In his hands, the details of everyday existence become fresh and new, like the first time you see a new city or make the acquaintance of a total stranger who forever after becomes a part of your life. It's an intimate style of filmmaking, almost voyeuristic, wherein the camera becomes the eyes of the audience and makes the viewer more than a mere onlooker; it places you in the scene, which allows you to experience what the characters are experiencing, to live what they are living. When someone is walking down the street, you're on that street with them, feeling the pavement beneath your feet; in the train depot, you drink in the atmosphere, feeling the texture of the walls, of the aged wood of the benches, smelling the age-old scents of time that hang on the air. You're there with the young couple from Japan, in Memphis to see Sun Studios and Graceland; and with the young widow from Rome, passing through with the casket of her late husband awaiting transport at the airport; and with three young men who have too much to drink and within a few hours find out how quickly life can become so complicated. Jarmusch works with such precision that it makes everything that happens seem spontaneous; it's an innate sense of knowing what works, and how to make that necessary connection with the audience by making all that transpires real. He's a skilled craftsman who knows what he wants and exactly how to deliver it. He creates the proper atmosphere, then introduces you to the characters through which his story will be told. And once the stage is set, Jarmusch knows that `who' these people are and what makes them unique is as important as the story itself, for in a sense, the characters `are' the story. It's an examination of human nature; of traits and of how people function under certain circumstances. And through each character the viewer gets a different perspective on what is happening, along with some insight into how we all relate to one another in a given situation, from the mundane to the bizarre. To tell his tale, Jarmusch has assembled a talented, eclectic cast of actors, including Masatoshi Nagase (Jun) and the charismatic Youki Kudoh (Mitsuko), the couple from Japan with opposing perspectives of Memphis; Nicoletta Braschi (Luisa), the widow awaiting a flight back to Rome; Elizabeth Bracco (Dee Dee), a young woman whose life is in transition; Tom Noonan (Man in Diner), a man with a menacing presence and a strange tale to tell; Steve Buscemi (Charlie), a regular guy led astray by trusting indifference, along with Rick Aviles (Will Robinson) and Lowell Roberts (Lester); Stephen Jones, a dead-ringer for Elvis who is extremely effective here as his ghost; and the two whose characters are pivotal to the story, Screamin' Jay Hawkins (Hotel Night Clerk), and Cinque Lee (The Bellboy). And--heard, but not seen-- Tom Waits (Voice of the Radio DJ). Thoroughly engrossing and highly entertaining, `Mystery Train' is vintage Jarmusch; a director whose minimalist techniques and style make for a satisfying and rewarding movie-going experience. He will not dazzle you with ILM F/X or feed you endless lines of witty dialogue; instead, he gives you more: A film that is artistically and cleverly rendered, with an engaging story and characters that are `real.' An independent filmmaker who stays true to his personal `vision,' Jarmusch gives you that which is rarely found in Hollywood. A film that is truly original. I rate this one 8/10."
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Drama"
      ],
      "productionCompanies": [
         "JVC Entertainment Networks",
         "Mystery Train"
      ],
      "summaries": [
         "A Japanese couple obsessed with 1950s America goes to Memphis because the male half of the couple emulates Carl Perkins. Chance encounters link three different stories in the city, with the common thread being the seedy hotel where they are all staying.",
         "Three stories are connected by a Memphis hotel and the spirit of Elvis Presley."
      ],
      "budget": 2800000
   },
   "movielensId": 3521,
   "movielens": {
      "languages": [
         "English",
         "Italiano",
         "日本語"
      ],
      "releaseDate": "1989-09-06",
      "dvdReleaseDate": "2000-03-28",
      "directors": ["Jim Jarmusch"],
      "runtime": 113,
      "movieId": 3521,
      "title": "Mystery Train",
      "mpaa": "R",
      "actors": [
         "Masatoshi Nagase",
         "Youki Kudoh",
         "Joe Strummer",
         "Nicoletta Braschi",
         "Steve Buscemi",
         "Screamin' Jay Hawkins",
         "Rufus Thomas",
         "Cinqué Lee",
         "Tom Noonan",
         "Elizabeth Bracco",
         "Tom Waits"
      ],
      "imdbMovieId": "0097940",
      "originalTitle": "Mystery Train",
      "genres": [
         "Crime",
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": [
         "nb0yBDSqTfs",
         "jCO82ghez8c"
      ],
      "plotSummary": "Three stories are connected by a Memphis hotel and the spirit of Elvis Presley.",
      "tmdbMovieId": 11305,
      "avgRating": 3.89901,
      "releaseYear": "1989",
      "numRatings": 1614,
      "posterPath": "/vcr6pBGeHWfjiWH6HarEEXdJIlG.jpg"
   }
}