{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "immigrant",
            "id": 2356
         },
         {
            "name": "biography",
            "id": 5565
         },
         {
            "name": "anarchist",
            "id": 5879
         }
      ],
      "imdb_id": "tt0067698",
      "video": false,
      "title": "Sacco & Vanzetti",
      "recommendations": [
         122699,
         124485,
         62842,
         31344,
         364002,
         43379,
         44658,
         80441,
         74349,
         227245,
         47715,
         74746,
         48205,
         90228,
         12513,
         43101,
         194602,
         144615,
         202768,
         4702
      ],
      "backdrop_path": "/nHSRgwJHPOnabmp7S6X6h3fjOXt.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Bartolomeo Vanzetti",
               "gender": 2,
               "credit_id": "52fe4759c3a36847f8130e35",
               "name": "Gian Maria Volonté",
               "profile_path": "/j4cbFhoC7A7ONeM9oln1hJ0U74A.jpg",
               "id": 14276,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Nicola Sacco",
               "gender": 0,
               "credit_id": "52fe4759c3a36847f8130e39",
               "name": "Riccardo Cucciolla",
               "profile_path": "/lPGoms1ouEite0sKp3guCdUdjEn.jpg",
               "id": 29429,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Frederick Katzmann",
               "gender": 2,
               "credit_id": "52fe4759c3a36847f8130e49",
               "name": "Cyril Cusack",
               "profile_path": "/5d6OeKNqpRSMhwXd1FHV9KeX4WS.jpg",
               "id": 4973,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Rosa Sacco",
               "gender": 1,
               "credit_id": "52fe4759c3a36847f8130e4d",
               "name": "Rosanna Fratello",
               "profile_path": "/cwtx2tQxjrkX8AQRrcSOjyp5y3n.jpg",
               "id": 236087,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Giudice Webster Thayer",
               "gender": 2,
               "credit_id": "52fe4759c3a36847f8130e51",
               "name": "Geoffrey Keen",
               "profile_path": "/cfl3AjlaS4beYAbxbmXUWgH337Y.jpg",
               "id": 10462,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Fred Moore",
               "gender": 2,
               "credit_id": "52fe475ac3a36847f8130e5d",
               "name": "Milo O'Shea",
               "profile_path": "/axJwk4Mwj1ZBx09YE3Lu5qU0QkE.jpg",
               "id": 47137,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "William Thompson",
               "gender": 2,
               "credit_id": "52fe4759c3a36847f8130e55",
               "name": "William Prince",
               "profile_path": "/w5aLRVfH98WHH5wezzMT9oAB8t0.jpg",
               "id": 46099,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Giornalista",
               "gender": 0,
               "credit_id": "52fe475ac3a36847f8130e59",
               "name": "Claude Mann",
               "profile_path": "/x8HuSI3nt7JF8xCzbuzcM4QdfIn.jpg",
               "id": 36018,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Virginia Vanzetti",
               "gender": 0,
               "credit_id": "59a31430925141775b0461b5",
               "name": "Armenia Balducci",
               "profile_path": "/3JIKeUUX5j7SQefEhXc11vuajk2.jpg",
               "id": 236748,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "console Giuseppe Andrower",
               "gender": 2,
               "credit_id": "59a31440925141779f045b2f",
               "name": "Sergio Fantoni",
               "profile_path": "/tN4mZe7FuydwDbAH39cTaWMuhhQ.jpg",
               "id": 34596,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "",
               "gender": 0,
               "credit_id": "56b73ddcc3a36806ee00c9ff",
               "name": "John Harvey",
               "profile_path": "/2HDwZtlvwS9iSpgEFKqLSoj9nPb.jpg",
               "id": 1573982,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4759c3a36847f8130e31",
               "name": "Giuliano Montaldo",
               "profile_path": "/ncuf7q1nVfUpCJPK8YHwfHZVaG0.jpg",
               "id": 132257,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4759c3a36847f8130e3f",
               "name": "Fabrizio Onofri",
               "profile_path": null,
               "id": 236086,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4759c3a36847f8130e45",
               "name": "Giuliano Montaldo",
               "profile_path": "/ncuf7q1nVfUpCJPK8YHwfHZVaG0.jpg",
               "id": 132257,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "56220b80c3a368686800508a",
               "name": "Ennio Morricone",
               "profile_path": "/tlntfyflyEHgJTFjqIgg8P8UIx9.jpg",
               "id": 1259,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "History",
            "id": 36
         }
      ],
      "popularity": 1.323875,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         }
      ],
      "id": 48211,
      "vote_count": 28,
      "budget": 0,
      "overview": "The story of two anarchists who were charged and unfairly tried for murder when it was really for their political convictions.",
      "similar": [
         11202,
         45317,
         276907,
         462,
         640,
         769,
         5915,
         318846,
         324786,
         389015,
         407445,
         363676,
         371638,
         396371,
         323677,
         228970,
         416477,
         274479,
         152532,
         300671
      ],
      "original_title": "Sacco e Vanzetti",
      "runtime": 120,
      "poster_path": "/vDs9A0DohKDtLC3G98jodRr2gu0.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Theatre Le Rex S.A.",
            "id": 10483,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Jolly Film",
            "id": 10481,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Unidis",
            "id": 2400,
            "origin_country": ""
         }
      ],
      "release_date": "1971-03-16",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Giuliano Montaldo"],
      "runtime": 120,
      "synopsis": null,
      "writers": [
         "Fabrizio Onofri",
         "Giuliano Montaldo"
      ],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0067698/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM5NjIwNjkwN15BMl5BanBnXkFtZTcwOTkwNjk5Mw@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Gian Maria Volonté, Riccardo Cucciolla, Cyril Cusack | See full cast and crew »"],
      "reviews": [
         "It is perhaps not without significance that Guiliano Montaldo worked as Assistant Director on Gillo Pontecorvo's brilliant KAPO, since there is a tangible link in terms of attitude, emotional power and political commitment between this film and Pontecorvo's other outstanding films. Great films are, very often, a means of conveying ideas, and, as Pudovkin once said, film is the greatest teacher because it reaches us both through the head and the emotions. Maybe this is why politically correct authoritarians are always chiding us `not to be sentimental' since emotions are something these control freaks can't orchestrate! Whatever one's views about the political sympathies of Sacco and Vanzetti, this film shows that they were victims of the hysterical climate of the times and place in which they found themselves, and their plight is represented with great humanism, empathy and power, helped in no small measure by the superb musical score of Ennio Morricone, which must rank as one of his very best. Montaldo's whole technique is thoroughly cinematic, and the acting and all technical credits are faultless. One somewhat disturbing aspect of this film however, was when I saw it in the USA, Sacco in his final speech from the dock declared, `We stand here because we are anarchists', (it struck at the time because I never thought I'd live to see the day that such a piece of dialogue would be delivered in a film distributed by MGM!), but, in its only screening in the UK on BBC television, this line was changed to `We stand here because we are radicals'. Hmmm! Not quite the same thing. On two other occasions I have noticed `creative subtitling' on French speaking movies, so maybe we should start a campaign for accurate and faithful subtitles! A brilliant film, in my all-time top 100, so when is anyone going to issue it on video?",
         "Only recently I was able to see again this movie. I remember seeing it a long time ago, I must have been 16 yrs old, and I was struck by it. After so long, now I'm thirty, the effect on me is still the same. This movie is absolutely marvelous, both for construction, acting and story: it recalls the true story of 2 Italian anarchists (Sacco and Vanzetti) sentenced to death by the court in the USA in the thirties because accused to have murdered someone during a robbery. At the time the story had great impact in the people all over the world, because the evidence of their innocence was total, and in many countries there were demonstrations against such terrible injustice. Now it is only another (admitted) mistake by the US justice system... so sad nothing changed ever since... Great was also the soundtrack by Italian maestro Ennio Morricone, sung by Joan Beaz and Georges Moustaki. I doubt this movie passes in the US TV schedules (especially with nowadays local admin.), so, if you want to see a really good movie, rent it out!",
         "Magnificent rendition of the people, circumstances and atmosphere surrounding the infamous \"Palmer Raids\", the paranoia of the keepers of law and order and the status quo, and of course the frame-up of Sacco and Vanzetti.It is worthwhile to know that the governor of Massachussets recently exonerated Sacco and Vanzetti, calling their trial a shameful mark on the face of American judiciary system.",
         "In 1920, the anarchist Italian immigrants Niccola Sacco (Riccardo Cucciolla) and Bartolomeo Vanzetti (Gian Maria Volonté) are sentenced to death, falsely accused of a robbery and murder. Indeed they are condemned due to their political beliefs, in one of the most shameful and hypocrite judgments of the human history. In 1971, the exhibition of \"Sacco and Vanzetti\" was forbidden in Brazil, and the first time I could watch it was when Brazil was leaving the military dictatorship regime in a movie theater specialized in art movies. I was very impressed with the story of one of the greatest injustice of a judiciary system, mostly because it happened in the \"land of freedom\". Gian Maria Volonté, as usual, and Riccardo Cucciolla offer one of the most touching and beautiful dramatic interpretations I have ever seen. This movie was recently released by the best (not in quantity of titles but in their quality) Brazilian distributors called Versatil. The DVD is completely restored, in widescreen and full of Extras, showing footages of this infamous trial. The musical score of Joan Baez and Ennio Morricone is another attraction. I expected to see this outstanding movie among the IMDb Top 250, but it seems that its worldwide distribution does not work well, and there are only 185 votes in 2005. My vote is ten. Title (Brazil): \"Sacco & Vanzetti\"",
         "My comment could not possibly add anything to the ones already available. I just want to say that the latest scandal in this story is that the film has not been made available on DVD ! Is there a conspiracy still going on to prevent such films from being watched by new generations ? I am exasperated to see that thousands of trash films are published on DVD every month while such masterpieces are still ignored. Sacco e Vanzetti reaches far beyond the subject of the two anarchists ignominiously put to death in a misconducted trial. The ghosts of the two men are still behind every prejudiced account by the media, every lie by politicians all over the world. It calls for better institutions, better democracy all over the world. The fact that so many film buffs bothered to express their admiration for this outstanding movie should entice a publisher to make this film at last available. I have kept checking for years, but nothing so far.",
         "A very gripping and moving film with a very fine cast and strong performances. This film makes a very strong impact and will make you think of Sacco and Vanzetti and the reasons why they were executed on the electric chair.",
         "Frank McGurk \"Guilty or Innocent???\" for writing a WRONG comment? I quote with correction: \"recent ballistic tests on the weapons proved that the gun found on Nicola Sacco was NOT (NO-NEIN) the gun used to murder the payroll guards\"! Be careful guys... ...if you don't want roll injustice over and over again... N.B. If also not so, remember that the real guilty man confessed his crime. But the court refuse to admit his confession, because he was already put to death for other crimes. take care",
         "My current obsession with Italian actor Gian Maria Volonté eventually brought me to Giuliano Montaldo's Sacco and Vanzetti, an excellent courtroom drama where Volonté and Riccardo Cucciolla play two anarchists unjustly tried for murder, while it becomes obvious they're in fact being tried for being anarchists, lefties, reds, whatever, in a country that never had any love for them, and in a time that was perhaps the second worst time to be an anarchist/communist/socialist in America after the McCarthy years. This movie is set a few decades before that, but the hysteria and strident violation of civil rights is the same. Montaldo does a good job directing the movie - for instance the black-and-white opening sequence, with the cops making a raid on an Italian neighbourhood, rounding up men, women and children in front of their buildings, spanking innocent people, and basically acting like vicious animals, is a powerful sequence that immediately sets the theme of abuse of power. Then we have the courtroom scenes, with Cyril Cusack playing a fierce DA seeking to send the two anarchists to the electric chair, Geoffrey Keen playing a clearly bigoted judge, and Milo O'Shea as the defense lawyer who is systematically humiliated, bullied and discredited because he's doing his job too well. When these three actors share a scene you can see sparks fly off the screen! Ennio Morricone provides the music, which is melancholy and elegiac, and Joan Baez contributes with some excellent ballads that are positioned in key moments of the movie. These two together make the score for this movie one of the best I've ever heard. Gian Maria Volonté is of course excellent: his performance is showier and more furious than Cucciolla's. But then their characters also have different personalities. Whereas Volonté's character, Vanzetti, understands the mythical dimension of his person, realizes that his death will turn him into a symbol of freedom for the new generations, and he's fine with that, Cucciolla plays Sacco, an ordinary man who wants to live and who is having trouble accepting his new condition as a man charged with murder. Cucciolla received a prize in Cannes for his performance in this movie over Volonté and I have to say it wasn't undeserved. His subdued, reserved performance was the right touch that makes him the focus point of the viewer's sympathies. Sacco and Vanzetti is a great movie, a beautiful movie, that tells an interesting episode about American history that is often ignored - the racism, discrimination and suspicion against immigrants. Like any other country, the USA has an official history that is more mythology than truth, that is inevitable to all nations in their construction of a national identity, but I'm glad there will always be movies like these to continue to deflate the myths and reveal the truth. I just hope there will always be viewers for them too.",
         "This case still affects not just in the so-called Roaring Twenties but also of today and of our future. As we see that Nicola Sacco and Bartholomeo Vanzetti, two Italian born men and devout anarchists were executed due to their anarchists beliefs. Murder was gruesome in Brantree, MA but it was their beliefs and the Red Scare that really not just divided a nation but divided a whole entire world. Case that still haunts us in the twenties, haunts us today and for the future. As the tag line says \"If it happened once, it could happen again!\" The late, great Riccardo Cucciolla and late great, Gian Marie Volente in the respected Sacco and Vanzetti roles. Were made as scapegoats as they could not get a fair trial as the criminal justice system also looked at them being Italians, which were in the minority at the time. Sacco was the quiet family man shoemaker and Vanzetti was more of the spokesman, fish peddler of the two and more of the talker. And maybe would had been a college professor if he had a college degree had it probably not been for his beliefs or being Italian. That they are portrayed to be. As the case also takes a toll on their families along the way. Cyri Cusack as a bullying prosecutor steals the movie. As he wants to just get them to the electric chair asap it seems over their beliefs. Despite the worldwide protests over them, Cusack's character finally gets his wish. A case that should be studied all over the world!",
         "Extremely well acted but terribly put together film of one of America's most shameful injustices. Gian Maria Volonté and Riccardo Cucciolla portray the doomed anarchists in director Giuliano Montaldo's production. It suffers from what appears to be a serious lack of location work (it rarely even appears that events are taking place in the US) and Montaldo's direction is surprisingly lifeless. There's no feeling of what the country was going through during the politically turbulent 1920s, when anarchists, communists and other radicals were being deported en masse. The film relies on courtroom proceedings that are confusing rather than enlightening. Volonté and Cucciolla, as well as Cyril Cusack as a wily DA are excellent as are Milo O'Shea and William Prince as the Sacco & Vanzetti's first and second lawyers. Ennio Morricone's score is terrific, marred at times by poorly placed folk songs by Joan Baez."
      ],
      "genres": [
         "Biography",
         "Crime",
         "Drama",
         "History"
      ],
      "productionCompanies": [
         "Jolly Film",
         "Unidis",
         "Theatre Le Rex S.A."
      ],
      "summaries": [
         "In 1920, the anarchist Italian immigrants Niccola Sacco (Riccardo Cucciolla) and Bartolomeo Vanzetti (Gian Maria Volonté) are sentenced to death, falsely accused of a robbery and murder. Indeed they are condemned due to their political beliefs, in one of the most shameful and hypocrite judgments of the human history.",
         "The story of two anarchists who were charged and unfairly tried for murder when it was really for their political convictions."
      ],
      "budget": 0
   },
   "movielensId": 3522,
   "movielens": {
      "languages": [
         "English",
         "Italiano"
      ],
      "releaseDate": "1971-03-16",
      "dvdReleaseDate": "2000-03-28",
      "directors": ["Giuliano Montaldo"],
      "runtime": 120,
      "movieId": 3522,
      "title": "Sacco & Vanzetti",
      "mpaa": "",
      "actors": [
         "Gian Maria Volonté",
         "Riccardo Cucciolla",
         "Cyril Cusack",
         "Rosanna Fratello",
         "Geoffrey Keen",
         "Milo O'Shea",
         "William Prince",
         "Claude Mann",
         "Armenia Balducci",
         "Sergio Fantoni",
         "John Harvey"
      ],
      "imdbMovieId": "0067698",
      "originalTitle": "Sacco e Vanzetti",
      "genres": [
         "Crime",
         "Drama",
         "History"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The story of two anarchists who were charged and unfairly tried for murder when it was really for their political convictions.",
      "tmdbMovieId": 48211,
      "avgRating": 3.51818,
      "releaseYear": "1971",
      "numRatings": 55,
      "posterPath": "/vDs9A0DohKDtLC3G98jodRr2gu0.jpg"
   }
}