{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "small town",
            "id": 1415
         },
         {
            "name": "debt collector",
            "id": 10857
         },
         {
            "name": "irish",
            "id": 11018
         }
      ],
      "imdb_id": "tt0096211",
      "video": false,
      "title": "Taffin",
      "recommendations": [],
      "backdrop_path": "/u7QOqKutTKlWfvBo2LyIMhuoVjI.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Mark Taffin",
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06ca6d",
               "name": "Pierce Brosnan",
               "profile_path": "/1JXL0zrA26JjdoX8sqf57fJRDVM.jpg",
               "id": 517,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "O'Rourke",
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06ca71",
               "name": "Ray McAnally",
               "profile_path": "/h7ZRXky7CHIePHPCwSVTK9vEi9E.jpg",
               "id": 40008,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Charlotte",
               "gender": 1,
               "credit_id": "52fe45bfc3a368484e06ca75",
               "name": "Alison Doody",
               "profile_path": "/iXP0rdo8vRLU0YwWejFNwmEQtyV.jpg",
               "id": 739,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Martin",
               "gender": 0,
               "credit_id": "52fe45bfc3a368484e06ca9d",
               "name": "Jeremy Child",
               "profile_path": "/kdd6OfSGCkEIkyTNBmIVraz2W4t.jpg",
               "id": 158293,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Mrs. Martin",
               "gender": 1,
               "credit_id": "52fe45bfc3a368484e06caa1",
               "name": "Dearbhla Molloy",
               "profile_path": "/dNZmbBwRnEh2aym3989TJTu9LtX.jpg",
               "id": 33395,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Conway",
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06caa5",
               "name": "Jim Bartley",
               "profile_path": null,
               "id": 940849,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Sprawley",
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06caa9",
               "name": "Alan Stanford",
               "profile_path": null,
               "id": 15888,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Ed",
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06caad",
               "name": "Gerard McSorley",
               "profile_path": "/AfXsqVrfS0Q9oxHYt2zX7ZJhN1P.jpg",
               "id": 43131,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Mo Taffin",
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06cab1",
               "name": "Patrick Bergin",
               "profile_path": "/mxFum2Fr5YWD6kDQYb5u7EEvuva.jpg",
               "id": 29459,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06ca7b",
               "name": "Francis Megahy",
               "profile_path": null,
               "id": 102521,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06ca81",
               "name": "Stanley Myers",
               "profile_path": null,
               "id": 40150,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06ca87",
               "name": "Hans Zimmer",
               "profile_path": "/7IjJpvGtCfY0DsritmfCh2iX9I4.jpg",
               "id": 947,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06ca8d",
               "name": "John A. Davis",
               "profile_path": null,
               "id": 60237,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06ca93",
               "name": "David Ambrose",
               "profile_path": "/yJZF0kuELsniUZlDosVPba9uYn.jpg",
               "id": 36120,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe45bfc3a368484e06ca99",
               "name": "Lyndon Mallet",
               "profile_path": null,
               "id": 102526,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 0,
               "credit_id": "52fe45bfc3a368484e06cab7",
               "name": "Allan Scott",
               "profile_path": null,
               "id": 589662,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 2.43427,
      "production_countries": [
         {
            "iso_3166_1": "IE",
            "name": "Ireland"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         }
      ],
      "id": 28975,
      "vote_count": 9,
      "budget": 0,
      "overview": "When a small Irish town is terrorized by a corrupt business syndicate, a lone hero (Brosnan) wages an all out war.",
      "similar": [
         9362,
         11069,
         10829,
         262841,
         76640,
         2654,
         10891,
         8374,
         1368,
         59,
         755,
         793,
         253,
         49849,
         339967,
         346364,
         1547,
         1585,
         927,
         33
      ],
      "original_title": "Taffin",
      "runtime": 96,
      "poster_path": "/g0QrRK5Ml2n1qaeF74P4iG3pNnH.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1988-02-26",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "He didn’t get mad… He got even.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Francis Megahy"],
      "runtime": 96,
      "synopsis": null,
      "writers": [
         "David Ambrose",
         "Lyndon Mallet"
      ],
      "originalLanguage": "Irish",
      "imdbLink": "http://www.imdb.com/title/tt0096211/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNzgzNzY1MTA0NF5BMl5BanBnXkFtZTcwODM2NzI5NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Pierce Brosnan, Ray McAnally, Alison Doody | See full cast and crew »"],
      "reviews": [
         "I first saw this film in 1989 and I now have it on DVD. I know it can come across as a little silly, or low budget, but what the heck. To me its getting better with age. Also, living in Ireland, it looks like an audition for one of our top soaps. Many characters in this film now appear in Fair City, or at least have appeared in Fair City. Barry, the ex-principle in Fair City, has hair in this film. Also, Brosnan's clothes are cool here and could be easily worn in a movie made today and still be stylish! Try to look out for the parts, where it seems Brosnan's voice has been dubbed by someone else...and just one scene of bad acting...'well maybe you should go then'. If you get a chance, try to see it and don't take it too seriously...enjoy!",
         "I really liked this film. It's basicaly the idea of transporting a fifties B-western into 80s Ireland and from my poinbt of view it works fine. Imagine the storyline of a Budd Butticher b-western: hero of shady provenance, yet an interesting character, ruthless but good at heart takes on gang who terrorises small town. Don't expect twisted story lines here, it's straight forward. The story is well told, the characters are all quite interesting and it's really well executed particularly when the townsfolk suddenly decide they've had enough of Taffin. It's also well made in terms of character development; Taffin is a slacker and finally has to find his own way. And of course there is the lovely Alison Doodey.",
         "If you are a fan of Pierce Brosnan, you'll love this film. If you are not a fan, it's still worth the rental. You can actually say it is one of those movies that is so bad that it is good. Brosnan plays a kick ass and take names debt collector who gets involved in fighting a crooked chemical plant that the residents of an Irish neighborhood oppose. Granted, the acting is sub-par, but it is very entertaining. In fact, a friend and I made a drinking game out of the flick! Whenever someone in the film says \"Taffin\", you take a drink. The best line is the one mentioned as my summary. Also look for a cameo by the late, great Dermot Morgan (BBC's Father Ted) as stand-up comedian Mickey Guest.",
         "Just finished watching this film and I don't know why everyone seems to dislike it. This movie came out in 1988, so give it a break. It doesn't advertise itself as a mind-blowing, avant-garde masterpiece. It's a simple action thriller set in Ireland and it certainly satisfies those credentials. Aside from some typically 80's gratuitous sex/violence moments (of which I have seen far worse from the genre) the film flowed fairly well and kept me entertained throughout. The characters were fairly believable if you have lived anywhere on the British Isles and the locations are well chosen. If you want to watch a movie to just kick back and pass some time, then this one will do the trick.",
         "You have seen it before in The Specialist or in films like On Deadly Ground or The Fire Below. Tough guy goes against the evil corporate empire that is out for profit and the people be damned. Of course, Steven Seagal or Sly Stallone may be quicker to jump into it that was Pierce Brosnan. He was battling his own personal demons, and just wanted to live a quiet life in the village of his birth; well, as quiet a life that can be lived by a bill collector. You know, make a little money, drink a little whiskey, and once in a while a pretty girl comes along like Alison Doody (Dr. Elsa Schneider in Indiana Jones and the Last Crusade). But, this is Pierce Brosnan and he is infinitely more watchable that the others.",
         "OK take my review with a grain of salt because I missed whatever happened before the \"town\" asked Taffin (Pierce, man thats a cool name I wish I named my Son that (Pierce that is), lol) to take on the bad guys who rammed a chemical plant onto a very nice Irish (?) town. As far as the part that I saw (which was basically the whole film because I knew where it was going), I really really enjoyed it. As a matter of fact if I could re-watch Taffin vs any of Pierce's Bond flicks, I'd take Taffin any day. I am always entertained more by English films (or in this case Irish), than I am by most American films, they just seem more unpredictable because I don't know what to expect. Taffin has Pierce looking really cool (and he still is semi young so more believable as a killer to me), plus the eye candy is not too shabby in this one with some nice topless views that you wont get in a Bond film. Is it full of plot holes? Yeah big time, but Pierce kicks some ass his way and does it in a funny way. Its an American 60's crime flick thats light on the moral dialog, its just the bad corporation and the little townsfolk hiring their gunslinger to protect them. Pierce does it in a very sly way and doesn't resort to the kill until he has to. I see a LOT of 1 votes on this film, they must hate English speaking foreign films (or they're psycho Lazenby Bond lovers out to besmirch all of Pierce's films, lol). Me, I liked the films Pierce did around this time, like Livewire and the Deceivers. I think I've liked most flicks Pierce has been in that I saw (one of those Bond flicks with a bad-guy taking over the internet or something was lame but any Bond flick is good or bad based on the bad guy not the Bond), and Taffin had me smiling, it was cool entertainment. Will I be buying the DVD, probably not (although I wonder what it's going for used on Amazon? hmmm, wow its only 75 cents thats cheap! I may get it now, the Arab channel I watched it on had the nudity but bleeped out the profanity, go figure, lol). Looking for a cool, mindless, Irish (!), action flick? Check out Taffin, I'm glad I did!",
         "When most people think of Pierce Brosnan, they most likely think of such signature roles like that of James Bond, the remake of the \"Thomas Crown Affair\", or \"Remington Steele\". But in 1988, between all of that, Pierce starred in a small, low budget film out of Ireland called \"Taffin\" and while nobody will hail it as Brosnan's finest hour, it is a curiously entertaining film (I've always wondered how Brosnan ended up in this one; after all he was ,by this time, fairly well known from \"Steele\". Perhaps he just needed something to do or needed the money but since there's not much info on this film, who knows?). In the story, Brosnan plays a rough and tough debt collector named Taffin in a small town where if you owe money, you'd better pay up! Our hero demonstrates this through some simple but well choreographed fight scenes, one involving four or fiver burly chefs in a restaurant. But Taffin is not your stereotypical tough guy; he reads literature and believes in the power of using your mind before your fists. Good thing too, because he's going to need it when some corrupt developers send their goons to town to keep folks from complaining about plans to destroy a favorite park. If I had to guess what makes the movie watchable, it would probably come down to Brosnan's cool under pressure performance which, more than anything, is the driving force of the film. It also helps that Alison Doody of \"Indiana Jones and the Last Crusade\" fame adds some fun-and eye candy-to the mix as the love interest. Don't get me wrong; the film has it issues, such as certain areas where the editing and story don't seem to flow quite right and parts that are supposed to be serious but you just can't help but laugh your ass off (see the part where Taffin screams \"Then maybe you shouldn't be living heeeeeeeeeeeeere!\". Never fails to bring a smile to my face). But all things considered, \"Taffin\" is not the worse movie ever made and if you happen to catch it with some drunk friends or on a rainy day, you probably won't regret it.",
         "An Irish debt collector is asked by his local community to help rid the town of developers bent on building a chemical plant on the outskirts of town. The developers are ruthless and have sent their heavies into town to keep the locals quiet.... Brosnan plays the tough guy with aplomb in this, typical generic thriller from the eighties, which owes a lot to Burt Reynolds 'Malone'. The only thing missing from this movie is a Leprechaun and Liam Neeson, because it's as Irish as can be. Everyone drinks Guinness, eats stew and knows Patrick Bergin. It's borderline archetypal to the demographic, but it's handled okay. Brosnan is the thug with a heart, and we know this because he threatens people with a twinkle in his eye, loves his family. and takes great care of his hair. it's all pretty bland stuff, and the Local Hero meets Rambo vibe doesn't really hold, but it's funny for all the wrong reasons. The siege with the old man is funny, and for some reason, everybody shouts at one point in the film, and Brosnan wears dark glasses indoors at one point. It's no wonder that this film has been forgotten about, because in all fairness, it's forgettable.",
         "Had seen this circulating on Netflix for a while, was only persuaded to watch it when I realised Alison Doody from The Last Crusade was in it. Even though she's old enough to be my mum she did look good back in the day! Pierce Brosan stars in the titular role as a tough-as-nails Irish debt- collector. He's a fairly realistic depiction of the 'local tough guy' who sure as hell knows how to get the job done. He gets in a little over his head with some thugs but is able to use his brains as well as his brawn to overcome the odds. Performances are good and well acted, Brosan and Doody especially. Although some of the accents are a little hit and miss. Even though those two are both Irish they don't actually sound it at times, whereas other times they do. Although maybe that's just me...",
         "I am, frankly, puzzled by this film. On paper, it must have sounded fine, but if there is anything good about the film, it ended on paper. Even with several well-seasoned actors, and a rather nice location, the film fails in every possible way. The acting is wooden, the interior sets look as though they were borrowed from high school plays, the dialogue is somewhere between inane and pathetic. The film has no flow, no tempo, and barely a narrative. It also has no humor, no horror, no excitement, no suspense. I hope that's not a spoiler... The motivation of the main characters seems flimsy, at best, and though a film, it seems very much as though it were a play, because of the modest number of people who actually do anything or have any lines to say. All of the \"bad guys\" speak as though they had studied every gangster B-film ever made. I can't imagine that *anyone* ever gave this film anything but the lowest possible score but some people must have liked it. Hard to imagine."
      ],
      "genres": [
         "Action",
         "Thriller"
      ],
      "productionCompanies": [
         "United British Artists (UBA)",
         "Metro-Goldwyn-Mayer (MGM)",
         "Rafford Films"
      ],
      "summaries": ["An Irish tough-guy debt collector is asked by his local community to help rid the town of developers bent on building a chemical plant on the outskirts of town. The developers are ruthless and have sent their heavies into town to keep the locals quiet."],
      "budget": 0
   },
   "movielensId": 3523,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1988-02-26",
      "dvdReleaseDate": "2000-03-28",
      "directors": ["Francis Megahy"],
      "runtime": 96,
      "movieId": 3523,
      "title": "Taffin",
      "mpaa": "R",
      "actors": [
         "Pierce Brosnan",
         "Ray McAnally",
         "Alison Doody",
         "Jeremy Child",
         "Dearbhla Molloy",
         "Jim Bartley",
         "Alan Stanford",
         "Gerard McSorley",
         "Patrick Bergin"
      ],
      "imdbMovieId": "0096211",
      "originalTitle": "Taffin",
      "genres": [
         "Action",
         "Thriller"
      ],
      "youtubeTrailerIds": ["VF6SxjLBfHk"],
      "plotSummary": "When a small Irish town is terrorized by a corrupt business syndicate, a lone hero (Brosnan) wages an all out war.",
      "tmdbMovieId": 28975,
      "avgRating": 2.88462,
      "releaseYear": "1988",
      "numRatings": 52,
      "posterPath": "/g0QrRK5Ml2n1qaeF74P4iG3pNnH.jpg"
   }
}