{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "american football",
            "id": 579
         },
         {
            "name": "trainer",
            "id": 1482
         },
         {
            "name": "twin sister",
            "id": 1608
         },
         {
            "name": "suppressed past",
            "id": 1660
         },
         {
            "name": "psychiatrist",
            "id": 15106
         },
         {
            "name": "extramarital affair",
            "id": 34094
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0102713",
      "video": false,
      "title": "The Prince of Tides",
      "recommendations": [
         9941,
         10168,
         10551,
         10631,
         10337,
         1058,
         106143,
         12560,
         11352,
         32221,
         22414,
         31052,
         47889,
         58886,
         25985,
         8130,
         61280,
         45225,
         4639,
         16771
      ],
      "backdrop_path": "/b3ipvciomRvSxyhdbQdq446mAM2.jpg",
      "revenue": 74787599,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Tom Wingo",
               "gender": 2,
               "credit_id": "52fe435b9251416c7500d3d1",
               "name": "Nick Nolte",
               "profile_path": "/o6O7WP3vokKstxJFMiiyRMNyPsH.jpg",
               "id": 1733,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Susan Lowenstein",
               "gender": 0,
               "credit_id": "52fe435b9251416c7500d3d5",
               "name": "Barbra Streisand",
               "profile_path": "/dniQkFMeSApui14REFpqeZhlaKK.jpg",
               "id": 10400,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Sally Wingo",
               "gender": 1,
               "credit_id": "52fe435b9251416c7500d3d9",
               "name": "Blythe Danner",
               "profile_path": "/vGv4EMRcy7xrRt8OvDzSuXohXjv.jpg",
               "id": 10401,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Lila Wingo Newbury",
               "gender": 1,
               "credit_id": "52fe435b9251416c7500d3dd",
               "name": "Kate Nelligan",
               "profile_path": "/4GpQvniLNMKF19qtHMb0tBBgNce.jpg",
               "id": 18794,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Herbert Woodruff",
               "gender": 0,
               "credit_id": "52fe435b9251416c7500d3e1",
               "name": "Jeroen Krabbé",
               "profile_path": "/A5Mks6zi6Xzt9A8fxBWc3wdlvhx.jpg",
               "id": 1924,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Savannah Wingo",
               "gender": 1,
               "credit_id": "52fe435b9251416c7500d3e5",
               "name": "Melinda Dillon",
               "profile_path": "/f4DU3lNCJqNVgwDZmHMlNV96rKV.jpg",
               "id": 4778,
               "order": 5
            },
            {
               "cast_id": 19,
               "character": "Eddie Detreville",
               "gender": 2,
               "credit_id": "55e235d592514162cd0008f8",
               "name": "George Carlin",
               "profile_path": "/xmSn6p5QVn66UK2ueEJisrUR5Bg.jpg",
               "id": 15903,
               "order": 6
            },
            {
               "cast_id": 20,
               "character": "Bernard Woodruff",
               "gender": 2,
               "credit_id": "55e235f992514162c20009e3",
               "name": "Jason Gould",
               "profile_path": null,
               "id": 21064,
               "order": 7
            },
            {
               "cast_id": 21,
               "character": "Savannah Wingo",
               "gender": 1,
               "credit_id": "55e23697c3a3680b4f000a03",
               "name": "Nancy Moore Atchison",
               "profile_path": null,
               "id": 975134,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe435b9251416c7500d3eb",
               "name": "Pat Conroy",
               "profile_path": null,
               "id": 64839,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 1,
               "credit_id": "52fe435b9251416c7500d3f1",
               "name": "Becky Johnston",
               "profile_path": null,
               "id": 14588,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe435b9251416c7500d3f7",
               "name": "Cis Corman",
               "profile_path": null,
               "id": 3662,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe435b9251416c7500d3fd",
               "name": "Andrew S. Karsch",
               "profile_path": null,
               "id": 64841,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe435b9251416c7500d403",
               "name": "James T. Roe III",
               "profile_path": null,
               "id": 64842,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe435b9251416c7500d409",
               "name": "Barbra Streisand",
               "profile_path": "/dniQkFMeSApui14REFpqeZhlaKK.jpg",
               "id": 10400,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe435b9251416c7500d40f",
               "name": "James Newton Howard",
               "profile_path": "/5UTEMYS7rydwe7ooOmj2dLRFuu2.jpg",
               "id": 1213,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe435b9251416c7500d415",
               "name": "Stephen Goldblatt",
               "profile_path": null,
               "id": 5582,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe435b9251416c7500d41b",
               "name": "Don Zimmerman",
               "profile_path": null,
               "id": 15005,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe435b9251416c7500d421",
               "name": "Barbra Streisand",
               "profile_path": "/dniQkFMeSApui14REFpqeZhlaKK.jpg",
               "id": 10400,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe435b9251416c7500d427",
               "name": "Pat Conroy",
               "profile_path": null,
               "id": 64839,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 6.726833,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10333,
      "vote_count": 82,
      "budget": 30000000,
      "overview": "A troubled man talks to his suicidal sister's psychiatrist about their family history and falls in love with her in the process.",
      "similar": [
         634,
         10637,
         112160,
         858,
         141,
         242224,
         43923,
         437557,
         297762,
         9563,
         283227,
         1375,
         27586,
         25968,
         2771,
         9587,
         3134,
         11236,
         1440,
         13075
      ],
      "original_title": "The Prince of Tides",
      "runtime": 132,
      "poster_path": "/pstlHVvLHV9WWU3mgxn5WMKBVX9.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
         "name": "Columbia Pictures",
         "id": 5,
         "origin_country": "US"
      }],
      "release_date": "1991-12-25",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "A story about the memories that haunt us, and the truth that sets us free.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Barbra Streisand"],
      "runtime": 132,
      "synopsis": null,
      "writers": [
         "Pat Conroy",
         "Pat Conroy"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0102713/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI5NDQ0MTY5M15BMl5BanBnXkFtZTcwMjkwNTYyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Barbra Streisand, Nick Nolte, Blythe Danner | See full cast and crew »"],
      "reviews": [
         "I avoided this movie because I did not care to see a romance involving Barbra Streisand and Nick Nolte. When we finally rented the movie, it turned out to be so, so much more. An incredibly intense film. I was never of fan of Nolte, but what a tremendous performance! It moves me to tears every time I watch this film. I am amazed the IMD reviewers give it such a low rating.",
         "The Prince of Tides is an exceptional movie! It is filled with emotion, humor, adventure, and pathos. Nick Nolte is the heart of the film. He is a broken man, covering up for the past, trying to please his family, but unable to open up and absolve himself of the dysfunction of his past life. He travels to New York to try to help his sister by uncovering what he has been hiding, with the help of a psychiatrist (Barbra Streisand). He is enchanted with her, and is therefore able to open up and reveal the secrets deep within his heart. The emotions that Nick is able to impart to his audience is a joy to see. I learn more about him every time I view this movie. He is a versatile actor and is truly underrated. He DEFINITELY deserved the Oscar for best actor for this difficult role. Barbra Streisand was fantastic as the psychiatrist who had her own secrets, and her son Jason was terrific as the rebellious son who wanted to please his father, but who needed to find himself by taking on the challenge of playing football. I never tire of this movie, and each time I view it, I get more out of it. The \"Prince of Tides\" has everything I want in a movie, and if I were to rate it, I would give it 4 stars.",
         "I have seen this movie many times and it always holds me. Its rhythm, cinematography and casting is perfect and the story never fails to deliver. Tom Wingo, played by Nolte in an all-time best for him, has to go to New York to help his twin sister, Savannah Wingo, played by Melinda Dillon who has attempted suicide for the umpteenth time. Tom is aware there are ghosts in the family but wants to keep them submerged. However with the love for his sister and the encouragement of her psychiatrist, Lowenstein, played by Streisand, the truth begins to unfold along with a love between Lowenstein and Tom who are both in unhappy marriages. There are no easy solutions here to the many issues that are raised, suffice is to say that Streisand, who also directs, keeps a gentle hand in and does not wham home any major emotional points. George Carlin is deft in a minor role, as is Blythe Danner as Tom's wife. The film never fails to pack a punch for me. 9 out of 10. Kudos to all, not a false note.",
         "Throughout the 80s and 90s, Barbra Streisand has grown in stature (albeit sporadically) as a formidable producer and director of social drama for both films and TV. The apex of her behind-the-camera career came with \"The Prince of Tides,\" a poignant study of a man coping with the long-term effects of childhood trauma. Streisand nurtures this pet project from start to finish (co-adapted by Pat Conroy from his epic novel), finding a precise heartbeat for the profoundly sentient piece. Despite a rather protracted love story and one too many climaxes, Streisand, who also co-stars, never loses sight of the novel's primary intent. Streisand graciously hands the spotlight over to actor Nick Nolte, who gives the most sensitive, emotionally complex performance of his varied career. Tom Wingo is a walking shell of a man who quells his pain with a drink, an easy smile, a cleverly foul remark, and a bitter, uncontrollable outpouring of anger. A one-time Southern-bred football coach-turned-teacher, he has grown increasingly irresponsible and disconnected over the years. With a troubled marriage hovering over him, he conveniently heads off to New York City at the urging of sister Savannah's psychiatrist, Susan Lowenstein, following his twin's most recent wrist-slashing attempt. His purpose is to fill in the missing details of her tormented past (she has blotted out all childhood memories) in order to help steer the psychiatrist in her recovery process. Eventually, Tom, who lacks faith in psychiatry, finds himself facing his own demons as these initial discussions about Savannah take a suddenly dramatic and romantic turn. In addition to Nolte's Oscar-nominated showcase, much of the film's strength lies in the highly concentrated flashback sequences as Tom recalls his turbulent family life. Kate Nelligan (also Oscar-nominated) is simply extraordinary as Lila, Tom's brittle, often callous mother, who quite understandably vows to remarry into money after surviving a horrific first marriage to Tom's violent, alcoholic, dirt-poor father (played by an absolutely terrifying Brad Sullivan). Nelligan grabs this role literally by the throat and allows her character no apologies for her flawed, self-serving logic, despite the effects it would have on her children, as her wealthy second husband starts exhibiting the same abusive traits as the first. Kudos must also go to the three strong young actors who play the Wingo siblings as children for reenacting the more horrific elements of this story. Some of the other present-day roles, however, are hit-and-miss in their effectiveness. Blythe Danner has some strained though affecting moments as Tom's neglected wife. Sadly, the vital role of Savannah is nearly excised from the film. What with the talented Melinda Dillon egregiously reduced to such an insignificant extra, one can only rue the dramatic potential untapped here. As Savannah's neighbor and trusted friend, George Carlin seems to be around merely to show off New York gay chic -- providing mild amusement, a bit of pathos, and little else. On a brighter note, Jason Gould (Barbra's real-life son) acquits himself surprisingly well in the difficult role of Lowenstein's antagonistic son who slowly bonds with Tom's absentee father figure -- showing for once that nepotism isn't necessarily blind or reckless. Dutch actor Jeroen Krabbé gets brief but noticeable exposure as Herbert Woodruff, Lowenstein's charming, smug-elegant husband, a renown concert violinist who demonstrates more affection for his Stradivarius than either his wife or child. There is one telling dinner scene at his opulent Manhattan high-rise in which the out-classed Wingo gets to put Woodruff in his place. As for Streisand herself, many will invariably take her to task for casting herself in the fundamental role of Susan Lowenstein. A star of such magnitude always faces the daunting task of presenting a fully- realized character, and Streisand is only marginally successful here. Although there is undeniable sexual chemistry between her and Nolte, it's hard to overlook her somewhat glossy approach to the role and the unethical intentions of her character. One can only imagine the ramifications of such a harmful act had her suicidal patient ever uncovered the illicit affair between her brother and psychiatrist. Director Streisand, however, must be applauded for her explicit attention to exterior details. A visually resplendent picture, great care was taken to get the right look and feel. Notice particularly the lovely allegorical scenes with the children at the beginning and end. And with Streisand's exceptional musicianship, it is hardly surprising that James Newton Howard's lush score is one of the most beautifully designed ever (in fact, I borrowed it for my own commitment ceremony in 1996). It floods the film with an unexpressible tenderness. Nick Nolte's bookend narration is perfect as well -- warm, wise, poetic and reflective. And so, despite the flaws \"The Prince of Tides\" may have, Streisand certainly shows that her heart was in the right place.",
         "I'm afraid Streisand's overblown ego defeats this film. Taking what is essentially over-ripe Tennessee William's material, this may have had possibilities. But Streisand's character (and especially the director's fawning to her character (no surprise, since she directed it) makes this an ego journey of immense proportions. I don't know how Nolte survived this and how he crafted such a magnificent performance. I don't know how he managed to mutter the film's last lines (\"Lowenstein, Lowenstein.\") without breaking into laughter. (My guess...liquor and multiple takes.) Streisand as a performer needed someone to fetter her (she can give good performances when restrained.) Streisand the director needed to keep from falling in love with Lowenstein. (She did very well with the opening...except the titles and cast lists interfered with the story.) At the end, the only impression left is an unsubtle argument for Streisand's greatness. An argument that fails to persuade.",
         "The movie should have focused solely on the psychological make-up of the Nick Nolte character, Tom, or of his mother. Instead we gets tons of the usual New Yorker vs. Southerner dialogue, a silly romance between Nick and Barbra which serves no purpose, a pointless interaction of Tom with Lowenstein's son. The childhood events of Tom and his family were so intense that the secondary plots were fluff. On top of that, the \"yelling\" school of acting was sometimes employed. When you can't think of any good dialogue, simple have the actor rant and rave loudly way out of proportion to the issue discussed. Exactly what made Tom lose and gain back interest in his loving family was really important but not really explained.",
         "Streisand directed Prince Of Tides in'91, and was not honored by the Oscars with a nomination for Best Director;. fortunately the Directors Guild and Golden Globes did not ignore her, and the film. Beautifully directed, acted, scored and phtographed, it deserved all the praise it has received. Some fans of the book were disappointed because so much was deleted.. true, maybe should have been or will someday be a mini series... but Streisand and Conroy, caught the heart of the book, the dysfunctional family.. and the problems that emerged in future generations; Nolte was excellent as was Kate Nelligan... see it again and again, Brava Babs !!",
         "Barbra Streisand's visual presentation of Pat Conroy's novel is excellent! I never expected a film under her direction to be this great and very expressive. Nick Nolte's acting is excellent and I can't think of any actor who can play his role as Tom. For those of you who never seen this film, The Prince of Tides is a drama that tackles family, time and emotions. The film is indeed a great imitation of life!",
         "It is next to impossible to turn a 800 page novel into a consumable movie without losing some of what made the novel brilliant in the first place (which this one is). The novel is about growing up in South Carolina and about the love of three siblings for each other. The novel takes its name from what the sister calls one of the brothers: The Prince Of Tides. But, Luke Wingo, the title character is seldom seen in this mediocre adaptation. Ms. Streisand decided to make it a love story about her character and Lukes brother Tom. She missed the entire point, and screwed up a good story that would have better been left as a mini-series because of its length and depth. (She needs to watch LONESOME DOVE or ROOTS or CENNTENIAL to see that you can make masterpeices on tv, especially if you have a huge text to work from). However, Nolte is perfectly cast, and plays the part of a downtrodden southern everyman very well. The few childhood flashback scenes that they do film are done very well. Too bad Babs didn't realize this was the meat of the novel. Oh well, at least she didn't sing.",
         "Part I of My Critique - I've read some of the comments here, but unfortunately, have never read the book. Firstly, it's easy to detect the Streisand haters among these \"critics\"....your hatred is truly sophomoric, and doesn't serve in your recounting an objective critique of the film. As for this film itself, I think that Nick Nolte was absolutely the best element in it, as well as Kate Nelligan. I had never been a Nick Nolte fan, and was very surprised by his layered characterization. He did more with just a certain look, no words, than most actors can hope to accomplish reciting non-stop for two hours straight. In the simple shot of his looking at his daughter blow out her birthday candles and smiling when she's done, right after we are treated with a flashback of his horrid past, was enough to make me break. You could see him hiding some long-held, buried pain behind his genuine smile and love for his daughter. It was, for me, a very subtle, yet powerfully moving moment. I think Streisand did a fine job directing this film, and was definitely robbed of a best director nomination. Several of the academy members who presented Oscars that evening, including Billy Crystal, Liza Minnelli, Shirley MacLaine, and Jessica Tandy (who REALLY made a point in a beautifully sarcastic delivery to mention how ridiculous it was that the film was nominated, but not the director. This almost NEVER happens, and it certainly happened that evening because there are so many academy members who despise Streisand.) Minnelli and MacLaine made a point of saying, before they read nominations for the particular award they were giving, that they would love to be directed by Streisand some day....more digs at the Academy. ANYWAY, beyond the snub, I thought the film overall was very poignant. Where it falls short, however, are in the following areas. First, Streisand and/or the screenwriter (LaGraveness) shouldn't have focused really any time developing a love story between Streisand and Nolte. This was completely unnecessary. For this reason alone, I might not have even voted the film as one of the best of the year....I don't remember what else came out that year. My contention is that, if you're going to honor a film with the Oscar, you should also honor the director, since this film had Streisand's vision all over it. In fact, LaGraveness I believe was also a bit disgruntled with the many rewrites that Streisand made of his screenplay. More time should have been devoted to the horrific background story of Nolte's family, and of his sister. I understand that her character was actually schizophrenic for many years, probably triggered by her rape at 13, but that was not portrayed at all in the movie. Also, I thought Jason Gould did a fine job in his little part. However, I think it was disingenuous to even include that whole storyline in the movie. He was introduced in a slice of voice-over offered by Streisand's character when she talks to Nolte during a transitional scene when she invites Nick Nolte inside her apartment after he walks her home from Eddie's (George Carlin) party. She asks \"why don't you come inside. I'd like you to meet my son.\" I know the plausibility we're supposed to accept is that, her son is a bit difficult and he's in football, and Nolte's character is a football coach who might be able to coach him privately....but I just didn't buy this whole plot line. It was an opportunity for Streisand to give her son a part in her film...that's it. He did all right in the part....I just didn't think this element was necessary. More showcasing for Streisand. What else....the love story. I know that Tom Wingo (Nolte) is not her patient, so, romance between a doctor and his/her patient isn't an issue. And, it is plausible that she is pained as well, since her husband is having an affair, we later learn, with another woman. However, it would have been far more realistic and plausible if no romance came up, and no opening up on Streisand's part occurred at all. Or perhaps we might have been offered only a glimpse of her also troubled life, even though it's shielded behind the veneer of her being a successful psychiatrist. But to have her character let loose in a full-blown romance with Nolte's character was a plot line that took so much time away from what I really wanted to see, which was more of the background of the Wingo family, and particularly more of the sister herself....the raison d'etre of the film itself. Part I Ends. See Part II for the rest of my critique."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Columbia Pictures Corporation",
         "Barwood Films",
         "Longfellow Pictures"
      ],
      "summaries": [
         "Tom Wingo is unhappy with his life. His wife doesn't understand him and he also doesn't get along with his dominant mother. When his sister attempts suicide, her psychologist Susan Lowenstein consults him. Patiently and cautiously she uncovers the terrible secret hidden in Tom and Savannah's childhood. On the other side she's unhappy too and so both help each other to find their way back to life.",
         "When a Southern born New York writer tries to commit suicide, her \"unemployed-football-coach\" twin brother, Tom Wingo, comes to her aid. While tending to his sister Savannah's care he meets her psychiatrist, Dr. Susan Lowenstein. Dr. Lowenstein, desperate to unlock the door to her patient's self-destructive pattern, relies on Tom to be his sister's memory. What she doesn't realize is that the last thing Tom wants to do is remember. Haunted by a painful childhood and a domineering mother, Tom discovers the only thing worse than not remembering is not telling.",
         "A troubled man talks to his suicidal sister's psychiatrist about their family history and falls in love with her in the process."
      ],
      "budget": 30000000
   },
   "movielensId": 3528,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1991-12-25",
      "dvdReleaseDate": "2001-11-06",
      "directors": ["Barbra Streisand"],
      "runtime": 132,
      "movieId": 3528,
      "title": "The Prince of Tides",
      "mpaa": "R",
      "actors": [
         "Nick Nolte",
         "Barbra Streisand",
         "Blythe Danner",
         "Kate Nelligan",
         "Jeroen Krabbé",
         "Melinda Dillon",
         "George Carlin",
         "Jason Gould",
         "Nancy Moore Atchison"
      ],
      "imdbMovieId": "0102713",
      "originalTitle": "The Prince of Tides",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [
         "gyy_A4wNQa8",
         "GUIP9ktJWFw"
      ],
      "plotSummary": "A troubled man talks to his suicidal sister's psychiatrist about their family history and falls in love with her in the process.",
      "tmdbMovieId": 10333,
      "avgRating": 3.09734,
      "releaseYear": "1991",
      "numRatings": 1839,
      "posterPath": "/pstlHVvLHV9WWU3mgxn5WMKBVX9.jpg"
   }
}