{
   "tmdb": {
      "original_language": "fr",
      "keywords": [],
      "imdb_id": "tt0108167",
      "video": false,
      "title": "Smoking / No Smoking",
      "recommendations": [
         364002,
         203226,
         194602,
         49479,
         136556,
         147306,
         202768,
         134220,
         237957,
         127004,
         88302,
         269969,
         76388,
         45802,
         64544,
         124485,
         50106,
         42238,
         104441,
         147159
      ],
      "backdrop_path": "/70LBEKnQdTmqU9w1c8Ko2jOcqKA.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Celia Teasdale / Sylvie Bell / Irene Pridworthy / Rowena Coombes / Josephine Hamilton",
               "gender": 1,
               "credit_id": "52fe4657c3a368484e08b787",
               "name": "Sabine Azéma",
               "profile_path": "/lul5wy6v791ka5YzxpVuPqwLPQA.jpg",
               "id": 20851,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Toby Teasdale / Miles Coombes / Lionel Hepplewick / Joe Hepplewick",
               "gender": 2,
               "credit_id": "52fe4657c3a368484e08b78b",
               "name": "Pierre Arditi",
               "profile_path": "/g9p7oXZrrhi1HSZJ5hM1mrV9BmF.jpg",
               "id": 24816,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Narrator",
               "gender": 2,
               "credit_id": "52fe4657c3a368484e08b78f",
               "name": "Peter Hudson",
               "profile_path": "/wKCL5l3Ewu9k07pkv3nyeO8e1bB.jpg",
               "id": 220574,
               "order": 2
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4657c3a368484e08b783",
               "name": "Alain Resnais",
               "profile_path": "/3gSyKBQHgpkYVVgkC149sW4RDRc.jpg",
               "id": 11983,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4657c3a368484e08b795",
               "name": "Bruno Pésery",
               "profile_path": null,
               "id": 71400,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4657c3a368484e08b79b",
               "name": "Michel Seydoux",
               "profile_path": null,
               "id": 70181,
               "department": "Crew",
               "job": "Associate Choreographer"
            },
            {
               "gender": 0,
               "credit_id": "570103a1925141454a00073c",
               "name": "Alan Ayckbourn",
               "profile_path": null,
               "id": 22152,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 2,
               "credit_id": "570103ef9251416783005322",
               "name": "Jean-Pierre Bacri",
               "profile_path": "/sjXoA3DXsBi4MsymfNELa6idUk4.jpg",
               "id": 28281,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5701041fc3a3686e800055ec",
               "name": "Anne Dutter",
               "profile_path": null,
               "id": 1263506,
               "department": "Crew",
               "job": "Translator"
            },
            {
               "gender": 1,
               "credit_id": "57010462925141454a000756",
               "name": "Agnès Jaoui",
               "profile_path": "/5iapBWdu5lnnZ0hLOFVYPY2yslB.jpg",
               "id": 28279,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "570104a9c3a3686e98005749",
               "name": "John Pattison",
               "profile_path": null,
               "id": 168772,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "570104dc9251416789005010",
               "name": "Renato Berta",
               "profile_path": null,
               "id": 19054,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5aa815dc0e0a263dd6023241",
               "name": "Michel Seydoux",
               "profile_path": null,
               "id": 70181,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "5aa815e60e0a263dc1021e7b",
               "name": "Albert Jurgenson",
               "profile_path": null,
               "id": 11198,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5aa815ed9251415e420211c9",
               "name": "Jacques Saulnier",
               "profile_path": null,
               "id": 24297,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "5aa815f4c3a36839cb0222a5",
               "name": "Jackie Budin",
               "profile_path": null,
               "id": 46285,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "5aa8164b0e0a263dd0023ab9",
               "name": "Olivier Trémolet",
               "profile_path": null,
               "id": 1169389,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "5aa816540e0a263dc4023ac0",
               "name": "Daniel Deleforges",
               "profile_path": null,
               "id": 1997475,
               "department": "Directing",
               "job": "Assistant Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 1.306026,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 61560,
      "vote_count": 17,
      "budget": 0,
      "overview": "\"Smoking\" and \"No Smoking\" are two segments of the film which are based on closely connected plays. The original plays covered eight separate stories, which have been pared down to three each for these movies. At a certain point in the story of each segment, the five female characters (all played by Sabine Azema) and the four male characters (all played by Pierre Arditi) have their lives skillfully recapped in terms of \"what might have happened\" if they had made or failed to make certain choices. For example, \"No Smoking\" focuses chiefly on the relationship between the mild-mannered Miles Coombes and his infinitely more aggressive and ambitious wife, Rowena.",
      "similar": [],
      "original_title": "Smoking / No Smoking",
      "runtime": 298,
      "poster_path": "/fY0Vrqm3VboD5dvOUqPK06OFHpi.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Arena Films",
            "id": 1243,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Caméra One",
            "id": 6454,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "France 2 Cinéma",
            "id": 83,
            "origin_country": "FR"
         }
      ],
      "release_date": "1993-12-15",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Alain Resnais"],
      "runtime": 298,
      "synopsis": "\"Smoking\" and \"No Smoking\" are two segments of the film which are based on closely connected plays. The original plays covered eight separate stories, which have been pared down to three each for these movies. At a certain point in the story of each segment, the five female characters (all played by Sabine Azema) and the four male characters (all played by Pierre Arditi) have their lives skillfully recapped in terms of \"what might have happened\" if they had made or failed to make certain choices. For example, \"No Smoking\" focuses chiefly on the relationship between the mild-mannered Miles Coombes and his infinitely more aggressive and ambitious wife, Rowena.",
      "writers": [
         "Alan Ayckbourn",
         "Jean-Pierre Bacri"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0108167/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTAxMTc3MjkxNTNeQTJeQWpwZ15BbWU3MDgxNTExODI@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Sabine Azéma, Pierre Arditi, Peter Hudson | See full cast and crew »"],
      "reviews": [
         "These two gems have are an experimental, laid-back affair: instead of upping the ante visually, they have chosen to embark the viewer into a labyrinth of a plot, peppered with unforgettable dialogues served by nine characters, all played by two actors. Add to this the fact that this is also meant to be an anthropological view of that most bizarre people -the rural British- and you have a pair of truly unique and endearing movies, cinematic twins if you will. Smoking and No Smoking end up being a double-treat: one of the most mordantly funny British comedy in years and possibly the best French films of their decade. The fact that Ayckbourn's spirit still flows with manic glee, filtered by Jaoui and Bacri's masterful adaptation, is a sizable feat when you know that French and British humors are generally deemed totally incompatible. But despite the great texts, the unique sets (intentionally \"theatrical\"), the perfect, low-key costumes and the impeccable direction and editing, the real showstoppers are Sabine Azema and Pierre Arditi's with their multiple performances. Each and every one of their characters is played memorably, making for far more than an extended acting stunt on their part: you actually feel for and connect with each and every one of their incarnations, forgetting completely that they are played by the same actors, you are drawn into their characters' sometime painful, sometime painfully funny dilemmas (which all get resolved since all the possibilities are shown). This is a UFO to me: a hilarious, touching comedy with absolutely no flaws (even though some have said the running times were a little self-indulging), an experimental film that \"works\" and never feels forced, a triumph of acting... I suppose some will find it overbearing, but actors, directors and screenwriters alike should make this one of their necessary (albeit hard-to-come-by) viewings because if you're caught by the magic on screen, you won't be turning back. Although the films can be seen in any order, i would recommend you start with No Smoking as it offers a more supple introduction to the films' \"method\" and characters and also because Smoking is probably the better of the two and thus, you've got a dramatic crescendo going for yourself. For people who don't necessarily like French cinema or who don't understand the British: watch these,they're the kind of movie miracles that belong to everyone. They are that great.",
         "Resnais' distinguished Nouvelle Vague career (e.g.: Hiroshima, mon amour - Stavisky - Life is a bed of roses) demands that we give this film our serious consideration. A faithful cinematic version, in French, of a play by the great contemporary English dramatist Alan Ayckbourn, the whole enterprise might appear to superficial critics as an impossibly eccentric undertaking: A quintessentially English comedy of manners turned into a film by an entirely French team! How can two such diverse national temperaments as the Gallic and the English possibly cohabit in any meaningful creative enterprise? Well, this is the challenge, of course, and there were once philistines who thought even Shakespeare could never be attempted en Francais. The interest of this film lies, indeed, very largely in the attempts of all concerned to acculturate themselves to an alien perspective; naturally, the results are mixed, and no-one fluent in English would want to deprive themselves of the version originale. However, a talented group of French actors succeed commendably, on the whole, in communicating the very particular English humour of the play. For this chance to increase their repertoire, the actors have to thank Resnais, whose choice of Ayckbourn was far from merely eccentric. He has obviously recognised in the Englishman a person who is as typically obsessed as himself with opening up narrative structure, and in finding more creative ways to tell a story. Though a very strange hybrid (especially for an Anglophone!) the enterprise is no monstrous abortion, but actually a very elegant and worthwhile tribute by our neighbours across La Manche. This is a most attractive film version of Ayckbourn's drama. It even succeeds in retaining a great deal of the downright hilarity of the original, which, in their plays, the fellow-countrymen of Shakespeare have learned early to intermix with the sadder side of life. In other words, we have here a suitably touching, hilarious and clever, and, moreover, a fascinatingly unexpected, version of a great original. Authentic Ayckbourn, comme Resnais authentique. Shame on us in Britain that it is not commercially available here!",
         "Alain Resnais ranks among the major French director but it is hard to point out a topic in such a large panel of different movies from 'Je t'aime-Je t'aime' to 'On connait la chanson'. It's not so obvious to recognize at first sight the Resnais touch. Maybe, the only possible approach of Resnais cinema is to distinguish in it a kind of deep exploration of relationship between humans. It's obvious in 'Mon oncle d'Amerique' but it seems that Resnais has devoted himself to reveal fundamental basis of relation/communication that can exist between two human beings, as humans being in space and time and their cultural background. And, with its no-narrative structure, Smoking/No smoking is a wonderful playground for analyzer Resnais, showing beyond laugh (Sabine Azema's nervous breakdown in Smoking is one of the funniest moment of cinema I've enjoyed) and tears, silence and words, all the nuances that stem from our human part, regardless of what is due to facts and events.",
         "This is one of the most intelligent and elegant movies ever made. And, still, it's funny and somehow happy. Of course, if you don't like minimalism and a playful conception, you will not love it. But you have to see it. Growing old, Alain Resnais becomes younger and fresher. It's far younger than all the Tarantinos. He's more free. Free from the author's giant ego, free from the film-industry mechanics, free from the boredom of 90% of \"high\" french movies, free from the film-language, free from everything but its own structure. Great actors, great conception. The only limit is that it's too new and too theatrical for the normal viewer. It requires a watcher with the same kind of freedom. Sorry for my broken English. However, You have to see it, really.",
         "Once you get past the fact that French artistes have seen fit to adapt a set of Ayckbourn plays for the screen and leave the setting in Yorkshire rather than shifting it a la Hollywood to the Jura so that all the place-names, notices, etc are in English and only the dialogue is French, there is much to enjoy. Not least the adaptation by the stand-out team of Agnes Jaoui and Jean-Pierre Bacri who, even as I write, may well cop a gong at Cannes (I write this on the final day of this year's festival and their Comme d'un Image, which is also directed by Jaoui must, if there is any justice, cop a Best Screenplay Award and, in passing show Jury Foreman Quentin Tarentino how the big boys do it) and who prove here that they can adapt other writers as well as writing brilliant originals. It can take a while for the audience to adapt - especially a non-theatregoing audience - to the sets which are clearly theatrical and respect the conventions of theatre so that if a character enters a house we, the audience cannot follow as in a conventional film but must remain outside until they emerge, often as another character because that is another coup, Sabine Azema and Pierre Arditi handle ALL the acting chores between them and revel in ringing the changes on nine characters. Changes of scene and/or time lapses are marked by large 'picture-book' cards of the type used to teach infants to read universally. Weighing in at two and a half hours each this brace represents either a long haul or great value, yer pays yer money an' yer takes yer choice. As for me, I'd walk a mile for a Camel. 8/10",
         "I agree this is one of the best films made in France in the 90's decade : it is one you can view again and again without having completely mapped all the plot. It is like a maze where one likes to get lost once in a while. The two french actors are among my favorites. They have such a wide range of possibilities that they make this kind of miracle possible as a two-actor double-film possible ! Of course, this is obviously an \"exercise of style\", and it has a sort of theater atmosphere. But the theater is a very rich place for passion. It also makes me think of 18th century french theater like Marivaux which showed so much characters under pressure.",
         "Though I don't like Alain Resnais' films (boooooring!), this(these) one(s) is(are) quite (an) exception(s)...The reasons are: the ever witty actors (Popular Sabine Azema and Pierre Arditi), the talented writers (Jean-Pierre Bacri and wife Agnes Jaoui)-very good actors too in other films-, the realistic sets (all shot in studio but with done-on-purpose \"studio-like\", strange and beautiful), the atmosphere and dialogs (sooo British and likable to my opinion). Though the plot is not that much important (stories and destinies of different characters in a small English village), the interesting points are: 2 separate movies with the same beginning until Sabine Azema (Mrs Tinsdale)decides to smoke a cig' (1st movie) or not (2nd movie), actually just a bait that will change the destinies of the characters though. In both movies you have a wonderful tour de force from start to end, as the 2 actors (only 2 all the time!) play ALL the characters in different disguises (more than 10)going in and out of the screen alternatively without any flaw. I never got bored, the acting is always good and keeping. I wonder how English-speaking audiences appreciated this unusual French actor's challenge \"a la britannic\" (hope the 2 movies were just subtitled and not dubbed or you miss everything) and am curious to read further comments from them here in the future.",
         "It won 1993 Cesar award. Those are two films. Smoking and No smoking. All characters played by two comedians. Set is meant to look like pictures used to teach English to French school-children. Both films start the same except in one she decide to quit smoking while in the other she chain smokes. Then what if... and it goes off with a whole different ending for I don't know how many times. Every time you'd think this is the end and then it explores a different possibility. One advise: don't rent both films the same day. Each lasts forever."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Arena Films",
         "Caméra One",
         "France 2 Cinéma"
      ],
      "summaries": [],
      "budget": 0
   },
   "movielensId": 3530,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1993-12-15",
      "dvdReleaseDate": null,
      "directors": ["Alain Resnais"],
      "runtime": 298,
      "movieId": 3530,
      "title": "Smoking / No Smoking",
      "mpaa": null,
      "actors": [
         "Sabine Azéma",
         "Pierre Arditi",
         "Peter Hudson"
      ],
      "imdbMovieId": "0108167",
      "originalTitle": "Smoking / No Smoking",
      "genres": [
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "\"Smoking\" and \"No Smoking\" are two segments of the film which are based on closely connected plays. The original plays covered eight separate stories, which have been pared down to three each for these movies. At a certain point in the story of each segment, the five female characters (all played by Sabine Azema) and the four male characters (all played by Pierre Arditi) have their lives skillfully recapped in terms of \"what might have happened\" if they had made or failed to make certain choices. For example, \"No Smoking\" focuses chiefly on the relationship between the mild-mannered Miles Coombes and his infinitely more aggressive and ambitious wife, Rowena.",
      "tmdbMovieId": 61560,
      "avgRating": 3.42308,
      "releaseYear": "1993",
      "numRatings": 52,
      "posterPath": "/fY0Vrqm3VboD5dvOUqPK06OFHpi.jpg"
   }
}