{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0099014",
      "video": false,
      "title": "All the Vermeers in New York",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Anna",
               "gender": 0,
               "credit_id": "52fe4a9cc3a368484e15d71f",
               "name": "Emmanuelle Chaulet",
               "profile_path": null,
               "id": 239348,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Mark",
               "gender": 2,
               "credit_id": "52fe4a9cc3a368484e15d723",
               "name": "Stephen Lack",
               "profile_path": "/3GJCA4drg5bFg1GQVJz7UFmTQ6W.jpg",
               "id": 57880,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Nicole",
               "gender": 0,
               "credit_id": "59e00516c3a36861a30ab995",
               "name": "Katherine Bean",
               "profile_path": null,
               "id": 1904840,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Felicity",
               "gender": 1,
               "credit_id": "59e00525c3a36861df0ba422",
               "name": "Grace Phillips",
               "profile_path": null,
               "id": 167718,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Ariel (as Laurel Kiefer)",
               "gender": 0,
               "credit_id": "59e0052f92514124c50aee14",
               "name": "Laurel Lee Kiefer",
               "profile_path": null,
               "id": 1904841,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Gallery Owner",
               "gender": 0,
               "credit_id": "59e0053792514124c90ae696",
               "name": "Gracie Mansion",
               "profile_path": null,
               "id": 1904842,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Gordon",
               "gender": 2,
               "credit_id": "59e0053ec3a368624d0a97c3",
               "name": "Gordon Joseph Weiss",
               "profile_path": null,
               "id": 163670,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Max",
               "gender": 0,
               "credit_id": "59e00545c3a368620d09afc5",
               "name": "Roger Ruffin",
               "profile_path": null,
               "id": 1904843,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4a9cc3a368484e15d71b",
               "name": "Jon Jost",
               "profile_path": "/gNMdsP5Hg9x5xyyAfREvestTGzm.jpg",
               "id": 1012097,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5509d1bfc3a3682b46003af4",
               "name": "Jon Jost",
               "profile_path": "/gNMdsP5Hg9x5xyyAfREvestTGzm.jpg",
               "id": 1012097,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "59e0049dc3a36862270a5dcf",
               "name": "Jon A. English",
               "profile_path": null,
               "id": 1478538,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "59e004a5c3a36861ec0ada85",
               "name": "Lindsay Law",
               "profile_path": null,
               "id": 93159,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "59e004ad92514125050a9b67",
               "name": "Henry S. Rosenthal",
               "profile_path": null,
               "id": 381120,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "59e004b4925141251f0b0972",
               "name": "Jon Jost",
               "profile_path": "/gNMdsP5Hg9x5xyyAfREvestTGzm.jpg",
               "id": 1012097,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "59e004bac3a36861a30ab916",
               "name": "Jon Jost",
               "profile_path": "/gNMdsP5Hg9x5xyyAfREvestTGzm.jpg",
               "id": 1012097,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "59e004c392514125050a9b89",
               "name": "Molly Bradford",
               "profile_path": null,
               "id": 928406,
               "department": "Production",
               "job": "Production Manager"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.021609,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 123757,
      "vote_count": 0,
      "budget": 0,
      "overview": "Anna, a French actress, is approached by financial broker Gordon in the Vermeer room of a New York gallery. However, romance does not ensue...",
      "similar": [],
      "original_title": "All the Vermeers in New York",
      "runtime": 87,
      "poster_path": "/kPJKBvgy5IlIMZiFk7ERGMm8NrQ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Complex Corporation",
            "id": 92460,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "American Playhouse",
            "id": 3906,
            "origin_country": ""
         }
      ],
      "release_date": "1991-02-24",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Jon Jost"],
      "runtime": 87,
      "synopsis": null,
      "writers": ["Jon Jost"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0099014/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI5NDExMjkzOF5BMl5BanBnXkFtZTcwMDgxMjIyMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Emmanuelle Chaulet, Stephen Lack, Katherine Bean | See full cast and crew »"],
      "reviews": [
         "The film begins with a static shot of the tops of buildings, turrets and spires, an unnamed city that looks old and European but eventually turns out to be Manhattan. Three young, pretty female roommates in a big apartment, one an aspiring actress, another a singer, the third involved in the art world. There's some cutesy, inconsequential dialogue; we are struck right away with the director's command of image, sound (particularly off-screen) and his exquisitely put together sets. Soon we move to an art gallery setting, a young man in a leather jacket arguing angrily with a dealer who is trying to sell his work -- will he be the protagonist? The film in its first couple of reels doesn't give us any answers here; the man leaves with a wealthy patron and potential buyer, but we don't follow them and move on instead to another a brief scene set in the financial world, as a broker or buyer of some kind (Stephen Lack) alternates between shouting about business and some kind of personal issues on the phone. Close on the heels of this scene, we enter another segment of the art world, as one of the roommates - aspiring French actress and student Anna (Emmanuelle Chaulet) is seen perusing the old masters - chiefly Rembrandt and Vermeer - at what turns out to be the Metropolitan Museum of Art, and is in turn perused by our stockbroker, who hands her a note at which point she leaves. This is the scene that introduces the spectacular and fairly indescribable avant-jazz/classical score by Jon English, one of the best soundtracks I've ever heard, and it also seems to introduce the rest of the film as we will now focus on these characters, and on the difficult lives they lead while being surrounded by and comforted by all the great art - photography, painting, music and architecture - that suffuses the film. An awkward scene in which Anna pretends to not speak English and is accompanied by her roommate Felicity (Grace Philips) as pretend-translator meets Mark (Lack) at a restaurant seems distancing and off-putting, and it seems very uncertain as to whether these two can -or should- meet again. There's also a very subtle and only briefly stated minor theme here about \"home\" and what it means; Mark is clearly Canadian and Anna French, and neither seems to really be comfortable - in Mark's case, with his profession and his inner life, in Anna's with America and perhaps her career. Is Mark some kind of creepy stalker? Is Anna a naive innocent, or is she planning on using the wealthy stockbroker for his money? The film never really answers these questions thoroughly, never really gets at what makes Mark so unhappy, why he even more than any of the characters actually working in the arts seems so attracted to beauty and culture; instead it peers obliquely in a few long scenes at the intersections, contemplating and watching, never telling. There is a gorgeous lengthy, probing tracking shot that traces an irregular path through the columns in the portico of the Met that seems to exist just to remind us of how beautiful, how stately and granitic art in the form of architecture can be, while the human beings are utterly frail and often incapable of ever reaching the transcendence in their own lives that they can in fact reach on canvas, in strings and percussion, in marble. I don't want to spoil the rather surprising ending, but I will add that what blew my mind even more than the finish of the film itself was learning that the entire film was improvised - on camera. Completely improvised; Jost says that he didn't have a story at all, really except that it had to involve art (a prerequisite of his funding), and he had the last shot in his head from the beginning. I found that out courtesy of his website, http://www.jon-jost.com/ where you can learn much more about this great but completely unknown American independent filmmaker, and buy some of his otherwise inaccessible films. I'd only seen one Jost film before, \"Frameup\" (1993) which had both the single most irritating character I've ever seen in a film and one of the most powerful and devastating endings I've experienced. On the basis of my memory of that film and this masterpiece, I definitely most see more. All the Vermeers had the widest release of any of Jost's films and might actually be available to some of you, and for its aesthetic pleasures alone - the beauty of the score which verges from neo-baroque to post-Ornette Coleman atonal free jazz, the beauty of the female cast and Chaulet in particular, the sumptuous art and sets, and the striking photography (in 35MM, as far as I know Jost's first in the format) I recommend this to anyone even remotely adventurous. Highest rating",
         "Jon jost is an independent film-maker flying under the mainstream radar,quietly turning out masterpieces like this film.The plot is very simple, but this is really a film that is meant to be felt rather than thought about.The images are often breathtakingly beautiful-the camera's dance around the pillars is one of the most amazing sequences I've ever seen in any film-Jost can turn the mundane into poetry.And that's the point,Jost is a poet-not a craftsman.Like Lynch and Kubrick his films have a dream logic and work on a subconscious gut level.Turn off your mind relax and let this gorgeous,undiscovered gem of a film wash over you.A disturbing journey at times but always truthful and always beautiful.",
         "If you are a fan of independent and innovative filmmaking, this movie is for you. It's visuals are tremendous in their composition, movement, colors, etc. It's sense of editing and story progression is involving and thought provoking. This is the kind of movie that makes you forget traditional narrative expectations of \"what will happen next?\" or questions like \"what is going on?\" and instead prompts you to just experience, perceive, and feel the film. A must-see for anyone interested in non-traditional filmmaking and for anyone interested in a beautiful movie.",
         "Jon Jost impressed me quite a bit with this. I'll definitely need to check out more of his stuff. The way he combines very formal camera-work with naturalistic, improvisational performances struck me as really great. Best of both worlds, as it were, yet the styles didn't clash at all. I found it had all the life and spontaneity of, say, a Cassavetes film, but without the kind of off-the-cuff hand-held cinematography I've come to expect from that sort of film. It reminded me more than a little of Antonioni, actually. It also managed to be very funny in a great, observational kind of way. It actually really amazes me how it captures that little spark of life, that nuance, while at the same time being visually so thought-out and impressive to look at (with lots of nice breaking of the 180-degree rule too). Unfortunately the DVD transfer I saw was not the best, so i felt like i wasn't quite getting the full experience. Also, a few slightly indulgent moments (though nothing intolerable or even much different from the more trying moments of Angelopoulos or Carlos Reygadas) left the film less than perfect, along with an ending that I felt didn't quite come off the way it should have.",
         "I saw this some time ago, but I remember liking it. Set in New York amidst both the art and high finance world (a Vermeer painting has a role in the plot), it's slow and deliberately paced, but if you enter its rhythms, it's a very worthwhile movie",
         "I'll use a scene from the movie to illustrate my problem with it: at some point we get a tracking shot starting from a girl reading a book, across her room over various objects of interest, bedsheets, Nike shoes thrown on the floor, a Cosmopolitan, then we hear stifled sobs off screen and we track back to the girl, now crying. The camera-work is beautiful, it's the slow sensual gliding that feels like choreography for a ballet ensemble or maybe like someone's hand slipping under the hem of a skirt, but I find the points of interest it brings together and the suggestions that emerge in this linking (in Jost's cinema as a whole or at least based on what I've seen) superficial and labored. Whereas in Frameup Jost's experimental technique got in the way of characters with a potentially interesting story waiting to be told, here I had the opposite reaction, interesting form beind sidetracked by flat uninteresting characters, possibly a story not worth the telling. The movie inhabits the lofts and galleries of Soho, the world of MoMa exhibitions and small coffee shops, its girls are sweet shy and cultured, they want to be actresses or sopranos and they care enough about the rainforest to call daddy and yell at him for bying stocks of gum companies in their name, and it's never quite clear where Jost sees himself in all this. His characters are self-involved and egopathic but his criticism against them is not as scathing (or as obvious) as in Frameup. The two male characters we see in the film are curious prototypes, the one is the angry artist throwing a temper tantrum because his agent won't lend him money, the other is the mature love interest, the stockbroker in the white horse come to sweep the young French girl off her feet. Of course it doesn't quite work this way, and it neither does for the movie. The story takes place in New York but it's not Woody Allen's Manhattan, it's not so much about finding or losing love, romance or even alienation, as it is about obligation, about our right to not be obliged to be anything if we don't want it, not even good or loyal or in love. The movie has the feeling of walking inside an art gallery, with some of that quality quiet and alert in the same time, with something cold and irrevocable like you're sitting on a bench and you can hear the echo of someone else's footsteps reverberating from a different room (they stop and it's quiet and then you can hear them again), punctuating the story with long neat tracking shots over polished mahogany floors and in endless dervish circles around marble pillars, with symmetrical shots arranged in orderly patterns, but Jost delivers his thing with perhaps a little too much minimalism, like he's too proud and 'left-field' to dramatize properly, so that even the premise of his movie slowly begins to hide from it. In the end Jost has to go looking for his premise. He finds it curled up in a dark corner of the museum, panting and naked, and he brings it kicking and screaming to the light. Our female protagonist begins narrating \"the point of the movie\" and Jost is literally speaking through her, hammering home an indifferent point in outrageous explanatory fashion, like all the subtlety of nuance that came before were but tools of their own destruction, so that we have 98% of a movie that is too vague and transparent and 2% that is anti-tank steel 5 inches thick. Maybe this is Jost the frustrated artist, who wants every last one in his audience to get him or maybe it was all an essay and he simply feels the need to conclude. From the tug-of-war between very carefully designed stylization and improv feel of acting and story, I think that Jost captures nice images, but he's not a storyteller.",
         "This literary, in many respects experimental film examines the parallels between the art world and the business world, through the relationship between an actress and a stockbroker who meet in the Vermeer Room of the Metropolitan Museum of Art. The film is much more interesting for its cinematography and narrative style than its plot. In keeping with its subject matter, the photography tries to emulate Vermeer's paintings, with some shots of Emmanuelle Chaulet being particularly successful. Furthermore, rather than having a linear plot, the narrative takes the form of a mosaic linking the different characters, bringing to mind a minimalist short story. This is not to say the film is for all tastes. Some scenes, such as where Anna and the stockbroker first meet, drag on for too long. Furthermore, some of the dialogue, particularly Stephen Lack's, comes across as overly metaphorical and stilted, though this should not be a surprise given that it was supposedly improvised. On the whole, a film worth seeing for a look at when the art house film scene really was arty, before the indie film boom led to the scene being co-opted by corporations.",
         "This is a great, beautiful, deep and rewarding film. Jost sets a slow pace that might frustrate some, but this film rewards patient attention. Jost understands the film medium and uses it to convey not just a story but a depth of meaning that could not be as effectively conveyed in another medium. The themes of love, loneliness, money, and art intertwine as the characters try to find meaning and break through barriers. Give this film the attention it deserves and you'll be glad you did.",
         "This movie is as subtle as good champagne, as illuminating as a nova star and as poisonous as curare. The \"it of it\" is easily missed if you are poorly educated and/or badly informed. This is French existentialism on a collision course with capitalism-fueled post industrial deconstructionism. The parallels between the machinations and lies of Wall Street's deals and the morally derelict art world of galleries and art dealers is poignant. Also poignant are the excerpts in French which counterpoint a decadent civilization based on a materialistic narcissism out of control. The whole thing comes to a screeching pitch when the things in life that most people believe are really worth living and dying for (money, honor,love, God) become nothing but a series of meaningless mirages. In the end there is not even God to help us make sense of the dissolute lives we lead. The beautiful Ana, in spite of herself, becomes an exterminating angel for the man who thinks is in love with her. But even she has to run away from New York to save herself and her dreams. In the end the only thing worth holding on to is all the Vermeer's in New York. And remember, no one really knows who Vermeer was. Only his magical light remains on the canvas. - Also contains an unforgettable scene atop one of the now defunct Twin Towers. Sort of creepy foreshadowing of history.",
         "This is a beautiful film for those who can appreciate the odd light it casts. The camera work is fascinating and rich. The acting may seem arch to some and the plot obscure, but this film is certainly not boring. The focus on the intimate connection to the Vermeers in New York is a priceless exercise in the relationship between looking and seeing. Perhaps Jost's vision is rarified in some sense, or too slow and precise, but there is a wonderful and strange sort of redemptive illumination that permeates the whole movie. In many ways it is a better film for viewing at home where the intimacy of the mis en scene can be appreciated, and where one can look at certain scenes over and over. I think those who take the time to look carefully will savor this film."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "American Playhouse",
         "Complex"
      ],
      "summaries": ["Anna, a French actress, is approached by financial broker Gordon in the Vermeer room of a New York gallery. However, romance does not ensue..."],
      "budget": 250000
   },
   "movielensId": 3531,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1991-02-24",
      "dvdReleaseDate": "2002-05-07",
      "directors": ["Jon Jost"],
      "runtime": 87,
      "movieId": 3531,
      "title": "All the Vermeers in New York",
      "mpaa": "",
      "actors": [
         "Emmanuelle Chaulet",
         "Stephen Lack",
         "Katherine Bean",
         "Grace Phillips",
         "Laurel Lee Kiefer",
         "Gracie Mansion",
         "Gordon Joseph Weiss",
         "Roger Ruffin"
      ],
      "imdbMovieId": "0099014",
      "originalTitle": "All the Vermeers in New York",
      "genres": [
         "Romance",
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Anna, a French actress, is approached by financial broker Gordon in the Vermeer room of a New York gallery. However, romance does not ensue...",
      "tmdbMovieId": 123757,
      "avgRating": 3.07463,
      "releaseYear": "1991",
      "numRatings": 134,
      "posterPath": "/kPJKBvgy5IlIMZiFk7ERGMm8NrQ.jpg"
   }
}