{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "biography",
            "id": 5565
         },
         {
            "name": "sex pistols",
            "id": 9860
         },
         {
            "name": "punk rock",
            "id": 11053
         },
         {
            "name": "rock music",
            "id": 11700
         },
         {
            "name": "retrospective",
            "id": 34118
         }
      ],
      "imdb_id": "tt0236216",
      "video": false,
      "title": "The Filth and the Fury",
      "recommendations": [
         23825,
         17091,
         71905,
         39567,
         16301,
         15651,
         21710,
         156316,
         40690,
         58098,
         151545,
         100292,
         224626,
         29211,
         36247,
         52017,
         129175,
         45664,
         24506,
         32013
      ],
      "backdrop_path": "/8EFG2OJJgKatlUY9W7HtJ8e4BVr.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Himself (as Johnny Rotten)",
               "gender": 0,
               "credit_id": "52fe4564c3a368484e0579cb",
               "name": "John Lydon",
               "profile_path": "/g5szwmtxb46NX6GBNFemRSVyUS5.jpg",
               "id": 79630,
               "order": 0
            },
            {
               "cast_id": 17,
               "character": "Himself",
               "gender": 2,
               "credit_id": "56d3710ac3a3681e5000f098",
               "name": "Steve Jones",
               "profile_path": "/5XiA60kJhq2oivm2auzc4DKoU5t.jpg",
               "id": 38667,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4564c3a368484e0579d7",
               "name": "Paul Cook",
               "profile_path": null,
               "id": 79628,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4564c3a368484e0579d3",
               "name": "Glen Matlock",
               "profile_path": "/d7FeQFvHb0ep9hfMFn1JDBaOH1K.jpg",
               "id": 79652,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Himself (archive footage)",
               "gender": 0,
               "credit_id": "52fe4564c3a368484e0579cf",
               "name": "Sid Vicious",
               "profile_path": "/bjiWTiZUbs5PfAbWUkV2I9ljS5.jpg",
               "id": 79629,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Himself (archive footage)",
               "gender": 2,
               "credit_id": "56d3683bc3a3681e3600fc73",
               "name": "Malcolm McLaren",
               "profile_path": null,
               "id": 1442631,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Himself (archive footage)",
               "gender": 2,
               "credit_id": "52fe4564c3a368484e0579df",
               "name": "David Bowie",
               "profile_path": "/7OIa363iSLG43x9Sb9HojUANwbh.jpg",
               "id": 7487,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Himself (archive footage)",
               "gender": 2,
               "credit_id": "52fe4564c3a368484e0579e3",
               "name": "Alice Cooper",
               "profile_path": "/nyJVaHPZSPMvJyS5aSal7a793qJ.jpg",
               "id": 35824,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Himself (archive footage)",
               "gender": 2,
               "credit_id": "52fe4564c3a368484e0579e7",
               "name": "Stewart Copeland",
               "profile_path": "/e0spn3RZW1DCziwyCQsSNPyQIU5.jpg",
               "id": 2987,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Himself (archive footage)",
               "gender": 2,
               "credit_id": "52fe4564c3a368484e0579eb",
               "name": "Bryan Ferry",
               "profile_path": "/aHvwmWbc5k8zTi88ysUoas0eXTk.jpg",
               "id": 17021,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Himself (archive footage)",
               "gender": 2,
               "credit_id": "52fe4564c3a368484e0579ef",
               "name": "Benny Hill",
               "profile_path": "/dfzklG9OHMEeWEeneaxG3cZRsjh.jpg",
               "id": 55879,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Himself (archive footage)",
               "gender": 2,
               "credit_id": "52fe4564c3a368484e0579f3",
               "name": "Billy Idol",
               "profile_path": "/m34UfaHkKBPA18zT4LMIHclXbIg.jpg",
               "id": 80117,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Himself (archive footage)",
               "gender": 2,
               "credit_id": "52fe4564c3a368484e0579f7",
               "name": "Sting",
               "profile_path": "/cnhlJfHWfNU0ig6hidOiXuvew7o.jpg",
               "id": 982,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Himself (archive footage)",
               "gender": 2,
               "credit_id": "592b3d239251413b4a066035",
               "name": "David Johansen",
               "profile_path": "/hQq0pmBBcmapA8YPxsgnDuZnEAa.jpg",
               "id": 57116,
               "order": 13
            },
            {
               "cast_id": 19,
               "character": "Himself (archive footage)",
               "gender": 2,
               "credit_id": "592b3d39c3a368780a05e844",
               "name": "Shane MacGowan",
               "profile_path": "/bnWGjFQXm8t5J52ZKR9I6VA1BXV.jpg",
               "id": 58630,
               "order": 14
            },
            {
               "cast_id": 20,
               "character": "Himself (archive footage)",
               "gender": 0,
               "credit_id": "592b3d53c3a368782d060ebb",
               "name": "Johnny Thunders",
               "profile_path": "/2Zfqox7XegKu5rzrl5JaLtwjJpl.jpg",
               "id": 1156267,
               "order": 15
            },
            {
               "cast_id": 21,
               "character": "Herself (archive footage)",
               "gender": 0,
               "credit_id": "592b3d6cc3a36877bc06e458",
               "name": "Siouxsie Sioux",
               "profile_path": "/sdOLhsCGgVxCFa8hea2jpFqcxo6.jpg",
               "id": 423331,
               "order": 16
            },
            {
               "cast_id": 22,
               "character": "Herself (archive footage)",
               "gender": 0,
               "credit_id": "592b3d82c3a36877bc06e46a",
               "name": "Nancy Spungen",
               "profile_path": null,
               "id": 79658,
               "order": 17
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4564c3a368484e0579c1",
               "name": "Julien Temple",
               "profile_path": "/ktxBwnWZHwbKuMngxwY3MyRotDR.jpg",
               "id": 22669,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4564c3a368484e0579c7",
               "name": "Julien Temple",
               "profile_path": "/ktxBwnWZHwbKuMngxwY3MyRotDR.jpg",
               "id": 22669,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Documentary",
            "id": 99
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 4.99506,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 27745,
      "vote_count": 33,
      "budget": 0,
      "overview": "Julien Temple's second documentary profiling punk rock pioneers the Sex Pistols is an enlightening, entertaining trip back to a time when the punk movement was just discovering itself. Featuring archival footage, never-before-seen performances, rehearsals, and recording sessions as well as interviews with group members who lived to tell the tale--including the one and only John Lydon (aka Johnny Rotten).",
      "similar": [
         11202,
         276907,
         462,
         640,
         769,
         5915,
         318846,
         324786,
         389015,
         407445,
         363676,
         371638,
         396371,
         323677,
         27586,
         228970,
         114150,
         239566,
         254470,
         786
      ],
      "original_title": "The Filth and the Fury",
      "runtime": 108,
      "poster_path": "/8Mjyt4I3jFDuej8Y3CG2HAfQ0CB.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Nitrate Film",
            "id": 10380,
            "origin_country": ""
         },
         {
            "logo_path": "/5uoaxZCSYuc6KEiJgEYSWzLIFAW.png",
            "name": "Film4 Productions",
            "id": 6705,
            "origin_country": "GB"
         }
      ],
      "release_date": "2000-03-29",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "A Sex Pistols film - uncut, unseen, unbelievable.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Julien Temple"],
      "runtime": 108,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0236216/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg4NzY3MzUyMl5BMl5BanBnXkFtZTcwMjUzNzQzMQ@@._V1_SY317_CR7,0,214,317_AL_.jpg",
      "actors": ["Stars: Paul Cook, Steve Jones, John Lydon | See full cast and crew »"],
      "reviews": [
         "Forget everything you may have heard or read about the Sex Pistols. Forget \"Sid and Nancy\". This is THE documentary. A warts and all look inside the lives of a band that changed the face of music forever. Never mind Julien Temple's earlier effort \"The Great Rock and Roll Swindle\", the sensationalist Malcom McLaren (Manager of the Pistols) centred documentary. \"Filth\" tells the story using the the band (and a lot of Temple's own 1970's 'never before seen' home video tapes). In existence for only 26 months and releasing only one album, the Sex Pistols evolved within a time of massive economic, social and cultural oppression in England. This was an era unlike any other. Staggering youth unemployment; squalid streets where the piles of rubbish became small hills and the stench over-powering, and with the IRA bombing campaign reaching its peak. One of the most amazing things about this documentary is that it actually takes us back in time to the mid-70's landscape of London. Through the use of newsreel footage, television adverts of the day, weather reports and game-show clips, \"Filth\" immerses the viewer in everything absurdly \"English\" from the time. The documentary not only lets you \"feel\" like you're actually there with the band, it tells you so much that you actually believe you were there. Without going into essay length about the story of the Sex Pistols, there are just so many interesting/bizarre facts revealed about the band that you really begin to realise why they are such a huge influence on music today. I may be ignorant, but I now know that Johnny Rotten started spitting on stage only because of his sinus problems, Sid Vicious inadvertently started the \"pogo\" dance, and the band were the first ever to say the \"F\" word on British television. David Bowie, Siouxie Sioux and Elvis Costello could often be spotted at a Pistols show, and opening bands on the bill ranged from The Clash, The Damned and The Buzzcocks. One-to-one interviews with each surviving band member, as well as extensive interview footage with Sid Vicious (Hyde Park-1978), are revealing and extremely honest. The many sides and angles of the Pistols story have been told by those that lived it. Almost all of the interviews have been shot in silhouette, so the only faces you see are those of the members being \"The Sex Pistols\". The idea being not to spoil the feel or continuity of the film, and from saving us all having to look at a bunch of old blokes talking about \"those crazy days\". Julien Temple proves himself to be the only man for the job of Director. There is a lot to be said about someone who abandons there student film career and goes about documenting a band, but Julien Temple did just that. His ability to display the true personalities of each band member is remarkable, and this has translated over to the audience. In a recent interview he states \"People have watched the film and been almost in tears at the end, which is the last thing you would expect from a Sex Pistols movie. But it is because there was never anything about the Pistols that you expected, that was part of their power\". No, I didnt cry, but the story of the Pistols is a tragic one ending with the split of the group, Sid Vicious being the prime suspect over the death of his girlfriend Nancy Spungen, and then his drug induced death months later. Whether you're a fan of the Sex Pistols or not is really irrelevant. Whether you play in a punk band is also irrelevant (although it'll make you think twice about the term \"punk\"). The point is, if your interested in music, popular culture or human behaviour, this is a movie that will reward you. Both entertaining and informative, \"The Filth and The Fury\" actually delivers as being \"the definitive story of The Sex Pistols\".",
         "This is by far one of the very best rock-documentaries I've ever seen. It uncovers the eventful story of The Sex Pistols. The notorious band was active merely about 2 years of time and they recorded only one album, famous classic \"Never mind the bollocks, here's The Sex Pistols\". In a highly small period of time they shake the social system and left their footprints in a rock history. I'm not sure if this is a matter of opinion but obviously no-one can seriously claim that The Sex Pistols was musically an extremely skillful band full of talented blokes because it simply wasn't like that. The Sex Pistols is much more interesting as a phenomenon. Sid Vicious was a terrible bassist, (it's also said in \"The Filth and the fury\") Johnny Rotten was a rotten singer who was mostly brawling on the stage and their music was simple, harsh and noisy. Music is irrelevant because they never tried to sound nice, it's the lyrics and the attitude that counts. After this documentary at the latest you'll find out how obvious it is that without The Sex Pistols there would have never been the whole culture known as \"punk\". This is a chance to see their story as told by the band themselves. If you don't like 'em, you can still find \"The Filth and the fury\" interesting. It isn't only a documentary about the band, it's a close look at England in the late 70's.",
         "Was recommended this by a pistols fan who is also into the Punk scene. Not being a Pistols fan I was unsure but my friends tastes are similar so gave it a try. Very pleased I did. It's a thoroughly enjoyable docu film with some great footage and really encompasses the whole scene. It's amazing how times have moved on really and this is also a look at how society was so stuck up it's own arris here in the UK at that period. John Lydon has always been much more than just a yob of a front man as every interview I have ever heard with him he has always spoken with true meaning and passion. This has not changed my mind and you cannot help but be moved by his interview, especially on the death of Sid. The best moments for me are the interviews and clips of journalist Nick Kent, an absolute 'kent' if ever there was one. As a big Adam Ant fan it was nice to see some footage of the man behind the song \"Press Darlings\", and boy did he come up trumps. What a complete.... It also reveals McLaren to be the compete t**t he was too. A great film for everyone with even a passing interest in music and not just punk. It's about a change in ideals and the times. And very well done. 9/10 as it does what it sets out to do very very well.",
         "In his documentary, The Filth and the Fury, Julien Temple chronicles the rise and the fall of the legendary punk rock band the Sex Pistols. Temple tells this story through accounts given to him by the still living Sex Pistols, as the opposing side to his other Sex Pistols film, Great Rock and Roll Swindle, which was told to him by the Sex Pistols manager, Malcolm McLaren. Temple uses interviews with the band members to tell the story of the Sex Pistols and intertwines it with live footage of the band's concerts and a taped interview with Sid Vicious, filmed before his death. The band their formation, joining up with McLaren, firing Glen Matlock, replacing him with Vicious, their problems in the United Kingdom and the United States, and the eventual end of the band due to Vicious's heroin addiction. The documentary really got inside of the Sex Pistols and showed a more human side of the band. While the band is often made out to be a bunch of rowdy, angry, punk rock kids, the documentary showed a different side to them. Footage is shown of the band during a children's benefit show and the band members are seen playing with and talking to the kids with huge smiles on their faces, their joy at being at the event evident. Johnny Rotten also spends a large amount of time at the end of the film discussing Vicious' heroin addiction and his guilt at being unable to help his friend before it was too late. I really liked the live footage of the Sex Pistols shows, as it showed the band in their element and also did a lot to show what the scene was like when the Pistols were around, and I could see how little it has changed since then. The footage shown of the Sex Pistols on a British television show and clips of newspaper articles at the time also did a lot to show the band's image in the eyes of the media as well. One problem with the movie was that live footage of the band would be playing and then the film would cut to scenes from a Shakespeare movie or other random scene, which completely detracted from the film. Every time one of those clips would cut in it would jar my attention from the story, and it definitely broke up the cohesiveness of the film. I think the film did a good job capturing the image that the Sex Pistols gave off, while also contrasting it with more human images of them, like during the children's show. Overall, I think the film was very well done, though I would have liked to have seen more background on each of the band members, rather than the Shakespearean ode. I would give this film a 7/10 and would recommend it to anyone looking for information about the Sex Pistols.",
         "If nothing else, this is the only Sex Pistols film (there are now at least 3) to make explicit and in-depth reference to the band members' working class roots, and the way that experience informed their project. This alone makes the film worth seeing, as it explodes the myth, fostered no doubt by their PT Barnum manager, Malcolm McLaren, that the whole project was an exercise in cynical nihilism and money grubbing. As the band members tell it, nothing could have been further from the truth. I believe them. The film is cobbled together in large part from 2 previous Sex Pistols documentaries, \"Rock 'n' Roll Swindle,\" (a McLaren project also directed, ironically enough, by F&F director Julie Temple) and \"D.O.A,\" plus clips from BBS television and elsewhere that try to locate the Pistols in the political and social climate that spawned them. This effort, to give the Pistols a historical context, is by far the most valuable part of the film for those trying to understand how a bunch of working class stiffs, who could barely play their instruments, and who only released one album, could set off an explosion that reverberates in the music world--if increasingly faintly--even today. Best part of the film: footage from their last, secret gig at a palace in a working class district (they had been banned from appearing anywhere in England) before embarking on their ill-fated US tour. It consists of two performance on Christmas Day, benefiting the families of striking local firefighters, who had been out of work for many months. The attendees consist of the local lads and lasses, none of whom are \"punk\" in any apparent sense of the term. Before the Pistols performed, everyone eats Sex Pistols cake and ice cream; \"Never Mind the Bollocks\" shirts are stretched over the pubescent bodies of every bobby soxer. Then, after a thank you from the emcee, the Pistols launch into the searing \"Bodies,\" its sarcastic refrain sung from the point of view of an aborted fetus (\"I'm not an animal!/I'm an abortion...\"). All the boppers dance like it's a sock hop, with the difference that everyone gleefully throws leftover desserts at one another. Steve Jones is shown playing guitar with his face covered in cake icing, beaming. In his reminiscence about the gig, Rotten grows wistful, saying it was easily their best memory as a band, and the last good one before it all fell apart. I never knew the guys were such sentimentalists. It's hard to believe that there once was a time when rock music could actually matter, when it was possible to actually escape the commodified rebellion that now sells Budweiser, Nike, and SUVs, when it was possible, however briefly to scare the pants of the political establishment. Young pop music lovers who swallow the meretricious rebellion of rap or grunge--whose self-important lyrics and idiotically monotonous rhythms make their authors rich off the weekly allowances of white middle class kids whose idea of rebellion is big loud subwoofers in the Corolla Daddy bought them for their 16th birthday--might profit from getting a glimpse of the Real Thing. The rest of us, who were lucky enough to have been there when history was made, and who can still recall the opening chords of \"Anarchy in the UK\" blasting all traces of \"More Than a Feeling\" and \"Take It Easy\" out of our speakers cabinets and into the first circle of music Hell where they always belonged, can enjoy the film for what it teaches us about the power of ordinary, thoroughly obnoxious people to make their own history, and ours. Another thing I learned from the film: if Tom Cruise were a junkie, he would look just like Sid Vicious.",
         "This film is a documentary about one of the most influential (certainly one of the most controversial) bands in music history: The Sex Pistols. During their brief career, the Sex Pistols defined the genre of music called Punk Rock. The film details the situation in Britain at the end of the 1970s, where widespread dissatisfaction and alienation, combined with a very dull music scene, helped fuel the anger and craziness of Punk, which, according to John Lydon (aka Johnny Rotten), gave a voice to people who previously didn't have a voice. The film is a collection of present day interviews with the surviving members of the band (given in silhouette, for some reason), archive footage from concerts and TV appearances, vintage movie clips (notably Laurence Olivier as Richard the Third) and surreal animation. The film mostly sidelines the Pistols' notoriously self-aggrandising manager Malcolm McLaran to concentrate on the band members themselves. The movie gives a good insight into an often quite disturbing world and a scene that was truly anarchic and exciting, whether you were a fan or not. There are also moments of genuine sadness, for example when Lydon talks about his friend, the late Sid Vicious. This is recommended to anyone interested in popular music, or anyone who wants to see what real Punk was all about.",
         "The Filth and the Fury is directed by Julien Temple and is a rockumentary charting the rise and fall of Punk Rock flag bearers, The Sex Pistols. 20 years earlier Temple had made The Great Rock and Roll Swindle, a bonkers and quirky movie that skewed the Sex Pistols legend as some elaborate hoax formulated by band manager Malcolm McLaren. The Filth and the Fury tells the story from the viewpoint of the band members themselves and goes some way to dispelling the myths that surround them and their self publicising manager. The title of the film is a reference to a headline that appeared in the British tabloid newspaper The Daily Mirror after an interview with the band on ITV's Today show presented by Bill Grundy. The story follows the band members from their humble beginnings in London's Shepherd's Bush, to their implosion at the Winterland Ballroom in San Francisco, and then to coup de grace as Sid Vicious & Nancy Spungen left the mortal coil. Love them or hate them, The Sex Pistols in the mid to late 70s created a wave in the music industry that can still be felt today. Most of it now seems tame of course, swearing on TV and alleged distasteful songs are common practice these days, but it were not the case back when flared trousers and guys wearing make up gave way to Punk Rock Britannia. But is there anything here for those who just don't get that the Pistols were influential and one of Britain's most important bands? Yes, definitely. This is no rose tinted glasses documentary serving only to keep the Pistols name on the high heat. Nor, is it over an hour and half of their videos and live footage. Of course the music features prominently, but it's in context to the story, a story that sees the remaining band members give frank and honest assessments of the time, the place and the now. Interviewing the band singularly in darkened silhouette to give off the impression we are witnessing criminal informers at work, Temple also puts the band into historical context with Britain's social situation in the 1970s. This is crucial to the origins of the band. It was a time of strikes and suspect politicians, so with archival footage from the period, Temple fuses the Pistols ire with that of a country that was limping along in apathy. Haters of the band don't want to agree of course, but the Pistols showed that not all of Britain would surrender meekly, and, that music could actually make a difference and shake up the system. \"Get Off Your Arse\" snarled John, and thousands did, as Punk bands formed over night and showed that the youth of the day had a voice. How many bands can say that eh? But as we know, it was to be a short lived journey for the band, one that would end in tragedy: as first the press went bazooka over the top with their every move, and then as one out of his depth bass player lost sight of the bands vision. This part of the film is subtly handled by Temple, the sense of impending doom hangs heavy, none more so with the old interviews held with Vicious that are woven into the last third as self destruction grows ever near. These sequences show what many people either forget or don't realise; that Vicious was just a kid of 21 years of age. This part of the tale also lets us into an untapped part of Lydon's {ne:Rotten} emotional side, a telling moment that brings the sorry chapter to a close. From a time when music could be as dangerous as the politicians running the country, The Filth & The Fury is an essential music based movie. Not just for fans of the band, nor just for curious music fans in general, but also for historians wishing to see just how bad late 1970s Britain was. 10/10",
         "The first Julian Temple documentary on the Sex Pistols, 'The Great Rock n'Roll Swindle' was a gimmicky treatment that suggested the creation of the band was all a clever confidence trick perpetuated by Malcolm Maclaren. In his version the Pistols were a personal creation that deliberately manipulated the media and the 'suits' that ran the music industry into paying out vast amounts of cash even when the band failed to produce any material. This second version of events is a little more honest. Maclaren is shown to be a self-deluded egotist, the real driving force being 'Johnny Rotten', and the band, far from having the upper hand, were in fact ripped off financially by the very people they were supposed to be rebelling against. It all ended in a shambolic final concert where Rotten wails out 'No Fun' for 15 minutes and then walks off with a smirking, 'Ever felt you've been cheated?' Trouble is; this is a lie as well. The Pistols carried on after Lydon left; sad fun and games with the Great Train Robber, Ronnie Biggs and Sid Vicious' infamous rendering of 'My Way' being the 'highlights'. What's more, within months of Johnny Rotten's noble statement about not selling out at the end of the documentary, the Pistols reformed in the 21st century and gave progressively pathetic concerts. It's still an interesting documentary but I guess the myth has now become so mixed up with the legend that anything approaching the truth is lost for ever. This documentary does feature, however, an archive interview with Sid Vicious \u0096 whose real name was John, Lydon affectionately remembers - which I have never seen before. It says more about the times than anything else in the film. Although dressed in his trade mark Nazi t-shirt and initially punctuated with all the predictable anarchic attitudes, this veneer gradually slips away to reveal a young naïve man, who's life along with his heroin addiction was spiraling out of control. No fun, indeed.",
         "if your not a pistols fan before you watch this, you definalty will be after. at least thats the experience I've had from myself and people i know viewing this film. i was already a bit of a fan. you know i had a thing for sid pre nancy days and i thought johnny rotten was a unique man. but after watching this documentary with my dad ( who is a musician, but never liked anything the pistols did) i realized that this band, was so much more than the punks they were made out to be, they were rebeling against being a product of their surroundings, but at the same time find that it near impossible to achieve. my dad on the other hand, watched the movie, and immediately asked for one of my pistols cd. so i game him never mind the bollocks and set off to listen. the very next day, i find him singing 'anarchy' while doing the dishes. his views were exactly hte same as mine. except this documentary turned him from a non believe to a fan. I'm not really one for documentaries... i thought id cracked it when i watched spinal tap, and then realsied that they were only mocking hte whole genre... so then i felt like a fool (but immediately went to see if my dads marshall went up to 11 rather than just 10). but the filth and the fury held my attention from the very first shot to the rolling of the credits. so naturally when i saw it in the store, i bought it, and I've watched it A lot of times since. sometimes in the row... and every time, it makes me laugh, and cry and makes me want to have lived back in the days of the punk. the filth and the fury is an emotional ride of a doco that combines everything you want in a movie with an awesome soundtrack and some real meaning. this documentary is a MUST for all music fans, whether you think you like the pistols or not. by the end of it, you will be converted. or just appreciative. its an excellent piece of film making that tells the story of one of the most influential bands of the 70's, and indeed of rock history.",
         "'The Filth And The Fury' isn't only the best music-related documentary I've ever seen, but one of the best documentaries ever made on ANY subject. Julian Temple succeeds in blending archival footage of the band, various ads, rock videos, news reports, TV comedians, Olivier's 'Richard III', and recent interviews, and by this manages to put the Sex Pistols in a musical, political and CULTURAL context. If that sounds pretentious, the movie is anything but. It is fabulously entertaining but at the same time is a fascinating, insightful HONEST portrait that should appeal to both die hard fans and novices. So few movies or TV shows treat music seriously, or show that it can be much more than mass-produced trivialized entertainment. 'The Filth And The Fury' does exactly that and is all the more powerful for it. A revelatory piece of film! I hope every rock'n'roll fan turns off MTV and watches this instead. If they did the music world would be a much better place."
      ],
      "genres": [
         "Documentary",
         "Biography",
         "History",
         "Music"
      ],
      "productionCompanies": [
         "FilmFour",
         "Jersey Shore",
         "Nitrate Film"
      ],
      "summaries": [
         "A documentary about the punk band The Sex Pistols. The film tries to lighten some of the backgrounds of their way through the punk era while telling the story of the band from zero back to zero. Features lots of interviews and comments of folks who were involved.",
         "A film about the career of the notorious punk rock band, the Sex Pistols."
      ],
      "budget": 0
   },
   "movielensId": 3539,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-03-29",
      "dvdReleaseDate": "2004-06-01",
      "directors": ["Julien Temple"],
      "runtime": 108,
      "movieId": 3539,
      "title": "The Filth and the Fury",
      "mpaa": "R",
      "actors": [
         "John Lydon",
         "Steve Jones",
         "Paul Cook",
         "Glen Matlock",
         "Sid Vicious",
         "Malcolm McLaren",
         "David Bowie",
         "Alice Cooper",
         "Stewart Copeland",
         "Bryan Ferry",
         "Benny Hill",
         "Billy Idol",
         "Sting",
         "David Johansen",
         "Shane MacGowan",
         "Johnny Thunders",
         "Siouxsie Sioux",
         "Nancy Spungen"
      ],
      "imdbMovieId": "0236216",
      "originalTitle": "The Filth and the Fury",
      "genres": [
         "Documentary",
         "Music"
      ],
      "youtubeTrailerIds": ["rKdPOIcIBxs"],
      "plotSummary": "Julien Temple's second documentary profiling punk rock pioneers the Sex Pistols is an enlightening, entertaining trip back to a time when the punk movement was just discovering itself. Featuring archival footage, never-before-seen performances, rehearsals, and recording sessions as well as interviews with group members who lived to tell the tale--including the one and only John Lydon (aka Johnny Rotten).",
      "tmdbMovieId": 27745,
      "avgRating": 3.7484,
      "releaseYear": "2000",
      "numRatings": 469,
      "posterPath": "/8Mjyt4I3jFDuej8Y3CG2HAfQ0CB.jpg"
   }
}