{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "baseball",
            "id": 1480
         },
         {
            "name": "sport",
            "id": 6075
         },
         {
            "name": "historical figure",
            "id": 6165
         }
      ],
      "imdb_id": "tt0109450",
      "video": false,
      "title": "Cobb",
      "recommendations": [
         21887,
         61225,
         130002,
         41852,
         25297,
         39472,
         25330,
         50374,
         83489,
         19118,
         10410,
         15503,
         19819,
         19143,
         31633,
         31640,
         107934,
         157036,
         53287,
         56448
      ],
      "backdrop_path": "/e9nKTjKghkMDTnf8VOMuYrrwzj2.jpg",
      "revenue": 1007583,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Ty Cobb",
               "gender": 2,
               "credit_id": "52fe4608c3a368484e07cfdd",
               "name": "Tommy Lee Jones",
               "profile_path": "/gRXugLFvr1oHZ6alLUxmYDq8cgW.jpg",
               "id": 2176,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Al Stump",
               "gender": 2,
               "credit_id": "52fe4608c3a368484e07cfe1",
               "name": "Robert Wuhl",
               "profile_path": "/7bboXtHrq8qOtQBdcZko3KJfFyH.jpg",
               "id": 4040,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Ramona",
               "gender": 1,
               "credit_id": "52fe4608c3a368484e07cfe5",
               "name": "Lolita Davidovich",
               "profile_path": "/vQlk518qlef94XXJqtrkIqS3izo.jpg",
               "id": 12139,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Ray",
               "gender": 2,
               "credit_id": "52fe4608c3a368484e07cfe9",
               "name": "Ned Bellamy",
               "profile_path": "/aPAsdVFewZK3ldhvrL1ea2VUkUK.jpg",
               "id": 2141,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4608c3a368484e07cfef",
               "name": "Ron Shelton",
               "profile_path": null,
               "id": 4037,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4608c3a368484e07cff5",
               "name": "Ron Shelton",
               "profile_path": null,
               "id": 4037,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4608c3a368484e07cffb",
               "name": "Al Stump",
               "profile_path": null,
               "id": 105399,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 1,
               "credit_id": "52fe4608c3a368484e07d001",
               "name": "Ve Neill",
               "profile_path": "/gNYwxuK5Z7Nr3tWtSWv0qAueUIs.jpg",
               "id": 406204,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 2.343782,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 29973,
      "vote_count": 32,
      "budget": 0,
      "overview": "Al Stump is a famous sports-writer chosen by Ty Cobb to co-write his official, authorized 'autobiography' before his death. Cobb, widely feared and despised, feels misunderstood and wants to set the record straight about 'the greatest ball-player ever,' in his words.",
      "similar": [
         323677,
         13416,
         9655,
         10637,
         22881,
         8923,
         9291,
         2300,
         4942,
         10474,
         9563,
         2323,
         86130,
         12163,
         15070,
         1578,
         1374,
         45317,
         42888,
         8456
      ],
      "original_title": "Cobb",
      "runtime": 128,
      "poster_path": "/pzNL05RokKe6Nj1Bkp5gi8Fd0FH.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/7PzJdsLGlR7oW4J0J5Xcd0pHGRg.png",
            "name": "Regency Enterprises",
            "id": 508,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Alcor Films",
            "id": 644,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Aleor Films",
            "id": 16823,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1994-12-02",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "Everyone hated this baseball legend. And he loved it.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Ron Shelton"],
      "runtime": 128,
      "synopsis": null,
      "writers": [
         "Al Stump",
         "Al Stump"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0109450/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNzk2MzU1Mjg2M15BMl5BanBnXkFtZTcwNDc4MzAwMQ@@._V1_SY317_CR11,0,214,317_AL_.jpg",
      "actors": ["Stars: Tommy Lee Jones, Robert Wuhl, Lolita Davidovich | See full cast and crew »"],
      "reviews": [
         "When sportswriter Al Stump is contracted to write the autobiography of baseball player Ty Cobb, he believes he has it made. Cobb had a reputation as a mean player who is cruel, bigoted and monstrous. Al quickly learns that this reputation was well earned and that Cobb is all the things that he is reputed to be. As the pair set off to Reno in a middle of a snowstorm, Cobb tells him the story of his life, although the bitter, angry mess that is Cobb tells him all he needs to know about the past. When I sat to watch this film, I was aware that it was meant to be pretty harsh in terms of how it portrayed Cobb, but I didn't realise just how little of his career this film would touch upon. The film never shirks from showing Cobb to be the monstrous man he was claimed to be - either in his cruel career where he would sharpen his studs to hurt opponents or his personal life where he destroyed his family. Despite this the first half (and much of the film) is a fairly lively, almost comic affair that is deceptively enjoyable to watch. What this overall tone succeeds in doing is making the rest of the film that much more shocking and powerful as a result. The first significant turn is where Cobb gets `laid' in Reno - a moment that turns quickly from sensitive and comic to violent and scary and then almost immediately to the tragic. This film missed out on a full cinematic release due to harsh reviews, but I really don't understand why it got them. The only thing I can think of is that the reviewers felt this was an unfair portrayal of Cobb; I do not know anything about him, nor do I care about baseball as a sport so maybe I am being conned by this film but it is certainly a very interesting character who is looked at as part of an interesting and imaginative film. The film doesn't look very much at Ty's career but instead focuses on the man - this is much more interesting and it is done through straightforward means as well as more imaginative touches such as the extension of the career newsreel to Ty's low points. The film really works well, but I cannot imagine it being as good were it not for the fiery performance from Jones. I don't know how close it is to the real Cobb, but for the material he gets it just right. He balances the character on a knife-edge to the point that nobody could really feel sorry for him but at the same time it is difficult to hate him. Support from Wuhl is OK but not really as good - he wisely stands in the shadow of Jones. The support cast do well, with a small but important performance from Davidovich. Overall, this is much darker than I expected from a baseball film from Shelton; however it is better for it. I cannot comment on how fair it is to the real Cobb, but regardless of this it is a really enjoyable character piece with a great central performance. It keeps the audience by swinging wildly between the comic, the dark and the tragic, keeping us with it all the time. It is a dark drama but still enjoyable and sadly great underrated and underseen.",
         "This film is one of my all time favorites. There are some things in the film that I am less than happy about, such as the attempted rape in the hotel room in Reno. I don't believe it actually happened. I have read a few biographical books on Cobb and even though few people ever liked him, there were some things he would not do. Its strange, but many people will see somebody who is detestable, in most respects, and that person is therefore guilty of anything that can be said about him. Ty Cobb was a \"son of the south\" who never got over his father's murder, and he also never, ever, got over the Civil War. As I recall, he entered the major's in 1904 or 1905. As I said above, the movie \"Cobb\" is best viewed as a comedy; and I think it was intended to be seen as such by the film makers. I compare it to the film, \"A Clockwork Orange.\" In A Clockwork Orange you had a story of a guy name Alex who had things happen to him, often humorous, because of who he was. At the end of A Clockwork Orange, in the last scene, you have to admit that you could only snicker at what was on Alex's mind listening to his beloved 9th once again, since he had now been \"cured.\" I also remember the scene in the film that you see from the Bible where Jesus is carrying the cross and is being flogged. The camera pans back to the Roman who is doing the whipping, and it is Alex. In Cobb, the first part of the movie is one of the funniest I have ever seen; especially the ride down the hill in the snow to Reno. The film has a lot of truth in it but it actually leaves out a lot. The Scene in which you see Cobb beating up the fan who is crippled is true. But what is not said is that the whole team put itself on the line in backing Cobb in what he did; they went on strike against Cobb's suspension. So, Cobb was not hated quite like he was shown to be in the film, and the film did a discredit to Cobb in some areas. Oh, by the way, that fan that was beatup in the film was Jimmy Buffet from \"Lost in Margaritaville\" music fame. Jimmy is a good friend of Tommy Lee Jones. Actually, I rather doubt that you could make a real true film about Ty Cobb that could be saleable at the box-office. Ty Cobb was not funny, and he had little sense of humor; he absolutely had no sense of humor about himself. He was a bigot. You did not dare make fun of him to his face. He could explode into a life threatening altercation at the drop of a hat. However, I do believe he was courteous to women for the most part, and that is another area I have problem with what is depicted in the film. Cobb was a Redneck and a great deal like many other Rednecks from the south at that time. In his time there was a great deal of KKK activity going on in the South and the rest of the country for that matter. Cobb reflected his times, and never changed. Also, baseball was a lot different then than it is today. It was a completely different time. Baseball was the ticket for the poor and exploited to get out of the coal mines, the iron mills, or the farm fields. It was much more of a dog eat dog world than it is today. The average player today can move into some other endeavor if he didn't make it. In Cobb's time, it was back to the coal mines and an early death. To quote Ty Cobb: \"It's no pink tea, and mollycoddler's had better stay out.\" Baseball was a do or die affair and there were no holds barred as long as you could get away with it. Cobb, in many ways was not that different than many, but he was the best baseball player of his time, and quite possibly the greatest that ever lived. And, he played baseball with a fury that nobody else, before or since, has played with. Unfortunately, he could not turn off that fury when he wasn't playing the game. For Ty Cobb, baseball was absolute war and he devoted himself 100-percent to playing it that way and he also devoted his mental capacities 100-percent to the study of getting the edge on his opponents. He would do or say anything to get you out of your game. Cobb could also circle the bases faster than anyone who has ever played the game, with his spikes sharpened. He was rather big for his time and was about the same height as Babe Ruth. Couple that size with that speed and the grit in his demeanor and nobody ever enjoyed or looked forward to playing against him. \"What a ballplayer.\"",
         "when was in a movie rental store around the age of 8 I had no idea what in the world a movie titled Cobb could possibly be about. At that time my first thought was that it was about some horror movie slasher film in a corn field due to the dark movie cover and the cold looking man on the cover. Although the cover has changed since then I was only surprised to learn that it was about a baseball player later on in my life around the age of 15. However it was about a cold looking, and not to mention cruel acting man. It was almost scary the way this man viewed life. Almost abusively portrayed through the incredible skill of Tommy Lee Jones. No one could have possibly played this role with enough conviction and energy as the man they cast. He was vigorous, violent, and energetic and in every way fit for this part. I disagree with another commentators comment that Robert Wuhl's character was dry and lacking. In that I also say that I saw much more in that character than most people give him credit for. This film carry's you from a wretched, sick old man in the boondocks to a wild, wary, warrior of life fighting and dominating every aspect of life that he cared to pursue. Tommy lee Jones did an incredible job at playing a hated, yet respected character in that stone cold role of Tyrus Raymond Cobb. I found this film most moving, and although at times I could not believe the wake left in his trail I had to tip my hat to a man who kept fighting right up to the last minute of his life. I later read the biography \"Cobb:a biography by Al Stump\" and reading of his wild nature in that book I knew that the role had been attacked with a savage ferocity. No matter who you are don't look at this film as something to criticize, but more as something to educate yourself on a man who never gave up, and lived his life without ever giving inch without fighting for it. He set records and he turned some heads in the process. Go into this movie with an open perspective instead of the love hate attitude that most have for films. For if a film was about you loving or hating a character or a part of a movie you might miss the whole point of the film. The point of this film clearly established that he was hated, and he owed that to no one other than himself. I was moved, wowed, amazed, and shaken by this film simply from the acting alone. it's worth watching at least once. and lastly i must say comparing this to the real story that this movie was as close to the truth of any portrayal of any life as any i have seen. ***1/2 out of *****",
         "This little seen film has Tommy Lee Jones giving one of the best performances of his career. It is a shame that the film was given only a limited release with no advertising budget. I know of many who wanted to see this movie, but it was in and out of the theaters before they could notice. \"Cobb\" gets one of my highest recommendations. No Jones fan can justify not seeing this movie.",
         "Presuming all we have heard about Ty Cobb's off-field life are true, this movie is a wonderful portrayal. Tommie Lee Jones' portrayal of Cobb is incredible. He instantly presents a well educated, highly opinionated and full-of-himself fading hero. Jones' character portrayal runs the gamut of Cobb's audacity, bigotry, bravado, charity and unabashed directness. Those of you with thin skins may balk at some of the language used, some of the rumored occurrences and for those of you for whom Ty Cobb is a hero, you may be disillusioned by some of what is portrayed. However, as I said if what we've heard about Cobb is half true, this movie doesn't seem too far off the mark. Robert Wuhl's portrayal of Al Stump (\"Stumpy\" to Cobb), is fairly well done. Wuhl often tends to seem wooden in his performances but perhaps this is an occasion where that quality suits both the character and as a foil to Jones' Cobb. The narrative that goes with the movie moves it along well, and fits well as it is the writers narrative and Wuhl plays the writer. The supporting scenes to the primary story lend life to the rumors and life outside of baseball in brilliant display. From the early scenes of a valet leaving Mr. Cobbs' service, to the later scenes of him dealing with his former contemporaries, you will be taken on a roller-coaster ride of despising Cobb and feeling genuinely sorry for him at the same time. It's a shame this movie hasn't had a better showing. If not for fans of a baseball legend, for Tommie Lee Jones' portrayal at the least.",
         "Tyrus R. Cobb, the greatest ballplayer in his or any other era just by the statistics. Though both Ricky Henderson and others have eclipsed his base stealing record and Pete Rose took down his record for lifetime base hits, Cobb still has a whole lot more still standing including that .367 lifetime batting average. He fought each and every athletic contest like Nathan Bedford Forrest going against the hated North. God help a pitcher who shaved the ball a little too inside or an infielder who dared get in his way. Did he have to be the way he was to win ballgames? I doubt that very much. A whole lot of other athletes like Walter Johnson, Christy Mathewson, George Sisler, Honus Wagner ran up some pretty impresive statistics of their own without resorting to the violence Cobb did. The number of his contemporaries who showed up for his funeral you could count on one hand. Ty Cobb was a typical product of the Populist South of the 1890s and his views on various types of people reflected all the prejudices of Georgia during that time. But he also hid a terrible family secret that no doubt twisted him beyond anything remotely humane. What's not mentioned in the film is that Ty Cobb got in on the ground floor of something called Coca Cola. The owner of the Detroit Tigers where Cobb played most of his career was one Frank Navin. Navin was a bookkeeper for the original owners of the team and he sunk his life savings into buying a controlling interest and later getting partners who would be silent and let him run things. Navin's salary battles with Cobb were annual winter sportswriter fodder. Cobb didn't make his money in baseball, but was far luckier financially than nearly all of his contemporaries. It's important to remember that this is not a biographical film. It is the story of sportswriter Al Stump's relationship with the dying Ty Cobb as Stump was busy living with him and getting inside his head to write his story. I read both Cobb's whitewashed version of an autobiography that came out just before his death in 1961 and Stump's later account. Curiously enough Babe Ruth also had Bob Considine ghost write an autobiography the way Stump did for Cobb. That book was the basis of the Bill Bendix film The Babe Ruth Story. It's as Ruth would have wished to be remembered. Other more factual accounts of the Babe have since appeared and his legend hasn't dimmed any. I suspect neither will Cobb's. Tommy Lee Jones gives a pluperfect portrayal of a Georgia redneck who happened to be the best baseball player whoever lived. Robert Wuhl is also very good as Al Stump and the months they had veer from the wildly comic to the tragic. This is not how Ty Cobb would wish to be remembered. But given his life he's lucky the film and book were so favorable.",
         "If this movie exaggerates the nastiness of Ty Cobb, his descendants could sue. Then again if the movie is accurate, his descendants clearly despise him as much as anyone else. The weirdly symbiotic relationship between Cobb and his hapless biographer Aaron Stump is engrossing to watch, but it is Tommy Lee Jones' performance that makes the movie. The performance borders on chewing up the scenery, but it's mesmerizing.",
         "This film is rather faithful to the book in that it shows Ty Cobb as a thorough #^*#!!(%$# whose abilities you had to admit but who was about as likable as a human being as Hitler! All of Cobb's real life awfulness is here--the extreme bigotry, his being a bully and how much all the other ball players hated his guts. The movie is based on a real incident. Decades ago, Ty Cobb hired a ghost writer to create a biography that was pure crap--showing Ty as some sort of beloved character. However, the writer double-crossed him and wrote the truth (as verified by most who knew Cobb) and Cobb sued. All this, along with the biography of Cobb, are shown in the film. While Tommy Lee Jones looks nothing like Cobb, his performance is fun to watch and I was rooting for him to hit Robert Wuhl when he was shooting at him in the movie--then at least we might have been spared the Arliss Show! Unfortunately, the problem with the film is that most people probably won't like Cobb as a person at all and so it's doubtful if the movie has much of an audience. But, if you want to find out why he was the most hated man in ball during his day, give it a shot--you probably will be transfixed by Cobb's awfulness.",
         "I don't know how much of Cobb is fact and how much is fiction. If it is closer to fact than Ty Cobb was a complete and utter ass. A spiteful and hateful man that didn't seem to be worth writing about let alone making a film about but when you peel back the layers you discover so much more about the man and that's what this film tries to capture. The one thing it doesn't truly touch on is that Ty Cobb was about Baseball...period. I thought Cobb would actually show the baseball career of Ty Cobb and it barely shows some flashbacks of such. This film is truly about Cobb in his final days and the infamous rumors circulating the man and his wild personality as told to world famous Sport's writer Al Stump. Sports screen writer Ron Shelton creates an incredible story surrounding a sport's legend based on the real book written by the real Al Stump (who was also an adviser on the film.) Shelton actually manages to make us see the underside of Ty Cobb. Sure the man is a total lunatic, raving about his younger days and his self imposed greatness but there is a sadness lurking below him, a sarcasm to all his behavior, a desire to be loved by making himself hated. Who could play this diverse, and flexible character and make it his own. The incomparable Tommy Lee Jones, that's who. This is one of Jones' best performances and he was absolutely robbed by not getting some sort of nomination for some sort of award. He is the only actor who could create an absolute human monster and still manage to make you feel sorry for him, to make you sense his greatness and his talent. On top of that he plays the man dying in one breath and then goes back for Flashbacks and looks convincing as his younger self. He looks sickly and old and really close to death in his later scenes and he just does an incredible job of really embracing Ty Cobb. Robert Wuhl is an odd actor to take on in a lead role in this film. I say that because at the time and even now he was basically at best a supporting actor. I only remembered him in a small role in 1989's Batman. Besides that and a run with the successful TV Series Arli$$ playing a Sport's Agent (which was after Cobb) he was a no-name and a risk to put him opposite talent like Tommy Lee Jones. I think it was a risk worth taking!! Wuhl does a terrific job as Sport's writer Al Stump (Stumpy.) Their chemistry is unmistakable and both men are such flawed characters (Cobb more than Stump obviously) but they are both battling themselves in one way or another. Wuhl also narrates the story and kind of gives us an inside idea as to what is going on in his own mind as he tries to deal with this Baseball legend. Although I wouldn't describe Wuhl's performance as equal to Jones', I would say he holds his own and does a terrific job. Ron Shelton also directs the film and is certainly no stranger to sports films. After doing Bull Durham, Blue Chips and White Men Can't Jump he really put himself into Cobb. All his sports films are so much more than just about the sport. He brings out his characters and makes you feel them and really care about them and he goes all out with Cobb. You become completely entangled in these two men's lives as they travel together. The film is not about Baseball, it's not about the story, or the trip, or the legends, it's about Ty Cobb...period. Again I don't know how accurate the information is but here he is on the table no holds barred and it's brilliant. It's a biopic about a man that the world hated but no more than I think he hated himself and no more than what he created himself to be. You have to look at small details like his support of fellow team mate Mickey Cochrane, the way his eyes light up when he speaks of his children and the constant mention of his parents and his father's death. I read several reviewers that brought up the point in the narration when Al Stump says \"I did something Ty Cobb never did...lie.\" They point out that Ty Cobb lied about everything and I think that was the idea...that comment was entirely, heavily sarcastic. See the film for yourself because Baseball fans and Tommy Lee Jones fans and fans of powerful biopics will love it. For others it might move a little slowly. It's worth seeing. 8.5/10",
         "Ty Cobb is, by far, the most interesting and belligerently insane athlete to ever live. His baseball career was unparalleled in absurd statistics, brilliant strategy, and pure unadulterated violence. Every game he played in was a spectacle in human ability and cruelty. So of course, the film about him deals with none of that, instead focusing on the writing of his biography by author Al Stump. Now this isn't such a horrible idea in theory, as Cobb himself slid even further into paranoid dementia as years progressed and the stories of his crazed outbursts even as a senior are shocking even by today's desensitized standards. But instead of focusing on these events, which I figure were simply too interesting, the film is a pseudo fictionalized road film with a clichéd plot that will cause any knowledgeable Cobb fan to cry vinegar tears. Tommy Lee Jones does quite well as a crotchety Cobb, but somehow manages to overplay his cartoon supervillainy. Most stories about Cobb are barely believable, but to make him even crazier seems both impossible and unnecessary. Robert Wuhl, portraying the writer Al Stump, is a dark vortex of non-talent. He sucks the life out of every scene, trying to make this film his own Nagasaki. There is a reason we never see him as a leading man anymore (Arli$$ does not count. It's barely a show). Even the played out, inevitable \"role reversal\" of Cobb and Stump by the end is made even worse by his pure inability to utter lines that don't sound akin to a bottom shelf book on tape narration voice. For all the awful writing and bland film-making on display, there is one sequence which stands out as so far superior to the rest of this failure that accepting it's from the same film is near impossible. A hyper stylized flashback sequence displaying Cobb's overpowering psychology and brutal athleticism while actually playing the game of baseball is pure brilliance. The camera moves in bizarre fashion and the whole event seems like a dream due to the unique playing style of the monster Cobb. Every slide, hit, and tackle are rendered even more forceful due to enhanced sound, and Tommy Lee Jones OWNS the intensity of the master player. It makes the viewer drool over the possibilities of a true biopic of Cobb in his prime with the same actor. It's worth watching the film for this incredible few minutes alone, just to see what could have been. I may be slightly unfair to this film due to my own knowledge of Ty Cobb and wanting it to be something it isn't, but to make such boring, neutered movie about this maniac is nonsensical. I'm glad Ron Shelton's career has slid ever since."
      ],
      "genres": [
         "Biography",
         "Drama",
         "Sport"
      ],
      "productionCompanies": [
         "Alcor Films",
         "Aleor Films",
         "Regency Enterprises"
      ],
      "summaries": [
         "Al Stump is a famous sports-writer chosen by Ty Cobb to co-write his official, authorized 'autobiography' before his death. Cobb, widely feared and despised, feels misunderstood and wants to set the record straight about 'the greatest ball-player ever,' in his words. However, when Stump spends time with Cobb, interviewing him and beginning to write, he realizes that the general public opinion is largely correct. In Stump's presence, Cobb is angry, violent, racist, misogynistic, and incorrigibly abusive to everyone around him. Torn between printing the truth by plumbing the depths of Cobb's dark soul and grim childhood, and succumbing to Cobb's pressure for a whitewash of his character and a simple baseball tale of his greatness, Stump writes two different books. One book is for Cobb, the other for the public.",
         "A reporter hired to write the 'official' biography of Ty Cobb discovers just how dark the baseball legend's real story is."
      ],
      "budget": 0
   },
   "movielensId": 354,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-12-02",
      "dvdReleaseDate": "2003-09-02",
      "directors": ["Ron Shelton"],
      "runtime": 128,
      "movieId": 354,
      "title": "Cobb",
      "mpaa": "R",
      "actors": [
         "Tommy Lee Jones",
         "Robert Wuhl",
         "Lolita Davidovich",
         "Ned Bellamy"
      ],
      "imdbMovieId": "0109450",
      "originalTitle": "Cobb",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["zZFiH0SQpiY"],
      "plotSummary": "Al Stump is a famous sports-writer chosen by Ty Cobb to co-write his official, authorized 'autobiography' before his death. Cobb, widely feared and despised, feels misunderstood and wants to set the record straight about 'the greatest ball-player ever,' in his words.",
      "tmdbMovieId": 29973,
      "avgRating": 3.15146,
      "releaseYear": "1994",
      "numRatings": 1271,
      "posterPath": "/pzNL05RokKe6Nj1Bkp5gi8Fd0FH.jpg"
   }
}