{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "independent film",
         "id": 10183
      }],
      "imdb_id": "tt0160644",
      "video": false,
      "title": "Passion of Mind",
      "recommendations": [
         76297,
         31281,
         61418,
         31668,
         291326,
         15398,
         292191,
         82315,
         273610,
         18856,
         250622,
         122796,
         51321,
         13903,
         19723,
         42217,
         19378,
         186606,
         22792,
         44772
      ],
      "backdrop_path": "/wa9IYxxcJoYsgV19Up6jSiML4Pq.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Aaron Reilly",
               "gender": 2,
               "credit_id": "52fe47c79251416c750a5249",
               "name": "William Fichtner",
               "profile_path": "/oIGjbztWvTqn4tnolW9rDCjpgxu.jpg",
               "id": 886,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Martha Marie / 'Marty' Talridge",
               "gender": 1,
               "credit_id": "52fe47c79251416c750a5253",
               "name": "Demi Moore",
               "profile_path": "/eLNoOYnxvhpV0BMSkNNnyyo5In7.jpg",
               "id": 3416,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Jennifer 'Jenny' Talridge",
               "gender": 1,
               "credit_id": "57bbed5f9251410ed000630a",
               "name": "Eloise Eonnet",
               "profile_path": "/wvJBExhSzLO17XI6Jv5Zb8VLvHp.jpg",
               "id": 1626487,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Kim",
               "gender": 1,
               "credit_id": "57bbed69925141553e002aef",
               "name": "Julianne Nicholson",
               "profile_path": "/iXjSXsYpb8GAehnLPKX74eXZE6H.jpg",
               "id": 86034,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Jessie",
               "gender": 1,
               "credit_id": "57bbed7492514176d2006955",
               "name": "Sinéad Cusack",
               "profile_path": "/r9eWOKN1WtE7RMDAwIhOpMRh3wL.jpg",
               "id": 11281,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Dr. Langer, the French Psychiatrist",
               "gender": 2,
               "credit_id": "57bbed81925141550c002c80",
               "name": "Joss Ackland",
               "profile_path": "/l7XyBslyU5slMUuO9zTjCRZKXex.jpg",
               "id": 14324,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Dr. Peters, the New York Psychiatrist",
               "gender": 2,
               "credit_id": "57bbed8d925141553e002afc",
               "name": "Peter Riegert",
               "profile_path": "/yPgaRZBMVy9eoNNuiPIm0wzG9sD.jpg",
               "id": 20899,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "William Granther",
               "gender": 2,
               "credit_id": "57bbed99c3a3686068006b14",
               "name": "Stellan Skarsgård",
               "profile_path": "/zSCU2agleLtJEvzj98jEesVhBxa.jpg",
               "id": 1640,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Edward 'Ed' Youngerman",
               "gender": 2,
               "credit_id": "57bbedaac3a3686068006b1d",
               "name": "Gerry Bamman",
               "profile_path": "/ybNlqyoXcAQ5pKz6fFD7Ff7LKcz.jpg",
               "id": 11517,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47c79251416c750a524f",
               "name": "Alain Berliner",
               "profile_path": "/g7KHUxBKBGbHldYbNldyPiY40RX.jpg",
               "id": 96972,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "57bbedc6c3a36852eb00649a",
               "name": "Ronald Bass",
               "profile_path": null,
               "id": 5144,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "57bbee15925141553e002b34",
               "name": "David Field",
               "profile_path": null,
               "id": 1669348,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "57cf7c4b92514134a5004809",
               "name": "Anne V. Coates",
               "profile_path": null,
               "id": 6346,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.283439,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 19214,
      "vote_count": 8,
      "budget": 0,
      "overview": "When Marie, a widow in Provence with two daughters, locks her bedroom door and goes to sleep, she dreams about Marty, a literary agent in Manhattan who dreams equally vividly about Marie. The women look alike. Marie meets William who begins to court her. Marty meets Aaron, an accountant, becomes his friend and then his lover. Both women tell their lovers about their dream life. William is jealous, Aaron is accepting. Even though they've become lovers, Marie won't fall asleep next to William. Marie goes on holiday with William to Paris, and Marty wakes up with an ashtray from the hotel on her night stand. Are they the same person? What will unlock reality",
      "similar": [
         3134,
         11564,
         281,
         133805,
         2142,
         22323,
         294963,
         948,
         8810,
         298312,
         14433,
         1359,
         141,
         185,
         101,
         205,
         949,
         12162,
         8923,
         769
      ],
      "original_title": "Passion of Mind",
      "runtime": 105,
      "poster_path": "/qp8p8eXC67vfNxfuqrrYbuCOkbQ.jpg",
      "spoken_languages": [
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [],
      "release_date": "2000-01-07",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "What if you had two lives at once. What if you knew that one life took place only in your dreams. What if you didn't know which life was real.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Alain Berliner"],
      "runtime": 105,
      "synopsis": null,
      "writers": [
         "Ronald Bass",
         "David Field"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0160644/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNjMxNjg1NjY2OF5BMl5BanBnXkFtZTcwOTIwNDMyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Demi Moore, Eloise Eonnet, Hadrian Dagannaud-Brouard | See full cast and crew »"],
      "reviews": [
         "Surprisingly absorbing film that requires your patience (to let it unfold) and your attention (to capture all the nuances, and they are there). Demi Moore (looking angular and pale like Courteney Cox-Arquette, yet more flexible) is very fine as a woman living parallel lives, one of which is a dream-world. She's a widowed book reviewer in France with two kids and also a literary businesswoman in New York City. Complicating matters are two separate lovers (and shrinks!) who all say that the OTHER life she's having is a dream. Plot is laid out in elementary terms (with some nice surreal edges there at the finale) and I found it a pleasant, intriguing bit of fantasy, quite romantic in its melodrama. And for the poster who hated this on both plane flights he saw it on, heads up: most films look bad on planes. *** from ****",
         "How much one enjoys this film depends greatly on how much of Demi Moore you can stand. If you like long drawn out schmaltzy romances with Demi as the romantic heroine, you will love this film times two. Otherwise, hide any weapons lest you begin attacking your screen. This film was toasted by the critics, but I didn't think it was that bad. In fact, I liked it. I guess I fall more into the first (sucker for schmaltz) category. The story was criticized as being a contrived version of `Me, Myself and I', where a woman is torn over the choice between life as a professional and the family shtick. That criticism really misses the point. This is a story about a woman's psychological attempt to deal with her traumatic past and has nothing whatever to do with lifestyle choices. I found this to be an intelligent and complex character study of a woman who seems to be two people living two lives, but really isn't. If that seems cryptic, see the film and it might become clearer. When she goes to sleep from her life with her children in France, she wakes up to her high-powered career in New York and vice versa. She can't determine which is real and which is a fantasy. She has a lover in each life and both seem very real to her. As the story unfolds, she and we try to figure out which is her real life and which is the dream. The trouble with the presentation is that its real intrigue lies with the psychodrama. Unfortunately, neophyte director Alain Berliner pushed that element to the background and cranked up the schmaltz machine, centering the story on the romances instead. That wouldn't have been so bad if they weren't so interminable. Scene after scene retraced the same romantic theme, until it became frayed. Other than the misplaced emphasis, the film was well crafted. There were subtle hints throughout about which was the real life, but they were far from obvious tip-offs. However, when we finally discover the truth, it takes forever to wrap up the loose ends. To Berliner's credit, the locations were breathtaking, in both France and New York. It is easy to find beauty in the French countryside, but these were some of the most wonderful film perspectives I have ever seen of New York's skyline and street vistas. After enjoying a few years as one of the highest paid entertainers on the planet, Demi Moore disappeared for three years. This was probably not the best vehicle for her return. Her performance was strongly emotional but one-dimensional, failing to differentiate the characters sufficiently. She played the high-powered NYC girl to be just as wimpy as the insecure girl in France. To be fair however, she created two very appealing and vulnerable romantic characters and deserved better notices than she received. William Fichtner was not the greatest choice for her NY love interest. Fichtner is better at abrasive antagonist roles and his attempts at sensitivity came across as far too pathetic. Stellan Skarsgard was much better and made a dashing and attractive romantic figure. This was a good story that took a sentimental detour under the guidance of an inexperienced director. Still, it was engrossing and even touching at times. I rated it a 7/10. Add a point if you like sentimental pieces and subtract at least two if you aren't a Demi Moore fan.",
         "Demi Moore is excellent in this intelligent drama about a widow living with her children in France who keeps going to sleep and waking up as a single career woman in New York. The double life is so effectively convincing that she can't tell which of the lives is real and which is the dream. On top of this, she has romantic interests in both lives, a controlling and passionate writer in France (Stellan Skarsgard), and a giving and kind man in New York (William Fichtner, his best performance yet). Moore's fascinating screen presence keeps this movie going even when it sags terribly in the middle, and Ronald Bass' script makes such a compelling argument for both of her lives that it's very difficult to guess for yourself what the outcome will be. The film's conclusion is so well played out and rewarding that it renders any previous flaws completely void. Also features a rich performance by Sinead Cusack.",
         "For those of us who like to remember loved ones, who believe movies can and must be more than just a laid back entertaining experience, but a voyage through our own feelings, imagination and the past images, people and moments gone by that make us who we are today, I would recommend this apparent portray of a woman's insanity between two lives that are, in reality, directly linked to explain who she really is. Yes the movie is sometimes difficult to follow for rational minds, but the final moments bring it all together. You may not like it from a rational standpoint, but from an emotional one, if you have found in a stituation someday where you've had to relive, accept and say goodbye to your past in order to really appreciate your present, then emotionally, you will understand and appreciate it. Demi Moore delivers a subtle and wonderful performance. I miss her. I wish someone would tell her (or Hollywood) that an actress should not be judged on the regularity of big movies she cashes in for them but on the quality of the movies and messages her projects deliver. Thanks for making me remember my mom again ;)",
         "SPOILERS - This is a Demi Moore film with a fine supporting cast. Her dilema is this, she has two very real existences, one in New York as a high-powered professional, the other in France as a widow with two children. However, one of them is a dream and she doesn't know which. Neither do we. When she sleeps in one existence, she is awake in the other. In both she has a psychiatrist who assures her the \"other\" existence is a dream, and in each she has a new beau who is falling in love with her. In the end we find that the French existence is really a dream, taking her back to her childhood there. She had never reconciled the premature death of her mother, and in her dream she became the mother, the two children were her at different ages. A fine, entertaining, thought-provoking film. Most of the critics, like Ebert, got this one wrong. It is better than they said it was, probably because they decided early into the film that it wasn't good.",
         "I never knew this film even existed untill about a week ago. I saw it on sale at a supermarket and i was intrigued by the synopsis of the story at the back cover. I love this type of stories about paralel universes but i was not sure that a story like this could work properly as a serious romantic drama. Particulary one made-in-Hollywood. Basicaly i feared that this was another comercial sugar coated Jennifer Lopez-Julia Roberts comercial movie. I was wrong. I rented this movie totaly convinced that it was going to be bad, but, after the movie ended, i went back to the supermarket and i bought a copy for myself ! PASSION OF MIND was a real surprise to me. I´ve been reading plenty of bad reviews about it after i´ve seen it, and i can´t disagree more with them. I guess most people don´t realy get it´s idea and so rather than thinking about it, they decided the movie sucks. Possibly because it doesn´t follow that usual love-story comercial crap that make Hollywood´s so called romantic movies, most people don´t like it, because this PASSION OF MIND is a movie where you have to think along and you don´t have everything totaly explained all the time. But above all it´s an original movie, and a very good diferent aproach to a romantic story without making it look plastic. What stroke me first was the incredible cinematography. I never before seen New York filmed in such a beautiful way. The exterior locations looked trully beautiful and it´s a real viewing pleasure just to see a good story set against such beautiful images in the background. As for the plot, i think it´s a brilliant concept and a very inteligent way of telling a romantic story. Ok it might not be the most original one if you read a lot of sci-fi novels, but in this case it was extremely well presented, with never a dull moment despite the slow pace the story moves along. A great for story for people who like \"sci-fi\" themes and for people who don´t. Great script, good dialogue, good ending and it keeps its mistery right up untill the end ,without giving much away through out the whole film, making us stay glued to the tv set untill the movie finaly ends. (The region 2 dvd, has an incredible image and a fantastic 5.1 sound mix wich fills the room with a perfect 3d atmosphere) If you like stories about paralel realities, and you like this sort of existencial themes and hipotesis, you´re going to love this movie. As someone said in a review back here somewhere, this is a real good quantum mechanics movie, wich depicts very well some of the concepts present in those theories without complicating things for the viewer. Above all it makes us think and wonder. It´s a great movie to initiate a discussion about the theme afterwards and a very inteligent and beautiful romantic story. Pretty impressive actualy. As i said, a real good surprise. If you like originality, watch this. If you only like guns, explosions and special effects, stay away because you won´t get it. PASSION OF MIND is trully an execelent surprise.",
         "In Alain Berliner's (Ma Vie en Rose) new film PASSION OF MIND Demi Moore (G.I. Jane) is torn between reality and a dream. When we first meet her she is Marie a mother of two daughters living in the French country side and reviewing books for a stateside paper. She lives as a recluse, pretty much, except for a friend (Sinead Cusack) who helps her deal with personal problems, including the death of her husband. We assume that Marie has some deep emotional problems but it isn't until she goes to sleep that we find out just how deep those problems are. You see, when Marie goes to sleep she dreams she is Marty, a New York literary agent. Marty is single and very independent. She has no children and is very passionate about her work. Marty has no time for relationships and keeps everyone at a safe distance emotionally. But, you can see in her face that she to has a secret. Yes, that's right when Marty goes to sleep at night she dreams she is Marie. Both Marie and Marty are fully aware of the other but neither knows which is dream and which is reality. It is here that the story starts to get interesting. Marie meets William (Stellan Skarsgard,) an author whose book Marie panned. William, almost stalking, shows up one day and befriends one of Maries daughters and eventually works his way into Maries heart. Meanwhile, Marty encounters Aaron (William Fichtner,) an accountant doing business with her firm, who has an immediate attraction to her. And, just like Marie, Marty begins to have feelings for Aaron. Marie and Marty begin to realize they are in love. But, which one is real? In both lives there are therapists trying to help solve this very problem. Both Marie and Marty can feel each other's love. We, as the viewer, feel it too! Neither woman allows their respective men to get too close, believing something bad may happen if either of them are awakened in the middle of the night. Both women realize that their relationships cannot last like this. They must figure out which is reality and which is dream. If they make the wrong decision all could be lost. We try to decide, as well, which is real and which is dream. It's not until we start to unlock the past that we find out if we have made the right decision. The writers (Ron Bass and David Field,) do a great job using the dream world to show how some people deal with traumatic events in their past by suppressing them into their subconscious. Everyone and everything in the dream life represents something significant in the real life past. The cinematography is also wonderful. Eduardo Serra (What Dreams May Come, The Wings of The Dove) shoots the French scenery marvelously making it seem very tranquil, while giving Manhattan a dark, cold and very overwhelming feeling. The director, Berliner, then takes this material and crafts it into a tale of duality, where one woman locks her feelings deep in her own mind and takes them out only in the privacy of her dreams.",
         "An interesting argument in a very slow film, which seems to be more French than an American made one. You must see carefully the first scenes to follow the proposed plot. If you do not that you will be certainly lost by mid of the film. Even though you will be in doubt regarding the real personality of Marie/Martha Marie 'Marty' Talmadge (Demi Moore). Whom she really loved? it was a mystery.",
         "This movie is not about thrills and chills. It is about self discovery, self nurturing, settling of one's past, I think. The pace is slow and gentle. There are quite a few cues in the movie that are confusing as one tries to figure out the real world versus the dream world. However, the chemistry between Demi Moore's character (Marty) and William Fichtner's character (Aaron) seems more substantial, although initially, less romantic. In trying to figure out what is really going on, as I viewed the movie, I felt a little off balance. The dialogue is really good. There is a lot of truth about relationships revealed here. This movie is worth checking out especially if you want a change of pace.",
         "This is a very fine film, one I very nearly missed because of my disdain for Demi Moore. But I was wrong. Director Alain Berliner gives her both the safe space and the restraint that she needs to go beyond herself and produce by far the best performance of her career (of the films I have seen). With a very fine ensemble cast including Willaim Fichtner, Stellan Skårsgard, Joss Ackland, Sinead Cusack and Peter Riegert, this film offers a delicate exploration of questions central to human psychology and the interaction of our inner and outer lives. Beautifully photographed by Eduardo Serra and surprisingly well-written by Hollywood regular Ron Bass and relative neophyte David Field, this film at first appears to be heading for typical \"Women's Film\" territory, but Berliner and the writers put a wholly original, subtly crafted spin on it that makes it anything but predictable and ordinary. I have a complete review of the film up at my website: www.thenedpages.com - then click on \"critical analysis\" and pick it off the list of reviews."
      ],
      "genres": [
         "Drama",
         "Mystery",
         "Romance",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": [
         "Lakeshore Entertainment",
         "Ron Bass Productions"
      ],
      "summaries": [
         "When Marie, a widow in Provence with two daughters, locks her bedroom door and goes to sleep, she dreams about Marty, a literary agent in Manhattan who dreams equally vividly about Marie. The women look alike. Marie meets William who begins to court her. Marty meets Aaron, an accountant, becomes his friend and then his lover. Both women tell their lovers about their dream life. William is jealous, Aaron is accepting. Even though they've become lovers, Marie won't fall asleep next to William. Marie goes on holiday with William to Paris, and Marty wakes up with an ashtray from the hotel on her night stand. Are they the same person? What will unlock reality?",
         "A psychological romantic thriller where fantasy and reality become indistinguishable for a woman leading a double life in her dreams."
      ],
      "budget": 0
   },
   "movielensId": 3540,
   "movielens": {
      "languages": [
         "Français",
         "Italiano"
      ],
      "releaseDate": "2000-01-07",
      "dvdReleaseDate": "2000-09-19",
      "directors": ["Alain Berliner"],
      "runtime": 105,
      "movieId": 3540,
      "title": "Passion of Mind",
      "mpaa": "",
      "actors": [
         "William Fichtner",
         "Demi Moore",
         "Eloise Eonnet",
         "Julianne Nicholson",
         "Sinéad Cusack",
         "Joss Ackland",
         "Peter Riegert",
         "Stellan Skarsgård",
         "Gerry Bamman"
      ],
      "imdbMovieId": "0160644",
      "originalTitle": "Passion of Mind",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["5HbYGhOndJY"],
      "plotSummary": "When Marie, a widow in Provence with two daughters, locks her bedroom door and goes to sleep, she dreams about Marty, a literary agent in Manhattan who dreams equally vividly about Marie. The women look alike. Marie meets William who begins to court her. Marty meets Aaron, an accountant, becomes his friend and then his lover. Both women tell their lovers about their dream life. William is jealous, Aaron is accepting. Even though they've become lovers, Marie won't fall asleep next to William. Marie goes on holiday with William to Paris, and Marty wakes up with an ashtray from the hotel on her night stand. Are they the same person? What will unlock reality",
      "tmdbMovieId": 19214,
      "avgRating": 2.94872,
      "releaseYear": "2000",
      "numRatings": 156,
      "posterPath": "/qp8p8eXC67vfNxfuqrrYbuCOkbQ.jpg"
   }
}