{
   "tmdb": {
      "original_language": "fr",
      "keywords": [],
      "imdb_id": "tt0064180",
      "video": false,
      "title": "Coming Apart",
      "recommendations": [
         267523,
         259231,
         115162,
         183859
      ],
      "backdrop_path": "/hqEyb6IFq3hUqFDCnuAnDMgCeIK.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1003,
               "character": "Joe",
               "gender": 2,
               "credit_id": "52fe4832c3a368484e0ed9ab",
               "name": "Rip Torn",
               "profile_path": "/rzGaoGikjMuLDruABKdLcQLtkZk.jpg",
               "id": 9626,
               "order": 0
            },
            {
               "cast_id": 1004,
               "character": "Joann",
               "gender": 1,
               "credit_id": "52fe4832c3a368484e0ed9af",
               "name": "Sally Kirkland",
               "profile_path": "/bAjUA08z6k8FZ3bu5QWcMWWVdMQ.jpg",
               "id": 12134,
               "order": 1
            },
            {
               "cast_id": 1005,
               "character": "Karen",
               "gender": 1,
               "credit_id": "52fe4832c3a368484e0ed9b3",
               "name": "Phoebe Dorin",
               "profile_path": null,
               "id": 170865,
               "order": 2
            },
            {
               "cast_id": 1006,
               "character": "Julie",
               "gender": 1,
               "credit_id": "52fe4832c3a368484e0ed9b7",
               "name": "Julie Garfield",
               "profile_path": "/sWMxtfDZzFScBm0Le6A2CVLqcz7.jpg",
               "id": 155890,
               "order": 3
            },
            {
               "cast_id": 1007,
               "character": "Elaine",
               "gender": 0,
               "credit_id": "52fe4832c3a368484e0ed9bb",
               "name": "Lois Markle",
               "profile_path": null,
               "id": 171543,
               "order": 4
            },
            {
               "cast_id": 1008,
               "character": "Amy",
               "gender": 1,
               "credit_id": "52fe4832c3a368484e0ed9bf",
               "name": "Nancy MacKay",
               "profile_path": null,
               "id": 1014359,
               "order": 5
            },
            {
               "cast_id": 1009,
               "character": "Ted",
               "gender": 2,
               "credit_id": "52fe4832c3a368484e0ed9c3",
               "name": "Michael McGuire",
               "profile_path": null,
               "id": 29713,
               "order": 6
            },
            {
               "cast_id": 1010,
               "character": "Armand",
               "gender": 2,
               "credit_id": "52fe4832c3a368484e0ed9c7",
               "name": "Kevin O'Connor",
               "profile_path": null,
               "id": 937572,
               "order": 7
            },
            {
               "cast_id": 1011,
               "character": "Lois",
               "gender": 1,
               "credit_id": "52fe4832c3a368484e0ed9cb",
               "name": "Jane Marla Robbins",
               "profile_path": "/uCYxhDwsLCLZoWGCm5Txc1DUsJv.jpg",
               "id": 140591,
               "order": 8
            },
            {
               "cast_id": 1012,
               "character": "Monica",
               "gender": 1,
               "credit_id": "52fe4832c3a368484e0ed9cf",
               "name": "Viveca Lindfors",
               "profile_path": "/r7F33o0rlbeQkxVGlRunhJ0gxjH.jpg",
               "id": 22137,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4832c3a368484e0ed99b",
               "name": "Milton Moses Ginsberg",
               "profile_path": null,
               "id": 563031,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4832c3a368484e0ed9a1",
               "name": "Milton Moses Ginsberg",
               "profile_path": null,
               "id": 563031,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4832c3a368484e0ed9a7",
               "name": "Lawrence Tetenbaum",
               "profile_path": null,
               "id": 589578,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.354026,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 71402,
      "vote_count": 5,
      "budget": 0,
      "overview": "A psychiatrist secretly films his female patients as an experiment; he pushes both him and his customers in ways that induce his own mental breakdown.",
      "similar": [],
      "original_title": "Coming Apart",
      "runtime": 110,
      "poster_path": "/zIGEUUgtH8vvVLFylsVrQEcuPBc.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Kaleidoscope Films",
         "id": 29305,
         "origin_country": ""
      }],
      "release_date": "1969-10-26",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Milton Moses Ginsberg"],
      "runtime": 110,
      "synopsis": null,
      "writers": ["Milton Moses Ginsberg"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0064180/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUyNzg1MDc3OF5BMl5BanBnXkFtZTcwODEzOTEyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Rip Torn, Sally Kirkland, Robert Blankshine | See full cast and crew »"],
      "reviews": [
         "The conceit of 'Coming Apart' is that the film is footage from a hidden camera placed by a married psychiatrist in his Manhattan flat-away-from-home to document sexual encounters with various women, as a way (perhaps) of rebutting against the mistress who broke his heart and not incidentally lives in the same building. Rip Torn is the psychiatrist, Joe Glassman, Viveca Lindfors is the mistress, Monica, and Sally Kirkland is a young former patient, Joanne, slowly coming unhinged and projecting her failures onto Joe. In its voyeurism and genuinely objective cinema vérité style (the camera never moves, unless Joe is positioning it for another encounter), it resembles some of the films of Andy Warhol, but this is more resonant because Warhol's films depicted a counterculture, while this one depicts something closer to normal. 'Coming Apart' is absolutely gripping and fascinating to watch in a way that most ordinary films, edited and filmed with a point-of-view, are not. The camera just sits there, the scenes unfold, and I entered a sort of hypnotic state. The movie makes a clear illustration of the function of cinema as voyeurism, and also a convincing argument for voyeurism as the purest form of truth on film. The filmmaker, Milton Moses Ginsberg, has made a movie predicated as much on film theory as on personal experiences. In the latter respect, it is uninhibitedly candid, and often very painful. The actors give performances that are naked and free of affect, and this is particularly true of Sally Kirkland, who is barer here than any of Lars von Trier's heroines, and it's a brave performance. Because the dramatic elements are so intense and effective, this is not merely an exercise or an experiment, because it transcends its form. The symbolism is a bit heavy-handed at times, but it isn't unsuccessful. Joe is the ultimate self-reflective individual, looking inward, looking at himself, filming himself, somehow vacant and lacking a distinguishable personality, with a large mirror behind the couch on which he sits (a courtesy to the viewer, as well) -- how could his surname be anything other than \"Glassman\"? That he is a psychiatrist adds another layer of provocation. A vicious cycle is depicted. Joe's instability makes it impossible for him to responsibly treat his patients, and the instability of his patients makes sexual intimacy with them dangerous to his own already fragile psychological state. The movie is not perfect, and it gradually introduces jump cuts (accompanied by a thundering snapping sound) and presents the final scene in slow-motion. While these things are dramatically effective, they are inconsistent with the parameters established by the movie's conceptual conceit and therefore constitute a severe flaw -- being, the introduction of a point-of-view, of a director's manipulation of the material. While it can't be overlooked, it can be excused, I think, in the face of this extraordinary film's many other merits. 'Coming Apart' was not well-received, yet I think it would have been were it a European film. There are things that European filmmakers can get away with but American filmmakers cannot, and 'Coming Apart' is daring, penetrating, and probably, in its way, ahead of its time. Sadly, it was buried for over 25 years and Milton Moses Ginsberg had to settle for a career as an editor. This is unfortunate, as I'd love to see the filmmaking career he might have had.",
         "I was walking down the street in New York in the late 60's and I passed a small movie theater, one of many at that time, and posted on the marquee was \"Coming Apart\" starring Rip Torn. I thought that was pretty funny so I went in. From the very beginning to the end I was mesmerized by the screen. In a small dark theater the beginning is very disturbing, and the monologues and dialogs that followed were no different. This portrait of a man and his thoughts or experiences is a dark and sometimes brutal portrayal of his enclosed existence, seeing that the only reference we have visually is his apartment. I don't know what was more disturbing, his relationships or his thoughts. The movie flows from darkness to his little girl neighbor to Sally Kirkland bouncing on his knee to the incident with the drag queen and everything else in between to fade out. When I left the theater I was exhausted and disorientated. It is almost forty years later, I've never seen the film again, and I'm still struck by it. Seeing that film at that time and living in New York then is probably why the film had such an affect on me.",
         "This has got to be one of my guilty pleasures. This film is not always easy to watch and the sound is something awful. However, it's painfully powerful to watch. Not only is Torn's character, Bill the Psychiatrist, literally coming apart, the bulk of the women who pass through his pseudo-office come love nest are almost to a one frayed at the edges. It it passes your way on the tube or else where, give it some attention.",
         "Rip Torn is very good as Bill, a Psychiatrist whose life is literally \"coming apart\". And what's worse, he's filming it. Shot mostly from one static vantage point, the entire film takes place in a New York City high rise. We watch as Bill's life unfolds in front of us. His dysfunctional marriage, his trysts with women patients, and so on. Truly a fascinating little film, perhaps way before it's time, and unjustly ignored.",
         "Rip Torn is a psychiatrist who places a hidden camera on a shelf across from his sofa. There's a wall sized mirror behind the sofa which is how we see the rest of the place. Then we watch as various women come and go, including one who has a cleavage full of cigarette burns. The idea is that he is having a breakdown and documenting it as well as documenting these women who also happen to be patients. But no amount of verbiage can describe this movie. It truly has to be seen to be believed. With such first rate actors as Torn, Kirkland and Lindfors, the picture is never actually excruciating because it's quite something to watch them go through their paces. So if you are ever given the chance to see \"Coming Apart,\" my advice is don't miss it. Feature length stunts like this are, for better or worse, few and far between.",
         "I wanted to reply to bornjaded's post (though it's from two years ago and this is such an obscure film, I doubt we'll be having much of a dialogue). But still. I just watched this film with my husband last night and we both found it totally fascinating. I was particularly moved by Sally Kirkland's performance as Joanne -- and didn't recognize her at all until I saw her name in the credits. I love bornjaded's comparison to Lars Von Trier's heroic lead performances. I, too, thought she was incredibly brave in this film -- that drunk scene was almost unbearable to watch. What I particularly wanted to respond to is your criticism of the rupturing of the film's point of view by showing jump cuts and the final slow motion sequence. I thought the final sequence was, as well as being stunningly effective film-making, formally justified in that it showed Joanne's destruction of Joe's whole visual construct, his camera, his voyeurism, his control. At the risk of sounding too dogmatic or reductive, the whole time I was watching the film, I kept laughing about how the so-called sexual revolution was really just the continued sexual enslavement of women with new clothes, new music and some new dance moves. It was just killing me how every woman who walks into Joe's apartment throws herself at him to the point where it was beginning to seem like a sixties male fantasy -- that is, until the arrival of Joanne who suddenly was this fully realized, intelligent, questing, sexually alive creature. A real match for Joe (the \"Joe\" and \"Joanne\" parallel only now occurs to me), including his madness. I kept thinking of Diane Arbus watching Sally's performance, how brave it must have been for her to step out of her inscribed world, take up a camera, re-make herself and finally lose her mind. So when the film ends with Joanne trashing Joe's place, I thought, \"This is fantastic -- the rules of the male gaze are being destroyed, Joanne has arrived and now the whole machine is about to be re-made.\" It was like seeing the corrupt regime thrown over, or, in a stab at a psychological reading, the repressed feminine insisting on her full expression. In that sense, it made sense to me that the film could rupture its own form in this final moment. It is being taken over, painfully, by Joanne's subjectivity. I loved it. Woke up thinking about it first thing this morning, always a good sign of some powerful cinema. As for the jump cuts, they didn't bug me as much as they did you, I felt like that device was more or less established throughout -- take another look at the first half of the film, several of the early scenes are fragmented with that same noisy sound effect. Anyway, just wanted to try to engage with someone about this powerful but obscure film. I agree with another commenter that had it been European it might have been more recognized. Hell, most Godard is WAY more impenetrable than this was. Isn't it fun to imagine that people actually made movies like this once?",
         "Like Blair Witch, this could seem like an authentic documentary for the less informed. However, it's a clever piece of film making. Rip Torn plays a psychiatrist with emotional problems who feels he can solve them if he secretly films himself with his female patients/lovers/pick-ups. There are those who may not have a lot of patience with the program as it's shot entirely in a small apartment room. Other viewers won't be able to watch it without experiencing memories of their own romantic life because Torn's character isn't to different from most men. I see a lot of myself in him. He's always on the prowl for a new conquest. He grows tired of the women who fling themselves at him and he constantly desires the ones who don't. This is the only movie made by Milton Moses Ginsberg.",
         "Coming Apart has the kind of format and style that virtually guaranteed failure in finding distribution and a mainstream audience. We are conditioned by traditional film-making that use formal editing techniques and camera work to tell a story with a plot, a formal beginning and a formal ending and when a film goes against an accepted style, critics and audiences can't understand it. This entire film is the result of a hidden camera (in a piece of artwork) facing a couch and behind the couch, a wall-sized mirror that reflects his windows overlooking a Manhattan skyline. This device minimizes the inherent claustrophobia of just photographing a man sitting on his couch. It is never explained why he is doing this. The 60s was the decade of the grindhouse sexploitation film, the precursor to hardcore porn. They could be divided into three categories. The nudies, the ghoulies and the roughies. Coming Apart superficially resembles a sexploitation roughie--grim, moody, downbeat, shot in black & white featuring bizarre personalities and twisted sexuality. The roughies showed women being routinely slapped around, raped and verbally abused. But there are art-house and technically experimental film-making aspirations in Coming Apart that make it far more than a psycho-drama. The near static presentation could have been a filmed stage play. A young Sally Kirkland gives one of the most amazing performances I've ever seen. Her tirade at the end is hypnotic in its non-theatrical realism and ferocity. (I had to watch it several times.) Rip Torn is a master at brutal outbursts, the cold manipulation of women and a troubled, savagely tempered personality. He's perfect for the role of a psychiatrist who manipulates every woman who enters his sphere of orbit for his own uses, and not just for sex, but for some kind of perverse control and personal power. (Like in traditional sexploitation films, the men have sex with their underwear on.) Ginsburg says in the extras that the film was carefully scripted yet the dialogue sounds improvised and spontaneous. Sally tells Glassman that he \"treats women like castrating women treat men.\" This one line is the key to the film. The lightbulb moment came to me about 20 minutes in. This movie foreshadowed, by over 30 years, the YouTube generation of millions of people at their computers recording themselves in a room with a video web-camera.",
         "A self-indulgent mess with pretensions of deep meaning, but so void of cinematic originality that it cannot disguise the emptiness of its conceit, which consists singularly of an immobile camera, in front of which Rip Torn sits on a couch and bitches and moans for two never-ending hours. There are a lot of nude women to watch but they're so annoying that after a minute or so you just want them to put on their clothes and get the hell off-screen. This is the kind of experimental, cinema-verite film-making that seemed deep in the sixties when everyone was burnt out on acid, but the days of LSD are long gone, leaving only this headache-inducing, stomach-cramping piece of swill, which can at least hopefully serve as a testament to the dangers of allowing no-talent people to use a movie camera. Enter at your own risk."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Kaleidoscope Films"],
      "summaries": [
         "Joe is a psychiatrist who puts a hidden camera behind his couch, facing a wall sized mirror in order to document a number of women who come and go. Obsessed with a former lover, Joe intends to perform and record an \"experiment in contemporary sexual aberration.\" In the process, Joe documents his own mental breakdown as well as a number of sexually volatile encounters with the women who come to see him.",
         "Psychiatrist installs a concealed movie camera in his apartment to record the screwed-up lives of the women who visit him."
      ],
      "budget": 0
   },
   "movielensId": 3542,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1969-10-26",
      "dvdReleaseDate": "2000-04-04",
      "directors": ["Milton Moses Ginsberg"],
      "runtime": 110,
      "movieId": 3542,
      "title": "Coming Apart",
      "mpaa": "",
      "actors": [
         "Rip Torn",
         "Sally Kirkland",
         "Phoebe Dorin",
         "Julie Garfield",
         "Lois Markle",
         "Nancy MacKay",
         "Michael McGuire",
         "Kevin O'Connor",
         "Jane Marla Robbins",
         "Viveca Lindfors"
      ],
      "imdbMovieId": "0064180",
      "originalTitle": "Coming Apart",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["C4bcAivtANE"],
      "plotSummary": "A psychiatrist secretly films his female patients as an experiment; he pushes both him and his customers in ways that induce his own mental breakdown.",
      "tmdbMovieId": 71402,
      "avgRating": 2.5,
      "releaseYear": "1969",
      "numRatings": 18,
      "posterPath": "/zIGEUUgtH8vvVLFylsVrQEcuPBc.jpg"
   }
}