{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "clown",
            "id": 3199
         },
         {
            "name": "liquor",
            "id": 3423
         },
         {
            "name": "birthday party",
            "id": 5732
         },
         {
            "name": "alcoholism",
            "id": 7464
         },
         {
            "name": "dark comedy",
            "id": 10123
         },
         {
            "name": "cult classic",
            "id": 165580
         },
         {
            "name": "mimes",
            "id": 192528
         },
         {
            "name": "barflies",
            "id": 192530
         }
      ],
      "imdb_id": "tt0102898",
      "video": false,
      "title": "Shakes the Clown",
      "recommendations": [
         87905,
         48885,
         28733,
         77368,
         39283,
         37536,
         17627,
         57215,
         33988,
         100051,
         30120,
         139058,
         44562,
         30637,
         32274,
         27295,
         20794,
         3481,
         36616,
         45186
      ],
      "backdrop_path": "/9IXQdCM2mPTop3VgqAqcCljwDcP.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Shakes The Clown",
               "gender": 2,
               "credit_id": "52fe44f8c3a368484e0415f7",
               "name": "Bobcat Goldthwait",
               "profile_path": "/wYwGbSqEGAqpT4or8YHQ79ycoz4.jpg",
               "id": 95024,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Judy",
               "gender": 1,
               "credit_id": "52fe44f9c3a368484e0415fb",
               "name": "Julie Brown",
               "profile_path": "/8a1NwjIyjOWmYTqdj4fuxqKlzR5.jpg",
               "id": 40680,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Mime Class Instructor",
               "gender": 2,
               "credit_id": "52fe44f9c3a368484e0415ff",
               "name": "Robin Williams",
               "profile_path": "/5KebSMXT8uj2D0gkaMFJ8VEp53.jpg",
               "id": 2157,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Lucy",
               "gender": 1,
               "credit_id": "52fe44f9c3a368484e041603",
               "name": "Kathy Griffin",
               "profile_path": "/psg895Ye46vGenRdX0EXvGOm92p.jpg",
               "id": 3138,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "The Unknown Woman",
               "gender": 1,
               "credit_id": "52fe44f9c3a368484e041611",
               "name": "Florence Henderson",
               "profile_path": "/2AimWtyfctoWofwn71BnvG44oan.jpg",
               "id": 75343,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Female Clown Barfly",
               "gender": 0,
               "credit_id": "52fe44f9c3a368484e041615",
               "name": "LaWanda Page",
               "profile_path": "/wj28QBIORdKD4h2Ho7d75Y64zOT.jpg",
               "id": 1187321,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Ty the Rodeo Clown",
               "gender": 2,
               "credit_id": "52fe44f9c3a368484e041619",
               "name": "Bruce Baum",
               "profile_path": null,
               "id": 152344,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Beaten Mime in Park",
               "gender": 2,
               "credit_id": "52fe44f9c3a368484e04161d",
               "name": "Steve Bean",
               "profile_path": null,
               "id": 154943,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Owen Cheese",
               "gender": 2,
               "credit_id": "52fe44f9c3a368484e041621",
               "name": "Paul Dooley",
               "profile_path": "/rnzvqo7oR2IwSfN2Ayh3ysc4WNt.jpg",
               "id": 15900,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Producer",
               "gender": 1,
               "credit_id": "52fe44f9c3a368484e041625",
               "name": "Melissa Hurley",
               "profile_path": null,
               "id": 951498,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Billy",
               "gender": 2,
               "credit_id": "52fe44f9c3a368484e041629",
               "name": "Paige Gosney",
               "profile_path": null,
               "id": 555638,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Enthusiastic Mime",
               "gender": 1,
               "credit_id": "551066fa92514107010059da",
               "name": "Eliza Coyle",
               "profile_path": null,
               "id": 122802,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Dink the Clown",
               "gender": 2,
               "credit_id": "59e392fa9251410b6700033c",
               "name": "Adam Sandler",
               "profile_path": "/tv9V6QsuZ3bcp4ciUJjwjcc4qAg.jpg",
               "id": 19292,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44f9c3a368484e041609",
               "name": "Bobcat Goldthwait",
               "profile_path": "/wYwGbSqEGAqpT4or8YHQ79ycoz4.jpg",
               "id": 95024,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "588a9c389251411bbe02134b",
               "name": "Bobby Bukowski",
               "profile_path": null,
               "id": 1209263,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "588a9c5992514156a600da96",
               "name": "Elliot Davis",
               "profile_path": null,
               "id": 5506,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "588a9d84925141533b00e8cb",
               "name": "J. Kathleen Gibson",
               "profile_path": null,
               "id": 1483898,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 3.116952,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 26291,
      "vote_count": 30,
      "budget": 1400000,
      "overview": "Shakes plods about his duties as party clown, and uses all of his free time getting seriously drunk. Binky, another clown, wins the spot on a local kiddie show, which depresses Shakes even more, and his boss threatens him with unemployment if he can't get his act under control.",
      "similar": [
         290250,
         1023,
         57157,
         11974,
         25196,
         5683,
         28580,
         8141,
         56812,
         10872,
         22797,
         94352,
         10475,
         30545,
         84422,
         332562,
         18279,
         489412,
         34505,
         43817
      ],
      "original_title": "Shakes the Clown",
      "runtime": 87,
      "poster_path": "/nfTWQ7GfH462FVmYEGQB1oHR6H4.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "IRS Media",
         "id": 1930,
         "origin_country": ""
      }],
      "release_date": "1991-03-13",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "Loved by children. Desired by women. Adored by bartenders everywhere.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Bobcat Goldthwait"],
      "runtime": 87,
      "synopsis": null,
      "writers": ["Bobcat Goldthwait"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0102898/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkyMzkzMDYxNF5BMl5BanBnXkFtZTcwNjExNzMyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Bobcat Goldthwait, Julie Brown, Bruce Baum | See full cast and crew »"],
      "reviews": [
         "I've tried to get my friends to watch this movie with me, but they just can't get over the fact that there are CLOWNS everywhere! GROW UP! \"Shakes the Clown\" is a truly love-it-or-hate-it movie, with each side taking their stand solidly. Put me in the love column. The fact that everything is played dead serious despite the fact that they're clowns is what keeps this movie from just being stupid. Tom Kenny is PERFECTLY cast as Binky, the best comic villain I have ever seen. Most comic villains are either so bad they're cool, or so bad you can't bear to watch them. Mr. Kenny achieves a perfect balance of being totally unappealing, yet you want to keep watching to see him get it in the end. The best villains feel their actions are completely justified, and Binky is no different. His actions are completely self-preserving and in his mind justifiable. Shouts should also be given out to Adam Sandler and Julie Brown. While Adam often resorts to the easy laugh in his starring vehicles, he's perfect as the insecure clown with no confidence with his ability with the opposite sex. You can easily see why P.T. Anderson chose him to star in \"Punch Drunk Love\". People have a tendency to hate Julie Brown, and I can understand why, but I've always been a fan of hers. Her role as the put-upon barmaid/girlfriend of Shakes would have been annoying in any other movie, but given the circumstances involved, I find her absolutely adorable. The characters of HoHo, Boots, Stenchy, Owen Cheese, the two cops, the rodeo clowns, etc. are all perfectly cast. Especially memorable is the late Sydney Lassick as Peppy, the forcibly retired host of the TV show that Binky takes over. It's a crying shame that more people don't like this movie, as it would have given Bobcat more opportunities to do films HIS way. Why didn't this film make EW's top 50 cult movies? Until people get over their phobia of clowns, this flick is never going to get the respect it truly deserves, and that is a crying shame. 10/10",
         "This movie won't win any technical awards, but if you like dark comedies (this film makes \"Barton Fink\" look light and breezy at times), this is the movie for you. At times uproariously funny, the poignant parts are luckily kept to a minimum, and there are gritty moments as well. Whether you're a rodeo clown, party clown, or even a lowly mime, this is a movie chock full of lines you'll find yourself repeating in all the most inappropriate occasions. Besides--didn't you kind of suspect that all clowns were miserable deep down, and drunk constantly? Just beware--this is not a kids' film by any stretch of the imagination, and some of the scenes of Shakes dealing with his alcoholism are stomach-churning, but it provides the backdrop for some serious comedic writing unmatched by virtually every other film out there.",
         "This rare gem is an example of a funny, funny man (Bobcat Goldthwait) given free reign over the creation of a comedy gem. Though this film may not exemplify any of the tired old Hollywood \"formulas\" for what makes a profitable comedy, it nonetheless succeeds wonderfully. Shakes The Clown is quirky, kinky, edgy and hilarious. It features great comic performances by many such under rated comic talents as Bruce Baum and Tom Kenny. Conversely, in the tradition of the inspired casting of Leslie Neilsen in Airplane, Goldthwait places in hilariously improbable comic situations traditional \"straight\" actors, such as Florence Henderson in the role of a Clown-dating bar floozy. I won't say that this film exemplifies a category, because I feel that it defines one. A true original, one of a kind, Shakes The Clown should not be missed.",
         "The movie poster when I saw \"Shakes\" in the theatre touted it as the \"Citizen Kane of Alcoholic Clown Movies,\" clearly a better analogy than the \"Gone with the Wind\" one touted here. This is one strange fantasy where clowns hang out in their own bars watching clown shows on TV while tossing back shots. The bars are segregated by clown type, with bars for rodeo clowns and bars for party clowns with no mixing tolerated. Robin Williams' bit part as a mime instructor is some of his best work every, enhanced (as all Robins work should be) by it's brevity. Great work, Bobcat! (The kids in the sprinkler scene is great, a lovingly filmed, uncharacteristicly joyful moment in this very, very dark comedy.) Rumor has it that clown groups picketed theatres when this movie was released, claiming that it was defamatory to clowns.",
         "A reviewer at the Boston Globe once called this, \"The Citizen Kane of alcoholic clown movies.\" Given the number of points of comparison, who could argue? I was reminded of this when I recently saw the 2003 movie, \"Bad Santa\" -- which was a similar one-joke, cynical comedy about an obnoxious alcoholic employed as a character meant to bring joy into the lives of children. (The name \"Shakes\" takes on a whole new meaning when the lead character attempts to detox.) If that one joke works, so goes the movie. So for comparison, I recently rented it not long after seeing \"Bad Santa.\" While Bad Santa received a great number of favorable critical reviews, this movie wasn't as fortunate. Upon further review, I have to say that this movie never got the credit it deserved. Is it a great movie? Oh no. This is a movie that attempts to be so bad and foul, rolling in its own filth, that best targets people with the right, low-expectation mindset. But you could also say that of \"There's Something About Mary.\" It employs humor in some of the background scenes a la \"Airplane.\" Its use of cheesy 70s actors is pure genius and helps complete the joke. (Nevermind Robin Williams, an early Adam Sandler, and the then-future voice of Sponge Bob Squarepants as the evil Binky the Clown.) If you can manage a smirk during John Waters' \"Mondo Trasho,\" you'll likely find the movie to be quite funny overall. It's Bobcat's opus, and its no wonder he never really made much of anything since; the same was true for Orson Wells after \"Citizen Kane\"...",
         "Henry Rollins broke humanity down, once, into \"People who get Devo, and people who don't.\" You can do the same for this movie... there are people who get it, and people who don't, and you will never, ever convince someone that doesn't get this film that it's enjoyable. Just give up. If they can't see the humor in \"Oh great, now I have to kill you too. Another red letter day for Binky...\"",
         "Very entertaining film pits rival bands of clowns (Rodeo, party, and mime clowns) against each other in a weird alternate world dominated by archetypes of 1950s entertainment (much like Tim Burton's equally entertaining \"Pee Wee's Big Adventure\"). Goldthwait acts up a storm as the clinically alcoholic title character. The photography is as dark as the film's viewpoint -- this one is a keeper! Shakes is truly sympathetic because he never solicits pity or tries to be cute (like Sandler would have if it was his film). Here honesty pays off, because we'd really like to see Shakes hook up with his dream girl (Brown) by the end. Nice character acting all around, especially the clowns in the bar and the 2 cops. Memorable and highly recommended.",
         "the darkly humorous story of an alcholic party clown who is framed by coke-dealing rodeo clowns and must overcome his condescending feelings towards mimes when he must take refuge in one of their studios. black comedy painted in neon colors with funny clown shoes for that disturbing effect. an issue as serious as alcoholism shouldn't b taken lightly, but the darkness within the \"twisted balloon\" bar is could be any hole in the wall drink joint over-run with industry regulars. its just this industry is full party clowns who pick on the artistic mimes and cower in fear of rodeo clowns. binky is one of the most creepy & festive characters in recent years. his rationalizations of his behavior are text book. \"u all loathe me... think my balloon animals suck\". it seems strangely appropriate that the rodeo clowns are selling coke binky and his yes men. this movie is full of incredible lines & visual humor (check out the office in the background when shakes is getting picked up at the police station during the conversation with the cops).",
         "This is one of my all-time favorite movies. As shallow as it appears on the surface, this film delivers with some subtle laughs. As far as casting goes, this is the only movie in which I liked Chris Elliot. The character of Binky cracks me up every time I watch the film. His absolute self absorption and megalomania lead to some very \"quoteable\" lines and terrific cinematic moments. Also, the fact that Robin Williams' name doesn't appear in the credits makes me smile. In the credits, Mime Jerry is played by \"Marty Fromage\" making me wonder if, at seeing the final product, he refused to have his name attached to it. Or, if Mr. Williams is willing to play jokes with his very name when he doesn't have a great stake in the success of a film. I consider this film a masterpiece of dark comedy, and it has made me eternally loyal to Bobcat Goldthwait. I only hope he runs for President someday.",
         "I was amazed to see this movie getting ranked just above a five. There's never been a movie like it. It manages to be funny and confront alcoholism at the same time, something you won't see in say, 28 Days. Instead of trying to be serious, this movie is surreal, and in being surreal, it manages to give you an accurate portrayal of the disease of addiction, and also a very funny movie about clowns who drink, fight, and wear their clown suits all the time."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": ["IRS Media"],
      "summaries": ["Shakes plods about his duties as party clown, and uses all of his free time getting seriously drunk. Binky, another clown, wins the spot on a local kiddie show, which depresses Shakes even more, and his boss threatens him with unemployment if he can't get his act under control. When someone murders Shakes' boss and makes it look like Shakes did it, he goes undercover, posing as a hated mime, and tries to find information that will clear his name."],
      "budget": 1400000
   },
   "movielensId": 3544,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1991-03-13",
      "dvdReleaseDate": "2000-04-04",
      "directors": ["Bobcat Goldthwait"],
      "runtime": 87,
      "movieId": 3544,
      "title": "Shakes the Clown",
      "mpaa": "R",
      "actors": [
         "Bobcat Goldthwait",
         "Julie Brown",
         "Robin Williams",
         "Kathy Griffin",
         "Florence Henderson",
         "LaWanda Page",
         "Bruce Baum",
         "Steve Bean",
         "Paul Dooley",
         "Melissa Hurley",
         "Paige Gosney",
         "Eliza Coyle",
         "Adam Sandler"
      ],
      "imdbMovieId": "0102898",
      "originalTitle": "Shakes the Clown",
      "genres": [
         "Action",
         "Comedy"
      ],
      "youtubeTrailerIds": ["V7KOt3Hugd4"],
      "plotSummary": "Shakes plods about his duties as party clown, and uses all of his free time getting seriously drunk. Binky, another clown, wins the spot on a local kiddie show, which depresses Shakes even more, and his boss threatens him with unemployment if he can't get his act under control.",
      "tmdbMovieId": 26291,
      "avgRating": 2.81953,
      "releaseYear": "1991",
      "numRatings": 471,
      "posterPath": "/nfTWQ7GfH462FVmYEGQB1oHR6H4.jpg"
   }
}