{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "diamond",
            "id": 1384
         },
         {
            "name": "nazi",
            "id": 2652
         },
         {
            "name": "government",
            "id": 6086
         },
         {
            "name": "war",
            "id": 6091
         },
         {
            "name": "history",
            "id": 9682
         },
         {
            "name": "conspiracy",
            "id": 10410
         },
         {
            "name": "student",
            "id": 12105
         },
         {
            "name": "theft",
            "id": 14604
         },
         {
            "name": "criminal",
            "id": 15009
         },
         {
            "name": "agent",
            "id": 33705
         },
         {
            "name": "rogue",
            "id": 186447
         },
         {
            "name": "international",
            "id": 201272
         }
      ],
      "imdb_id": "tt0074860",
      "video": false,
      "title": "Marathon Man",
      "recommendations": [
         1051,
         994,
         891,
         11040,
         592,
         3116,
         11963,
         4909,
         988,
         12143,
         26617,
         10633,
         983,
         9576,
         11368,
         993,
         11386,
         576,
         9040,
         5924
      ],
      "backdrop_path": "/d90eG6WVgIIncfykkHPktX2Bi2M.jpg",
      "revenue": 21709020,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Thomas Babington ‚Babe‘ Levy",
               "gender": 2,
               "credit_id": "52fe437f9251416c75012a15",
               "name": "Dustin Hoffman",
               "profile_path": "/3pZx8NB30KIw31rBAT62TUDQFEb.jpg",
               "id": 4483,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Christian Szell",
               "gender": 2,
               "credit_id": "52fe437f9251416c75012a19",
               "name": "Laurence Olivier",
               "profile_path": "/n8jDSq91O95HSbtCJLRsM367kKx.jpg",
               "id": 3359,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Henry David ‚Doc‘ Levy",
               "gender": 2,
               "credit_id": "52fe437f9251416c75012a1d",
               "name": "Roy Scheider",
               "profile_path": "/gx1jsvIL2OCzG6TOnl7ErgD28ZU.jpg",
               "id": 6355,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Janeway",
               "gender": 2,
               "credit_id": "52fe437f9251416c75012a21",
               "name": "William Devane",
               "profile_path": "/SYI4fML7EmZDghuieWf6SpiyRF.jpg",
               "id": 21416,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Elsa",
               "gender": 1,
               "credit_id": "52fe437f9251416c75012a2b",
               "name": "Marthe Keller",
               "profile_path": "/vJS0w1lz2YKyfyKd7Iz925bt5WB.jpg",
               "id": 25282,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Prof. Biesenthal",
               "gender": 2,
               "credit_id": "52fe437f9251416c75012a2f",
               "name": "Fritz Weaver",
               "profile_path": "/bUEX09s2t9vMN3Z5IHchpfxpijU.jpg",
               "id": 6839,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Karl",
               "gender": 2,
               "credit_id": "52fe437f9251416c75012a33",
               "name": "Richard Bright",
               "profile_path": "/k2P17sxGhh7Dafidxn9Ub5YbF7n.jpg",
               "id": 3174,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Erhard",
               "gender": 2,
               "credit_id": "52fe437f9251416c75012a37",
               "name": "Marc Lawrence",
               "profile_path": "/hCQP4Ym8u94WdcMsJ6QXvaEd8qX.jpg",
               "id": 3140,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Babe's Father",
               "gender": 2,
               "credit_id": "52fe437f9251416c75012a3b",
               "name": "Allen Joseph",
               "profile_path": null,
               "id": 14795,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Melendez",
               "gender": 2,
               "credit_id": "52fe437f9251416c75012a3f",
               "name": "Tito Goya",
               "profile_path": null,
               "id": 90441,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Szell's Brother",
               "gender": 2,
               "credit_id": "52fe437f9251416c75012a43",
               "name": "Ben Dova",
               "profile_path": null,
               "id": 935831,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Rosenbaum",
               "gender": 2,
               "credit_id": "52fe437f9251416c75012a47",
               "name": "Lou Gilbert",
               "profile_path": "/9X1U0QjuZxUK4n2a2JbGQN9ZqRs.jpg",
               "id": 19215,
               "order": 11
            },
            {
               "cast_id": 23,
               "character": "Bystander",
               "gender": 1,
               "credit_id": "533673cdc3a3680e87000aac",
               "name": "Estelle Omens",
               "profile_path": null,
               "id": 14551,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe437f9251416c750129f9",
               "name": "John Schlesinger",
               "profile_path": "/vFCJ4RxvHysxeiwcFsiSGg7Tgre.jpg",
               "id": 19304,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe437f9251416c750129ff",
               "name": "Sidney Beckerman",
               "profile_path": null,
               "id": 19423,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe437f9251416c75012a05",
               "name": "Michael Small",
               "profile_path": null,
               "id": 6357,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe437f9251416c75012a0b",
               "name": "Conrad L. Hall",
               "profile_path": "/fGWnmu9EAYqX974sP0ddkOjgVEy.jpg",
               "id": 8217,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe437f9251416c75012a11",
               "name": "Jim Clark",
               "profile_path": "/zT60qm2WTMUzPU0qhsGhUfgguUs.jpg",
               "id": 8970,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe437f9251416c75012a27",
               "name": "Robert Evans",
               "profile_path": "/pSzHgQKT3qnCuAFyh3IpilopKt0.jpg",
               "id": 12288,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe437f9251416c75012a4d",
               "name": "William Goldman",
               "profile_path": "/7eBlS4cj4WAGzI38ef3EXAIKmOg.jpg",
               "id": 348,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe437f9251416c75012a53",
               "name": "William Goldman",
               "profile_path": "/7eBlS4cj4WAGzI38ef3EXAIKmOg.jpg",
               "id": 348,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Thriller",
         "id": 53
      }],
      "popularity": 8.888089,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10518,
      "vote_count": 285,
      "budget": 6500000,
      "overview": "A graduate student and obsessive runner in New York is drawn into a mysterious plot involving his brother, a member of the secretive Division.",
      "similar": [
         2503,
         9331,
         81774,
         1369,
         5925,
         591,
         13448,
         629,
         65754,
         395990,
         225574,
         339259,
         8834,
         369885,
         300671,
         27066,
         4771,
         424,
         600,
         122
      ],
      "original_title": "Marathon Man",
      "runtime": 125,
      "poster_path": "/wu1T58QID2uxPspf0Jxm2FNgsb9.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         },
         {
            "name": "",
            "iso_639_1": "yi"
         }
      ],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1976-10-06",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "One man's dangerous attempts to clear his father's name.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Schlesinger"],
      "runtime": 125,
      "synopsis": "Thomas Levy (Dustin Hoffman), nicknamed \"Babe\" in the film, is a history Ph.D. candidate researching the same field as his father, who committed suicide after being investigated during the Joseph McCarthy era. Babe is also an avid runner, which lends the film its title. Babe's brother, Henry (Roy Scheider), better known as \"Doc\", poses as an oil company executive but in fact is a U.S. government agent working for a secret agency headed up by Director Peter Janeway (William Devane). Babe is not aware of his brother's true occupation. Doc is often supposedly out of the country on business for extended periods of time but comes to New York under the guise of a visit to Babe. The brother of a Nazi war criminal possesses a safety deposit box key, but is killed in a traffic accident (after a road rage altercation with a short tempered middle-aged Jewish American motorist). Doc suspects that the criminal, Dr. Christian Szell (Laurence Olivier) will be arriving to retrieve an extremely valuable diamond collection. Babe enters into a relationship with a young woman named Elsa Opel, who claims to be from Switzerland. One night while out on a date Elsa and Babe are mugged in a park by two men dressed in suits. Some time later, Doc takes the couple to lunch, where he tricks Elsa into revealing that she has been lying to Babe about her background. Though Doc suspects she may have some connection to Szell, he tells Babe only that she is simply seeking an American husband so that she can become a U.S. citizen. After Szell arrives in America, Doc meets him to tell the former Nazi he is not welcome in the country. Szell casually accepts the pronouncement, but then swiftly knifes Doc, wounding him severely. Doc is able to make it back to his brother's apartment, but collapses and dies in Babe's arms without telling him anything. The police interrogate Babe for hours, until government agents led by Peter Janeway arrive. Janeway asks Babe what Doc told him before he died, and informs Babe of his brother's career as a U.S. government agent. Babe insists that his brother did not tell him anything, but Janeway feels that Doc struggled all the way to Babe's apartment to give him vital information of some kind. Babe is later abducted from his apartment by Szell's subordinates, Karl and Erhardt (the two men from the park). In an infamous sequence, Babe is tortured by Szell, a skilled dentist, who repeatedly asks \"Is it safe?\" Confused by the questiona code phrase he does not understandBabe denies any knowledge, but is tortured. The dentist offers him oil of cloves, an anesthetic, as positive inducement to cooperate. Eventually, Babe loses consciousness and Szell pauses his torture. Babe is then rescued by Janeway, who apparently kills Szell's bodyguards and takes Babe from Szell's hideout. As he drives, Janeway explains that Szell is in America to sell off his large cache of diamonds, which he had taken from Jews he had exterminated at Auschwitz during World War II. Janeway continually presses Babe about Doc's dying words, but Babe again insists he knows nothing. Frustrated, Janeway reveals himself as a double agent working with the Nazi criminal all along, and he turns Babe over to Karl and Erhardt (Janeway had only faked killing them). Szell, it turns out, is one of Janeway's highest level informants, and had informed on other Nazi war criminals in return for immunity. Delivered back into Szell's hands, the Nazi has a curiously kindly conversation with Babe before calmly explaining why he is holding Babe for questioning. Szell suspected that Doc would attempt to rob him of his diamonds, or rat on him to authorities; thus his desire to know if it's \"safe\" to withdraw the diamonds, i.e., whether Doc told Babe any incriminating information. Still unable to extract anything from Babe, he proceeds to drill into one of Babe's healthy teeth. Babe eventually escapes again, this time on his own, with Janeway and Szell's two henchmen giving chase in a car. Though exhausted and barefoot, he is able to outrun his pursuers in part by remembering famed \"marathon man\" Abebe Bikila, who ran barefoot. After inviting a neighborhood acquaintance and his toughs to break into his apartment and steal his pistol (the same pistol his father used to commit suicide), Babe phones Elsa, who agrees to meet him with a car. She drives him to a country home as a hideout. Babe guesses that she has set him up; she confesses that Szell's dead brother owned the home, and that she set up Babe. Janeway and Szell's men arrive, but Babe avoids an ambush by taking Elsa hostage. In another twist, Janeway kills Szell's men and offers to let Babe kill Szell in revenge for Doc's death if Janeway can have the diamonds. Babe agrees, but as he leaves to find Szell, Janeway attempts to shoot Babe, but kills Elsa instead when she tries to alert Babe. Angered, Babe guns down Janeway. Back in New York, Szell attempts to determine the value of his diamonds. However, he chooses an appraiser in the Diamond District in midtown Manhattan, where many of the shop owners are Jewish. A shop assistant who is also an Auschwitz survivor believes he has recognized Szell as a wanted Nazi criminal. After Szell hurriedly leaves the shop, an elderly Jewish woman also recognizes him, but passersby think she is senile. Trying to cross the street to get closer to Szell in order to expose him she is hit by a taxi, causing a crowd to assemble to aid her. Amidst the confusion, the shop assistant appears again, directly confronting Szell. Becoming increasingly paranoid, Szell slits the man's throat with a retractable blade concealed in his sleeve. Szell retrieves his diamonds from the bank, but is taken hostage by Babe as he attempts to leave, who inconspicuously forces him into Central Park and into one of the pump rooms at the south end of the Reservoir. Babe holds Szell at gunpoint on a scaffold and seizes the diamonds; rather than kill Szell, Babe informs him that he will allow Szell to live and keep as many diamonds as he can swallow. Szell initially refuses, prompting Babe to begin throwing the diamonds into the water below them. Szell relents and swallows one diamond, but then refuses to cooperate further. Szell goes on to insult Babe, and after he spits in Babe's face a fight erupts in which Szell tries to stab Babe. Babe throws the remainder of the diamonds down the scaffold steps towards the water; Szell dives for them, but stumbles, and fatally falls on his own knife blade. Picking up his gun, Babe exits the pump room and heads out into Central Park. Stopping by the Reservoir, he throws the gun into the water.",
      "writers": [
         "William Goldman",
         "William Goldman"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0074860/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY5NTA4NjEzMV5BMl5BanBnXkFtZTcwNDIwOTM4OA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Dustin Hoffman, Laurence Olivier, Roy Scheider | See full cast and crew »"],
      "reviews": [
         "Schlesinger made a great action-suspense film and married it to the artistry of unique talents\u0085 Hoffman was, by then, a dynamic, young and incredibly versatile film actor with three Academy Award nominations already under his belt for \"The Graduate,\" \"Midnight Cowboy,\" and \"Lenny.\" But the key to \"Marathon Man\" was the chemistry between its stars\u0085 Perhaps one of the most gut-wrenching and most memorable scenes in the film comes when Hoffman is captured and tortured by Olivier who plays the role of a mean and vicious and sadistic Nazi war criminal, Christian Szell\u0085 Olivier's performance resulted in a 1976 Academy Award nomination as Best Supporting Actor\u0085 In 1945, Szell ran the experimental camp at Auschwitz where they called him the White Angel\u0085 He was a dentist and could provide escape for any Jew who was willing to pay the price\u0085 He started out with gold, naturally, but very quickly worked his way up to diamonds\u0085 As Szell saw the end early, he sneaked his brother into America with the diamonds\u0085 And they were right here, in New York, in a safe deposit-box until Szell's brother got killed in a head-on collision with an oil truck\u0085 Uniquely built, and with a marvelous, rugged face, Roy Scheider, well known for his strong performances in \"The French Connection,\" \"Klute,\" and \"Jaws,\" came on board as Hoffman's mysterious businessman brother, getting the rare chance to play a character that's both hero and villain\u0085 Doc is a fascinating guy because he chooses to work out his problems in a much different way than Dustin's character does\u0085 He was very touched and very moved by his father's death, but he abandoned all his hopes for whatever he intended to do and he became a spy, a killer, a very jaded personality\u0085 In doing something truly suspenseful, Schlesinger accomplished a film that's largely about fear and it's about pain and the infliction of pain because of fear\u0085 The thrilling sensation of great expectations came on the 47th Street in the diamond district in New York, where Schlesinger gets the best of it\u0085",
         "Marathon Man starts off rather slowly, and for the first hour at least, it feels as if you're watching a human drama rather than a thriller. However, unlike a lot of thrillers; Marathon Man uses this time to create characters and establish the situation, which ultimately pays off later on in the film when the movie really gets going. When the film does step on the gas, it is as thrilling as any thriller you will ever see; Dustin Hoffman is subjected to all sorts of things, most notably an excruciating torture sequence. This scene is powerful and painful on it's own, but it is made more so by the fact that we have already gotten to know the character and therefore we feel sympathy for him, as well as cringing at the images we see on screen. That scene alone is enough to propel the movie in the realms of greatness, as it is simply one of the most powerful that cinema has ever given us; but this movie is a hell of a lot more than just a torture sequence. The plot revolves around a car crash that takes place in downtown New York. One of the men in this crash is the brother of the infamous Nazi war criminal, Szell, who has some diamonds hidden in a safety deposit box. From then on, many members of a US defence organisation, known as \"The Division\", begin turning up dead and soon after, Thomas Levy, a college student, obsessive runner and the brother of one of The Division's members, becomes embroiled in the plot. It is easy to see the parallels between the plot movie and World War 2, from the withered ex-Nazi (indicative of the state of the actual regime), to his enemies being American; the movie has world war 2 written all over it. The film is excellently directed throughout by John Schlesinger. Schlesinger, probably best known for \"Midnight Cowboy\" does a fantastic job of keeping the audience on the edge of their seat for the duration of the movie. A constant foreboding feel is created, and you're never truly sure of what will happen. This is exactly what you want in a thriller, as nobody likes it when they can predict what will happen next. Dustin Hoffman takes the lead role of Thomas Levy. Dustin Hoffman is a fantastic actor, and he certainly gets to flex his acting muscles here, in a film which sees him go through all manner of unpleasant scenes and also hold up lots of relationships with various characters, as well as drawing sympathy from the audience to accent his situation. Roy Scheider (of Jaws fame) stars opposite Dustin Hoffman in the movie. Scheider doesn't get a great deal of screentime in the film, but he still manages to do good things with the time he does have. The third lead role, that of the Nazi war criminal, is taken by Lawrence Olivier, who is also a fantastic actor and gives a great performance in this film. He gives his character just the right atmosphere, and we can tell just by looking at the man that he is cold and uncaring, and also past it; which is the crux of his character. The film ends with a spectacular sequence, which sees the movie and the two centrals characters come to a satisfying conclusion. The characters are the central theme in this movie, and had the movie have ended differently it could have unravelled everything that it had created, but the movie's end is absolutely perfect and does the entire movie justice. A brilliant piece of cinema.",
         "Quite apart from the infamous torture scene, which I found extremely difficult to watch without howling in horror (actually that's a lie, I DID howl) this film is FULL of nervous tension that occasionally boils over - the way it's been done is masterful. The bouncing-ball scene in the darkened building should be utterly prosaic, but it really isn't - the way it's choreographed and shot brings such an air of menace and trepidation you'll be biting your nails off. There's much of a similar vein in 'Marathon Man', and although the storyline is sometimes almost buried through the relentless suffocating tension, it's extremely watchable (with a cushion to hide behind at certain points) and one of the greatest non-Hitchcock thrillers I've ever seen. Don't hesitate!",
         "I have always found this to be a very entertaining, involving, taut suspense movie with some very dramatic scenes. I've seen in three times and liked it better each time, particularly since it's been available on DVD which enhanced the sound from mono to stereo, and the 1.85:1 widescreen enhancing the cinematography. I didn't find the infamous (this was quite a buzz when the film came out) dentist scene to be as terrifying as it was made up to be and the references to the McCarthy hearings are a bit annoying and typical of Hollywood director John Scheslinger. It's also a typical modern-day film in which the U.S government's police agencies are corrupt (oh, puhleeze, filmmakers - think of something new). However, despite those negatives, the film is fascinating with no dry spots despite its two-hour length. There is a nice variety of action scenes and very interesting characters. Marthe Keller never looked better. Too bad she didn't make more movies in the U.S. Dustin Hoffman, as he did so well in the '70s, keeps your attention and Laurence Olivier is absolutely riveting. This is a terrific thriller, start to finish.",
         "Suspense filled, is the only adequate description I can think of. The direction is bleak and taut, the movie's music theme is like a growing menace and the acting of the leads is peerless. The film's most famous scene, the dentist chair interrogation has become part of pop culture, and deservedly so. This, along with many other scenes, including the enemies breaking into the bathroom, are a masterful example of how to create almost unbearable tension on film.",
         "I first saw MARATHON MAN in its initial theatrical release when I was 13 years old, and the years haven't diminished its power for me. Sure, the plot gets a little more convoluted than it absolutely has to be, but in a way it's because William Goldman's screen adaptation of his brilliant novel takes into account the all-too-human character flaws of his heroes and villains, and the mistakes people make when they're fearful and paranoid. While the performances are uniformly fine (with Roy Scheider deserving a place in The Suave Hall of Fame for his portrayal of Doc Levy, a.k.a. government agent \"Scylla.\" If he hadn't been so charismatic and engaging, his murder in mid-film wouldn't have such impact, and the movie would suffer for it), I think the special secret ingredient that gives MARATHON MAN its punch is the atmosphere. The naturalistic, sometimes washed-out color palette almost lends the film a black-and-white film noir look. Almost every person in the film is angry, cynical, emotionally wounded, and/or generally negative in some way. And what really struck me was that on screen, it seems like chaos and disaster are exploding all over the world. Look at the riots and bombings taking place in France in early scenes with Doc and Janeway (nicely subtle homosexual subtext there, by the way). Also, if you listen carefully to newscasts in the background, you'll notice there's nothing but bad news: murders, suicides, all kinds of violence all over (including the \"chicken\" game between the old Jew and Szell's brother as the film begins). MARATHON MAN isn't a happy film -- even when our hero wins, he's already lost so much his victory seems hollow indeed -- but it never fails to grab and haunt me each time I watch it. If you love the film, you'll want to own the DVD not only for the superb letterboxed print, but also for the terrific extras, including both new and vintage making-of documentaries with Hoffman, Scheider, Keller, Goldman, producer Robert Evans and other major MM players, as well as rare rehearsal footage and the original theatrical trailer.",
         "1970s movies are so cynical, aren't they? Dark, depressing, and often grainy-looking and washed out. \"Marathon Man\" fits that description. It's good, of course - very good - but it's not exactly a good time. Know what I mean? William Goldman, one of Hollywood's few celebrity screenwriters, wrote both the original novel and the script for this film version. I find him a bit overrated, but here he does a good job of elevating hack-level thriller material into a sort of art form. The beginning of the film is particularly well-written and intriguing, since it's full of creepy and cryptic events that are not immediately explained. But, alas, I find the ultimate explanation of these events to be rather prosaic and disappointing. So, I think the movie's strengths lie in the acting and directing, more so than the story. Olivier and Scheider give particularly great performances, and Marthe Keller comes across as appropriately sweet and sexy (her big \"secret,\" though, should be really easy for anyone to guess!) I'm a little less enamored of Dustin Hoffman, whose character is inexplicably nicknamed \"Babe.\" He's just way too old to be a typical graduate student (almost forty years old, to be precise), and he simply doesn't have much charisma to me. Usually I like normal-looking, non-glamorous actors, but somehow Hoffman doesn't float my boat. Still, it's hard not to sympathize with the poor guy while he's being pursued, beaten, tortured etc. The \"dental horror\" scene is still quite effective, though it's rather short; I was more impressed by the subsequent chase through the dark streets of NYC. (The city, by the way, looks like a hellish, crime-infested, debris-strewn pit in this movie - like it does in most 1970s productions!) In the end, \"Marathon Man\" isn't quite another \"French Connection,\" but it's got more than enough suspense to crush a lot of the dross that infests theaters today. It's worth watching just for the terrifying scene when the bad guys start tearing Hoffman's door off its hinges - it's good stuff.",
         "Dustin Hoffman looks in great shape playing a Columbia graduate student, still haunted by his father's suicide (and perhaps in training for the New York marathon), who gets mixed up by proxy in his nefarious older brother's activities; seems his sibling has been working secretly as a courier in stolen gems, and has run afoul of Szell, a.k.a. The White Angel, the most notorious Nazi war-criminal still alive. Director John Schlesinger exercises a gleefully nasty side here, staging some dental torture scenes that are just about impossible to watch, yet not all of the pieces in William Goldman's adaptation of his own bestseller fit accordingly; Schlesinger just presses ahead so that the story gaps won't be so noticeable. There's much zig-zagging across the continents at the beginning, with red herrings, street bombs, and character intricacies just swept under the carpet. We learn so little about Hoffman's brother (played by an equally fit Roy Scheider) that, by the film's climax, we still don't know whose side he was he on--or why his cohorts lost trust in him. Marthe Keller's German mystery beauty is another character muddle, a pretense of writer Goldman who was really out to stack this deck against Hoffman's runner. Laurence Olivier's knife-wielding Nazi beast is perplexing as well, alternating a steely coldness with an aged confusion (why, for instance, is he staking out jewelry stores just for today's market values--isn't the diamond trade this man's forte?). The film could have eased up a bit on the torture scenes (which aren't really suspenseful as much as they excruciating) and been a bit more clear-headed about the chess game taking place. It leaves a bushel of questions behind, though it is a handsome piece of work, well-cast and with an intrinsically satisfying finale. *** from ****",
         "John Schlesinger's 1976 classic about a graduate student in New York City who becomes the center of a mean old ex-Nazi war criminal dentist and the government's objective to throw him over. Dustin Hoffman provides us with an excellent performance as the 'Marathon Man'. He was almost forty when he played the role and with his acting skills he makes us believe he is actually a graduate student. Roy Scheider is perfect as Hoffman's crafty and slick older brother who works for the C.I.A. Scheider really does a lot with his role making him perhaps even the coolest character in the movie. Veteran Shakespearan actor Laurence Olivier gives an incredible performance as the evil ex-Nazi that rightfully earned him a Academy Award Nomination for Best Supporting Actor. John Schlesinger provides incendiary direction, and the screenplay is consistently engrossing and full of twists. If you are looking for one hell of a suspense flick with a lot of action you should definitely check out 'Marathon Man' at your local videostore. 'Marathon Man' should have earned Oscar nominations for -- Best Picture, Best Director, Best Actor in a Leading Role - Dustin Hoffman, Best Actor in a Supporting Role - Laurence Olivier, Best Actor in a Supporting Role - Roy Scheider, Best Original Screenplay, Best Cinematography and Best Film Editing. Watch out for the creepy 'dentist' scene. Grade: B+",
         "The high ratings for Marathon Man are no doubt focused on the substantial talent assembled to pull it off, and they succeed as long as one dispenses with every expectation of logic or common sense. Schlesinger builds substantial suspense, and there are plenty of satisfying scenes, but the plotting and story points are ridiculous beyond measure. This might not be a problem if it were any other type of picture, but the progressive unfolding of an initial puzzle to a somewhat sensible (or at least rational) set of revelations is one of the hallmarks of the government intelligence thriller. The story here, however, is so thin that virtually nothing happens for the entire first half of the picture, and the second half is really nothing more than one long chase sequence. The biggest problem is that the central objective of the action is precipitated by a murder that, if contemplated for more than about twenty seconds, reveals itself to make absolutely no sense whatsoever. And the illogical story points are not just structural. There are numerous details throughout that are obviously (and, to my mind, condescendingly) designed as mere conveniences for the the action, regardless of how inane or inexplicable they may be. The veneer of star power and sophisticated production values did not--for this viewer, at any rate--successfully obfuscate the movie's considerable flaws."
      ],
      "genres": [
         "Crime",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": ["Paramount Pictures"],
      "summaries": [
         "In New York City, the brother of an infamous Nazi war criminal is killed in a head-on collision with an oil truck. Shortly thereafter, members of a covert United States government group called the Division begin being murdered one by one. Meanwhile, graduate student and marathon runner Thomas \"Babe\" Levy researches history as his father, who committed suicide after the Communist witch hunts of the McCarthy era ruined his reputation. When he sees his brother, one Division member, stabbed to death, it is revealed that Dr. Christian Szell, the White Angel of Auschwitz, is wrapping up loose ends to smuggle priceless diamonds from the United States.",
         "New York graduate student and obsessive runner Thomas \"Babe\" Levy researches history as his father, who committed suicide after the Communist witch hunts of the McCarthy era ruined his reputation. He is drawn into a mysterious conspiracy involving his globe-trotting brother, his European girlfriend and an infamous Nazi war criminal in hiding. Dr. Christian Szell arrives in New York to retrieve a valuable cache of diamonds stolen during World War II from wealthy Jews seeking to flee Germany. Includes one of the most agonizing torture scenes ever portrayed. \"Is it safe?\" You will never see your dentist the same way again.",
         "New York graduated student and marathon runner Thomas \"Babe\" Levy researches history as his father, who committed suicide after the Communist witch hunts of the McCarthy era ruined his reputation. His brother Henry James \"Doc\" Levy appears out of the blue from time to time because his family never knows where he is, working as a government agent. One of his charges is an infamous Nazi war criminal who he has just told is no longer welcome in the United States. Dr. Christian Szell has a fortune hidden in a safe deposit box and is convinced that Babe knows whether or not it is safe to go to pick it up and will stop at nothing to find out.",
         "A graduate history student is unwittingly caught in the middle of an international conspiracy involving stolen diamonds, an exiled Nazi war criminal, and a rogue government agent."
      ],
      "budget": 0
   },
   "movielensId": 3551,
   "movielens": {
      "languages": [
         "English",
         "Français",
         "Deutsch",
         "Español",
         ""
      ],
      "releaseDate": "1976-10-05",
      "dvdReleaseDate": "2001-08-28",
      "directors": ["John Schlesinger"],
      "runtime": 125,
      "movieId": 3551,
      "title": "Marathon Man",
      "mpaa": "R",
      "actors": [
         "Dustin Hoffman",
         "Laurence Olivier",
         "Roy Scheider",
         "William Devane",
         "Marthe Keller",
         "Fritz Weaver",
         "Richard Bright",
         "Marc Lawrence",
         "Allen Joseph",
         "Tito Goya",
         "Ben Dova",
         "Lou Gilbert",
         "Estelle Omens"
      ],
      "imdbMovieId": "0074860",
      "originalTitle": "Marathon Man",
      "genres": ["Thriller"],
      "youtubeTrailerIds": [
         "8WmlhEO2cU4",
         "oF14PTxKJTc"
      ],
      "plotSummary": "A graduate student and obsessive runner in New York is drawn into a mysterious plot involving his brother, a member of the secretive Division.",
      "tmdbMovieId": 10518,
      "avgRating": 3.85762,
      "releaseYear": "1976",
      "numRatings": 4021,
      "posterPath": "/wu1T58QID2uxPspf0Jxm2FNgsb9.jpg"
   }
}