{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "experiment",
            "id": 1706
         },
         {
            "name": "college",
            "id": 3616
         },
         {
            "name": "suspense",
            "id": 9937
         },
         {
            "name": "gossip",
            "id": 18453
         },
         {
            "name": "rumor",
            "id": 189868
         }
      ],
      "imdb_id": "tt0176783",
      "video": false,
      "title": "Gossip",
      "recommendations": [
         13163,
         1550,
         24567,
         14848,
         15992,
         40562,
         285844,
         12658,
         10342,
         73897,
         9034,
         16071,
         24206,
         10109,
         74718,
         37850,
         32229,
         206,
         32150,
         32162
      ],
      "backdrop_path": "/nk1NsJOggzgKGBH3sw1zDZZ5kzB.jpg",
      "revenue": 5108820,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Beau Edson",
               "gender": 2,
               "credit_id": "52fe475b9251416c7509682b",
               "name": "Joshua Jackson",
               "profile_path": "/e1btrP27otWpSRvgVV9PsOKCpJG.jpg",
               "id": 11866,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Derrick Webb",
               "gender": 2,
               "credit_id": "52fe475b9251416c7509682f",
               "name": "James Marsden",
               "profile_path": "/htBil0Vayd09haeUVoKEPxuantT.jpg",
               "id": 11006,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Naomi Preston",
               "gender": 1,
               "credit_id": "52fe475b9251416c75096833",
               "name": "Kate Hudson",
               "profile_path": "/87SBjReNEW8PFiGbPSTS68H39LT.jpg",
               "id": 11661,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Cathy Jones",
               "gender": 1,
               "credit_id": "52fe475b9251416c75096843",
               "name": "Lena Headey",
               "profile_path": "/wcpy6J7KLzmVt0METboX3CZ0Jp.jpg",
               "id": 17286,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Travis",
               "gender": 2,
               "credit_id": "52fe475b9251416c75096847",
               "name": "Norman Reedus",
               "profile_path": "/dtnLzCWTVOE57ELwDwp4hmIXxrW.jpg",
               "id": 4886,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Professor Goodwin",
               "gender": 2,
               "credit_id": "52fe475b9251416c7509684b",
               "name": "Eric Bogosian",
               "profile_path": "/ez5wbZJ1txZ8EroWSRxElcWlsru.jpg",
               "id": 10866,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Detective Curtis",
               "gender": 2,
               "credit_id": "52fe475b9251416c7509684f",
               "name": "Edward James Olmos",
               "profile_path": "/i7zKqsFqL5L1HPmAMeSA1xZzlD5.jpg",
               "id": 587,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Detective Kelly",
               "gender": 1,
               "credit_id": "52fe475b9251416c75096853",
               "name": "Sharon Lawrence",
               "profile_path": "/yQFQzEs8ecQldq9vQlEadnTPJBl.jpg",
               "id": 121566,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Sheila",
               "gender": 2,
               "credit_id": "52fe475b9251416c75096857",
               "name": "Marisa Coughlan",
               "profile_path": "/iATJK8gWf8pXwJIKB0w8lQ38TTH.jpg",
               "id": 56595,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe475b9251416c75096839",
               "name": "Davis Guggenheim",
               "profile_path": "/wsq8gRMA63QZeOEdkq4I5xiUzWC.jpg",
               "id": 19012,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe475b9251416c7509683f",
               "name": "Gregory Poirier",
               "profile_path": null,
               "id": 50942,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "58f82ecf9251415c5900238a",
               "name": "Graeme Revell",
               "profile_path": "/g2Nhv2OCV8ygLYxkeDbhlqnrv7Z.jpg",
               "id": 5912,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "58f82ed7c3a36875f000218a",
               "name": "Andrzej Bartkowiak",
               "profile_path": "/K2pgHC907AUCim8WOkHOJpqERC.jpg",
               "id": 10765,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "58f82ee5c3a36875f0002196",
               "name": "Jay Cassidy",
               "profile_path": null,
               "id": 13227,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "58f82eecc3a36875f0002198",
               "name": "Lora Kennedy",
               "profile_path": "/iLrYUr57iX8LdHxnh3bflegzWuE.jpg",
               "id": 2953,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "58f82efdc3a368761b0022ee",
               "name": "David Nichols",
               "profile_path": null,
               "id": 1521767,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "58f82f049251415bf9002389",
               "name": "Vlasta Svoboda",
               "profile_path": null,
               "id": 1463199,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 1,
               "credit_id": "58f82f0cc3a36875f00021a9",
               "name": "Louise Mingenbach",
               "profile_path": null,
               "id": 9043,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "58f82f14c3a368759f0022f7",
               "name": "Enrico Campana",
               "profile_path": null,
               "id": 1467298,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "58f82f1dc3a368758f0024e3",
               "name": "Michelle Convey",
               "profile_path": null,
               "id": 1799768,
               "department": "Art",
               "job": "Set Decoration"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 5.535947,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 18041,
      "vote_count": 81,
      "budget": 14000000,
      "overview": "On a beautiful college campus, something ugly is about to be spread around. A bit of gossip that was told is starting to take a frightening turn. Who could it have offended and how far will the person on the other side of the gossip handle the embarrassing situation.",
      "similar": [
         336843,
         189,
         949,
         440021,
         3600,
         1073,
         325133,
         654,
         1939,
         8834,
         22825,
         10285,
         341006,
         72784,
         9272,
         1923,
         15762,
         2163,
         9411,
         1645
      ],
      "original_title": "Gossip",
      "runtime": 90,
      "poster_path": "/jsSDDvXM1Lmxe8mIkCRRG8u9Q5k.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "NPV Entertainment",
            "id": 172,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Outlaw Productions (I)",
            "id": 19507,
            "origin_country": ""
         },
         {
            "logo_path": "/tpFpsqbleCzEE2p5EgvUq6ozfCA.png",
            "name": "Village Roadshow Pictures",
            "id": 79,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "2000-04-21",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "It can turn you on, or turn on you.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Davis Guggenheim"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Gregory Poirier",
         "Gregory Poirier"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0176783/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY5MTgxOTM5Nl5BMl5BanBnXkFtZTcwNzk4MDMyMQ@@._V1_SY317_CR9,0,214,317_AL_.jpg",
      "actors": ["Stars: James Marsden, Lena Headey, Norman Reedus | See full cast and crew »"],
      "reviews": [
         "\"Gossip\" barely got noticed when it was released. This reception was possibly due to the generally slow box office of April 2000, but also to the fact that, at times, the film's style compensates for its lack of substance. Still, the film is a fun way to spend a few hours and the screenplay provides a unique story. The acting is pretty good, especially from the three leads - Lena Headey (Cathy), James Marsden (Derrick) and Norman Reedus (Travis). I saw Headey in some other films after this one, namely \"Face\" and \"Ripley's Game\", and was impressed not only by her emotional range, but also by her mastery of accents. Both Marsden and Reedus are better actors than they are given credit for. The film's style and locales epitomize what I would personally call 'twenty-first century chic'. The loft is ultra cool, and so is the club. In fact, the film is worth seeing for its locales alone. Overall, a nice little thriller. I give it a 7/10.",
         "I viewed Gossip in a classroom setting with 26 college freshmen as a unit in a class devoted to transition to college. I was pleasantly surprised at the discussion engendered by viewing the film in a classroom setting. The students responded enthusiastically and thoughtfully to the many ethical issues presented. I recommend the film for this purpose. The first 80 minutes or so of this 90 minute suspense thriller reminded me of some of the earlier films of Brian DePalma. It is nicely shot at an urban university (NYU?), and the colors and angles add to the introduction of the main plot device - an \"innocent\" rumor started as a group project for a communications arts class. Notice how many right angles and sharp points are present in the party and residential settings. The students felt this contributed to the intended feeling of edginess engendered by the first 20 minutes. The first 80 minutes are well-conceived and intricately-plotted. The plot reveals itself at an excruciatingly pleasurable pace, and a nice twist is that the character of Derek appears to know no more than we, the audience, do. The ending is abrupt and somewhat derivative, but, in post-viewing discussion, we were able to identify a number of clues to the ending which the director has sprinkled throughout. A dark, cine noir feeling to the production results in a film a bit out of step with the 21st century, but one that should be satisfying to fans of the genre.",
         "Well, not totally. But it definitely left something to be desired. The plot starts out well and is very intriguing. However, the story takes some twists and turns that make it confusing and unbelievable. The plot begins with three college friends, Cathy (Lena Headey, \"The Devil's Advocate,\") Derek (James Marsden, \"Disturbing Behavior,\") and Travis (Norman Reedus, \"Deuces Wild,\") who find they are very good at starting rumors. They decide to use this talent to do an experiment for a class in which they begin a rumor, track it around campus, and see how it changes and spreads. The poor subjects of their experiment are Beau (Joshua Jackson, TV's \"Dawson's Creek\") and Naomi (Kate Hudson, \"Almost Famous.\") While at a party, Derek discovers a situation between Beau and Naomi that soon becomes the rumor. However, when the rumor takes a drastic turn and students start accusing Beau of rape, Cathy and Travis must try and convince Derek that what they've started may lead to something worse. And when Naomi is found dead, the three roomates must fight among themselves and their consciences to fix a rumor that gave them more than what they bargained for. James Marsden gives an excellent, evil performance. Norman Reedus puts a lot into his character that excels in the end. And Joshua Jackson gives a wonderful performance as a wrongly accused man. I found Lena Headey and Kate Hudson's acting somewhat bland and boring. The movie seems to try too hard when trying to surprise you. In fact, it tries so hard that it creates way too many \"I have an ulterior motive\" and \"I'm not what you think I am\" side stories. If it just went down to the basic facts and left a little of the confusion out, it would have been much better. Possibly a 10 star movie. However, because I got hopelessly lost by the end, it only earned ******/10.",
         "Believe me this film doesn't have throngs of admirers. But I have an affinity for it. It's slick and interesting. The characters aren't what they seem. I thought James Marsders was quite good as the young man with the charm and looks..but something sinister lurks behind those eyes. The cast is pretty top notch for this genre and the film was much slicker than most give it credit for. It doesn't have a loyal following and certainly it's far from a masterpiece. But as entertainment,the film didn't let me down. The ending,while wasn't altogether satisfying,was at least fresh and different from the typical movie of it's genre. The movie has mystery and manipulation,it doesn't let you truly know all there is to know about many of the characters. There are many well known faces,especially from teen television,but this is an adult film..with adult themes like rape,deception,manipulation,trust,and possibly \"murder.\" It surprised me..because after it was over I was entertained. Sometimes that's all it takes for me to be satisfied. ***1/2/*****",
         "A vicious rumour is spreading like fire through the university, three journalism students planted the story, hoping to trace how it changes as it burns its path; but what goes around comes around. With a young and talented cast, including James Marsden, Lena Heady, Norman Reedus and Kate Hudson; Gossip deserves more credit than it seems to have received. The story is full of twists and is genuinely compelling to watch and easy to relate too; the direction is pretty stylish and achieves the necessary feel for the plot to play out, and the cast all contribute with solid performances. It's either been overlooked or harshly criticised by far too many people, come on! It's a good thriller. 7/10",
         "This is one of the rare current films which takes the trouble to combine good acting and an interesting plot with excellent filming and directing. The viewer is left to think about the \"harmless\" thing called gossip, and about the views and moral codes of today's young generation. It is pleasant to note that the characters are quite realistic. We have all known, in high school and college such \"artistic weirdos\" as Travis, such hysterical \"golden girls\" as Naomi, such intellectuals as Kathy Jones, and such successful athletes as Derrick--popular and admired, and yet feared somehow, for the little diabolical flash in their behavior. It is a tribute to the talent and skill of these actors that they inspire belief in the viewer while playing the roles of abstracts. It should be noted particularly that James Marsden, usually an underestimated actor, manages by his skill to inspire sympathy, and in the end, a certain amount of bewildered admiration for his character. One may argue whether lying and manipulation are immoral--but doing both of them well, and professionally, is worthy of respect. To conclude--this is a film that is rare in the genre of youth films, in that it gets the viewer to sit back and think about the life these characters live, and the life which all of us saw firsthand in school and college. The life of gossip, of lies, rumors, reputations . . . a life in which words have power over reality. The Director shows this well, and the talented and skilled actors make us believe in the reality of their characters, their deeds, their emotions, and their thoughts.",
         "Recently, construction on my home forced me to spend a few days at my 21 year old daughter's apartment which she shares with her equally 21 year old roommate. Hmmm... Reflectively, that's a pretty good premise for a light comedy. Or, a gritty reality show. I'm sure I'll see it next year, after somebody reads this and works it into a million dollars I won't share, but you saw it here first, folks! Moving on. This brief sojourn afforded me several nights alone, left to shift for myself. Evidently, 21 year old girls go out EVERY night. Naturally, I thought to while away some time with a fine feature film. Enter culture shock. It seems that young women of this age possess very little of what their parents would consider watchable, let alone entertaining. However, sandwiched between classic Disney films, Bum Fights and a preponderance of films starring Orlando Bloom and Silent Bob, I found \"Gossip\". Deciding to give it a try, I spent the next hour and a half or so with a growing feeling of nausea. This is a very disturbing film. The premise seems harmless enough. Three college students (James Marsden, Lena Hedley, Norman Reedus) decide to start an ugly rumor on campus for a \"class project\". They claim that a \"friend\", Beau (Joshua Jackson) had sexual intercourse with an unconscious date, Naomi (Kate Hudson) a notoriously virginal girl. Vicious as this seems, it remains relatively harmless until well meaning interference by other students convinces Naomi she has been \"date raped\", and this baseless, thoughtless lie becomes a criminal matter. As a parent, this is a Class A nightmare. I STILL worry, much to my daughter's disgust. But, I also have a son, and the hellish circumstances faced by innocent Beau and his family resonates as well. The performances of all of the young up and coming actors, none of whom, except Hudson, I have seen before, is earnest and intense, especially as the situation spirals out of control. Edward James Olmos is, as always, utterly convincing as the detective assigned to the case. What I find so disturbing about the film is that it fails to make the point that gossip and rumors like these are not only ugly, they can be utterly destructive. Even if the subject is cleared in the end, the psychological damage to him, the girl, and both of their families is ongoing. I happen to be a big believer in justice, and I would have liked to have seen the three students responsible seriously punished, criminal records of their own being the least of the consequences. I am also disturbed by the opinions of others regarding this film. Comments that solely praise the beauty of an actress or the excellent directing, and say NOTHING about the subject. In fact, one went so far as to state that this is just the way things are on a college campus. How sad is that? How far has our society's moral standards fallen as to brush this off as nothing unusual? This \"Life Sucks.. So What?\" attitude is more frightening than the threat of nuclear war. Dress it up any way you want, \"Gossip\" is a revisiting of the Salem Witch Trials. The general consensus that no one seems to care, or feel that the instigators deserve vilification, at the least, both sickens and scares the hell out of me. Aside from that, there were serious reality flaws in the script. Forensic evidence, for one, or the lack of even more than a brief mention of it. The \"evil\" of Marsden's Derek revealed as if it were justification, both for the initial lie and the subsequent actions of the other two conspirators. The quick, and almost too pat ending. This film had an opportunity to make a powerful statement about the effect these kinds of vicious head games have on the innocent. A good film can go far in the changing of perceptions, attitudes, even actions of those who watch it. Unfortunately, \"Gossip\" fails in its chance. I give this film an overall six because of the dedication of the cast. Other than that, I cannot recommend this film as anything other than a sad, sad commentary on the lack of moral standards of the up and coming generation. God help us if they don't wake up.",
         "I am surprised that Gossip so far has received rather low ratings. If you like Shallow Grave - then you will probably like this movie. It is very similar in concept with 2 guys and a gal living together with somewhat platonic relationships. But the movie is actually more about something else that is very intense and suspenseful. I thought this movie was very captivating... all the way to the end. The acting was ok and the character Derrick Web is very well played by X-men star mardsen. If you like to guess at endings, this movie will give you a good ride.",
         "Telephone... ...Telegram... ...and tell a woman Apologies for that old fashioned joke but it did make me smile and apologies too that anyone might think it's actually true because I know fine well from bitter personal experience that idle or malicious gossip and two faced chit chat that can affect a life is just as likely to be started by males as much by females . I guess everyone already knew that ? Interesting to note though that women like this film slightly more than men . I have to confess that I wasn't too keen on it . Now this had nothing to do with sexism and had everything to do with the way the story was developed which centres around rumours of a rape and before you can blink the rumours have spread all over college campus and a student finds himself facing charges . Other reviewers have rightly pointed out that the story is entirely dumb so I won't bother reiterating the points they've raised except to say \" What about forensic evidence ? for a charge to be brought \" . I also have a problem that it's a movie that's entirely made for a teen market which means the cast is young and good looking and we have to endure the MTV type of filming which totally negates any type of drama",
         "Based on R2 DVD 87 min. Gossip starts off well, an interesting premise, pretty people a suggestion of a good thriller to come. Alas somewhere around the 60 minute mark the script writer must have run out of pencils. The story takes a witless fantasy turn that left me feeling cheated. The so called alternate ending is just a longer and more unrealistic one. 5/10 catch it on TV"
      ],
      "genres": [
         "Drama",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "NPV Entertainment",
         "Outlaw Productions (I)",
         "Village Roadshow Pictures"
      ],
      "summaries": [
         "On a beautiful college campus, something ugly is about to be spread around. A bit of gossip that was told is starting to take a frightening turn. Who could it have offended and how far will the person on the other side of the gossip handle the embarrassing situation.",
         "Derrick, Cathy, and Travis, three students and fellow roommates, decide to do a class project on gossip. Derrick witnesses couple Naomi and Beau making out at a night club, but then she passes out and Beau leaves. Cathy spreads the rumor that well-known ice princess Naomi had sex with Beau at the club that night, which quickly evolves until the gossip mill is saying that Beau went ahead and had sex with Naomi after she passed out. Cathy has regrets when Naomi cries rape and Beau is being arrested.",
         "Three college students base their class project around gossip and how fast it spreads, which soon spirals out of control."
      ],
      "budget": 24000000
   },
   "movielensId": 3553,
   "movielens": {
      "languages": [
         "English",
         "Italiano"
      ],
      "releaseDate": "2000-04-21",
      "dvdReleaseDate": "2000-10-31",
      "directors": ["Davis Guggenheim"],
      "runtime": 90,
      "movieId": 3553,
      "title": "Gossip",
      "mpaa": "R",
      "actors": [
         "Joshua Jackson",
         "James Marsden",
         "Kate Hudson",
         "Lena Headey",
         "Norman Reedus",
         "Eric Bogosian",
         "Edward James Olmos",
         "Sharon Lawrence",
         "Marisa Coughlan"
      ],
      "imdbMovieId": "0176783",
      "originalTitle": "Gossip",
      "genres": [
         "Drama",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "P3R-KA7UBU4",
         "mug7vBaLfoI"
      ],
      "plotSummary": "On a beautiful college campus, something ugly is about to be spread around. A bit of gossip that was told is starting to take a frightening turn. Who could it have offended and how far will the person on the other side of the gossip handle the embarrassing situation.",
      "tmdbMovieId": 18041,
      "avgRating": 2.80741,
      "releaseYear": "2000",
      "numRatings": 688,
      "posterPath": "/jsSDDvXM1Lmxe8mIkCRRG8u9Q5k.jpg"
   }
}