{
   "tmdb": {
      "original_language": "fr",
      "keywords": [{
         "name": "extramarital affair",
         "id": 34094
      }],
      "imdb_id": "tt0051852",
      "video": false,
      "title": "The Law",
      "recommendations": [47238],
      "backdrop_path": "/6Wp1yNNDnWYDZD4JQsGK0ZmkKjp.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Marietta",
               "gender": 1,
               "credit_id": "52fe47d59251416c91077233",
               "name": "Gina Lollobrigida",
               "profile_path": "/eTS3APBHcmbfJhXYa5qDnj0Fddx.jpg",
               "id": 19534,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Don Cesare",
               "gender": 2,
               "credit_id": "52fe47d59251416c91077237",
               "name": "Pierre Brasseur",
               "profile_path": "/Ag5OquJVoDniYGJlZBjzSgTc0x8.jpg",
               "id": 24476,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Enrico Tosso",
               "gender": 2,
               "credit_id": "52fe47d59251416c9107723b",
               "name": "Marcello Mastroianni",
               "profile_path": "/mZCdZhu5UfS8As8gSoyxYAsXVNl.jpg",
               "id": 5676,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Donna Lucrezia",
               "gender": 1,
               "credit_id": "52fe47d59251416c9107723f",
               "name": "Melina Mercouri",
               "profile_path": "/sEeosxLV6WhPm9J26P0R5BKC4ls.jpg",
               "id": 29902,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Matteo Brigante",
               "gender": 2,
               "credit_id": "52fe47d59251416c91077243",
               "name": "Yves Montand",
               "profile_path": "/zrDxGcU5r1T6arsSRu17fXKArWN.jpg",
               "id": 2565,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Francesco Brigante",
               "gender": 0,
               "credit_id": "52fe47d59251416c91077247",
               "name": "Raf Mattioli",
               "profile_path": null,
               "id": 590165,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Attilio",
               "gender": 2,
               "credit_id": "52fe47d59251416c9107724b",
               "name": "Vittorio Caprioli",
               "profile_path": "/9N1v5ihkkOcuH9gBIEtfItpXjHK.jpg",
               "id": 11223,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Giuseppina",
               "gender": 0,
               "credit_id": "52fe47d59251416c9107724f",
               "name": "Lidia Alfonsi",
               "profile_path": "/jq8HbxGYhxd4Kfq27ngsKMnjjEq.jpg",
               "id": 9240,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Pizzaccio",
               "gender": 2,
               "credit_id": "52fe47d59251416c91077253",
               "name": "Nino Vingelli",
               "profile_path": null,
               "id": 45983,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Balbo",
               "gender": 0,
               "credit_id": "52fe47d59251416c91077257",
               "name": "Bruno Carotenuto",
               "profile_path": null,
               "id": 16317,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe47d59251416c9107722f",
               "name": "Jules Dassin",
               "profile_path": "/v7DZOtLE1i6S7UjLNjkHq85JPEu.jpg",
               "id": 14227,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe47d59251416c9107725d",
               "name": "Roger Vailland",
               "profile_path": null,
               "id": 1153577,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe47d59251416c91077263",
               "name": "Jules Dassin",
               "profile_path": "/v7DZOtLE1i6S7UjLNjkHq85JPEu.jpg",
               "id": 14227,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47d59251416c91077269",
               "name": "Françoise Giroud",
               "profile_path": null,
               "id": 1175688,
               "department": "Writing",
               "job": "Dialogue"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.928501,
      "production_countries": [
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 80677,
      "vote_count": 5,
      "budget": 0,
      "overview": "A cook turns to theft so she and her lover can marry.",
      "similar": [
         843,
         37265,
         36630,
         28468,
         1440,
         4507,
         27066,
         283227,
         884,
         10998,
         255,
         11368,
         1259,
         284,
         244772,
         634,
         2251,
         24016,
         21484,
         2539
      ],
      "original_title": "La Legge",
      "runtime": 126,
      "poster_path": "/7dkujJW7ESth5BNwDQ7wg0s4gvR.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Le Groupe des Quatre",
            "id": 14562,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Cité Films",
            "id": 14035,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Titanus",
            "id": 641,
            "origin_country": ""
         }
      ],
      "release_date": "1959-01-25",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "GINA AND MONTAND TURN DESIRE INTO FIRE WHERE THE HOT WIND BLOWS!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Black and White",
      "budgetCurrency": "FRF ",
      "directors": ["Jules Dassin"],
      "runtime": 105,
      "synopsis": null,
      "writers": [
         "Roger Vailland",
         "Jules Dassin"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0051852/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkwMzI5NjgyOV5BMl5BanBnXkFtZTcwMDQ5NjAyMw@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Gina Lollobrigida, Pierre Brasseur, Marcello Mastroianni | See full cast and crew »"],
      "reviews": [
         "The Law exists somewhere in the realm between a Hollywood soap opera and a European art film, with a dash of sexploitation. This film is all about power--how one gets power, how one can use power (to lay down The Law, or lose power, and how power relates to sex. This film is all about sex. Sometimes, it feels like it's all about Gina Lollobrigida's boobs. The all-star European cast are all good, especially Lollobrigida and Yves Montand, who has the meatiest role in the film, as a complicated local hoodlum who wants his son to become a lawyer, who wants to be the one to lay down The Law, and who very badly wants Gina Lollobrigida, who doesn't want him in the slightest. Sometimes, the film approaches high camp, such as a couple of odd and unexpected musical numbers, and when Marcello Mastroianni and Gina Lollobrigida romp in the surf amidst a flock of sheep, or when Gina Lollobrigida is strapped to a table by her mother and a couple of jealous maids and whipped (and with a bowl of hot chilis behind her head that's photographed to look like a halo). It's a gorgeous film to look at. There's Gina Lollobrigida's boobs. And then there's the quaint, crumbling little backwater Italian fishing village, sumptuously photographed in that deep, saturated mid-century black and white. And there's the sea. It looks straight out of a Fellini film. Jules Dassin's direction is lively and stylish, and keeps the film eminently enjoyable throughout. He veers effortlessly between the comedic and the sinister and the sexy, often in the same scene. But, although I found the films very enjoyable to watch, I do have some problems with it. It felt sometimes that Dassin was trying to cram in as much of the material from the novel as possible, even when it didn't best serve the film. There were multiple storylines unfolding, but the film's two-hour running time was not enough to accommodate them in any depth. And so the film meandered back and forth between characters and situations without a great deal of focus. I think Dassin would have done well to trim a couple of the storylines entirely, which weren't fleshed out enough anyway. Still, though, this was solid entertainment. 8/10",
         "In the Italian fishing village of Porto Manacore, the men gather in the local tavern in the night to play a game called \"The Law\", where one of them is selected as \"The Boss\" after an allotment and the others are humiliated by him. The real boss of the town is the powerful aristocrat Don Cesare (Pierre Brasseur), an old man in his last days but still in the command. The young and sexy small time crook Marietta (Gina Lollobrigida) is the servant of Don Cesare and sexually disputed by the hoodlum Matteo Brigante (Yves Montand), by her brother-in-law Tonio (Paolo Stoppa) and by the engineer Enrico Tosso (Marcello Mastroianni). Marietta wants to marry Enrico, but she is too poor and does not have a dowry. The local Inspector Attilio (Vittorio Caprioli) is an unfaithful husband and the naughty Giuseppina (Lidia Alfonsi) is his mistress. Donna Lucrezia (Melina Mercouri) is the judge's wife that has a crush on the lawyer student and Matteo's son Francesco (Raf Mattioli). When Marietta steals a large amount of a Swiss tourist, she sees the chance to marry Enrico, but the police are investigating the case. \"La Legge\" is a minor movie that recalls a soap-opera of the great director Jules Dassin but it is still enjoyable and entertaining. The story takes place in a small fishing village in the South of Italy, where nothing happens but sex, infidelities and gossips. The real power is in the hands of an old aristocrat, and the dwellers dispute a despicable game of power where most of the participants are humiliated as a sort of compensation. Gina Lollobrigida is extremely sexy, her beauty is amazing and there are many erotic scenes considering that it is a movie released in 1959. My vote is seven. Title (Brazil): \"A Lei dos Crápulas\" (\"The Law of the Debaucheries\")",
         "I really enjoyed watching The Law. The storyline was great, and I loved the occasional tidbits that were so unexpectedly hilarious. The theme about who was really considered \"the law\" and the person with all the power was extremely entertaining. Gina Lollabrigida (Marietta) was fantastic! I loved her character's attitude. She knew what she wanted, and she knew how to get what she wanted. The many different plots and characters were all very enjoyable and interesting. And in the end, it is very clear who the person is that has all the power in the city. I absolutely loved the movie and was highly entertained! I'm so glad that it's finally being distributed for a wide release in the US! There's love, sex, power, drama, and death! with the occasional hilarity and musical number. What more could you ask for in a movie?",
         "The director Jules Dassin was able to draw well the reality of a small village in Southern Italy, where the existing rules were applied with a double standard. The priest was very much concerned with the attitude of Marietta (Gina Lollobrigida), but not with other situations affecting the town. The game called \"la legge\" (the law) was not an entertainment instead it was a weapon of intimidation. It appears to be as the behavior of strong animals showing their powers over weak ones. This is an old film, which could be useful to be shown in Italy again. Dassin was able to show various details and characters of the life in the village: the patriarch (Pierre Brasseur), the \"pidgeon\" (Yves Montand), the man of well-doing (Mastroianni), plus the lady of the family or la Donna(Melina Mercouri) and Marietta, likely to be a kind of spoiled Cinderella. All these ingredients put coherently in an interesting plot made the film attractive to be seen and not only once.",
         "This could have been a great movie, but it is almost unbelievable the way in which Dassin looked at Southern (I repeat: SOUTHERN) Italy in the Fifties of 1900. I was a boy, I did not live there, but in that South I spent my holidays. The best holidays I ever had, due surely to my (then) splendid age and to my (then) splendid country. A young woman dressed like Gina Lollobrigida could never be seen in those years walking the streets of a southern Italian village. The magnificent place where the movie was partly made is Peschici (Gargano, Puglia). The name Manacore, in fact, was later used for a very elegant and costly touristic place. I spent several holidays there in the Sixties, and (let alone the Fifties!) never saw a woman dressed that way. And, as far as I remember, they did not go to the beach albeit wearing a diving apparatus (complete of snorkel). And the music in the local festivals (dedicated to saints, with parades, priests, candles and so on) was very different, almost always neapolitan. Mrs Mercouri and Ives Montand are surely not at their best (to be kind), but we really re- discover a woman which was at most considered a pin-up, and on the contrary was really a great actress: Gina Lollobrigida. Brasseur is OK, very human and credible. Marcello Mastroianni as usual shows how one can be a great actor with the minimum of mannerisms (or not at all). A movie which unfortunately aged very badly.",
         "I saw it and I think that is very good, but my VHS is in English and I would like to get a DVD with Spanish subtitles. Gina Lollobrigida is my favorite actress, so I would like to see this film again ad so to understand like must be. I am sorry because my English is not good. Anothers Gina DVD that I want to get are:Trapeze, The hung back of Notre Dame, Buona Sera, Mrs. Cambel, King, Queen and Valet, Salomon and Sheeba, Beautiful but Dangerous, Fanfan La Tulipe,Come September,Bread, Love and dreams, Bred, love an jealous, Alia, Wife for a night,The Lonely woman. woman of Straw, Go naked in the world and if is possible, a book called Imperial Gina.Thanks you."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Le Groupe des Quatre",
         "Cité Films",
         "Titanus"
      ],
      "summaries": [
         "Marietta, servant of aristocrat Don Cesare, is the bellezza of an Italian town where men gather nightly in the tavern for the 'game of the Law,' selecting one by lot to boss and humiliate the others. Illicit passions abound: the judge's wife pursues Francesco, son of crime boss Matteo, who is after Marietta (so is her brother-in-law); Marietta wants engineer Enrico for a husband, but he claims he's too poor to marry. So she decides to steal herself a dowry! All this may lead to an explosion...and some changes in who dictates 'the law.'",
         "In the Italian fishing village of Porto Manacore, the men gather in the local tavern in the night to play a game called \"The Law\", where one of them is selected as \"The Boss\" after an allotment and the others are humiliated by him. The real boss of the town is the powerful aristocrat Don Cesare, an old man in his last days but still in the command. The young and sexy small time crook Marietta is the servant of Don Cesare and sexually disputed by the hoodlum Matteo Brigante, by her brother-in-law Tonio and by the engineer Enrico Tosso. Marietta wants to marry Enrico, but she is too poor and does not have a dowry. The local Inspector Attilio is an unfaithful husband and the naughty Giuseppina is his mistress. Donna Lucrezia is the judge's wife that has a crush on the lawyer student and Matteo's son Francesco. When Marietta steals a large amount of a Swiss tourist, she sees the chance to marry Enrico, but the police are investigating the case.",
         "Illicit passions pervade an Italian town, where men gather nightly for the cynical \"game of the law.\""
      ],
      "budget": 450000000
   },
   "movielensId": 3558,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1959-01-25",
      "dvdReleaseDate": "2000-04-21",
      "directors": ["Jules Dassin"],
      "runtime": 126,
      "movieId": 3558,
      "title": "The Law",
      "mpaa": "",
      "actors": [
         "Gina Lollobrigida",
         "Pierre Brasseur",
         "Marcello Mastroianni",
         "Melina Mercouri",
         "Yves Montand",
         "Raf Mattioli",
         "Vittorio Caprioli",
         "Lidia Alfonsi",
         "Nino Vingelli",
         "Bruno Carotenuto"
      ],
      "imdbMovieId": "0051852",
      "originalTitle": "La Legge",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["xgCg8vW-9vQ"],
      "plotSummary": "A cook turns to theft so she and her lover can marry.",
      "tmdbMovieId": 80677,
      "avgRating": 2.55556,
      "releaseYear": "1959",
      "numRatings": 18,
      "posterPath": "/7dkujJW7ESth5BNwDQ7wg0s4gvR.jpg"
   }
}