{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "clown",
            "id": 3199
         },
         {
            "name": "ballet dancer",
            "id": 4118
         }
      ],
      "imdb_id": "tt0044837",
      "video": false,
      "title": "Limelight",
      "recommendations": [
         30588,
         28973,
         28978,
         962,
         47653,
         992,
         28974,
         901,
         22596,
         36208,
         16305,
         980,
         10098,
         17058,
         3086,
         3088,
         14554,
         17687,
         24807,
         32600
      ],
      "backdrop_path": "/pVPv0VEavA2aVk9ZFrBw9XIUNL9.jpg",
      "revenue": 1000000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Calvero",
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06c927",
               "name": "Charlie Chaplin",
               "profile_path": "/pcvSg2LqnyVFel9dPIwTRagpfur.jpg",
               "id": 13848,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Terry, a Dancer",
               "gender": 1,
               "credit_id": "52fe45bfc3a368484e06c92b",
               "name": "Claire Bloom",
               "profile_path": "/4x0Cfh1g8apqOPio8AJx9oUV9mK.jpg",
               "id": 29545,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Postant, an Impresario",
               "gender": 0,
               "credit_id": "52fe45bfc3a368484e06c92f",
               "name": "Nigel Bruce",
               "profile_path": "/kI8j8WGjDay9ovWnoTrqvcKYtN3.jpg",
               "id": 3363,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Calvero's Partner",
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06c933",
               "name": "Buster Keaton",
               "profile_path": "/8weZnW4cxkbMxtFAtO1NhfTrM9D.jpg",
               "id": 8635,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Neville",
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06c937",
               "name": "Sydney Chaplin",
               "profile_path": "/tHSEirTB8ckXFnh5Q1iDCUXUPc8.jpg",
               "id": 29304,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Bodalink",
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06c93b",
               "name": "Norman Lloyd",
               "profile_path": "/90SbqN35suKnemwxYnEGiaIn7DR.jpg",
               "id": 2698,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Dancer",
               "gender": 0,
               "credit_id": "52fe45bfc3a368484e06c93f",
               "name": "Andre Eglevsky",
               "profile_path": null,
               "id": 102513,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Mrs. Alsop",
               "gender": 1,
               "credit_id": "52fe45bfc3a368484e06c943",
               "name": "Marjorie Bennett",
               "profile_path": "/cyY0ltPueaqENXEBnd0KWE5VHRd.jpg",
               "id": 97257,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Dancer",
               "gender": 0,
               "credit_id": "52fe45bfc3a368484e06c977",
               "name": "Melissa Hayden",
               "profile_path": null,
               "id": 193378,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Thereza's Doctor",
               "gender": 0,
               "credit_id": "52fe45bfc3a368484e06c97b",
               "name": "Wheeler Dryden",
               "profile_path": null,
               "id": 1041524,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "John Redfern",
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06c97f",
               "name": "Barry Bernard",
               "profile_path": null,
               "id": 98497,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Claudius",
               "gender": 0,
               "credit_id": "52fe45bfc3a368484e06c983",
               "name": "Stapleton Kent",
               "profile_path": null,
               "id": 1125204,
               "order": 11
            },
            {
               "cast_id": 21,
               "character": "Maid",
               "gender": 0,
               "credit_id": "52fe45bfc3a368484e06c987",
               "name": "Mollie Glessing",
               "profile_path": null,
               "id": 198113,
               "order": 12
            },
            {
               "cast_id": 22,
               "character": "Street Musician",
               "gender": 2,
               "credit_id": "54535c840e0a2648cb000f07",
               "name": "'Snub' Pollard",
               "profile_path": "/sAuWqpvncM3oVvytfZ8VHcAkPOf.jpg",
               "id": 85778,
               "order": 13
            },
            {
               "cast_id": 23,
               "character": "Little Girl in Opening Scene (uncredited)",
               "gender": 1,
               "credit_id": "54535c97c3a3681478000e68",
               "name": "Geraldine Chaplin",
               "profile_path": "/mnPoiJrhJjJArySW8wMpf84pCxu.jpg",
               "id": 400,
               "order": 14
            },
            {
               "cast_id": 25,
               "character": "Extra (uncredited)",
               "gender": 1,
               "credit_id": "54535ccc0e0a2648cf000e98",
               "name": "Oona Chaplin",
               "profile_path": null,
               "id": 1379933,
               "order": 16
            },
            {
               "cast_id": 26,
               "character": "Mrs. Parker (uncredited)",
               "gender": 1,
               "credit_id": "54535cf4c3a368148d000ee4",
               "name": "Edna Purviance",
               "profile_path": "/lbu4Ji7ePiozKMfYlAazX6HkHUj.jpg",
               "id": 21301,
               "order": 17
            },
            {
               "cast_id": 27,
               "character": "Music Hall Performer (uncredited)",
               "gender": 2,
               "credit_id": "5a308e0e925141032c183ff8",
               "name": "Colin Kenny",
               "profile_path": null,
               "id": 120445,
               "order": 18
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06c949",
               "name": "Charlie Chaplin",
               "profile_path": "/pcvSg2LqnyVFel9dPIwTRagpfur.jpg",
               "id": 13848,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06c94f",
               "name": "Charlie Chaplin",
               "profile_path": "/pcvSg2LqnyVFel9dPIwTRagpfur.jpg",
               "id": 13848,
               "department": "Writing",
               "job": "Original Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06c955",
               "name": "Charlie Chaplin",
               "profile_path": "/pcvSg2LqnyVFel9dPIwTRagpfur.jpg",
               "id": 13848,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06c95b",
               "name": "Charlie Chaplin",
               "profile_path": "/pcvSg2LqnyVFel9dPIwTRagpfur.jpg",
               "id": 13848,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06c961",
               "name": "Charlie Chaplin",
               "profile_path": "/pcvSg2LqnyVFel9dPIwTRagpfur.jpg",
               "id": 13848,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06c967",
               "name": "Karl Struss",
               "profile_path": null,
               "id": 9081,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe45bfc3a368484e06c96d",
               "name": "Joe Inge",
               "profile_path": null,
               "id": 1125203,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06c973",
               "name": "Eugène Lourié",
               "profile_path": null,
               "id": 11558,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "5ab1025bc3a368619e00ae74",
               "name": "Robert Aldrich",
               "profile_path": "/gtXt9T1l4OSQdJvX5tLgmvUTSKE.jpg",
               "id": 18392,
               "department": "Directing",
               "job": "Assistant Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 7.641276,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 28971,
      "vote_count": 132,
      "budget": 0,
      "overview": "A fading music hall comedian tries to help a despondent ballet dancer learn to walk and to again feel confident about life.",
      "similar": [
         16296,
         11360,
         700,
         761,
         136,
         587,
         55787,
         41592,
         316029,
         346364,
         1826,
         68728,
         1730,
         112454,
         1696,
         46302,
         8054,
         14001,
         144,
         24808
      ],
      "original_title": "Limelight",
      "runtime": 137,
      "poster_path": "/xOA7iatMwNAS82XUCPTZVY4Y90R.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Celebrated Productions",
         "id": 11945,
         "origin_country": ""
      }],
      "release_date": "1952-10-31",
      "vote_average": 8,
      "belongs_to_collection": null,
      "tagline": "The masterpiece of laughter and tears from the master of comedy!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Charles Chaplin"],
      "runtime": 137,
      "synopsis": null,
      "writers": ["Charles Chaplin"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0044837/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ3Mzc3Mjk3NV5BMl5BanBnXkFtZTgwNjA3NjQzMTE@._V1_SY317_CR8,0,214,317_AL_.jpg",
      "actors": ["Stars: Charles Chaplin, Claire Bloom, Nigel Bruce | See full cast and crew »"],
      "reviews": [
         "A washed-up, formerly-famous Music Hall comic, Charlie Chaplin, saves a suicidal ballerina, Claire Bloom. In the process of giving her the hope to move on and succeed, he regains the confidence to return to the stage himself. \"Limelight\" is a moving and autobiographical film that works as both a bittersweet drama and a mirror into the soul of one of the world's greatest film makers. I sometimes wondered if my affection for this film is based on my knowledge of Chaplin's life and career, and the parallels between \"Limelight\" and people and incidents in his own life. When I watch this film I see an artist standing naked at a crossroads before his audience, unsure where to go and what to do. However, I know the film does not require an advanced degree in Chaplin to enjoy. My wife, who could probably do little more than identify the Tramp in a lineup before marrying me, loved this film before she met me. I have also had the good fortune to see the film in a theater in New York and watch it work its wonders on an audience. Stylistically, it might be dated, but the magic lingers. \"Limelight\" is best viewed as a drama with comedy rather than a comedy with drama. Outwardly, it is the simple story of a vulnerable youth who mistakes her gratitude for love, and an older man wise enough to know the difference. But it's more than that too. It's about an artist's nature, and the addictive power of applause. The Chaplin character, Calvero, knows how to make people laugh, but feels he has lost the ability to do so. He realizes he is at the end of his career, but he still hungers for one final moment in the limelight. The film is talky and philosophical, and, yes, a little pompous and pretentious at times too. It's almost as if Chaplin is trying to impart through words the simple joys and mystery of life he was once able to express effortlessly through simple slapstick alone. Does this flood of words mean Chaplin has lost his skills as a film maker? No. He still has the power to move. \"Limelight\" is Chaplin's final masterpiece. It is one of my favorites. I prefer to think of it as his last film. Should this be your first Chaplin film? No. Start with films like \"The Gold Rush,\" \"City Lights,\" and \"The Great Dictator.\" Come to know the comedian before you get to know the man.",
         "Haunting and unforgettable piece from Charles Chaplin that was nearly lost in the American cinema all together. It played in very few cities within the U.S. in 1952 and was never shown in Los Angeles due to the suspicion that the House of Un-American Acts Committee had concerning Chaplin (making no sense to me as Chaplin, who was British, was the polar opposite of a Communist from all indications). The film disappeared from U.S. soil and did not re-surface until some 20 years later in 1972 and Chaplin actually won an Oscar, with fellow scorers Raymond Rasch and Larry Russell, for this movie's original dramatic score (this was the only competitive Oscar Chaplin ever won). Chaplin stars as a washed-up vaudeville performer. He is now an elderly man (in his 60s when the film was made) and the spotlight is gone forever, even though he still secretly yearns for it. Chaplin discovers a very young ballet dancer (Claire Bloom) who has attempted suicide because she cannot handle being a performer. Naturally Chaplin cannot believe that this young, beautiful and talented woman would rather take her life than be a ballet performer (the fact that Chaplin yearns for her youth and the ability to be an entertainer again makes him bound and determined to get her back on her feet). He tries with all his might to get her performance-ready again, all the while he is also trying to resurrect the career that he lost long ago. Chaplin has a dream of a stunning performance he has on the stage, but when his act ends there is no one there to acknowledge him (one of, if not the saddest sequences I have ever seen on film). Soon it becomes obvious that Chaplin's time is running out and his desperation to have that one last piece of action engulfs his mind, body, heart and soul. \"Limelight\" is one of the most dramatic and intense pictures I have ever encountered. Chaplin's life and career had changed dramatically by 1952. The Little Tramp was no more, all movies had sound, some films were being made in color and the subject matter of motion pictures was slowly starting to change. In many ways Chaplin was trying to show the viewing public his life in celluloid form and \"Limelight\" would be the vehicle used. This is a stunning work that once again shows the humanity and overall sensitivity that Chaplin had with his movies. Chaplin's long-time rival in real-life (Buster Keaton) even shows up late and acts as a partner in the duo's stage routine. The pairing is usually the most memorable part of this production to most, but the story and the deep emotional part that Chaplin plays are the things that make \"Limelight\" quite possibly Chaplin's greatest cinematic masterpiece. 5 stars out of 5.",
         "Chaplin could do anything as well or better than anyone else in movies: acting, writing, directing, composing, producing, editing, even choreographing. He was world renown as a comedian, yet has placed some of the most poignant images on film that ever were. He was, even more than the great Orson Welles, a sort of one man band. He was as successful worldwide as anyone ever was in movies. Somehow in all this, he got the idea that he had something worthwhile to say about life and art. Which he did with this film.. and I for one am extremely grateful. The subjects of alcoholism... depression... aging... the fickle relationships of audiences and performers... these are all covered in a film that manages to fit in philosophical dialog, pantomime, dancing, and music. The multiple showings of the same comedy sequence (in a dream, in front of an unappreciative audience, in front of a wildly appreciative audience) gets one to thinking about the lemming-like nature of people in a way that someone like Chaplin would have had almost unique insight into. It may take a while to become accustomed to the odd pacing and cadence of a Chaplin movie; once you are, you find yourself in the middle of an artistic experience like no other. The music in this film is unusually haunting and deserving of the Academy award it belatedly received. 10 out of 10.",
         "Charlie Chaplin is one of the undisputed masters of the cinema. He was one of the funniest actors of the cinema, and he was also one of the greatest directors. Of course, the films that he is most famous for are his silent comedies, especially The Gold Rush, City Lights, and Modern Times. The latter two were the product of Chaplin's stubborn clinging to the format and conventions of the silent cinema, though everyone else had gone to sound. This stubbornness was certainly sound. His contemporaries such as Buster Keaton and Harold Lloyd lost popularity when they moved to sound. Chaplin's last two silent films were popular and made a lot of money. Audiences may have craved sound, but they craved Chaplin, too, and did not disdain his silence. He was one of the silent artists who thought that they were just achieving the peak of their medium when sound came in. He proved himself right, since City Lights (1931) and Modern Times (1936) are probably his two best films, and both are two of the best films ever made. Finally, in 1940, Chaplin directed and starred in his first talkie, The Great Dictator. Three more followed, Monsieur Verdoux, then Limelight, then King of New York, which happens to be the only one of these four I have not seen. The Great Dictator and Monsieur Verdoux were both good films in their own way, but perhaps Chaplin's in depth political commentary in these films detracted from them. The type of comedy that you find in his silent films did not mix well with this social commentary. The simple juxtapositions of the worlds of the poor and the rich in City Lights and Modern Times were far more powerful than what his first two talkies had to offer. Then came Limelight, one of the most bittersweet films ever made. It is not perfect, but it achieves a grand melodramatic beauty that few films have ever even approached. The story is simple: a washed-up, old vaudvillian rescues a young ballet dancer from suicide. He takes care of her until she is healthy again, and even restores her confidence. The story may be simple, but the character dynamics are very complex. As the dancer, Theresa, is recovering, Calvero is not only rebuilding her confidence, but also his own. Theresa, because of his kindness towards her, finally believes she has fallen in love with him, even going so far as proposing marriage to him. Whether she actually loves him or not, and Calvero strongly asserts that she shouldn't and doesn't, these two characters have a constantly evolving relationship that does not end until the credits role. It is utterly fascinating, captivating, and dramatic. There are a couple of problems, and though they're small, they deserve attention. Perhaps the biggest problem is that Claire Bloom is quite guilty of overacting. Her line delivery is bizarre and overdramatic. This isn't a big deal, since you ought to be keenly aware that the film takes place in the world of melodrama, and is thus exaggerated. Another thing that irked me is Buster Keaton's role. It is little more than a cameo. In fact, his character doesn't even have a name in the credits. This is truly disappointing, seeing that he, although Chaplin may have had the most heart, was the all-around funniest silent comedian.",
         "Charlie Chaplin was without a doubt one of the most important pioneers of film-making, and through his life he saw the development of the cinema and its progress. \"Limelight\" is probably not as well known as most of his silent feature, but it is a very important film to understand the vivacious mind of this genius. It is a very personal film that showcases Chaplin's feelings about his own brand of comedy and how it slowly lost the public's attention as he grew older. \"Limelight\" is the story of an old comedian named Calvero (Chaplin), who one morning discovers that his young neighbor Thereza (Claire Bloom) attempted to commit suicide. He decides to take care of her and discovers that she is a dancer; knowing that both share a passion for performing he begins to cheer her up and prepares her to become a great dancer while at the same time he remembers his past glories. When one watches \"Limelight\" is impossible not to see the many autobiographical aspects of the plot, as in many ways, Calvero represents how Chaplin feels at the modernization of comedy on stage. Like Chaplin, Calvero also played the character of an optimist tramp who always saw the good side of life, and like Chaplin, Calvero faced many times the urge to modernize his act. It's kind of frightening to think about how much of Calvero's story could be based on Chaplin's real experiences as it is a sharp criticism (for its time) to the way performers are treated by both their managers and their public. As the last of his \"talkies\" made in America, \"Limelight\" is done with all the power Chaplin still had (although the film would be banned as Chaplin lost his power due to his political opinions) and it shows. The stage performances of the characters are sublime and in Calvero's memories Chaplin resurrects a way of comedy apparently dead by the early 50s and makes it fresh. The Keaton/Chaplin duo is a classic moment captured on film. However, \"Limelight\" is not a comedy in the strict sense of the word. Those expecting a laugh-riot like \"Modern Times\" or \"The Great Dictator\" will be disappointed, this is a very personal melodrama where Chaplin his emotions about his career. The acting is very good, Chaplin may be more remembered for his parts in silent films, but he delivers his lines with ease and ability. His physical comedy is superb and his overall performance is memorable (mainly because it feels as if he was playing himself). Claire Bloom is at times a bit too melodramatic for the movie's sake, but for the most part is very effective and makes a good counterpart to Chaplin's Calvero. Among the supporting cast Nigel Bruce as always chews the scenery and Buster Keaton is simply fabulous in his small yet classic role. Probably \"Limelight\"'s main problem is its excess of melodrama, and its at times, excessively preachy attitude. The fact that is not a comedy may turn off people not used to Chaplin's more serious side, as while the movie has its fair share of laughs, it is obvious that Chaplin wanted to be recognized as more than a mere clown. The movie's slow pace and rhythm also put it closer to the melodrama of the 40s than to the image we are all used to see when we think of Chaplin. Despite all this, \"Limelight\" stands as a testament of Chaplin's enormous talent, and while not very well-known, it is one of the finest films he ever did. Fans of his work will definitely enjoy this film and fans of Keaton will appreciate his small yet terrific scene. 9/10",
         "This was the first and only Chaplin film I have ever seen -- and it wasn't at all what I was expecting. I was completely surprised that such a simple film could have so many layers of depth. In fact it kept me thinking days afterwards! At it's core, I would say this movie is about the love of one's art, and the love that a couple share. The Ballerina loves to perform but is impeded by a psychosis that makes her legs inoperable. I interpret success to be the root of the psychosis. The Clown loves to perform but is impeded by his fear of becoming a B or C-list star. He is a legendary comedian and now that he's no longer in demand, he's convinced himself that he has to drink to be funny. There you have it; a clown afraid of failure and a ballerina afraid of success. Together they help each other love their art more by removing those things that impede them. The best thing about the film is that the obviousness of the plot is completely lost in the depth of the film. Chaplin uses such simple and common devices to draw the audience into his world. I know it's hard to belive, but this is a \"must-see\" movie!",
         "Charles Chaplin plays Calvero, an aging clown who rescues a ballet dancer called Terry (Claire Bloom) from committing suicide.These two become friends and Calvero gets more meaning to his life.He desperately tries to make a come back to become the greatest clown again but it's hard to make people laugh anymore.Limelight from 1952 was Charles Chaplin's last American film.It was a flop but the film won an Academy Award for best score in 1972.That year the king of comedy got also a special Oscar for career achievement.This was Chaplin's most sentimental movie and it also was very touching.Chaplin is amazing as the aging clown.The man wasn't only a great comedian.He was also a terrific actor.It's hard to top his performance in this movie.Claire Bloom's performance as the ballet dancer is also brilliant.Chaplin's son Sydney plays Neville in the movie.There are also Chaplin's children Victoria, Michael, Josephine, Geraldine and Charles Chaplin Jr. in this film.This is truly a masterpiece.This proves that Chaplin didn't shine only in silent movies.He did that also in talkies.And this is one of his best talkies. The dialogue is just delicious in this comedic drama.In the end you can see another great comedian from the silent era;Buster Keaton.You can see Chaplin and Keaton clowning together in the end.And that is one great scene.A scene to remember.The message of Limelight is how wonderful life is.Enjoy it while you still can.",
         "All the terrible facts in his life during the 1940s made Chaplin realize he was a lucky artist, having for almost 3 decades both critics recognition as well as worldwide fame. His personal problems originated by his marriage with young Oona, added to the hate generated in the United States from the brilliant, anti-capitalism movie \"Monsieur Verdoux\" left him in a very dramatic situation, that made him look back at the past, only to realize how the art he made better was changing... characters, themes, directors and actors were now different. His eternal black and white pantomime was at the moment \"useless\", and colored motion pictures were appearing... \"Limelight\" is the bittersweet movie that narrates the impossible love story between Calvero, the fading comedian, and Terry, the suicidal Dancer. Perhaps his final masterpiece, Limelight earns recognition and admiration for its philosophical thoughts about life, love, and the mix of comedy and drama. Considered as his will to artists and his homage to his three loves: London, arts and women, the movie reflects Chaplin's worries about his audience, his marriage, society. Almost every aspect of Chaplin's life is represented in this motion picture. Just the tittle evokes his theatrical debut, in the late XIXth Century, Calvero is just a variation of Chaplin's eternal character, The Little Tramp, the story of Therry is the same as his mother (her sister also prostituted to make a living), and it goes on... There will be no movie that'll make me laugh and cry as much as Limelight. I consider it as the last Chaplin film. Enjoy the gag between Chaplin and Buster Keaton, long-time rival in the silent-film era, and the marvelous original score composed by Chaplin himself. Limelight is a perfect, brilliant, touching movie that'll make you know the person that hid 30 years under the Little Tramp character: a great artist and unique man called Charles Spencer Chaplin.",
         "Charles Chaplin is, at least for me, the best film maker of all time. And Limelight is his best film. It is one of the 10 films I have given 100/100. The film is about this old comedian who can't find himself a job. He saves a young girl who tried to commit suicide. Well, they become friends and stuff. Simply the film is perfect. There is nothing bad I could say about it. Well, maybe the ballet scene was too long (but maybe I just can't concentrate enough). The script, the music, the actors, the whole philosophical structure of the film! They are all perfect. And the end of the film is something so beautiful that you really have to see it. If there is one thing you have to see, make sure it'll be Chaplin's Limelight!",
         "Even for a fellow well-versed in Chaplin's sound films, 'Limelight' proved an odd viewing experience upon my perusal of it. Following on from 'The Great Dictator' and 'Monsieur Verdoux', Chaplin eschews his physical comedy for the most part, preferring to address 'big themes' and important issues. 'The Great Dictator', quite obviously tackles fascism and the demagoguery of a dictator: indeed pretty pertinent in 1940. 'Verdoux' is an interesting one-off in its inherent darkness; the material, concerning a mannered serial killer, is treated with more sobriety and a blacker touch than had hence been the case with Chaplin's films. There is a startling effectiveness to the last reels of that film, with Chaplin's theme of society forming the individual's behaviour being emphatically and eerily conveyed by his well-spoken character. 'Limelight' focuses on the gold mine that is Chaplin's career and the decline of his sort of comedy. It should be got out of the way first, that considering the possibilities this stirs in the mind, the result will likely disappoint. But that does not affect my view that this is a very interesting film and broadly a successful entertainment. It could be argued that 'The Great Dictator' is a finer insight into Chaplin's art; the masterful pantomime is more vividly on show, and is Hitler is not especially the evil figure we know him to be, but more the manipulative, balletic Chaplin, commanding our attention. 'Limelight' seems not to succeed in being a summation of Chaplin's career; perhaps as it distinctly lacks the raison d'être of his visual comedy. Okay, perhaps Calvero is a character based partly on other faded stars from the music hall tradition, but we are not convinced that this is quite the same Chaplin. Of course, this is bound to be the case: this is sound cinema, nearly twenty years after the tramp's final sunset-bound trot. But, here Chaplin's character talks incessantly and unrepentantly: quite the conversion for the silent clown. Unlike Laurel and Hardy, the adjustment to sound was never made in his original screen persona, so this truly will seem a different Chaplin to viewers. He pontificates in a somewhat lofty, generally admirable fashion; but it is the speech of a mannered, delicate, sentimental old English gentleman, and not a clown or philosopher. There are times his dialogue wades in some very interesting waters - such as that regarding his views on audiences and the rigors of performance - but often, too little of worth is said with too many words, in an overweening, self-satisfied manner. Where the film really succeeds is in the way Chaplin does take on a sort of tragic grandeur towards the close - or more rightly a rather sad grace; a man out of time and out of sympathy with most the world has to offer. It seems he was lucky to obtain the services of Claire Bloom to play the ballerina, Tereza, as she invests a crucial part with genuine feeling and warm brittleness - a good contrast with Chaplin's slightly wearing charm and ghostly drifting through the film. His contribution in bringing Bloom to the screen is to be appreciated, as she went on to a most impressive career in many mediums. Indeed, Bloom is rather histrionic at times, but at least it adds some genuine zest to proceedings. That she carries off this role, that from the evidence we see, is so unlikely \u0096 a young girl completely in the thrall of a curiously cold and verbose old man \u0096 is a testament to her skill. She really conveys more of Chaplin's appeal than is perhaps warranted by what occurs in the film. Touches like the visual flashbacks of Neville and Tereza's unspoken romance during her voice-over, narrating the story, really help the film. As do the inclusion of performance sequences early on, which are revealed to be in Calvero's subconscious. The second of those rather amused me, seeming atypically Chaplin in its bantering wordplay and slightly otherworldly air. The performing fleas routine is hardly vintage Chaplin (but pray remember, Calvero is a purely music hall performer, of pre-WW1 days) in its invention, but it is very precisely performed. I loved the little bits implying a wider tapestry: the drunken musical recitations by Calvero and a few friends in his flat, the reminiscing in a bar. It may not be a picture focused on the details of London life in the era, but tantalizing glimpses are given. It is charming to see faces of old Hollywood, albeit briefly in this picture, that is so dominated by Chaplin's self-regard. Nigel Bruce is a splendid presence as \u0096 you've guessed it \u0096 a doddering, hapless old buffer with heart certainly in the desired place and dander constantly up. Buster Keaton adds some much needed comedic timing and experience to the film with his late appearance, performing with Chaplin in a decent final routine. He really outshines Chaplin, and it is a shame more isn't seen of his droll presence, far more tangible and concrete than the curiously elusive Chaplin is here. Whatever one's thoughts on the film's comedy, it must be recognized that this is more of a winsome, self-absorbed melodrama than it is anything like a comedy. That it works is surely down to the strange historical interest of the film and its undeniable melancholic resonance. This is a Chaplin at the end of his tether, seemingly unwilling or unable to go back to being a comedian. The film is sad, invested with a grand decay and propped up by perhaps a more \u0091real' Chaplin than was ever seen in his days of silence. It simply should not work \u0096 it is a portrait over-egged to some degree - but this is somehow remarkably compelling stuff. The picture all the more mourns what isn't there. Rating: - *** ½/*****"
      ],
      "genres": [
         "Drama",
         "Music"
      ],
      "productionCompanies": ["Celebrated Productions"],
      "summaries": [
         "Chaplin's final American film tells the story of a fading music hall comedian's effort to help a despondent ballet dancer learn both to walk and feel confident about life again. The highlight of the film is the classic duet with Chaplin's only real artistic film comedy rival, Buster Keaton.",
         "It's 1914 London. Smelling gas, a man named Calvero breaks down the door of an apartment in the building where he lives finding a young woman trying to commit suicide. She is Thereza 'Terry' Ambrose, a ballerina. On advice from the attending physician, Calvero decides not to report it to the police as attempted suicide is a criminal offense. As Terry is evicted from her apartment, Calvero allows her to stay with him for as long as she needs. As he nurses her back to physical health, he also deals with her emotional health and uncovering the reason for her attempted suicide. Although he is constantly telling her that life is worth living, he can understand the pressures and guilt she has faced in her life, as he himself is an ex-performer, a once famous stage comedian whose professional name was ruined by excessive alcohol consumption. He is trying to revive his professional career. They become each other's emotional support as they try to make it in the world of the performing arts, for Calvero the second time around. Through it all, Calvero tries to show Terry the difference between devotion and romantic love, especially as an old admirer of hers named Neville re-enters her life.",
         "In 1914, in London, the formerly successful and presently decadent and alcoholic clown Calvero smells gas in the building where he lives and breaks in an apartment. He finds the suicidal Thereza 'Terry' Ambrose laying down on her bed and he brings a doctor that saves her. They do not report to the police and Calvero nurses her in his apartment. He learns that Terry was a ballet dancer that had a problem in her legs that are paralyzed. However, the doctor tells to Calvero that she has not a physical, but actually a psychological problem with her legs. He emotionally supports her and she recovers her health and becomes a successful ballerina. Meanwhile Calvero is also affected by Terry and quits drinking. Calvero tries to rebuild his career in the show business and while Terry falls in love with him but age must pass as youth enters.",
         "A fading comedian and a suicidally despondent ballet dancer must look to each other to find meaning and hope in their lives."
      ],
      "budget": 0
   },
   "movielensId": 3559,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1952-10-31",
      "dvdReleaseDate": "2003-07-01",
      "directors": ["Charlie Chaplin"],
      "runtime": 137,
      "movieId": 3559,
      "title": "Limelight",
      "mpaa": "G",
      "actors": [
         "Charlie Chaplin",
         "Claire Bloom",
         "Nigel Bruce",
         "Buster Keaton",
         "Sydney Chaplin",
         "Norman Lloyd",
         "Andre Eglevsky",
         "Marjorie Bennett",
         "Melissa Hayden",
         "Wheeler Dryden",
         "Barry Bernard",
         "Stapleton Kent",
         "Mollie Glessing",
         "'Snub' Pollard",
         "Geraldine Chaplin",
         "Oona Chaplin",
         "Edna Purviance",
         "Colin Kenny"
      ],
      "imdbMovieId": "0044837",
      "originalTitle": "Limelight",
      "genres": [
         "Drama",
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": [
         "VzSazG1DI_g",
         "mme-SQcu8YE",
         "VDsK_nAlY-A",
         "K_cNIx5CrhA"
      ],
      "plotSummary": "A fading music hall comedian tries to help a despondent ballet dancer learn to walk and to again feel confident about life.",
      "tmdbMovieId": 28971,
      "avgRating": 3.7449,
      "releaseYear": "1952",
      "numRatings": 392,
      "posterPath": "/xOA7iatMwNAS82XUCPTZVY4Y90R.jpg"
   }
}