{
   "tmdb": {
      "original_language": "ja",
      "keywords": [
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "regret",
            "id": 802
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "revenge",
            "id": 9748
         },
         {
            "name": "unfaithfulness",
            "id": 11510
         },
         {
            "name": "ghost",
            "id": 162846
         }
      ],
      "imdb_id": "tt0077132",
      "video": false,
      "title": "Empire of Passion",
      "recommendations": [
         110391,
         10834,
         84944,
         90228,
         187864,
         117239,
         102514,
         107035,
         42144,
         198835,
         110771,
         117478,
         121461,
         101330,
         21967,
         227245,
         84508,
         50173,
         31104,
         51429
      ],
      "backdrop_path": "/5HSStKtOGoRltFf8kJ6DIB6rgoF.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "talisencrw",
         "id": "569850db925141253a001359",
         "content": "I am a great fan of Ôshima's work, though unfortunately I have only seen previously six films of his, all between 1965's 'Pleasures of the Flesh' and 1976's extremely controversial 'In the Realm of the Senses'. This, like the latter, was a period piece that looked at a doomed relationship (this time in 1895), though far less scandalous in its sexuality, though still titillating nevertheless. Exiled and forced to work with the French in order to continue his passion, Ôshima's storytelling, through Yoshio Miyajima's gorgeous camerawork and another exemplary soundtrack by Japanese scoring genius, Tôru Takemitsu, and remarkably passion-ate performances by its stars, Tatsuya Fuji (who separated his shoulder, his acting was so intense) and Kazuko Yoshiyuki (who, I must admit, has the most amazing nipples I have ever seen), was great, earning him Best Director at Cannes. It seemed a reverse noir, with Fuji's Toyoji playing the seducer, and Yoshiuki's once-faithful wife being persuaded to be co-conspirator to her loving (but not fulfilling her desires) rickshaw-driver husband, not to mention a fine ghost story, with Gisaburo's very patient ghost taking three years to finally bring himself justice, by forcing the community to press the horribly-incompetent (almost as inept as Doug McGrath's Sergeant Nash in the original 'Black Christmas'!) Inspector Hotta to eventually torture confessions out of the ill-fated duo. Another film to see with the person you love!...",
         "url": "https://www.themoviedb.org/review/569850db925141253a001359"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Toyoji",
               "gender": 2,
               "credit_id": "52fe4786c3a36847f813a6bd",
               "name": "Tatsuya Fuji",
               "profile_path": "/mg36iyg1mB0bEK6OGOX1Dfg9TxA.jpg",
               "id": 21503,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Seki",
               "gender": 0,
               "credit_id": "52fe4786c3a36847f813a6c1",
               "name": "Kazuko Yoshiyuki",
               "profile_path": "/wPsmZqTuO2rk0RdO8kYbxkD90By.jpg",
               "id": 36074,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Gisaburo",
               "gender": 0,
               "credit_id": "52fe4786c3a36847f813a6c5",
               "name": "Takahiro Tamura",
               "profile_path": null,
               "id": 118989,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Inspector Hotta",
               "gender": 2,
               "credit_id": "52fe4786c3a36847f813a6c9",
               "name": "Takuzô Kawatani",
               "profile_path": "/yq2JaA1mqgFO0w82EtUZpUfrmlH.jpg",
               "id": 227628,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4786c3a36847f813a6f7",
               "name": "Akiyoshi Fujiwara",
               "profile_path": null,
               "id": 552310,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Oshin",
               "gender": 0,
               "credit_id": "52fe4786c3a36847f813a6fb",
               "name": "Masami Hasegawa",
               "profile_path": null,
               "id": 552311,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4786c3a36847f813a6ff",
               "name": "Kenzô Kawarasaki",
               "profile_path": null,
               "id": 552312,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4786c3a36847f813a703",
               "name": "Tatsuya Kimura",
               "profile_path": null,
               "id": 552313,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4786c3a36847f813a707",
               "name": "Eizô Kitamura",
               "profile_path": null,
               "id": 552314,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Mother of Landowner",
               "gender": 1,
               "credit_id": "52fe4786c3a36847f813a70b",
               "name": "Akiko Koyama",
               "profile_path": null,
               "id": 552315,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Dancer",
               "gender": 0,
               "credit_id": "52fe4786c3a36847f813a70f",
               "name": "Osugi",
               "profile_path": null,
               "id": 552316,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Odame",
               "gender": 0,
               "credit_id": "52fe4786c3a36847f813a713",
               "name": "Sumie Sasaki",
               "profile_path": null,
               "id": 142490,
               "order": 11
            },
            {
               "cast_id": 22,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4786c3a36847f813a717",
               "name": "Takaaki Sugiura",
               "profile_path": null,
               "id": 552317,
               "order": 12
            },
            {
               "cast_id": 23,
               "character": "Toichiro",
               "gender": 2,
               "credit_id": "52fe4786c3a36847f813a71b",
               "name": "Taiji Tonoyama",
               "profile_path": "/o3YTph69XZqKeZOerzUpTTAYirW.jpg",
               "id": 33732,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4786c3a36847f813a6b3",
               "name": "Nagisa Ōshima",
               "profile_path": "/4ipOYgv1UB99mvob5WDmIbaxdMV.jpg",
               "id": 46230,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4786c3a36847f813a6b9",
               "name": "Itoko Namura",
               "profile_path": null,
               "id": 234405,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4786c3a36847f813a6cf",
               "name": "Nagisa Ōshima",
               "profile_path": "/4ipOYgv1UB99mvob5WDmIbaxdMV.jpg",
               "id": 46230,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4786c3a36847f813a6d5",
               "name": "Anatole Dauman",
               "profile_path": null,
               "id": 2304,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4786c3a36847f813a6db",
               "name": "Shigeru Wakatsuki",
               "profile_path": null,
               "id": 552307,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4786c3a36847f813a6e1",
               "name": "Toru Takemitsu",
               "profile_path": "/zarE9jriPIK3UnK52ySb2UeUJ6O.jpg",
               "id": 51808,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4786c3a36847f813a6e7",
               "name": "Yoshio Miyajima",
               "profile_path": null,
               "id": 552308,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4786c3a36847f813a6ed",
               "name": "Keiichi Uraoka",
               "profile_path": null,
               "id": 46238,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4786c3a36847f813a6f3",
               "name": "Tetsuo Yasuda",
               "profile_path": null,
               "id": 552309,
               "department": "Crew",
               "job": "Sound Recordist"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.774729,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "JP",
            "name": "Japan"
         }
      ],
      "id": 49096,
      "vote_count": 23,
      "budget": 0,
      "overview": "A young man has an affair with an older woman. He is very jealous of her husband and decides that they should kill him. One night, after the husband had plenty of sake to drink and was in bed, they strangle him and dump his body down a well. To avert any suspicions, she pretends her husband has gone off to Tokyo to work. For three years the wife and her lover secretly see each other. Finally, suspicions become very strong and people begin to gossip. To make matters worse, her husband's ghost begins to haunt her and the law arrives to investigate her husband's disappearance.",
      "similar": [
         979,
         281957,
         226,
         3134,
         357096,
         9093,
         2149,
         1433,
         11826,
         6075,
         4771,
         238636,
         281,
         339692,
         395834,
         12619,
         11121,
         89728,
         9946,
         19053
      ],
      "original_title": "Ai No Borei",
      "runtime": 105,
      "poster_path": "/aVgYj2S9qFWkkS29NE39S7kSei0.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Toho-Towa",
            "id": 657,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Argos Films",
            "id": 6116,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Oshima Productions",
            "id": 13139,
            "origin_country": ""
         }
      ],
      "release_date": "1978-01-01",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Nagisa Ôshima"],
      "runtime": 105,
      "synopsis": null,
      "writers": [
         "Itoko Nakamura",
         "Nagisa Ôshima"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0077132/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgxNjI2OTY5OF5BMl5BanBnXkFtZTcwNDIyMjk1Mg@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Tatsuya Fuji, Kazuko Yoshiyuki, Takahiro Tamura | See full cast and crew »"],
      "reviews": [
         "Eros and Thanatos, Love and Death command the dialectics of Life. By the end of 19th century in a remote Japanese village a young man and a married woman, older than he, fall in love with each other and decide to kill her husband to be free to enjoy their love. But they never enjoy that freedom since Remorse begins to haunt them beginning as usual at the time by the weakest member of the couple, the woman of course. Henceforth in an atmosphere where dream (nightmare) mixes up with reality the ghost of the murdered husband appears first to the woman but then also to the man. It also haunts the dreams of the other villagers creating a climate of suspicion and gossip around the couple which is aggravated by the arrival of a police officer that comes to investigate the disappearance of the murdered husband. But which makes this movie more interesting besides this almost common story of adultery is the evolution of the couple's feelings in a Shakespearean deep psychological and dramatic development of remorse, anguish and fear which turns their love relationship into a nightmare until their final doom. The expressionism so dear to Japanese theatre or movie acting is also present in the players' performances but not in an exaggerated form. Just only in the necessary measure to show more effectively the most deep feelings of the depicted characters. This is indeed a solid good movie.",
         "In 1895, in a small village in Japan, the wife of the litter carrier Gisaburo (Takahiro Tamura), Seki (Kazuko Yoshiyuki), has an affair with a man twenty-six years younger, Toyiji (Tatsuya Fuji). Toyiji becomes jealous of Gisaburo and plots with Seki to kill him. They strangle Gisaburo and dump his body inside a well in the woods, and Seki tells the locals that Gisaburo moved to Tokyo to work. Three years later, the locals gossip about the fate of Gisaburo, and Seki is haunted by his ghost. The situation becomes unbearable to Seki and Toyiji when a police authority comes to the village to investigate the disappearance of Gisaburo. \"Ai no Borei\" is a surreal and supernatural love story. The remorse and the guilty complex of Seki make her see the ghost of her murdered husband, spoiling the perfect plot of her lover. The cinematography is jeopardized by the quality of the VHS released in Brazil, but there are very beautiful scenes, inclusive \"Ringu\" and the American remake \"The Ring\" use the view of the well from inside in the same angle. The performances and direction are excellent making \"Ai no Borei\" a great movie. My vote is eight. Title (Brazil): \"O Império da Paixão\" (\"The Empire of Passion\")",
         "Empire of Passion is Nagisa Oshima's follow up to his infamous 1976 film In the Realm of the Senses. Based on a novel by Itoko Namura, Empire details the love affair between a young soldier and an older woman. Toyoji is becoming more and more obsessed with Seki, the wife of a rickshaw jockey. He begins by bringing her little treats and having tea with her while her husband is at work, then eventually works his way up to raping her. Of course, seeing as this is a Japanese film, Seki ends up enjoying the rape and falls head over heels for Toyoji. The only problem facing the newfound couple's domestic bliss is Seki's husband, Gisaburo. Fortunately, Toyoji thinks of a solution - homicide. So the pair hatch a plan wherein Seki will ply her husband with sake, then when he is well and truly sloshed, Toyoji will pop in for a drive-by strangulation, thus leaving the two in peace. Everything goes according to plan and the couple dump Gisaburo's body in a disused well. Now they are free to live happily ever after\u0085 or are they? When the village-people begin to gossip about Gisaburo's death and his ghost starts appearing to Seki, her daughter and random townsfolk in their dreams and, finally, reality, Seki and Toyoji begin to get a little worried. Intertwined with the doomed lovers scenario is a traditional Japanese ghost story. Gisaburo returns as a vengeful ghost and harasses Seki while having her serve him sake and gives her a ride in his rickshaw, but in the end gets his retribution. Empire of Passion is an entirely different film than In the Realm of the Senses, for one it has none of the explicit sex, perverse fetishes or indeed the powerful emotional pull that Senses has (no penis-lopping here folks). It's true that both films portray fanatical love affairs and show the lengths two people bloated with love can go to but they do it in two completely different ways. In contrast to In the Realm of the Senses, which had an obsessive/possessive female lead, Empire of Passion has a young male playing the role of the infatuated lover. But once Toyoji conquers Seki and has her all to himself he begins to loose interest and she becomes the insecure one. The couple of sex scenes that are shown are not shot from an intimate, candid angle like Senses but more from a voyeur's point-of-view. All in all Empire of Passion is a decent portrayal of illicit love set against the gorgeous backdrop of the Japanese forest. See this if you have a fondness for arty love stories and/or vengeful ghost tales.",
         "This is a film by Oshima, the director of the notorious \"In The Realm Of The Senses\", a film so sexually brazed and unabashedly controversial it was banned for a while. This film takes place initially in 1895 in Japan and stars the very pretty Keziko Yoshiyuki as Seki, the wife of a rickshaw driver who falls for a much younger man who woos her in kind. That man, Toyoji, comes to her as she was sleeping and seduces her, though she soon is rather willing to be seduced. Soon they are having an affair and plot to kill Seki's husband, to be together forever. They do, and throw him down a well. However, they didn't count on the ghost of the dead husband haunting Seki and others in the village! This film is visually very stunning, the use of shadows highlighting this tale of murder for passion. Ms. Yoshiyuki (who is still active as an actress) is especially very good in her role. Its sexual at times, but not like \"In The Realm Of The Senses\". Some of what ensues is up to our imagination. I found this film to have a consistency of mood that makes it very watchable. A little creepy but that goes with the territory. I'd recommend this.",
         "A genuinely creepy ghost story, full of chills and sensuality, this movie just falls short of what it promises. It is apparently based on an old ghost story, and perhaps relies a little too much on a simple premise. For most of the way, its imaginative and genuinely gripping, but at the end its almost like Oshima just lost interest in it, and brought it to a rapid ending. The story is simple - a woman and her younger lover kill her husband so that they can be together. But their failure of nerve and his returning ghost condemn them to madness. Its beautifully handled, with imaginative set scenes, and the lovers passion is portrayed beautifully. But too often the movie fails to really deliver on its promise, almost as if Oshima loses his nerve in the same way the lovers do. Its a worthwhile movie to watch just to see how Oshima combines his great skill as a film maker with some exploitation movie tricks to pull the audience along, but sadly its not a true classic in the mold of movies like Onibaba or Woman of the Dunes.",
         "People usually think of \"In the Realm of the Senses\" when they hear Oshima's named mentioned. That film's graphic, semi-pornographic erotic scenes overshadowed director Nagisa Oshima's talents as a film maker. I believe his \"Empire of Passion\" is a superior film to that 1976 production, in many ways. Here we have a beautiful, and impeccably filmed 'ghost story' that truly succeeds in being \"haunting.\" When the rick-shaw driver returns from the dead, after his wife and her corrupt young lover have murdered him, it is truly chilling. And this film succeeds at being very erotically charged, without explicit sex included. as in Oshima's earlier film, the illicit lovers seem to be obsessively, frantically addicted to each other sexually. Their couplings are feverish, even when things start to turn very dark in their lives. As in earlier works, the two main characters seem to have no control over their sexual appetites, and danger and violence only escalate their desire. \"Empire of Passion\" is masterfully filmed; the scenes in the mysterious forest with sunlight filtering through the branches overhead, or amidst pounding rain storms and mist-shrouded country roads, every frame of \"Empire of Passion\" is beautiful and carefully filmed. The scenes of the well are especially haunting and mysterious as the story draws to it's unhappy conclusion. A feeling of bitter hopelessness permeates every frame, and there isn't really anyone to sympathise with. Everyone seems so selfish and corrupt, except for the woman's young daughter, who is caught up in her mother's treachery. It's unfortunate that this film didn't get much attention, as people were most likely expecting another shock film like \"In the realm of the senses.\" This one must have looked quite tame compared to that film, but i do believe this to be the superior of the two. I am looking forward to seeing earlier films from Nagisa Oshima.",
         "... and I know nothing about Japan or Japanese cinema. I just accidentally tuned in to this one close to its beginning at 4AM, expecting to be bored. Instead it discreetly pulled me in by its not so discreet plot and acting. The synopsis says that it is about a younger man having an affair with an older woman. However, the woman (Seki) does not look to be that much older than the young man, Toyoji. Seki's husband is a rather dull rickshaw driver, and Toyoji's giving Seki the romantic attention that her husband Gisaburo does not. However Gisaburo loves Seki, just in his own understated way. Where things get a little strange is in Toyoji's point of view. First he insists on \"shaving\" Seki, then he insists that because he has done this Gisaburo will know about the affair and they must therefore murder Gisaburo. Seki, just as passive as her husband, agrees and together they strangle Gisaburo and throw him down an old well. Here's where things get even stranger, from a human nature standpoint - everyone in the community just accepts the fact that Gisaburo left town and does not come back - for three years. The only thing that arouses their suspicion is, after a three year absence, his ghost starts appearing to the townspeople asking for this and that - saying that he wants his pipe, new clothes etc. since he hasn't had any for so long. Odd that dreams arouse their suspicion when the hard evidence of a man you could set your watch by disappearing in thin air does not. Then Seki starts seeing Ginsburo's ghost. Ginsburo's ghost is corporal though - he can and does pull his rickshaw around, drink, and smoke just as he did in life. The one person the ghost does not appear to is Toyoji, so as Seki slowly starts to emotionally unravel, Toyoji just thinks its guilt and panic eating at her and is not very sympathetic towards her. Finally there is the brutality of the police that is quite a shock. The detective investigating Ginsburo's disappearance keeps telling the townspeople that he can't arrest anyone without proof, but when he does the accepted protocol of interrogation is to hang the suspect by a tree in public and cane them until they confess. Why bother with an investigation if torture is the next step after an arrest? You could get a confession out of anybody this way. The whole thing has a very surreal quality, a story with universal themes but some odd behavior I just chalk up either to directorial style or cultural differences or maybe both, and some beautiful shots of the Japanese countryside, which is sometimes easily overlooked in the face of this very strange but engaging tale.",
         "Empire of Passion starts out deceptively - that is, if you're immediately expecting it to be a horror movie. It's like a riff on James M. Cain's The Postman Always Rings Twice, at first: Seki (Kazuko Yoshiyuki) is a mother of two and a dutiful, hard-working wife to rickshaw driver Gisaburo (Takahiro Tamura). But when he's not around, and she's at home with the baby, the feisty and aimless young man Toyoji (Tatsuya Fuji) comes around to bring some goodies for Seki... and a little extra. They're soon sleeping together, but after he does something to her (let's just say a \"shave\"), he knows that he'll find out, and immediately proposes that they kill Gisaburo. They drink him up, strangle him, and then toss him down a well. Naturally, this will come back to haunt them - but that it's literally, at least to them (at first super-terrified Seki and then only later on skeptical Toyoji), changes gears into the 'Kaidan', a Japanese ghost story. This is a film where the horror comes not simply out of \"oh, ghost, ah\", but out of the total dread that builds for the characters. In a way there's the mechanics of a film-noir at work throughout, if only loosely translated by way of a 19th century Japanese village as opposed to an American city or small town (i.e. the snooping cop, the \"evidence\" found possibly by another, word getting around, suspicions aroused, etc). It's compelling because Seiko actually was against the plan from the start, manipulated by the lustful but ill-prepared Toyoji, and her reactions to Gisaburo's re-appearances are staggering to her. Take the one that comes closest to poetry: Gisaburo's ghost, pale-blue face and mostly silent, chilling stare, motions for Seiko to get on the rickshaw. She does, reluctantly, and he pushes her around on a road she doesn't know, in the wee hours before dawn, surrounded by smoke. Most Japanese ghost stories wish to heavens they could get this harrowingly atmospheric. While it starts to veer into hysterics towards the end, there's so much here that director Oshima gets right in making this a distinctive work. After hitting it huge in the international cinema world with In the Realm of the Senses (which, ironically, got banned in his own country), he made something that, he claimed, was even *more* daring that 'Senses'. Maybe he was right; Empire of Passion has less graphic sexual content by far than its predecessor (also starring Tatsuya Fuji, a magnificently physical actor with an immense lot of range), but its daring lies in crafting a world of dread. You can believe in ghosts in this story, but you also have to believe how far down to their own personal hells these two would-be lovebirds will go. The snooping detective or the gossiping townspeople are the least of their worries: the fate of their very souls is at stake. And Oshima takes what in other hands could be merely juicy pulp (sadly, it wouldn't surprise me if an American remake was already in the works) and crafts shot after gorgeous shot, with repetition working its way into the mis-en-scene (i.e. the shots of Seiko and Toyoji walking on that road, the camera at a dutch angle, the world tilted and surrounding them in a grim blue hue) as well as some affecting movements that will stay with me long after I finish typing this (i.e. Toyoji throwing the leaves by one hand into the well in slow motion, or how Seiko's nude body is revealed after she becomes blind). It's daring lies in connecting on a level of the spirit- not to be confused with the spiritual, though there may be something with that as well- about life and death's connections to one another, inextricably. It's a classic waiting to be discovered.",
         "I'm not sure if I qualify for commenting on this movie. I'm on and off impressed with director Nagisa Ooshima's movies. I'm not from the generation when he was at the zenith of his career, and I can't comment on how much of a shock value his movies had in the '60s and '70s. The movie is beautiful. One thing I can say about director Ooshima is the perfection of beauty of his visuals. The story seems rather prosaic now after 35 years since it was made. It's a simple story about a murder based on an affair. How unusual is that ? I was counting on Ooshima's sharpness at making a point from his unique perspective as a director, and a story teller. I couldn't find that here, and is my point of disappointment. The movie is rather ordinary Japanese movie from the '70s. It's got stunningly beautiful visuals compared to movies other directors made around the same period (see for instance \"Inugami no Tatari\" that takes place in a similar setting and you'll see how great Nagisa Ooshima's visual presentation is), but the story and the acting is rather average. I also couldn't feel the outstanding \"speed\" that I usually feel when watching his better movies. So I'm only commenting from the 21st century perspective on this movie, and may not at all be fair to the movie or the director. But it's a good movie that's mildly interesting to watch, with absolutely first class cinematography. You would have to see this yourself, and be the judge of its value.",
         "***SPOILERS*** ***SPOILERS*** First, let me state that I am a huge film buff, but unfortunately somewhat new to Japanese films. I also want to clarify something that seemed unclear in previous reviews I've read here. The English title \"In the Realm of Passion\" appears to be truly an exploitive maneuver (probably by the director or studio executive) to lure the viewer into thinking that this is somehow related to \"In The Realm of the Senses\". It has nothing in common except that it's set in feudal japan, the plot involves a scandalous affair, starring the same leading male actor, and it's directed by the same director. the story and characters are not directly related in any way. I expected tons of steamy sex scenes, possibly involving the \"in the..senses\" characters.This is not that kind of movie.That having been said, I still liked it, and found it to be very haunting and disturbing at times. BIG-TIME SPOILERS AHEAD In a nutshell, the story involves a boring, ignorant, (but diligent) husband who who goes about his daily business of providing for his family, which includes 2 children and a wife-who happens to be having an affair with a much younger man. Together their foolish passions ignite a ridiculous plot to kill her husband, after she gets him drunk on saki. They dump his body in a well and try to live their life as though nothing had happen. It isn't long before the village starts to doubt the wife's story about her husband being \"out of town\". Shortly after his death, the slain husband appears as a desolate, confused ghost, which tortures the now going insane wife. Soon an inspector arrives and probes deeper into the lover's tangled web...SPOILER END Even though the story is somewhat of a cliché, I feel it hasn't really dated. I found the tale truly creepy, and to me gave me a unique window into life in feudal Japan. I felt the undertone of a silent thriller, that would lead up to jagged little moments of shock, and suspense. I was slightly annoyed by the lead actress's \"whiny\" nature but thought, overall, everyone pulled it off. An interesting movie, that quietly grabs you, and slowly pulls you in. This may sound bizarre, but I kept feeling the same creepiness of \"the Ring\" (\"Ringu\") The well scene, themes of the undead, the ominous forest were all themes in comon with that thriller. Check it out."
      ],
      "genres": [
         "Drama",
         "Horror",
         "Romance"
      ],
      "productionCompanies": [
         "Argos Films",
         "Oshima Productions",
         "Toho-Towa"
      ],
      "summaries": [
         "A young man has an affair with an older woman. He is very jealous of her husband and decides that they should kill him. One night, after the husband had plenty of sake to drink and was in bed, they strangle him and dump his body down a well. To avert any suspicions, she pretends her husband has gone off to Tokyo to work. For three years the wife and her lover secretly see each other. Finally, suspicions become very strong and people begin to gossip. To make matters worse, her husband's ghost begins to haunt her and the law arrives to investigate her husband's disappearance.",
         "In 1895, in a small village in Japan, the wife of the litter carrier Gisaburo (Takahiro Tamura), Seki (Kazuko Yoshiyuki), has an affair with a man twenty-six years younger, Toyiji (Tatsuya Fuji). Toyiji becomes jealous of Gisaburo and plots with Seki to kill him. They strangle Gisaburo and dump his body inside a well in the woods, and Seki tells the locals that Gisaburo moved to Tokyo to work. Three years later, the locals gossip about the fate of Gisaburo, and Seki is haunted by his ghost. The situation becomes unbearable to Seki and Toyiji when a police authority comes to the village to investigate the disappearance of Gisaburo."
      ],
      "budget": 0
   },
   "movielensId": 3560,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "1978-01-01",
      "dvdReleaseDate": "2000-04-11",
      "directors": ["Nagisa Ōshima"],
      "runtime": 105,
      "movieId": 3560,
      "title": "Empire of Passion",
      "mpaa": "",
      "actors": [
         "Tatsuya Fuji",
         "Kazuko Yoshiyuki",
         "Takahiro Tamura",
         "Takuzô Kawatani",
         "Akiyoshi Fujiwara",
         "Masami Hasegawa",
         "Kenzô Kawarasaki",
         "Tatsuya Kimura",
         "Eizo Kitamura",
         "Akiko Koyama",
         "Osugi",
         "Sumie Sasaki",
         "Takaaki Sugiura",
         "Taiji Tonoyama"
      ],
      "imdbMovieId": "0077132",
      "originalTitle": "Ai No Borei",
      "genres": [
         "Drama",
         "Horror",
         "Romance"
      ],
      "youtubeTrailerIds": ["4Ub1TTB8mRo"],
      "plotSummary": "A young man has an affair with an older woman. He is very jealous of her husband and decides that they should kill him. One night, after the husband had plenty of sake to drink and was in bed, they strangle him and dump his body down a well. To avert any suspicions, she pretends her husband has gone off to Tokyo to work. For three years the wife and her lover secretly see each other. Finally, suspicions become very strong and people begin to gossip. To make matters worse, her husband's ghost begins to haunt her and the law arrives to investigate her husband's disappearance.",
      "tmdbMovieId": 49096,
      "avgRating": 3.29592,
      "releaseYear": "1978",
      "numRatings": 49,
      "posterPath": "/aVgYj2S9qFWkkS29NE39S7kSei0.jpg"
   }
}