{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sibling relationship",
            "id": 380
         },
         {
            "name": "crow",
            "id": 4639
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "electric chair",
            "id": 11263
         },
         {
            "name": "scar",
            "id": 14767
         },
         {
            "name": "death",
            "id": 34079
         }
      ],
      "imdb_id": "tt0132910",
      "video": false,
      "title": "The Crow: Salvation",
      "recommendations": [
         16456,
         10546,
         41848,
         27771,
         27549,
         32304,
         55377,
         35945,
         33519,
         27770,
         26340,
         52263,
         41275,
         64170,
         36934,
         29901,
         10001,
         15039,
         168705,
         11342
      ],
      "backdrop_path": "/pYMUH9y0aZMjw0QWF9i0m6hn4IP.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Alex Corvis",
               "gender": 2,
               "credit_id": "52fe44f9c3a36847f80b5475",
               "name": "Eric Mabius",
               "profile_path": "/mfYqgYHkvJRgPus0kN2V1GhsFOU.jpg",
               "id": 11867,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Erin Randall",
               "gender": 1,
               "credit_id": "52fe44f9c3a36847f80b5479",
               "name": "Kirsten Dunst",
               "profile_path": "/hA5wdCWKbRi7vOZExgEuGxakLsA.jpg",
               "id": 205,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Nathan Randall",
               "gender": 2,
               "credit_id": "52fe44f9c3a36847f80b547d",
               "name": "William Atherton",
               "profile_path": "/ulUP6CRnC3F6XmD3NH0AMJpVmln.jpg",
               "id": 7676,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Lauren Randall",
               "gender": 1,
               "credit_id": "52fe44f9c3a36847f80b5481",
               "name": "Jodi Lyn O'Keefe",
               "profile_path": "/akyVB9tFIjoj3PnrMBRcvzU86k5.jpg",
               "id": 58006,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "The Captain",
               "gender": 2,
               "credit_id": "53d92ef7c3a3681ed9000375",
               "name": "Fred Ward",
               "profile_path": "/ybRDXraWsQ6zyqPUIAWITwuOWug.jpg",
               "id": 10430,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Brad",
               "gender": 2,
               "credit_id": "53d92f10c3a3681ed00002ed",
               "name": "K.C. Clyde",
               "profile_path": "/frp5cAHlYOFNpv7DS1spCrmxNyQ.jpg",
               "id": 33294,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Vincent Erlich",
               "gender": 2,
               "credit_id": "53d92f55c3a3681ed900037c",
               "name": "Dale Midkiff",
               "profile_path": "/pouqDASy9JUPlL46aKFUZBPs7ZL.jpg",
               "id": 56265,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Tommy Leonard",
               "gender": 2,
               "credit_id": "53d92f85c3a3681ee50002d8",
               "name": "David Stevens",
               "profile_path": null,
               "id": 75429,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Peter Walsh",
               "gender": 2,
               "credit_id": "53d92f9cc3a3681ed9000383",
               "name": "Grant Shaud",
               "profile_path": "/wyS4GIkFfrd7XuIY6pUqT2WWJe7.jpg",
               "id": 96595,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Phillip Dutton",
               "gender": 0,
               "credit_id": "53d92fb1c3a3681eee000369",
               "name": "Bill Mondy",
               "profile_path": "/kzuBv31CoC9kHfl3XYoPcleSJZm.jpg",
               "id": 83959,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Stan Roberts",
               "gender": 2,
               "credit_id": "53d92fcbc3a3681ed500033e",
               "name": "Walton Goggins",
               "profile_path": "/gA5nf2alzIPPjs1MSjS1PmrCedJ.jpg",
               "id": 27740,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Stacey",
               "gender": 0,
               "credit_id": "53d92fdfc3a3681ed9000388",
               "name": "Britt Leary",
               "profile_path": null,
               "id": 170837,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Martin Toomey",
               "gender": 2,
               "credit_id": "53d92ff3c3a3681eea0002b9",
               "name": "Tim DeKay",
               "profile_path": "/9ebjYjlBTZQvEvSwKLrs96Nrbzo.jpg",
               "id": 76001,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "Guard",
               "gender": 0,
               "credit_id": "577cd4e4c3a3684197001c8b",
               "name": "Don Shanks",
               "profile_path": "/tUUwp616WfWiDTMoZZ5h2A2PD4c.jpg",
               "id": 33299,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44f9c3a36847f80b5459",
               "name": "Bharat Nalluri",
               "profile_path": "/AvLMv25VSB23zPLCAMcs53oOuUm.jpg",
               "id": 58005,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f9c3a36847f80b545f",
               "name": "Chip Johannessen",
               "profile_path": null,
               "id": 42106,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f9c3a36847f80b5465",
               "name": "Edward R. Pressman",
               "profile_path": null,
               "id": 32035,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f9c3a36847f80b546b",
               "name": "Alessandro Camon",
               "profile_path": null,
               "id": 57561,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f9c3a36847f80b5471",
               "name": "Jeff Most",
               "profile_path": null,
               "id": 57707,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5a884c3e0e0a265453055cf6",
               "name": "Harvey Weinstein",
               "profile_path": "/jonLOgQIZPBn650kLcsKOPois7U.jpg",
               "id": 59839,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 7.765319,
      "production_countries": [
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 9456,
      "vote_count": 92,
      "budget": 10000000,
      "overview": "Alex Corvis returns to the world of the living to solve the murder of a young woman that he was wrongly accused of killing. Alex follows the crow into the police department's evidence room, where he discovers that Lauren was killed by a group of corrupt cops.",
      "similar": [
         298312,
         948,
         281957,
         452507,
         238636,
         9538,
         806,
         663,
         10029,
         11309,
         10054,
         341006,
         2142,
         8292,
         3134,
         29425,
         205,
         8810,
         319,
         185
      ],
      "original_title": "The Crow: Salvation",
      "runtime": 102,
      "poster_path": "/lD0Q8FYseQSBD9DKYuHeVdmSGwC.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/cXMoZ75Zu4EoA3fRADCLTDeXBk3.png",
            "name": "Dimension Films",
            "id": 7405,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Jeff Most Productions",
            "id": 4030,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Edward R. Pressman Film",
            "id": 6455,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "IMF Internationale Medien und Film GmbH & Co. Produktions KG",
            "id": 65403,
            "origin_country": ""
         }
      ],
      "release_date": "2000-10-31",
      "vote_average": 5,
      "belongs_to_collection": {
         "backdrop_path": "/xxJs7xqY0vMuNlznQboBzq8RlZm.jpg",
         "name": "The Crow Collection",
         "id": 9436,
         "poster_path": "/kfU8OZptlBfR5DL9LNGL301Zmlz.jpg"
      },
      "tagline": "For Vengeance, For Justice, For Love.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Germany",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Bharat Nalluri"],
      "runtime": 102,
      "synopsis": null,
      "writers": [
         "James O'Barr",
         "Chip Johannessen"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0132910/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc1Nzg2Nzc0OV5BMl5BanBnXkFtZTcwMzI5NDEyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Kirsten Dunst, Eric Mabius, Fred Ward | See full cast and crew »"],
      "reviews": [
         "\"The Crow: Salvation,\" the fourth installment in the popular series of murdered men brought back from the dead to avenge their deaths, is certainly a step in the right direction after the travesty of previous entries. The first Crow, which is best known for being the film in which Brandon Lee was killed (duh), is a cult classic directed by Alex \"Dark City\" Proyas, and even today, it is regarded as probably the greatest of the gothic/action/modern noir films. It's sequel, \"The Crow: City of Angels,\" starred Vincent Perez, and while it featured some nice ideas and beautiful images, it was nothing more but a poor remake of the first film lacking all the heart of the original. \"The Crow: Stairway to Heaven\" came next, and it was two episodes of the TV show of the same name re-edited into a motion picture and released as a sequel to the first film. Instead of being a remake in disguise as a sequel like \"City of Angels,\" \"Stairway\" goes ahead and just literally remakes the first film with the same characters, basically the same plotline, and none of the magic (though Mark Ducascos as the title character certainly demonstrates a type of charisma in his martial arts). Now comes \"The Crow: Salvation.\" Eric Mabius stars as Alex Corvez, who is wrongly executed for the murder of his girlfriend and returns from the dead to take out the real killers, with the help of his dead girlfriend's sister and a lawyer friend. As a sequel, it thankfully works because it has a premise completely different from the first film (something the other sequels failed to pull off) and it stands on its own, introducing its own magic and its own intruiging plot elements. It certainly is a good film and a good sequel, and while some points in the movie seem contrived, what film nowadays doesn't have at least a few obvious plot points? The bad: Much of the film is underdeveloped, especially many characters. While the plotline is good, it seems rushed much of the time, and the viewer has to draw their own conclusions about many things. Some of the dialogue is also atrocious. The good: Well well, there's much more of that. Eric Mabius as the central character shines throughtout. For the first time, we have a character in one of these movies *not* ripping off Brandon Lee, but instead, bringing his own qualities and characterizations to the character. The results are an effective performance that makes us forget about Lee altogether...at least until the film comes to a close. The plot, something of a murder mystery, would have made a good film even if it hadn't been a Crow film, and the images and notions presented only add to the appeal, especially with the character of the Crow itself, which at the beginning, acts as if this is just a routine thing to bring someone back to the dead, and that he's done it before. Later, however, it genuinely gets intruigued by Corvis' vendetta and begins aiding him more. All in all, this is certainly much more acceptable that previous entries, and it succeeds where the others failed: Introducing new elements into a Crow franchise that, so far, has been nothing more but rip offs of the first film. *** out of ****",
         "A wrongfully executed man named Alex(Eric Mabius), resurrected from the dead by the crow, returns with a vengeance to find the man with a scar on his arm that killed his beloved Lauren(Jodi Lyn O'Keefe). To find that man, Alex will first seek out the four men who falsely accused him on the witness stand which led to his death via electric chair. The crow will guide him on his journey to finding those responsible. Erin(Kirsten Dunst), Lauren's sister, and Peter Walsh(Grant Shaud;was Alex's attorney)are Alex's only allies in the search for retribution. Soon dirty cops are unmasked leading straight to the Captain(Fred Ward)and even Erin and Lauren's own father, Nathan(William Atherton). I like this film and think the reason it turns out better than I expected is due to the heart of the picture..one man's will to find the one's responsible for the death of his love. There is some strong talent in the cast for a direct-to-video feature and the young leads of Mabius and Dunst{..not to mention Ward, Atherton, Midkiff, and Shaud}bring much to this film. The film's budget is exceedingly lower, but I felt it makes up for it in keeping the plot simple instead of overloading us with an overkill of sick visuals. Now, that's not to say it doesn't lack punch and edge. There are some very gruesome moments indeed and much flesh is displayed, but the levels are down exceedingly. Plus, this film doesn't make out the perversion as beautiful, but with a disdain towards those young ones exploited{example being when Alex confronts the young girl tied to a pole in the strip club owned by the dirty cops}. The film doesn't speak highly for the cops on the force under the Captain. The world of this film isn't Gothic like the other two but just as corrupt. While the other two felt like they were set in a much darker time and place, this film feels closer to our time in modern society. That might turn some away who like the dark, noirish vision of the first two. But, I do feel the heart of the story is still here and the element of man's link with the crow is quite present here.",
         "The Crow: Salvation is a very good movie, not even close to being the masterpiece The Crow is but it's the best sequel you can ask for. There has been a lot of press about Salvation's release and I to am puzzled as to why it's basically direct to video, the producers blame Dimension and politics and yes Salvation is grim but I don't know how true that statement is. The Crow: Salvation is, in my opinion, the most violent of The Crow movies, some is over the top and some is pretty grim stuff but hey it's all good. Eric Mabius seemed a strange choice to some cause he doesn't have the look of what you think of as the typical Crow good guy BUT he is very good at what he does, ranging from fights to anger, sadness...all are touched upon and he delivers in all areas. Kirsten Dunst does good also, I don't think she was bad like some reviews have said, she does seem kinda off in some scenes (the graveyard comes to mind) but she does fine. It's hard to explain Fred Ward's character because it will give away plot details (which honestly isn't hard to figure out anyway) but he does well and has some funny lines also, Fred's been a cool actor for a long time playing in some quirky movies like Remo Williams, Tremors and it's sequel, and Cast A Deadly Spell. Jodie Lynn O'Keefe's role isn't big at all and she doesn't have much to do but she's beautiful and the scenes she has are effective and the scene where she and Mabius are playing around doing fake karate is cute and touching, actually that whole scene is one of my fave's especially when Alex is at her grave talking about wanting to be with her but he can't...it's really touching and sweet, yes to those confused that and the karate scene are the same...you'll understand when u see the movie. The look of Salvation is closer to part 1 than 2 was and yet it has a look all it's own, Salvation is grounded more in reality than the first 2 were but the city is still dark, gritty, and depressing, and the sets were cool...especially the execution chamber with the words on each wall. The rest of the cast does fine with what they have but it isn't much, they are all paper thin bad guys with few characteristics to distinguish differences between them other than the way they die. Which brings me back to the violence, no I don't have a problem with it and am not talking about it to warn you because violence in movies does NOT make people kill others (what movies did Hitler and Stalin watch). Yes Salvation is the most violent Crow and it's not all fun some scenes are closer to the violence in Taxi Driver than The Matrix. But we do get some cool scenes like when Alex shoots himself in the mouth and the camera goes through the mouth as the wound heals and also the scene where Alex and the Dale Midkiff character are in the car and hit a bus and both fly through the windshield but I kinda think The Crow: Salvation is a little brutal but it's all good. Credit must go to Bharat Nalluri for making a cool looking movie with pretty cool camera work and effects and also credit Marco Beltrami for making a really good score that doesn't ape Graeme Revell's but is something all it's own. The ending is really good also but I pretty much figured out who was the man with the scarred arm (which was cool but also too derivative of The Fugitive) but another cool thing was his room looked like it was out of Texas Chainsaw Massacre or the stuffing room in The Lost Boys, but anyway the end was cool how the bad guy manipulated Alex into thinking maybe he did kill Erin...it was weird. And the end credits play over the new Crow symbol like the credits played over the Batman symbol at the end of Batman Forever. Oh and to just throw it in here it was cool that the markings if Alex were scars and not the paint like in 2 (which had really no reason for it other than cause it was part 2). I'm sure some will give Salvation hell because The Crow is so sacred to them but I say let the series live on and not die. Brandon Lee did give a truely great performance in The Crow and it's a tragedy that he died but I will not hold that against Salvation or City of Angels (which was kinda sucky). I do think Salvation could have been better with a little more money invested in it but that would be in the sets and scope department but then again I like Salvation a lot and Eric Mabius is a gifted actor (for further proof see Black Circle Boys). I hope to see more of Bharat Nalluri and hope he doesn't drop of the face of the earth like COA's director (Tim Pope what are u doing these days). The Crow was better yes because ALL of the characters were better drawn and Brandon's death which I'm not saying was good for the movie but did make the movie more of an emotional experience...it IS a masterpiece and no Salvation is no masterpiece but it is a great movie experience. You won't come away giddy (it is a Crow movie remember) but like part 1 you will come away thinking of Life, Love, and Death.",
         "Spoiler I would like to first off say, that the original 'Crow' movie is the best! And nothing will ever match up to it. I have seen all the movies and both the 1 & 3 are the best. 'City of Angles' had some good lines in it, but it sucked overall. The plot was no good and it was hard to follow at times. 'Salvation' on the other hand, was a lot easier to follow and it made more since. In 'Salvation' Alex and his girlfriend, Lauren, are madly in love and can't wait to spend the rest of their lives together. But, sadly, Lauren's life is cut short when she is gang raped and stab to death. Alex is charged for her death and found guilty. He is executed by the electric chair. But it isn't before long before the crow comes by and brings Alex back to life. Alex, sets out to find the killers and bring them to justice. As Alex starts hunts them down one by one he slowly discovers that the local police had everything to do with Lauren's death. And Alex won't stop until he uncovers the truth. But,it only gets more complicated when Lauren's little sister gets caught in the line of fire. Some of the things I liked about the movie was how Alex played around with his killings. He didn't just simply kill the bad guys but he tortured them a little. I actually laughed a couple of times. My favorite line in the movie is when Alex says \"I want...to know why!?\" I get chills every time I hear that. 'Salvation' isn't all to bad but it surely beats 'City of Angles'. I like this movie and I recommend it to all Crow fans! ROCK ON!!! The Crow: Salvation 7/10",
         "No disrespect intended to the majority of Crow fans (I myself am one) who think that the first film and Brandon Lee's performance in it was unbeatable and way better than this film and Eric Mabius' performance. But I must disagree, and I'll also ask if all those Crow 1 / Brandon Lee fans would be so adamant that the first film and that actor were the best thing since sliced bread if Brandon hadn't tragically died at such young age. Truth is that I like The Crow : Salvation more than The Crow, and I find Eric Mabius to be a better actor and his character to be more charming than Brandon's personality. The fact that Brandon's character was half insane while Eric's was totally sane simply wasn't an advantage for Brandon. Not in my eyes, anyway. Don't get me wrong, I still like The Crow as a film and Brandon as an actor. They're what convinced me to see the two sequels, after all. But while Brandon Lee was definitely handsome, charming and a good martial artist, he just wasn't all that good an actor. I do believe that he had a very bright future ahead of him in Hollywood if his life hadn't been cut short, but it's the fact that he died at such a young age and before his career could've taken off that has given him such a legendary status among fans. On the other hand, I think that Mabius has all of Brandon's positive qualities (minus the great martial arts abilities, of course), and he's a good actor on top of that. That's what makes Salvation better than the original, even if Michael Wincott's villain in The Crow had a slightly better presence than Fred Ward's villain in Salvation. But everything about Salvation I loved \u0096 the acting, the dialogue, the plot, the violence (the execution scene and the break-out from prison were particularly well-done, fun and brutal at the same time), the soundtrack, and most of all, Eric Mabius himself. This guy simply owns the screen when the camera's pointed at him. I don't know why Dunst's name appears first, but that's an annoyance I will happily look past. It's clear that Mabius is the star of this film. The way he talks is delicious, ****SPOILER**** and he has tons of heart and rage when he addresses his friends (Dunst when she claimed she wanted to die) and adversaries (every villain he toyed with before killing them) and strangers (the drug-using stripper at the club whose age he asked before freeing her). Dunst herself isn't bad. Not a bad actress in her own right, though I doubt that's why she's got so many male fans. Her best scene was when she had informed Mabius that it was her information that had led the bad cops to his figurative door before his arrest/execution. And at least her character isn't a total damsel in distress as, while Ward's chief villain snatched her twice, it wasn't really her fault. The first time was because Mabius' friend distracted her before losing his own life, and the second time was because her gun only had one bullet in it. And considering that Ward's character is an experienced cop and she's a young civilian, it makes sense that he'll have sharper reflexes than her. Which isn't to say that this film's perfect. For one thing, it could've easily been twice as long so as to give more of a background to the villains (something that all three Crow films lack), and it was never explained how Fred Ward's character actually knew of the event which allowed Mabius to return from the dead, or why he was so obsessed with mutilating his own arm. The other villains, made up of the five corrupt officers under his command and his blonde secretary/lover, are cookie-cutter antagonists who show up only to harm innocents and then be beaten by the hero. And while I've seen Dale Midkiff and Bruce McCarthy in other films and I know them to be decent actors, they just don't have anything to do here besides being typical 1-dimentional villains (ie, needlessly violent, remorseless, having no positive aspects at all to them and good only when dead). But those small drawbacks aren't enough to take away from the genius that is Salvation. After seeing it, I only wish to smack Paul Anderson over the head for not including a character like Mabius' Alex Corvis in his Resident Evil films. As good an actor as Mabius is, he was totally wasted in RE, and he wasn't present at all in the sequel (which is a good thing for his career). But I can only wonder how the first mediocre film and the crap-filled sequel could've been improved if Alex Corvis had been around to tear off zombie heads in those two RE films. Too bad we'll never find out. Either way. To summarize, I own this film on DVD, and am very glad for it. 9.5/10.",
         "I love \"The Crow,\" and there's not much in my mind that could be done in a sequel to top it. \"Salvation,\" unlike \"City of Angels,\" doesn't try to top the first one, or rip it off... The characters are solid, the performances are great, and the action is non-stop. But what singles this movie out is the story. It's a good story, not just another \"Crow\" movie. The direction of the film reminds me of the first, very dark, yet crisp (not gritty like the 2nd), and the trick camera angles mixed with the impressive special effects keep the supernatural elements alive as the very human story rolls along. I work at a video store, and I see all kinds of movies that bypass theatres and come direct to video, and usually there's something about them that tells you why, even the good ones. This had the look and feel of something that, if released at the appropriate time, would have done well in the theatres. It wouldn't have been a smash hit, and it certainty wouldn't bring in as many people as the original did, but it deserves much better than this. If you're fans of the franchise, I highly recommend that you see this. If you like the first one, but that's it, then expand your horizons a little and try to see this for what it is, and not what you thought it would be. It's a sequel to a GREAT movie, and it ends up being a pretty good movie on it's own...",
         "Alex Corvis is sent to the electric chair, three years after being framed by crooked cops for his girlfriend, Lauren Randall's murder & on his 21st birthday too. When strapped to the chair, he continues to profess his innocence, claiming a man with a scarred arm did it. After his execution, he revives in the morgue, with death being unable to stop him. Once free, he hunts for the man who really killed Lauren, while taking out the crooked cops one by one, by viciously stabbing them each fifty three times with a knife, like they did to his girlfriend & leaving a symbol of the crow after each murder scene. Guided by the black crow, he finds that Lauren had uncovered some incriminating secrets about the cops, which called for her murder. Although it lacks the dark, gritty realism of the first & is not as colourful as the second, the best thing that can be said about THE CROW: SALVATION, is that its easily the best film in the series. It's much better than THE CROW: CITY OF ANGELS, despite being dropped direct to video. The acting is superb with FRED WARD deliciously evil as the lead bad guy & ERIC MABIUS filling the hero's shoes quiet nicely. Also a big plus is a pre-SPIDERMAN star KIRSTEN DUNST, who is really good in her role of the sister of Alex's murdered girlfriend, that joins Alex in an attempt to clear his name & get revenge on the perpetrators, as well as uncover what the cops were trying to keep secret. The directing is better & the story very engaging & although it tends to revel in B movie cheapness, the unnecessary, gratuitous nudity, explosions & a car chase, it never loses it's footing. Despite the fact that the film differs from the usual storyline of the series of an wronged innocent person getting revenge on the people who killed him, THE CROW: SALVATION makes a departure from the other entries stories by having the Innocent victim, not a victim of a gangland execution by a group of thugs, but rather an innocent person executed thanks to crooked cops for a murder he did not commit & I like the fact that the kabuki make-up was explained as being burn scars from the electrocution & the film has some originality here, with the hero also trying to uncover what the dirty secrets were that the crooked cops were trying to keep covered up. Rushed into production following the shelving of ROB ZOMBIE's Medieval Crow film, the film was put in only one theatre where it bombed thanks in large part to almost no publicity (nice move Weinstiens!). Despite this, it was followed by another direct to video sequel, THE CROW: WICKED PRAYER. PROLOX TRIVIA: ROB ZOMBIE was working on a Crow movie set during medieval times, but abandon the project when he couldn't see eye to eye with the Weinstiens (If only I had a dime every time I heard a film-maker who worked with the Weinstiens say that...) ***1/2 stars",
         "I don't know why this movie is so hated. I really don't. The acting was good, writing was good, characters were good. I just do not see it. Okay, I still haven't seen Wicked Prayer but I'm not expecting big things, this movie was the best Crow sequel so far, nothing compared to the original, but good. The character of Alex Corvis is really likable, as opposed to ashe, I always get those two mixed up because they have the same first initial and last name, so that bugs me. I can really understand Alex's plight and that he really does love his girlfriend, his journey (unlike Ashe's) emotes feelings in the viewer, and the actor playing him was really good too. (Another contrast to Ashe, the makeup is decent)",
         "After murder his girlfriend(Jody Lynn O'Keefe), a young named Alex Corvis(Eric Mabius) is condemned electric chair. The execution is watched by her father(William Atherton) and her sister(Kirsten Dunst). But he returns to life and rises from death in order to seek vengeance on those who murdered his fiancée and wrongly framed him like killer and battling nasties hoodlums and corrupts policemen from inner city.As always, one time resurrected is guided by a spectral crow. Alex with tragic melancholy pulls off bloody revenge,one by one, killing violently enemies. This is a dark , rainy, colorful film with mostly scenes developing into the night. The movie packs loads of violence, grisly killing, blood and gore. Based on the black and white comic strip by James O'Barr. Spectacular production design with strong style and creepy sepia-toned by magnificent cinematography in charge of Carolyne Chen though quite gloomy. Eerie music score by Marco Beltrani, adding heavy rock soundtrack. The motion picture is professionally directed by Bharat Nalluri, usual television movies director(Tsunami). The original movie ¨The Crow¨(1994,Alex Proyas) with Brandon Lee(died accidentally shortly before was complete) is much better, but this one is better than ¨The Crow 2: City of Angels¨(1996,Tim Pope)with Vincent Perez ,and followed by TV series with Mark Dacascos; and recently, in production, a new sequel by Rod Zombie.",
         "The Crow Salvation was a very entertaining movie. It has good action and violence. I think it is visual better than The Crow and it has good effects, and the story is better then The Crow. It got some plot holes and some really bad acting and writing. But if you are The Crow and action fan like me you will love this movie and don't get hooked up in the plot holes, bad acting and hopeless dialogue. And it got an awesome sound track and Kirsten Dunst is great in this movie. But it is Eric Mabius' movie and he is not just an Brendon Lee rip off. A great movie to watch a Friday night with your friends."
      ],
      "genres": [
         "Action",
         "Crime",
         "Fantasy",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "Edward R. Pressman Film",
         "Fallen Bird Productions Inc.",
         "IMF Internationale Medien und Film GmbH & Co. Produktions KG"
      ],
      "summaries": [
         "The third entry in 'The Crow' series follows Alex Corvis, who was framed for the murder of his girlfriend and is executed. he is then brought back from the dead by a crow when the legend says 'Love is stronger than death'. He returns to discover that a corrupt police force is behind her murder and for him to go after the killers, he must find out the mystery behind everything that happened.",
         "18-year-old Alex Corvis is framed for the murder of his girlfriend Lauren Randall, who was stabbed 53 times. Lauren was 18 years old. Three years after the stabbing, 21-year-old Alex is executed in the electric chair for it. Soon after the execution, Alex is resurrected by a legendary crow, so Alex can clear his name and get revenge. Alex follows the crow to the Salt Lake City police department's evidence room, where he discovers that Lauren was killed by a group of corrupt cops, and Alex believes that one of the killers had an unusual scar on his arm. Alex finds the knife that was used on Lauren, and then Alex finds Lauren's grave. Alex also meets with Lauren's sister Erin, who does not believe who he is, but he tells her that he'll prove it somehow, then he disappears. Alex finds Tommy Leonard, the man who was paid to lie about Alex at the trial. Tommy tells Alex which cops killed Lauren -- Madden, Martin Toomey, Vince Erlich, Stan Roberts, and Phillip Dutton, and Alex spares Tommy's life. It was Dutton who handled the investigation of Lauren's death. Alex proves himself to Erin, and with Erin's help, Alex sets out to take down the corrupt cops who framed him.",
         "Alex Corvis returns to the world of the living to solve the murder of a young woman that he was wrongly accused of."
      ],
      "budget": 10000000
   },
   "movielensId": 3563,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "2000-10-31",
      "dvdReleaseDate": "2001-03-20",
      "directors": ["Bharat Nalluri"],
      "runtime": 102,
      "movieId": 3563,
      "title": "The Crow: Salvation",
      "mpaa": "R",
      "actors": [
         "Eric Mabius",
         "Kirsten Dunst",
         "William Atherton",
         "Jodi Lyn O'Keefe",
         "Fred Ward",
         "K.C. Clyde",
         "Dale Midkiff",
         "David Stevens",
         "Grant Shaud",
         "Bill Mondy",
         "Walton Goggins",
         "Britt Leary",
         "Tim DeKay",
         "Don Shanks"
      ],
      "imdbMovieId": "0132910",
      "originalTitle": "The Crow: Salvation",
      "genres": [
         "Action",
         "Science Fiction",
         "Thriller"
      ],
      "youtubeTrailerIds": ["KqiZTy1NB0E"],
      "plotSummary": "Alex Corvis returns to the world of the living to solve the murder of a young woman that he was wrongly accused of killing. Alex follows the crow into the police department's evidence room, where he discovers that Lauren was killed by a group of corrupt cops.",
      "tmdbMovieId": 9456,
      "avgRating": 2.27122,
      "releaseYear": "2000",
      "numRatings": 483,
      "posterPath": "/lD0Q8FYseQSBD9DKYuHeVdmSGwC.jpg"
   }
}