{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0162348",
      "video": false,
      "title": "Smiling Fish & Goat On Fire",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Chris Remi",
               "gender": 2,
               "credit_id": "52fe4ac8c3a368484e166c13",
               "name": "Derick Martini",
               "profile_path": null,
               "id": 33349,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Alison",
               "gender": 1,
               "credit_id": "52fe4ac8c3a368484e166c17",
               "name": "Amy Hathaway",
               "profile_path": "/vb4UTeWz30gUv380ecG7dzLQUES.jpg",
               "id": 181851,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Tony Remi",
               "gender": 0,
               "credit_id": "52fe4ac8c3a368484e166c1b",
               "name": "Steven Martini",
               "profile_path": "/abNHa9hAM8IJafgS1dE19GIbHQs.jpg",
               "id": 204411,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Ginger Baker",
               "gender": 1,
               "credit_id": "59cbf981c3a3687797017ead",
               "name": "Wilda Taylor",
               "profile_path": null,
               "id": 1895804,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4ac8c3a368484e166c0f",
               "name": "Kevin Jordan",
               "profile_path": null,
               "id": 85242,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5abd54c99251411e95030839",
               "name": "Harry Kim",
               "profile_path": null,
               "id": 2010852,
               "department": "Production",
               "job": "Unit Manager"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.149197,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 125537,
      "vote_count": 2,
      "budget": 0,
      "overview": "Two brothers share a house in LA's Fairfax district: Tony's a feckless actor, Chris is an accountant. Both are in relationships on rocky ground. As these emotions swirl, Tony meets his US Postal Service letter carrier, a single mom named Kathy who's come to LA from Wyoming with her daughter, a budding actress. Chris meets Anna, an Italian beauty working in the States for a few months wrangling animals on movie sets. Chris also befriends Clive, an aging and crusty man whose longing for his recently-deceased wife is a portrait of true love. Can Clive's example help Chris sort out his love life, and can Tony grow up enough to see the possibilities with Kathy and her daughter?",
      "similar": [],
      "original_title": "Smiling Fish & Goat On Fire",
      "runtime": 90,
      "poster_path": "/dCN855wZvVo5jH6oSdpdPQNKGI.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1999-09-16",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "two brothers, four women and the search for Magnetic Perfection",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Kevin Jordan"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Kevin Jordan",
         "Derick Martini"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0162348/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQwOTM0ODMxNV5BMl5BanBnXkFtZTcwMzg3NTAwMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Derick Martini, Steven Martini, Amy Hathaway | See full cast and crew »"],
      "reviews": [
         "To succeed, a romantic comedy has to be centered around likeable characters. Although some of the supporting actors and actresses were likeable, the two \"stars\" of the movie really failed to shine in this department. Am I supposed to like the first brother because he has a tender moment with an adorable little girl while, unbeknownst to him, her mother is quietly watching? Folks, it doesn't get much more cheeseball that that. Am I supposed to like the second brother, after he acts like a complete jerk throughout the entire movie, simply because he wants to find true love? I couldn't have cared less whether these two losers got what they wanted, and found myself hoping that they ended up alone together--because the only people that they really deserved in my book were each other. If you're the kind of person that is amused and touched when two brothers wrestle in the kitchen and it breaks into a bonding moment between the two barbarians, then this is your movie. For those of you who ask that characters give us something more than their mere presence and hackneyed tender moments to feel involved, stay away. The poor writing for the movie's two main characters completely wastes the few nice moments that the supporting cast provides. One final comment. I was completely turned off by a phrase in the first few moments of the movie, when some cheesy narration by one of the brothers explains the movie's title and prepares us for the hour and a half of lameness that we're about to endure. It went something like this: \"I know it sounds gay, but I really love my brother.\" \"I know it sounds gay\"? Did I hear that right? \"I know it sounds gay\"? Do grown adults really use this phrase in this day and age?",
         "I took a chance when I got this one from my local library. And I'm happy I did! This is no masterpiece, but it's still a surprisingly likeable piece of work. I especially liked the Clive's character, played by Bill Henderson. And I fell in love with Rosemarie Addeo! In all, a nice independent film. Out of 100, I gave it 75. That's good for **½ out of ****. Seen at home, in Toronto, on April 23rd, 2002.",
         "I heard quite a lot of pre-release buzz for \"Smiling Fish and Goat on Fire\" so naturally I planned on seeing it as soon as it hit theaters. I must disagree with most of the other IMDB reviewers, sad to say. The movie did have its funny moments, but I have seen this type of independent romantic comedy soooo many times already. It just isn't as fresh and original as so many people have been hailing it to be. I think the fact that this movie was made for only $40,000 is admirable. But that doesn't mean that it is a good film. The chemistry between Chris (Derick Martini) and the Italian animal wrangler was lacking. I didn't know what she saw in him, to be honest. The scenes between Chris and his soon-to-be ex-girlfriend Ali were much more intriguing. The movie might have also been a little more interesting if it explored Tony's (Steven Martini) womanizing a bit further. It would have provided great tension in his growing relationship with the mail-woman. But instead all we get is his instant rapport with her cute, but way-too-precocious, little girl. Steven Martini has a lot of appeal, but there was no conflict in this relationship to keep my attention. ZZZZZzzzzzzz..... I really hate to be the wet blanket as far as this movie is concerned, but it didn't really live up to my expectations. For a better and fresher independent romantic comedy, I would recommend \"The Tao of Steve.\"",
         "This is one of those flicks that are worth catching on cable if it happens to be on when you have nothing else to do. It's not worth renting. it is a likeable and watchable film that was obviously influenced by \"The Brothers McMullen,\" although it's not as good and, in the final analysis, is ultimately silly. It provides an excellent performance by the veteran African-American character actor Bill Henderson, who plays Clive, a stereotypical elderly font of wisdom who imparts some of that wisdom to the driven and compulsive but Ultimately Decent Chris and the frivolous and irresponsible but Ultimately Decent Tony. He also provides a 'deus ex machina' ending as well. Do you remember the Danny Glover character in \"Grand Canyon?\" The Henderson character is the same character 50 years older.",
         "I happened upon this DVD at the library, and because I love watching movies I've never seen which also have strange titles, I checked it out. After watching it a couple of times, I've decided to buy it! \"Smiling Fish & Goat on Fire\" will definitely not appeal to everyone. It's a quiet little story about relationships, both romantic and brotherly, and \"coming of age\" (funny, I never knew what that term meant until seeing this film). I hadn't ever heard of the Martini brothers, nor Kevin Jordan or Bill Henderson for that matter, and I probably never would have were it not for the lucky happenstance at the library. This film is genuinely charming, thanks in no small part to the actors and the screenplay. Not your basic Hollywood romantic comedy in the least (and I'm not averse to those), \"Smiling Fish...\" is in full possession of its own self. Bravo all around! Anyone who comes from a close two-sibling-of-the-same-sex family will probably love this film, as well as anyone who enjoys a touching \"slice-of-life\" story with much originality, and even more heart. Funny, unique, and sweet!!!",
         "I love this movie. It's original, realistic, unpredictable and charming. I felt like I was watching real people in their real lives. What a treat this film is. Each character is so well developed, has such real and appropriate emotions...I felt I knew them all, and well. They could be my co-workers or neighbors or friends. The acting is wonderful. Bravo to the writers and director. Watching this film is better than eating a hot fudge sundae! Long live the indies.",
         "This film was great. That's all there is to it. Sure a romantic-comedy, but there was something different about this one. Typically, with these types of movies, the comedy is overemphasized hit-you over the head silliness crap and the romance is just in your face jump in bed crap mushy crap. This one is different. The casting is perfect, these people aren't leading man/woman types, but are average looking people. And the thing that sticks out the most is how REAL the relationships are, sure a bit crazy at times, but not beyond what anyone in real life experiences. The film is altogether believable, fun and charming. Highly recommended if you want to see something freshly entertaining. (Rather than overdramatized hollywood foolishness). Congrats to the makers of this film!!!",
         "Terrible title for a very good, modest and charming movie. Great cast, good story, good dialogue. The beginning is a bit slow but it grows on you. Both funny and moving. I cried a little at the end. But it's not a drama. It's just about love and real life, complicated, messy and rewarding. It's a 'feel good' movie but it's not with the usual Hollywood crap. I recommend it without any restriction, except to those who liked Richard Gere in \"Autumn in New York\". If you liked that, the \"Goat/Fish\" is not for you. We are talking about cinema here.",
         "These guys did a lot with a very little ($40k budget!). I saw a free screening of this last night and was really impressed. Great characters, dialogue, an easy-paced story that feels real good. Nice insights on the ever-told story of boy meets girl, boy screws things up with girl. SEE IT. TELL YOUR FRIENDS.",
         "Hi. I just saw a free screening of this film, which is now called Smiling Fish and Goat on Fire. It was a pure treat. A sensitive subtle film with alot of heart. Not like the usual edgy violent depressing independents that are shot on this kind of a budget. You care about these characters. I really enjoyed it."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "One Sock Productions",
         "Parabellum Productions",
         "Red Horse Films"
      ],
      "summaries": ["Two brothers share a house in LA's Fairfax district: Tony's a feckless actor, Chris is an accountant. Both are in relationships on rocky ground. As these emotions swirl, Tony meets his US Postal Service letter carrier, a single mom named Kathy who's come to LA from Wyoming with her daughter, a budding actress. Chris meets Anna, an Italian beauty working in the States for a few months wrangling animals on movie sets. Chris also befriends Clive, an aging and crusty man whose longing for his recently-deceased wife is a portrait of true love. Can Clive's example help Chris sort out his love life, and can Tony grow up enough to see the possibilities with Kathy and her daughter?"],
      "budget": 40000
   },
   "movielensId": 3568,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-09-16",
      "dvdReleaseDate": "2001-08-21",
      "directors": ["Kevin Jordan"],
      "runtime": 90,
      "movieId": 3568,
      "title": "Smiling Fish & Goat On Fire",
      "mpaa": null,
      "actors": [
         "Derick Martini",
         "Amy Hathaway",
         "Steven Martini",
         "Wilda Taylor"
      ],
      "imdbMovieId": "0162348",
      "originalTitle": "Smiling Fish & Goat On Fire",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Two brothers share a house in LA's Fairfax district: Tony's a feckless actor, Chris is an accountant. Both are in relationships on rocky ground. As these emotions swirl, Tony meets his US Postal Service letter carrier, a single mom named Kathy who's come to LA from Wyoming with her daughter, a budding actress. Chris meets Anna, an Italian beauty working in the States for a few months wrangling animals on movie sets. Chris also befriends Clive, an aging and crusty man whose longing for his recently-deceased wife is a portrait of true love. Can Clive's example help Chris sort out his love life, and can Tony grow up enough to see the possibilities with Kathy and her daughter?",
      "tmdbMovieId": 125537,
      "avgRating": 3.19091,
      "releaseYear": "1999",
      "numRatings": 110,
      "posterPath": "/dCN855wZvVo5jH6oSdpdPQNKGI.jpg"
   }
}