{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0180793",
      "video": false,
      "title": "The Last September",
      "recommendations": [],
      "backdrop_path": "/bUOIAPlrsOEEWPaBotacGvr6M0.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Sir Richard Naylor",
               "gender": 2,
               "credit_id": "52fe4787c3a368484e0cc0b7",
               "name": "Michael Gambon",
               "profile_path": "/k6VxRs7xcG6DLEVM1izjb3UWSyC.jpg",
               "id": 5658,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Lady Myra Naylor",
               "gender": 1,
               "credit_id": "52fe4787c3a368484e0cc0bb",
               "name": "Maggie Smith",
               "profile_path": "/kkMNu2iqkBPkbjhNBmDaUX7FHr.jpg",
               "id": 10978,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Lois Farquar",
               "gender": 1,
               "credit_id": "52fe4787c3a368484e0cc0c3",
               "name": "Keeley Hawes",
               "profile_path": "/1gPPMAbUlZG2WexWDc3RzwYeJ1z.jpg",
               "id": 22809,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Captain Gerald Colthurst",
               "gender": 2,
               "credit_id": "52fe4787c3a368484e0cc0c7",
               "name": "David Tennant",
               "profile_path": "/dvhgfeZtK0aSHU1H8rkGwFTq28b.jpg",
               "id": 20049,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Captain Daventry",
               "gender": 2,
               "credit_id": "52fe4787c3a368484e0cc0cb",
               "name": "Richard Roxburgh",
               "profile_path": "/hN1bWQ0Qe0DrA33Ch6TLKuIWs0.jpg",
               "id": 12206,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Hugo Montmorency",
               "gender": 2,
               "credit_id": "58e945fec3a36872af05f9f6",
               "name": "Lambert Wilson",
               "profile_path": "/jFkr2kuFfpzS1plfOlNJ6kURV6O.jpg",
               "id": 2192,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Francie Montmorency",
               "gender": 1,
               "credit_id": "58e94635c3a36872f6065ec0",
               "name": "Jane Birkin",
               "profile_path": "/e62bIWn1XolFTD5uZ47e3XH8xXK.jpg",
               "id": 15200,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Marda Norton",
               "gender": 1,
               "credit_id": "58e946619251414b28024533",
               "name": "Fiona Shaw",
               "profile_path": "/74b0OuN3xKs0dTMYBnbhDLwv8Oq.jpg",
               "id": 10981,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Livvy Connolly",
               "gender": 0,
               "credit_id": "58e9468cc3a36872ee06aaa4",
               "name": "Emily Nagle",
               "profile_path": "/xBLxPbp89NuPOO0Ip4vG4uIjqQp.jpg",
               "id": 1376685,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Laurence Carstairs",
               "gender": 0,
               "credit_id": "58e946b69251413ce4009447",
               "name": "Jonathan Slinger",
               "profile_path": null,
               "id": 1334297,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Peter Connolly",
               "gender": 0,
               "credit_id": "58e946e592514134eb02b9c2",
               "name": "Gary Lydon",
               "profile_path": "/ro0TbLExRY93xMFh6wyK8zAQsYH.jpg",
               "id": 93209,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4787c3a368484e0cc0d1",
               "name": "Deborah Warner",
               "profile_path": null,
               "id": 1033866,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "58267239c3a368038100ae62",
               "name": "Elizabeth Bowen",
               "profile_path": null,
               "id": 1669657,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "5826723fc3a368360f01289e",
               "name": "John Banville",
               "profile_path": null,
               "id": 936279,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "58267255c3a3683606011fe3",
               "name": "Kate Evans",
               "profile_path": null,
               "id": 33443,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "582672479251417b230118ee",
               "name": "Zbigniew Preisner",
               "profile_path": "/bBebcS5dznOr7l9lBZqzISgeYYC.jpg",
               "id": 1135,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5826724ec3a3683604012168",
               "name": "Slawomir Idziak",
               "profile_path": "/vA9WrEK35MyUx6Sb4NtZiouotsg.jpg",
               "id": 1129,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.091526,
      "production_countries": [],
      "id": 68170,
      "vote_count": 1,
      "budget": 0,
      "overview": "In 1920s Ireland, an elderly couple reside over a tired country estate. Living with them are their high-spirited niece, their Oxford student nephew, and married house guests, who are trying to cover up that they are presently homeless. The niece enjoys romantic frolics with a soldier and a hidden guerrilla fighter. All of the principals are thrown into turmoil when one more guest arrives with considerable wit and unwanted advice.",
      "similar": [],
      "original_title": "The Last September",
      "runtime": 103,
      "poster_path": "/7m1dbfcXJZHAUYLpRa9doLya2In.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2000-04-28",
      "vote_average": 8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Deborah Warner"],
      "runtime": 103,
      "synopsis": null,
      "writers": [
         "Elizabeth Bowen",
         "John Banville"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0180793/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYwMDIzNDcyOF5BMl5BanBnXkFtZTcwMzA3NDYxMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Michael Gambon, Tom Hickey, Keeley Hawes | See full cast and crew »"],
      "reviews": [
         "Not everyone is familiar with the unique place of the Anglo-Irish in Ireland, and some of my companions expressed trouble following who was who, and how were they related. It took a while to get past this, I suppose. But the film itself is a compelling story of conflicting loyalties, misunderstood motives, and troublesome times. The juxtaposition of dinner parties and political violence was perfectly done. One of the most interesting \"period pieces\" I've seen, and of course, it's worth the price just to see Maggie Smith again.",
         "\"The Last September\" tells of the beginning of the end of the Anglo-Irish, circa 1920ish, in Cork, Ireland by examining the clockworks of one family of privilege surrounded by rebellion, on the cusp of degentrification, and trying to keep a stiff upper lip in the face of waning denial. Beautifully filmed and visually delightful, this film sports a wonderful cast who deliver finely nuanced performances. Unfortunately the subject matter is somewhat esoteric, the story meager, and the film burrows into the moment to moment minutia; something which is both it's strength and its weakness. Those who don't get the Brits should pass on this flick. Those who do, may be enthralled by it. I know I was. (B)",
         "The narrative is a mess but there are many fine visuals and isolated moments of deep emotional intensity. Michael Gambon and Maggie Smith were excellent, but Jane Birkin and Fiona Shaw have some of the most powerful scenes, with their relationship problems seeming to amplify the dislocation all the characters are feeling, Irish but not Irish, English but not English. However, it is Keely Hawes' intense performance as Lois that held the movie together for me, with her coming of age, and the relationship choices she must make, personalizing the larger conflict between English and Irish that the film wants to illuminate. This is director Deborah Warner's first film (she's an experienced stage director) and I feel she relied too much on her cinematographer, Slavomir Idziak. He did a very fine job with the landscapes and interiors, but there are too many gratuitous camera tricks and heavy-handed visual cues that don't contribute anything to the story or it's impact. Overall, worth seeing for the performances and questions of national identity it raises. The interviews with Fiona Shaw and Deborah Warner on the DVD are also worth a look.",
         "Saw this, appropriately enough, on St. Patrick's day (along with the more interesting Omagh), and found it difficult to tune in to anybody in the movie. It does have two great actors of the UK screen: Maggie Smith (being serious, for a change), and the always fascinating Michael Gambon. They get to recite some lines that allow them to sparkle, but are really secondary characters to Keely Hawes and David Tennant, two star crossed would be lovers, who talk past each other. Set In Ireland just post the first World War, and with local sentiments rising to rid themselves of the Brits, the movie tries to show metaphorically the divide within Irish breasts. What we get instead are boorish Black and Tans, a sociopathic \"freedom fighter\" on the run, and a vapid young woman who wants to say yes to romance, but ends up being manhandled instead by a man who, fresh from the kill, wants to shag! Once bitten, she comes back for more and ends up bemoaning the death of the British soldier she spurned for the Irish killer. Keely Hawes is fine to look at, but I have yet to see her really grip a role. Competent, and easy to watch, she manages to get by with looks and the usual perfect English diction. Here she manages quite well to show us a self centered young woman looking for something other than a fine upstanding young man before she has to marry one. She finds a dangerous killer hiding out in the abandoned mill, and knowing full well that he has brutally tortured and killed a bullying British soldier, she decides to tarry and stand mesmerized as he proceeds to get half way through artlessly depriving her of her maidenhood. Interrupted by David Tennant, a willing suitor up against unrequited love, she staggers off half dressed while Tennant allows the killer to escape. Not to fear, intrepid Keely gets another chance to be mauled, and Tennant gets another chance to rescue the maiden who doesn't want rescuing, and gets killed for his pains. Whether Keely ever comes to her senses is not clear. She is distraught at Tennant's death, but never seems to show an inkling of how stupid and reckless she has been. Surrounding this Laurentian tale of lust between the classes are other smaller tales of love lost, and love never found. As a tale of Ireland it is small potatoes.",
         "Slow-moving and extremely melodramatic film, but still interesting. Rare in that it compares a girl's (as opposed to the more common male narratives) coming-of-age to a nation's coming-of-age. There is a certain amount of James Joyce-ian cruelty and mocking towards the Irish, Anglo-Irish, and British identities depicted in this film. The British soldiers are portrayed as silly, superficial, self-absorbed characters. Yet they are also powerful in that they have shaped the identities of both the Anglo-Irish (or pseudo-British) family, and the lower-class Irish \"freedom-fighters.\" Once the soldiers leave to return to the front-lines, both Irish \"halves\" lose their purposes and identities. The director asks harshly, \"Who are you and what is left of yourselves once your audience and oppressor have left?\" Likewise, the coming-of-age experiences of Lois, and \"the woman passing out of her prime\" story of Marda (played really well by Fiona Shaw) are also critically assessed. Lois is just beginning to discover the power (sometimes dangerously misdirected) that comes with female sexuality, while Marda is experiencing the powerlessness of female aging. Again, the director makes the point that identity cannot sustain on the outside; it must come from within. *******Spoilers******* Unlike the Irish and the Anglo-Irish family, however, Lois does possess a very strong inner core of identity that remains untouched, and it is not because she is oblivious to or uninvolved with the complicated social, political, religious, and economic situations that she encounters. Her strength in knowing who she is remains steady throughout. Therefore, the fact that she leaves Ireland at the end of the film can be seen as tragic. And it's an extra dig that she leaves for America. The U.S. during the 1920s was generally regarded as place where you forgot where you came from so that you could become an \"American.\" But had Ireland - as a country, as a nation, as a homeland - become a place where someone with so strong an identity would be left unsatisfied?",
         "The story is convoluted. But the strength (and the JOY) of this film is the manner in which it has so genuinely captured an era and a place, the Ireland of 1920. The camera work is unique. It came as no surprise to see that the director is a woman. Deborah Warner brings a soft and compassionate understanding to her subject which would be beyond a male. Her framing, her angles, her pacing are all perfection. She gets everything out of her actors. Maggie Smith never has been better. This is a fine and memorable film in which the story is really less important than the dream like images that support it. It's artistry.",
         "Having tried to read the novel on which this movie was based and not enjoyed doing so all that much, this film was an unexpected delight. While Bowen's style is often tedious, Banville's adaptation moves along at a sprightly pace that belies it's tragic, Chekovian subject matter. Like BBC's Persuasion and Vanity Fair, this film tries to rescue the period adaptation from the asphixiating clutches of Merchant-Ivory while retaing a large degree of textual integrity. Banvill, who brought the Irish \"Big House\" novel into the postmodern era with _Birchwood_ brings a contemporary eye to this tale of Anglo-Irish Aristocrats in the Last Days of their tenure. It's wonderfully acted, with Jane Birkin giving the sort of display of gap-toothed Anglo-Saxon diffidence that made _La Belle Noisuise_ tolerable; Maggie Smith doing her usual indignant aristocrat, Fiona Shaw playing Fiona Shaw, and Micheal Gambon thankfully playing an Anglo-Irish rather than Irish character. It's a film that anyone with a casual interest in Irish history will be enlightened by and one that anyone with an eye for beauty will be delighted by.",
         "\"The Last September\" is set in County Cork, Ireland in 1920, just prior to the institution of the Irish Free State, the days of Michael Collins. (Mr. Collins and the other scions of the revolution are notably absent in this film.) The view of the film is narrowed to the trials and tribulations of Anglo-Irish aristocrats, and friends, who inhabit their country manor on their last Summer holiday in colonial Cork. The film's strength is its microscopic cinematic views of the lives of the aristocrats and their guests. The filming is rich and startling. Small distracted moments are captured with amazing effect. Reflections in picture frame glass and windows are very compelling. The viewer is sometimes made an involuntary voyeur. This created a discomfort, an edge, for me. Sometimes Gothic, sometimes just frustratingly slow, the film's moods are overpowering. I felt like I had been made one of the aristocratic \"tribe\", as they call themselves. I could experience their self restraint and quit desperation at times. I found myself twisting in my seat at these moments. Lois, played marvelously by Keeley Hawes, reminded me of Lucy Harmon in Bertolucci's \"Stealing Beauty\", as played marvelously by Liv Tyler. The film has trouble staying focused on her. Perhaps this is to be expected, since she represents the elusive True Spirit of the Irish, conflicted about passion and pride, freedom and violence. Fiona Shaw captures in her character what Lois must become. The relationship between the two women is a painfully powerful representation of the Death of Self at the hands of conventions, the consequences of classism, sexism and tribalism. The handling of the the other characters seemed cursory and prone to stereotyping. Michael Gambon and Maggie Smith did the work and turned the coal of potentially predictable rich 'county' types to diamonds of lovably faceted eccentrics. The film is not easy. The time did not fly by. There were many laughs. There were many stunning visual and emotional moments. I guess it was like life itself, in a particular place and time.",
         "This is a great piece of work by first time film-maker, Deborah Warner. A stellar cast of film and theatre heavy weights (Maggie Smith, Michael Gambon and Fiona Shaw) star in a Chekhovian \"comedy\" of changing times and politics. Set among the Anglo Irish, the film is a coming of age story for its young heroine (a great performance from Keeley Hawes) who lives with her aunt and uncle (Smith and Gambon) in aristocratic insulation and isolation from the increasingly violent struggles that edge ever closer. Apart from the performances (Gambon and Shaw being particularly fine), what impresses is Deborah Warner's complete grasp of her material. Her reputation in the theatre is of a quiet, incisive intelligence that can cut to the heart of a text and present it new and clear to the audience. The evidence here is that she has a career every bit as impressive ahead of her in film: The Last September is fluent, assured and extremely watchable, with every last detail (music, design and lighting)beautifully and sympathetically realised. Wonderful.",
         "Absorbing screen play. Not easy, not especially familiar to many of us but extremely thought-provoking, given the Anglo-Irish theme and the time in which the film is set. An excellent cast led by the magnificent Maggie Smith who simply oozes condescension, snobbery, class-ism and caste-ism, while displaying genuine affection for 'her own kind of people'. The setting of faded yet comfortable gentility is just right and the inclusion of down-on-their-luck relatives rings true also. Keely Hawes creates the right air of fragility, self-absorption and feyness. Her scenes with the admirable Fiona Shaw are powerful and reflect her dawning sense of self and of a desperation to escape, as the story unfolds. And David Tennant? Heartbreakingly real as the young would-be lover and army officer. What a very fine actor he is, despite a rather anaemic and quite unnecessary moustache. So good too to see the excellent Richard Roxburgh, playing Tennant's best pal in the army. In summary, a film that is worth making the effort to see and to mull over. An auspicious beginning for Deborah Warner."
      ],
      "genres": [
         "Drama",
         "History",
         "Romance"
      ],
      "productionCompanies": [
         "Matrix Films",
         "Scala Thunder",
         "Bórd Scannán na hÉireann"
      ],
      "summaries": ["In 1920s Ireland, an elderly couple reside over a tired country estate. Living with them are their high-spirited niece, their Oxford student nephew, and married house guests, who are trying to cover up that they are presently homeless. The niece enjoys romantic frolics with a soldier and a hidden guerrilla fighter. All of the principals are thrown into turmoil when one more guest arrives with considerable wit and unwanted advice."],
      "budget": 0
   },
   "movielensId": 3570,
   "movielens": {
      "languages": [""],
      "releaseDate": "2000-04-28",
      "dvdReleaseDate": "2000-09-26",
      "directors": ["Deborah Warner"],
      "runtime": 103,
      "movieId": 3570,
      "title": "The Last September",
      "mpaa": "",
      "actors": [
         "Michael Gambon",
         "Maggie Smith",
         "Keeley Hawes",
         "David Tennant",
         "Richard Roxburgh",
         "Lambert Wilson",
         "Jane Birkin",
         "Fiona Shaw",
         "Emily Nagle",
         "Jonathan Slinger",
         "Gary Lydon"
      ],
      "imdbMovieId": "0180793",
      "originalTitle": "The Last September",
      "genres": [
         "Drama",
         "Foreign",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "In 1920s Ireland, an elderly couple reside over a tired country estate. Living with them are their high-spirited niece, their Oxford student nephew, and married house guests, who are trying to cover up that they are presently homeless. The niece enjoys romantic frolics with a soldier and a hidden guerrilla fighter. All of the principals are thrown into turmoil when one more guest arrives with considerable wit and unwanted advice.",
      "tmdbMovieId": 68170,
      "avgRating": 3.1,
      "releaseYear": "2000",
      "numRatings": 45,
      "posterPath": "/7m1dbfcXJZHAUYLpRa9doLya2In.jpg"
   }
}