{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "vegetarian",
            "id": 4459
         },
         {
            "name": "gore",
            "id": 10292
         },
         {
            "name": "dinosaur",
            "id": 12616
         },
         {
            "name": "credit rolling down",
            "id": 155641
         }
      ],
      "imdb_id": "tt0106521",
      "video": false,
      "title": "Carnosaur",
      "recommendations": [
         65460,
         55667,
         402516,
         28508,
         30641,
         18015,
         15591,
         35891,
         161368,
         36965,
         52840,
         37536,
         42302,
         76395,
         55670,
         68478,
         29412,
         42793,
         4289,
         78402
      ],
      "backdrop_path": "/f0YLrOzjtUpVO0oMYLbLK4m3fqJ.jpg",
      "revenue": 1753979,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Dr. Jane Tiptree",
               "gender": 1,
               "credit_id": "52fe470a9251416c91068457",
               "name": "Diane Ladd",
               "profile_path": "/slgKANTJWP5vStwKimuEGwpMr4S.jpg",
               "id": 6587,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "'Doc' Smith",
               "gender": 2,
               "credit_id": "52fe470a9251416c9106845b",
               "name": "Raphael Sbarge",
               "profile_path": "/dqJaYxVxOKJjMcIzOnAf3ef1RfR.jpg",
               "id": 97943,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Ann 'Thrush'",
               "gender": 1,
               "credit_id": "52fe470a9251416c9106845f",
               "name": "Jennifer Runyon",
               "profile_path": "/l49UxoqKzOsVH8dEMn4F7kI6K7r.jpg",
               "id": 101652,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Sheriff Fowler",
               "gender": 2,
               "credit_id": "52fe470a9251416c91068463",
               "name": "Harrison Page",
               "profile_path": "/k6cpbFO856LeAuoC1Tc5BQ0OXrf.jpg",
               "id": 45101,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Fallon",
               "gender": 2,
               "credit_id": "52fe470a9251416c91068467",
               "name": "Ned Bellamy",
               "profile_path": "/aPAsdVFewZK3ldhvrL1ea2VUkUK.jpg",
               "id": 2141,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "'Slim' Friar",
               "gender": 2,
               "credit_id": "52fe470a9251416c9106846b",
               "name": "Clint Howard",
               "profile_path": "/d9QW5feIgNwDRdkKK1j7gmmOQXT.jpg",
               "id": 15661,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Jesse Paloma",
               "gender": 2,
               "credit_id": "52fe470a9251416c9106846f",
               "name": "Frank Novak",
               "profile_path": "/qD6p4ZqXU5HmX1h2qTL4B43dMfc.jpg",
               "id": 46930,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Dr. Sterling Raven",
               "gender": 2,
               "credit_id": "52fe470a9251416c91068473",
               "name": "Ed Williams",
               "profile_path": "/tX264d1o9lwOqPl3ENblO3Jyelb.jpg",
               "id": 122592,
               "order": 7
            },
            {
               "cast_id": 26,
               "character": "Diego",
               "gender": 2,
               "credit_id": "551df3539251413743001a93",
               "name": "George Perez",
               "profile_path": "/h1Mw4pPnTfnpp7u4XQbN2eeiTnF.jpg",
               "id": 156756,
               "order": 8
            },
            {
               "cast_id": 9,
               "character": "Swanson",
               "gender": 0,
               "credit_id": "52fe470a9251416c91068477",
               "name": "Andrew Magarian",
               "profile_path": null,
               "id": 122593,
               "order": 10
            },
            {
               "cast_id": 10,
               "character": "Peregrine",
               "gender": 2,
               "credit_id": "52fe470a9251416c9106847b",
               "name": "Brent Hinkley",
               "profile_path": "/1vsUTyswlmeKc4nZOEivdq482mO.jpg",
               "id": 7134,
               "order": 11
            },
            {
               "cast_id": 11,
               "character": "Susan Mallard",
               "gender": 1,
               "credit_id": "52fe470a9251416c9106847f",
               "name": "Lisa Moncure",
               "profile_path": null,
               "id": 122594,
               "order": 12
            },
            {
               "cast_id": 12,
               "character": "Vogel",
               "gender": 0,
               "credit_id": "52fe470a9251416c91068483",
               "name": "Myron Simon",
               "profile_path": null,
               "id": 122595,
               "order": 13
            },
            {
               "cast_id": 13,
               "character": "Lt. Colonel Wren",
               "gender": 0,
               "credit_id": "52fe470a9251416c91068487",
               "name": "V.J. Foster",
               "profile_path": "/dWGoTFHsAfjXC6yF6ODi61cH5Jt.jpg",
               "id": 122596,
               "order": 14
            },
            {
               "cast_id": 14,
               "character": "Miss Kroghe",
               "gender": 1,
               "credit_id": "52fe470a9251416c9106848b",
               "name": "Martha Hackett",
               "profile_path": "/wIpkcSbOkQvZackeUtbowBbDYfQ.jpg",
               "id": 42165,
               "order": 15
            },
            {
               "cast_id": 27,
               "character": "Downey",
               "gender": 1,
               "credit_id": "5a1b31c99251410329046b8c",
               "name": "Maud Winchester",
               "profile_path": "/vgknfPYukEmb3D7Ghu16mqS7Ulk.jpg",
               "id": 203898,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe470a9251416c91068491",
               "name": "Adam Simon",
               "profile_path": null,
               "id": 46442,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe470b9251416c91068497",
               "name": "Darren Moloney",
               "profile_path": null,
               "id": 122602,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe470b9251416c9106849d",
               "name": "Roger Corman",
               "profile_path": "/gCfEvxl7jTv2dBo8HvwWVMi3auz.jpg",
               "id": 102429,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe470b9251416c910684a3",
               "name": "Mike Elliott",
               "profile_path": null,
               "id": 37021,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe470b9251416c910684a9",
               "name": "John Brosnan",
               "profile_path": null,
               "id": 1063134,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe470b9251416c910684af",
               "name": "Adam Simon",
               "profile_path": null,
               "id": 46442,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe470b9251416c910684b5",
               "name": "Nigel Holton",
               "profile_path": null,
               "id": 147421,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe470b9251416c910684bb",
               "name": "Keith Holland",
               "profile_path": "/jXyv0be1L0MXQudu6ltXWKLtKf1.jpg",
               "id": 1070312,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe470b9251416c910684c1",
               "name": "Richard Gentner",
               "profile_path": null,
               "id": 1157993,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe470b9251416c910684c7",
               "name": "Lorne Morris",
               "profile_path": null,
               "id": 1157994,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 5.8105,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 39283,
      "vote_count": 27,
      "budget": 1000000,
      "overview": "After being driven to extinction, great bloodthirsty dinosaurs come back to life with the assistance of a demented genetic scientist. She plans to replace the human race with a super-race of dinosaurs who will not pollute the planet.",
      "similar": [
         329,
         88751,
         351286,
         341006,
         18890,
         10185,
         1690,
         588,
         298250,
         381288,
         135397,
         10567,
         769,
         425,
         24,
         105864,
         325348,
         4232,
         19912,
         36647
      ],
      "original_title": "Carnosaur",
      "runtime": 83,
      "poster_path": "/c5BRRRIbM7ZOhGHITbJGVpDpDi7.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "New Horizon Picture Corp.",
         "id": 6086,
         "origin_country": ""
      }],
      "release_date": "1993-05-21",
      "vote_average": 3.9,
      "belongs_to_collection": {
         "backdrop_path": "/f0YLrOzjtUpVO0oMYLbLK4m3fqJ.jpg",
         "name": "Carnosaur Collection",
         "id": 256484,
         "poster_path": "/jzhDqXOiXz1UfmeLYS8H6HVAs52.jpg"
      },
      "tagline": "Driven to extinction. Back for revenge.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": [
         "Adam Simon",
         "Darren Moloney"
      ],
      "runtime": 83,
      "synopsis": null,
      "writers": [
         "John Brosnan",
         "John Brosnan"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0106521/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgxMTEwNTcyMF5BMl5BanBnXkFtZTcwMTg1NTIyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Diane Ladd, Raphael Sbarge, Jennifer Runyon | See full cast and crew »"],
      "reviews": [
         "I saw this last night having read most of the mocking and negative reviews and expecting something not much good. I was surprised when the film revealed itself to be a perfectly decent low budget creature outing, with the main idea of killer dinosaurs well realised. Granted, the effects are rubbery and easy to slate, but I had more fun just accepting that they were cheaply made and then enjoying them wreak havoc. The havoc is fairly well portrayed with a handful of nice gory kills, more gruesome than one might expect of a film of this ilk. I though the acting to be pretty reasonable, with Diane Ladd particularly standing out with a suitably crackpot mad scientist performance. It was also nice to see the oddly watchable Clint Howard in a small role. The script isn't great, and the story is more than a tad silly, but these are acceptable faults, because the film is always fun and interesting, and it goes down the odd unexpected alley, which is always nice. Mt fondness for this movie may put me in a minority but I'd say this is a fun, mindless outing that whilst no classic should provide a good deal of fun to creature feature addicts. At the least, it certainly beats the hell out of watching the drecktastic family friendly nonsense of Jurassic Park or the majority of recent dinosaur themed movies.",
         "This movie was the best of the bad films I ever seen. I do have to agree with Big Rich when he said \"Makes 'Plan 9 from Outer Space' Look like 'Jurassic Park.'\" It does look like a movie that Ed Wood would have done! But, this film was better then any of Ed's movies, sure the dinosaur looked liked a man in a dinosaur costume but at least the dinosaur wasn't \"dead\" like the octopus in the Ed Wood film. If you're a \"Jurassic Park\" fan or a dinosaur fan you should give this movie a try. A very enjoyable film!",
         "I remember watching Carnosaur years ago when it was released. This movie actually bothered me at the time, especially with its ending. The movie doesn't bother me anymore, but I do find it very enjoyable and has a great re-watch value to it. Diane Ladd has created a disease that only effects females. This disease impregnates them and causes them to give birth to dinosaurs with extremely bloody consequences. Apparently, this movie was based off of two different novels but I don't know how true it is to those novels. This film does have a few really good moments of gore and shock. Unfortunately, the special effects for the dinosaurs is quite lame. But the movie is still a lot of fun. Look for a few cult actors like Clint Howard. Also, this movie has 2 other sequels which I would highly suggest missing. 8/10 stars",
         "I rented Carnosaur because I saw Adam Simon's name on the video box. His cameo in the Player made me curious to see if he really had talent. SURPRISE! He does, and he has it in spades. He took a cheesy idea (basically, the Mad Scientist makes a monster), and got some true scares out of it. The baby carnosaur is shocking and frightening. I noticed that other reviewers have pounced on the shoddy special effects, but...come on! It's a low budget cheapie made before CGI became affordable...for what they are, they work well. At no time was I taken out of the movie by a poor effect. It begs comparison to Jurassic Park, of course. And well it should. Jurassic park is, mostly, a better movie. But Carnosaur makes for a good, fun, monster movie. Not ideal for a night out, but a must-see when you're in a B-movie mood. Rent it alongside a Romero film or an Evil Dead flick and enjoy the fun!",
         "Carnosaur tells the tale of ex loony biowarfare scientist Dr. Jane Tiptree (Diane Ladd) who is working on behalf of the 'Eunice Food Service Division' where she gets to conduct as many unethical experiments as she likes, Dr. Tiptree has genetically recreated a Dinosaur egg which hatches & means a vicious Dinosaur is on the loose much to the annoyance of alcoholic night watchman Doc (Raphael Sbarge) who encounters it when it slaughters a bunch of protesters & he gets the finger of suspicion pointed at him by Sheriff Fowler (Harrison Page). In an effort to clear his name he traces Dr. Tiptree down & discovers that she has engineered a virus hidden within apparently harmless Chicken eggs which cause woman to become pregnant with a baby Dinosaur in an attempt to wipe out mankind & let the Dinosaurs rule the Earth once more! Can her plans be halted or is it too late already... Written & directed by Adam Simon Carnosaur is a Jurassic Park (1993) rip-off from beginning to end & was obviously made to cash in on Spielberg's monster sized hit by executive producer Roger Corman (who else?). In no way are Jurassic Park & Carnosaur comparable in terms of size, scale, scope or entertainment value although I thought Carnosaur was at least quite fun to watch. It moves along at a nice pace & never became boring & it was pretty funny at times. All the usual Dinosaur & mad scientist clichés are here but what the hell sometimes you just manage to enjoy a film for what it is, for me Carnosaur is one of those films. It's by no means a good film, it's very silly, it's tries to do far too much considering it's meagre budget & you can't help but keep thinking about Jurassic Park as you watch it. Basically Carnosaur is a cheap & gory Jurassic Park imitator which I found quite watchable, it's far from the best film ever made but I also think it's far from the worst. Director Simon was working with a low budget & it shows, there's no real style & the Dinosaur effects are plain embarrassing. They are truly some of the worst special effects you will ever see, most of the Dinosaur shots are out of scale & use poor rubber puppet effects while the climactic fight between a T-Rex & Doc in a Bulldozer looks like a hand puppet fighting a toy truck, the special effects are a million miles behind those that Spielberg had at his disposal that were so impressive over a decade ago. One surprising thing about Carnosaur is how gory it is, there is footage from inside a Chicken slaughter house, people have limbs bitten off, guts & bodily organs are torn out, people have their faces ripped off, people are impaled & there's even time for a messy Dinosaur birth that rips-off Alien (1979). Carnosaur doesn't shy away from showing the red stuff, which helps. With a supposed budget of about $1,000,000 I sort of feel sorry for Simon who had literally no chance whatsoever to compete with Spielberg's millions. The special effects are among the worst I've seen, the sets cheap, it's not that well made or put together & the acting could have been better but at least he tried to get as much money as possible on screen even if the film falls short on several occasions. Carnosaur is a terrible film if you look at it from a normal film-goers perspective, however never let it be said that I'm not an individual because, crazy as it may sound, I actually quite liked Carnosaur. There I've said it so sue me. Large chunks of Carnosaur was edited into Raptor (2001) & it spawned two sequels Carnosaur 2 (1995) & Carnosaur 3: Primal Species (1996).",
         "`Carnosaur' is one of the few films that is so cheesy that you enjoy it more than the film probably should. **SPOILERS** A scientist (Diane Ladd) is under government contract to find a new vaccine to fight the common cold. She uses a serum derived from chicken cells, and manages to successfully test it on the residents in a small town in the desert. That same town is experiencing a small crisis as several activists are terrorizing a construction company for their abuse of the environment by their digging up dinosaur territory to build houses. The town is also beset by a wild animal running around and ripping people to shreds. After several murders, the police start to question what is going on around the town. A security guard, (Harrison Page) for the company, finds out that a dinosaur was inside a shipment of chicken eggs that left his company and has now gotten loose. He confronts the scientist, as well as an activist (Jennifer Runyon) that survived a dinosaur attack earlier, in the laboratory and forces her to reveal the truth about her plan: the serum actually made women become pregnant with dinosaurs, who will then attack the rest of the people. She lets a T-Rex loose, and after an attack on the town, the T-Rex is finally stopped at the construction site. The Good News: The main reason why this series of films were made is the gore, and with this one, that holds true. Not as gory as part two, but this one is still pretty gruesome. Several people get limbs bit off, one gets his head ripped off, and others get pulled to pieces in a shower of blood. The limbs and head getting ripped off is the more realistic of the gore, as they are pulled off in one piece with a lot of tissue and muscle pulled off with them. It was very well done and is the most realistic thing done in the film. The rest of the special effects aren't that well done, but it is still nice to watch them attempt to make realistic dinosaurs. The best part of the movie is the obvious cheeziness of the movie and how it revels in it. There are so many scenes where the dinosaur is so obvious a man's hand in a puppet walking along the scenery or the puppet used for the dinosaur is so different from the other puppets used that it adds to the charm of the movie. Some people may hate that, but I find it to be the charm of the movie. I like those kinds of movies, where it's so obviously bad that it doesn't try to hide how low the budget for it was. Those are a nice break from the films that are done with a big FX budget and try to wow you with that big budget. I'm also slightly embarrassed to say this, but this film did make me jump a few times. Strangely, not one was a scene involving a dinosaur. It was usually something that happened that I wasn't expecting to happen, like a pair of headlights coming on suddenly or a guy walking into frame that you didn't know was there. It does deliver some scares, just not the ones you expect would come from in a horror movie. It also has a more ingenious way of bringing the dinosaurs around than `Jurassic Park,' which came out the same year. The Bad News: I don't know why people are saying that Diane Ladd did a good job in this movie. I thought she did a really awful job in her role. She never really made that big of an impression on me. In fact, the whole cast was really terrible. It wasn't a huge cast, as most of Roger Corman's films are, but not one was really all that memorable. It was also very short. I thought they could've squeezed at least ten more minutes into it. I also kind of hated the confusing ending. It was totally dark and it fit the tone of the movie, but it was a bit of a downer. I don't want to ruin it, but it will leave you speechless as it was confusing and brought up some important questions. The Final Verdict: If you thought `Jurassic Park' was a weak movie, this one may be for you. The better one is the individual preference. Those that like gore will prefer this one; story and realistic dino lovers will want `Jurassic.' It does have a lot more redeeming factors that you would expect, and it deserves at least a look or a rental, as it isn't a cult classic for nothing. Rated R: Graphic Violence, Graphic Language.",
         "This is one of my all time favorite movies. I believe it is excellent in almost every way. The only reason everyone on this page hates this movie was because the special effects couldn't compete with Jurrasic Park. They may say they disliked it for other reasons, but in reality, they are just kidding themselves and trying to find flaws that aren't there so they look like they aren't effects-hungry morons who can't enjoy a film unless it has at least 10 minutes worth of CGI. Also, this movie asks its audience to suspend its disbelief, due to the fact the plot isn't very realistic, but as usual, the American people aren't willing to do that and just want to be mindlessly entertained. First off, the plot, while unrealistic, is very creative and inteligent. The style is very creepy and depressing. The fact that this movie is filled with black humor and delights in vulgar nastiness makes this a very strange film indeed, but this is very refreshing due to the fact that it's a dinosaur movie (how many other dinosaur movies do you know about that are like this one?) and the style never detracts from the fun-factor. The acting is excellent and the characters are much more interesting than any that were in Jurrasic Park. Also, the special effects are not bad. While not excellent by any standard, they are still, fun, creepy, and convincing. You never see any zippers, strings, holes, or other such flaws, and the dinosaurs never appear to be \"floating\" or anything like that. And lastly, (A) despite popular belief, a raptor never laughs at any point. There is one scene where one grunts and breathes hard, and it does sound a bit like laughter, but it was obviously not intended to sound that way, and (B) this is not a Jurrasic Park rip-off. Rip-offs steal ideas and stories. Carnosaur doesn't do this. It was definitely made to cash in on the success of Jurrasic Park, but is a very different movie overall. So in conclusion, I think Carnosaur simply RULES!!!!!!!!!! To all you people badmouthing it, I hope a green and mean raptor visits you tonight...",
         "I've seen \"Carnosaur\" twice. Judging from the tone of the previously submitted comments, there are two kinds of people in this world: those who think \"Carnosaur\" was an atrocious plagiarism of \"Jurassic Park\" and those who think \"Carnosaur\" was a misunderstood masterpiece. I have to say I stand firmly entrenched between the two extremes. \"Carnosaur\" had the potential of being a REALLY good horror movie. It's very dark and brooding, and you watch it and you feel like the world is about to end. The plot is unique and different from the typical \"dinosaur-runs-amok\" movie. But a couple of things really hold this movie back. First, the special effects are awful. Since the movie didn't have a \"Jurassic Park\" budget, I don't expect \"Jurassic Park\" effects. But I also don't want to see a Velociraptor that looks like Kermit the Frog's big brother, either. The thumbnail says this movie was released in 1993, but the special effects give it the feel of a movie that was made 10 years earlier and kept locked in a safe somewhere until the right moment for release (presumably, to capitalize on the \"Jurassic Park\" craze). There are also a few silly moments that will have you scratching your head. (I mean, it's a dinosaur movie so you do have to suspend realism to a certain extent, but Dr. Tiptree laying an egg is just a little much). It does have an ending that's as dark as the rest of the movie, which I like here. If they had refined the plot a little and worked on the special effects, I'd give it a much higher rating.",
         "Probably best remembered as being 1993's other \"dinosaur movie\", this tale has a brilliant scientist finding a way for women to give birth to dinosaurs & all the havoc that follows as a result of it, growing to an enormous size, they soon start treating humans as lunch, unless two people can stop them & put these nasty predators back into extinction. CARNOSAUR was a fun B movie that I much admired, however I was shocked to see that many reviewers on the board don't share the same views, despite some good reviews, the majority have been negative, personally I don't see why, CARNOSAUR makes for an interesting B movie, the acting & directing is good & the special effects are well handled & believable which is quiet a feat since the budget was very small. In terms of competition, I don't think CARNOSAUR was mean't to compete up against JURASSIC PARK, it was just made for the direct to video market to make a little extra cash while fans waited for JURASSIC PARK to hit video or come to theaters, (I can't remember which one made it out first at the time). All in all, if you want a cheesy fun B movie, I say check this out, it's much more intelligent than what passes as most B movie efforts, just don't expect something that will surpass JURASSIC PARK & you should have a ball. ***1/2 stars",
         "I saw this film for the first time when I was in high school. My friends and I were looking for a bad horror flick, and we were right on our renting fee money when we picked out this gem. If you want to watch a movie that is scary, uses realistic-looking-dinosaurs, and authentic-looking blood and guts, then this movie is not right for you. Do not take it even remotely seriously. If you are looking for a good laugh, then, please, take this movie seriously. Somewhere between the horrible cinematography, several messily mauled treehuggers, and the science that completely lacked any validity whatsoever, I found myself actually rolling on the floor, convulsing with laughter. I now proudly own the entire trilogy of Carnosaur-ridden hilarity. If you have seen Ed Wood and became intrigued with bad cinema, then Carnosaur should be just right for you."
      ],
      "genres": [
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": ["New Horizons Picture"],
      "summaries": [
         "A brilliant geneticist, Diane Ladd, plans to expose a lethal virus to every human being on the planet. Her objective: to destroy humankind in favour of her new strain of prehistoric dinosaurs. Two people stand in the way of her diabolical plan, a cynical night watchman and a lovely idealistic environmentalist. The two must overcome their differences long enough to uncover the scientist's scheme and fight her carnivorous creations in a desperate battle against the extinction of the human race.",
         "Dr. Jane Tiptree, a brilliant geneticist who feels that Dinosaurs need never die and with government funding arranges to bring back dinosaurs using chicken eggs (because some moron says dinosaurs are giant chickens). One of her new and improved carnosaurs escapes and runs amok in a small town while his big brother is waiting to be set loose on the city. Unless the truth can be unleashed, it could be a new dawn for dinosaurs driving mammals to extinction.",
         "A genetically manipulated and very hungry dinosaur escapes from a bioengineering company and reeks havoc on the local desert town."
      ],
      "budget": 1000000
   },
   "movielensId": 3572,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1993-05-21",
      "dvdReleaseDate": "2000-04-18",
      "directors": [
         "Adam Simon",
         "Darren Moloney"
      ],
      "runtime": 83,
      "movieId": 3572,
      "title": "Carnosaur",
      "mpaa": "R",
      "actors": [
         "Diane Ladd",
         "Raphael Sbarge",
         "Jennifer Runyon",
         "Harrison Page",
         "Ned Bellamy",
         "Clint Howard",
         "Frank Novak",
         "Ed Williams",
         "George Perez",
         "Andrew Magarian",
         "Brent Hinkley",
         "Lisa Moncure",
         "Myron Simon",
         "V.J. Foster",
         "Martha Hackett",
         "Maud Winchester"
      ],
      "imdbMovieId": "0106521",
      "originalTitle": "Carnosaur",
      "genres": [
         "Horror",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["M0wP4rP6R70"],
      "plotSummary": "After being driven to extinction, great bloodthirsty dinosaurs come back to life with the assistance of a demented genetic scientist. She plans to replace the human race with a super-race of dinosaurs who will not pollute the planet.",
      "tmdbMovieId": 39283,
      "avgRating": 1.6743,
      "releaseYear": "1993",
      "numRatings": 393,
      "posterPath": "/c5BRRRIbM7ZOhGHITbJGVpDpDi7.jpg"
   }
}