{
   "tmdb": {
      "original_language": "fr",
      "keywords": [{
         "name": "dinosaur",
         "id": 12616
      }],
      "imdb_id": "tt0112634",
      "video": false,
      "title": "Carnosaur 2",
      "recommendations": [
         55667,
         39283,
         28508,
         83409,
         55670,
         68478,
         76403,
         67716,
         110336,
         30120,
         43230,
         43312,
         29883,
         114540,
         24605,
         45830,
         322505,
         28775,
         38500,
         42302
      ],
      "backdrop_path": "/wMpoXjaHgURcsP7u9mGAlEzHzXy.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Jack Reed",
               "gender": 2,
               "credit_id": "52fe470bc3a368484e0b2043",
               "name": "John Savage",
               "profile_path": "/4cNKdr2E2gAvAjjydcwJGscoBsD.jpg",
               "id": 47879,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Maj. Tom McQuade",
               "gender": 2,
               "credit_id": "5305abd6c3a3685a8716447d",
               "name": "Cliff De Young",
               "profile_path": "/iJvJBQ5PBP5CXGEhznwB7M5JTRD.jpg",
               "id": 1272612,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Ben Kahane",
               "gender": 2,
               "credit_id": "5305abe4c3a3685a6a13b949",
               "name": "Don Stroud",
               "profile_path": "/7jT8523HL3myVWDXPpNOqf9Ubp0.jpg",
               "id": 69494,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Sarah Rawlins",
               "gender": 0,
               "credit_id": "5305abf6c3a36816bc13c8b3",
               "name": "Arabella Holzbog",
               "profile_path": null,
               "id": 42967,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "'Monk' Brody",
               "gender": 2,
               "credit_id": "54bb74a39251416e60001079",
               "name": "Rick Dean",
               "profile_path": "/1Ef7PZ7qOvqmBLZWPrAOT6XsgTM.jpg",
               "id": 101850,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Jesse Turner",
               "gender": 2,
               "credit_id": "54bb76839251416e600010a8",
               "name": "Ryan Thomas Johnson",
               "profile_path": null,
               "id": 1414872,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Ed Moses",
               "gender": 2,
               "credit_id": "54bb7697c3a3686c61007979",
               "name": "Miguel A. Núñez, Jr.",
               "profile_path": "/7uju1sYJOoT78cHpxVk0Sspo3S7.jpg",
               "id": 74354,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Joanne Galloway",
               "gender": 1,
               "credit_id": "54bb76d2c3a3687c40001210",
               "name": "Neith Hunter",
               "profile_path": "/uAjVtE963QH35vbSlLQt8kzqtHl.jpg",
               "id": 42556,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Joe Walker",
               "gender": 2,
               "credit_id": "54bb76f7c3a3686c6b0095f1",
               "name": "Guy Boyd",
               "profile_path": "/ahvU3lBt1Ydauz8qOyWdz4RGnXa.jpg",
               "id": 19752,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Evac. Team Pilot",
               "gender": 2,
               "credit_id": "54bb7762c3a3686c61007986",
               "name": "Michael McDonald",
               "profile_path": "/5HiNCkBAMdhj3sz1eTfgcsl6wuQ.jpg",
               "id": 178926,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Evac. Team Officer",
               "gender": 0,
               "credit_id": "54bb77d2c3a3681411004d6d",
               "name": "Christopher Murphy",
               "profile_path": "/wAQOATJBZxsCH0b2djT4MUKgPTR.jpg",
               "id": 551894,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe470bc3a368484e0b203f",
               "name": "Louis Morneau",
               "profile_path": null,
               "id": 65420,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "53ab38800e0a267612000484",
               "name": "Roger Corman",
               "profile_path": "/gCfEvxl7jTv2dBo8HvwWVMi3auz.jpg",
               "id": 102429,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "54bb7839c3a3686c6b009615",
               "name": "Michael Palmer",
               "profile_path": null,
               "id": 200520,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 1.956181,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 65460,
      "vote_count": 15,
      "budget": 0,
      "overview": "A team of scientists go to a nuclear mining facility to investigate a possible meltdown and instead find a large amount of cloned dinosaurs.",
      "similar": [
         329,
         88751,
         135397,
         351286,
         18890,
         18162,
         10567,
         15997,
         425,
         105864,
         55341,
         124905,
         8967,
         8355,
         254,
         1593,
         278154,
         49519,
         249170,
         12144
      ],
      "original_title": "Carnosaur 2",
      "runtime": 83,
      "poster_path": "/bGuXeWTn6JNYcGdORwvSSI2U5BI.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "New Horizons Picture",
         "id": 20235,
         "origin_country": ""
      }],
      "release_date": "1995-02-23",
      "vote_average": 4.7,
      "belongs_to_collection": {
         "backdrop_path": "/f0YLrOzjtUpVO0oMYLbLK4m3fqJ.jpg",
         "name": "Carnosaur Collection",
         "id": 256484,
         "poster_path": "/jzhDqXOiXz1UfmeLYS8H6HVAs52.jpg"
      },
      "tagline": "Extinction is a thing of the past.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Louis Morneau"],
      "runtime": 83,
      "synopsis": null,
      "writers": ["Michael Palmer"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0112634/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY4Njc0Njc4NV5BMl5BanBnXkFtZTcwNTkzMTMyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: John Savage, Cliff De Young, Don Stroud | See full cast and crew »"],
      "reviews": [
         "`Carnosaur II,' while borrowing very liberally from another movie, is a great movie in and of itself. **SPOILERS** At a top-secret mining facility, strange accidents happen and workers begin disappearing. A special task force is organized to into the mine and tries to get it operational, but when they arrive, the site is completely deserted and the whole place is littered with human remains. They do find a young boy, (Ryan Thomas Johnson) whose father worked in the mine and is now in shock. The government agent in charge, (John Savage) is apprehensive about letting the soldiers know the true reason for the base, and successfully blocks many attempts to find out. Upset over his team's attempts to find out anything, their captain (Don Stroud) goes into the forbidden bowels of the mine to see what is going on and is savagely mauled by an unseen animal, who drags him down to even lower levels. They escape and try to fly away, but a raptor takes control of the helicopter and crashes it, leaving the team and the boy stranded. They decide to send a message that they need rescuing by crashing the security systems, but that only releases the dinosaurs held below into the facility. With only a few members left, they see a rescue chopper, and leave to escape, but a giant T-Rex crashes the party, until it is finally sealed inside the mine when it is destroyed in a nuclear explosion. The Good News: To me, this is simply `Aliens' with dinosaurs instead of aliens. That isn't a bad thing, because 1) I have this fact written in the good news instead of bad news, and 2) `Aliens' is a classic movie, and to me, this is at least a good movie. Those who have seen `Aliens' will see so many identical plot devices and scenes between the two movies. For one, `Aliens' has a mining company on a distant planet lose contact with their home base and has a team of Marines sent in to check out what went wrong. `Carnosaur II' has a mine break contact with their home base and a Special Ops team is sent in to investigate. Once there, the Marines find the place deserted. The Special Ops team finds the place deserted and the bodies torn to pieces. The Marines find a little girl, hiding from the monsters in the facility. The Special Ops team finds a young boy hiding from the dinosaurs. After descending into the depths of the facility, the Marines find a nest of aliens, which kills two Marines. The Special Ops team goes into the lower levels of the mine and finds a nest of dinosaurs, killing two of them. The Marines race outside waiting to be rescued, only to have an alien in the space craft that attacks the female pilot, causing it to crash. The Special Ops team races outside of the mine, looking to be rescued, with a dinosaur inside the helicopter that attacks the female pilot, causing it to crash. The Marines set traps for the aliens inside the tunnels that pick off many different aliens. The Special Ops team sets traps inside the tunnels of the mine that kills several dinosaurs. After everyone but the survivors have died, they come face-to-face with the Alien Queen, who kills one more person in the most hideous way in the entire movie. After everyone has died, the survivors come face-to-face with the T-Rex, who kills one more person. The hero manages to kill the Alien Queen by trapping it inside a container with a highly mechanical piece of equipment. The hero manages to trap the T-Rex inside the mine with a highly advanced piece of mechanical equipment. There are even more similarities between the two movies, but I want to keep some things a surprise, even though I have given away almost everything about the movie. The major improvement over the first two was that this one has a lot better characters in it that do a better job with acting. The actors do a better job in this one. Also done better in this one is the gore. There is a lot more gore in this one as well as it being done far more realistically. The limbs being ripped off looked far better, as they were sinewy and had more blood from them. The Bad News: Ok, so the dinos still look terrible, and I could go on for days about how fake the T-Rex is at the end, but then again, do I really have to. The Final Verdict: If the only bad thing is how fake the dinos looked, this is a good film. The similarities could be taken either way, but I thought it worked. It is a better movie than the first one and, if you like the first one, you'll like this one just as much. Rated R: Graphic Language, Graphic Violence",
         "This movie takes a lot of things from other movies, such as Aliens, Apocalypse Now, Terminator 2, and some others. The acting is better than in the first, and the special effects are not the greatest, but it is better than the other 2.",
         "Well I must say that I did really enjoy this movie. I know this thing is no where near perfection, and I'm not judging this movie based on that. I am a big movie watcher and I must say that I was able to sit through the movie all the way through and stay pretty interested to see what was going to happen. I was actually impressed with the dinosaur affects. The velociraptors were actually pretty cool looking. These dinos looked more vicious than the ones in the first one did. It gave the Carnosaur title more meaning i think. I did notice the tyrannosaurus was the same from the first one, but this movie used it more which i think that was a plus. Overall the acting was mediocre, I thought John Savage was pretty good. The nice thing about no name or mediocre named actors is you don't really know who is going to die. You may get an idea, but you still watch to see how its going to go down. I would recommend this movie if your bored and nothing is really on TV. It is definitely worth watching. It is much much better than the first Carnosaur and even better than the lame Carnosaur 3. I would say this is the best of the serious. Even though its got the alien like plot but another fun factor is that the team going in there to repair the plant aren't armed to all living hell with guns. I'd say this movie learned a little from the first Carnosaur and then watched Aliens and was like, \"hey, we can make a dino sequel!\" I give this movie an 8 out of 10 simply because its better than the first and way better than the 3rd, but a fun movie overall and if your disappointed then you'll be only losing a buck at family video lol.",
         "Carnosaur 2 is the best entry in the series. If you ignore the rubbish dialog, this film might come across as decent for a (very) cheap horror flick. Compared to the original Carnosaur, this one is a masterpiece. The gore is less severe and obnoxious, The creatures are shot in a such a way that for most of the time they don't look too rubbery. Most importantly however is the fact that the plot is far more coherent than the original, Part of it has to do with copying almost directly from the well written screeenplay of Aliens. For a cheap budget, the set design is pretty good and gives the movie a dark, industrial feeling. The acting is stiff and unrealistic, but again, next to Carnosaur it is acceptable. I would not recommend this film to everybody, only to extreme horror fans.",
         "This is the best of the series. It has pretty good effects (killings, not the dinosaurs)and pretty good acting, plus what a cast! John Savage, Cliff De Young, Don Stroud, Rick Dean, pretty Neith Hunter and genre favorite Miguel A. Nunez Jr. A bunch of male and female soldiers or mercenaries, are hired to investigate what has happened in a government facility where they were experimenting with dinosaur DNA. There they meet a teenager, who happens to be the only survivor. Soon, the start dying in somewhat gory ways (especially the woman in the elevator getting her arm ripped off) as the dinosaurs tear them to pieces. I had more fun watching this than Jurassic Park.",
         "I admit I went into this movie expecting cheese (having been previously warned a few years before) but I never expected what I saw could both be good and bad. The story doesn't really go anywhere, and the characters are almost strait from Aliens. A team of people (nobody I've talked to seem to know who or what they are) are sent into a government research facility to get the place back on line, though the government apparently forgot to ask why it was off-line to begin with. People die, choppers crash, and all kinds of things happen, but if you try to spot the scenes reminicent of Aliens, then it actually becomes kinda fun (be sure to add in the \"get away from her, you B****\" line near the end). As far as acting goes, not too bad. It just would have helped to have something of a plot or dialog. A must-see for B-moviers, just for the laughs.",
         "Whereas the first was a Monster-on-the-loose in a small town kind of movie, this one is much more of a cramped low-lighted enclosed-space survival horror along the likes of the video game Dino Crises. To start off, I want to To start off, I want to make it clear that Aliens is one of my all-time favorite science fiction/horror movies, and this movie is Aliens. It's as if they took the exact same script but turned Ripley into a male, Newt into a male, set it at a facility in the desert instead of another planet, and replace the aliens with Raptors, and then you've got this movie. I am not kidding when I say it's the exact same movie as Aliens. Even some of the dialog is word for word the exact same. And you know what? I'm fine with that, because it ended up making for a damn entertaining movie. I always say that if you're going to rip something off, rip off something good.",
         "Take \"Aliens.\" Replace the far-flung planet with a military base in the middle of Nevada. Replace the xenomorph Alien creatures with Velociprators and a Tyrannosaurus rex. You now essentially have \"Carnosaur 2.\" That's not to say this a bad movie or that Roger Corman & Co. should go to jail for plagiarism. Every movie is derived somehow from an older movie. For all the talk about plagiarizing \"Aliens,\" nobody remembers that the original \"Alien\" was sued by the creators of the old '50s horror movie \"It! The Terror from Beyond Space\" because they felt like the essentials of \"Alien\" were lifted from their movie. \"Carnosaur 2\" is your basic \"mosnters-run-amok\" movie that doesn't do anything to distinguish itself from any other \"monsters-run-amok\" movie. The characters are goofy and you can tell pretty early in the flick who's going to make it and who won't. But for what it is, \"Carnosaur 2\" is an entertaining watch if you have nothing else to do, or if you're with friends and you want to play \"Mystery Science Theater 3000.\" It's not quite as dark and gloomy as the original \"Carnosaur,\" and has absolutely nothing to do with that movie either. But I give it a 5 out of 10.",
         "To all you people badmouthing this movie, I have this to ask: What the heck were you expecting? Another Jurassic Park? An epic dinosaur movie with the most mind-blowing special effects since Aliens? If you were, than I am seriously tempted to smack you on the side of the head and start ranting about how mind-numbingly stupid you are, but I think I will stick to the subject at hand and explain why I love this movie so much. First of all, the special effects were good. Not great by any standard but still good. The dinosaurs LOOKED good but their movements were a bit stiff. Secondly, the acting was good and the characters were well developed and likeable. Next, there was some genuine suspense in this movie. Granted, you can kind of tell who is going to survive from the begining, but the action moves at such a great pace that you soon forget that it is obvious who will live. Just in case you don't forget, there is a nice plot twist towards the end involving the (spoiler ahead! spoiler ahead!) fate of the female lead that will keep you on edge for the rest of the film. True, it is not very original (in fact it is a downright ripoff of ALIENS) but I wouldn't worry about that too much since the film just works so well. This is a must-see. I give Carnosaur 2 **** out of ****.",
         "Movie fans usually scoff when they hear the words \"direct to video\", since a film would not fall into that category if its budget and production values were capitalized on by major studios, but sometimes a few of these little flicks can become hidden gems due to an experienced producer such as Roger Corman, and a cast that puts their heart and sweat into it regardless of its profit or notoriety. The sequel to the campy B-movie, \"Carnosaur\" is obviously inspired by the big box office hit sequels of yester-year such as \"Aliens\", Terminator 2, and \"Predator 2\". Creators use the technique of not introducing the identity of the creatures for the first third of the film, and the creature stalks its prey through corridors and ventilation ducts, disposing of the cast one by one in gory ways. This time, the head of US Defense, Cliff De Young hires a mercenary squad of hotheads to investigate electrical malfunctions at a classified military mining facility that happens to be inhabited by the prehistoric monstrosities that killed off the whole staff as a result of their shady genetic experiments and cover-up of nuclear weapons. Now the cast must either fight or become lunch. Sound familiar? By now you should know what to expect. The dinosaurs look just as plastic and fake as before, but an energetic cast of underrated character actors including John Savage, Don Stroud, and Rick Dean keep it lively and entertaining. Combined with some witty dialog and nice directorial touches, C2 should be a crowd-pleaser amongst B-movie genre fans thats up to par with if not better than its predecessor. Its followed by another sequel, Carnosaur 3: Primal Species, believe it or not."
      ],
      "genres": [
         "Action",
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Concorde-New Horizons",
         "New Horizons Picture"
      ],
      "summaries": ["A team of scientists go to a nuclear mining facility to investigate a possible meltdown and instead find a large amount of cloned dinosaurs."],
      "budget": 0
   },
   "movielensId": 3573,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-02-23",
      "dvdReleaseDate": "2000-04-18",
      "directors": ["Louis Morneau"],
      "runtime": 83,
      "movieId": 3573,
      "title": "Carnosaur 2",
      "mpaa": "R",
      "actors": [
         "John Savage",
         "Cliff De Young",
         "Don Stroud",
         "Arabella Holzbog",
         "Rick Dean",
         "Ryan Thomas Johnson",
         "Miguel A. Núñez",
         " Jr.",
         "Neith Hunter",
         "Guy Boyd",
         "Michael McDonald",
         "Christopher Murphy"
      ],
      "imdbMovieId": "0112634",
      "originalTitle": "Carnosaur 2",
      "genres": [
         "Horror",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A team of scientists go to a nuclear mining facility to investigate a possible meltdown and instead find a large amount of cloned dinosaurs.",
      "tmdbMovieId": 65460,
      "avgRating": 1.47753,
      "releaseYear": "1995",
      "numRatings": 178,
      "posterPath": "/bGuXeWTn6JNYcGdORwvSSI2U5BI.jpg"
   }
}