{
   "tmdb": {
      "original_language": "fr",
      "keywords": [{
         "name": "dinosaur",
         "id": 12616
      }],
      "imdb_id": "tt0115834",
      "video": false,
      "title": "Carnosaur 3: Primal Species",
      "recommendations": [
         65460,
         39283,
         90941,
         92787,
         28305,
         88410,
         124536,
         28142,
         55670,
         92698,
         68478,
         61031,
         68714,
         92562,
         42302,
         28508,
         29542,
         64342,
         67716,
         92779
      ],
      "backdrop_path": "/cG8JfLpTUdzNTOHI8xRJLpeZd1X.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Col. Rance Higgins",
               "gender": 2,
               "credit_id": "52fe48dac3a36847f817cc55",
               "name": "Scott Valentine",
               "profile_path": "/rpuoosMHy5bALNvAOzN8ucL0k3k.jpg",
               "id": 24519,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Dr. Hodges",
               "gender": 1,
               "credit_id": "52fe48dac3a36847f817cc59",
               "name": "Janet Gunn",
               "profile_path": null,
               "id": 56984,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Polchek",
               "gender": 2,
               "credit_id": "52fe48dac3a36847f817cc61",
               "name": "Rick Dean",
               "profile_path": "/1Ef7PZ7qOvqmBLZWPrAOT6XsgTM.jpg",
               "id": 101850,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Gen. Pete Mercer",
               "gender": 2,
               "credit_id": "5824ff97c3a36802c00048b2",
               "name": "Anthony Peck",
               "profile_path": "/57e2de2WH5jFm6AJYNTSSjGymtS.jpg",
               "id": 141747,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Sanders",
               "gender": 0,
               "credit_id": "5824ffa59251416d29004b90",
               "name": "Rodger Halston",
               "profile_path": "/u6y2rq8zYjqWRNcee5cBpOQz5yx.jpg",
               "id": 106486,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "B.T. Coolidge",
               "gender": 1,
               "credit_id": "5824ffb2c3a36802d60044b0",
               "name": "Terri J. Vaughn",
               "profile_path": "/l3KPUkz0LtwFEHV73MnYWZ0YOTG.jpg",
               "id": 74613,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Ferguson",
               "gender": 0,
               "credit_id": "5824ffbb9251416d1f004a5f",
               "name": "Billy Burnette",
               "profile_path": null,
               "id": 106489,
               "order": 6
            },
            {
               "cast_id": 3,
               "character": "Rossi",
               "gender": 0,
               "credit_id": "52fe48dac3a36847f817cc5d",
               "name": "Morgan Englund",
               "profile_path": null,
               "id": 182162,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Sergeant",
               "gender": 2,
               "credit_id": "5824ffc49251416d2c004b4b",
               "name": "Stephen Lee",
               "profile_path": "/drAixjx9vjshLlGpWq0m4V5bYIg.jpg",
               "id": 91537,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Proudfoot",
               "gender": 1,
               "credit_id": "5824ffce9251416d22004973",
               "name": "Justina Vail",
               "profile_path": "/bSeWJzwcBgl7Z46ZQwGyGqtEqFB.jpg",
               "id": 185414,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Dolan",
               "gender": 0,
               "credit_id": "5824ffd79251416d2200497e",
               "name": "Cyril O'Reilly",
               "profile_path": "/e9c8qaVnuckiZfc8xSkjFifVaGt.jpg",
               "id": 64224,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Police Officer Wilson",
               "gender": 2,
               "credit_id": "5824ffeac3a36802ca004b64",
               "name": "Michael McDonald",
               "profile_path": "/5HiNCkBAMdhj3sz1eTfgcsl6wuQ.jpg",
               "id": 178926,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Bob",
               "gender": 2,
               "credit_id": "5824fff59251416d1f004a89",
               "name": "Jonathan Winfrey",
               "profile_path": null,
               "id": 102688,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Pvt. Spinkins",
               "gender": 2,
               "credit_id": "582500029251416d1b0048a7",
               "name": "Rodman Flender",
               "profile_path": null,
               "id": 50719,
               "order": 13
            },
            {
               "cast_id": 19,
               "character": "Mulcowsky",
               "gender": 2,
               "credit_id": "5825000cc3a36802c2004ca9",
               "name": "Bob McFarland",
               "profile_path": "/eWUWQER26gc5Q4UnGlJlMRP5gFN.jpg",
               "id": 103595,
               "order": 14
            },
            {
               "cast_id": 20,
               "character": "Emilio Garcia",
               "gender": 2,
               "credit_id": "58250017c3a36802c7005017",
               "name": "Paul Darrigo",
               "profile_path": null,
               "id": 98119,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe48dac3a36847f817cc67",
               "name": "Jonathan Winfrey",
               "profile_path": null,
               "id": 102688,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe48dac3a36847f817cc6d",
               "name": "Roger Corman",
               "profile_path": "/gCfEvxl7jTv2dBo8HvwWVMi3auz.jpg",
               "id": 102429,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe48dac3a36847f817cc73",
               "name": "Scott Sandin",
               "profile_path": null,
               "id": 69662,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe48dac3a36847f817cc79",
               "name": "Rob Kerchner",
               "profile_path": null,
               "id": 69661,
               "department": "Writing",
               "job": "Story"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 2.564048,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 55667,
      "vote_count": 14,
      "budget": 0,
      "overview": "International terrorists get a surprise when their cargo turns out to contain living dinosaurs. The army commando team now have to think fast, if they want to prevent the extinction of the human species, instead of the reptiles.",
      "similar": [
         329,
         88751,
         135397,
         351286,
         18890,
         18162,
         10567,
         15997,
         425,
         105864,
         254,
         1593,
         55341,
         124905,
         49519,
         8967,
         8355,
         278154,
         249170,
         12144
      ],
      "original_title": "Carnosaur 3: Primal Species",
      "runtime": 85,
      "poster_path": "/ewNhASQV6zZnzomND2m1VBfs2Hh.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1996-11-21",
      "vote_average": 4.7,
      "belongs_to_collection": {
         "backdrop_path": "/f0YLrOzjtUpVO0oMYLbLK4m3fqJ.jpg",
         "name": "Carnosaur Collection",
         "id": 256484,
         "poster_path": "/jzhDqXOiXz1UfmeLYS8H6HVAs52.jpg"
      },
      "tagline": "Terror will never be extinct.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jonathan Winfrey"],
      "runtime": 85,
      "synopsis": null,
      "writers": ["Rob Kerchner"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0115834/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU3ODE5ODA2Nl5BMl5BanBnXkFtZTcwMjQxOTAzMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Scott Valentine, Janet Gunn, Rick Dean | See full cast and crew »"],
      "reviews": [
         "Here in England, we've not had the pleasure of seeing Carnosaur 1+2 and the film is just titled \"Primal Species\". Without the precedent of such un-doubtedly classic prequels, I had no idea what the film would be like (except for some guesswork based on the video cover). Nothing much needs to be said about the film except that it is one of the worst of the worst of the worst films ever. Not that that's a huge criticism. It's extremely entertaining. To be honest the sight of those men in rubber dinosaur costumes was funnier than many proper comedies. Equally funny is the swat team leader's constant smirk and attempts to sound hard. The main death's were enjoyable too, firstly because the sight of fake monsters chewing on people is funny, and secondly because it meant that another annoying character had been wiped out. For an alternative night's entertainment, I would recommend this in a double-bill with something like Demolition University. You'll laugh till you ache or simply fall asleep. Either way, you'll be happy.",
         "`Carnosaur III: Primal Species' is an above-average quality sequel in this series of the films. **SPOILERS** A team of terrorists hijacks a top-secret military convoy, thinking they have captured weapons-grade plutonium. Instead, the convoy was carrying dinosaurs, and the dinosaurs attack and kill the squad of terrorists. A military recovery team learns the convoy is stopped in a warehouse on the local waterfront, and immediately goes out to retrieve it. The dinosaurs attack the squad, leaving only three soldiers. Back at their headquaters, their captain (Scott Valentine) refuses to go back unless they kill the dinos, but the scientist in charge of the operation (Janet Gunn) orders them to merely capture the dinos. Heading back out to the warehouse, the team gets additional help with a Marine Task Force. Together, they still can't control the dinosaurs. They finally find a way to get them under control: luring them out to a ship, sailing them out to see and blowing the ship up. The Good News: While this film won't win any awards for its FX, the dinos are still pretty realistic. It's still pretty better than the first one, but the second one is the most realistic of the movies. This film isn't as gory as some would believe, but only a few scenes are actually gory. There is the traditional limb ripped off and even some bloodsplatter, but this is the driest of the three films. The locale of the movie is a nice change, making the switch to a warehouse instead of in an open area like the first one. It was also very good in designing suspense. There was a lot of scenes were you were waiting for a dinosaur to pop out of somewhere and take a bite out of someone, and more often than not, that did happen. I have to give a film some recommendation when it delivers on suspense that it sets up. The Bad News: For some reason, this had some scenes that could've been taken out of the movie, despite the fact that it's barely over 1 hr. and 20 mins. The scenes showing the Soldiers and the Marines getting to know each other could've been trimmed, and several other small scenes could've been cut out. Also, there are a lot of shots of very obvious puppet dinosaurs shown. The T-Rex at the end is a very good example. It looked real in only a few seconds in the whole film. In fact, the dinos are only in a few minutes of the movie. They were missing for most of the movie. I counted only about a half-hour worth of screen time for the dinos. This should've been dragged out far longer for a film about dinosaurs, and it being so short in the first place, would've only made the film that much better. The recasting of Rick Dean, who was Monk in part two as Polcheck in this one, was a nice touch but confusing, as he seems to play the same role in both movies: a wise-cracking soldier who doesn't seem too interested in the rules of the situation. The Final Verdict: If you don't mind watching about a half-hours' worth of dinosaurs in an 1hr. and 20 min movie, this isn't that bad of a movie. It may leave you confused why it's so long with so many scenes that could've been cut out, but it is still a worthwhile edition to the series. Rated R: Graphic Violence, Adult Language.",
         "A group of military troops are trapped in a wear-house where they are killed-off by killer reptilian menaces.Although the dinosaurs are a bit unconvincing,there is some great gore; lots of severed heads and blood splatters,making this one fun b-movie. And actually, the script and direction are not that bad, and the acting and production values are not that bad,when compared to other direct-to-video titles released around the time. Also be on the look-out for a strange (but truly unique) musical score by Kevin Kiner.",
         "All Jurassic Park fans should love this. It's a low budget Jurassic Park only scarier and gorier. It starts off with a few pathetic terrorists trying to steal Uranium to build a weapon but when opening what they've stolen they find out that it's 2 Velociraptors. They've also stolen an asexual reproducing T-rex which appears later in the film. Their mistake proves fatal. The army investigate it. They find out about the Carnosaurs but they have to capture them alive. This proves difficult. The special effects weren't great but at least they didn't hide the dinosaurs so the audience could barely see them. This film is gory so if your squeamish avoid this film at all costs and there is enough gore to satisfy gore hounds. This film is also scary and suspenseful. I recommend this film to all those people who loved Jurassic Park. If you see it and its cheap, buy it! 8 out of 10.",
         "Third & final installment to the killer Dinosaur series, has a group of soldiers under attack by the prehistoric predators whom are still more determined than ever to make man the extinct species. Banning together the soldiers attempt to end the terror once & for all. CARNOSAUR 3 was yet another cheesy B movie treat in the very entertaining CARNOSAUR series. Again the special effects despite the obvious low budget, were well done, the acting was good & the directing held up as well, which is something most B movies cannot lay claim to. There's plenty of suspense & some good action scenes so fans of the first two won't be disappointed, true it may be the weakest in the series, but it never intended to compete with JURASSIC PARK in the first place. A great way to end the series! *** stars",
         "A series of B movies that unlike the usual formula, actually get BETTER as they go along. I have all 3 Carnosaur films on DVD, and I can be honest about them. The first one almost sucks. Luckily it has a few cool parts and grisly special effects to keep it going. The second one has better story and action, raising the standard of the film to \"good\", and by the time we reach Carnosaur 3: Primal Species, we've officially hit good, short, dumb fun. With a perfect mix of Dinosaurs (that actually look pretty nice, especially the T-Rex), with good dialog for the kind of movie it is, a second straight to video sequel, lots of action and humor, it makes you laugh and smile with pure middle-of-the-night-entertainment. If you wanna watch Jurassic Park that bad, then watch it, but don't bitch about how this is a rip-off, because it's not. The book that the original Carnosaur movie is based off of, came six years before Crichton's Jurassic Park was published, so back off it, and enjoy it.",
         "This is one of the most hilariously bad movies I have ever had the privilege to see. I watched this on DVD with a bunch of friends one Friday night and we just couldn't stop laughing from start to finish. The story is simple enough: terrorists hijack a convoy they think is carrying weapons grade uranium, but it's actually carrying a bunch of man-eating dinosaurs. Easy mistake to make. Cue a startlingly incompetent team of Army Special Forces to tackle the prehistoric beasts. They are led by Colonel Rance, played by Scott Valentine; a man who seems to have perfected 'Smell the fart' acting, as advocated by Joey in Friends. There's plenty of gore and an awful lot of shooting, but unfortunately Rance's team seem to have a problem aiming their weapons in the general direction of a horde of giant, lumbering monsters. Also, the lights always seem to flicker and go out whenever a Velociraptor attacks (preumably so we can't see how bad the creature effects are). Having said all that, we all had a great deal of fun betting on who was going to get their head bitten off next. As a Jusassic Park / Aliens style action adventure this movie stinks worse than a dinosaur's crotch, but as ludicrous, tongue-in-cheek entertainment it's a roaring success.",
         "What makes the Carnosaur so frightening is that it kills for the sake of killing. The army kills and destroys for national security. The terrorists kill for their own personal benefit. But the Carnosaur... it just kills! If the carnosaurs killed exclusively for dietary purposes (i.e. they were hungry, they didn't get enough protein/calcium/fat/B-vitamins), they wouldn't necessarily eat humans. The scene in Carnosaur 3, in which the soldiers bait the dinosaur with non- human meat and the Carnosaur instinctively attacks the humans exemplifies how Carnosaurs do not follow their stomachs. If the Carno were hungry, it would have just went for the leg of ham (or whatever the hell the soldiers used for bait), but instead it went for the far inferior human meat. They are called Carnosaurs not because they eat meat, but because they are far different from the reptiles that walked the earth eons ago. They are much more unscrupulous, depraved, stealthy, sexy and cunning than the large clumsy animals seen in Jurassic Park. The Carnosaur is the chthonic species of what we refer to as Dinosaur. Beware their wrath.",
         "******SPOILERS******* Terrorist are terrified when the cargo that they stole was genetically engineered dinosaurs,now they send in a team of Commandos to kill the dinosaurs. My ratings for this movie. ACTING:4/10.THE acting isn't that good especially the main actor in the movie,it's like they made him eat lemons. SPECIAL EFFECTS:3/10.These are the worst dinosaurs i have ever seen.They look rubbery.But the kills scenes are the highlight of this film. CREATURE MAKEUP:10/10.The Raptors in the movie are a lot scarier than the JP Raptors. But the main problem is are the SFX,if the SFX of this movie are a bit more convincing they could take on the JP Raptors any time. MUSIC:10/10.An incredible music score by Kevin Kiner. ACTION:5/10.Gives quite an amount of action,horror and suspense. DIRECTING:6/10.Acceptable directing from Jonathan Winfrey. THE FINAL VERDICT: This is a really fun b-movie except for the FX,i don't care about how people think of this movie.I recommend it",
         "I have loved this film since I was about twelve! The Dinosaurs are ridiculously designed by the awesome John Buechler, but they have the watchable charm and unique-ness that most of his rubbery creations have; the acting is BAD, but there's no one in it I don't want to watch, they're all likable actors and actresses; there's so much blood and gore it could have been shot over the naff sets from a fire-hose, the script is really unimaginative but the cast make it work in a strange sort of way and it's Roger Corman! There are many things wrong with it but I think it's a great way to spend an hour and a half. It's thrilling, involving, and fun. Watch the film!"
      ],
      "genres": [
         "Action",
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": ["Concorde-New Horizons"],
      "summaries": [
         "International terrorists are terrified when their hijacked cargo turns out to be genetically engineered dinosaurs. Now... the army commando team attempting recovery of this secret cargo is about to make the same deadly discovery!",
         "International terrorists get a surprise when their cargo turns out to contain living dinosaurs. The army commando team now have to think fast, if they want to prevent the extinction of the human species, instead of the reptiles."
      ],
      "budget": 0
   },
   "movielensId": 3574,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-11-21",
      "dvdReleaseDate": "2000-04-18",
      "directors": ["Jonathan Winfrey"],
      "runtime": 85,
      "movieId": 3574,
      "title": "Carnosaur 3: Primal Species",
      "mpaa": null,
      "actors": [
         "Scott Valentine",
         "Janet Gunn",
         "Rick Dean",
         "Anthony Peck",
         "Rodger Halston",
         "Terri J. Vaughn",
         "Billy Burnette",
         "Morgan Englund",
         "Stephen Lee",
         "Justina Vail",
         "Cyril O'Reilly",
         "Michael McDonald",
         "Jonathan Winfrey",
         "Rodman Flender",
         "Bob McFarland",
         "Paul Darrigo"
      ],
      "imdbMovieId": "0115834",
      "originalTitle": "Carnosaur 3: Primal Species",
      "genres": [
         "Action",
         "Horror",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["ktSARBr8Rts"],
      "plotSummary": "International terrorists get a surprise when their cargo turns out to contain living dinosaurs. The army commando team now have to think fast, if they want to prevent the extinction of the human species, instead of the reptiles.",
      "tmdbMovieId": 55667,
      "avgRating": 1.30795,
      "releaseYear": "1996",
      "numRatings": 151,
      "posterPath": "/ewNhASQV6zZnzomND2m1VBfs2Hh.jpg"
   }
}