{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "gay relationship",
         "id": 10198
      }],
      "imdb_id": "tt0156460",
      "video": false,
      "title": "Defying Gravity",
      "recommendations": [
         19369,
         47619,
         69746,
         132561,
         20116,
         77616,
         151693,
         86549,
         32728,
         179246,
         99119,
         15976,
         261776,
         140208,
         39517,
         1812,
         64631,
         287855,
         221801,
         248694
      ],
      "backdrop_path": "/5yBSMZ3QWlBTbOuh9xBSQvPyng.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Griff",
               "gender": 0,
               "credit_id": "52fe44ae9251416c91019155",
               "name": "Daniel Chilson",
               "profile_path": null,
               "id": 108665,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Todd Bentley",
               "gender": 2,
               "credit_id": "52fe44ae9251416c91019159",
               "name": "Niklaus Lange",
               "profile_path": null,
               "id": 58113,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Pete Bradley",
               "gender": 0,
               "credit_id": "52fe44ae9251416c9101915d",
               "name": "Don Handfield",
               "profile_path": "/2vLxbryfpoOJOf21r70x7CUEa38.jpg",
               "id": 108668,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Denetra Washington",
               "gender": 0,
               "credit_id": "52fe44ae9251416c91019161",
               "name": "Linna Carter",
               "profile_path": "/9KFXjpSVkTYqeZPRGhINrMO9DPY.jpg",
               "id": 108669,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44ae9251416c91019167",
               "name": "John Keitel",
               "profile_path": null,
               "id": 108670,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ae9251416c9101916d",
               "name": "John Keitel",
               "profile_path": null,
               "id": 108670,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.373624,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 31978,
      "vote_count": 7,
      "budget": 0,
      "overview": "John Keitel wrote the film based on his personal undergraduate experience and filmed campus footage in the neighborhood and environs surrounding his graduate film school alma mater USC.",
      "similar": [
         380874,
         47643,
         413666,
         160165,
         184352,
         383526,
         425193,
         26933,
         258034,
         52799,
         322127,
         26280,
         167571,
         340684,
         449176,
         338189,
         382475,
         199851,
         261776,
         376867
      ],
      "original_title": "Defying Gravity",
      "runtime": 92,
      "poster_path": "/jyyhSMOhyq3SphiwWy2av3W2nfC.png",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Boom Pictures Inc.",
         "id": 5174,
         "origin_country": ""
      }],
      "release_date": "1999-07-09",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "https://www.wolfevideo.com/products/defying-gravity",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Keitel"],
      "runtime": 92,
      "synopsis": null,
      "writers": ["John Keitel"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0156460/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkxMjUzNDY5MV5BMl5BanBnXkFtZTcwNTU2MzMyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Daniel Chilson, Niklaus Lange, Don Handfield | See full cast and crew »"],
      "reviews": [
         "Once in a while you run into a movie that packs a wallop not because it is flawless, but in spite of, indeed almost because of, its flaws. I found the first 20 minutes or so of `Defying Gravity' very hard to sit through, and was still uncomfortable halfway through the film. The depiction of frat life seemed all too convincing; how could we have any sympathy for a main character who would buy into such cheesy `male camaraderie' at its most off-putting? (There is a coarse common term for these frat boys and their behavior, but I'll avoid using it here.) Even when the action moved beyond the suffocating atmosphere of the frat house and the tailgate party -- the evocation of said atmosphere being the first sign, perhaps, that writer-director John Keitel knew what he was doing after all -- I had the uneasy feeling I was watching yet another well-intentioned paint-by-numbers Afterschool Special about coming out, especially when the inevitable clichéd gay-bashing (right down to the baseball bats) took place. But that is precisely when `Defying Gravity' begins to take an unexpected turn, gathering momentum when you least expect it. Once Griff has to face the reality of the consequences of his hiding, this film starts to soar. That's not because the plot ceases to be fairly predictable; it doesn't. What lifts this above most other movies, and certainly many gay-themed flicks, is how squarely and unapologetically it addresses and depicts love in its many forms. There's the true love of friendship between the closeted Griff and the straight, trying-to-understand Todd. (Why is any gay-themed movie with sympathetic straight characters derided as fantasy? Hello! \u0096 understanding straight friends and family really do happen in `real life.' Talk about self-hatred \u0085) There's a brief, but extremely potent, display of parental love (kudos to Kevin P. Wright as Pete's father). And above all, there's the belated but knockout realization of the love between Griff and Pete, in the final hospital scene and the beautiful little coda \u0096 the most powerful emotional payoff I've seen onscreen in quite a while. In terms of conviction, it all puts the more recent, vastly overrated \"Big Eden,\" for instance, totally in the shade. Clearly Mr. Keitel deserves credit for turning this movie around the way he does. And then there's the cast. Nicklaus Lange's finely tuned performance makes Todd a real person, not a buddy wish fulfillment. Don Handfield as Pete has a smaller role than one might anticipate but, crucial to the film's impact, he underplays this more grounded character to perfection. \"Defying Gravity\" ultimately rests, however, on the shoulders of Daniel Chilson as Griff, and boy does he come through: I see something very different here from those who commented on supposedly amateurish acting. Chilson can do more with his face \u0096 particularly his endearing, slightly off-kilter smile \u0096 than many much more highly touted performers. Watch the extraordinarily nuanced play of emotions across that face when Pete's housemate tells Griff `he really cares about you,' and in the aforementioned final two scenes between Griff and Pete. That's what film acting is all about. Bravo, Daniel! When will we see you onscreen again?",
         "Sometimes you just have to forgive all the faults and glitches and go with the flow. I liked this film in spite of its low-budget feel and empty moments, because there is a difference between profound emotion and cheap sentiment, and the script of Defying Gravity reflects the former. In spades. Another pitfall avoided by this writer and director is that of going over the top in caricaturing his leads or allowing the story to become preposterous. The parts dealing with college fraternity life are spot on, including subtexts. (I know this for a fact.) If anything, the more extreme moments of drama are underplayed rather than the opposite. So there is a little political correctness involved -- so what? The moment that Griff turns to Todd on that mountaintop and confesses his feelings for Pete, everything of lesser import in this story vanishes. What remains a mystery is how an actor like Daniel Chilson who shows such promise in this role did not go on to much greater accomplishment. The heart and soul of any straightforward love story is its reflection of the highest and best motivation humanly possible as regards one person's feelings for another. Everything base and immoral is swept aside in a tide of total devotion and deep introspection, hence the notion of defying gravity. I do not know whether this film was made for television or general release. I wish I had stumbled across it sooner. It is a simple, unsophisticated, unpretentious gem.",
         "I went with low expectations, and came out really having enjoyed this movie. Griff and Pete, members of a fraternity at USC, are having an affair. Griff is closeted, and still lives at the frathouse. Pete has left the frathouse, and is on the verge of coming out. He want more from Griff than just sex. Griff is unwilling to have a real relationship (complete with dating, dining, acknowledging a partner), but does not give up on pursuing Pete. Pete even gets Griff to meet him at a gay coffeehouse. Then comes the gaybashing incident that changes everything. The guys in this movie are handsome and believable. The frathouse scenes seem real--they let you understand the camaraderie that make people want to be part of frats, but at the same time deprive them of the room to be themselves. The gaybashing is an overused plot device, but it works to make this into a poignant movie about the dilemmas faced by gays who want to fit in, don't want to risk being open, yet need affection along with sex from another man.",
         "This is an interesting little film that deals with the two greatest fears of any gay person -- coming out and getting bashed. Amidst the macho ritual of a college fraternity, Griff has to change pronouns so that he can hide the fact that he is gay and his date is a \"he\" instead of a \"she.\" The title seems to mean that defying the reality of being yourself is as hard as defying gravity. Notice the symbolic material such as being up a tree and going down a road that is \"Not a through street.\" Griff is frustrated because he must endure listening to his straight friends tells about their romantic adventures. Pete is frustrated because Griff won't allow anyone to know that he and Pete are gay lovers. The pain they are both going through turns to crisis when Pete is gay-bashed and Griff knows something about the crime but is afraid to tell what he knows because that would involve his coming out. For an independent film that was quickly made, the story shows real depth. Despite some awkward dialogue and acting, the movie is worth seeing and is really quite touching.",
         "Defying Gravity is a wonderful film. It's both humorous, as well as heartbreaking, and is a film that I look forward to watching again. Griff (Daniel Chilson) is an all American super jock frat boy. He plays hoops with a Nerf ball in his dorm room, and parties it up while flirting with the girls at football tailgating parties. Griff, however, is also carrying on a sexual relationship with Pete (Don Handfield) behind everybody's back. After being witness to a gay bashing that leaves Pete seriously injured, Griff is forced to deal with his own sexuality, as well as the conflict of outing himself in order to bring Pete's attackers to justice. Say nothing, and he lets down somebody he realizes truly loves him, and wants more than just sex. Come forward, and he'll have to face his frat brothers, as well as himself and the feelings he's discovering he has towards Pete. Both Beautiful Thing and Get Real dealt with \"coming out\" in a syrupy sort of way. This isn't to say those films are bad; Quite the contrary. They are both excellent films that I have seen and own. What I'm getting at is that it's nice to see a film that forgoes the syrup and plays it in less of a fairy tale way. Given the fact that this was the first role for many involved, some of the acting shows strain, and ends up looking amateurish, but that didn't bother me as much as it usually would, and in fact, I think it made the performances seem all the more real. The relationship between Griff and his best friend Todd (Niklaus Lange) is both convincing and sweet. Todd is truly trying to understand and support Griff, even when he has no idea what his friend is going though. The only major drawback I can pick out is that the relationship between Griff and Denetra (Linna Carter) isn't fully explored, and I was left with wanting to see more. Defying Gravity is not a glossy smooth production like either of the films I mentioned above, but that's not a fault, and shouldn't be considered one. Occasionally uneven acting aside, this is a wonderful film that truly has heart and I hope everybody will give it a chance. My grade: A",
         "When I saw this film the first time I had an uncontrollable urge to smile to myself and go \"agghhh\" rather like granny when she looks at a particularly embarrassing baby photo of me. The film has many flaws but I watch it over and over again. The plot is well developed although quite predictable as it progresses. This is however not a thriller. There is some quite good acting from Nicklaus Lange and Don Handfield. Daniel Chilson looks right for the part and tries his best. He is however on a few occasions fairly wooden and ill at ease. I can well understand that his film acting experience had been (still is?) a little low level. The film is professionally produced with good production values. The script was OK. It dealt with plot development well but some of the dialogue was appalling. Do intelligent people talk this way in America? Some of the characters were ghastly stereotypes of gay people. The camp pink shirted activist was I think cast for effect but he made my toes curl! I know these are flaws but don't let that put you off. This is a \"feel good\" film and rather made me think of \"Beautiful Thing\" (time shifted slightly and moved to America). I recommend it to all",
         "Griff's a frat boy. So is Pete. Griff and Pete are lovers. Griff still wants to be seen as straight; so does Pete, though Pete is on the verge of coming out. Griff doesn't like being pressured. But when Pete is injured in a gay bashing, Griff is forced to decide on which side of the fence he must ultimately stand. DEFYING GRAVITY is like one of those moralistic religious shows they used to show on Sunday mornings, mini-soap operas like \"Insight\" where average people found themselves facing difficult choices. Only in GRAVITY, religion is avoided and gay sex has been added. It is sincere. It is sweetly, naively philosophical in its morality. It is likable, but it is simplistic. It is about a man who wants to do the right thing, but has to muster up the moral courage to sacrifice his comfortable life in order to do it. DEFYING GRAVITY is vanilla, both sexually and dramatically. As Griff and Pete, Daniel Chilson and Don Handfield are boy-next-door handsome and kid brother cute. Their sex is PG rated. They are given a mutual best friend (Niklaus Lange) who is unmistakably straight to let us know that it is all right to be gay friendly. Griff's coming to terms with his sexuality is aided by a lesbian acquaintance (Linna Carter) who is black, to better identify being gay with being marginalized. It is all a bit too predictable. Yet, the film is sincere and it is well acted, especially by Chilson who underplays his part with the right amount of repressed, middle-class indecisiveness. And the film's most honest revelation is noting that most great changes in life come after slow deliberation and soul searching. DEFYING GRAVITY is feather weight, though it hardly defies gravity. But as it comfortably sets there taking up space, it is pleasant and inoffensive and delivers it message with utmost politeness. That may make it seem inconsequential, but since most gay films wallow in angry ranting or outrageous camp, GRAVITY's low-key thoughtfulness makes it a little bit different and a little bit special.",
         "For the writer/director's first effort at creating a work of fiction, \"Defying Gravity\" is quite good. While one might quibble about too many plot coincidences, shots of actors held a little too long, or music that attempts to cover up some weaknesses, the film does tell an interesting story and uses good actors to do it. This is better than average film making. Gay coming out films are difficult to bring off for either a gay or a straight audience. This one succeeds very well in holding the interest of both audiences. I look forward to seeing more work by this film maker.",
         "This film was such a wonderful surprise when I saw it in the theater -- multiple times, in fact. Candidly, I liked it because I could really identify with the character of Griffin. The chemistry between Pete and Griff feels very real. Yes, this is a low-budget film and it suffers a bit in production values, but the performances are strong and I enjoy it more with each viewing now on DVD. Some have criticized it for being cliche, but quite the opposite is true: the film is remarkable because of the absence of stereotypes we've come to expect in gay-themed art films: drag queens, dysfunctional families, everyone dying of AIDS, disco music, diva worship, pot-smoking, musical theater fanatics, \"sissies,\" leather daddies, the athletically-challenged...there's none of that here. Griff and Pete are probably the most accurate representation of most gay men that have appeared on the screen to date. They're just like any other guys their age, except that their romantic interests are focused on guys rather than girls. Had this film been made ten years earlier, Griff would almost certainly have been portrayed as a nerdy, unlikable, social outcast; but Griff is every frat boy's best friend. Two thumbs up for this one.",
         "There's a gem of a script here. Clearly the filmmaker is working on a ultra low budget. Many of the supporting cast deliver their lines as if they are in a high school play -- they are painfully wooden. However the idea behind the film is an important one and the film will touch you on multiple levels. I somehow wish this script could get fine tuned and remade as a major production. I feel the film as a lot to say about the pressures of college life -- especially that of living in a frat house on a big ten campus and having to lead a double life. Some of the material for the story appears to have been inspired by the Matthew Shepard story and the film feels extremely relevant. In spite of the low budget nature of the film, see this picture!"
      ],
      "genres": [
         "Drama",
         "Romance",
         "Sport"
      ],
      "productionCompanies": ["Boom Pictures Inc."],
      "summaries": ["Griff wants to maintain just a superficial relationship with his all-gay boyfriend, who gets seriously wounded in a gay bashing."],
      "budget": 0
   },
   "movielensId": 3575,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-07-09",
      "dvdReleaseDate": "2000-04-18",
      "directors": ["John Keitel"],
      "runtime": 92,
      "movieId": 3575,
      "title": "Defying Gravity",
      "mpaa": "NR",
      "actors": [
         "Daniel Chilson",
         "Niklaus Lange",
         "Don Handfield",
         "Linna Carter"
      ],
      "imdbMovieId": "0156460",
      "originalTitle": "Defying Gravity",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["YuL5YfbpoX0"],
      "plotSummary": "John Keitel wrote the film based on his personal undergraduate experience and filmed campus footage in the neighborhood and environs surrounding his graduate film school alma mater USC.",
      "tmdbMovieId": 31978,
      "avgRating": 3.38889,
      "releaseYear": "1999",
      "numRatings": 54,
      "posterPath": "/jyyhSMOhyq3SphiwWy2av3W2nfC.png"
   }
}