{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "africa",
         "id": 409
      }],
      "imdb_id": "tt0167203",
      "video": false,
      "title": "I Dreamed of Africa",
      "recommendations": [
         259658,
         41779,
         24227,
         83714,
         45712,
         40562,
         38635,
         46018,
         10910,
         67822,
         39128,
         25697,
         33657,
         41589,
         41590,
         106143,
         33345,
         48287,
         40688,
         36929
      ],
      "backdrop_path": "/mDKVwFFj5dBkileX4jI9j6QAlLt.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Kuki Gallmann",
               "gender": 1,
               "credit_id": "52fe4414c3a368484e00e3a9",
               "name": "Kim Basinger",
               "profile_path": "/xpv6NgpY0mDr5QSWjZLXy5KlFn9.jpg",
               "id": 326,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Paolo Gallmann",
               "gender": 2,
               "credit_id": "52fe4414c3a368484e00e3ad",
               "name": "Vincent Pérez",
               "profile_path": "/elPFKCVOZyMni2hx7mLlaYkyifD.jpg",
               "id": 20239,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "7-Year-Old Emanuele",
               "gender": 2,
               "credit_id": "52fe4414c3a368484e00e3b1",
               "name": "Liam Aiken",
               "profile_path": "/cKCBZEIRWPSeDkWXJWihPga6vKY.jpg",
               "id": 19977,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Declan Fielding",
               "gender": 2,
               "credit_id": "52fe4414c3a368484e00e3b5",
               "name": "Daniel Craig",
               "profile_path": "/mr6cdu6lLRscfFUv8onVWZqaRdZ.jpg",
               "id": 8784,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Franca",
               "gender": 1,
               "credit_id": "52fe4414c3a368484e00e3b9",
               "name": "Eva Marie Saint",
               "profile_path": "/9DpClOXbxSAsZiwsCnwIPA212pQ.jpg",
               "id": 2639,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Simon",
               "gender": 2,
               "credit_id": "5700373c92514167760030f6",
               "name": "Lance Reddick",
               "profile_path": "/5t4j7zvsjG5UyVxBJzly5OUMR3x.jpg",
               "id": 129101,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Vincenzo",
               "gender": 2,
               "credit_id": "597d09589251415dba007722",
               "name": "Stephen Jennings",
               "profile_path": "/4xolbERE7DgX4qQBzryoAs4DAZP.jpg",
               "id": 1386160,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Duncan Maitland",
               "gender": 2,
               "credit_id": "597d09ad9251415d98007e8c",
               "name": "Nick Boraine",
               "profile_path": "/lcuyeUFhnYVp2YdUscYNFOQxkJ3.jpg",
               "id": 47969,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4414c3a368484e00e3bf",
               "name": "Hugh Hudson",
               "profile_path": null,
               "id": 58220,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "5609d6f7c3a3686814000a38",
               "name": "Susan Shilliday",
               "profile_path": null,
               "id": 37427,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "56c144559251410a62001495",
               "name": "Paula Milne",
               "profile_path": null,
               "id": 139158,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Adventure",
            "id": 12
         }
      ],
      "popularity": 5.287664,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 21311,
      "vote_count": 22,
      "budget": 34000000,
      "overview": "Inspired by the true story of indomitable Kuki Gallmann, the film tells of a beautiful and inquisitive woman who had the courage to escape from her comfortable yet monotonous life in Italy to start anew in the African wilderness with her son, Emanuele, and her new husband, Paolo. Gallmann faces great danger there but eventually becomes a celebrated conservationist.",
      "similar": [
         606,
         9732,
         10527,
         11430,
         7350,
         8587,
         411,
         2454,
         873,
         9273,
         1523,
         258489,
         630,
         284054,
         953,
         10586,
         1372,
         339530,
         14211,
         10603
      ],
      "original_title": "I Dreamed of Africa",
      "runtime": 114,
      "poster_path": "/7ryJpWMbI9YerAYI6dvidGZfOzp.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
         "name": "Columbia Pictures",
         "id": 5,
         "origin_country": "US"
      }],
      "release_date": "2000-05-05",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "Sometimes the adventure of a lifetime becomes life itself.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Hugh Hudson"],
      "runtime": 114,
      "synopsis": null,
      "writers": [
         "Kuki Gallmann",
         "Paula Milne"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0167203/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjc3NzkyMjQzM15BMl5BanBnXkFtZTcwNjk1NzkxMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Kim Basinger, Vincent Perez, Liam Aiken | See full cast and crew »"],
      "reviews": [
         "This film was a fluff piece that succeeded better as a showcase for Kim Bassinger and Africa's natural beauty than it did at telling this true story. The first hour of the film was a succession of Kodak moments depicting the romantic splendor of Africa and how idyllic it would be to live there. Although they showed the occasional storm and threatening wild animal, every effort was made to emphasize the positives. They glossed over little things like the oppressive heat (Kenya straddles the equator but no one in the film ever broke a sweat), insects (not a mosquito in sight), and the fact that the rainy season is three months long and it often rains nonstop for weeks. The first hour seemed more like an advertisement by the Kenyan ministry of tourism than a feature film. It wasn't until the second hour that the story really centered on the characters. Filming Africa is a cinematographer's dream. Unfortunately, Director Hugh Hudson seems to have been so enamored with creating beautiful photography (and it was truly magnificent) that he rushed through the dramatic elements to get to the next helicopter shot of wild animals loping across the plains. Many of the important dramatic scenes were not allowed to fully develop, giving a snippet and then cutting away to a completely unrelated scene. This took much of the impact out of the film. One example is the egg hanging over the bed. A big point was made over the fact that Paolo had put something in the egg. Yet, we never learn what it is. Why tease us with this tidbit if he is not going to follow through? The film had strong conservationist undertones, but they were tastefully done and not overly preachy. The point was made that poaching to hunt elephants for ivory is illegal and unconscionable, but it was presented in a way that wasn't strident and smug. The scenes of dead elephants made the statement in a poignant way, much better than any dialogue could have. Kim Basinger was excellent as Kuki. She went with a more natural look which was very flattering. The understated makeup used in the film revealed that even at 47, she is still one of the most beautiful women on the planet. However, after a three-year hiatus since L.A. Confidential, she delivered her second consecutive acting triumph, proving that she is more than just a pretty face. Her acting was far more genuine and mature than any role I had seen her play before. After having read an interview she gave about the film, it is clear that Basinger is a strong conservationist and naturalist and she identified strongly with her role, which imbued her performance with great conviction and believability. This film was good, but it could have been much better. I rated it a 7/10. The locations and photography were marvelous, but the story's power was frayed by inattention to basic filmmaking tenets. If Hudson had spent more time developing the characters and creating continuity for the story, it would have been an exceptional film.",
         "Boy this movie went to video quickly, and now I understand why. It nearly breaks my heart to have to give a thumbs-down to such a huge effort of making a feature film. However, it can't be denied that this movie fell apart from the beginning. I simply did not care about any of the characters and could not connect with them, no matter how I tried. And it's all due to the writing! It seemed the actors were trying desperately to make up for that lack of continuity and motivation in the script, and so, often their performances seemed contrived, plastic, and/or over-the-top. I think under the guidance of better writing, these actors would shine like we know they can. What happened to character development and motivation? Perhaps it died in the car crash at the beginning of the film? Was Kuki an American in Italy, or an Italian? Who was the lady that was with Kuki's mother, when they were trying to convince her to come home? Did Kuki and Paolo really love each other or not? Did the people working at Kuki's house become close with her? Kuki seemed oblivious to them. When did Kuki and Ema start speaking the language? It seemed they suddenly just knew it. Why did Ema want to leave to go to school? Kuki was digging a ditch to help out with the water supply, but then we never see any resolution to that situation. What happened?? One of the sweetest moments in the film for me, was when Ema connects with a little African boy, who obviously has a love for snakes too. He shows the boy around his house and introduces them to the snakes he has, and then we never see the boy again (!). I also would have liked to see what was in the egg that was mentioned repeatedly within the story. Not having the resolution of that aspect (the egg) in particular, left me angry as the credits rolled. \"I Dreamed of Africa\" did have interesting scenery and I believe talented cast and crew, but because the script was so bad, everything else really fell apart.",
         "As someone who loves African scenery and doesn't mind ogling Kim Bassinger, either, I was looking forward to seeing this film. It turned out to be disappointing. The scenery wasn't nearly what I had hoped, certainly no \"Out Of Africa,\" and the story was, in a word: boring. I never quite understood, or was told, a number of things in here, such as how the leading lady \"Kuki Gallman\") in this movie and her husband, financially survived. He was out fishing and hunting with his buddies all the time and she was home building some sort of wildlife conversation. One almost got to the point of asking, \"What's the point of this story?\" outside of being some sort of travelogue. That's the feel I got; an overly-long documentary about living in Kenya. It gets boring quickly. Given the circumstances and scenery, this movie should have been fascinating, but it tedious. I'm not surprised it flopped at the box office and video stores.",
         "What's up with all these negative comments? Out of all the comments I read on this site, less than one fifth of them are positive. I may not be old enough to have seen a huge amount of movies, but I must say that as a 16 year old, I truly enjoyed this movie. Of course, certain moments were meaningless, some parts were a tiny weeny bit confusing, but you caught up with the story within the next two seconds. The acting by the whole cast was amazing, the scenery was gorgeous, hehe and so was Vincent Perez! The music was...um...well displaced at certain times, but overall the movie made me cry twice ( well many things make me cry so you might not want to take that into consideration ) the story was quite well constructed, the actors did a great job. (I have an enormous amount of respect for actors as I want to be one someday, so I do not believe that any performance can be bad, some can be improved in certain ways, but nothing is ever awful and only constructive criticism should be given to actors. As I've always been told: If you can't say anything nice, don't say anything at all. A few of the people who commented on the performances should have been taught that.) I have given this movie a 9 out of 10. It may not be one of the best movies ever made, but not one movie has ever been absolutely perfect, and I truly think this one deserves much better reviews that it has gotten, although that is JMHO and everyone has their own, so I'm not dissing anyone's POV. Well that's all of my rambling for today ;)",
         "This isn't Out of Africa (get over it) but it isn't a waste of time either. A fairly well told story about a well off Italian divorcée in her 40's who migrates to Kenya with her young son and a new husband. Set in more modern times than Out of Africa. Domestic problems with the new hubby ensue, he dies, the young son dies, she endures and endeavors to persevere in her new home with the support of her family. After reading all the downer reviews here I was sure this was going to be the world class stinker of all times, but I enjoyed it. It won't win any awards, it's not particularly inspiring and will no doubt end up just being ignored by everyone. Simply the story of a life with all it's ups and downs, loves and hates, hopes and dreams, and the drama that life puts on all our plates, with a setting in exotic Africa. Could it be? Someone besides Karen Blixen lived and loved in Africa and wrote a story about it. The photography was beautiful. The acting was acceptable and Kim Basinger is still a major hottie. Worth the rent. Check it out.",
         "I Dreamed of Africa could have been a better movie, but I became more satisfied with it after seeing that it stayed pretty close to the real story. Some have criticized the film because they said it showed no problem with malaria, and the people looked as if they were never sweating in Africa's heat. The 100,000 acre ranch in Africa is located at an altitude of 6000 feet above sea level, and there is no malaria problem there. It is probably somewhat cooler there than other places in Africa also. I found the film to be pretty good, but I believe the nude scene with Bassinger and her film husband was unnecessary. Does Hollywood believe that every film has to have nudity?",
         "When I read all the reviews I could about this movie, including specialized magazines, I thought to myself that Kim Basinger had a bad dream after the great LA Confidential, one of my favourite movies of the 90's. Now that I've seen it, I believe that 'I Dreamed of Africa' was not well understood. This is a different movie, the story was written to show dramatic and common scenes of Kuki's life, trying to reveal that all dreams can bring nightmares. And Kim shows us that she's a mature actress, not only a sex-symbol. She had no glamour in Africa, but her sensuality is so natural that I thought to myself that she was the most beautiful animal in Africa. This film deserved more positive reviews than it had. It's not worse or better than 'Out Africa'. Only different. And this difference makes it fabulous.",
         "I rented this film a while ago on video and thought it was a definite 8/10. I have since bought it on DVD and decided to watch it again a few days ago. Although not having the same impact as my first viewing, here was my opinion. I saw this film as a wonderfully photographed movie (based on a True Story) about a very strong willed woman \"Kuki Gallman\". In the beginning we see her survive a horrific car crash and raising a family by herself. She decides to marry a man called Paolo (Vincent Perez) whom she has known only a short time. She likes Paolo a lot and sees that he is great with her Son Emmanuel, she makes a very difficult decision against the wishes of her Mother (Eva Marie Saint) to move to Africa to live with him. Their initially idyllic life is shattered by confrontations with Poachers, Loneliness on her part (as her Husband likes danger and is often away on hunting Trips) and culminates with immense personal tragedy. The performances were very good in this Movie (including a pre-bond outing for Daniel Craig with an excellent South African accent) Vincent Perez was excellent as Kuki Gallman's Husband Paolo. Overall Kim Basinger was admittedly not up to the Oscar Winning Level of LA Confidential and did have a couple of poorly acted scenes, but also showed flashes of dramatic excellence and touches the viewer in some of the more emotional scenes, So overall her performance was quite good. Eva Marie Saint offered a solid supporting performance as Basinger's Mother. I have to say that it is obvious to me , film critics and a lot of others did not really give this film a chance and possibly compared it to Out of Africa. This is unfair as the film is set in different time and about different individuals. I personally found this film much more watchable than the aforementioned film but probably not as well acted. Hugh Hudson has directed a great looking film, but the script needed additional work, which would have improved the impact of some scenes. All in all though this film is well worth your time, do watch it and form your own opinions. 7/10",
         "I Dreamed of Africa is a movie based on a true story about a woman who changes her and her son`s life when she goes to live to a ranch in Kenya with her second husband. Some parts of the movie do not make any sense, or they look incomplete. That is because they show how hard living in Kenya is; but they aren`t an important part of the story. Another bad thing about it is that it`s way to predicable: you know that something will happen to Paolo (Kuki`s husband) since the first time he goes away hunting; and every time Ema (short for Emanuel, her son) grabs a snake you prepare yourself for a funeral. It is a shocking movie and you may go out of the movie theater hating Africa; but it shows some important parts of the living difficulties in places like Kenya. Altogether I think that it was a worthwhile movie, specially for us Kenya lovers, and you can get to know amazing parts of African savannahs.",
         "The last couple of sneak previews brought films full of violence and so I was hoping for a change as I didn't want to leave the cinema in the middle of a film again. Although this film is very positive, I sometimes wished back to something more exciting. It seems to be a common misconception to believe that a life full of tragedy automatically turns into a good story. This film is the perfect proof for it. It swings back and forth between tragedy and bliss but there's no suspense. Even the tragedy is predictable and unavoidable. The conclusions that are drawn from all this are commonplace. Of course, from a personal, private perspective it's different but from the point of view of a film there's nothing in it. This makes me wonder why people seem to think that all this is more interesting if it happens in an exotic place. I guess many, many people have gone through all this and worse and no one seems to think it worthwhile telling a story about them. There's one good thing to be said about this film, however. It goes against the grain of modern film producing. It's quiet and the acting is toned down."
      ],
      "genres": [
         "Adventure",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Columbia Pictures Corporation",
         "Jaffilms"
      ],
      "summaries": ["Kuki, a divorced Italian socialite, changes her life after a serious car crash. She accepts a marriage proposal from Paolo Gallmann, a man she doesn't know well, and she moves to Kenya with him and her young son to start a cattle ranch. Challenges beset her, not the least of which is Paulo's love of danger and his leaving for days on end to hunt and fish with pals. She must face fierce storms, roving lions, venomous snakes, and murderous poachers, and she must find accommodation with a neighboring tribe. Her mother entreats her to return home. Can Kuki live her dream, tame Paolo, guide her son safely past the perils and errors of youth, and serve Africa?"],
      "budget": 34000000
   },
   "movielensId": 3579,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-05-05",
      "dvdReleaseDate": "2000-08-29",
      "directors": ["Hugh Hudson"],
      "runtime": 114,
      "movieId": 3579,
      "title": "I Dreamed of Africa",
      "mpaa": "PG-13",
      "actors": [
         "Kim Basinger",
         "Vincent Pérez",
         "Liam Aiken",
         "Daniel Craig",
         "Eva Marie Saint",
         "Lance Reddick",
         "Stephen Jennings",
         "Nick Boraine"
      ],
      "imdbMovieId": "0167203",
      "originalTitle": "I Dreamed of Africa",
      "genres": [
         "Romance",
         "Drama",
         "Adventure"
      ],
      "youtubeTrailerIds": ["_X2hcx1v0Rw"],
      "plotSummary": "Inspired by the true story of indomitable Kuki Gallmann, the film tells of a beautiful and inquisitive woman who had the courage to escape from her comfortable yet monotonous life in Italy to start anew in the African wilderness with her son, Emanuele, and her new husband, Paolo. Gallmann faces great danger there but eventually becomes a celebrated conservationist.",
      "tmdbMovieId": 21311,
      "avgRating": 2.49247,
      "releaseYear": "2000",
      "numRatings": 332,
      "posterPath": "/7ryJpWMbI9YerAYI6dvidGZfOzp.jpg"
   }
}