{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "racism",
            "id": 12425
         },
         {
            "name": "violence",
            "id": 14819
         },
         {
            "name": "date rape",
            "id": 171662
         },
         {
            "name": "athletic scholarship",
            "id": 171665
         },
         {
            "name": "black militant",
            "id": 171667
         },
         {
            "name": "resentment",
            "id": 171670
         },
         {
            "name": "school shooting",
            "id": 171676
         }
      ],
      "imdb_id": "tt0113305",
      "video": false,
      "title": "Higher Learning",
      "recommendations": [
         16096,
         16136,
         10952,
         11443,
         14469,
         30963,
         26261,
         25624,
         59232,
         20649,
         9430,
         47841,
         24664,
         19033,
         18206,
         55888,
         31908,
         61418,
         17133,
         15278
      ],
      "backdrop_path": "/zYezCWo9f69VVVGC1sUspo8AvSM.jpg",
      "revenue": 38290723,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Mlik Williams",
               "gender": 2,
               "credit_id": "52fe46c19251416c75082707",
               "name": "Omar Epps",
               "profile_path": "/t4Qg5ANKK2idfOt4RzWzhiP7IEv.jpg",
               "id": 4987,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Kristen Connor",
               "gender": 1,
               "credit_id": "52fe46c19251416c7508270b",
               "name": "Kristy Swanson",
               "profile_path": "/wxLklfVHTuVg3O7XT4vBpgzc0Tm.jpg",
               "id": 56128,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Remy",
               "gender": 2,
               "credit_id": "52fe46c19251416c7508270f",
               "name": "Michael Rapaport",
               "profile_path": "/i39bAISjAUWYlXZZA0wmjYWnZGf.jpg",
               "id": 4688,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Taryn",
               "gender": 1,
               "credit_id": "52fe46c19251416c75082713",
               "name": "Jennifer Connelly",
               "profile_path": "/xTpRRy9hwk4E2uypuQ30iqt2W2W.jpg",
               "id": 6161,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Fudge",
               "gender": 2,
               "credit_id": "52fe46c19251416c75082717",
               "name": "Ice Cube",
               "profile_path": "/dzdn1tyWkC4EjlBVKvpAhg5osYA.jpg",
               "id": 9778,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Wayne",
               "gender": 2,
               "credit_id": "52fe46c19251416c7508271b",
               "name": "Jason Wiles",
               "profile_path": "/7p6NAI5z9yTYSEqsJCAZJmS7SC3.jpg",
               "id": 81373,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Deja",
               "gender": 1,
               "credit_id": "52fe46c19251416c7508271f",
               "name": "Tyra Banks",
               "profile_path": "/tmNsskMEGCDdTyWS2vNDvzCtyM9.jpg",
               "id": 77897,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Scott Moss",
               "gender": 2,
               "credit_id": "52fe46c19251416c75082723",
               "name": "Cole Hauser",
               "profile_path": "/2izzcOrZpt22ObHjSNq3qRhrGHu.jpg",
               "id": 6614,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Professor Maurice Phipps",
               "gender": 2,
               "credit_id": "52fe46c19251416c75082727",
               "name": "Laurence Fishburne",
               "profile_path": "/8suOhUmPbfKqDQ17jQ1Gy0mI3P4.jpg",
               "id": 2975,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Monet",
               "gender": 1,
               "credit_id": "52fe46c19251416c7508272b",
               "name": "Regina King",
               "profile_path": "/qLPsh6SLw0DSi526g8abEqGJbo3.jpg",
               "id": 9788,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Dreads",
               "gender": 2,
               "credit_id": "52fe46c19251416c7508272f",
               "name": "Busta Rhymes",
               "profile_path": "/1NqDmMk2jnrLjJUfb68gtMnSyF8.jpg",
               "id": 6485,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Nicole",
               "gender": 0,
               "credit_id": "56364d1bc3a3681b5e019f22",
               "name": "Bridgette Wilson",
               "profile_path": "/l5bUegMA9PHoeRgBkio2bE9R7Vj.jpg",
               "id": 20751,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Festival Singer",
               "gender": 1,
               "credit_id": "57b85b08c3a368501a007891",
               "name": "Vitamin C",
               "profile_path": "/wc8GqQacvxBvqsijjPTSiy3zBdg.jpg",
               "id": 62521,
               "order": 12
            },
            {
               "cast_id": 24,
               "character": "Claudia",
               "gender": 1,
               "credit_id": "5950089ac3a368323204ccf0",
               "name": "Kari Wuhrer",
               "profile_path": "/2WmKU8E0lMmdBcC7F9iLLz7S2Qc.jpg",
               "id": 56152,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "584a66ad92514119b301cb83",
               "name": "Keith Brian Burns",
               "profile_path": null,
               "id": 22145,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe46c19251416c750826fd",
               "name": "John Singleton",
               "profile_path": "/xmVaXjAAywPh7HIrYjLVsjfKPrV.jpg",
               "id": 6482,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46c19251416c75082703",
               "name": "John Singleton",
               "profile_path": "/xmVaXjAAywPh7HIrYjLVsjfKPrV.jpg",
               "id": 6482,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46c19251416c75082735",
               "name": "Paul Hall",
               "profile_path": null,
               "id": 73834,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "584a66a4c3a368141101c51b",
               "name": "Bruce Cannon",
               "profile_path": null,
               "id": 9772,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "584a666b92514119bf01c848",
               "name": "Stanley Clarke",
               "profile_path": "/lFXzQwokEU16B99FtSDTIshmTr9.jpg",
               "id": 9769,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "584a6671c3a368142801a865",
               "name": "Peter Lyons Collister",
               "profile_path": null,
               "id": 20823,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "584a66d7c3a368140a01dc2e",
               "name": "Richard Holland",
               "profile_path": null,
               "id": 49909,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "584a66ee92514119b601c44d",
               "name": "Michael C. Claypool",
               "profile_path": null,
               "id": 1720064,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "584a670892514157fa00ad70",
               "name": "Carol Oditz",
               "profile_path": null,
               "id": 36582,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 5.729862,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 16295,
      "vote_count": 68,
      "budget": 0,
      "overview": "Malik (Omar Epps) is an African-American student attending on a track scholarship; academics are not his strong suit, and he goes in thinking that his athletic abilities will earn him a free ride through college. Fudge (Ice Cube), a \"professional student\" who has been at Columbus for six years so far, becomes friendly with Malik and challenges his views about race and politics in America.",
      "similar": [
         74997,
         366964,
         979,
         281957,
         434873,
         3134,
         73861,
         37645,
         8456,
         24,
         769,
         156022,
         281,
         395834,
         588,
         445954,
         398175,
         133805,
         400,
         341006
      ],
      "original_title": "Higher Learning",
      "runtime": 127,
      "poster_path": "/cLeOjovcDq9kULToHuoXa1xmvET.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "New Deal Productions",
            "id": 1947,
            "origin_country": ""
         },
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         }
      ],
      "release_date": "1995-01-11",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Singleton"],
      "runtime": 127,
      "synopsis": "At Columbus University, a fictious college in southern California, we first see Malik Williams (Omar Epps), a black man, Kristen Connor (Kristy Swanson), a white woman, and Remy (Michael Rapaport), another white man, at the opening freshman pep rally and as they are decorating their rooms. Malik and Kristen meet in the elevator, with the nervous Kristen shielding her purse and Malik seeing this and resenting it. There is a montage of each putting up pictures and posters in their rooms. Track star Malik goes to his first practice unprepared, and is chastised severely by the coach. Kristen meets her roommate, Monet (Regina King), a black girl, and attends a fraternity rush party, where she meets two outgoing freshmen Nicole and Claudi. Monet and Malik attend a party with other black students, hosted by Fudge (Ice Cube), an afrocentric and militant senior whom has been at the university for six years now. Remy, who is Fudge's roommate, is upset at the loud rap music being played late into the night. He calls security, who breaks up the party. Fudge is upset that they don't tell the room down the hall to stop their loud \"hillbilly\" music. Kristen, while walking home, meets Taryn (Jennifer Connelly), a junior lesbian student who warns Kristen about walking alone late at night and invites her to a student group. Malik's roommate, Wayne (Jason Wiles), is then introduced, with Malik angry about his filthy bed area and lack of hygine. The next day at the campus square, Fudge points out to Monet the self-segregation of the various ethnic groups on campus. We then see Malik's first class, with Professor Maurice Phipps (Laurence Fishburne), a conservative black man from the West Indies whom is teaching Political Science 101. In the class, Malik's and Kristen's names (among others) are called out for having financial problems, embarrassing them. They go to the financial aid office, where Kristen is told she needs a job since her parents are bankrupt, and Malik learns that his athletic scholarship is partial, not full. He talks to the coach, who agrees to help him out if he keeps his grades up and works extra hard on the field. Fudge returns to his room with his friend Dreads (Busta Rhymes), and plays his rap music loud, disrupting Remy's studying. When Remy complains, Fudge mocks and threatens him, causing Remy to move out. Later, Remy is beaten by Malik at a video game who further mocks him. Remey then rejects an offer of pool from Wayne and David Isaacs, Remy's new Jewish roommate. Meanwhile, Kristen is shown getting drunk and leaving with frat boy Billy (Jay Ferguson), retreating back to his frat room. Billy and Kristen prepare to have sex, but when Billy indicates that he does not have a condom, Kristen decides she doesn't want to have sex. Despite this, Billy ignores her refusal, and rapes her. She eventually fights him off, and flees. Monet returns to their room and finds Kristen crying in her bed. When Billy calls, Monet refuses give the phone to Kristen, and Billy suddenly reacts violently and insults her racially. Angered, she turns to Fudge, who recruits his friends to confront him at the frat party. Monet forces Kristen to tag along with them where she willingly points out Billy to the black students. Fudge and Dreads pull Billy outside, threatening him and forcing him to apologize to Monet. The security guards arrive and the black students leave. The next day, despite being ostracized by her friends, Kristen attends Taryn's student group on harmony between different groups. Meanwhile, Malik borrows a copy of the autobiography of Frederick Douglass. After telling Fudge he only needs it for a class, Fudge kicks him out, telling him to read it for himself and not for school. That evening, Remy is reading alone outside in the student quad when he is approached and asked out for a drink by Scott Moss (Cole Hauser), a white supremacist and neo-Nazi skinhead whom had been glimpsed in the background shadowing Remy for the past few days. Remy also meets Scott's skinhead friends: Erik (Talbert Morton), James (Trevor St. John), and the weight-lifting hulking Knocko (Andrew Bryniarski). A few days later, Professor Phipps challenges his class (including Kristen and Malik) to determine who they are for themselves and not let others categorize them. Kristen talks about her rape with Taryn, with Taryn encouraging her to report it and attempting to console her. Malik confronts Phipps about a paper he graded, arguing he should have a better grade. When Phipps shows him the various spelling and grammar errors, Malik calls him a sellout for the \"white establishment\". Phipps angrily responds that the world owes Malik nothing and he must work for his own good to make a difference in this world. Malik is then shown racing in a relay, losing ground to another runner. When his teammates confront him, he responds with Fudge's ideology. He walks away and flirts with fellow runner Deja (Tyra Banks). Remy is seen in Scott's dorm room with James, Erik, and Knocko. The room is decorated with Swastikas and Nazi paraphernalia. Scott expresses his racist beliefs, and the troubled Remy is slowly being convinced that \"the white man is endangered\" and he is encouraged to shave his head to join Scott's underground neo-Nazi group. In the campus library, Deja is shown helping Malik with his essay and his spelling errors. Nearby, Kristen is shown realizing her growing attraction to Taryn. Phipps then criticizes Kristen's bland paper, telling her that only writing the facts is fine for journalism, but not for a political science course. Phipps tells her that her purpose at college is to think for herself. Phipps then talks with Malik about his much improved paper. Remy is shown working in a class, surrounded by students of other races. He removes his hat, showing he has shaved his head and is wearing an Iron Cross necklace. Wayne asks Kristen for a flier for their group, confronting her when she says the anti-sexism group is for women, flirting with her as well. On Halloween night, Monet attends a costume party with Dreads while Malik also attends with Deja. Kristen attends a rape awareness rally with Taryn. Remy and the other neo-Nazis attack an interracial couple. After the rally, Kristen asks to spend the night with Taryn. Taryn rebuffs her, saying she wants Kristen to be sure about it. While stretching on the track, Malik continues spouting Fudge's ideology to Deja, saying he hates feeling like a thoroughbred. Deja rebuffs him, saying he has opportunities that people would do anything for and he should take them. The stretching and running is then intercut in a montage with a love scene, showing they have started dating. Kristen is also seen going on a date with Wayne. Scott shows Remy his gun collection and Remy talks about his abusive, survivalist father in his Idaho home town (which is the indirect result of Remy's troubled behavior and childhood). Kristen is shown walking holding hands with Taryn in public across the campus. They have a run-in with Monet and another friend of hers who see them. A montage love sequence is shown with Kristen where she sleeps with Wayne, but fantasizes about Taryn. (In a deleted scene, Kristen goes to Taryn's room and indeed has sex with her as well). One day, while Malik and Deja talk about Christopher Columbus and of the college, Remy approaches, condemning Malik's Black Panther shirt and calling him a racial slur. Malik, angered, goes to Remy's room and confronts him about being a racist and Nazi after finding him reading a copy of Adolph Hitler's book 'Mein Kampf' (My Struggle). Remy backs down from a fistfight, with Malik insulting him and leaving. Remy trashes the room, contemplating suicide. After David returns, he confronts Remy about the mess. Remy starts beating David and Malik intervenes. Remy pulls his Glock 9mm, threatening the two and leaving. Malik runs after him, only to be stopped by security guards asking for ID. Resisting, he is arrested, letting Remy escape. Malik then moves in with Fudge and the rest of his friends. A day or two later, Malik and Fudge are relaxing on the student quad when they have a run-in with Professor Phipps and the three of them have a discussion on race, knowledge, and \"the system\". Phipps tells Malik that he must play the game of life to win, because no one wants to hear excuses. It is here that Fudge used to attend Phipps class when he was a freshman years ago and Malik is somewhat suprised when Phipps addresses Fudge by his real name, which happens to be 'Christopher White'. At the same time, Kristen begins organizing a peace festival with Monet to calm down the students after Remy's actions. Meanwhile, Scott chastises Remy for dropping out of school, arguing that the white community needs more successful members and that he is betraying his race. After Knocko calls out a racial slur, Fudge, Malik, Dreads, and another black student start a gang fight with the white power skinheads, beating them. Later, Deja confronts Malik on his intentions of dropping out and fighting for no good reason. Malik is becoming more and more angry about racial issues. At the underground skinheads's doorm, Scott says that Remy's posturing means nothing, and only actions do. He then shows Remy a sniper rifle and challenges him to action. The alienated and warped Remy agrees to kill for the white race. We then see Malik and Deja walking at the Peace Fest, with Malik saying he wouldn't drop out of college because he'd lose her. Kristen stands on the podum of the rally where she addresses the students while she sees both Wayne and Taryn standing seperate among the students, leaving Kristen feeling uneasy to both of them whom she is currently dating without the others knowledge. Remy has moved to the rooftop of a nearby building with the sniper rifle and prepares to open fire on the students. Erik stands lookout while the other racist skinheads attack a gay couple to distract security. Remy is obviously having trouble with doing this, but acquiesces when pushed by Scott who tells him to \"do it for the Aryan Nation\". He opens fire on the Peace Fest, causing a riot. An unnamed student is killed, and Deja is shot in the stomach. She collapses in Malik's arms. After Phipps tries to help, Malik goes crazy and attacks Remy, meeting him on the stairs of the building and beating him severely and nearly choking him to death before racist security guards, led by the racist Officer Bradley (Bradford English) intervenes and beats him. Bradley and his men confront Remy as he tries to leave. Remy pulls out a pistol, resulting in a stand-off. Remy apologizes to the police for everything that he did and shoots himself in the head, killing himself. After the security guards let Malik go, he returns outside and finds that Deja has died, and he collapses into Phipps' arms, crying and wailing. The racist skinheads are shown mourning Remy's death when they see a TV news report of the university shooting. Knocko, Erik, and James then begin celebrating his actions, chanting, \"white power\". Scott quietly sits back and for a brief moment seems to smile. (It is strongly implied that Scott and his skinheads intentionally approached, brainwashed, and set Remy up as the patsy for their own actions, taking advantage of the troubled youth to make him do their murderous deeds and they will get away with it since there is nothing to connect Remy to either Scott or his skinheads.) A few days later, Malik and Phipps discuss his future away from the university, with Phipps saying he trusts Malik's judgment whatever it will be. Malik walks out of the office, making it unclear if he is going to drop out of the university or stay on. Afterwords, Malik and Kristen are seen meeting for the first time at a memorial to Deja. Kristen feels guilty about the deaths because she started the festival. Malik assuages her guilt. And shortly after, they part. Malik goes to the campus track and runs around the racetrack alone... running for himself and not for the school. In the final scene, a graduation ceremony is held where Fudge is seen finally graduating with the other students having long ago acquired all of the credits he needs, but refusing to wear a cap or smile for his graduation photo. As Professor Phipps leaves his office, the final shot shows the USA flag fluttering in the wind as the caption \"unlearn\" appears over it as the image fades to black.",
      "writers": ["John Singleton"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113305/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI1NDEwMDg4Ml5BMl5BanBnXkFtZTcwMzY4MTgxMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Omar Epps, Kristy Swanson, Michael Rapaport | See full cast and crew »"],
      "reviews": [
         "Maybe I'm crazy, but the exact things that everyone seems to find wrong with the movie are the things that I think makes it good. Like everyone was saying that all of the white characters are bad and all of the black characters are good, when that is apparently not the case. Why does Remy become a skinhead? Because the black guys in his dorm rejected, humiliated, and belittled him. In a way they drove him to it. Who's to blame here? In no way does Singleton let the black characters off the hook here. Many of them are portrayed as violent and irrational. Omar Epps's character is good example of where Singleton points out another dangerous attitude that has nothing to do with white people. The character thought the world owed him a break because he was black and underprivileged and the teacher is the one to call him on it. Or as someone in a another post pointed out, sorry to quote you, \"Black self-pity,\" which the film does not excuse, but rather addresses with the same skepticism as it does the more generic issues everyone else seems to be concentrating on (racism, neo-naziism, date rape, lesbian cults.) So ask yourself, did this film genuinely leave you with the impression that it glorifies the behvoir of certain characters based on their race? Or is it maybe just that since the director is black you have a preconceived notion that he will be partial to the black characters? So where a lot of people seem to think the message is black=good white=evil, I see it as It doesn't matter who's wrong and who's right because we need to put our differences aside and get along (almost equally clichee, I know, but still a different message entirely) Signed, white dude",
         "I must have been watching a different movie to most of the people adding comments. I didn't see it as a film portraying African Americans as good and whites as bad but as a film in which all the factions were shown to have good and bad sides. Even the guy who becomes the Nazi skinhead was portrayed sympathetically in as much as he is clearly out of his depth in a social situation and becomes a recruit because only the skinheads will accept him when no-one else will. Overall, the African Americans come out as the most sympathetic but not by much. I agree there are some fairly silly stereotypes, especially Fishburne's character, but they work in the context of the movie. Most refreshing was the fact that an American college is portrayed as a place with real issues like racism and date rape and drunken behaviour. It's refreshing because colleges are usually shown as places where nice middle-class kids never have any problem bigger than being dumped by their boyfriends before everything is resolved in the last reel. An overly maligned movie. Not perfect but better than a million other college movies. Loved the ending too.",
         "The film's design seems to be the alpha and omega of some of the major issues in this country (U.S.). We see relationships all over at the university setting for the film. Befittingly, the obvious of student v.s. teacher is present. But what the film adds to its value is its other relationships: male v.s. female, white v.s. black, and the individual v.s. society. But most important of all and in direct relation to all of the other relationships is the individual v.s. himself. I was amazed at how bilateral a point of view the director gave to showing the race relations on campus. Most films typically show the injustices of one side while showing the suffering of the other. This film showed the injustices and suffering of both sides. It did not attempt to show how either was right, although I would say the skin heads were shown a much crueler and vindictive (quite obvious towards the end). The film also discusses sex and rape. It is ironically this injustice that in some ways brings the two races together, for a time. Lawrence Fishburne does an over-the-top performance as the sagacious Profesor Phipps. He crumbles the idea of race favortism and instead shows the parallelism of the lazy and down-trodden with the industrious and positive. Other stars that make this film are Omar Epps, Ice Cube, and Jennifer Connelly. Michael Rapaport gives an excellent portrayal of a confused youth with misplaced anger who is looking for acceptance. Tyra Banks make her film debut and proves supermodels can act. Higher Learning gets its name in showing college as more than going to class and getting a piece of paper. In fact, I would say the film is almost a satire in showing students interactions with each other, rather than some dry book, as the real education at a university. It is a life-learning process, not a textual one. I think you'll find \"Higher Learning\" is apropos to the important issues at many universities and even life in general. 8/10",
         "Columbus University is one of the finest in America. Into this place of higher learning comes a mix of students to join the already multicultural pot. Malik is a black track star who feels he is disadvantaged as he has to run and study, while others only have to run. Remy is a white teenager who is forced out of his dorm by his black roommate and finds friendship in an extreme group. Kristen is a young female who struggles to make friends and is assaulted by a man before falling in with a women's group. Their experiences intertwine in the small campus. If anyone wonders why director John Singleton (he of Boyz n' the Hood) is now making things like 2Fast2Furious, this is as good a place to start looking as anywhere. After an assured start with Boyz, the director made a couple of films that had potential but just came out muddled or lacking something to make them work. Poetic Justice was one of them and this was another. Higher Learning had potential and you can see that it's heart is in the right place but it doesn't come off at all. The plot tries to be a mix of experiences but, because there are three or so characters up front, there is no time to develop them so their experiences are broad cultural brush strokes - the white kid sucked into extremism, the raped girl taken into lesbianism, the black man who has to work harder for everything. As a result the plot never really engages and it all just goes where you expect it to go - and is less impacting as a result of it's plodding nature. This spills over into the characters too - they are all pretty much stereotypes that fit into their scenario rather than real characters. Singleton shows is bias in his direction and character selection. My wife said something about me watching a lot of `black' films in the past week and I said Higher Learning was not dominated by any one race - but I think I was wrong. Singleton clearly likes the characters played by Busta Rhymes, Ice Cube and Epps - they are cool and put upon where other characters (races) have fewer kind touches placed on them. Personally I thought every character had huge chips on their shoulders about their identity - but the African American characters are the only ones that are held up for praise in relation to their chips! Having said that I did think Epps did OK - he made a lifeless character a little more interesting. Banks however is as one dimensional as I have grown to expect from her. Rapaport looks very young indeed but he does well. His character is lazily drawn and developed, but he manages to make him a little human - which took work looking at the film as a finished product. Swanson is too dippy and light - but then all the lesbian characters seem to be painted in a weird sort of light. Ice Cube and Busta Rhymes give extended cameos which require them to deliver their rap personas of thugz - they are laughably clichéd! Fishburne adds gravitas as he always does, but he has little to do and is given not only a poor accent, but also some `deep' dialogue that just sounds pretentious or like a fortune cookie. Overall I saw what this film was trying to do but it didn't manage it. It was ambitious, but the wide spread meant that none of the plots or characters were allowed to develop and instead were left as hollow, broad stereotypes and scenarios. The film tries to go all deep and the final shot of the word `unlearn' against an American flag just feels like Singleton must have thought that he had been making incredibly profound points the whole time - instead it felt that his original idea had had a deeper point, but it was totally lost in delivery.",
         "Singleton has some serious issues he has to come to grips with. I get the feeling that he thinks he is pretty smart; however, this movie is almost comically transparent and self righteous. In addition, there are a bunch of \"might-makes-right\" messages like when our local Nazi jerks get beat up. I mean, who in their right mind is going to root for a bunch of Nazi jerks? However, he way Singleton portrays the \"fight\" is downright silly and seems to be designed to show us more the superior fighting qualities of the black protagonists than anything else. There is another \"bad guy\" (in reality a drunken frat boy) who rapes one of the movie's protagonists. In this instance, I think that Singleton actually does a nice job portraying what is probably an all too common situation when the woman involved asks the frat boy to use a condom and he either does not have one or does not want to use one. In any event, he does not accede to her demands that he stop and he proceeds to have intercourse despite her pleas. I think that this type of rape is all too common and in fact many uniformed people refuse to accept the fact that it is even a rape. Well, no means no, this is a rape, which probably occurs a lot in Universities across the country. Having established the rape, how does Singleton deal with it? When the frat boy tries to call the woman, her roommate refuses to put the victim on the phone, at which point the frat boy calls the roommate a \"black bitch.\" The aggrieved roommate appears to appeal to a counsel of Ice Cube, et al, who then proceed to physically humiliate and abuse the frat boy into repeated and prolonged \"apologies\" to roommate for his racist remarks; however the (apparently in Singleton's mind) lesser crime of rape is not mentioned. Again, no one really should feel sorry for the frat boy; however, Singleton seems to be sending a dual message that a racist comment is a greater offense then rape and in any event violence is justified against jerks. What is so ultimately so disappointing is that this movie could have truly been about something important but Singleton, while no doubt a talented director, does not appear to have the maturity or depth to pull of something of this magnitude.",
         "The only way to get anything out of this film is to approach it as a comedy. Seen in that light, it does deliver. If you're looking for a serious movie, look somewhere else. This film has absolutely no depth and offers little more than a cursory and one dimensional examination of \"issues\" with no insight whatsoever. Making a movie about stereotypes and then making every single character in your movie a stereotype is an extremely poor strategy - especially when those same characters only break their hackneyed molds in predictable, stereotypical ways. Busta Rhymes and Ice Cube make the film almost watchable, and Michael Rappaport turns in a good performance, but the script is so awful and the social commentary is so trite, it's hard to find anything redeeming.",
         "This movie masquerades as a social commentary, when in fact it is every bit as ridiculous as the very racism it condemns. The premise of this movie: African-American = Strong... any other race = weak. The worst part is when Rapaport pulls a gun on Omar Epps and a Jewish guy. The Jewish guy, in stereotypical fashion, crumbles in fear and starts pleading for his life... but the big, strong, defiant Omar Epps stands strong with no fear. We also have the condemnation of every fraternity member as being a arrogant preppie drunk or rapist. The raped white girl, of course, begins considering lesbianism since she's just a weak white girl after all. When the nerdy white guy is rejected by the fraternity members he of course must fall in with the skinheads, who are incredible cowards; especially the big muscular guy who is beaten down quickly by the strong black men. Wait... BUSTA RHYMES BEAT UP A GUY TWICE HIS SIZE??? Yeah, right. Of course the black men NEVER reject their own people and Omar Epps moves in with them easily. The scenes where Ice Cube threatens his white roommates and keeps them in line are just stupid -- of course he is the dominating one while his weak white roommates sit in fear of him and eventually move out. This movie was just terrible and the ending made me actually laugh out loud. The overly long slow-motion between Epps and Banks gets hilarious with the faces they make -- it's like watching my nephew and cousins making faces at each other (and they're all under 5). Do yourself a favor and skip this crapfest.",
         "Possible Spoilers. This movie can be summed up in this way. Whites=evil, Blacks=Good. The main hero is an angry Black man victimized by the Evil White Guys. The bad guys=White Males (I am not white, but am a Mexican-American, and like to see some new emphasis on racial matters rather than the White-evil, and Black victims who would be good if it were not for Whites). The Blacks can call Whites names and that is because they are angry and that is okay, likewise a White who does is a racist. Even the Good white person, the would be Lesbian character (Kristi Swanson) is good because she is a touchy-feely White Liberal. The students at school throw a muliticultural fest of Peace, Love, and Solidarity and who breaks it up?? The evil White guys do. I am sick of Hollywood concentrating on White-Black racial issues. It is getting repetitive and boring and unoriginal.I would like to see Latinos-black issues or Asian-black issues, Hispanic-Asian issues not the usual White-Black and if it isn't that it is usually White-with some other group. I like to see minorities with minorities.",
         "MINOR SPOILERS! Well i just sat up late and watched this film, mainly because i enjoyed and rated some of Singleton's earlier work like \"Boyz n the hood\". However, i have to say this was a major disappointment and is everything i hate about contrived, clichéd, so-called \"message\" movies. The acting is mainly poor,(pop stars and models do NOT necessarily make good actors...take note), the situations hard to swallow, (rape victim becomes overnight lesbian?...please!), but worst of all it reinforces every screwed up stereotype you can think of. By the second half of the film it has become cartoon like in its characterisation, making you lose any shred of empathy you may have had for its one-dimensional players. Not once is any valid point made about the inherent causes of racism and cultural, sexual and political ignorance. As a result it merely ends up sensationalising the results of these problems. It's message is contradictory, resulting in a sense of confusion and a general lack of plot cohesion. As for the films conclusion i found it predictable, embarrassing, exploitative and mildly offensive. For a film called \"Higher Learning\" i have to say all i learned is to avoid seeing this ever again. If you want a true comment on some of the themes that this film completely fails to elaborate upon then go hire \"American History X\"....unless you were just watching it for Tyra Banks then go hire a life.",
         "I don't understand why people would praise this garbage. Its wrong , stupid , unrealistic , awful , and just about everything else. The film is a view on life , racial issues , prejudice , and everything else that strangely goes on in College. This is where it fails. It has no grasps on reality. From many questionable non-sense scenes in the movie such as for example A black man chasing down a white man with a gun, the black man and stopped by the security guards handcuffed and carried out while the gunman runs right past them. The same white man snipering down people from a roof topic which is stopped and beaten down by the same black man is then stopped and given a Rodney King style beating while the gun man runs free while a moment later being chased back down by only one of the four guards. As one previous reviewer pointed out Several white 230lbs men being beaten down by several black men weighing around 160lbs including the 105lbs Bust A Rhymes Another critical flaw in the film are the shallow uninteresting main characters. From the scared and confused white people and the mean , angry , and yet rightful (?) black people. Its almost as its an insult to both black and white people. I am a white male and I know many black and hispanic people who agree that this movie is wrong to portray characters and giving them those characteristics exclusively due to their race. The storyline which I will explain now revolves around three characters. One a black athlete , the other a confused scared white girl who questions her sexuality , and the third is a white man who is also confused and scared , then blames his problems on black people in which he becomes a nazi later in the film. They all have their share of problems and adventures including sex , rape , fights , love , hate , prejudice , racial war , and oh yeah don't forget education. Which all comes down at the end for the fatal shoot out. In which after they go back to their boring lives and think \"being white is bad\". Does this sound alot like your college years? Didn't think so. I don't think the director attended college especially if he were to make this awful mess. Overall this is a really bad , bad , ugly movie. If you want to see a more accurate view or racial issues go see American History X. If you want to see a more accurate view of college rent Porkys. Just avoid this mess."
      ],
      "genres": [
         "Drama",
         "Romance",
         "Sport"
      ],
      "productionCompanies": [
         "Columbia Pictures Corporation",
         "New Deal Productions"
      ],
      "summaries": [
         "Youngsters from different countries, races, and social background are forced to integrate when they all enroll in Columbus University. They all have their own problems, such as finance, harrassment, personal safety, and self doubt. Additionally, campus life seems to be causing a problem for everyone: racism. Students, already under pressure to perform in the classroom, on the track, or in front of their friends, are strained to the breaking point by prejudice, inexperience, and misunderstanding.",
         "This drama examines the personal, political, and racial dilemmas facing a group of college freshmen as they begin their first semester at Columbus University. Malik is an African-American student attending on a track scholarship; academics are not his strong suit, and he goes in thinking that his athletic abilities will earn him a free ride through college. Fudge, a \"professional student\" who has been at Columbus for six years so far, becomes friendly with Malik and challenges his views about race and politics in America, while Professor Phipps, a black man who teaches political science, firmly tells Malik that he will not be graded on a different standard either because of his race or his ability to run quickly. With Deja, Malik finds a girlfriend, a tutor, and a training partner all rolled into one. Meanwhile, Kristen, a somewhat naive young woman from California, meets a boy named Billy after both have had too much to drink at a beer blast; Kristen soon becomes a victim of date rape and becomes involved with a campus feminist group to deal with the painful experience. While working with the women's group, Kristen gets to know Taryn, a strong but understanding woman who is also a lesbian, and she finds herself becoming attracted to her. And Remy is a confused young man from Idaho who feels lost in the multi-cultural atmosphere of Columbus. He is approached by Scott, a member of a group of racist skinheads, who believe that Remy is a perfect candidate to help carry out his group's violent goals.",
         "People from all different walks of life, encounter racial tension, rape, responsibility, and the meaning of an education on a university campus."
      ],
      "budget": 0
   },
   "movielensId": 358,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-01-11",
      "dvdReleaseDate": "2001-07-03",
      "directors": ["John Singleton"],
      "runtime": 127,
      "movieId": 358,
      "title": "Higher Learning",
      "mpaa": "R",
      "actors": [
         "Omar Epps",
         "Kristy Swanson",
         "Michael Rapaport",
         "Jennifer Connelly",
         "Ice Cube",
         "Jason Wiles",
         "Tyra Banks",
         "Cole Hauser",
         "Laurence Fishburne",
         "Regina King",
         "Busta Rhymes",
         "Bridgette Wilson",
         "Vitamin C",
         "Kari Wuhrer"
      ],
      "imdbMovieId": "0113305",
      "originalTitle": "Higher Learning",
      "genres": [
         "Romance",
         "Drama",
         "Crime"
      ],
      "youtubeTrailerIds": ["_4KVCVX1MrQ"],
      "plotSummary": "Malik (Omar Epps) is an African-American student attending on a track scholarship; academics are not his strong suit, and he goes in thinking that his athletic abilities will earn him a free ride through college. Fudge (Ice Cube), a \"professional student\" who has been at Columbus for six years so far, becomes friendly with Malik and challenges his views about race and politics in America.",
      "tmdbMovieId": 16295,
      "avgRating": 3.24905,
      "releaseYear": "1995",
      "numRatings": 2361,
      "posterPath": "/cLeOjovcDq9kULToHuoXa1xmvET.jpg"
   }
}