{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "upper class",
            "id": 213
         },
         {
            "name": "refugee",
            "id": 972
         },
         {
            "name": "infidelity",
            "id": 1326
         },
         {
            "name": "blackmail",
            "id": 1936
         },
         {
            "name": "seduction",
            "id": 3182
         },
         {
            "name": "widow",
            "id": 4129
         },
         {
            "name": "vacation",
            "id": 6876
         },
         {
            "name": "florence",
            "id": 8032
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "theft",
            "id": 14604
         }
      ],
      "imdb_id": "tt0153464",
      "video": false,
      "title": "Up at the Villa",
      "recommendations": [
         50474,
         70404,
         80660,
         64523
      ],
      "backdrop_path": "/ml69vjBlA0lJLCZzxVVfmu44AIJ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Mary Panton",
               "gender": 1,
               "credit_id": "52fe4742c3a36847f812be57",
               "name": "Kristin Scott Thomas",
               "profile_path": "/9NuZGaPn3Z1svlbF9ZkdtjgrHZo.jpg",
               "id": 5470,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Rowley Flint",
               "gender": 2,
               "credit_id": "52fe4742c3a36847f812be5b",
               "name": "Sean Penn",
               "profile_path": "/f2uy1zq0qmtLBpsr6N9uQ8FktOr.jpg",
               "id": 2228,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Princess San Ferdinando",
               "gender": 1,
               "credit_id": "52fe4742c3a36847f812be5f",
               "name": "Anne Bancroft",
               "profile_path": "/ydabiabIsMBe2HsNmx43gBpqzxx.jpg",
               "id": 10774,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Sir Edgar Swift",
               "gender": 2,
               "credit_id": "52fe4742c3a36847f812be69",
               "name": "James Fox",
               "profile_path": "/27vddrOyr0jnT2pi17cFoKPro4A.jpg",
               "id": 1292,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Lucky Leadbetter",
               "gender": 2,
               "credit_id": "52fe4742c3a36847f812be6d",
               "name": "Derek Jacobi",
               "profile_path": "/jJ4MkVS59gCfJhWMfLTbeHKjoyC.jpg",
               "id": 937,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Karl Richter",
               "gender": 2,
               "credit_id": "52fe4742c3a36847f812be71",
               "name": "Jeremy Davies",
               "profile_path": "/xPM0Wf4zVDpdNw3xokD2mDTqtoP.jpg",
               "id": 4654,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Colin Mackenzie",
               "gender": 2,
               "credit_id": "52fe4742c3a36847f812be75",
               "name": "Roger Hammond",
               "profile_path": "/p81yHkWRbxDoKcwBKZoduEoSl9c.jpg",
               "id": 27660,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Harold Atkinson",
               "gender": 2,
               "credit_id": "52fe4742c3a36847f812be79",
               "name": "Dudley Sutton",
               "profile_path": "/B5T9dy3eSv1ea9ZuWrz5kNwO7i.jpg",
               "id": 27393,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Beppino Leopardi",
               "gender": 2,
               "credit_id": "5639f3949251413b13003729",
               "name": "Massimo Ghini",
               "profile_path": "/iSpdphEZopzvu3816YsiFhhKwRb.jpg",
               "id": 148251,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Nina",
               "gender": 0,
               "credit_id": "5639f3ab9251414d2200183d",
               "name": "Lorenza Indovina",
               "profile_path": "/dS3iJvF9DkOY7eIhGi8EOLFVuiE.jpg",
               "id": 226832,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Peppino",
               "gender": 2,
               "credit_id": "5639f3cb9251413b1300372f",
               "name": "Gianfranco Barra",
               "profile_path": "/9XDkYhAg6puyNVOMZwngC85BTzj.jpg",
               "id": 69068,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4742c3a36847f812be65",
               "name": "Philip Haas",
               "profile_path": null,
               "id": 55038,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4742c3a36847f812be7f",
               "name": "W. Somerset Maugham",
               "profile_path": "/mseHL0TUkLcRXds5Pwjmbec8hyt.jpg",
               "id": 27916,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe4742c3a36847f812be85",
               "name": "Belinda Haas",
               "profile_path": null,
               "id": 55039,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4742c3a36847f812be8b",
               "name": "Pino Donaggio",
               "profile_path": null,
               "id": 14138,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe4742c3a36847f812be91",
               "name": "Maurizio Calvesi",
               "profile_path": null,
               "id": 72751,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4742c3a36847f812be97",
               "name": "Belinda Haas",
               "profile_path": null,
               "id": 55039,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.848911,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 47724,
      "vote_count": 11,
      "budget": 0,
      "overview": "Superficial people are revealed and drastically changed by circumstance or luck in this a tale of death, seduction, blackmail and theft among British and Americans in Florence in the turbulent days just before World War II.",
      "similar": [
         9769,
         2149,
         4771,
         180863,
         205,
         553,
         263472,
         1259,
         298312,
         320,
         3597,
         109099,
         2142,
         3600,
         27066,
         617,
         13573,
         2163,
         1645,
         521
      ],
      "original_title": "Up at the Villa",
      "runtime": 115,
      "poster_path": "/1WdR0dOb2ZhwyoqCN1owhqZ1M2I.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [],
      "release_date": "2000-04-14",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Philip Haas"],
      "runtime": 115,
      "synopsis": null,
      "writers": [
         "W. Somerset Maugham",
         "Belinda Haas"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0153464/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU1MzIzNzAwMF5BMl5BanBnXkFtZTcwODAxODAwMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Kristin Scott Thomas, Sean Penn, Anne Bancroft | See full cast and crew »"],
      "reviews": [
         "I was intrigued when this film showed up on the day's TV roster and even more intrigued when I found out who the cast are and read a quick synopsis of the story. Most of the reviewers here, at IMDB, have made the movie sound dreadful. I found it hard to believe that anything with Sean Penn and Kristin Scott Thomas would be awful and had to check out the film for myself. My conclusion -- it is quite good, engaging, and definitely worth watching. The lead actors as well as most of the supporting cast are rather wonderful. Though, I wish that someone slightly more dashing and not so limp played the role of the Austrian student, even if the stumbling manner and sudden onset of neurosis are required of the part. The scenery is inviting; the sets are great; the variety of accents is interesting; some of the extras are a bit shaky. The film is not so much about the setting, the era, or the social/political/economic spheres, though all of these have a firm bearing on the events and characters. It is chiefly about human actions under pressure of circumstances, about relationships, flights of fancy, slip-ups, weaknesses, trust and emotional maneuvering. \"Up at the Villa\" addresses these topics as good as any other period film. I recommend this movie to those who, like I, enjoyed more than one of the following: The Talented Mr. Ripley Gosford Park Howards End Country Life The Wings of the Dove A Room with a View The Remains of the Day",
         "I'm intrigued by the comment below about how rich Maugham's story is - because I quite like Maugham. I also like Anne Bancroft, Kristen Scott-Thomas and James Fox, so selecting this movie from my video rental store was easy. Unfortunately, something must have happened in writing the screenplay. *** SPOILERS *** One of the more selfless and realistically portrayed acts of love I've ever seen takes place toward the end of this movie. James Fox's character reveals how very difficult and long a climb it has been to now be about to be appointed Governor of Bengal, one of the largest of India's states. With his sigh, his body movement, we sense the dedication, the diligence, the very effort it has taken to climb the \"greasy pole\". Fox is not a peer - we sense no great hereditary estate. He has been knighted for his painstaking work and is apparently wealthy through his very industry. Fox is promptly informed by a poor widow to whom he has proposed, that during the very weekend she was to consider his proposal: a) her view of charity was to sleep with a refugee (\"I thought I'd do him good -he was just so miserable\" is the amazing explanation), b) the refugee proceeded to kill himself with the gun Fox had lent her for protection, c) the widow arranged to hide the body in the woods with the assistance of a cad who despises Fox, d) Fox's gun and the cad were held by the police, but e) the widow managed to retrieve his gun and the cad by rifling through her friend's desk for material to blackmail the authorities. She tells Fox that she can understand if he would like to withdraw his proposal. Fox's reaction? Not only does he remain keen on marriage with her, but he would freely give up his career in doing so because he loves more than life, and the scandal (if revealed while he were Governor) of his wife's witless fornication causing a stranger's suicide would make the British government's task in India more difficult. To Fox's astonishing act of love, forgiveness and self-abnegation, the widow says she has never loved Fox, that his attitude is \"weak\" because they \"need him in India\" (one suspects she simply wishes to be the Governor's wife at that moment), that he misunderstands the cad who would never breathe a word of the scandal, and that she turns down his marriage proposal because the scandal has caused her somehow to become a woman of the world, rather than the child (\"you're used to giving me sweets\") who wanted to marry him. However, as the widow, Scott-Thomas had seemed anything but a child. She had spoken before about the horror of marriage to one without virtue - about the twelve year long marriage she had endured in which her husband had gambled and drunk away their money, whored his way through countless women, and finally been killed while speeding. She had spoken of her dread of continuing to live on the generosity of strangers. These aren't a child's sentiments but an adult's sagacity. To whom then does Scott-Thomas turn after the selflessness of Fox's love? To whom does she turn to avoid the insecurity of which she spoke as the bane of her previous marriage? To a married man who says he can offer \"no guarantees\" of his love or faithfulness except that he will not return to his wife, who asks her to simply take the train to \"anywhere\", and about whom we know only that he takes waitresses and servants frequently to bed, is disliked by the authorities, and assisted her to deceive the authorities to help her. At the end, she says to the cad, \"I was yours when you first sat down\". Well, welcome to misery. Sorry, I know it's the movies, but when a movie ends this badly, with the heroine choosing the charmless married void in lieu of the paragon of sacrificial love, security and virtue, I have a difficult time liking the movie. I found Sean Penn's character anything but likeable - he had a sort of neutered quality - making puerile fraternity boy jokes about sleeping with the 60+ old princess, asking \"why\" of a government official's decision in a crowded antechamber and shrugging weakly before sitting down (when asked if satisfied with the official's bogus explanation). I suspect the movie has taken the story's tragic ending and tried to torture it into a happy one. The same woman who presumably acted on impulse by marrying a weak man and suffered a disastrous marriage for it, the same woman who acted on impulse to seduce a poor refugee and thereby set in train the events that killed him, is indeed the woman who turns away from a man willing to throw away everything for which he worked out of love for her, for a man who says \"hey, no guarantees, babe\". Tragedy will undoubtedly again ensue - the little painted grin painted on the protagonist as she heads toward the bar car, can't mask it. *** SPOILERS END *** I disliked the movie.",
         "\"You're never a great man, when you have more mind than heart.\" E.P. Beauchene In a nutshell, Mary, (Kristin Scott Thomas), a distractingly beautiful English widow has more heart than mind in this period piece. A noble thing to have, unless your naivety of heart gets you into places you never dreamed your heart would lead you. This excellent period piece takes place in fascist Italy. A group of English aristocrats worlds intertwine, with a twist. Kristin Scott Thomas' charmingly elegant character sparks life so intriguing, you'll find yourself leaning toward the tube. Many reviewers peg this as a tale of \"lust\". I disagree. I find no lust at all in this movie. What I do find, is a woman torn by her emotions and doing the right thing or the \"kind\" thing. Even Sean Penn is laid-back with his enduring advances. I found it to be a monument to human emotions, both caring and caustic.",
         "The only reason to see UP AT THE VILLA is the performances by a wonderful cast. Kristen Scott Thomas does a good job as a poor widow who is being courted by many different men. The most interesting is the amazing Sean Penn- yet again taking on an interesting role. The story is bland and sometimes painfully boring, but Thomas and Penn make this worth seeing.",
         "Beautiful photography and atmospherics capture Florence and environs. Technically very well-made and expensive-looking production. Kristin Scott Thomas is perfect for the role and gives a terrific performance. The other cast members just seem to be giving their \"standard\" performance (Bancroft's standard mature woman routine that no one does better but she has done it since \"The Hindenburg\"). Ditto James Fox and the others. The late William Holden could not have accomplished what Sean Penn did in \"Mystic River\", for which Penn gained a well deserved Oscar award. Conversely, Penn cannot play the Holden-type role in \"Up at the Villa\". Bad case of miscasting with flat results by Penn. No chemistry with Kristin Scott Thomas at all. How can you make a dull, uninspiring film in an exotic setting with great actors in a highly charged brink-of-war scenario? SEEMS IMPOSSIBLE BUT THE FILMMAKER HERE HAS DONE IT!",
         "I was stunned by Kristin Scott Thomas when I first saw her in The Tenth Man (co-starring with Derek Jacobi in that movie too) many years ago. I've tried to catch as many movies with her as possible since then, but she's just never been as good, not even in The English Patient. Much of her material has been extremely dull, incl. Random Hearts and yes, this one, Up At the Villa. The premise of this movie isn't bad, but for some reason it fails to create that engrossing magic that makes all the difference. Kristin's character is too timid and irrational (except for in the end). Jeremy Davies as the poor refugee is not exactly bad, but there's still something totally wrong with his role. Bancroft is flawless, but can't save the movie. Sean Penn is actually good. I don't like most of his roles in other movies - never have -, but he played a different, more complex and realistic yet rogue-ish character here than the hysterical ones he usually embraces (for God knows what reason), and I thought this actually worked. Still, his and Kristin's characters were just too different to make their romantic tension really believable. I will give the movie credit for its entire political dimension, though, which wasn't in the original book that this movie is based on. It's rare to see this; in most cases it's the film that leaves out the book's political content. I rate this movie a 5 out of 10.",
         "I thought I was going to really enjoy this movie. Sean Penn is one of the finest actors in Hollywood today. He was absolutely brilliant in Dead Man Walking and Carlito's Way, to name just two. Kristen Scott Thomas is always very good. This movie also has an excellent supporting cast (Jacobi's 'I Claudius' still rates as the best performance I've ever seen on PBS). And I have enjoyed almost every movie I've seen dealing with pre-WWII fascist Italy. But not this one. To my surprise, this movie seemed to meander from scene to scene. The acting was uninspired and and the emotions did not seem genuine. I was never absorbed into the film and was constantly aware that Penn and Thomas were acting. And Penn seemed completely flat. At times, his low and garbled voice was a bit hard to understand, but I didn't rewind the video to hear what I missed as I just wanted to get on to a more interesting part... which never came. Perhaps this role was beyond Penn. Perhaps he just mailed it in. In any case, I was quite disappointed with this movie.",
         "Well, great costumes and a wonderful `feel' for Pre WWII Italy. But what happened here? Great actors...Kristin Scott Thomas, Sean Penn, Anne Bancroft, James Fox, Derek Jacobi ...if you can't get memorable performances out of this `A List' then the problem with this movie must be blamed on pitiful direction and an inadequate script. I rented this on DVD after having liked \"Angels & Insects\" (1995) also directed by Philip Haas. Yipes! I can hardly believe how dull this thing was. It just dragged on and on and no one was able to save the poor thing. This is not even a good intriguing-foreign-dudes-and-young-things-in- pretty-clothes chick flick! \"Tea With Mussolini\" Gone Amuck!",
         "My summary above, just about sums my opinion up. This is based on a W.Somerset Maugham novella, If so the writers sure did not make it seem like any Maugham story I ever read. The first 3/4 hours are Ok & seem like a Maugham story then it goes downhill fast into melodrama, with all the required overacting dramatics that this well known cast can muster. Kristin Scott Thomas is the lead,(cross between Bette Davis & Gene Tierney) Sean Penn is a charming gigolo type & very subdued & with a very strange accent,(at least it is understandable. Jeremy Davies is a young refugee who sets off all the ensuing drama, with a bad accent. Anne Bancroft overacts as usual as the countess who knows all the secrets. James Fox is a usual a pompous --- cant he play anything else. If you like beautiful scenery & sets, see this otherwise, give it a pass, My rating is **1/2 as always jay harris",
         "This was a little surprise recent movie for me..... Considering, I've been watching so many newly released junk, cranking from Hollywood these days....... I mean, to the point, where I was just simply hopeless, wondering, if Hollywood was ever gonna make anymore decent, quality films, ''which made sense''...... I found ''Up At The Villa'' a consistent film, which held on to my attention..... Kristin Scott Thomas plays her role very well.... Her character was believable thru out, and her acting, natural...... Although, I kinda found this film, pretentious at times, involving upper class europeans etc...... Very typical, or maybe just the way, the movie is presented..... Sometimes, the film is too talky, especially, w/ scenes between Kristin & Sean Penn...... Sean Penn, is probably the entire film's, most miscast actor...... He seems so detached from the movie, like he dropped in from somewhere else...... He doesn't have much chemistry w/ Kristin, and their relationship, isn't believable..... It's not even about Sean's physical appearance, but the way her carries himself, and his gestures, when he talks, sounding like he's some rebellious hitman, or druglord, or ganster...... whatever..... As much as he tried to belong, I think, this is not the type of film suitable for him..... I don't even know, why he accepted it, to begin w/....... As such a reputable decent actor, playing an unconvincing role like this, just downgrade's his status......"
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "October Films",
         "Intermedia Films",
         "Mirage Enterprises"
      ],
      "summaries": [
         "Superficial people are revealed and drastically changed by circumstance or luck in this a tale of death, seduction, blackmail and theft among British and Americans in Florence in the turbulent days just before World War II.",
         "Over a handful of days in 1938, a penniless English widow, on vacation near Florence, considers the marriage proposal of an aging British aristocrat who is the newly-appointed governor of Bengal, accepts a pistol that he presses on her for safety, takes pity on an Austrian refugee, stands up to a Fascist police chief, and gets in harm's way with an American playboy. After a good deed results in tragedy, she must choose between dependability and love, between her reputation and her feelings. Even that choice doesn't work out as she imagined."
      ],
      "budget": 0
   },
   "movielensId": 3580,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "2000-04-14",
      "dvdReleaseDate": null,
      "directors": ["Philip Haas"],
      "runtime": 115,
      "movieId": 3580,
      "title": "Up at the Villa",
      "mpaa": "",
      "actors": [
         "Kristin Scott Thomas",
         "Sean Penn",
         "Anne Bancroft",
         "James Fox",
         "Derek Jacobi",
         "Jeremy Davies",
         "Roger Hammond",
         "Dudley Sutton",
         "Massimo Ghini",
         "Lorenza Indovina",
         "Gianfranco Barra"
      ],
      "imdbMovieId": "0153464",
      "originalTitle": "Up at the Villa",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Superficial people are revealed and drastically changed by circumstance or luck in this a tale of death, seduction, blackmail and theft among British and Americans in Florence in the turbulent days just before World War II.",
      "tmdbMovieId": 47724,
      "avgRating": 2.98731,
      "releaseYear": "2000",
      "numRatings": 197,
      "posterPath": "/1WdR0dOb2ZhwyoqCN1owhqZ1M2I.jpg"
   }
}