{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "musical",
         "id": 4344
      }],
      "imdb_id": "tt0053726",
      "video": false,
      "title": "Black Tights",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "The Widow",
               "gender": 1,
               "credit_id": "537509510e0a263047000003",
               "name": "Cyd Charisse",
               "profile_path": "/erxNENpQrU2oNJCHPCaAp3kVkaq.jpg",
               "id": 41226,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Roxane",
               "gender": 1,
               "credit_id": "537509620e0a263031000005",
               "name": "Moira Shearer",
               "profile_path": "/Owr7ync8aHNZ2rFRP6zCuZ4Uza.jpg",
               "id": 68422,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "The Gold Digger / Carmen",
               "gender": 1,
               "credit_id": "537509720e0a263031000009",
               "name": "Zizi Jeanmaire",
               "profile_path": "/91fMuThASBUS6lZP7Dkedonl4kE.jpg",
               "id": 134429,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Cyrano / The Suitor / Don José",
               "gender": 2,
               "credit_id": "537509870e0a26303100000d",
               "name": "Roland Petit",
               "profile_path": null,
               "id": 1007754,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Who introduces",
               "gender": 2,
               "credit_id": "537509990e0a263040000004",
               "name": "Maurice Chevalier",
               "profile_path": "/3j483xgtPAplIX4CLcvsAP56Tg5.jpg",
               "id": 112972,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "537508fc0e0a267c670042fc",
               "name": "Terence Young",
               "profile_path": "/vXufUCM2ybRgYggqxoV5479a03Y.jpg",
               "id": 9855,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "537509230e0a267c590045e2",
               "name": "Christian Dior",
               "profile_path": null,
               "id": 46775,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "537509370e0a267c67004302",
               "name": "Yves Saint-Laurent",
               "profile_path": "/74KHSsHHjLhHXMoXRDSWSF4i81R.jpg",
               "id": 9755,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "54f8ba33c3a36833bb004dbe",
               "name": "Françoise Javet",
               "profile_path": null,
               "id": 35374,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "54f8b925c3a368131c0019b6",
               "name": "Henri Alekan",
               "profile_path": null,
               "id": 2307,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "54f8b9f4c3a36833bb004db7",
               "name": "Roland Petit",
               "profile_path": null,
               "id": 1007754,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "54f8ba5c9251416f37004740",
               "name": "Antoni Clave",
               "profile_path": null,
               "id": 1369449,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "54f8ba6bc3a368131c0019dc",
               "name": "Georges Wakhévitch",
               "profile_path": null,
               "id": 1384701,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [],
      "popularity": 0.599207,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "PT",
            "name": "Portugal"
         }
      ],
      "id": 117781,
      "vote_count": 1,
      "budget": 0,
      "overview": "Live scenes of Paris and a continuity Narrator link together four dramatic choreographies, all by Roland Petit: Carmen (1949), La croqueuse de diamants (1950), Deuil en 24 heures (1953), and Cyrano de Bergerac (1959).",
      "similar": [
         38757,
         872,
         812,
         11224,
         10530,
         224141,
         15121,
         11970,
         824,
         8587,
         9325,
         630,
         10020,
         9479,
         11631,
         621,
         703,
         15969,
         3933,
         46195
      ],
      "original_title": "1-2-3-4 ou Les collants noirs",
      "runtime": 140,
      "poster_path": "/vn6VRjNyYtJXsXUVDFrAjdxp3pc.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Doperfilme",
         "id": 20711,
         "origin_country": ""
      }],
      "release_date": "1962-02-20",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Terence Young"],
      "runtime": 140,
      "synopsis": null,
      "writers": ["Roland Petit"],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0053726/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTczMTAwMDQ4Ml5BMl5BanBnXkFtZTcwNjI2MDc0NQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Cyd Charisse, Moira Shearer, Zizi Jeanmaire | See full cast and crew »"],
      "reviews": [
         "I don't think there's much I can say that would do justice to the beauty of this movie. It is delightful for anyone who likes ballet, but especially for fans of Cyd Charisse and Moira Shearer However, the video transfer on the Kino DVD is an absolute horror - it's badly transfered, and the print that was used in the transfer was in terrible condition, with plenty of scratches, and many instances of missing snippets of film. One wishes the Criterion Collection could get the rights to movies like these, and make a first-rate video transfer that would truly do justice to their artistry.",
         "Maurice Chevalier introduces 4 ballets performed (and originally premiered, I believe) by Roland Petit's Les Ballets de Champs Elysees. Excellent productions in vivid Technicolor with all-star credits in every category: Cyd Charisse, Moira Shearer and Zizi Jeanmarie in leading roles, costumes by Yves Saint-Laurent and Christian Dior and music by Jean-Michel Damase, among others. Fans of ballet and all things French will delight.",
         "Really can't add much to the knowledgeable original comment, but wanted to say what a handsome looking film this is, with striking, stylized sets and lighting. Even the slight fading of the Technicolor hues (at least in the print I saw) seemed more an asset than a failing. (And of course one has to give beauty marks to any film featuring the gorgeous Cyd Charisse!)-- Overall, just lovely to look at, especially the \"Cyrano de Bergerac\" sequence.",
         "Lovely movie that I had heard about. Was crushed last year when Moira Shearer passed away. This movie includes Moira, Cyd and Zizi. Zizi I had heard about, but never seen. All were a delight. To me, Moira and Cyd seemed a little past their prime, since I was so spoiled by having seen their earlier dance films \"The Red Shoes\" and \"Brigadoon\", plus Cyd in \"The Harvey Girls\". But, alas, we all get older. I was finally able to see Zizi for the first time, and it was very nice. I have studied ballet, and feel that Roland Petit is well respected. Chevalier was good to see in this movie. The town square/vegetable market scene reminded me of \"My Fair Lady\". Just musings and reflections on my part. Perhaps the print and color were rather fuzzy, but they can be reminiscent of water color paintings. 9/10",
         "This terrific dance film deserves to be judged in its historical context, where it shone in set design, choreography, cinematography, musical vivacity and not least in superb dancing. I recall that at the time, Rene Jeanmaire's portrayal of Carmen was considered shockingly sexy for classical dance. The film is still a treasure, especially as another gorgeous record of the brilliance of Shearer and Charisse, and remains a fully developed treat for the senses of anyone who enjoys dance at its best. Highly recommended viewing for fans of all ages, not least to very young people dreaming of becoming dancers. The work in this film exemplifies a level of dance artistry that was revered in its day and by now has become legendary. Yes, we would certainly stage things differently in the 21st century, yet this film is REAL Roland Petit --le vrai de vrai--, whose influence has been huge. Viewing it again as a senior, I find many of the sets remarkable, especially the Dali-esquire richness of the Carmen story. I hope to view it anew on TCM and to smile and applaud all over again!",
         "I bought this movie on VHS \"at the dawn on the home video age\" and, curiously, never got around to watching it until I watched the 2005 National Film Museum version on TCM this afternoon. To compare, I hauled out my bought copy, Video Arts International's VAI-15, which is also the 126-minute U.S. version released theatrically in 1962. (Neither this title nor any title in this format is any longer in VAI's catalog.) The following comments refer to the version seen today on TV. All in all, I found the performances, the choreography, the staging, and the technical elements surrounding them quite intriguing and enjoyable. Two of the technical elements, in particular, bear mentioning. The color photography is luscious, but not what one typically thinks of when the movie is shot in Technicolor. Although the colors themselves are brilliant and distinct, there are no shades of gray in evidence. Grays come out black, detracting from some of the more darkly-lit pieces, and making the overall appearance one of high contrast. Additionally, some of the skin tones tend more toward \"white\" than toward \"flesh-colored,\" aggravated no doubt by the contrast between dark and light. Secondly, a feature that I consider a giant plus is that this movie of set ballet pieces was filmed before the arrival of the short attention span of the MTV Generation, when popular music videos corrupted the video style of even live performances, including many found on PBS. Here, although different camera angles are employed to good effect, they don't switch every five seconds making the viewer dizzy and disoriented. In short, one can actually watch and enjoy this performance instead of having one's concentration constantly distracted by helter-skelter random shots of the action. In summary, this film of four ballets provides a fascinating \"Roland Petit retrospective\" nearly a half-century later.",
         "I only watched the Cyrano de Bergerac segment of this movie. I know the play backwards and forwards, I know the various French and American movies that have been derived from it. I thought I would see what Roland Petit came up with to justify turning it into a ballet. The answer, in my opinion, was nothing. None of his choreography does anything to illuminate the story. It goes by quickly, but it never makes any effect. Perhaps the other three segments of this movie are better. I don't know. I won't bother to find out. Nothing in the Cyrano segment gave me any reason to explore further.",
         "Spoilers herein. This film is truly dreadful, and I say that as an enthusiast of dance and the dance film. Some of the dancing is fine, but most of the choreography looks half finished or borrowed from elsewhere. The music surely is and appears to have been whipped together and performed overnight between some real engagement. It is so bad everything goes better with no sound. And that's true of Chevalier, who does a cartoon of himself. If he weren't dead serious, it would be funny. The camera and editing are universally bad -- one can get away with a lot in ordinary films, but there is little margin for blunt imagination in filming dance. The colors and sets are apt. Cyd and Moira are stunning. Ted's Evaluation: 2 of 4 -- Has some interesting elements."
      ],
      "genres": [
         "Drama",
         "Musical"
      ],
      "productionCompanies": [
         "Doperfilme",
         "Grandes Productions Cinématographiques",
         "Talma Filmes"
      ],
      "summaries": ["Live scenes of Paris and a continuity Narrator link together four dramatic choreographies, all by Roland Petit: Carmen (1949), La croqueuse de diamants (1950), Deuil en 24 heures (1953), and Cyrano de Bergerac (1959)."],
      "budget": 0
   },
   "movielensId": 3583,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1962-02-20",
      "dvdReleaseDate": "2000-04-25",
      "directors": ["Terence Young"],
      "runtime": 140,
      "movieId": 3583,
      "title": "Black Tights",
      "mpaa": "",
      "actors": [
         "Cyd Charisse",
         "Moira Shearer",
         "Zizi Jeanmaire",
         "Roland Petit",
         "Maurice Chevalier"
      ],
      "imdbMovieId": "0053726",
      "originalTitle": "1-2-3-4 ou Les collants noirs",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "Live scenes of Paris and a continuity Narrator link together four dramatic choreographies, all by Roland Petit: Carmen (1949), La croqueuse de diamants (1950), Deuil en 24 heures (1953), and Cyrano de Bergerac (1959).",
      "tmdbMovieId": 117781,
      "avgRating": 2.58333,
      "releaseYear": "1962",
      "numRatings": 6,
      "posterPath": "/vn6VRjNyYtJXsXUVDFrAjdxp3pc.jpg"
   }
}