{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "civil war",
            "id": 393
         },
         {
            "name": "spy",
            "id": 470
         },
         {
            "name": "hijacking of train",
            "id": 4655
         },
         {
            "name": "train ride",
            "id": 5552
         },
         {
            "name": "espionage",
            "id": 11134
         },
         {
            "name": "train",
            "id": 13008
         },
         {
            "name": "railway",
            "id": 18044
         },
         {
            "name": "american civil war",
            "id": 179585
         }
      ],
      "imdb_id": "tt0049279",
      "video": false,
      "title": "The Great Locomotive Chase",
      "recommendations": [
         43229,
         84840,
         75116,
         64877,
         33331,
         21147
      ],
      "backdrop_path": "/xZ4RZT4685BJF5Ks2QIIv1Eo5P6.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "James J. Andrews",
               "gender": 2,
               "credit_id": "52fe462a9251416c9104b671",
               "name": "Fess Parker",
               "profile_path": "/xtUQk0RgNSP9OBOlpPPQxplhgef.jpg",
               "id": 50571,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "William A. Fuller",
               "gender": 2,
               "credit_id": "52fe462a9251416c9104b675",
               "name": "Jeffrey Hunter",
               "profile_path": "/rK5yovSBl25ginB2wiYLwLw0eGF.jpg",
               "id": 30551,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "William Campbell",
               "gender": 2,
               "credit_id": "52fe462a9251416c9104b679",
               "name": "Jeff York",
               "profile_path": "/9IT2PeqOiqA3jMYa0bGRmSMfrGZ.jpg",
               "id": 34470,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "William Pittenger",
               "gender": 2,
               "credit_id": "52fe462a9251416c9104b67d",
               "name": "John Lupton",
               "profile_path": "/6lfU2KLkevzfzyMMlu6eBw6ClLT.jpg",
               "id": 30844,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Robert Buffum",
               "gender": 2,
               "credit_id": "52fe462a9251416c9104b681",
               "name": "Eddie Firestone",
               "profile_path": null,
               "id": 12423,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Anthony Murphy",
               "gender": 2,
               "credit_id": "52fe462a9251416c9104b685",
               "name": "Kenneth Tobey",
               "profile_path": "/eDD3rIv203f48tnu7ONwfjXQW7J.jpg",
               "id": 103069,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Marion A. Ross",
               "gender": 2,
               "credit_id": "52fe462a9251416c9104b689",
               "name": "Don Megowan",
               "profile_path": "/x1PLgA5v2e8zYBGwJ042zqJhAqJ.jpg",
               "id": 31208,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Jacob Parrott",
               "gender": 2,
               "credit_id": "52fe462a9251416c9104b68d",
               "name": "Claude Jarman Jr.",
               "profile_path": "/wWcq3DNL3CZe0j1oCjdieMxYONA.jpg",
               "id": 70036,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "William Bensinger",
               "gender": 2,
               "credit_id": "52fe462a9251416c9104b691",
               "name": "Harry Carey, Jr.",
               "profile_path": "/p0olWUm87R6CPsL5M9FnxNSFszF.jpg",
               "id": 4316,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "J.A. Wilson",
               "gender": 2,
               "credit_id": "52fe462a9251416c9104b695",
               "name": "Leonard P. Geer",
               "profile_path": null,
               "id": 191706,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "William Knight",
               "gender": 0,
               "credit_id": "52fe462a9251416c9104b699",
               "name": "George Robotham",
               "profile_path": "/vKoealoZYmBjQEj42SnE7FJpl0U.jpg",
               "id": 34131,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Wilson Brown",
               "gender": 0,
               "credit_id": "52fe462a9251416c9104b69d",
               "name": "Stan Jones",
               "profile_path": null,
               "id": 933693,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "John Wollam",
               "gender": 0,
               "credit_id": "52fe462a9251416c9104b6a1",
               "name": "Marc Hamilton",
               "profile_path": "/fLeE5amNA9RGYYjaTgDOSv9Hxuf.jpg",
               "id": 571663,
               "order": 12
            },
            {
               "cast_id": 14,
               "character": "John M. Scott",
               "gender": 0,
               "credit_id": "52fe462a9251416c9104b6a5",
               "name": "John Wiley",
               "profile_path": null,
               "id": 933694,
               "order": 13
            },
            {
               "cast_id": 15,
               "character": "Pete Bracken",
               "gender": 2,
               "credit_id": "52fe462a9251416c9104b6a9",
               "name": "Slim Pickens",
               "profile_path": "/pNIO3A9WmjyjVSIJ7jALoXGzpQJ.jpg",
               "id": 14253,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe462a9251416c9104b6af",
               "name": "Lawrence Edward Watkin",
               "profile_path": null,
               "id": 52217,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe462a9251416c9104b6b5",
               "name": "Walt Disney",
               "profile_path": "/mrcVG49U2PVm1LpPMmwBtn5ZzOh.jpg",
               "id": 2106,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe462a9251416c9104b6bb",
               "name": "Paul J. Smith",
               "profile_path": "/y8Z9LQ1vAVWqpjfMOYNmSs6mZd0.jpg",
               "id": 2107,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe462a9251416c9104b6c1",
               "name": "Francis D. Lyon",
               "profile_path": null,
               "id": 29324,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe462a9251416c9104b6c7",
               "name": "Lawrence Edward Watkin",
               "profile_path": null,
               "id": 52217,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 2.139507,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 37112,
      "vote_count": 7,
      "budget": 0,
      "overview": "During the Civil War, a Union spy, Andrews, is asked to lead a band of Union soldiers into the South so that they could destroy the railway system. However, things don't go as planned when the conductor of the train that they stole is on to them and is doing everything he can to stop them. Based on a true story.",
      "similar": [
         961,
         954,
         56288,
         37724,
         36669,
         646,
         681,
         47971,
         207703,
         206647,
         9486,
         818,
         213,
         27576,
         36955,
         49517,
         37834,
         302699,
         1656,
         38142
      ],
      "original_title": "The Great Locomotive Chase",
      "runtime": 85,
      "poster_path": "/bie1hl0e1OrTXLsoYXdrvUPI7cD.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Walt Disney Productions",
         "id": 3166,
         "origin_country": ""
      }],
      "release_date": "1956-06-08",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "A true-life spy story of ultimate suspense. High speed and inconceivable bravery!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Francis D. Lyon"],
      "runtime": 85,
      "synopsis": null,
      "writers": ["Lawrence Edward Watkin"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0049279/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNDgwNjg5MDYxNV5BMl5BanBnXkFtZTcwMjEzMzUyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Fess Parker, Jeffrey Hunter, Jeff York | See full cast and crew »"],
      "reviews": [
         "As I have mentioned previously there are a limited number of commercial films about the American Civil War. Most people will instantly say GONE WITH THE WIND, but much of that film deals with the ante - bellum South before war begins, and an hour and a half deals with Georgia under Reconstruction into the late 1870s. There is the twin films GODS AND GENERALS about the rise and fall of the magnificent military partnership of Robert E. Lee and Thomas Jonathan \"Stonewall\" Jackson, and GETTYSBURG. There is also THE HORSE SOLDIER about Grierson's Raid into Mississippi during the Vicksburg Campaign. There was the \"Shiloh\" segment of the HOW THE WEST WAS WON about the battle there. There was THE RAID about the attack of the Confederate Raiders from Canada on St. Albans, Vermont in the summer of 1864. Quantrell and his raiders appear in several films, most notably DARK COMMAND. There is also the prototype for GONE WITH THE WIND about the collapse of southern society called SO RED THE ROSE. It is notable that the emphasis is on raiders from the southern states or with southern sympathies (William Quantrell or Cantrell, or the St. Alban Raiders). But there are two films on one incident where the raiders were Northern raiders - the raid led by John J. Andrews in his celebrated February 1862 snatch of the locomotive \"The General\" in an attempt to damage southern railroad tracks and bridges in Georgia and Tennessee. The incident has ended up being the most discussed military operation of the land forces of the Civil War in film. First it was immortalized in what may have been the funniest war comedy ever made, Buster Keaton's THE GENERAL (1927). But Keaton, using the Andrews raid as a start, changed the story by having the Union raiders succeed for awhile in bringing the Confederate locomotive to Union lines and has his southern hero \"Johnny Gray\" steal it back. Unfortunately, Andrews and his raiders never had such luck. Indeed their fates were quite savage in reality. This 1956 film by Walt Disney is not as well known as Keaton's classic, but it come closer to being factually correct. It shows the planning of the scheme by Northern spy Andrews and his picked crew, how they stole the \"General\" in a surprise act when the train was getting refilled, and how they ran it for a twenty mile chase until the train reached the end of it's coal supply. Here the reality of the story gets more savage. Andrews and his men fled into the forests of Tennessee, and were tracked down by Southern troops who recaptured most of them. Andrews and several others were hung. The other captured raiders were sent to prison camps. For people who only think of Fess Parker as Walt Disney's \"Davy Crockett\" may be fascinated to see he played another role for that producer - and did a good job at it. And like the last episode of the series about the \"King of the Wild Frontier\", Parker's character died heroically, but violently again.",
         "Fess Parker stars as James Andrews, Yankee spy, who takes an extremely dangerous mission during the Civil War. Parker has his trademark easy-going smile on throughout the entire film, as he and a group of Union soldiers try to steal a train and destroy about a 1000 miles of train track, in an effort to cut the supply lines of the Rebel army and deal the South a fatal blow. Jeff Hunter and Kenneth Tobey are loyal Southern train officials who try to stop them by using every means under their disposal, which include running after the train for miles, using a handcart and stealing another engineer's engine. Jeff York, Dick Sergeant, Harry Carey Jr., and John Lupton, plus a lot of other character actors, round out Fess' Union forces. This film is pretty accurate, as historical Disney movies go, and is based on a true story. Buster Keaton's silent film \"The General\" is also based on the same Civil War event. Disney just released the movie on DVD, in its original widescreen format; the picture is sharp and detailed, with wonderful, bright colors and fine, clear sound. This is an excellent way to see this movie, and is well worth the money. It would be great if Disney would put out Fess' other films, the original 3 part \"Davy Crockett\" and the hilarious \"Davy Crockett and the River Pirates\" in this format, too, as well as \"Dr. Syn, Alias the Scarecrow\". In fact, I'd love to see all their live action films on DVD and in their original aspect, and done as well as \"The Great Locomotive Chase\".",
         "This is really not a review as such, even though I really enjoyed this film when I saw it as a kid and am glad it is now available on DVD.I do hope they have included the \"making of\" that aired on Disneyland when the film was first released. My main comment is about the obscure connection of The Great Locomotive Chase,the actual event and Gone With the Wind. The conductor who chased Andrews, Capt William A.Fuller lived in Atlanta after the war and he had a daughter named Annie Laurie Fuller. Annie married Atlanta architect, artist and historian Wilbur G.Kurtz. Wilbur and Annie were friends of Margaret Mitchell. When GWTW was being filmed, Mitchell suggested Kurtz be the technical adviser on the film. The Kurtzs spent a great deal of time in Hollywood. Kurtz kept a diary of his work on the film that was published in the The Atlanta Historical Journal in the Summer 1978 issue, Vol XXII Number 2. Annie Laurie took some of the pictures that accompany the article. I found this connection to be interesting and if anyone out there is a GWTW junkie like myself, try to get a copy of the above mentioned journal. There is a wealth of information on the making of GWTW.",
         "Finally, those of us who are railroad and civil war fans have an excellent widescreen version of this movie, with the release of The Great Locomotive Chase on DVD. While some of the details in the story line are not accurate history, Disney did a very good job. The trains even have link and pin couplers which are virtually never seen in movie accounts of the period.",
         "The Great Locomotive Chase While watching \"TGLC\" with my mother, she informed me that her father was a brakeman for the railroad. \"A brakeman is a train board rail transport worker in the U.S. Historically, the brakeman was the person who would walk the length of a train atop the cars while the train is in motion and turn the brake wheel on each car to apply the train's brakes\" from Wicipeda. A movie like this conjors up several different thoughts of wonder. What was it like to despise your fellow countrymen? What was it like to live in a country where you had no instant means of communication and travel? The movie paints an interesting historical picture that highlights the animosity between the North and the South during the civil war. It also presents us with the first recipients of the Congressianl Medal of Honor. Did I get that right? TGLC does have some impressive chase sequences that ended rather disappointedly for the Northerns. I guess I really thought they were going to get away with stealing a train. They would have gotten away with it too, if it hadn't been for that rotten train conductor William Campbell (Jeffrey Hunter) and his mangy dog. It's also fun to see Jeff York (Mike Fink) and Fess Parker (Davy Crockett) on hand to lend personality to this Civil War light family drama. My mother enjoyed it more than I did. This is one of those movies I can appreciate but don't necessarily like. It just didn't draw me in to the train ride. It didn't roll me down the tracks. I was busy writing another movie review at the time, so maybe the distraction derailed me a tad bit. I would perhaps watch it again sometime and give it more of a fair chance. I did like at the end how the Fess Parker Character (James Andrews) even though he was going to hang for stealing a confederate train, wanted to make peace with the man whose train he stole, William A Fuller. (Jeffrey Hunter). He knew the war would end and that both sides would have to shake hands in peace and that he wanted to do it now because he wouldn't be alive to do it later. He didn't beg for his life, didn't insult his enemy, wasn't hoping to not be hanged, but just wanted to make peace with his enemy thus making peace with his God. This powerful scene of redemption and forgiveness makes up for any boring element I may have found in the picture. A good film that deserves a rental for those interested in learning about history in a fun way.",
         "Quite often history throws up a story that is equally, if not more, exciting than anything a screenwriter can dream up. The story of Andrews' Raiders is one such example. These true events took place during the American Civil War and formed the basis for the 1927 Buster Keaton film \"The General\". In \"The Great Locomotive Chase\", a 1956 offering from Disney, the story is dealt with more seriously and earnestly than in Keaton's comedic version. While \"The General\" is easily the better film - indeed, one of THE greatest films of all-time - this version has much to recommend it too. Union spy James J. Andrews (Fess Parker) works deep in the Confederate territory and is totally trusted by his southern foes. He is asked by a Union general to lead an audacious raiding party deep behind enemy lines. Their mission is to destroy a series of bridges that carry a vital rail line from Atlanta to Chattanooga, so that the Union army can advance on Chattanooga without having to worry about the enemy strengthening itself with reinforcements. Andrews enlists a group of bored Union soldiers led by William Pittinger (John Lupton) to help him in his mission. The men pose as Kentuckians planning to join the Confederacy, and trek deep into rebel territory. They seize control of a locomotive called The General and use it to travel along the line, tearing up track and cutting telegraph wires as they go. But as they approach the first bridge that they have been ordered to destroy, they realise that a group of Confederates are hot on their heels, led by an indomitable train conductor, William Fuller (Jeffrey Hunter), who worked on The General before it was stolen and is determined to get it back. There ensues an exhilarating chase during which both sides are stretched to the limit in terms of determination, courage and ingenuity. \"The Great Locomotive Chase\" is an almost forgotten film that has not retained its popularity or reputation like so many of the Disney productions. It is rather sad that the film has faded into obscurity - there is certainly enough here to keep audiences engrossed. While Parker is a somewhat stolid hero, the performance of Hunter as his challenger is very energetic and enjoyable. Francis D. Lyon directs the film at a sprightly pace, especially during the train chase sequence which is full of sustained excitement. The film is pretty much pared to the bone, so that the story is very brisk and involving, completely unburdened with extraneous detail. There is even some surprising depth to the proceedings - in one particularly memorable scene Andrews and Pittinger discuss how much one can learn to hate one's own lies and deception when engaged in spy work. \"How do you stand it?\" asks Pittinger in a moment of anguish, a man clearly tormented by the underhand nature of the job he's carrying out. \"The Great Locomotive Chase\" is a solid and enjoyable little film that deserves a viewing.",
         "\"The Great Locomotive Chase\" is the true story of the most famous train chase in the American Civil War, headed by Andrews' Raiders. They were Union spies who sank deep into the south and stole a Confederate train, and headed north. The goal was to destroy the lines of communication for the South and their supplies. Ultimately though, the mission was a failure and the Union spies were captured. This film is told from the perspective of the Union forces and stars Fess Parker as Andrew and Jeffrey Hunter as the southerner who fails their mission. One of the best Fess Parker films to come out of the Disney Studio in the 1950's. The idea for the film came from Buster Keaton's silent era film, \"The General (1927),\" which he had starred in and directed. It is told from the perspective of the South, unlike \"The Great Locomotive Chase.\" The best scene involves the burning of a train car and explosives to try to collapse a bridge. For a brief moment, the viewer might believe the Union spies will get away. This is a superb film, 9 of 10!!",
         "In the wake of his burst of popularity after becoming that iconic figure for Fifties kids Davy Crockett, Fess Parker starred in The Great Locomotive Chase. The film is based on a true incident from the Civil War involving an espionage mission where several Union soldiers are sent under the leadership of a civilian who knows the territory. The idea is to seize a train and destroy as much railroad equipment and track between Marietta, Georgia and Chattanooga, Tennessee. The fact that Fess Parker as John J. Andrews is a civilian is cause for much dissension in the ranks of these soldiers who are not used to operating with stealth tactics. One of them, Jeff York, is obstreperous to the point of mutiny. Although Parker is the star, depending on your point of view the real hero is Jeffrey Hunter who is the conductor of the train Parker and his men steal. Hunter is courageous, cunning, and resourceful and every bit a match for Parker and his tricks. From back in the day I remember that the Disney Studio was marketing toy trains based on the locomotives used in this film. No amount of begging could get my parents to part with any money for one of those. But somewhere some folks around my age have those models and I daresay they're worth a fortune. The Great Locomotive Chase is a fine well constructed film that is as fresh today as when I saw it in theaters way back when. A must for any Civil War film festival.",
         "The main trouble with this film, from my point of view, is that it's simply *the wrong way round*; whether the problem is inherent in the story or not I don't know, but while the film is based on the memoir of a Union soldier and clearly intends the Union raiders to be its protagonists, the way in which it is actually made means that you -- or at least I -- end up willing the other side on to win instead. Outnumbered, indomitable and prepared to chase down his train on foot, on a hand-car or on the footplate of a tiny, elderly shunting engine, Fuller is all but presented as the hero, and the temptation is to cheer for the arrival of the cavalry in the nick of time rather than to feel alarmed for the train-stealing spies. The fact that all the Southerners we meet in the course of the film are depicted as the best of fellows whom the narrator is ashamed to deceive, while the Northern soldiers spend most of it bickering amongst themselves, doesn't help either. This makes it a rather unusual beast: a film in which, as so often in Hollywood, I find myself cheering on the 'wrong' side, and yet one in which, to all intents and purposes, the 'wrong' side actually wins. The script does its best to present the Union failure as a moral victory, but it's not entirely convincing about it. I found the result to be a rather disconcerting balance. My other problem with the film was that basically, the train sequences are the main reason for the film's existence and as such occupy a large chunk of the running time; but they're not all of it, and the sections before and after are not exactly enthralling in comparison. If it's a history book, it's a Ladybird history: beautifully illustrated, but basically aimed at children's level, while the railway action is indeed exciting but has the effect of biasing the viewer the 'wrong' way. This sounds as if I thought it was a bad film, and on the whole I didn't. I don't think it's a particularly great one either, and either it or I (or both) are distinctly confused, but I'd recommend it as entertainment... especially to railway fans!",
         "Excellent film! I enjoyed every minute of this rather short, but greatly superb film on Great Locomotive Chase of 1862 near Chattanooga. The real story makes this film even more interesting, and the whole work is awesome. Excellent musical score, great scenery, decent performance of all actors, very thrilling trains, shoot-outs, North and South clashing, real drama, real feelings, very good details, very accurate depiction of moral and habits of people of those times.All of these makes this Old Style Hollywod film a very good watch. I do recommend this to all Civil War buffs!And even common film viewers will like this film and find it very brisk and very cool"
      ],
      "genres": [
         "Action",
         "Adventure",
         "Family",
         "War",
         "Western"
      ],
      "productionCompanies": ["Walt Disney Productions"],
      "summaries": [
         "This is based on a true story. During the Civil War, a Union spy, Andrews, is asked to lead a band of Union soldiers into the South so that they could destroy the railway system. However, things don't go as planned when the conductor of the train that they stole is on to them and is doing everything he can to stop them.",
         "During the Civil War Union spy Andrews and his men volunteer to steal a Confederate train and drive it to Union territory while destroying the Confederate railway system along the way."
      ],
      "budget": 0
   },
   "movielensId": 3585,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1956-06-08",
      "dvdReleaseDate": "2000-04-25",
      "directors": ["Francis D. Lyon"],
      "runtime": 85,
      "movieId": 3585,
      "title": "The Great Locomotive Chase",
      "mpaa": "G",
      "actors": [
         "Fess Parker",
         "Jeffrey Hunter",
         "Jeff York",
         "John Lupton",
         "Eddie Firestone",
         "Kenneth Tobey",
         "Don Megowan",
         "Claude Jarman Jr.",
         "Harry Carey",
         " Jr.",
         "Leonard P. Geer",
         "George Robotham",
         "Stan Jones",
         "Marc Hamilton",
         "John Wiley",
         "Slim Pickens"
      ],
      "imdbMovieId": "0049279",
      "originalTitle": "The Great Locomotive Chase",
      "genres": [
         "Action",
         "Adventure",
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": ["epp9r-JjYvs"],
      "plotSummary": "During the Civil War, a Union spy, Andrews, is asked to lead a band of Union soldiers into the South so that they could destroy the railway system. However, things don't go as planned when the conductor of the train that they stole is on to them and is doing everything he can to stop them. Based on a true story.",
      "tmdbMovieId": 37112,
      "avgRating": 3.27841,
      "releaseYear": "1956",
      "numRatings": 88,
      "posterPath": "/bie1hl0e1OrTXLsoYXdrvUPI7cD.jpg"
   }
}