{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "musical",
            "id": 4344
         },
         {
            "name": "rock music",
            "id": 11700
         }
      ],
      "imdb_id": "tt0080913",
      "video": false,
      "title": "The Idolmaker",
      "recommendations": [
         24731,
         42176,
         32014,
         21873,
         14664,
         18391,
         21721,
         15462,
         10896,
         25305,
         30547,
         14460
      ],
      "backdrop_path": "/hUi3ee5nrL9tE2EpFVwhVtmr6WM.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1009,
               "character": "Vincent 'Vinnie' Vacarri",
               "gender": 2,
               "credit_id": "52fe45f1c3a36847f80e353d",
               "name": "Ray Sharkey",
               "profile_path": "/lGaXjbHQgVZD2W3PmMwtRhqk0n2.jpg",
               "id": 101752,
               "order": 0
            },
            {
               "cast_id": 1003,
               "character": "Caesare",
               "gender": 2,
               "credit_id": "52fe45f0c3a36847f80e3523",
               "name": "Peter Gallagher",
               "profile_path": "/76p7x64BpkgNJCLb5d7xklQ1Fzd.jpg",
               "id": 8212,
               "order": 1
            },
            {
               "cast_id": 1006,
               "character": "Gino Pilato",
               "gender": 2,
               "credit_id": "52fe45f1c3a36847f80e3531",
               "name": "Joe Pantoliano",
               "profile_path": "/zBvDX2HWepvW9im6ikgoyOL2Xj0.jpg",
               "id": 532,
               "order": 2
            },
            {
               "cast_id": 1002,
               "character": "Tommy Dee",
               "gender": 2,
               "credit_id": "52fe45f0c3a36847f80e351f",
               "name": "Paul Land",
               "profile_path": null,
               "id": 223622,
               "order": 3
            },
            {
               "cast_id": 1004,
               "character": "Harmon",
               "gender": 2,
               "credit_id": "52fe45f0c3a36847f80e3527",
               "name": "JoJo D'Amore",
               "profile_path": null,
               "id": 1146140,
               "order": 4
            },
            {
               "cast_id": 1007,
               "character": "Ellen Fields",
               "gender": 1,
               "credit_id": "52fe45f1c3a36847f80e3535",
               "name": "Maureen McCormick",
               "profile_path": "/jw1itfTFlqfYtUC9nuR3mbVVpig.jpg",
               "id": 75346,
               "order": 5
            },
            {
               "cast_id": 1008,
               "character": "Mrs. Vacarri",
               "gender": 1,
               "credit_id": "52fe45f1c3a36847f80e3539",
               "name": "Olympia Dukakis",
               "profile_path": "/8kYmUwC0SfnJKt39M5Xrr8Q0oIf.jpg",
               "id": 3019,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe45f0c3a36847f80e351b",
               "name": "Taylor Hackford",
               "profile_path": "/heZfdghufTV3t3ayrWvIuiP1jvb.jpg",
               "id": 18596,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45f0c3a36847f80e352d",
               "name": "Edward di Lorenzo",
               "profile_path": null,
               "id": 30650,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 0.351707,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 42159,
      "vote_count": 5,
      "budget": 0,
      "overview": "Based on the life of rock promoter/producer Bob Marucci, who discovered, among others, Frankie Avalon and Fabian.",
      "similar": [
         2005,
         872,
         11224,
         224141,
         14128,
         16119,
         15121,
         11970,
         786,
         812,
         824,
         8587,
         10020,
         11631,
         27,
         69,
         621,
         703,
         15969,
         3933
      ],
      "original_title": "The Idolmaker",
      "runtime": 117,
      "poster_path": "/eF14dhUt06TNJkkA1xtOSjMV7a4.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1980-11-14",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "He's got the look... He's got the talent... He's got the Idolmaker... He's got it all!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Taylor Hackford"],
      "runtime": 117,
      "synopsis": null,
      "writers": ["Edward Di Lorenzo"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0080913/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkxMjAwMzU5OF5BMl5BanBnXkFtZTcwODgzNzA2NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Ray Sharkey, Tovah Feldshuh, Peter Gallagher | See full cast and crew »"],
      "reviews": [
         "This movie is the ultimate sleeper for me. What kept this movie from exploding into the theaters ? It has great direction, outstanding music, and career-defining performances ! \"The Idolmaker\" truly has everything. It is set during the time when Elvis was in the Army and everyone was looking for the Next Big Thing (Fabian, Frankie Avalon etc.). It shows how a man who is a great songwriter can turn guys who \"have the look\" into superstars. This is the role that Ray Sharkey was born to play. It is almost as though he was the person who wrote the script, and had himself in mind for the role all along. You can just see the way he delivers his lines, dances to the music, and sings, that he truly is Vincent Vacarri. Besides the fact that the acting is great, the musical performances are flawless. The songs just explode from the screen with catchy tunes. It gets especially interesting towards the end when Caesare (Peter Gallagher) gives his giant production live number. Folks, if you haven't seen this movie (and I highly doubt that you have) - do yourself a favor and see it ! Like I said, it is a hard to find movie - but it is worth the time to track it down. This is what happens if all the elements are clicking properly for a film with musical numbers. Like I said, it's the biggest secret in film. Now that you know the secret, do yourself a favor and rent it. You'll thank me afterwards !",
         "A lot of postings indicate that this movie could do well in even today's competitive film market. And it could indeed. The late Ray Sharkey gives a very strong award-calbre performance as a repressed performer in the guise of a songwriter/manager for a couple of 1950s style teen idols. A very young Peter Gallagher showed signs that he might have a bigger career than he has apparently had. It's funny how an actor can look so \"exotic\" and really not actually BE exotic. It's this kind of irony that carries IDOLMAKER to the heights of classic filmaking.",
         "Tragically, released at a time when United Artists was busy going bankrupt making \"Heaven's Gate\" (see book FINAL CUT), this film was lost among a number of gems (Rich Kids; Pope of Greenwich Village; TrueRomance), \"Idolmaker\" is truly in a class by itself. Its acting is uniformly impeccable, direction, cinematography and both writing and song score--by the legendary Jeff Barry--of Barry and Cynthia Weil fame, the film is refreshingly bereft of dead spots,contrived moments and false notes (and I'm not just talking about the music).Ray Sharkey is at his volcanic best. JOE PANTOLIANO is cast against character as (no kidding) Sharkey's milquetoast songwriting partner--and acquits himself magnificently. Olympia Dukakis gives a FINE performance as Sharkey's mother--and Peter Gallagher does his own singing--while delivering the performance of a lifetime as the naive-turned-meglomaniacal Avalon character.Due to his heroin addiction, Sharkey's career floundered in years following this star-making role... lowering him to parts in the likes of \"Hellhole\" with Marjoe Gortner. He ended up flat broke, living with his mother in NYC.What followed was bittersweet and merits extra attention to a wonderful First Act scene: While watching the movie on TV, he was struck by scene where his mother urges him to swallow his pride and ask his estranged father to finance his start in show business.Seeing That one scene years later restored his self-esteem and inspired him to get clean and sober and get back into the game. He was barely out of rehab when he landed the role of Atlantic City mobster Sonny Steelgrave in TV's\"Wiseguy\"'s very first story arc. Those episodes remain cult classics,and are available on DVD. Loosely based on the career of Bob Marcucci, and his protégés Fabianand Frankie Avalon, this movie truly has it all: pathos, humor, an unflinching look at the free-for-all pre-Beatles Teen Idol gap that resulted from Elvis' stint in the Army.",
         "It was fall of 1980 and I was listening to NBC Radio ( A.M. ). At the time, that station played great music of the day. I remember calling up a radio contest which said that you could win tickets to the premiere of a new movie called \" The Idolmaker \" at Radio City Music Hall in New York City ( Manhatten ). I could not believe that I actually got thru and when I did was told that I had won. They wanted my name, address and phone number and told me that I would be receiving tickets to the premiere of the movie. What made matters even more great was the fact that my ex-husband worked for Rockefeller Center, not NBC otherwise we wouldn't have been eligible for winning these tickets. What luck! The premiere of this movie was amazing!!! I loved the acting, and the singing was to die for. After the movie ended, the stars of the show got up on the Radio City stage and spoke a few words thanking everyone who attended. I was privileged to have been seated in the 5th row from front. Peter Gallagher was so handsome in person as was Paul Land. Ray Sharkey ( may he rest in peace ) was at his finest hour. Even though this movie received a bad review and it didn't do too well in the theaters, I believe that many people were not given the opportunity to see what a fine movie this really was. Prince and Michael Jackson are big fans of this movie and for good reason. \" You can be anything you want to be \" , and that is the motto of this movie. Singer, songwriter, artist-you can make it!",
         "I first saw this movie on HBO in 1981. At that time HBO only showed box office flops. The supposedly really good ones would not get on HBO for 3 or 4 years. I just saw it again tonight, after 23 years, and I still enjoyed it. The music is great, the acting is great, and the plot is great. What is there not to like about it? I tried watching Chicago in 2002, the academy award winner, and it was a piece of crap. It was a combination Alfred Hitchcock/Showboat/Singing in the Rain movie, that was a total flop in my opinion. I much more enjoyed this movie. There are a few slow points in the movie, but they don't last for long. There is such energy and vivacity in this movie that it holds your attention as it builds up continually to the next \"Idol.\" The songs stick in your mind (at least in mine), but they are always \"in the wings\" of the Ray Sharkey character. For example, the first idol he made, Sharkey is shown off stage mimicking the singer's moves. Anyway, it is a fun movie to watch, and one of a kind for its time, so I highly recommend it!",
         "This was such an engaging film, the more so because of it's basis in fact. I saw this first around 1981 or 82 on cable tv, which I recorded, but had stolen by a guest. I still have the audiocassette recording I made from the vinyl record and listen to it often. Recently, I obtained the DVD through Barnes and Noble (request services). All of the stage performances are riveting and they culminate in that spellbinding finale down in Tennessee. I too cannot fathom why it never hit the bigtime. If it were to be re-released in theaters today it could still be a minor hit.",
         "This movie is one of my all time favorites. Ray Sharkey and Peter Gallagher were amazing. The songs were great, in fact I use to own the sound track. To this day I know the words to every song. It was clear from the first time I saw the movie that Peter would go on to have longevity. I wish I knew what happened to Paul Land. He made a really good Tommy Dee. I saw the movie the other day and I still find myself having as much fun as I did when I saw it on Cable in 1981. Oh yeah Joe Pantiliano (Bad Boys, Sopranos) made a lasting impression as well. Great acting, fun for all. It is a must see for anyone with a dream. ( smile)",
         "Late, great character actor Ray Sharkey gives a sensationally dynamic, throughly brazen and completely on the money bravura performance as shrewd dude late 50's rock'n'roll hustler/producer/ manager/songwriter/all-around shyster sleaze-ball extraordinaire Vinnie Vacarri, who's got everything but the requisite good lucks to cut it as a teen scream sensation. Resigned to this bitter fact, Vinnie instead decides to groom callow, but promising handsome lads Paul Land and Peter Gallagher into fluffy bubblegum teen pop idol sensations so he can vicariously live through their monumental successes. Vinnie transforms raunchy slob Land into an irresistibly dreamy, well-mannered Adonis. Vinnie pulls off an even more miraculous metamorphosis with Gallagher, a klutzy busboy who under Vinnie's masterful tutelage becomes a devastatingly hunky stuff muffin on wheels. Alas, Vinnie's ego and over-controlling nature skyrocket along with his newfound popularity and teeming bank account, leading to inevitable conflicts and Vinnie's painful downward spiral back into the dismal obscurity he started from. Loosely based on the real-life story of legendary South Philadelphia pop music impresario Robert Marcucci (the man who discovered both Fabian and Frankie Avalon; he gets a \"technical adviser\" credit for this picture), Taylor Hackford's terrifically tart rock bio is more notable not for what it does, but for what it bravely and commendably avoids doing. Although set in the much sentimentalized 50's, Hackford's boldly unromanticized movie certainly isn't some plasticky rosy nostalgia piece. Instead Hackford, working from Edward Di Lorenzo's smart, cheeky, astutely observed script, offers a tantalizingly tawdry warts'n'all depiction of the blithely amoral behind-the-scenes music business wheeling and dealing: payola, groupies, wheedling, backstabbing and betrayal, sneaky advanced promotion tactics, rock music as strictly a hot marketable commodity to make money off of -- y'know, all that tasty lowdown dirty stuff that goes on backstage that the record-buying public isn't supposed to know about. Moreover, the songs and on-stage performances are both top-notch: Veteran songwriter Jeff Barry penned the bouncy, moony, incredibly perky and catchy tunes while Denny Terrio did the vital, mildly lewd, daringly impertinent and provocative dance choreography. The acting is across-the-board excellent as well: Land and Gallagher (the latter also does his own strikingly fine singing) are amiably wide-eyed and convincing, while Joe Pantoliano as Vinnie's loyal songwriter best friend, Tovah Feldshuh as a canny, demanding teen mag editor, Olympia Dukakis as Vinnie's loving mom, Richard Bright (Al Neri in all three \"Godfather\" films) as Ray's ineffectual loser uncle, and everyone's favorite Brady girl Maureen McCormick as an eminently desirable teen zine writer acquit themselves superbly in supporting roles. Ultimately, it's nonetheless still Ray Sharkey's show all the way: forcefully projecting a certain low cunning, oozing scintillating reptilian charisma from every vibrantly oily pore, dressed to the nines in sharp suits, perpetually on the make and furiously talking a dazzling line in rhythmic rat-a-tat-tat pitter-patter bulls**t, Sharkey's spot-on, positively electrifying characterization deservedly nabbed him a Golden Globe Award and now serves as a sterling reminder of just how remarkably tragic his untimely AIDS-related death truly is. Rest in peace Mr. Sharkey and thank you for all your wonderful performances.",
         "We loved this movie! I loved it years later and special ordered the soundtrack on vinyl. Now I'm trying to get it on cd. Impossible I think. Peter Gallagher was hot as \"Fabian\" and the music scenes were real, not Hollywood musical crap. This is a very moving film about a man who spends his life making the careers of others only to get left behind as they move up the food chain. Talented himself but didn't have \"the look\" that sold records. Ray Sharky died of aids yrs later, actually did some work while he had hiv and looked it. This is probably his best work. I have always been a movie buff (still dream of directing) and I can remember the Ebert and Roeper review of this film. It was their sleeper hit of the week. I remember if vividly because that's when I learned about the term \"sleeper\" referencing films. It was a 2 thumbs up and HBO played it constantly. HBO was limited back then and this was always on and we watched it every chance we could!",
         "This one's a movie I never was able to get tired of, so I finally purchased it online. The music is catchy and irresistible, the electrifying Ray Sharkey was at his usual best and, according to IMDb, this was Peter Gallagher's first movie. As Gallagher's various profiles indicate, he performed in a band early on, and whatever he drew from that makes him shine on stage in Idolmaker. Now he's releasing CD's of his singing and original songs - go figure. Obviously the late great Sharkey didn't invest that theatrical gene in Gallagher, but he and this movie can only have nourished and enhanced it. Sharkey truly was a tiger tiger burning bright and he never shone brighter than as the Idolmaker. Olympia Dukakis was perfect as the Idolmaker's mother. Color me surprised; that actress can do no wrong, in my opinion. The music in this film is a huge part of its charm, as has been said before. And it looks like more of the movie was choreographed than just the stage scenes and Vinnie's training of his would-be stars; the whole thing just ends up being served up as perfectly as a 5-star gourmet dinner."
      ],
      "genres": [
         "Biography",
         "Drama",
         "Music",
         "Romance"
      ],
      "productionCompanies": [
         "Kirkwood",
         "Koch Company"
      ],
      "summaries": ["Based on the life of rock promoter/producer Bob Marcucci, who discovered, among others, Frankie Avalon and Fabian."],
      "budget": 0
   },
   "movielensId": 3586,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1980-11-14",
      "dvdReleaseDate": "2000-04-25",
      "directors": ["Taylor Hackford"],
      "runtime": 117,
      "movieId": 3586,
      "title": "The Idolmaker",
      "mpaa": "PG",
      "actors": [
         "Ray Sharkey",
         "Peter Gallagher",
         "Joe Pantoliano",
         "Paul Land",
         "JoJo D'Amore",
         "Maureen McCormick",
         "Olympia Dukakis"
      ],
      "imdbMovieId": "0080913",
      "originalTitle": "The Idolmaker",
      "genres": [
         "Drama",
         "Romance",
         "Music"
      ],
      "youtubeTrailerIds": [
         "3x4D5-xM7hA",
         "740GktBOyFY"
      ],
      "plotSummary": "Based on the life of rock promoter/producer Bob Marucci, who discovered, among others, Frankie Avalon and Fabian.",
      "tmdbMovieId": 42159,
      "avgRating": 3.42544,
      "releaseYear": "1980",
      "numRatings": 114,
      "posterPath": "/eF14dhUt06TNJkkA1xtOSjMV7a4.jpg"
   }
}