{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "puerto rican",
            "id": 2124
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "jail",
            "id": 9890
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "theft",
            "id": 14604
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0110091",
      "video": false,
      "title": "I Like It Like That",
      "recommendations": [],
      "backdrop_path": "/gykaxZJdGAsyKkAzLZzxDFc1inp.jpg",
      "revenue": 1777020,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Lisette Linares",
               "gender": 1,
               "credit_id": "52fe477ec3a36847f8138c59",
               "name": "Lauren Vélez",
               "profile_path": "/xZiNlLg9E2zgRSewE1BeWUlaqYO.jpg",
               "id": 141610,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Chino Linares",
               "gender": 2,
               "credit_id": "52fe477ec3a36847f8138c5d",
               "name": "Jon Seda",
               "profile_path": "/zYDXb5F4IyzuODWSuGa2mLU8HMz.jpg",
               "id": 288,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Li'l Chino Linares",
               "gender": 0,
               "credit_id": "545822cf0e0a261162000717",
               "name": "Tomas Melly",
               "profile_path": null,
               "id": 1381482,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Minnie Linares",
               "gender": 1,
               "credit_id": "545822dd0e0a261165000745",
               "name": "Desiree Casado",
               "profile_path": "/5CthHo7asJPuBUTqAwfGmuIMqCN.jpg",
               "id": 91034,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Pee Wee Linares",
               "gender": 0,
               "credit_id": "545822ebc3a368398f000753",
               "name": "Isaiah Garcia",
               "profile_path": null,
               "id": 1381484,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Alexis",
               "gender": 2,
               "credit_id": "545822f90e0a261158000749",
               "name": "Jesse Borrego",
               "profile_path": "/cJkz421gRMJPWWMd7nLxgSuUZfY.jpg",
               "id": 58647,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Magdalena Soto",
               "gender": 1,
               "credit_id": "545823070e0a26116500074a",
               "name": "Lisa Vidal",
               "profile_path": "/8053bjXwp0JNbODdnqKfhW0Euvu.jpg",
               "id": 92774,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Stephen Price",
               "gender": 0,
               "credit_id": "54582316c3a3683997000759",
               "name": "Griffin Dunne",
               "profile_path": "/4oCLupH3Uo2otzF77LrYE4s1iqw.jpg",
               "id": 2171,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Rosaria Linares",
               "gender": 1,
               "credit_id": "545823240e0a261165000752",
               "name": "Rita Moreno",
               "profile_path": "/cpu3QeMGvbkBLmrFy8dUxEP7zdd.jpg",
               "id": 13299,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe477ec3a36847f8138c63",
               "name": "Darnell Martin",
               "profile_path": "/ugRwckDCMqD9TKUuOhiciiyJwKY.jpg",
               "id": 81727,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "545822bfc3a36839ac00066c",
               "name": "Darnell Martin",
               "profile_path": "/ugRwckDCMqD9TKUuOhiciiyJwKY.jpg",
               "id": 81727,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.227779,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 48992,
      "vote_count": 5,
      "budget": 0,
      "overview": "Lisette and husband Chino face marital difficulties. She is fed up with the kids, while he has job troubles. His mother Rosaria hates Lisette and the neighborhood tramp has designs on Chino. Things get even worse when Chino goes to jail and Lisette gets a good job uptown. Can this marriage be saved?",
      "similar": [
         290762,
         858,
         13,
         226,
         400,
         8272,
         3134,
         1024,
         5781,
         1903,
         40807,
         51828,
         112160,
         180863,
         35,
         38,
         141,
         72105,
         137106,
         272693
      ],
      "original_title": "I Like It Like That",
      "runtime": 104,
      "poster_path": "/5KYvQJGgrvceGhsRe8ydSpU7A8a.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Think Again Productions",
            "id": 37294,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Riot of Color",
            "id": 37295,
            "origin_country": ""
         },
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         }
      ],
      "release_date": "1994-10-14",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "For Lisette, everyday has become independence day.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Darnell Martin"],
      "runtime": 104,
      "synopsis": null,
      "writers": ["Darnell Martin"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0110091/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIyODAzNjAyNF5BMl5BanBnXkFtZTcwNjc3ODUyMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Lauren Vélez, Jon Seda, Tomas Melly | See full cast and crew »"],
      "reviews": [
         "\"I Like it Like That\" is one of those rare gems of cinema that portrays life for peoples of color with all of the absolute humanness so often lacking from more mainstream films. While I thoroughly enjoyed every actor's performance in this film, no one's performance was as effective and affecting as Jesse Borrego's portrayal of \"Alexis\", Lisette's (Lauren Velez) transvestite brother. This character offered a rare and realistic portrayal of an individual that is typically viewed only from a safe distance. While I definitely prefer Jesse Borrego as a man, his performance as \"Alexis\" showed a depth that few actors ever accomplish. In addition to his sterling performance as \"Tudee\" in \"Follow Me Home\", his portrayal in this film convinced me of his tremendous range. He is, without question, one of the most underrated actors of our time. I enthusiastically recommend this film to any and everyone.",
         "I really enjoyed this movie when I saw it in the theatre 10 years ago. It had a real fresh quality to it, and you really rooted for the main characters. I was searching for this on imdb, and then looked at its low rating, which is inexplicable to me. And then, I saw that a large group -- perhaps the largest single plurality - voted this a 1 out of 10. That's just a crime to rate is that low. This film has terrific acting, great characters and a couple - and their young son - who you just root for. Add to that a strong supporting ensemble, and I would unashamedly rate it a 9 out of 10. i do have to see it again, but I remember just really 'digging' this film!",
         "I'm frankly surprised at the generally low opinion of this film. I saw it and liked it a lot. I thought it did an excellent job of hitting a very realistic tone--no Hollywood glitz or schmaltz here. Instead, we have well-scripted characters with real-life problems, and all of the pathos and humour that comes with them. This movie is alternately touching and hilarious in very effective and \"true\" ways, and I admire the guts it took to not give this movie a fairy-tale ending. We have no miraculous resolution, but instead a hard-fought and bittersweet partial reconciliation. The acting and writing here carry a good film to a satisfying conclusion. I'm tempted to vote higher than I really feel to boost this movie's overall rating, which I feel is undeserved.",
         "A very true-to-life look at the urban Latino life in the North East. Anyone raised in those areas of NYC, NJ, MA, or CT, will tell you so. It's so rich in story & the characters are so easy to relate to, I just wish it was longer. Everyone's performance was great, & very realistic. Lauren Velez, Jon Seda, Jesse Borrego, Lisa Vidal, Vincent Laresca, & legendary diva Rita Moreno, brought this lil' number to life. Griffn Dune was great as well. Along with cameos of music artists Barrio Boyzz, Jerry Rivera, Fat Joe, & Broadway \"Rent\" star Daphne Rubin-Vega (formerly of late 80's Freestyle Dance/Pop girl-trio, Pajama Party). This film is one of my fav's & I have seen & experienced very similar situations growing up in those areas, so it was kool, & can relate. I definitely recommend this film to everyone, especially the urban Latino audience. If you haven't seen it yet, what are you waiting for!",
         "A very hip urban flick. It has a great storyline and brings up many important issues such as love, marriage, parenting, employment, and even stardom. Also dealing with friends, neighbors, and family that mean you no good. This movie made me laugh and cry. Overall an excellent movie.",
         "This movie made me feel good. It gave me faith that good can come out of almost any situation. And that it is possible to survive in a seemingly hopeless situation. I have seen this show three or four times on cable. The characters in this movie are some of the most memorable ever. And I mean all of them. I like the remake of the song \"Try a little tenderness\".",
         "The acting, writing, editing, directing, cinematography, music and art direction are infused with Chekhovian tragi-comic magic from the yearning of intersected details and human idiosyncracies. A jewel of a film, stolen by it's charismatic leads Lauren Velez and Jon Seda.",
         "Lauren Velez is great in a well-rounded role. Fresh and funny story of latino Bronx. Basic story of woman taking charge and getting ahead, but truly enjoyable and different from most of the \"Lifetime stories for women\" genre. Check out Rita Moreno as the mother-in-law!",
         "This film, written and Directed by black, female, Bronx native Darnell Martin captures a turbulent time in the life of a Puerto Rican couple in the Bronx, NY. What could best be described as a Latino version of 'Do The Right Thing,' the film tackles many issues such as masculinity, homosexuality, religion, race and capitalism. All wrapped up in the single half Puerto-Rican half Jamaican Lizette, issues of race abound at every corner with a mother-in-law who insists on her family coming from a pure Castillian lineage. The most thoroughly addressed topic is that of masculinity and what decrees a true man. Whether it be the misogynist and somewhat abusive father figure of Chino, or the homosexual 'Alexis,' who essentially rejects his masculinity in order to escape the trappings that Chino represents. This is a film that requires some thought and definitely some effort to go beyond the superficialities of Bronx vernacular and gay humor. This film addresses major issues found in the Latino community, from the perspective of a non-Latino. This is a very good film and if race movies interest you -such as Spike Lee Joints- this should not be missed.",
         "I love watching this movie! It portrays Latino life & culture to the tee, also showing relationships regardless of race, everyone can relate ( if you've been in a bad one), just saw it on cine max last night, 1st time in 10 years & it hasn't lost it's spunk. Chino & Lissette play extraordinary parts & not too mention Jesse Borrega's performance as a transvestite ! WHOA!!!!!! Also liked the fact that it portrays Latino's as everyday people, although they're are the typical stereotypes associated with it like, drug dealing,stealing,gambling,& having extramarital affairs,aside from that ,good portrayal. I definitely recommend this film for any body that has been in love or just wanna laugh your butt off"
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Columbia Pictures Corporation",
         "Riot of Color",
         "Think Again Productions"
      ],
      "summaries": [
         "Lisette and husband Chino face marital difficulties. She is fed up with the kids, while he has job troubles. His mother Rosaria hates Lisette and the neighborhood tramp has designs on Chino. Things get even worse when Chino goes to jail and Lisette gets a good job uptown. Can this marriage be saved?",
         "Chino Linares and his wife Lisette are a struggling young Puerto Rican couple. When a petty theft lands him in jail, she gets attached to the relative independence that a job as an executive assistant brings. By the time Chino is released, they bicker about upbringing their rebellious son, who needs more love and discipline, and soon discover they've been unfaithful. When their son gets involved in drug dealing, they must come together to bring their family back together"
      ],
      "budget": 0
   },
   "movielensId": 359,
   "movielens": {
      "languages": [
         "English",
         "Español"
      ],
      "releaseDate": "1994-10-14",
      "dvdReleaseDate": "2004-07-13",
      "directors": ["Darnell Martin"],
      "runtime": 104,
      "movieId": 359,
      "title": "I Like It Like That",
      "mpaa": "R",
      "actors": [
         "Lauren Vélez",
         "Jon Seda",
         "Tomas Melly",
         "Desiree Casado",
         "Isaiah Garcia",
         "Jesse Borrego",
         "Lisa Vidal",
         "Griffin Dunne",
         "Rita Moreno"
      ],
      "imdbMovieId": "0110091",
      "originalTitle": "I Like It Like That",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["mVzmH9toJp0"],
      "plotSummary": "Lisette and husband Chino face marital difficulties. She is fed up with the kids, while he has job troubles. His mother Rosaria hates Lisette and the neighborhood tramp has designs on Chino. Things get even worse when Chino goes to jail and Lisette gets a good job uptown. Can this marriage be saved?",
      "tmdbMovieId": 48992,
      "avgRating": 3.29298,
      "releaseYear": "1994",
      "numRatings": 285,
      "posterPath": "/5KYvQJGgrvceGhsRe8ydSpU7A8a.jpg"
   }
}