{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0071772",
      "video": false,
      "title": "The Lords of Flatbush",
      "recommendations": [
         99008,
         83172,
         141127,
         122027,
         139324,
         30230,
         157036,
         31361,
         30833,
         52228,
         27464,
         79780,
         18693,
         38132,
         31812,
         67772,
         22994,
         25113,
         31804,
         29741
      ],
      "backdrop_path": "/i2nig0RQnkM9lYGaHwEowZAGhbW.jpg",
      "revenue": 4000000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Chico Tyrell",
               "gender": 0,
               "credit_id": "52fe46eb9251416c91064173",
               "name": "Perry King",
               "profile_path": "/l1ZcEfNaHqbNTT8EEM4RqCtHGjN.jpg",
               "id": 64457,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Stanley Rosiello",
               "gender": 2,
               "credit_id": "52fe46eb9251416c91064177",
               "name": "Sylvester Stallone",
               "profile_path": "/gnmwOa46C2TP35N7ARSzboTdx2u.jpg",
               "id": 16483,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Butchey Weinstein",
               "gender": 2,
               "credit_id": "52fe46eb9251416c9106417b",
               "name": "Henry Winkler",
               "profile_path": "/bwRNFbcotcEeZcKzlbUia4juF6N.jpg",
               "id": 31903,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Wimpy Murgalo",
               "gender": 2,
               "credit_id": "52fe46eb9251416c9106417f",
               "name": "Paul Mace",
               "profile_path": null,
               "id": 121646,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Jane Bradshaw",
               "gender": 1,
               "credit_id": "52fe46eb9251416c91064183",
               "name": "Susan Blakely",
               "profile_path": "/gmRSGrasJcbhLBE8uBD0Udt5RWQ.jpg",
               "id": 22553,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Frannie Malincanico",
               "gender": 0,
               "credit_id": "52fe46eb9251416c91064187",
               "name": "Maria Smith",
               "profile_path": null,
               "id": 121647,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46eb9251416c9106415d",
               "name": "Martin Davidson",
               "profile_path": "/ktW24P562eETSImtgeabVBVHG0m.jpg",
               "id": 89373,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46eb9251416c91064163",
               "name": "Stephen Verona",
               "profile_path": null,
               "id": 121643,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46eb9251416c91064169",
               "name": "Gayle Gleckler",
               "profile_path": null,
               "id": 121645,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46eb9251416c9106416f",
               "name": "Martin Davidson",
               "profile_path": "/ktW24P562eETSImtgeabVBVHG0m.jpg",
               "id": 89373,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46eb9251416c9106418d",
               "name": "Stephen Verona",
               "profile_path": null,
               "id": 121643,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.517731,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 38925,
      "vote_count": 23,
      "budget": 160000,
      "overview": "Directed by Martin Davidson and Stephen Verona, The Lords of Flatbush is a low budget film starring Perry King, Henry Winkler and Sylvester Stallone (who also wrote additional dialog). Set in the late 1950s, the coming-of-age story follows four Brooklyn teenagers known as The Lords of Flatbush. The Lords chase girls, steal cars, play pool and hang out at a local malt shop. The film focuses on Chico (King) attempting to win over Jane (Susan Blakely), a girl who wants little to do with him, and Stanley (Stallone), who impregnates his girlfriend Frannie, who wants him to marry her.",
      "similar": [],
      "original_title": "The Lords of Flatbush",
      "runtime": 86,
      "poster_path": "/nW7lC5IrrylvU8inAz8aodnkYxQ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
         "name": "Columbia Pictures",
         "id": 5,
         "origin_country": "US"
      }],
      "release_date": "1974-05-01",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "When was the last time someone gave you a hickey?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": [
         "Martin Davidson",
         "Stephen Verona"
      ],
      "runtime": 86,
      "synopsis": null,
      "writers": [
         "Stephen Verona",
         "Gayle Gleckler"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0071772/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg4NjAxOTczOF5BMl5BanBnXkFtZTcwMDY2MjIyMQ@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Sylvester Stallone, Henry Winkler, Perry King | See full cast and crew »"],
      "reviews": [
         "A good, decent film about leaving adolescence behind, and the threshold to adulthood. Sylvester Stallone is very good as Stanley, the pug of the gang, who is facing fatherhood and marriage, and tries to amiably go along. He's not too bright, but he understands there is much more out there. His scene on the roof with Perry King is his way of trying to communicate that the world they have been living in is coming to an end, but, through their dreams and imagination, they can go places and experience other things. Things are changing for him, and he instinctively realizes there is much more to the world than their little corner of Brooklyn. Perry King's Chico, on the other hand, is brighter than he lets on, and he understands all too well what is out there and is waiting for them. The trouble is, in the adult world, he will never again have the freedom and power that he has running the streets with the Lords. Growing up is not something he looks forward to. He resents what he sees as the end of the road. He wouldn't mind living out the rest of his life with the Lords, prowling the streets, knocking up girls, fighting with the clean cut kids. In this world, he is powerful and respected, but he senses it coming to an end. His argument on the roof with Stanley is his rejection of dreaming or imagining something, or somewhere, else. His unfortunate episode with Susan Blakely is his inability to relate to her as another human being. To him, she is still just a chick to be laid, not someone he may have to relate to. Everyone around him is growing up and passing him by, and Chico resents it. He basically wants things to stay just as they are. The final rumble at the football field is an example of the Lords in their element, when they are at their happiest. The aftermath of the fight (the accident) is a further reminder that this life is at an end, and adulthood awaits, whether they are ready for it or not. A decent, entertaining movie. Quite an interesting character study, well-acted, especially by King and Stallone.",
         "Here we have early film appearances from a number of guys who went on to varying degrees of stardom. I think this is mostly what this movie's good reputation is based on. But I didn't find it quite so compelling as a film. This flick is about four high school boys in 1950's Brooklyn who belong to a \"social-athletic club\" (others would say gang) called the Lords. As is often the case in movies, they all look like they saw the end of high school some years before. The four (Perry King, Sylvester Stallone, Henry Winkler, Paul Mace) are poised on the brink of adulthood and the responsibility that it will bring. The film is shot in a manner that is almost cinema verite, with lots of hand-held cameras getting grainy-looking closeups. The dialog also is obviously meant to be realistic, but I found it often less than scintillating. I waited around for the bigger issues to be tackled and the larger truths to be revealed, but they are not exactly enlightening, either. A faux-'50's music soundtrack doesn't help much. Despite these negative comments, I would give 'The Lords of Flatbush' a marginal \"thumbs up,\" mostly for effort. It does do a good job of depicting the culture and local color of the place and time it represents. But this is no definitive film about either coming of age or life in Brooklyn in the 1950's.",
         "I always had a soft spot for \"The Lords of Flatbush\" ever since I watched it countless times on cable in the late 70's. It's not really a \"good\" film in the true sense of the word, but it works well because of the charm of the actors and the \"fly on the wall\" style where there are many scenes where nothing much really happens or progressed, but you watch the characters just be themselves. Sylvester Stallone (Stanley), Paul Mace (Wimpy), Perry King (Chico) and Henry Winkler (Butchy) all play their roles with honesty and heart. It's interesting to see how the film pretty much centers around King's Chico first and foremost, with Stallone's Stanley a close second. Mace's Wimpy is there in a supporting role, and Winkler's \"Butchy\" disappears for a lot of the time. Mace and Winkler do have one good scene each without any of the other Lords around, when Mace talks with Moose Mombo in the poolhall (alone until the other Lords show up), and Winkler's talk with Eddie the egg cream guy, although this scene is pretty short. Stanley is the tough guy of the group, while Chico is the studly one, the best looking of the four (although Stanley's girlfriend is much hotter than Chico's, and they are both best girlfriends). It becomes apparent at one point that Chico is pretty much a jerk, and has a constant tension with Stanley. Chico is a jerk to Stanley before they \"trade hits\" and especially on top of the roof, where Stanley tries to communicate seriously with Chico about imagination. Actually, the last bunch of scenes of the film all revolve around Chico's inability to get along with almost anyone, from the guy dating the girl he likes, the girl herself telling him to grow up, and then with Stanley on the roof. It is a little odd seeing Chico and Stanley have all these tense moments, than seeing Chico at Stanley's wedding with his arm around him like they are the greatest of friends. Stanley is actually much more than a muscle-bound oaf, he's actually very sensitive and has a heart as well underneath the wisecracks. He doesn't have to marry his beautiful girlfriend when he finds out she's not pregnant but does anyway, and he tries to relate his ideas on traveling within your mind to Chico, who shoots him down. Stanley seems to always be the one trying to make their friendship work, even coming up with the idea of stealing a car \"for Chico\" so he'd have a better chance with Susan Blakely, the gorgeous new girl in class. None of he music is original 50's music, it's all new music made to sound like it came from that era but some of it is pretty good, especially the songs sung by the gravelly-voiced singer of the opening song. The film is gritty and more realistic because of the low production values. Especially giving the film a realistic feel is a lot of the background lines and things the actors come up with, much sounding very improvised. It was great to have this on a widescreen DVD. The short production notes inside the DVD are pretty interesting, saying that there were scenes reshot and even a whole new ending shot, because they wanted a more \"upbeat\" ending. If the original \"downbeat\" ending is still around somewhere, as well as the original scenes, they'd be great to put on a Special Edition DVD, which would make sense considering the star power of the actors. The picture on the rear of the DVD is of a scene not in the film, so that's a nice small bonus. There's also at least one thing not in the film that's on the trailer. I bought this on sale for 7 bucks, definitely a great deal. Many DVDs go way down in price because of a looming Special Edition so who knows?",
         "If you grew up in this time and place, or a reasonable facsimile, you will understand and appreciate this little gem of a movie. If you didn't, you won't. Those of us that did will instantly recognize the time, place and character types portrayed here. Its strong points are its accurate capture of the milieu and the characters. In that case, the lack of character development is a positive part of the characters themselves, not a shortcoming. We know at the outset that most of them are not going to be able to break out from who or what they are, and the ones that survive Viet Nam will end up back in the neighborhood or a transplanted version of it. Even when one character recognizes his limited prospects, we're not really sure that he is going to be able to do anything about it. That's what gives the story line, such as it is, its bite. On the other hand, the meandering plot and the technical shortcomings keep this film from achieving all that it could have. If the plot had come up to the standards of the characters and the period accuracy, and if just a little more attention had been paid to technique, this would have been a classic. As it is, it's not quite there. But despite its shortcomings, it deserves a place among others of its type.",
         "This is Grease without the pop music, the glitz of commercialism or the poor costumes. One thing that makes any stage or movie production is the ability of the watcher to believe that the characters are actually not acting, but living the part they portray. Lords of the Flatbush fulfils this criteria as the audience is taken back to the 1950's. Strangely enough, the 1950's wasn't all about driving around in pink Cadillacs and wall to wall Elvis Presley. Lives had to be led life had to be faced, complete with it's problems and struggles. This wonderfully understated film shows all that and more. If you liked the idea of Grease, but found that it's presentation was about as believable as rocking horse droppings, then this film will satisfy your need much more than it's more celebrated counterpart can ever do.",
         "The Fifties nostalgia craze started about 1971, and lasted all through the 70s, right into the early eighties, a whole decade of nostalgia devoted to half of a decade one decade previous! I thought it was insane at the time and still do, even though the nostalgic image reduced one of the most interesting decades in American history to irritating clichéd images of leather jackets. It hasn't really ended either, which is just as well, because no sane person could stand nostalgia for the 70s. \"Lords of Flatbush\" might seem like just a cheap cash in on a fad, but it's actually very well written. It features minimalist dialogue and slice of life vignettes with very honest performances by King and Stallone. It looks cheaply produced but to me that added to the attraction, it seems to be done in an almost documentary style. AS such, its not really a film about the \"Fifties\"---besides the leather jackets and hairstyles, it has little to say about a specific era, but a lot to say about the human condition. This tale of four friends could have been set at any period in history, and the dialogue for once is a true indicator of the mental states of 17 and 18 year olds, there's no breathless philosophizing here. The characters seem to struggle with what they want to say, unable to express their feelings with limited vocabulary and intellect. Watching it is sometimes painful. The best scenes involve Chico's relationship with Jane Bradshaw. (This guy deserves a medal for his taste in females) Chico tries to express his emotions, but hes too young and impatient. He thinks he knows what to say and do, but his words and actions just don't match up.In the end, his efforts at a relationship are too clumsy. I still feel bad for him. I was never a fan of Stallone, but I like his performance here. The main problem with this film is that it's too short. The honest performances make me want to know more about these guys, and it ends abruptly while everything is still going on. Still, taking a look at this movie is worth the time, especially nowadays when finding an honest film made with integrity is very rare. Its kind of---nostalgia for nostalgia! Besides, even if you hate it, you still get to look at Susan Blakely.",
         "This film really isn't a movie in the conventional sense of the word, in that it doesn't really have a plot, character development, or even real dialogue. This film is as if a little hole was torn in time and the viewer is allowed to peek through. The film feels like a documentary and the dialogue is largely ad-libbed and not always well, which gives it a realistic feel. One feels like these characters could actually be real and that they don't exist merely for the sake of the story. Some may criticize this film for its lack of character development, but these guys aren't the type to open up and pour out their feelings, and if they try, it usually doesn't come out right. The realism and authenticity of this film make up for its lack of character development and swiss cheesy plot. Definitely worth seeing.",
         "I had seen this movie on TV shortly after \"Rocky\" appeared in theaters, which is ironic considering \"Lords\" was made two years earlier. However I had never seen Stallone in another role so this was kind of fun to see him in another role. I can't really remember if I thought the movie was good or bad, but it was definitely involving for a 9 year old kid. In hindsight I remember Winkler getting hit by a car when he runs across the street. That was rather sad. And in the end when there was Stanley's (Stallone) wedding with all his family and pals. Winkler was on crutches and drunk. That was funny. And I thought the ending with the collage of memories passing by was moving and effective. It made me want to relive my youth in a way. If you see Stallone's \"Paradise Alley\" which came out in 1978, you will see a similar and moving ending that usually only men could appreciate. I am not going to call this is a great movie, because it is not, but \"The Lord's of Flatbush\" has a place in my heart.",
         "The movie overall is pretty boring. There are long pauses accented by giggling and nothing of interest said. It could have been a better film if the script had went through a couple more rewrites. The fake 50s music is awful too, which doesn't help. But with that said, Stallone is really good in this film. There's no ego in the way. In fact, watch Driven, then watch this film and see the difference. You can see in Lords that Stallone was a hungry actor. When you watch him now, you just get a smirking ego who recites lines like cardboard. It's hard to believe this Stallone is the same guy.",
         "The 1970's saw a re-emergence of the 1950's and it started with \"American Graffiti\" and that spawned more films that I can remember but this effort is both a hit and miss but it is interesting considering the cast. Story is set in Brooklyn in the 1950's and we see four members of a local gang named the Lords but one of them gets his girlfriend pregnant and is pressured into marrying her. Stanley Rosiello (Sylvester Stallone) is the so-called leader of the Lords and his girlfriend Frannie (Maria Smith) tells him that she is late and the rubber band thing didn't work. Meanwhile, Chico Tyrell (Perry King) falls for Jane Bradshaw (Susan Blakely) who is the new girl in the neighborhood but he puts a lot of pressure on her to go all the way. The other two members are Butchey Weinstein (Henry Winkler) who may or may not be thinking about going to college and Wimpy Murgalo (Paul Mace) who is the shortest but doesn't lack in being feisty. *****SPOILER ALERT***** Chico goes out with Jane but she finally has had enough of his pressure and starts going out with another boy. Stanley manages to get Frannie a nice ring but later learns that she is not pregnant but he decides to go through with the wedding anyway. This doesn't stop the four of them from getting involved in a rumble with the football team but it ends with Butchey getting hit by a car. This film is directed by Martin Davidson and Stephen Verona who spent roughly $100,000 to make this with a 16mm camera and even though it's edited horribly and really has no rhythm in it's storytelling the honesty of the performances shines through enough times to make this a fairly effective film. Of course none of these actors look like they belong in high school and they all look like they are approaching 30 if they haven't hit that mark yet. While the cinematography is bumpy and badly lit it still gives the film some sort of realistic quality as if your peering back into time and I've always liked low budget quality camera work if it's done with the right story and I think a story that takes place in 1950's Brooklyn is perfect. I first viewed this film when it was released in the 1970's and at that time I thought Stallone's character was the rough one but after watching it again it dawns on me that King's Chico is the one that is having the most difficulty maturing. Stallone doesn't have to get married but he decides to do the right thing while Chico blows his opportunity with Jane that ends up with her yelling \"Why don't you grow up\"? That moment kind of sums up the film and what it was trying to accomplish in it's clumsy way. Blakely is pretty good in her role and the look of disappointment in her eyes at King was something I never forgot from this film. Stallone didn't write the script but he did add lines in certain scenes and his character is clearly patterned after Marlon Brando first with his name Stanley and secondly with the pigeons. Winkler comes off as kind of a laid back guy who gets along with everyone but his role is not written well and if it was it could have helped. Film doesn't have any real pace and it does come across as a bunch of scenes badly edited together but the sincerity of the story and the honesty of the performances make this a film that's worth a look."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Ebbets Field"],
      "summaries": [
         "A group of kids in Brooklyn form a gang. From this moment on they do everything together. This makes things easier but at the same time they have to face new problems.",
         "It's 1958 in the Flatbush neighborhood of Brooklyn. High school friends David 'Chico' Tyrell, Stanley Rosiello, Butchey Weinstein and Wimpy Murgalo comprise a gang called the Lords. They are motorcycle driving, smoking, wisecracking, leather jacket and slicked back hair wearing troublemakers who often use their fists to solve the problems in their lives. One problem that Stanley is facing is that he and his girlfriend Frannie Malincanico need to get married. Stanley and Frannie's respective views of marriage are from their immature teen-aged perspectives. Also facing girl problems is Chico, who has a casual relationship with Frannie's best friend, Annie Yuckamanelli. That changes when WASP Jane Bradshaw transfers into their school. Chico, with a little help from his friends, does whatever he can to impress Jane, not always with success."
      ],
      "budget": 160000
   },
   "movielensId": 3590,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1974-05-01",
      "dvdReleaseDate": "2000-04-25",
      "directors": [
         "Martin Davidson",
         "Stephen Verona"
      ],
      "runtime": 86,
      "movieId": 3590,
      "title": "The Lords of Flatbush",
      "mpaa": "PG",
      "actors": [
         "Perry King",
         "Sylvester Stallone",
         "Henry Winkler",
         "Paul Mace",
         "Susan Blakely",
         "Maria Smith"
      ],
      "imdbMovieId": "0071772",
      "originalTitle": "The Lords of Flatbush",
      "genres": ["Drama"],
      "youtubeTrailerIds": [
         "vNE9AZAZQe8",
         "6DkI-WbxbAc",
         "BHRaQgdT9mQ"
      ],
      "plotSummary": "Directed by Martin Davidson and Stephen Verona, The Lords of Flatbush is a low budget film starring Perry King, Henry Winkler and Sylvester Stallone (who also wrote additional dialog). Set in the late 1950s, the coming-of-age story follows four Brooklyn teenagers known as The Lords of Flatbush. The Lords chase girls, steal cars, play pool and hang out at a local malt shop. The film focuses on Chico (King) attempting to win over Jane (Susan Blakely), a girl who wants little to do with him, and Stanley (Stallone), who impregnates his girlfriend Frannie, who wants him to marry her.",
      "tmdbMovieId": 38925,
      "avgRating": 2.87745,
      "releaseYear": "1974",
      "numRatings": 306,
      "posterPath": "/nW7lC5IrrylvU8inAz8aodnkYxQ.jpg"
   }
}