{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "housewife",
            "id": 3451
         },
         {
            "name": "job",
            "id": 8438
         }
      ],
      "imdb_id": "tt0085970",
      "video": false,
      "title": "Mr. Mom",
      "recommendations": [
         13698,
         14742,
         28117,
         14170,
         19494,
         16806,
         12714,
         10631,
         13665,
         9749,
         9080,
         2617,
         287,
         18282,
         14628,
         38222,
         13766,
         14550,
         14671,
         9304
      ],
      "backdrop_path": "/2VnTRnQHc5vhBWg93cmQXjuDWvx.jpg",
      "revenue": 64783827,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jack Butler",
               "gender": 2,
               "credit_id": "52fe453d9251416c750500b3",
               "name": "Michael Keaton",
               "profile_path": "/myVdrYNGTgqunLfUSaM8DuVD7DL.jpg",
               "id": 2232,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Caroline Butler",
               "gender": 1,
               "credit_id": "52fe453d9251416c750500b7",
               "name": "Teri Garr",
               "profile_path": "/dG1PeN7MdRlP6ZeSeRmaGwSeUWd.jpg",
               "id": 8437,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Alex",
               "gender": 2,
               "credit_id": "52fe453d9251416c750500c7",
               "name": "Fred Koehler",
               "profile_path": "/f52RmqmKKbHS9JFb2sJ28dnyaUr.jpg",
               "id": 76513,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Kenny",
               "gender": 2,
               "credit_id": "52fe453d9251416c750500cb",
               "name": "Taliesin Jaffe",
               "profile_path": "/n84w6z553FCdwTkmbaPeOlNMgCu.jpg",
               "id": 37713,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Megan",
               "gender": 0,
               "credit_id": "52fe453d9251416c750500cf",
               "name": "Courtney-Jane White",
               "profile_path": "/Y0jzYyhmmfPQ0MtSDTYCnoajhT.jpg",
               "id": 54219,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Ron",
               "gender": 2,
               "credit_id": "52fe453d9251416c750500d3",
               "name": "Martin Mull",
               "profile_path": "/oMYciNILkZMhVyrMP9FtMepntiS.jpg",
               "id": 80742,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Joan",
               "gender": 1,
               "credit_id": "52fe453d9251416c750500d7",
               "name": "Ann Jillian",
               "profile_path": "/oGo91ckWLHq5jWf3XOf43MpmayZ.jpg",
               "id": 113905,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Jinx",
               "gender": 2,
               "credit_id": "52fe453d9251416c750500db",
               "name": "Jeffrey Tambor",
               "profile_path": "/csB350am07xyRL5Ik1BWuSY12tH.jpg",
               "id": 4175,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Larry",
               "gender": 2,
               "credit_id": "52fe453d9251416c750500df",
               "name": "Christopher Lloyd",
               "profile_path": "/iQzG9apaIsHnn7iGrer3YEDp8Zo.jpg",
               "id": 1062,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Stan",
               "gender": 0,
               "credit_id": "52fe453e9251416c750500e3",
               "name": "Tom Leopold",
               "profile_path": null,
               "id": 95652,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Humphries",
               "gender": 2,
               "credit_id": "52fe453e9251416c750500e7",
               "name": "Graham Jarvis",
               "profile_path": "/fjAY9Z2B9hUuQ8NolfyCHHR0iE9.jpg",
               "id": 36927,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Eve",
               "gender": 1,
               "credit_id": "52fe453e9251416c750500eb",
               "name": "Carolyn Seymour",
               "profile_path": "/3byhqTWVshjTMmK8oywo3S5woqu.jpg",
               "id": 42970,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Bert",
               "gender": 2,
               "credit_id": "52fe453e9251416c750500ef",
               "name": "Michael Alaimo",
               "profile_path": null,
               "id": 14853,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Doris",
               "gender": 1,
               "credit_id": "52fe453e9251416c750500f3",
               "name": "Valri Bromfield",
               "profile_path": "/aZXdGwca8YAbXXZkLVKB74KpiDg.jpg",
               "id": 113906,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Exec. #2",
               "gender": 0,
               "credit_id": "52fe453e9251416c750500f7",
               "name": "Michael Ensign",
               "profile_path": "/nyTn32fU0E1pQpIUeuiTAehaAee.jpg",
               "id": 1080265,
               "order": 14
            },
            {
               "cast_id": 18,
               "character": "Middle Age Woman",
               "gender": 1,
               "credit_id": "533671bbc3a3680e70000a29",
               "name": "Estelle Omens",
               "profile_path": null,
               "id": 14551,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe453d9251416c750500bd",
               "name": "Stan Dragoti",
               "profile_path": null,
               "id": 67411,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe453d9251416c750500c3",
               "name": "John Hughes",
               "profile_path": "/dFVgYYRY1R0aUCYvfEah00Iwzlt.jpg",
               "id": 11505,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "57b9f4f19251413618001384",
               "name": "James Dyer",
               "profile_path": "/nj7U5fz4SVIuibmGkxl97mGZgs3.jpg",
               "id": 58471,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 2,
               "credit_id": "5985e7a392514128dc000609",
               "name": "Lee Holdridge",
               "profile_path": null,
               "id": 47452,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5985e7abc3a36819170005cf",
               "name": "Victor J. Kemper",
               "profile_path": null,
               "id": 14536,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5985e7b89251412904000620",
               "name": "Patrick Kennedy",
               "profile_path": null,
               "id": 1118130,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "5985e7c9c3a36818f2000632",
               "name": "Lisa Freiberger",
               "profile_path": null,
               "id": 1086160,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "5985e7d1c3a36818d900053e",
               "name": "Alfred Sweeney",
               "profile_path": null,
               "id": 936638,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "5985e7d792514128dc000639",
               "name": "George R. Nelson",
               "profile_path": null,
               "id": 8339,
               "department": "Art",
               "job": "Set Decoration"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 7.35648,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 13105,
      "vote_count": 96,
      "budget": 0,
      "overview": "Jack and Caroline are a couple making a decent living When Jack suddenly loses his job. They agree that he should stay at home and look after the house while Caroline works. It's just that he's never done it before, and really doesn't have a clue...",
      "similar": [
         1440,
         8221,
         1622,
         51828,
         7518,
         522,
         240,
         787,
         167073,
         147773,
         246741,
         50725,
         71859,
         9890,
         44945,
         10634,
         8012,
         688,
         396940,
         5156
      ],
      "original_title": "Mr. Mom",
      "runtime": 91,
      "poster_path": "/x5X1X20BsyQgMHymQtLkfCfqMSU.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Aaron Spelling Productions",
            "id": 1812,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Sherwood Productions",
            "id": 8791,
            "origin_country": ""
         },
         {
            "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
            "name": "20th Century Fox",
            "id": 25,
            "origin_country": "US"
         }
      ],
      "release_date": "1983-07-22",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "When mom goes to work, dad goes berserk!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Stan Dragoti"],
      "runtime": 91,
      "synopsis": "Jack Butler is an engineer at an automobile manufacturing plant in Detroit, Michigan. He lives with his wife, Caroline, their two boys, Alex and Kenny, and their infant daughter, Megan. Jack has a decent life and a decent home in the suburbs. However, Jack's job seems to be stressful for him; he and his coworkers, whom he carpools with in the morning, all talk about their lack of sleep from the night before. When they drive in one morning, they talk about rumors of layoffs at their plant. Their supervisor, known only as Jinx, tells them not to worry about losing their jobs. The rumors persist while Jack talks to the assembly line workers. Jack is called into Jinx' office during the day and finds out that he and the two men he and Jinx carpool with are being laid off. Jinx tells them that they'll be asked to come back at an undetermined time in the future. The guys are not convinced. At home, Jack talks with his wife about finding another job and also having some time off to do work on the house he'd been planning. When Caroline, a former advertising expert, tells him she'd put her resume out on the job market as well, Jack suddenly becomes competitive, challenging her to a wager where the first of them to get a job will win $100. Some time later, Caroline wins the bet and goes to work for a prominent advertising firm. Jack becomes a stay-at-home-father and takes care of the kids, the errands, and the house during the day. Jacks first few weeks at home are mostly a disaster: he discovers that the vacuum cleaner has a mind of its own and rampages around the house, he's inept at operating the washer and dryer, three repair-people come in one day and the baby eats chili. Jack also has trouble at the supermarket and he misunderstands the procedure for dropping Alex off for school. He also draws too much attention from one of his wife's more attractive friends, Joan, who is divorced. As Caroline's career takes off she becomes an employee prized by her boss, Ron Richardson. At her first staff meeting, Caroline looks over the firm's ideas for one of their flagship clients, Schooner Tuna and, though she is constructively critical, receives scornful remarks from the rest of the staff. Caroline realizes that they are overworked, stressed out and have little or no experience similar to her's with regard to food prices or shopping. Months later, Jack has not been called back to his work at the auto factory and there are no other jobs available in his line of work or similar fields. Jack becomes increasingly depressed, wearing the same flannel shirt every day (without laundering it), he gains weight, lets his beard grow ungroomed and drinks beer while watching soap operas. His attention to his kids even wanes a bit which makes it more difficult for him to convince his younger son, Kenny, to give up the baby blanket he carries around for security. One day, while watching a soap opera, Jack daydreams that Joan stops by. He begins to talk about his strained relationship with Caroline; Joan takes off her raincoat and is dressed in sexy lingerie. While Jack kisses her, Caroline walks in and finds them. She pulls out a gun, affixes a silencer to it, and threatens Jack. A struggle ensues and Jack is shot. As he dies, Ron Richardson appears and walks off with Caroline and Jinx appears and says that the auto factory was going to call him back to work. Jack wakes up, cancels the weekly poker game with Joan and decides to clean up his act. He gets the kids to follow a morning routine to get them off to school on time; he exercises with Caroline's friends and loses the weight he'd put on, and he fixes up the house. At one point, we see him throwing his flannel shirt into the fireplace, a gesture meant to encourage Kenny to give up his security blanket. Kenny refuses and Jack has a man-to-man talk and convinces his son to give up the blanket. At a party thrown by Richardson at his palatial mansion, Jack is egged on by Richardson himself to compete in a race involving toys and other obstacles meant for children. Before the race, Jack, a fair sportsman himself, is persuaded by Richardson's subordinates to throw the race because his wife works for their host. Not wanting to jeopardize his wife's career, Jack stumbles just short of the finish line, preserving Richardson's dignity. Caroline's schedule keeps her away from home more frequently, which has an effect on Jack and the family. Caroline also develops a new strategy for Schooner Tuna; she meets with the company's CEO and tells him that the only way to sell more of his product is to lower the price in light of tougher economic times. The CEO goes almost immediately for Caroline's ideas, which also include filming a TV ad that will express the company's new policy, with an included appeal to consumers. Caroline is charged with going to Los Angeles to aid in shooting the new ad, which takes her out of town on Halloween. Richardson comes to their house to pick Caroline up in a limousine, but before she leaves, Jack talks to her about all the changes the family has experienced in her absence. Caroline still goes with Richardson. A few nights later, while Caroline is still out of town, some of the girls invite Jack out for the evening, leaving one of them, Annette, behind to sit with the kids. As a prank, the women take Jack to a male stripper bar. When he comes home late, he tries to call Caroline in California. Unknown to him and to Caroline, Richardson has snuck into Caroline's hotel room with dinner and champagne to celebrate their Schooner Tuna success; Richardson answers the phone and Jack recognizes his voice. Richardson abruptly hangs up on him. Caroline confronts Richardson, who suggests she leave Jack. She refuses and orders him to leave, punching him in the face when he won't. At home, Jack becomes furious when the phone rings and throws it across the room. He also kicks the TV, shattering the screen. Annette, witness to Jack's meltdown, leaves and tells Joan the next day. Joan takes it as a signal that Jack and Caroline are through and races to his house to talk to him. She stretches out in the bedroom while Jack cleans up in the bathroom. Caroline, returning early from California after her confrontation with Richardson, finds Joan in her bed. When Jack comes out of the bathroom, after a lengthy contemplation with himself about having an affair with Joan, he finds Caroline, who is angry about finding Joan in her bed. The two argue, Jack telling Caroline that he heard Richardson's voice on the phone when he called. Jack storms out of the room saying he has a house to run. Caroline follows him and the two begin to reconcile when both Jinx and Richardson arrive at the house, both wanting Jack and Caroline to return to their jobs. At one point, Jinx yells at Alex and Jack hits him in the face, knocking him to the floor. Caroline tries to tell Richardson that she's quit and Richardson offers her a better working contract. The couple negotiate new employment deals for themselves and agree to return. The story closes with everyone watching the TV ad Caroline helped create.",
      "writers": ["John Hughes"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0085970/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUyMzg0MTkwNV5BMl5BanBnXkFtZTgwOTA2NzEyMDE@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Michael Keaton, Teri Garr, Fred Koehler | See full cast and crew »"],
      "reviews": [
         "Of all comedies that I have seen in my 23 years, \"Mr. Mom\" has got to be one of the best and funniest of them all. I have been a fan of this movie since I was about 4 years old! To be exact, I think I taped three different copies on cable and network until I bought it on video and finally on DVD! Michael Keaton plays Jack Butler, who, along with several co-workers, loses his job at an auto plant due to layoffs. To make ends meet, wife Caroline (Teri Garr) gets a job at an advertising agency, and he stays home with the kids. Easy, right? Absolutely not! From out of control vacuum cleaners, washing machines and toasters, to the neighborhood ladies, including Joan (Ann Jillian), who has her eye on Jack, running the household is horrendous. On top of this, Caroline is climbing the corporate ladder. But success comes with a price in the form of long hours, travel, and persistence from boss Ron (Martin Mull), who sets his sights on Caroline. Can Jack and Caroline keep the family together despite these woes? It is my belief that \"Mr. Mom\" is one of the best comedies of all time, and features Michael Keaton and Teri Garr at their best. People of all ages should see this movie. It shows how successful familial role revearsals have the power to be, and demonstrates how to challenge previous stereotypes about career and family. A great film not to be missed!",
         "Going into this film, I expected some trite family comedy with a lot of cheap gags involving things like the normal guy trying to change diapers. That's why I was really impressed. I enjoyed it a lot! This movie proves why it's a shame that Michael Keaton has turned to \"Michael Who?\" in the eyes of Hollywood. I hope to God he doesn't start doing direct-to-video crap like some once-popular actors. He is a true talent with impeccable comic timing! The script is well-written. Though you can call it predictable, it deserves to be predictable. Besides, the plot turns make sense in the context of the characters, and don't feel contrived. The film delivers a fine message without suffocating you with corny sentiment. And Keaton's wonderful performance keeps the film airtight. There are many hilarious moments. The gag in which Keaton plays poker with a group of homemakers, using coupons instead of money, is absolutely priceless! Plus, I felt for the characters and when you feel for the characters, the jokes are always funnier. When Keaton gets himself into one dilemma after another, I was laughing because I felt sorry for him, and that's the key to physical comedy. You have to care for the character's intentions. \"Mr. Mom\" is a funny, sweet, kind-hearted family comedy that doesn't cater to any particular age group. At first glance, it looks an anti-parenting film that manipulates us guys into thinking, \"Geez, I'm never gonna have a kid.\" But as Keaton's character goes through his arc, your attitude changes along with his. Go see it! A truly entertaining movie that's likable in all aspects! My score: 8 (out of 10)",
         "Keatons first lead role after his successful \"Night Shift\" debut in 82 was this family comedy about a laid off auto worker who takes over at home as his wife (Garr) goes back to work. It is a bit unbelievable that Keaton, after years of having a family, would not know how to operate the washing machine or vaccuum cleaner. But he was so perfect at being silly I had to let it slide. Its a little like a fish outta water story as he has to go to the unfamiliar market, do numerous chores around the house and learn the right way to drop off the kids at school in the morning (\"South to drop off, moron!\"). Plenty of good moments from a comedic and dramatic standpoint, as Keaton and Garr deal with her being away from home so much. Mull becomes a foil for her as her new boss, having a case of the major league hots for his star employee. Im sure Keaton will always be remembered as Batman, but this will always be my fave of his in one of John Hughes (\"The Breakfast Club,\" \"Ferris Buellers Day Off\") more unknown works. Good, harmless fun.",
         "This is a funny movie. And, not very many comedies can say that - most unfortunately. Michael Keaton was great. I'm not a big Teri Garr fan, but she was more than adequate as a second banana in the film. If you have no children, are a man, and have never had to raise any children even for a weekend, then you will certainly appreciate this movie. Everyone should appreciate it, but those of us who have never had the \"pleasure\" of changing a diaper will probably identify the most. I cannot imagine how this movie only got a 6.1 on IMBD. I have never known anyone who did not enjoy it.",
         "Mr. Mom is, yet again, one of those movies that I have been watching since I was a kid. This is one of Michael Keaton's best movies I think, forget Night Shift and all that. Keaton's greatest strength is comedy. Mr. Mom is well put together, is always funny, and never lags. It does a brillant job of protraying role reversal and the rest of the cast makes this movie a joy to watch. Everyone is good, singling someone out for special praise is unnecessary. I hate kids in movies but I loved the kids in this one. It's because they are not annoyingly cute or naughty or too sweet, they're just normal kids. Bottom Line: This is a great movie and every movie fan and family should have it on the shelf.",
         "Seriously, I mean, who really gets tired of seeing Michael Keaton playing a housewife? There's just no equivalent to this when it comes to great comedy. I've seen it countless times, and can't believe how little recognition this film actually gets. The main plot of the movie is that Keaton gets fired (or laid off, I can't honestly remember, it's been so long since I've seen it...) from his job, and ironically enough his wife wants to go to work for an advertising company. Reluctantly he agrees, and what follows is just pure chaos. He loves his wife, but at times you get the feeling not enough to keep doing the daily, mundane rituals, he feels woman should be stuck with doing. It's a great comedy and an awesome rent for anyone over the age of 10. A film that you could actually watch with your kids, and still not have them get certain underlying jokes. A 9 out of 10 in my estimation. 10 being the highest that is, and the reason I give it a 9 and not quite a 10, well....I guess you'll just have to watch it to make your own decision about that. And that's my review.",
         "Mr. Mom (1984) *** (out of 4) An auto-engineer (Michael Keaton) gets fired from his job so his wife (Teri Garr) must go out and get a job to support the family. This leaves Keaton at home to take care of the kids and house. This is a film I use to watch countless times when I was little because it seemed it was showing up on HBO at least twice a day. I hadn't watched the movie in at least twenty years before this viewing and it held up well for me even though it's clear that it's certainly not a masterpiece or anything too special. The screenplay by John Hughes is pretty light from start to finish but the majority of the humor works thanks to the performance by Keaton. Keaton comes off very likable and he handles to the change from family man to coach potato very well and he manages several laughs. The best moments are when Keaton becomes obsessed with soap operas, which include a very fun dream sequence. Garr is also good in her role as are Jeffrey Tambor and Martin Mull in their supporting roles. I really can't sit here and type why this film works for me outside of its charm. I'm sure many will find the film too silly to enjoy so perhaps it's something nostalgic for me.",
         "I know it seems weird to say this about a John Hughes film, but I honestly think this is one of the great films of all time. There are so few movies that are so.. flawless. The script is hilarious. The editing is seamless. Every line is quote-worthy. The acting is spot-on. Michael Keaton is at the top of his game, Terry Garr is a comic genius, and the casting is perfect. The story is both goofy, and rather deep. It conatins at least a dozen of my top 100 all-time favorite movie 'moments'. Its the kind of film you see late at night on TV, and you start watching a few minutes, then suddenly before you know it, you've watched the whole thing AGAIN. Obviously, I highly recommend this film, and encourage more filmmakers to study it, because they just don't make 'em like this anymore.",
         "Michael Keaton gets laid off from his cushy job and figures he will be called back very soon, but that does not happen. Thus wife Teri Garr finds an advertising job really fast and it is up to Keaton to care for their three young children in this admittedly funny, but somewhat under-achieving comedic venture. Martin Mull steals every scene as Garr's new boss and Ann Jillian sizzles as the couple's next door neighbor who has her eye on Keaton. Not bad, but not real good either. Middle-of-the-line entertainment. 2.5 out of 5 stars.",
         "Mr. Mom launches two careers, Michael Keaton's as well as John Hughes'. Mr. Mom was Hughes' first major script and it was Michael Keaton's first major role. Michael's super as Mr. Mom. Michael Keaton starts as Mr. Mom and he goes on to be Johnny Dangerously, Beetlejuice, Batman, Doug, Jack Frost and among many other good parts. John Hughes starts with Mr. Mom and he moves on to write Summer Vacation, The Breakfast Club, Ferris Bueller's Day Off, Planes, Trains & Automobiles, Home Alone are just a few of his numerous good films. Michael Keaton is one of my very most favorite actors. He's so funny, and good. I love Michael Keaton! He really does make Mr. Mom a hit. Teri Garr's so good too, and the kids are great. Mr. Mom is a likable comedy adventure and very approving. Mr. Mom makes light at suburbia family home life in a lackadaisical manner. It's lighthearted fun. Mr. Mom is unbound by categorical type restrictions of classification. It's widely amusing. Mr. Mom has a cultured and impetuous personality that's adequate for the viewing. It's kind family fun. Mr. Mom has firm and flexible humor, able to transfer into alternating comedic forms with certainty. It's lovably funny. Mr. Mom invites a relating relationship with the viewer displaying familiarized family issues. It really touches home. There's nothing heavy about Mr. Mom, just a friendly flowing showing."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Aaron Spelling Productions",
         "Sherwood Productions"
      ],
      "summaries": [
         "Jack and Caroline are a couple making a decent living when Jack suddenly loses his job. They agree that he should stay at home and look after the house while Caroline works. It's just that he's never done it before, and really doesn't have a clue.",
         "After he's laid off, a husband switches roles with his wife. She returns to the workforce and he becomes a stay-at-home dad - a job he has no clue how to do."
      ],
      "budget": 0
   },
   "movielensId": 3591,
   "movielens": {
      "languages": [
         "English",
         "Deutsch",
         "Español"
      ],
      "releaseDate": "1983-07-22",
      "dvdReleaseDate": "2000-04-25",
      "directors": ["Stan Dragoti"],
      "runtime": 91,
      "movieId": 3591,
      "title": "Mr. Mom",
      "mpaa": "PG",
      "actors": [
         "Michael Keaton",
         "Teri Garr",
         "Fred Koehler",
         "Taliesin Jaffe",
         "Courtney-Jane White",
         "Martin Mull",
         "Ann Jillian",
         "Jeffrey Tambor",
         "Christopher Lloyd",
         "Tom Leopold",
         "Graham Jarvis",
         "Carolyn Seymour",
         "Michael Alaimo",
         "Valri Bromfield",
         "Michael Ensign",
         "Estelle Omens"
      ],
      "imdbMovieId": "0085970",
      "originalTitle": "Mr. Mom",
      "genres": [
         "Comedy",
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": [
         "epZ2vFsk01Y",
         "solr1W5idNY",
         "Q_PVhhsELvA"
      ],
      "plotSummary": "Jack and Caroline are a couple making a decent living When Jack suddenly loses his job. They agree that he should stay at home and look after the house while Caroline works. It's just that he's never done it before, and really doesn't have a clue...",
      "tmdbMovieId": 13105,
      "avgRating": 3.26324,
      "releaseYear": "1983",
      "numRatings": 3210,
      "posterPath": "/8w2QCXAvz0whhlVFk0lsw01lqFK.jpg"
   }
}