{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "new york",
            "id": 242
         },
         {
            "name": "competition",
            "id": 271
         },
         {
            "name": "dancer",
            "id": 733
         },
         {
            "name": "dance",
            "id": 1691
         },
         {
            "name": "ball",
            "id": 2283
         },
         {
            "name": "career",
            "id": 3658
         },
         {
            "name": "ballet dancer",
            "id": 4118
         },
         {
            "name": "music",
            "id": 6027
         },
         {
            "name": "entrance examination",
            "id": 8081
         },
         {
            "name": "ballet",
            "id": 10551
         },
         {
            "name": "dance teacher",
            "id": 207010
         }
      ],
      "imdb_id": "tt0210616",
      "video": false,
      "title": "Center Stage",
      "recommendations": [
         16346,
         24940,
         16222,
         17403,
         82432,
         10028,
         16723,
         26602,
         402543,
         12763,
         825,
         6020,
         9266,
         37108,
         11211,
         241071,
         70417,
         10677,
         15261,
         13539
      ],
      "backdrop_path": "/4rHlXwRldJZDfdQhaOfNbWwwG11.jpg",
      "revenue": 17200925,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jody Sawyer",
               "gender": 1,
               "credit_id": "52fe43889251416c7501409f",
               "name": "Amanda Schull",
               "profile_path": "/nK1YncFhDkEhebTze2uPMDThVhc.jpg",
               "id": 65871,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Eva Rodríguez",
               "gender": 1,
               "credit_id": "52fe43889251416c750140a3",
               "name": "Zoe Saldana",
               "profile_path": "/ofNrWiA2KDdqiNxFTLp51HcXUlp.jpg",
               "id": 8691,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Maureen Cummings",
               "gender": 1,
               "credit_id": "52fe43889251416c750140a7",
               "name": "Susan May Pratt",
               "profile_path": "/iIHOYjPPhHgqcClshtYrJn93ngb.jpg",
               "id": 40980,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Jonathan Reeves",
               "gender": 2,
               "credit_id": "52fe43889251416c750140ab",
               "name": "Peter Gallagher",
               "profile_path": "/76p7x64BpkgNJCLb5d7xklQ1Fzd.jpg",
               "id": 8212,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Ensemble",
               "gender": 1,
               "credit_id": "52fe43889251416c750140c7",
               "name": "Scottie Thompson",
               "profile_path": "/o7S0MQHMiylNurOcdxAT85NXJP.jpg",
               "id": 128628,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Mrs. Sawyer",
               "gender": 0,
               "credit_id": "59e70978c3a368133e00a558",
               "name": "Maryann Plunkett",
               "profile_path": "/4aTUH3LkiTHKeRUO5efx0hqjS2Q.jpg",
               "id": 171472,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Cooper",
               "gender": 2,
               "credit_id": "59e709f4c3a36851b1007a72",
               "name": "Ethan Stiefel",
               "profile_path": "/t4TptYaxD1Nw1PmtSwlYsc9nvH4.jpg",
               "id": 1460084,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Charlie",
               "gender": 2,
               "credit_id": "59e70a929251416eb90082db",
               "name": "Sascha Radetsky",
               "profile_path": "/y0IAXuw9yuhiVpTLUoOsTXlsGoK.jpg",
               "id": 1642131,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Juliette",
               "gender": 1,
               "credit_id": "59e70acbc3a36851b1007b59",
               "name": "Donna Murphy",
               "profile_path": "/tUQp54rrkCJ9u9Ygy8IYiq9DvMk.jpg",
               "id": 2517,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Anna",
               "gender": 0,
               "credit_id": "59e70b069251416eb9008360",
               "name": "Megan Pepin",
               "profile_path": null,
               "id": 43602,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Nancy",
               "gender": 1,
               "credit_id": "59e70b4cc3a3685157007ee3",
               "name": "Debra Monk",
               "profile_path": "/ufZO6Uo9cy4ayM6jJfHfnqL5Elt.jpg",
               "id": 10386,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Joan Miller",
               "gender": 1,
               "credit_id": "59e70bb19251416e8b008282",
               "name": "Elizabeth Hubbard",
               "profile_path": null,
               "id": 91373,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Jim",
               "gender": 2,
               "credit_id": "59e70bd0c3a36851b1007c79",
               "name": "Eion Bailey",
               "profile_path": "/4MnRgrwuiJvHsfoiJrIUL4TkfoC.jpg",
               "id": 7498,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Emily's Mother",
               "gender": 1,
               "credit_id": "5a02f48a9251411201015f8e",
               "name": "Marcia Jean Kurtz",
               "profile_path": "/lzmW0hnVyyRUkU0tjtFvlfViG9K.jpg",
               "id": 14548,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43889251416c750140b1",
               "name": "Laurence Mark",
               "profile_path": "/fkqSdA5JyxMZwhb2qLzAHI2AUMO.jpg",
               "id": 10685,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43889251416c750140b7",
               "name": "Nicholas Hytner",
               "profile_path": "/f0wcakkpI4KKNvQjVj8rOnwSYT1.jpg",
               "id": 55476,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43889251416c750140bd",
               "name": "Tariq Anwar",
               "profile_path": null,
               "id": 8219,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe43889251416c750140c3",
               "name": "Carol Heikkinen",
               "profile_path": null,
               "id": 65872,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 6.928648,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10560,
      "vote_count": 119,
      "budget": 18000000,
      "overview": "A group of 12 teenagers from various backgrounds enroll at the American Ballet Academy in New York to make it as ballet dancers and each one deals with the problems and stress of training and getting ahead in the world of dance.",
      "similar": [
         44214,
         786,
         68817,
         114150,
         525,
         8328,
         10028,
         6477,
         1788,
         342473,
         3902,
         11899,
         63710,
         407655,
         7944,
         2976,
         382399,
         6575,
         10186,
         15157
      ],
      "original_title": "Center Stage",
      "runtime": 115,
      "poster_path": "/hCR9r2hE0woymx62pymQ0Bs4mk7.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
         "name": "Columbia Pictures",
         "id": 5,
         "origin_country": "US"
      }],
      "release_date": "2000-05-12",
      "vote_average": 6.8,
      "belongs_to_collection": {
         "backdrop_path": "/iNDAKlYSc1TGB0EutAzw7OObGrt.jpg",
         "name": "Center Stage Collection",
         "id": 246839,
         "poster_path": "/uQDnd1Ws2w62WTDsjOxLyOYoWqL.jpg"
      },
      "tagline": "Life doesn't hold tryouts.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Nicholas Hytner"],
      "runtime": 115,
      "synopsis": "The film starts out with the audition of 18-year-old Jody Sawyer (Amanda Schull) for the American Ballet Academy, or ABA. She is cited as having bad feet and turnout, yet she makes it anyway. Upon arriving to the academy in New York City, she meets Cooper Neilson (Ethan Steifel), a famous ballet dancer returning to New York to teach at the academy. Once in her dorm room, Jody meets her two roommates, Eva Rodriguez (Zoë Saldana) and Maureen Cummings (Susan May Pratt). Eva and Jody immediately hit it off but Eva and Maureen have difficulty in getting along mostly because of their different backgrounds. Eva comes from a poor family in the Dominican Republic, while Maureen comes from a wealthy family in upstate New York which they both look down on each other with scorn. Jody and Eva leave to find a place where Eva can smoke and they run into Erik (Shakiem Evans), a gay dancer who introduces them to his friends. In Erik's room, Jody and Eva meet fellow dancers Sergi (IIia Kulik), a Russian ballet dancer who has been at the academy for many years, and Charlie (Sascha Radetsky), a newcomer who has instant chemistry with Jody. After a montage of breaking in pointe shoes, there is an introduction to the classes by the head of the company, Jonathan Reeves (Peter Gallagher) whom was a former ballet dancer himself over 20 years ago. During ballet practice, Jodi's bad turnout is noticed by one of the head teachers, Juliette Simone (Donna Murphy). As the girls pause in a doorway to watch the boys, famous ballet dancer Kathleen Donahue (Julie Kent) passes by and they take notice. After she is gone, Maureen tells them that Kathleen and Cooper broke up not too long ago when she left him to marry Jonathan. Since then Cooper had been in London and \"screwing everything in tights\". Maureen goes to meet her mother (Debra Monk), a former ballerina herself who works at ABA to discuss her possible rivals at getting into the American Ballet Company (ABC). It is clear that Maureen is under intense pressure from her pushy and domineering shrew of a mother to succeed in ballet and encourages her to \"do what it takes\" to succeed... even if the lines of ethics and morals are crossed on more than one occasion. There is a pas de deux class, where Charlie and Jody are partners. That night, the advanced students and teachers of ABA are at the ballet to see a show. First is a segment from Swan Lake, and then Romeo and Juliet danced by Cooper and Kathleen. After the show, the students have baskets of things to sell while a party goes on. People complement both Kathleen and Cooper on their ballet, and Cooper flirts with Jody. Jody and her friends sneak off and find a way on to the Lincoln Center stage. They mess around until Cooper and Kathleen bust into the auditorium. They hide while the adults fight. Cooper thinks they have obvious chemistry while Kathleen says it is just acting and she is happily married and she leaves in a huff. Outside, a young waiter named Jim (Eion Bailey) tries to get Maureen's name and phone number. Smitten and flattered by this nice guy's approach to her, she tells him where she lives at the ABA. A few days later, after another disastrous ballet class, Jody waits in Jonathan's office. He and Juliette tell her that they think ballet isn't the right path for her. Joey is visibly upset. Meanwhile, Jim meets Maureen outside ABA and asks her out on a date. She accepts. Jim introduces himself as a pre-med student at Columbia University and works part-time as a waiter to pay his bills. To ease Jody's stress, Eva decides that she and Charlie, Erik, and Sergi will take her out for a night on the town. They go to a salsa club where Jody and Charlie dance and flirt while Sergi gets hit on by an old barfly after he lies to her by pretending that he works for the Russian Mafia. Elsewhere that same evening, Jim and Maureen go out bowling with Jim's friends. Maureen doesn't know how to bowl (because all she's done is dance her whole life under pressure from her mother). Later, they sit around eating pizza and telling unfunny jokes. Maureen barely eats, but after Jim persuades her to eat something, she does eat a few slices of pizza. Later that night, Jim drops her off at her dorm where she goes inside and throws up in the bathroom. The next day, Jody, Eva, Charlie, Erik, and Sergi are clearly hung over and subsequently get kicked out of ballet class. Their punishment is to clean the mirrors in the studios, and during this they get in to a water fight, while Maureen looks on sadly at being left out of their close-knit group. Jody goes to take a dance class somewhere else in New York, because she is tired of taking criticism for her ballet dancing. During the Broadway dance class, Cooper comes in to assist/dance. After the class, Cooper convinces Jody to come back to his apartment for \"dessert\". They drink wine. They have sex. The next day, Jody thinks she and Cooper are dating after their one night stand and Kathleen makes fun of him. A few days later, Jonathan announces that the casting for the end of the year workshop is up. Charlie, Erik, and Jody are cast in a new ballet choreographed by Cooper. Maureen and Sergi are the leads in Jonathan's ballet, while Eva is in the corps. She is clearly upset at not getting any lead part. While they practice the ballets, we find out that Cooper's ballet is basically the story of him, Kathleen, and Jonathan. (It's REALLY obvious he's not even trying to hide it). A few days later, everyone, plus Jim and Maureen tagging along, go out to celebrate Erik's birthday. They drive around in a rented white-colored limo and go out on a ferry to the Statue of Liberty. Charlie asks Jody out and she says she's already seeing someone. Meanwhile, Jim finds Maureen vomiting in the ferry lavoratory. She tells Jim that her throwing up is the result of sea sickness. The next day during dance rehearsal, Charlie figures out that it is Cooper whom Jody is \"seeing\". They have a ballet showdown of sorts, but Cooper wins. In Jonathan's ballet, Maureen is having trouble being passionate about the dance. Jody goes to the Lincoln Center to see Cooper (and Kathleen) perform George Balanchine's \"Stars and Stripes\". Kathleen knows exactly what's going on between him and Jody, but Cooper denies it. After the ballet, Jody waits for Cooper, but he leaves with another girl. The next day in rehearsal, everyone is sullen and Jody gets mad at Cooper for \"not being able to make up his mind\" in the dance, but she's really talking about their \"relationship\". Cooper tells her that he does not do relationships. Jody angrily storms out and Charlie goes after her. He convinces her to stay in the dance even though she is mad at Cooper. Another dancer, Emily (Victoria Born), having been hinted for being to fat to dance throughout the movie, packs up and leaves the school. That night, Jim and Maureen have a fight about her bulimia. Angry and frustrated about Jim telling her that she should get professional help for that her career in ballet is destroying her physical and menal health, Maureen breaks up with him and storms out of his apartment, telling him: \"I am the best goddamn dancer in the American Ballet Academy. Who the hell are you? Nobody!\" A few days later, during rehearsal on stage, Erik suffers an injury, putting him out of the dance. Cooper thinks the understudy isn't good enough and wants to dance the part himself. Jonathan doesn't want him to, but Cooper threatens to pull the ballet. That evening, Maureen goes back to Jim's apartment and she apologizes for mouthing off to him and also tells him about Erik's injury and wishes that it could have been her. They both reconsile. A little later, after returning to the dorms, Maureen tells Jody and Eva that she's thinking about quitting the school because of her frustration at not doing anything else with her life. Both Jody and Eva tell Maureen how lucky she is for being talented and having a lead part in the upcoming ballet and that she should not give up a good thing going for her. Eva tells Maureen that despite their differences between them, she wishes they could trade places. Just when they are about to go to sleep for the night in their respective beds, Maureen asks Eva if they could talk. Performance Night. The first dance, the Italian Symphony, is lead by Anna (Megan Pepin), a girl who is a main contender for one of the spots in the company. The ballet number is a success. The next dance is Jonathan's. Sergi (as well as the theater audience) is surprised to discover Eva in Maureen's place as the lead. Meanwhile, Maureen and her mother have a confrontation in the lobby about Maureen quitting ballet. Maureen says that she is unhappy with her life and wants to leave the academy, while her mother tells her not to. Maureen walks away while her mother is angry still about her \"giving up her dream\". Maureen yells back at her mother saying that practicing ballet is HER dream, not Maureen's own. The last dance is Cooper's, which is incredibly elaborate and preposterous. It involves motercycles, fake leather pants, ballet sex, two-second scene changes, red pointe shoes, and a lot of Jamiroquai. Jody, Cooper, and Charlie perform their well-choreographed moves which is clearly inspired by the Jody-Charlie-Cooper triangle. At the end, Jonathan announces who will make the American Ballet Company. Eva and Anna both do, as do Erik and Charlie. When Jody is called into Jonathan's office with an offer to join the company, she gives a speech and says she is joining Cooper's new company that he is now starting. Everyone congratulates each other outside in the lobby. Jim shows up to be with Maureen after she had told him earlier about quitting ballet. Jody tells Cooper that she is joining his new dance company, but she tells him: \"Cooper, you're a great choreographer and a talented dancer. But as a boyfriend... you kind of suck.\" Joey then goes over to Charlie who congragulates her. Jody asks Charlie to the party that night and they kiss. During the end credits, there is a montage of the group at their current positions. Eva, the recovered Erik, and Charlie are dancing at ABC and practicing their ballet moves during a class. Sergi is seen dancing for a San Francisco ballet company with his girlfriend. Maureen is at college and talking with a group of new friends between classes, looking happy at leaving behind her dance life for good. Jody is dancing as a principal dancer at Cooper's company.",
      "writers": ["Carol Heikkinen"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0210616/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BODk2MjYwNDQ4MV5BMl5BanBnXkFtZTYwNzc1NDY2._V1_SX214_AL_.jpg",
      "actors": ["Stars: Amanda Schull, Ethan Stiefel, Sascha Radetsky | See full cast and crew »"],
      "reviews": [
         "Come on, I know it's not cool to admit to liking what is essentially a cheesy teen flick. But go ahead, say it aloud - this is a fun movie! Sappy, badly acted, full of exaggerated clichés and one-liner groaners, Center Stage nevertheless has a kind of charm to it. No, it's not an Oscar contender or a change-your-life kind of movie. This is pure escapism, plain and simple. But - say it together with me now - there's nothing wrong with that. Amanda Schull plays Jody, a wannabe ballet dancer who gets accepted to the prestigious American Ballet Academy. The movie follows her life and that of her friends and fellow students, who fall into the predictable stereotypes. There's Eva (Zoe Saldana), the city kid with attitude. There's Maureen (Susan May Pratt), the teacher's pet. There's Erik (Shakiem Evans), the gay guy. There's Cooper (Ethan Stiefel), the bad-boy celebrity who's still in love with the director's wife ballerina. There's Charlie (Sascha Radetsky), the perfect good guy. One has the obnoxious stage mom. Another has the talent but not the drive. A third has the drive but not the talent. Etcetera. And the lives of the students take the typical high school romantic twists and turns, as the students compete for one of three spots in the company by the end of the year, and also in the various love triangles between the cast. There are few surprises here. None of the cast is much of an actor - Schull is particularly uneven - and the plot has a sort of predictability to it that make eyes roll. So why the 8/10? Well, because despite all this, Center Stage is a great amount of fun - mostly due to the dancing. By casting real dancers in a lot of the roles, Center Stage lends an air of credibility to the lavishly filmed dance sequences, clearly done with love by such talents as world-leading dancers Julie Kent and Ethan Stiefel (widely considered to be one of the best ballet dancers in the world) as well as relatively new talents such as Amanda Schull. Some of the actors have body doubles dancing for them, such as Zoe Saldana - who had some dance training but not at the level required by the film. But overall, the dance scenes are the best part of the movie, especially Cooper's ballet at the end. Some movies are great because they change your life or make you think. Center Stage is great because it's like candy - full of saccharine sugar and empty calories, but eminently watchable over and over again. Sometimes movies don't have to be socially relevant or intellectually stimulating to be good. Sometimes, escapism is OK too.",
         "Every now and then there's a new movie about dancers, or dancing, or one with a lot of dancing in it. From Astaire to Kelly to Hines, it's the poetry of motion. If you have any appreciation for the art form whatsoever, the one to see right now is Center Stage. It's about a school year in the life of three teenage girls who are roommates at a ballet academy in New York. They pass the auditions to get into the school, but then have to work as hard as possible to move on from there. At the end of the year is a workshop performance where they can be seen by most of the people in the industry who could hire them, including the resident company. They work toward and hope for a career in the most demanding pursuit imaginable, facing gifted competition, and placed on a limited schedule. \"A dancer has ten years, maybe fifteen if they're not injured\" in order to peak in their career and be the best they can ever be. A singer can sing most of their life. An actor can act all his life. A dancer's clock is ticking. It's only a matter of time before they can only teach and choreograph, so there's a unique sense of urgency to start young, study hard, and survive. All that might make a good movie. Might not. Along with the good, you have to take the less than good. The characters are nothing new. There's the naive female ing\u008enue (Amanda Schull), the bad girl (Zoe Saldana), the favorite girl (Susan May Pratt), the cocky lead boy (Ethan Stiefel, \"hailed as the most advanced male dancer in the world\"), the nice guy dancer (Sascha Radetsky), the nice guy non-dancer (Eion Bailey), the gay friend (Shakiem Evans), the pushy mother (Debra Monk), the demanding teacher (Donna Murphy), and the dictatorial company director (Peter Gallagher). How'd he get in there? There's even a Russian figure skater (Ilia Kulik) in the cast as a dancer. By the way, everybody is amazingly good-looking. Kind of like, Friends as done by George Ballanchine. Only in the movies, right? The story is nothing new either. Will everything work out? Will their dreams come true? Will they survive the heartbreaks of love, and the bodyaches of dance? Well, it's the movies, isn't it? Since the cast features some of the youngest and best dancers in the world, the acting comes second. Often a distant second. Or third. Don't expect any awards to be handed out in that area. Some parts are surprisingly weak, but then they move on and get back to letting their feet do the talking. Did I mention that the only reason to see this is for the dancing? The way it's filmed here is excellent, without actually having to go to a ballet. The beauty of movement, the grace of the girls, and the strength and skill of the boys is captured as well as any other movie in the subject you're likely to see. The big dance numbers at the end are worth seeing by themselves, including more modern styles. Beforehand, there are a couple of dance scenes without ballet. The kids go to a club one night and salsa, and later we see a bunch of Broadway hoofers in a jazz class lead by Priscilla Lopez (original cast of A Chorus Line) that reminded me of scenes in All That Jazz. Those were the most fun. Other scenes will remind you of The Turning Point, White Nights, and even Dirty Dancing. The comparison to Fame is inevitable. That was then, this is a new century. The natural talent, dedication, motivation, support, and ass-busting hard work needed to succeed at this kind of life is touched on here, but also touched on is the sheer love of the game. For dance itself. That's the main thing. E-mail and comments are welcome.",
         "What can you say about a movie that not only makes you want to get up and dance yourself, but one that keeps you hanging on every dance step and word? Perhaps fabulous. While everyone was running off to see the spring Block Buster Gladiator, I was watching the sneak preview of Center Stage, along with 300 to 400 others. The chemistry between these first time movie actors was just amazing. That dancing was breathtaking and the plot was wonderful. It was full of surprises and excitement. Had to be my favorite movie in the last couple of years. There was barely any language and a bit of sex, but it was appropriate for the story line. This is a movie for everyone young and old. It is a must see in the theater, and I promise you it will get your heart pumping!",
         "\"Center Stage,\" a film about the lives of young modern dancers who want nothing more than to make a name for themselves, dazzles with some of the best on-screen dance performances since Patrick Swayze shook his hips in \"Dirty Dancing\" thirteen years ago. Starring some of the most talented modern dancers ever to hit the silver screen, \"Stage\" focuses its attention on the lives surrounding the young dancers and their struggles for stardom. The film is a revealing exploitation of the complexity associated with modern dance, diving into the realities of dance phenoms that sacrifice their social life for a role that will find them performing in front of a live audience. Rating: 6",
         "Let's see--you've got a bunch of young hopefuls in a tough ballet school in NYC--you have the tough, but lovable, black girl; the token gay man; the sweet virginal heroine; the arrogant Russian guy; the sweet lovable guy who's perfect for the sweet heroine, but she doesn't know it; the b**** who's starving herself to death; the guy who loves her and wants to help her; the tyrannical (but lovable) ballet teachers--yep, they're all here! The script is utterly predictable, you know how it's going to end 10 minutes into the movie, but I loved it! The acting is surprisingly good, it's beautifully filmed, the whole cast is attractive and the dancing is simply superb. I wasn't bored once during the entire 2 hours. Well worth seeing.",
         "I loved this for the dancing - the balcony scene from Romeo and Juliet, the dance of the little swans from Swan Lake, a bit of the Stars and Stripes, and some great modern stuff, especially the show sequence which works through Michael Jackson and Jamiroquai. The story is just a bundle of cliches in looks and personalities and you just know how it is all going to end. So, worth seeing for the dance sequences, but its turn off your brain time for the rest. With a stronger storyline this could have been a really good film. As it is, its a high 7 out of 10.",
         "Being of the male persuasion, this isn't a movie I would typically go to the theater to see. However, not being the stereotypical male, I decided to rent it on video and watch it together with my girlfriend. This movie is your typical teenage gal film. All the elements are there... good girl, bad girl, holier-than-thou girl, homosexual friend, domineering mother, bad guy, good guy... the list goes on and on. Jody Sawyer (played quite well by newcomer Amanda Schull) wants to be a ballet dancer. She is already good, but she wants to be the best. She joins on with a famous ballet school, and commences auditions for the all-out ballet blast at the end of the school year, where the dancers will be watched very closely, and some of them will be signed with major ballet companies. Along the way, she runs into some problems with the other members of the school, as well as the company director. She finds that ballet schools aren't all they are cracked up to be. (Who knew?!) They are more about politics than they are about dancing. She gets burned by one guy, encouraged by another, and tries to be the best she can. Eventually, she finds the way to her dreams, but not in the typical way, the one the viewer may expect. Acting here is a tad hollow. However, for a cast of unknowns, it's pretty fair. After all, this movie is about dancing, not about acting. As might be expected, everybody here is gorgeous. (Are they trying to tell us there are no visually unpleasant ballet dancers... anywhere?!) Aside from that, the storyline is rather unbelievable, and contrived. This leads to a loss of major points. The best thing about this movie is the dancing. If you are a fan of ballet, be sure and rent this video. It has some of the best ballet dancing that can be seen in any other movie. In particular, the dance exhibition at the end is magnificent! If you are male, watch this one with your female significant other. (It's good for points.) If you are a gay male, watch it with your male significant other. If you are female, just watch it, you'll love it, especially if you are into cotton candy type films. Overall, it it's no Oscar winner, but it isn't too bad, either. Did I mention the dancing was pretty good? My Rating: 6/10",
         "I understand that a movie must be about emotional expression, otherwise people would not like it, but a film about dancing should be, in my view, more about expression through dance. This film was not like that and, even if it had some nice dance scenes in it, the rest was sadly disappointing. I may be biased, since I am watching the second movie in as many days about a self-obsessed blonde dancer who believes her feelings are more important than anything else, but I found the main character hard to sympathize with and the rest of them really cliché. The black girl with talent but lack of self control, the black gay guy, the blonde dance god and the nice muscular perfect boyfriend, the bitchy perfectionist and the overcontrolling mother, they are all in here, playing their cardboard parts in hard to believe scenes on the music of Michael Jackson and the like. Bottom line: if you are passionate about dance and/or ballet, you might want to check it out, but bare in mind that the dancing here could have been replaced by sports or literature or automechanics and the script would have remained mostly untouched and the film very similar to something you've seen before on TV.",
         "The title comes from the dancer's center of gravity, which I'm told is used to explain the difference between Russian and American dance to us non-dancers. The Russian tradition is one of capturing and controlling it; the American (since Balanchine, whose work is employed here) is to understand it and let the center `go.' And insofar as it can, that is the point of the drama employed to tie together the dance segments of this film. It is a non-trivial point, underlined by employing not actors in the key roles, but dancers who `act.' These kids are surely endearing. Two points seem worth mentioning. The first is the matter of dance in film. Dance is intrinsically cinematic in terms of emotion as motion. But it is too personal, too directly a matter between humans, to convey well to the funnel of film: everything squashed into an image, then given indiscriminately and undifferentiatingly to all viewers. So the cinematographer has a tough choice: what to do with the camera to increase bodily intimacy. One, unacceptable, extreme is to stay stationary at a few points, another is to choreograph the camera so the viewer is one of the dancers. In this case, at the end at least, we have a happy medium so far as camera involvement. The camera is stationary, but often within the field of dance, and it pans. The staging of the dance was partly to the audience pictured, and partly to us, which is very clever. But it would have been nice to be more adventurous in this regard, especially since there are several choreographers in NYC who are up to the challenge, and cheap! The second point is a matter of self-reference, which I appreciate almost without qualification when I see it. The filmmaker gives us a bunch of young actors (actually dancers) who surprise us by effectively showing us their souls in a little love triangle drama. And the matter of their story? A bunch of young dancers who surprise the audience in the film by effectively showing their souls in a little love triangle drama. The film as summarized in the dance is a very intelligent device which I appreciated. And you will too.",
         "What makes this something unique? What the difference with other movies about dancers?. I just can tell I'm not a fan of the dance things, I mean I really hate those many pop singers who abuse of the dance to hide their bad work, so for year I was avoiding these movies. But when I saw the music video of this film, something was different, there was not the same old story with the cast of pop stars trying to show they are more than a cute face. There was a cast of amazing dancers showing the best of them in just a few minutes. So, finally I found myself watching this movie with the strange desire about an endless story. Weird, but for one who doesn't like the dance, this was a discover of whole new world were the dancers and the cast make an incredible work in a story who deserve to be with the classic of these themes. This movie it's not shallow love story of a group of teenagers trying to become in big stars, it's about the crash of the passion and the reality, the time when the real love for something has to be tested to found the perfect place in the universe of the society, something that it's hard to find in a good film."
      ],
      "genres": [
         "Drama",
         "Music"
      ],
      "productionCompanies": [
         "Columbia Pictures Corporation",
         "Laurence Mark Productions"
      ],
      "summaries": [
         "The education of three young students, Jodie, Eva and Maureen, as they study at the American Ballet Academy. Life isn't what they expected at the esteemed ABA, and all three face problems along the road. Jodie doesn't have the \"ideal\" body for dancing, Eva doesn't have the right attitude, and Maureen doesn't have the heart. Along the way, they learn that love can be found in unlikely places, and dancing should be a passion, not a duty.",
         "After auditions, 12 young dancers make it to the American Ballet Academy. They'll prepare for the student showcase to determine who will be asked to join the American Ballet Company. Tensions mount between Jonathan, the company's aging choreographer, and Cooper, his best dancer, who also wants to choreograph. The brilliant Maureen seems poised for success, but she discovers that life is passing her by. Jody, whose body may be the wrong type and whose technique is ragged, elicits Cooper's interest. The edgy, smart-mouthed Eva loves to dance but seems destined to be stuck in the back of the chorus. The showcase will decide their fates.",
         "A group of 12 teenagers from various backgrounds enroll at the American Ballet Academy in New York to make it as ballet dancers and each one deals with the problems and stress of training and getting ahead in the world of dance."
      ],
      "budget": 18000000
   },
   "movielensId": 3594,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-05-12",
      "dvdReleaseDate": "2000-10-24",
      "directors": ["Nicholas Hytner"],
      "runtime": 115,
      "movieId": 3594,
      "title": "Center Stage",
      "mpaa": "PG-13",
      "actors": [
         "Amanda Schull",
         "Zoe Saldana",
         "Susan May Pratt",
         "Peter Gallagher",
         "Scottie Thompson",
         "Maryann Plunkett",
         "Ethan Stiefel",
         "Sascha Radetsky",
         "Donna Murphy",
         "Megan Pepin",
         "Debra Monk",
         "Elizabeth Hubbard",
         "Eion Bailey",
         "Marcia Jean Kurtz"
      ],
      "imdbMovieId": "0210616",
      "originalTitle": "Center Stage",
      "genres": [
         "Drama",
         "Music"
      ],
      "youtubeTrailerIds": ["CmHPpl5FNh8"],
      "plotSummary": "A group of 12 teenagers from various backgrounds enroll at the American Ballet Academy in New York to make it as ballet dancers and each one deals with the problems and stress of training and getting ahead in the world of dance.",
      "tmdbMovieId": 10560,
      "avgRating": 3.28428,
      "releaseYear": "2000",
      "numRatings": 1495,
      "posterPath": "/hCR9r2hE0woymx62pymQ0Bs4mk7.jpg"
   }
}