{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0165831",
      "video": false,
      "title": "Held Up",
      "recommendations": [
         42176,
         45390,
         118991,
         39140,
         62107,
         52471,
         48689,
         10034,
         15155,
         24214,
         84201,
         58028,
         14530,
         54613,
         14892,
         15122,
         45840,
         24050,
         89261,
         121822
      ],
      "backdrop_path": "/pQuaY8Pt9bAURUBAvHDnEsSJiSJ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "Michael",
               "gender": 2,
               "credit_id": "52fe47da9251416c750a79c1",
               "name": "Jamie Foxx",
               "profile_path": "/cDRGXCNrwf1p9jouw9GzhU2vWP7.jpg",
               "id": 134,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Rae",
               "gender": 1,
               "credit_id": "52fe47da9251416c750a79a1",
               "name": "Nia Long",
               "profile_path": "/q01J3WgNd96GR7CcSxx56N8qwSZ.jpg",
               "id": 9781,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Pembry",
               "gender": 2,
               "credit_id": "52fe47da9251416c750a79a5",
               "name": "Barry Corbin",
               "profile_path": "/38AilHla20EFhEYAqoz6EzfsrQf.jpg",
               "id": 12852,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Jack",
               "gender": 2,
               "credit_id": "52fe47da9251416c750a79a9",
               "name": "John Cullum",
               "profile_path": "/9DQEL4iaQOdfsGm16mBKaMgrHQJ.jpg",
               "id": 53085,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Beaumont",
               "gender": 2,
               "credit_id": "52fe47da9251416c750a79ad",
               "name": "Jake Busey",
               "profile_path": "/mGbWKlwTTyr62h6IwL66otOQV15.jpg",
               "id": 28410,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Trina",
               "gender": 1,
               "credit_id": "52fe47da9251416c750a79b1",
               "name": "Roselyn Sánchez",
               "profile_path": "/ctkNxIjd0lQY8tV14n8J6YoFJuA.jpg",
               "id": 41901,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Rodrigo",
               "gender": 2,
               "credit_id": "52fe47da9251416c750a79b5",
               "name": "Eduardo Yáñez",
               "profile_path": "/lapi1fkl8oPZ7TNbQ5wp1bbTblx.jpg",
               "id": 9211,
               "order": 6
            },
            {
               "cast_id": 7,
               "character": "Mary",
               "gender": 1,
               "credit_id": "52fe47da9251416c750a79b9",
               "name": "Sarah Paulson",
               "profile_path": "/v8NuPMfw0QSSpgeMuJp12Ijd52M.jpg",
               "id": 34490,
               "order": 7
            },
            {
               "cast_id": 8,
               "character": "Sal",
               "gender": 2,
               "credit_id": "52fe47da9251416c750a79bd",
               "name": "Diego Fuentes",
               "profile_path": null,
               "id": 84730,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Biker",
               "gender": 2,
               "credit_id": "55ed3dcb9251413e450133fa",
               "name": "Michael Shamus Wiles",
               "profile_path": "/upfSW6BGze446iqsZRehzcToNm8.jpg",
               "id": 9291,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Gloria",
               "gender": 1,
               "credit_id": "55ed3dcb9251413e350132e6",
               "name": "Julie Hagerty",
               "profile_path": "/3L0l8TVSzqYNmJA1b2Ve6bU2iwz.jpg",
               "id": 14415,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Billy (SWAT Team Leader)",
               "gender": 2,
               "credit_id": "55ed3dcbc3a3682c62014012",
               "name": "Andrew Jackson",
               "profile_path": "/6kXCJ840zacsuFzHBVYMOrUwBbW.jpg",
               "id": 62712,
               "order": 11
            },
            {
               "cast_id": 19,
               "character": "Sonny",
               "gender": 0,
               "credit_id": "55ed3dcc9251413e2f0130e6",
               "name": "Dalton James",
               "profile_path": "/8QG4JUgvlsqiGzD81JZhqageWew.jpg",
               "id": 65400,
               "order": 12
            },
            {
               "cast_id": 20,
               "character": "Jose",
               "gender": 2,
               "credit_id": "55ed3dcc9251413e41013149",
               "name": "Sam Vlahos",
               "profile_path": "/sBkyjvb8FWmwyG0rpY3mVzSsf5W.jpg",
               "id": 157567,
               "order": 13
            },
            {
               "cast_id": 21,
               "character": "Rusty",
               "gender": 2,
               "credit_id": "55ed3dccc3a3682c5d0151e9",
               "name": "Sam Gifaldi",
               "profile_path": null,
               "id": 165453,
               "order": 14
            },
            {
               "cast_id": 22,
               "character": "Alice",
               "gender": 1,
               "credit_id": "55ed3dcdc3a3686f1700265b",
               "name": "Herta Ware",
               "profile_path": "/poRXuwz2st3ckIsJYVI94Ry48hQ.jpg",
               "id": 136482,
               "order": 15
            },
            {
               "cast_id": 23,
               "character": "Howard",
               "gender": 2,
               "credit_id": "55ed3dcd9251413e3e013f68",
               "name": "Harper Roisman",
               "profile_path": null,
               "id": 157616,
               "order": 16
            },
            {
               "cast_id": 24,
               "character": "Wilma",
               "gender": 0,
               "credit_id": "55ed3dcdc3a3682c6b0129bd",
               "name": "Natalia Cigliuti",
               "profile_path": "/f1xk5Resl7ZCj3X6GMOqWIgri15.jpg",
               "id": 1212467,
               "order": 17
            },
            {
               "cast_id": 25,
               "character": "Clute",
               "gender": 0,
               "credit_id": "55ed3dcd9251413e3a0135a3",
               "name": "Gary Owen",
               "profile_path": "/419tCojrRrEDhINC38wXuiUOTC4.jpg",
               "id": 214108,
               "order": 18
            },
            {
               "cast_id": 26,
               "character": "Delinquent",
               "gender": 0,
               "credit_id": "55ed3dce9251413e2f0130eb",
               "name": "David Deveau",
               "profile_path": null,
               "id": 1233029,
               "order": 19
            },
            {
               "cast_id": 27,
               "character": "Reporter",
               "gender": 0,
               "credit_id": "55ed3dcec3a3686f1700265e",
               "name": "Kimberly Karpinski",
               "profile_path": null,
               "id": 1506264,
               "order": 20
            },
            {
               "cast_id": 28,
               "character": "Leon",
               "gender": 2,
               "credit_id": "55ed3dcec3a3682c5d0151eb",
               "name": "Tim Dixon",
               "profile_path": "/jVSmxZvN880UdLmIURsNsBbGlYZ.jpg",
               "id": 87740,
               "order": 21
            },
            {
               "cast_id": 29,
               "character": "Cameraman",
               "gender": 0,
               "credit_id": "55ed3dcf9251413e4101314d",
               "name": "Grant Boulton",
               "profile_path": null,
               "id": 1506265,
               "order": 22
            },
            {
               "cast_id": 30,
               "character": "Messenger",
               "gender": 0,
               "credit_id": "55ed3dcfc3a368090c003bf3",
               "name": "Cabral Rock",
               "profile_path": null,
               "id": 1506266,
               "order": 23
            },
            {
               "cast_id": 31,
               "character": "Pilot",
               "gender": 1,
               "credit_id": "55ed3dcf9251413e350132e8",
               "name": "Kathryn Winslow",
               "profile_path": "/yVyxbuKAf4jN6ZfrjOvZDWLdYWk.jpg",
               "id": 101259,
               "order": 24
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47da9251416c750a79c7",
               "name": "Steve Rash",
               "profile_path": "/t7sZbMXWCHp80p5tPFTnsPY037h.jpg",
               "id": 54590,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47da9251416c750a79cd",
               "name": "Erik Fleming",
               "profile_path": null,
               "id": 106733,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe47da9251416c750a79d3",
               "name": "Jeff Eastin",
               "profile_path": null,
               "id": 212935,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe47da9251416c750a79d9",
               "name": "Jeff Eastin",
               "profile_path": null,
               "id": 212935,
               "department": "Writing",
               "job": "Story"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 4.884934,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 19489,
      "vote_count": 12,
      "budget": 0,
      "overview": "While they're on vacation in the Southwest, Rae finds out her man Michael spent their house money on a classic car, so she dumps him, hitching a ride to Vegas for a flight home. A kid promptly steals Michael's car, leaving him at the Zip &amp; Sip, a convenience store. Three bumbling robbers promptly stage a hold up. Two take off with the cash stranding the third, with a mysterious crate, just as the cops arrive. The robber takes the store hostage. As incompetent cops bring in a SWAT team and try a by-the-book rescue, Michael has to keep the robber calm, find out what's in the crate, aid the negotiations, and get back to Rae. The Stockholm Syndrome asserts its effect.",
      "similar": [],
      "original_title": "Held Up",
      "runtime": 89,
      "poster_path": "/sCVpxfI9NnjJ5lqjxa1Ccg84xKp.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         },
         {
            "name": "Português",
            "iso_639_1": "pt"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [],
      "release_date": "1999-10-08",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Steve Rash"],
      "runtime": 89,
      "synopsis": null,
      "writers": [
         "Jeff Eastin",
         "Erik Fleming"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0165831/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA1OTE2MDQ0OV5BMl5BanBnXkFtZTcwNTg1MjgxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Jamie Foxx, Nia Long, Barry Corbin | See full cast and crew »"],
      "reviews": [
         "Jamie Foxx comes forth with another dumbass comedy, but at least in this one he pretends that he can possibly portray a respectable person. Trapped in a tiny town full of rednecks, Michael (Foxx) tries to recover from his fiancee (Nia Long, whose talent was even more wasted than it was in Big Momma's House) leaving him just after his beloved car was stolen, when he finds himself stuck in the middle of a botched robbery. Yes, this is your stereotypical hick town. They have to have a tremendously fat guy (remember Billy Bob from Varsity Blues?), the police force winds up running around in their boxer shorts, and the sheriff seems to care more about the local sporting events than he does about saving the hostages in the gas station. This movie may not have been so awful had it not been for the fact that the writers were clearly trying to grab for laughs every second of the way, while ignoring the necessary elements (even in a slapstick comedy) of reality and credibility. (spoilers) The robbers become likeable, so of course the film has to have a happy ending. That's fine, but what happened? They got on the bus, rode off into the sunset, and evidently the idiot police force went back to their baseball game, because they ignored the fact that the attempted robbers just drove away. `Oh well, let's just all go home!' Even country police forces aren't that stupid. Held Up is slow paced, it's often boring, and it takes a serious situation and tries to get stupid laughs by making ridiculous efforts to make it all funny. It tries to force a smile on unhappy material, and was therefore doomed from the beginning. Hardcore Jamie Foxx fans may enjoy his cornball antics in this movie, but anyone looking for even the smallest hint of quality in their cinematic entertainment would be best advised to ignore this garbage.",
         "Held Up is a movie that will only be liked by those few hard-core Jamie Foxx fans. Yes, it has its funny parts, but they are few and far between. The idea of a man being dumped by his woman, then having his car stolen, and then actually being caught in the middle of a robbery is somewhat ludicrous. Jamie Foxx is funny in the movie, as he is in all his movies, and with a little help from the sexy Nia Long, who by the way you almost forget is IN this movie, together they make the movie almost bearable. The problem with Jamie Foxx's movies is that they have no feasible plot, and they just stick any comedic situations in to just try and buy a laugh from the viewers. Now don't get me wrong, I do think that Jamie Foxx is funny, I just think that he needs to choose his scripts better. This movie is a sad attempt at creating a believable storyline. If a movie has `lucked out' and made you laugh a couple of times does it make that movie a good movie? NO! And all the laughs in the world couldn't save this one. Steer clear of this Jamie Foxx flick, and let's just hope that the soon to be released `Bait' will be better. Don't count on it.",
         "I must admit, when I sat down to watch this, I was pleasantly surprised; it was funnier than I had imagined... however, with my expectations being very, very low, it doesn't really mean that the film is anything more than average. A pretty good amount of laughs, but nothing memorable. The ending seemed to be too much of a \"happy ending\" and was obviously done to open the film up to the mainstream crowd. The plot is decent enough, but it is obviously just written to put the characters in unlikely situations, and is at least a little too over-the-top. The pacing is pretty good, the film isn't really boring for the 90 minutes it lasts(then again, it isn't really *that* hard to make people laugh for an hour and a half). The characters are somewhat well-written, and one or more manage to rise above simply being tired stereotypes. The dialog is often quite humorous, and mostly well-delivered. The acting is decent, for a bunch of no-names; the only well-known actors in the cast are Jake Busey and Jamie Foxx, both of whom prove their worth as comedic actors. The humor is quite good, if a bit dull and predictable. The film has next to no memorable parts to it, though it is somewhat funny. All in all, an average comedy, and worth watching *once* if you can see it for free. I recommend it to fans of typical American comedies. If it's on TV, see it, unless you've seen it before. I have seen it once, and have no intention of seeing it again. 5/10",
         "What a difference five years make! Judging by the performance of Jamie Foxx in this comedy, one wouldn't have thought he had the range to play the title role in \"Ray\". This movie will not add anything to his resume, that's for sure. As directed by Steve Rash, the movie looks as though it either had some production problems, or the studio lost faith in this project. The movie has a flat feeling. Most of the jokes don't work and all those familiar faces one sees have done better work before. What's even worse, the two stars, Jamie Foxx and Nia Long, don't show much chemistry between them. In fact, Ms. Long is only seen occasionally. Barry Corbin, Julie Hagerty, Eduarado Yanez, Roselyn Sanchez, Jake Busey, John Cullum, are seen in minor roles that don't add much to the picture.",
         "This movie was okay. It made me laugh out loud more than once. It was however VERY slow moving in parts. I fell asleep watching it on Friday night, but it was decent enough that on Saturday morning I found where I dozed off and continued watching it. A good point is that the movie manages to be moderately funny without being crude or overly sexual... That's hard to find these days. The biggest negative is that virtually the entire plot occurs in one spot, and you get very little change of scenery throughout the entire movie. If you're looking for continuous laughs, this may not be the movie for you. But if you can endure the slow parts, the humor will sporadically appear.",
         "Held Up is one of the worst movies I've ever seen. After watching it, I've decided that Jamie Fox needs to return the Oscar he won. This movie is so bad, it erases everything good he's ever done. It is not at all funny. Jamie Fox goes to buy a car in Arizona with his fiancée and calls it their \"vacation\". And if that didn't get her mad, imagine how mad she got when she realized he paid $18,000 for it instead of the $5,000 he said it cost! Apparently he though she was a moron who would never figure out all their house money was used. So she leaves. Hilarity ensues as he tells her he doesn't need her anyway, then chases after the cowboy-filled pickup truck she's getting a lift in to tell her to come back! You'll catch your breath from all the laughing right around the time he gets some hilarious advice from a gas station hillbilly about how to treat a woman by buying her flowers for no reason, etc. He'd go after her and catch her at the airport but - get ready to laugh some more - he locked his keys in his car! HAHAHAHA! Then he pays some kid to get it unlocked, but when the kid unlocks it... he STEALS it! HAHAHAHAHHA! He calls the police but they're all at the small town little league game (did I mention the part where Jamie Fox's fiancée has bad diarrhea so he takes her to a porta-john, and his car alarm goes off, RUINING the home town's chances to score with bases loaded? No? Well it was hilarious too!) Anyway, he's stuck there, and before the only deputy on duty (Jake Busey in no doubt the proudest acting role he's ever been given $100 to perform) can show up, boneheaded Mexican criminals rob the place! It's SO funny because the one guy is saying \"don't use our names\" but the OTHER guy keeps saying their names! He's so stupid, it's hilarious! Did I mention the Sip and Zip/Gas Station guy has no quarters? Man, what kind of gas station has no change? Luckily the stupid hip-hop-wannabe country kid who hangs out in the gas station playing Atari Joust has lots of quarters and thinks Jamie Fox is his hero, Puff Daddy, because stupid rednecks like him can't tell black people apart! HAHA! That's so crazy! And there's two people from Northern Exposure in the show, but that's not so funny. When Deputy Jake Busey shows up to fill out the stolen car report, the poop hits the fan and a hilarious stand-off ensues. Jamie Fox is so scared he yells funny things and puts his legs up on the store's door handles for some reason! That was really funny. A lady banged her shoe on the counter and he thought it was a gun so he grabs the kid and screams \"Not you you're too young, are you bleeding?\" That was really funny because he looked like a panicky fool, and everybody else knew that nobody was shooting a gun. Did I mention something to do with a mysterious crate the criminals were after? Yeah, that would be the \"plot\" I guess, but it was pretty pointless, and not quite as HILARIOUS as the rest of the movie (oh hey something else, his new car's radio? It's an old fashioned 8-TRACK PLAYER! LOLOLOL ROFL OMG!!!!!! HAHAHAHAHAHAH!! That's hilarious!) Then he goes to the airport and they get back together, I think, not sure though, couldn't watch any more of it because I have knives in my kitchen and would have had to kill myself. Oh except for the scene where Jamie Fox gets a cut on his cheek, then starts to cry like a woman! That was SOOOOO FUNNY! Because he keeps trying to act like this tough guy, but then he's crying and screaming! HAHAHHAAH! Oh man! HAHHAHAHAHHAH!!!!! Oh and the part where the police report on the news that Jamie Fox is actually boxing celebrity Mike Tyson, because they are also rednecks who can't tell black people apart! HAHAHHAHAH!!!! I could go on and on and on and on and on with all the hilarious and original jokes they had in this movie that would just make you laugh out loud and roll on the floor, holding your stomach. You should know that if you watch this movie your stomach will hurt for weeks because of all of the laughing you will definitely do. Like the part where they try to cut the power in the station, but actually they cut the power to everyone else in town first. Can't these crazy rednecks do anything right? HAHAHAHAHA!!!! Anyway, avoid this movie, it sucks poop.",
         "Jamie Foxx has nothing but trouble when his girlfriend (Nia Long) leaves him after a fight in desolate Arizona and then his car gets stolen. Foxx then has more good luck by being held hostage at a convenient store after a botched robbery by ringleader Eduardo Yanez. Country-hick sheriff Barry Corbin becomes the negotiator in this light-hearted \"Dog Day Afternoon\"-styled fiasco. Admittedly hilarious to an extent, but begins to drag its feet late with plot resolution and a somewhat dramatic twist. Foxx is on the ball when it comes to his comedic timing and execution, but the flick is really beneath his wide range of talents. Adequate little time killer and truly funny---if you are in the right mood. 2.5 out of 5 stars.",
         "I saw this film aboard a bus, in November of 2000, on my way from the Tallahassee Amtrak station and Walt Disney World (the tracks were being worked on). I was thus a captive audience for the bus driver's taste in movies; otherwise, I never would have seen it. It's hard to imagine that Barry Corbin and John Cullum (from Northern Exposure), and Julie Hagerty (from the Airplane movies) would have wasted their time with anything this bad: nobody could be that hard up for work. That's not to say that the movie didn't get a few laughs from me, and from the other passengers on the bus. But we weren't laughing WITH it; we were laughing AT it.",
         "I really had no expectations going into this movie, but it turned out to be the most painfully boring, humorless movie-going experience I've had so far this year. The script is completely unfunny, and as good as the cast members have been in other projects, they can't salvage this mess. What it boils down to is that we end up stuck in a convenience store in the middle of the desert with a group of thinly-written and annoying characters. I didn't care for Clerks, but it now looks like a masterpiece compared to Held Up.",
         "I've read many bad reviews of this movie but I have to say, I do not agree at all. This movie was hilarious, entertaining, and had an interesting plot. Who doesn't love when someone gets into a crazy situation with a bunch of strangers? The actors were all funny and a delight to watch on screen. The whole hostage situation was extremely fun to watch and easy to get invested into. I could go on forever about this wonderful movie but you have to see it for yourself to really understand. I really urge everyone to watch this film. It's even on netflix! You can watch it with your friends, family, or just by yourself. Have a good time!"
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Minds Eye Entertainment",
         "Original Film",
         "Trimark Pictures"
      ],
      "summaries": ["While they're on vacation in the Southwest, Rae finds out her man Michael spent their house money on a classic car, so she dumps him, hitching a ride to Vegas for a flight home. A kid promptly steals Michael's car, leaving him at the Zip & Sip, a convenience store. Three bumbling robbers promptly stage a hold up. Two take off with the cash stranding the third, with a mysterious crate, just as the cops arrive. The robber takes the store hostage. As incompetent cops bring in a SWAT team and try a by-the-book rescue, Michael has to keep the robber calm, find out what's in the crate, aid the negotiations, and get back to Rae. The Stockholm Syndrome asserts its effect."],
      "budget": 8000000
   },
   "movielensId": 3595,
   "movielens": {
      "languages": [
         "English",
         "Italiano",
         "Português",
         "Español"
      ],
      "releaseDate": "1999-10-08",
      "dvdReleaseDate": "2000-08-29",
      "directors": ["Steve Rash"],
      "runtime": 89,
      "movieId": 3595,
      "title": "Held Up",
      "mpaa": "PG-13",
      "actors": [
         "Jamie Foxx",
         "Nia Long",
         "Barry Corbin",
         "John Cullum",
         "Jake Busey",
         "Roselyn Sánchez",
         "Eduardo Yáñez",
         "Sarah Paulson",
         "Diego Fuentes",
         "Michael Shamus Wiles",
         "Julie Hagerty",
         "Andrew Jackson",
         "Dalton James",
         "Sam Vlahos",
         "Sam Gifaldi",
         "Herta Ware",
         "Harper Roisman",
         "Natalia Cigliuti",
         "Gary Owen",
         "David Deveau",
         "Kimberly Karpinski",
         "Tim Dixon",
         "Grant Boulton",
         "Cabral Rock",
         "Kathryn Winslow"
      ],
      "imdbMovieId": "0165831",
      "originalTitle": "Held Up",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["wf5ovF63uvA"],
      "plotSummary": "While they're on vacation in the Southwest, Rae finds out her man Michael spent their house money on a classic car, so she dumps him, hitching a ride to Vegas for a flight home. A kid promptly steals Michael's car, leaving him at the Zip &amp; Sip, a convenience store. Three bumbling robbers promptly stage a hold up. Two take off with the cash stranding the third, with a mysterious crate, just as the cops arrive. The robber takes the store hostage. As incompetent cops bring in a SWAT team and try a by-the-book rescue, Michael has to keep the robber calm, find out what's in the crate, aid the negotiations, and get back to Rae. The Stockholm Syndrome asserts its effect.",
      "tmdbMovieId": 19489,
      "avgRating": 2.24615,
      "releaseYear": "1999",
      "numRatings": 65,
      "posterPath": "/sCVpxfI9NnjJ5lqjxa1Ccg84xKp.jpg"
   }
}