{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "diner",
            "id": 10738
         },
         {
            "name": "dating",
            "id": 13043
         },
         {
            "name": "masturbation",
            "id": 33451
         }
      ],
      "imdb_id": "tt0174336",
      "video": false,
      "title": "Whipped",
      "recommendations": [
         149553,
         38132,
         24227,
         78406,
         230428,
         55731,
         88818,
         31083,
         25697,
         33657,
         18553,
         80346,
         118430,
         81001,
         14530,
         49478,
         27224,
         20551,
         250622,
         21118
      ],
      "backdrop_path": "/aJs7u2Fo9Tx5yqR9PCYxVknbTtn.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Mia",
               "gender": 1,
               "credit_id": "52fe446cc3a368484e022563",
               "name": "Amanda Peet",
               "profile_path": "/81KzrntoeEztNpfhCYNgfOtI3kU.jpg",
               "id": 2956,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Brad",
               "gender": 2,
               "credit_id": "52fe446cc3a368484e02256d",
               "name": "Brian Van Holt",
               "profile_path": "/tGRqXOj0pCLjzI8lC3GD3u5HpXM.jpg",
               "id": 12792,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Jonathan",
               "gender": 0,
               "credit_id": "535a9a35c3a36830b000022d",
               "name": "Jonathan Abrahams",
               "profile_path": null,
               "id": 1222232,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Zeke",
               "gender": 0,
               "credit_id": "55008b639251413da10018a8",
               "name": "Zorie Barber",
               "profile_path": "/1fasD1WrxxiMEHspDTo8zKXBH8n.jpg",
               "id": 1438101,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Eric",
               "gender": 0,
               "credit_id": "57e710b2c3a368352500a95a",
               "name": "Judah Domke",
               "profile_path": "/AeO3uTfWO4IGcgisVHNsYBJqIic.jpg",
               "id": 1120876,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Liz",
               "gender": 1,
               "credit_id": "57e710bac3a368220e00a606",
               "name": "Callie Thorne",
               "profile_path": "/sTbZc9R8fKHPXDPQXMBdV2xz9C9.jpg",
               "id": 164397,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Marie",
               "gender": 1,
               "credit_id": "57e710cf925141390b00ae2c",
               "name": "Bridget Moynahan",
               "profile_path": "/sNdD2Cos4aecowtWPpd0hcM8izY.jpg",
               "id": 18354,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Bristol",
               "gender": 0,
               "credit_id": "57e710da925141390b00ae31",
               "name": "Taryn Reif",
               "profile_path": "/9DWGOTL9SldVwISsYPe8txc78It.jpg",
               "id": 100519,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "'Plan' Girl",
               "gender": 1,
               "credit_id": "57e710f2925141395b00ac15",
               "name": "Neriah Davis",
               "profile_path": "/kw8QnfRZu1nPIl52GelfSGdXHaZ.jpg",
               "id": 158105,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Bar Girl",
               "gender": 0,
               "credit_id": "59ff225dc3a368684403b0df",
               "name": "Beth Ostrosky Stern",
               "profile_path": "/kb9z1gmGoTgBXkXGmAexwis99Yl.jpg",
               "id": 1213315,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Bar Girl",
               "gender": 0,
               "credit_id": "59ff229392514146e803b8af",
               "name": "Jamie Donahue",
               "profile_path": "/cr4JzbW9PGfB5xARw0dcK0cgZPJ.jpg",
               "id": 100533,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Bar Girl",
               "gender": 1,
               "credit_id": "59ff231792514146f503e977",
               "name": "Elaina Erika Davis",
               "profile_path": "/v9jtZBppLCkKSAqwwZQOSDQLwUC.jpg",
               "id": 1808948,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Bar Girl",
               "gender": 0,
               "credit_id": "59ff23a592514146e803ba4b",
               "name": "Kristin Di Spaltro",
               "profile_path": "/sNenOETr1fQw8S7Ks6OCBIdvYYh.jpg",
               "id": 1918034,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe446cc3a368484e022569",
               "name": "Peter M. Cohen",
               "profile_path": null,
               "id": 1058138,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "55008b3392514128720012ba",
               "name": "Peter M. Cohen",
               "profile_path": null,
               "id": 1058138,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.149493,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 23531,
      "vote_count": 15,
      "budget": 3000000,
      "overview": "Three to one may sound like fairly good odds, but it depends on the game. When the \"one\" is one very irresistible woman and the \"three\" are three hopelessly smitten guys, the deck is pretty stacked. In the battle of the sexes, the first rule is to never underestimate the power of a woman.",
      "similar": [
         3134,
         8810,
         10285,
         948,
         298312,
         4638,
         112160,
         11564,
         2142,
         4771,
         769,
         59,
         185,
         949,
         205,
         170,
         241,
         431,
         793,
         101
      ],
      "original_title": "Whipped",
      "runtime": 82,
      "poster_path": "/jIVMqADXH1fEAlf8K19FoDZYh0U.jpg",
      "spoken_languages": [
         {
            "name": "Italiano",
            "iso_639_1": "it"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Hi-Rez Films",
         "id": 48357,
         "origin_country": ""
      }],
      "release_date": "2000-09-01",
      "vote_average": 3.4,
      "belongs_to_collection": null,
      "tagline": "Never underestimate the power of a woman.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Peter M. Cohen"],
      "runtime": 82,
      "synopsis": null,
      "writers": ["Peter M. Cohen"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0174336/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE1MzU3ODQxMV5BMl5BanBnXkFtZTcwNTczNzYxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Amanda Peet, Brian Van Holt, Jonathan Abrahams | See full cast and crew »"],
      "reviews": [
         "Spoiler Alert WHIPPED (2000) 1/2 Amanda Peet, Brian Van Holt, Jonathan Abrahams, Zorie Barber, Judah Domke. (Dir: Peter M. Cohen) Amanda Peet is a star on the rise and has proven to show true comic potential as previously displayed earlier this year in `The Whole Nine Yards' where she held her own with co-stars Bruce Willis and Matthew Perry with her own natural charm not belied by her prettiness. However in this debacle of the dating game wars between the sexes she is left to her own defenses in arguably the worst 'comedy' of the year and maybe the worst film of the year period. Four immature moron buddies - Brad (Van Holt), a brogadaccio Wall Street slickster; Zeke (Abrahams), a downtown artiste wannabe; Jonathan (Abrahams) a seemingly closeted homosexual with apparently no occupation except his extracurricular mastabatory schedule; and Eric (Domke) the pudgy, married doofus - who meet for Sunday brunch in a downtown Manhattan greasy spoon to pontificate on their sexual prowess and the degradations thereof. Each tries to trump the other (all by the way having nothing in common except being egotistical jerk-offs) with their weekly exploits and embellishments that give bull***t a new meaning. Then one week the three bachelors find what they each think is the perfect woman and declaring she's the one; this must be love. If you can't see the sub-sitcom level approach leading to the ultimate plot device of them all loving the same woman then you're about as smart as a piece of furniture (or in this case one of the male leads here). That woman is Mia (Peet) who also isn't terribly bright or lacking any scruples when the trio stumble onto her apartment one fateful weeknight and bicker about who's going to stay. Somehow the foursome agree to continue dating one another only to escalate the testosterone stupidity several dozen notches which leads to a friendship showdown and.oh never mind! The `twist' at the end is that Mia turns out to be a player in her own right and the `lesson' is supposed to be that she uses them just as they have used women before. The film is such a mess and amateur filmmaking at its worst. The script is just riddled with expletives at the highest decibel with the four idiot buddies screaming at one another and just plain nasty overall. There's absolutely nothing funny about this attempt at a male `Sex and The City' approach with nothing clever, original (its bare-bones format is a la `Diner' which is likening `Citizen Kane' to `Porky's' which is `Citizen Kane' compared to this crap!) or memorable except Ms. Peet deserves better as do we all. To quote Roger Ebert on his notorious panning of Rob Reiner's `North': `I HATED HATED HATED THIS MOVIE!!'",
         "Final Score: 0 (out of 10) ***Possible scene specific spoilers (but who the hell cares)*** Yes, that's right: zero. And I rarely give 1's. Even for the lamest of movies I look for things like music, cinematography, imagination, it's humor, even a good pace to be as objective about the score as possible. Looking at it within it's own genera or subgenera. But there is absolutely nothing redeeming here. I can't remember another time a movie actually sent me pacing up and down the room when it was over. The only reason I made it to the end was because I couldn't seem to change the channel - I sat there simply aghast, watching to see what insultingly stupid bit it would come up with next. It was like watching a snake digest a rat. But let's have some fun and pull this baby apart, shall we. First of all, There is nothing technical about \"Whipped\" that works. The visuals are all sitcom style. The cut scenes all just pictures of the street traffic going by at night over and over. The music and score, not only doesn't contribute anything to the movie - it's obnoxious. Not to mention it doesn't have anything to contribute to anyway. The acting is as cardboard as it comes, all around and that goes for Amanda Peet (clearly the \"star\" that got this train wreck green-lighted) too. These guys, supposedly good friends, have no more chemistry or sense of purpose then if director Peter M. Cohen had rounded them up at a bus station minutes before shooting. On the creative side, there isn't an original bone in it's body. It has no imagination. It shows us nothing we haven't seen a thousand times before. The whole premise, or \"twist\", of this movie is based on male-bashing and the \"idea\" that an empowered women can play men \"just as they get played\". Anybody, that thinks this is somehow a twist or is in any way original has obviously never turned on a TV before. Twisted, shallow women are common. Male-bashing is the norm. It's not stealing from anything specifically, it's worse: it's stealing from clichés. I can't imagine a women making a movie that depicted other women based so much on stereotypes and with this sense of contempt. Makes me want to go rent \"In the Company of Men\" - or better yet, \"There's Something About Mary\". This movie wants to be a \"edgier\" version of \"There's Something About Mary\" so bad you can see the sweat. The movie has no insights into women, men, dating, sex, or really anything. Cohen is simply content to regurgitate myths he has been indoctrinated with from other sexist movies. On the other end, the movie doesn't work as a satire either, because even though it is ripe with exaggerations one could view as \"satirical\" it doesn't have that grounding in reality that satires need. It doesn't even know what it's satirizing. Then there's the dialogue, which is little more then the characters screaming obscenities at each other. Example: Character 1: \"F**k you\" Character 2: \"Oh yeah, well f**k you\" (repeat) And the bottom line, the thing that could excuse all the other discretions: There are a lot of movies without plots, without good acting, with morally repulsive characters and obscenity laced dialogue that have been funny and thus, been good. \"Whipped\" ain't funny. Not for a second. It has no comic skills or timing. The situations are all completely phony, not based in any shred of truth, especially enough to wring laughs out of us. The characters all broadly drawn so they will SEEM relatable to the lowest of the lowest common denominator. Just look at \"the marquee scene\", \"cult classic\" hair gel scene. One of our bumbling anti-heroes opens the medicine cabinet and sees Mena (Peet)'s vibrator. For some reason light shines down on it as if he's found the holy grail. Why Cohen thinks men react this way to vibrators I do not know. While he rubs it on himself, he drops it in the toilet and then attempts to fish it out with his bare hands when, oh my, Mena walks in on him. Oh, my sides. But strangely enough, people actually like this movie. Of course, people also like \"Friends\" and reality dating shows so I shouldn't be surprised. All of this has a common thread however. \"Whipped\" is big evidence to me that there is just a huge pocket of people in America that will laugh at any joke just because it is about sex. They will like any show or movie (or think they like it) just because it is about dating or relationships. It's lack of any quality has no baring on these people. Just as people are indoctrinated to want whiter teeth and thinner bodies to sell toothbrushes and weight loss programs, they are also indoctrinated to blindly lap up anything dating/relationship related to sell them cheap, empty, effortless TV, movies and any number of products. The only consilation will be that when I die, because I saw this movie, I've got a credit to get 80 minutes of my life back.",
         "I'll be blunt and to the point. This film is not good at all. The film buff part of me hated the acting, script, story, direction and almost all of the editing. Amanda Peet has proven that she can act, as she was a high point of 'The Whole Nine Yards'. So she should have avoided this movie with a ten foot pole. However, the infantile part of me found this film to be very funny. If you can forget about how underpar the production quality is, and if you find smut jokes funny, then you should be all right. And for those of you who can't get off your pedestal, thats your choice. My inner child hasen't died, and I laughed a fair bit. Even then, only a 3 out of ten, because as a movie, it really does stink.",
         "It just seems bizarre that someone read this script, and thought, \"This is funny! I mean, it's so hilarious it just has to be made!\" Who was this person? Is he or she the person really responsible for this? Are they the one's who owe me for my time, more so than the director/writer? This film stinks in most every way possible. There's no one shred of good dialogue, and not one likable character. And the story... I prefer the 2nd worst movie ever, Hulk Hogan's \"No Hold's Barred\" to this by quite a considerable degree. It seems almost Shakespearen in comparison. The ending is padded out with several minutes of outtakes, and it's still under 80 minutes. The outtakes include cast members laughing at the 'hilarious' mistakes they've made, and things that went wrong on the set of this 'comedy.' Glad to see someone laughing in someway, with some connection to this 'film.' Nothing in this film is funny. Nothing. It just goes on, and on. It's truly that lame. I love films that are so bad they're good. This is so bad it's...something, but I don't know what, and hopefully will never find out. Amanda Peet doesn't suck outright, and is in fact the only half good thing about this wannabe film. But, that really means little. Avoid at all costs.",
         "I had never heard of this film until I came across it by accident when browsing IMDB. I saw it had gotten many awful reviews containing very colorful expletives on how much it stunk. Of course this meant I had to see it. I was pleasantly surprised as Whipped is actually rather a good movie. I watched it with a group of friends and we laughed more than we had at many recent highly acclaimed Hollywood fluff comedies. This is an independent film and as such portrays its subject matter (sex and dating) without the usual Hollywood fakery. I distinctly suspect that people's opinion of this film will depend very much on their experience of life. If you've never dated or partied much you won't get this movie because you won't have met people like these characters. If you have, you'll recognize many of the situations that portrayed here in comedic fashion. The ending was also good, as it did not portray women as unreal, helpless, virginal romantics in contrast to many Hollywood movies.",
         "Brad (Brian Van Holt), Zeke (Zorie Barber) and Jonathan (Jonathan Abrahams) are best friends. They use to meet each other once a week together with their married friend Eric (Judah Domke) to tell theirs dates, affairs and sex experiences along the week. Brad and Zeke are greater lovers and Jonathan loves to self-masturbate. One day, each one of them tells the others that have met the perfect girl. Indeed, they come to realize that the girl is the same, Mia (Amanda Peet). A great dispute among them will shake their friendship. A funny surprising end will conclude the plot. This is a film that looks like that is based on the teenagers of `American Pie', when they have grown up. The `low level' and scatological jokes, the concept of relationship with a woman, the focus on sex, the entire screenplay seems to be `inspired' in `American Pie'. However, it has many funny moments and will certainly entertain the fans of movies like\u0085'American Pie'. My vote is six.",
         "(Possible Spoilers Ahead) This was actually a good romantic/date comedy (one of the better ones I've seen this year) and it was good because of It's 5 leads. But the one I liked the most (until maybe the last scene) was Amanda Peet. She has a charm that is all her own, like cameron Diaz had in There's Something About Mary. And she is pretty good through the whole movie, until the last scene, where she shows her true colors as a woman with all the integrity of all 4 lead women in Sex and the City. The only difference being that in Sex and the City It's a chick show because it focuses on the women and there needs. This film is actually mainly a guy film that they can relate to, except that the end can kinda give a guy some low-self esteem (especially after the outcome). But still, the film is overall genuineley funny with good scenes (the vibrator scene is a classic) and for couples. It just, well, it might make you feel a little uneasy with your woman afterwards. By first time Writer and Director (he has produced a film before though) Peter M. Cohen. B",
         "NOTE: Since the spoiler policy is so strict, here's a warning: while I don't think I'm giving anything away, I will be talking about the plot, though only in broad strokes. I was actually quite disappointed by this flick. The story was a fairly standard, role-reversal-type plot that made the supposed justice of the final twist totally unimpressive. Amanda Peet, who was presented as the high point of the film, had maybe 2 minutes out 90 to really show her talent. And I was especially disappointed by how seemingly unimaginative the 4 main male characters were. How many more times do we need to see the hapless married guy who lives vicariously through his still-swinging single friends? Overall, it had the feel of a college student film with better production.",
         "Whipped is at it's best when it focuses on the three guys and their \"scamming\". Their dialogue and situations are, at times, very funny. However, once Amanda Peet's character comes into the picture, the film loses its momentum. The story is predictable, the situations are boring, and the film strains to get laughs. It ends predictably but offers a few more laughs. Whipped is a rental, at best. It's a good party flick, some good laughs, no need to pay close attention, and decent spaces of blah to talk or run out to get more beer. (6 out of 10)",
         "If you expected another version of American Pie, you are wrong. It is a good latenight movie to chill out, and with much hidden, hard to recognize jokes. (Like the pineapple-juice story in the cosmopolitan, and Eric sits later in the diner and drinks pineapple juice) And at the last part there draws a path to a major twist for the end. I found it funny to watch and found some of my friends(male) in it. It is a little piece of art and it works out fine. It has a small number of locations and i believe a small budget, no sightseeing movie."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": ["Hi-Rez Films"],
      "summaries": [
         "Set in New York, 'Whipped' is about a group of three single men, buddies from college, whom meet every Sunday at their local diner hangout to discuss their favorite sport: scoring with women. Their conversations (always revealing, sometimes revolting, and occasionally riotous) revolve around the weekend past and the girls that these three egotistical and narcissistic swingers were able or unable to \"scam.\" However, when all three single guys unknowingly go after the same \"perfect\" woman, Mia (Amanda Peet), they begin to question their skirt-chasing ways. Squabbling breaks out amongst the group as they compete for her attention and suddenly, the fate of their ritual and their friendships, becomes uncertain. Who will win the morning round table bragging rights? You'll be surprised.",
         "Three egotistical swingers, who think they're God's gift to women, end up having their friendships tested when all three of them pick up and start dating the same woman."
      ],
      "budget": 3000000
   },
   "movielensId": 3597,
   "movielens": {
      "languages": [
         "Italiano",
         "English"
      ],
      "releaseDate": "2000-09-01",
      "dvdReleaseDate": "2001-02-06",
      "directors": ["Peter M. Cohen"],
      "runtime": 82,
      "movieId": 3597,
      "title": "Whipped",
      "mpaa": "R",
      "actors": [
         "Amanda Peet",
         "Brian Van Holt",
         "Jonathan Abrahams",
         "Zorie Barber",
         "Judah Domke",
         "Callie Thorne",
         "Bridget Moynahan",
         "Taryn Reif",
         "Neriah Davis",
         "Beth Ostrosky Stern",
         "Jamie Donahue",
         "Elaina Erika Davis",
         "Kristin Di Spaltro"
      ],
      "imdbMovieId": "0174336",
      "originalTitle": "Whipped",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": [
         "XROLxJNmgoY",
         "Z2eAvi4l0Zs"
      ],
      "plotSummary": "Three to one may sound like fairly good odds, but it depends on the game. When the \"one\" is one very irresistible woman and the \"three\" are three hopelessly smitten guys, the deck is pretty stacked. In the battle of the sexes, the first rule is to never underestimate the power of a woman.",
      "tmdbMovieId": 23531,
      "avgRating": 2.57639,
      "releaseYear": "2000",
      "numRatings": 432,
      "posterPath": "/jIVMqADXH1fEAlf8K19FoDZYh0U.jpg"
   }
}