{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "shakespeare",
            "id": 497
         },
         {
            "name": "loss of loved one",
            "id": 697
         },
         {
            "name": "father murder",
            "id": 2123
         },
         {
            "name": "father",
            "id": 5905
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "hamlet",
            "id": 185011
         }
      ],
      "imdb_id": "tt0171359",
      "video": false,
      "title": "Hamlet",
      "recommendations": [
         32513,
         25985,
         3422,
         123067,
         94655,
         49969,
         170926,
         57969,
         41647,
         86823,
         53104,
         38731,
         14585,
         60994,
         62652,
         33430,
         81792,
         267523,
         259231,
         14187
      ],
      "backdrop_path": "/bsuLsOreHxtwE0P4sCrJeq4Jsdb.jpg",
      "revenue": 1568749,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Hamlet",
               "gender": 2,
               "credit_id": "52fe43a39251416c75018367",
               "name": "Ethan Hawke",
               "profile_path": "/kcby6VYk6Gb0036nUyh8chY5ZAJ.jpg",
               "id": 569,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Claudius",
               "gender": 2,
               "credit_id": "52fe43a39251416c7501836b",
               "name": "Kyle MacLachlan",
               "profile_path": "/ykDb80YOPY2HLuRClLDpSYxUCPX.jpg",
               "id": 6677,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Gertrude",
               "gender": 1,
               "credit_id": "52fe43a39251416c7501836f",
               "name": "Diane Venora",
               "profile_path": "/3k7w5Y7gTAxN1JML7jhN8F8rVrS.jpg",
               "id": 6200,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Ghost",
               "gender": 2,
               "credit_id": "52fe43a39251416c75018373",
               "name": "Sam Shepard",
               "profile_path": "/6KincXfDKVQaRHwtX6qMUAwOsR0.jpg",
               "id": 9880,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Ophelia",
               "gender": 1,
               "credit_id": "52fe43a39251416c750183a1",
               "name": "Julia Stiles",
               "profile_path": "/qkCdQIHFDmbxCjp4F1x32qvaXeu.jpg",
               "id": 12041,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Polonius",
               "gender": 2,
               "credit_id": "52fe43a39251416c750183ab",
               "name": "Bill Murray",
               "profile_path": "/7BOoOAIA1CnSzFSVSJP7saniQaB.jpg",
               "id": 1532,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Laertes",
               "gender": 2,
               "credit_id": "52fe43a39251416c750183af",
               "name": "Liev Schreiber",
               "profile_path": "/qFn3npmqd1qaYOk6yohmi3FbPhc.jpg",
               "id": 23626,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Horatio",
               "gender": 2,
               "credit_id": "52fe43a39251416c750183b3",
               "name": "Karl Geary",
               "profile_path": "/cJyQRKyihjOINejTgv5E2vPCrwB.jpg",
               "id": 27176,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Marcella",
               "gender": 1,
               "credit_id": "52fe43a39251416c750183b7",
               "name": "Paula Malcomson",
               "profile_path": "/mqiiy0HXExPYaIczPxWFRDGqhwA.jpg",
               "id": 47533,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Rosencrantz",
               "gender": 2,
               "credit_id": "52fe43a39251416c750183bb",
               "name": "Steve Zahn",
               "profile_path": "/tcRHqtdi4wM8hlZ3MjPDWgePp7L.jpg",
               "id": 18324,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Gravedigger",
               "gender": 2,
               "credit_id": "52fe43a39251416c750183bf",
               "name": "Jeffrey Wright",
               "profile_path": "/wBh9rwK3aRr1hCrSRLxxPHKzGeU.jpg",
               "id": 2954,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Fortinbras",
               "gender": 2,
               "credit_id": "52fe43a39251416c750183c3",
               "name": "Casey Affleck",
               "profile_path": "/kPNMpiZHsAzeQar4DiNsrekwHBU.jpg",
               "id": 1893,
               "order": 11
            },
            {
               "cast_id": 22,
               "character": "Flight Captain",
               "gender": 2,
               "credit_id": "52fe43a39251416c750183c7",
               "name": "Tim Blake Nelson",
               "profile_path": "/tWHHEnnoEU6aNaiFRvl1WLfNTvB.jpg",
               "id": 1462,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43a39251416c75018379",
               "name": "Michael Almereyda",
               "profile_path": "/oiMAcT7GwLXBKTYWLl9FDBqrwHX.jpg",
               "id": 54469,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe43a39251416c7501837f",
               "name": "Amy Hobby",
               "profile_path": null,
               "id": 66593,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43a39251416c75018385",
               "name": "Andrew Fierberg",
               "profile_path": null,
               "id": 66594,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43a39251416c7501838b",
               "name": "Michael Almereyda",
               "profile_path": "/oiMAcT7GwLXBKTYWLl9FDBqrwHX.jpg",
               "id": 54469,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43a39251416c75018391",
               "name": "John de Borman",
               "profile_path": null,
               "id": 24256,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43a39251416c75018397",
               "name": "Carter Burwell",
               "profile_path": "/feAqzRbewe6r2icciqiTeaqzTm4.jpg",
               "id": 1225,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 1,
               "credit_id": "52fe43a39251416c7501839d",
               "name": "Kristina Boden",
               "profile_path": null,
               "id": 47776,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe43a39251416c750183a7",
               "name": "William Shakespeare",
               "profile_path": "/2z4njqosEQM4g26ttb9grG9rJUg.jpg",
               "id": 6210,
               "department": "Writing",
               "job": "Author"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 3.185427,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10688,
      "vote_count": 44,
      "budget": 2000000,
      "overview": "Modern day adaptation of Shakespeare's immortal story about Hamlet's plight to avenge his father's murder in New York City.",
      "similar": [
         334,
         142,
         8545,
         7343,
         425,
         49519,
         1427,
         2288,
         1164,
         1374,
         2024,
         745,
         858,
         101,
         112160,
         44264,
         141,
         634,
         637,
         281957
      ],
      "original_title": "Hamlet",
      "runtime": 112,
      "poster_path": "/rmlOWXqbCOl4HeWhm5Y17KpeqLs.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/sNhxHhbyJ0xo52nr9xI2cJKkWFO.png",
            "name": "Miramax Films",
            "id": 14,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "double A Films",
            "id": 4731,
            "origin_country": ""
         }
      ],
      "release_date": "2000-05-12",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "Passion, Betrayal, Revenge, A hostile takeover is underway.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Michael Almereyda"],
      "runtime": 112,
      "synopsis": null,
      "writers": [
         "William Shakespeare",
         "Michael Almereyda"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0171359/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE1MTE4NjQ3Nl5BMl5BanBnXkFtZTcwMzU5NjUyMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Ethan Hawke, Kyle MacLachlan, Diane Venora | See full cast and crew »"],
      "reviews": [
         "With his stunning new vision of the most revered of Shakespeare's plays, director Michael Almereyda has effectively transposed many of the enduring themes of that classic work to our contemporary hi-tech era. Even if you are not very familiar with Shakespeare's plays or have always been confounded by his verse, one can still appreciate this film for the tremendously inventive ways by which Almereyda has interpreted the core scenes of Hamlet in the context of corporate America. His visually striking translation of scenes like Ophelia's drowning and Hamlet's famous `to be or not to be' soliloquy are a delight and true brain candy. The cast is all around superb, with the classically delivered lines from actors Liev Schreiber (Laertes) and Sam Shepard (Ghost) nicely counterbalancing the very contemporary style of delivery from Ethan Hawk (Hamlet), Bill Murray (Polonius), and Julia Stiles (Ophelia). There will no doubt be much comparison between this film and Baz Luhrmann's flashy modern remake of Romeo and Juliet. However, whereas Luhrmann's film ultimately fails in going beyond the boundaries of its visually striking presentation, Almereyda's Hamlet proves to be far more than a mere spectacle for the senses. In fact, this is the serious flaw that plagues most of the films coming from young, talented independent filmmakers these days: all style, no substance. Well, this Hamlet has both. By setting the film deep in the heart of a very real and very modern steel and concrete American jungle like New York City, which is infused with the relics of the mass media and cold capitalistic consumerism, Almereyda powerfully enhances for the audience the sense of the desolation of his characters that results from urban isolation. This is a theme that Hong Kong director Wong Kar-Wai has so masterfully examined with his films Fallen Angels and Chungking Express. In Hamlet, we get a powerful dose of both Kar-Wai's visual flair and the sensitive, crumbling heart that it sheathes.",
         "Is this Hamlet? Depends on who you ask I suppose. There are some who would require the plot and drama: a son whose inheritance is interrupted, so who may be imagining the murder of his father; a vapid, doting, hedonistic mother; a loyal, by the book counselor, his earnest son and brilliant daughter, she smitten by the prince. A scheming king -- wheels turn and everyone dies. Some would consider the language the essential element. This is the poet's most convoluted, and heavily annotated metaphoric fabric. Shakespeare is most often celebrated for his layering and interelating of mental images, and certainly this work is his most globally elaborate (sorry). But just as the language rides on the drama, the ideas of the play ride on the metaphors. These ideas are life-altering in their starkness: Reality, thought, creation, intent, the cause and validity of unnatural action, relationships among cocreated internal worlds. Much of this is developed in frightening and challenging terms. To my tastes, the ideas are what is important. Too many Hamlets (notably Olivier's)faithfully include the first two and never touch the third. I'd buy a complete abandonment of the first, but cannot see how one could get to the third without most of the second. Now. This film. They have preserved the plot well enough for a film, I suppose. And they have kept the language, about one third of it anyway. The bad: Bill Murray is lost in Polonius, utterly lost. The production quality is poor -- that fits the film school motif (see below), but there is no excuse for the many boom mikes sticking down. They repurposed so much to fit the new setting, so why stick with swords at the end? The biggest complaint is that they missed all the ideas, the big ones. The central example is at the end of the first act, where Hamlet says: `there are more things in heaven and earth, Horatio, than are dreamt of in your philosophy.' Hamlet, and Horatio are students of Wittenburg philosophy, which audiences would have understood as that of the magi Giordano Bruno, martyred by the Pope. (His book is the one Hamlet quotes when asked `what is the matter?,' and Bruno is also quoted in the northnorthwest and hawk from a handsaw lines.) The play has much to do with understanding Bruno's questions of thought and action. When Hamlet differentiates himself from Horatio, the play really starts. In this film, though, the `your' becomes `our.' Why? The Good: This Ophelia is wonderful. I don't know her other work yet, but it includes two other Shakespeare adaptations. She certainly was helped by the woman director, who amplifies the female roles in emotion if not screentime. She even transforms Marcello into a Marcella, Horatio's girlfriend. Rather nice. Also well done is the staging of the Rosenkrantz and Guilderstern dialog. The central device of the film is rather clever, if not original. The play is deeply self-referential. All the rich text about introspection is what is usually cut in the name of modern impatience, and that is the case here. Also gone here is the sharply self-referential scenes of Hamlet lecturing the players. What we have in its place is self-reference about film, and filming. Hamlet and Horatio, indeed R&G and Marcella are all film students. He thinks in film (actually video), and all his ruminations are cast in visual terms, often in the context of video, even a Blockbuster store. The final chorus is in video, and much of the action is seen through surveillance cameras. The play-within-the-play is a homemade video, with clear film-school effects. This is not as clever as it could have been in the hands of a master. (Or when the goals are exceedingly simple as in `American Beauty.') But it is an honest attempt to cast the reflexive depth of the play in cinematic terms. Sam Shepard is the best King Hamlet's ghost I have ever seen. He is a solid blessing. This is a respectable effort, and deserves to be viewed if not celebrated.",
         "Nearly four hundred years after his death, Shakespeare continues to be the best screenwriter in the English language. This beautiful, moody, stylish adaptation of his greatest play is no exception. Another wonderful thing about the Bard is how his drama seems to elevate any actor willing to take on the challenge. I especially enjoyed Bill Murray as Polonius: his performance was all the more delightful because of the necessity of restraining his comic genius here; he appears always on the edge of cracking a joke, and of course doesn't, adding even more tension to an already extremely taught production. But what I loved most about this movie was how it departed from the usual staging conventions (medieval costume, stone castles) to get at the heart of what the play is really about: a kid coming home on a college break and discovering that his uncle has murdered his father and is having sex with his mother. Ethan Hawke does a fantastic job in the role, giving us the brooding, confused, lovesick, and ultimately self-destructive adolescent that Shakespeare intended. If I were a high-school English teacher, this is the Hamlet that I would want to show my students.",
         "First of all, this is a beautiful film. It does however, have many weak points. It is very reminiscent of the Leonardo DiCaprio version of Romeo and Juliet; but somehow it is not as powerful. Ethan Hawke bursts of adequatulence as Hamlet, but nothing more. Although he says his lines with true emotion, it doesn't seem like he understands what he is saying. The only true Shakespearin actor is Liev Schreiber (you'll recognize him from Scream. His portrayal of Laertes helps the viewer understand what is going on in the film; while the other actors manage only to confuse. It doesn't help that a great portion of the play; including the famous graveyard scene; are left out. Unlike Romeo and Juliet, modernization of Hamlet doesn't work well, at least not in this adaptation. Switching from swords to guns changes the plotline too much. For someone who hasn't read Hamlet, or seen another version, it might be hard to understand the plotline, especially becuase the audio tack is poor and muddled by traffic and background noise. On the other hand, those that are familiar with Hamlet may be disappointed with the performances and with the editing of the play. Although it may be a little long, I would recommend the Kenneth Branagh version of Hamlet to someone who wants to see a true vision of what Hamlet could be.",
         "Ethan Hawke, Kyle MacLachlan, Sam Shepard, Diane Venora, Bill Murray, Liev Schreiber, Julia Stiles, Karl Geary; directed by Michael Almereyda, loosely based on the play by the Immortal William Shakespeare This is not your father's Hamlet, and really not your Hamlet either. Set in modern day New York City, this adaptation by director Michael Almereyda attempts to blend the all time classic with a modern day lifestyle, while retaining the traditional speech and lines of the play. Unintentionally comical for those familiar with the piece, it actually is able to combine the two worlds of twentieth century New York and sixteenth century Denmark quite well. However this is also the movies downfall, as only with a working knowledge of the classic are you able to understand the modern work, otherwise it is completely incoherent, with vital cogs of the plot missing. Denmark is no longer a country but now a corporation, Cladius (MacLachlan) not a King, but now a CEO. Computers and video are now the norm, as this is how the movie begins. Polonius (Murray) is both the best character and also probably miscast, as he would have done much better in a cameo as the gravedigger, a scene that is deleted entirely! This gem and other scenes were deleted in order to pare down the length of the film, while attempting to preserve all major known lines. Yet, as earlier mentioned, for those who do not have a strong background in the classical work, you will be quickly lost. The so-called 'fluff' that the producers thought Shakespeare used actually made the tale so brilliant, relevant, and understandable. The modern work is none of these, only an ancillary piece for those with a vast Hamlet knowledge. The major scenes are also greatly adapted to fit the environment, mostly to no effect. Most of the movie occurs in high-rise apartments or board rooms, giving it an awkward type of feel. With Hamlet (Hawke) and Ophelia (Stiles) being constantly watched in a city such as New York, i thought I was observing a Mafia film, as indeed that is what the Denmark corporation felt like, killing of Old Hamlet and all. Maybe that adaptation could've been a better fit, for the reduced length also makes the piece less-watchable, and much more bland with none of the intrigue. The murder of Polonius in the laundromat, Old Hamlet being seen on a security camera, and Ophelia committing suicide in a Guggenheim fountain just does not have the same feel, something is definitely missing. In all this film likely misses both it's core audience and lacks the mass-market appeal that it was trying for. If a full four-hour version was released word-for-word of the original work, it would likely be a cult classic, as it has the makings of a strong work. In all honesty, how can such a great work like Hamlet be lacking if shown in its entirety? In the attempt for a higher box-office, the two hour version has no soul. If you find yourself in Blockbuster and face the same question as Hamlet, of whether this version is 'To be or not to be' showing on your TV that night, most likely it is not to be. However, if you are a teenage girl and enjoy looking at Ethan Hawke, or a Shakespeare aficionado who wishes to laugh at some unintentional humor, this could be the ticket. A shame that more did not come out of such a great cast, interesting premise, and mother of all base material in Shakespeare. Either Almereyda or the Miramax really missed the boat with this one.",
         "Here is the first film version of Hamlet to come along in modern New York. The director's use of New York is fun to watch for this native New Yorker, although how a limo can quickly move from 42nd St. between Broadway and Eighth Avenue to 48th St. and Sixth Avenue is beyond me. But asisde from that, all we care about when we see Hamlet is how is the text handled, by both the director and the cast. The director, Michael Almereyda, has cut into the script and most of the film runs surprising lean for something that runs one hour, fifty-three minutes. His use of short films in the background, speaker phones, TV's and the like run the gambit from ingeneous to \"Give me a BREAK!\" The casting however is inconsitent, for which we can certainly blame the director. Ethan Hawke, in the title role, has drive and energy. But if anybody remembers the TV show \"The Critic\", when they had Keanu Reeves doing Hamlet, then you know what I'm thinking. The words \"Dude\" and \"Whoa\" seems ready to break into Hawke's speeches at anytime. The complexity is replaced by a whiny \"I'm in pain, but I'm cool\" attitude for the bulk of the film and it doesn't really work. The mumbling of at least a fourth of his lines doesn't help either. He works better in silence, brooding. The silence works even better for Julia Styles as Ophelia. When quiet, the pain of abandonment and loss is heartfelt. Then she opens her mouth, and the lack of a developed character as well as an appalling lack of command of Shakespeare's words is obvious. Ophelia, never mind getting thee to a nunnery, get thee \"Beverly Hills, 90210\", GO! Bill Murray veers form earnestness to his Lounge Singer's act from \"SNL\" when doing Polonius. I know the role was suppose to be for comic relief. But after a while, everything Murray says is funny- intenionally or otherwise. Kyle McLaughlin, as Claudius, doesn't fare much better. There is little distinction in his line readings, and in the end, he just comes off as a one-trick pony. Diane Verona is marginally better as Gertrude. The attitude is there, as is the pain, but her line readings lack a freshness to them. The standouts are Sam Sheppard as the Ghost, Steve Zahn and Dechen Thurman as Rosencrnatz & Guildenstern, and especially Liev Schrieber as Laertes. Schrieber in paricularly as the energy, clearity, and believabilty that makes you wonder what if he played Hamlet instead of Schrieber. We probably would have had a better movie.",
         "Shakespeare has arrived in the moneyed world of New York, and I think he likes it. What particularly struck me about this film was some of the imagery and devices. Reflections are everywhere, not just in Hamlet's soliloquies: glass windows, mirrors, water, even the video screen. If we exist only in the eyes of others (J-P Sartre), then everything in this film is granted existence, even Hamlet's madness, because we see it through so many media and reflections. Hamlet's \"play within a play\" becomes a film, not something ephemeral, but a strip of celluloid that will last past his death, just as this play has survived so many centuries after Shakespeare's time.",
         "I thought this film was absolutley brilliant. Almereyda, so captured Shakespeare's profound insight into human nature and motivation. I have NEVER liked modern productions of Shakespeare, either on film or the stage. But this vision was extraordianary in illustrating that Shakespeare's observations are truly timeless, and he knew far, far more about human nature than Freud or Jung or any modern psychologist! Almereyda's direction was superb. His Hamlet was so contemporary .... so the sulking, modern, slacker, malcontent, and it captured the spirit of Hamlet beautifully (as did Ethan Hawke's rather astonishing performance). In addition, every word Ophelia uttered, sounded so like an overwrought, emotional, girl of this age....and yet not of word of The Bard's was changed. Almereyda's use of video, modern branding and icons, were also brilliant....and he used the wonderful Carter Burwell to score his film. There is so much more to say, but, you get the picture. I loved it, as did my 13 year old son. And, as \"brevity is the soul of wit,\" (Polonius) I will end by simply saying......bravo Almereyda!",
         "I cannot recommend this film enough. Although I can see where the abridged text might put purists off of this very stylistic modern interpretation one of the bards most famous plays, I found it to be the most poetic and honest cinematic Hamlet yet. Ethan Hawke plays hamlet much like he plays his other roles, with over sensitivity, intelligence, and a strong sense of futility. His talents are aptly used in this version of Hamlet where instead of seeming like an ancient warrior prince Hamlet seems to be a fairly normal, if rich, art student caught up in an impossible circumstance. The acting overall is worth noting as is the ingenious use of technology. However since the films praises have already been well sung on those counts by others, I'll mention how the film felt. It took me a little while to suspend disbelief. As the film establishes itself with mentions of \"Denmark\" corp. and \"Elsinore\" condos it leaves you very aware that you are watching an unusual production of the famous play. Likewise, at the begining of the movie I found myself identifying all of the actors like a tourist, \"That's Bill Murray, Hey is that Kyle McLaughlin?\" etc... but it didn't take as long as one might think to become totally caught up things. And I did become completely caught up even though I'm fairly familiar with the play. The best way I can describe it is to say that in other versions of this and the bards other plays one is often more familiar with the speeches and the poetry than with the characters as living breathing people. Hamlet 2000 made me feel genuine hatred for Claudius and sorrow for Hamlet. The Elizabethan English with American accents and cadence seemed more natural to the ear than the bold theatrical speak that most Shakespearian films seem to think is a requisite. I think the people who take their literature like medicine because it is good for them will be sorely dissapointed by how enjoyable this movie is but in my opinion it is an excellent balance between the beauty of Shakespeare's text as text and the exciting story contained within.",
         "Hamlet is a truly exciting movie. I took and nine year old and seven year old to see it, and afterwards they retold me the basic story and COMPLETELY understood it. Mad props to director Almereyda for having such strong visuals that also told the story. It is a great introduction to Shakespeare for young people who just can't dig the old \"British\" f***s in tights doing Shakespeare. The acting was terrific. I hope old stodgey Shakespeare fans will open their minds to these refreshing and innovative takes on the characters, such as how Bill Murray did Polonius. I totally agree with Elvis Mitchell of N.Y.Times in his review of Bill Murray. Ethan Hawke was perfect as Hamlet. Julia Stiles was really engaging, especially her flip-out scene at Guggenheim. Sam Shepard and Dianne Venora were brilliant. A must see."
      ],
      "genres": [
         "Drama",
         "Romance",
         "Thriller"
      ],
      "productionCompanies": ["double A Films"],
      "summaries": [
         "New York, 2000. A specter in the guise of the newly-dead CEO of Denmark Corporation appears to Hamlet, tells of murder most foul, demands revenge, and identifies the killer as Claudius, the new head of Denmark, Hamlet's uncle and now step-father. Hamlet must determine if the ghost is truly his father, and if Claudius did the deed. To buy time, Hamlet feigns madness; to catch his uncle's conscience, he invites him to watch a film he's made that shows a tale of murder. Finally convinced of Claudius's guilt, Hamlet must avenge his father. Claudius now knows Hamlet is a threat and even uses Ophelia, Hamlet's love, in his own plots against the young man. Murder will out?",
         "Modern-day New York City adaptation of Shakespeare's immortal story about Hamlet's plight to avenge his father's murder."
      ],
      "budget": 2000000
   },
   "movielensId": 3598,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-05-12",
      "dvdReleaseDate": "2001-04-17",
      "directors": ["Michael Almereyda"],
      "runtime": 112,
      "movieId": 3598,
      "title": "Hamlet",
      "mpaa": "",
      "actors": [
         "Ethan Hawke",
         "Kyle MacLachlan",
         "Diane Venora",
         "Sam Shepard",
         "Julia Stiles",
         "Bill Murray",
         "Liev Schreiber",
         "Karl Geary",
         "Paula Malcomson",
         "Steve Zahn",
         "Jeffrey Wright",
         "Casey Affleck",
         "Tim Blake Nelson"
      ],
      "imdbMovieId": "0171359",
      "originalTitle": "Hamlet",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["F39CYBE6-Kg"],
      "plotSummary": "Modern day adaptation of Shakespeare's immortal story about Hamlet's plight to avenge his father's murder in New York City.",
      "tmdbMovieId": 10688,
      "avgRating": 3.40558,
      "releaseYear": "2000",
      "numRatings": 1308,
      "posterPath": "/jV6K44B3dI7WvJKOEOVH4JMsUSt.jpg"
   }
}