{
   "tmdb": {
      "original_language": "es",
      "keywords": [
         {
            "name": "children",
            "id": 10103
         },
         {
            "name": "classic",
            "id": 11020
         }
      ],
      "imdb_id": "tt0071288",
      "video": false,
      "title": "The Castaway Cowboy",
      "recommendations": [],
      "backdrop_path": "/s6agAYQhBUQkAjW5mlbMLK2j3bK.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Lincoln Costain",
               "gender": 2,
               "credit_id": "52fe47ba9251416c91073d3f",
               "name": "James Garner",
               "profile_path": "/ek70DefEq6LZZX3JyUjJ125q63f.jpg",
               "id": 16896,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Henrietta MacAvoy",
               "gender": 1,
               "credit_id": "52fe47ba9251416c91073d43",
               "name": "Vera Miles",
               "profile_path": "/qWP9L969DOSFgBhRV2Ik2ve8Z4r.jpg",
               "id": 7303,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Booton 'Little Maca' MacAvoy",
               "gender": 2,
               "credit_id": "52fe47ba9251416c91073d47",
               "name": "Eric Shea",
               "profile_path": "/h1mTZMnUeHTEm54L0hw3pRjC9hA.jpg",
               "id": 7635,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 2,
               "credit_id": "55851dfbc3a368502400250e",
               "name": "Robert Culp",
               "profile_path": "/ht4lgqWv7zspSQv5XQeukJV4a23.jpg",
               "id": 73022,
               "order": 3
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe47ba9251416c91073d4d",
            "name": "Vincent McEveety",
            "profile_path": null,
            "id": 15657,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Western",
            "id": 37
         }
      ],
      "popularity": 0.49261,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 80351,
      "vote_count": 5,
      "budget": 0,
      "overview": "Wayward Texas cowboy (James Garner) washes up on the beaches of Hawaii and is taken home by an fatherless boy. He saves the family's business while romancing the single mom (Vera Miles).",
      "similar": [
         150540,
         601,
         630,
         342473,
         394823,
         15121,
         9355,
         15373,
         20352,
         77949,
         46705,
         298312,
         394117,
         10320,
         11637,
         137116,
         5123,
         290637,
         9339,
         10708
      ],
      "original_title": "The Castaway Cowboy",
      "runtime": 91,
      "poster_path": "/93C3EgfpfAFMUDHxsvq2M6SlknB.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Walt Disney Productions",
         "id": 3166,
         "origin_country": ""
      }],
      "release_date": "1974-08-01",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "Wayward Texas Cowboy in Hawaii",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Vincent McEveety"],
      "runtime": 91,
      "synopsis": null,
      "writers": [
         "Don Tait",
         "Richard M. Bluel"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0071288/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTcyODg2NzYzM15BMl5BanBnXkFtZTcwNzY4NTUyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: James Garner, Vera Miles, Robert Culp | See full cast and crew »"],
      "reviews": [
         "Having been to Hawaii and actually going through the famous Parker ranch on the big island, I'm in a better position to comment on this film now than before. The Castaway Cowboy is one of two films James Garner made for the Disney studio in the Seventies. He's a Texas cowboy who got himself shanghaied in San Francisco and jumped ship and washed ashore on Kaui. Right into the arms of widow Vera Miles and her son Eric Shea who are struggling to make a living as farmers. A lot of wild cattle keep trampling up their crops. So Garner gets the idea that they ought to start cattle ranching instead. Of course the Hawaiian farm hands don't readily take to the American cowboy culture. Of course they eventually do in the end. Cattle came to Hawaii courtesy of British explorer George Vancouver who left them on the big island. It was the descendants of those cattle with which John Parker founded his ranch. No doubt some of them made it to the smaller islands in the chain. Of course there's a villain in the piece and it's Robert Culp. He's a banker with eyes to grab Vera Miles land and maybe Vera herself. Culp does resist the tendency to model his performance on Snidely Whiplash and he's a worthy rival of the resourceful Garner. Of course there are paternalistic attitudes towards the native Hawaiians. But if you want to see a serious film about those attitudes than watch the film made of James Michener's novel Hawaii. This is a Disney family product and doesn't pretend to be social commentary. The Castaway Cowboy is a good entertainment. How could it be anything else with James Garner starring.",
         "It has the benefit of being one of the most Kauai-intensive movies ever filmed. Not only was 90% of the movie actually made on that beautiful Hawaiian island, but it's actually SET there, too -- and there are very few movies both shot AND set in Hawaii. The photography is excellent; the score is very good (but would have been better with a little more island influence), and the use of the Kauai locations, though limited to just a few, is first-rate. Garner is fine, and Culp makes a good, if foggily-motivated, villain. However, the attitude toward the Hawaiians is painfully paternalistic, and there's a stupid, TRULY stupid, subplot involving \"sorcery\" and some extremely improbable caves, full of Tahitian statuary. Very bad idea. Historically, it's a bit muddled; much is made of the idea that no one has found a way to load cattle aboard a schooner at this time. (Somewhere around 1870, I guess.) But over on the Big Island, this problem had been licked, and the founder of the Parker Ranch was already getting rich selling King Kamehameha's \"big dogs. If the script had been better, with a less predictable story, THE CASTAWAY COWBOY could have been a little gem. As it is, it's mostly a pretty time-passer.",
         "Wayward Texas cowboy James Garner (as Lincoln Costain) washes up on the beaches of Hawaii, is taken home by fatherless (hint, hint!) young Eric Shea (as Booton MacAvoy), meets tightly-outfitted single mom Vera Miles (as Henrietta), helps her ward off slimy suitor Robert Culp (as Calvin Bryson), and saves the family's business. The English performers speak to the smiling Hawaiians like they are mentally retarded; apparently, with good reason. Mr. Garner unfavorably compares them to schoolgirls and Ms. Miles notes, \"They do like their fun!\" One of them is handy with the spear, so Garner better watch his back! **** The Castaway Cowboy (8/1/74) Vincent McEveety ~ James Garner, Eric Shea, Vera Miles, Robert Culp",
         "James Garner and the Disney Corporation may not sound like a likely mix, but it did happen - twice, as a matter of fact. In 1973, Garner and Disney made a two movie agreement. Garner was looking for flavorful movie vehicles, and Disney was looking for a major star in order to regain the audience it had lost since Walt Disney's death several years earlier. But everyone's expectations were not met. The first movie, \"One Little Indian\", did not wow critics or audiences, and the same fate was met with \"The Castaway Cowboy\". It has an interesting premise - starting a cattle ranch in Hawaii during the days cowboys were kings - but the execution is severely lacking. It has a real sedate, almost boring tone for the most part. Both kids and adults will be restless. Almost nothing is done with Robert Culp's villain character - his footage can't add up to more than five minutes. It's only Garner's charisma that saves the movie from total decay, but even he can only do so much. Word of warning to parents: While the movie got a \"G\" rating in 1974, the movie would get a \"PG\" rating today due to a couple of violent fistfights.",
         "Never heard of this before? No, nor had i until recently. There's a good reason for that. The premise sounds intriguing but the plot is ultra-predictable. The pace is heavy and slow with lots of shouty Disney voices and long, loud boring scenes of cows being rounded up. Plot spoiler alert : Cowboy washes up in Hawaii. Ends up in house of widow and her young son looking for a father figure. Can you see where this is going? The widow runs a potato farm that is under invasion from pests. What kind of pests? No, not flies or birds - but cattle! But hey - guess who knows how to round up cattle and save the day? But he can't do it single handed.. Cue wacky scenes of Garner recruiting the Hawaiian locals to become cowboys. One of them even jumps on the saddle facing the wrong way! The film seems to think the Hawaiian locals are that stupid. For a short film it really drags and feels more like a 50s western in tone than 1974 when it was made. You'd think Sergio Leone and McCabe and Mrs Miller had never happened. The best thing about it is a brief, strange foray into witchcraft when the jealous villain of the picture hires the local witchdoctor to curse the cattle venture and Garner follows him to his voodoo style cave dwelling which feels like a Sinbad movie set. For that (and the nice warm exotica opening theme) i bump up my review to 6 stars. Otherwise i got so bored i watched the second half on fast forward and could still tell every single thing that was going on."
      ],
      "genres": [
         "Family",
         "Comedy",
         "Western"
      ],
      "productionCompanies": ["Walt Disney Productions"],
      "summaries": ["A Texas cowboy is rescued at sea by a 12-year-old boy. While he waits to return home, he decides to help out his rescuer's family."],
      "budget": 0
   },
   "movielensId": 3601,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "1974-08-01",
      "dvdReleaseDate": "2000-05-02",
      "directors": ["Vincent McEveety"],
      "runtime": 91,
      "movieId": 3601,
      "title": "The Castaway Cowboy",
      "mpaa": "",
      "actors": [
         "James Garner",
         "Vera Miles",
         "Eric Shea",
         "Robert Culp"
      ],
      "imdbMovieId": "0071288",
      "originalTitle": "The Castaway Cowboy",
      "genres": [
         "Adventure",
         "Family",
         "Comedy",
         "Western"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Wayward Texas cowboy (James Garner) washes up on the beaches of Hawaii and is taken home by an fatherless boy. He saves the family's business while romancing the single mom (Vera Miles).",
      "tmdbMovieId": 80351,
      "avgRating": 3.01389,
      "releaseYear": "1974",
      "numRatings": 36,
      "posterPath": "/93C3EgfpfAFMUDHxsvq2M6SlknB.jpg"
   }
}