{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "gay",
         "id": 237
      }],
      "imdb_id": "tt0064363",
      "video": false,
      "title": "The Gay Deceivers",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Danny Devlin",
               "gender": 2,
               "credit_id": "52fe4d02c3a368484e1d2085",
               "name": "Kevin Coughlin",
               "profile_path": "/3reWCeaZLSvW4NYgwZOtwvq2oku.jpg",
               "id": 132704,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Karen",
               "gender": 1,
               "credit_id": "52fe4d02c3a368484e1d2089",
               "name": "Brooke Bundy",
               "profile_path": "/hbmv1jHZNNb7AmpdW8oaMIk3jXs.jpg",
               "id": 72157,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Elliot Crane (as Larry Casey)",
               "gender": 0,
               "credit_id": "58fbe15bc3a3687a03013e3b",
               "name": "Lawrence P. Casey",
               "profile_path": null,
               "id": 1425467,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Leslie Devlin",
               "gender": 1,
               "credit_id": "52fe4d02c3a368484e1d2091",
               "name": "Jo Ann Harris",
               "profile_path": "/2dIQ7hr7UE4ZkfJqMDtgwhsBnLz.jpg",
               "id": 100634,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Malcolm",
               "gender": 0,
               "credit_id": "52fe4d02c3a368484e1d2095",
               "name": "Michael Greer",
               "profile_path": null,
               "id": 92838,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Craig",
               "gender": 0,
               "credit_id": "58fbe18ac3a36879db016519",
               "name": "Sebastian Brook",
               "profile_path": null,
               "id": 100158,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Colonel Dixon",
               "gender": 2,
               "credit_id": "58fbe1b992514163f501596b",
               "name": "Jack Starrett",
               "profile_path": "/lRoMV6jdldDmUasIYKlxcmmDpLJ.jpg",
               "id": 16556,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Mr. Devlin",
               "gender": 2,
               "credit_id": "58fbe1c3c3a36879db01655d",
               "name": "Richard Webb",
               "profile_path": "/n5uFxSSi6mEzAarMNk6uDrdxKo3.jpg",
               "id": 10161,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Mrs. Devlin",
               "gender": 1,
               "credit_id": "58fbe1d0c3a3687a03013ebd",
               "name": "Eloise Hardt",
               "profile_path": null,
               "id": 153315,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Psychiatrist (as Mike Kopcha)",
               "gender": 2,
               "credit_id": "58fbe1e4c3a3687984015ddb",
               "name": "Dean Cromer",
               "profile_path": null,
               "id": 1143091,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Sergeant Kravits",
               "gender": 2,
               "credit_id": "58fbe1f3c3a36879db016591",
               "name": "Joe Tornatore",
               "profile_path": null,
               "id": 84978,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Sheryl",
               "gender": 0,
               "credit_id": "58fbe203925141640b015749",
               "name": "Randee Lynne Jensen",
               "profile_path": null,
               "id": 1333852,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Laverne",
               "gender": 0,
               "credit_id": "58fbe20e925141642f015972",
               "name": "Lenore Stevens",
               "profile_path": null,
               "id": 161358,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Girl in Bikini (uncredited)",
               "gender": 1,
               "credit_id": "58fbe21dc3a3687a2a014708",
               "name": "Candice Rialson",
               "profile_path": "/jIuVB6vYDxKvqMvA2d4aFRm89AD.jpg",
               "id": 105072,
               "order": 14
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4d02c3a368484e1d2081",
            "name": "Bruce Kessler",
            "profile_path": null,
            "id": 100629,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.609176,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 205054,
      "vote_count": 1,
      "budget": 0,
      "overview": "Danny and Elliot avoid military service by pretending to be gay, but they have to act the part when the recruiting officer doesn't buy it.",
      "similar": [
         449176,
         184352,
         10938,
         11000,
         26280,
         10806,
         383526,
         338189,
         26371,
         26933,
         380874,
         376867,
         47643,
         258034,
         428493,
         160165,
         9800,
         1213,
         142,
         1966
      ],
      "original_title": "The Gay Deceivers",
      "runtime": 97,
      "poster_path": "/8WyfCLc11EWWQJ3Rmjiv4Xy0EHX.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Fanfare Films",
         "id": 5316,
         "origin_country": ""
      }],
      "release_date": "1969-07-30",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "Is he? Or isn't he?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Bruce Kessler"],
      "runtime": 97,
      "synopsis": null,
      "writers": [
         "Abe Polsky",
         "Gil Lasky"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0064363/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcyNTg4MTE4Ml5BMl5BanBnXkFtZTcwNDUxMTI1MQ@@._V1_SY317_CR10,0,214,317_AL_.jpg",
      "actors": ["Stars: Kevin Coughlin, Brooke Bundy, Lawrence P. Casey | See full cast and crew »"],
      "reviews": [
         "I thought it was funny and cute (although I hate to use that particular word for it). Okay, as a big fan of the late Kevin Coughlin, I admit to being somewhat biased, but not so much as to not recognize a bad movie when I see one. While I'm sure some will complain that it's portrayal of gays is stereotyped and offensive, you have to remember that it was made in 1969! That was a time when Paul Lynde was forced to play the frustrated father of teenagers in movies and sitcoms. For a movie to admit the existence of gays as anything other than the villains who killed \"because they are sick and depraved\" or some such nonsense, was a big step in the right direction. In this movie the straight guys become friends with their gay landlord and his lover, while the Straight guys' friends and families are judgmental and in at least one case malicious. So, please cut them some slack for at least trying to present the gay characters as decent, kind people even if their wrists are a tad limp!",
         "If seen now by young people who weren't old enough to have lived during the Viet-Nam War, this film will seem \"small\" and out-dated. But, when this film was released in 1969 at the peak of the war, this was not only a very funny film, but a sad reality of the society of the times. Sad in the fact that some draft-age males would make believe they were gay to avoid going to Viet-Nam. Made slightly before the Gay Liberation movement, this film gives a surprisingly sensitive view of the gay lifestyle and gay community of this era. Micheal Greer gives an academy award winning performance (he wasn't even nominated)as the gay landlord, Malcom DeJohn; in one of the screens funniest, yet sensitive performances. DeJohn is best remembered as \"Queenie\" in the brutal prison film, Fortune in Men's Eyes. The stars of the show, Kevin Coughlin as Danny and Lawrence Casey as Elliot give fresh, intense, and emotional edged performances as men living with the fear of the war lurking over their shoulders. Also wonderful supporting roles by Sebastian Brook and veteran character actor Jack Starrett. The Gay Deceivers captures a time in American history that has been forgotten. Yet, today's headlines have made this film worthwhile today. The Gay Deceivers is not deceiving at all, I rate it a 10 out of 10.",
         "This little movie, from the end of the 1960s, is perhaps one of the finest \"gay\" films ever made. It certainly ranks among my Top Five favorites of the genre. Two straight guys wanting to avoid the draft for Vietnam, decide to play gay. Seems like a silly idea for a movie, and it is, but despite the premise and the usual stereotypes (typical of the period) it really is harmless and lots of fun. The two lead male actors are fine, and their female counterparts do quite well too. The star of this show, however, is Michael Greer, who is superb as the \"gay landlord\". His character is pretty much an extreme stereotype, but so what? He plays it to perfection, and is probably the most interesting character in the whole film. The scene where he accuses an older woman of trampling his flower bed is the singular most funny scene in the whole movie, and it's all because of his delivery. Other nifty aspects about this film: the the 60s views of a gay bar (with the Tom of Finland-esque drawings along the walls), the views of L.A. from the time, and the really dated fashions/styles. A fun movie, definitely worth a look if you like \"gay\" films as a genre, or just amusing \"cult\" type films.",
         "The impact of this film recently became clear to me when I realized that having seen it only once, nearly 25 years ago, I was still thinking of it. It has become part of my internal landscape, and I tend to compare every comedic treatment of gays on film to my memory of The Gay Deceivers. It is rather sad to think that the best and probably most honest comedy about gay life in America was made so long ago, and in a time when homosexuality was still rarely hinted at in main-stream cinema. See this rare and wonderful film if you can -- urge your local film festival, art house or PBS station to acquire the rights to screen it. It deserves to be rediscovered by a new generation.",
         "Much underrated comedy masterpiece, profoundly relevant, compassionate and witty. One of the greatest American comedies, a true work of pop art. Unique and unmatched. All performances are great, particularly Michael Greer and the late Kevin Coughlin (1945-76). Director Bruce Kessler's deserves a lot of credit. Cinematography is very fine, as is the music. This great film is STILL ahead of its time, misunderstood by both straights and some gays. The Gay Deceivers should be required viewing at colleges. No other film raises so many important social issues and does it with such grace, simplicity and charm. Although the film was very successful at the time, it has been totally forgotten, and can be found at a handful of video stores (\"Video West\") in West and North Hollywood. It is particularly puzzling, that Kevin Coughlin's movie career should have ended after this, his most successful film. His obituary states that he worked in European cinema in the seventies, but I have been unable to unearth any information about it.",
         "So two guys try to convince the army that they are gay to avoid being sent off to war. Of course, they decide they have to move in together, next door to the queeny landlord. Michael Greer should have received SOME award for this work. Lawrence Casey and Christopher Riordan were pretty much just hired to spend the movie with their shirts off. Kevin Coughlin and his big blue eyes do a great job in a very believe-able role. Watch out - that drag queen at the party is the butchest one in the flick. On the DVD from Dark Sky Films, there is a funny bonus interview with director Bruce Kessler. The big difference between this film and ones like \"Chuck & Larry\" or \"Partners\" is that this one treats the actual gays living in their natural habitat with a lot of respect, albeit with some stereotypes (the pink, the nudes, the ascots). I understand... at that time, that's how you knew who was gay and who was not. Fun for the most part. They spend so much time worrying about getting caught by their family, friends, or the army, that its a little more serious than it needs to be. Also some frontal female nudity and butt shots. Hats off to the actors for having the guts to make it.",
         "When \"I Now Pronounce You Chuck and Larry\" came out in the summer of 2007, it jogged my memory about a movie called \"The Gay Deceivers\" that was out when I was in junior high and which I was too young to see. Netflix didn't own a copy, but evidently they keep track of who inquires on movies they don't have and send it out when they get it. So boom, \"The Gay Deceivers\" arrives by surprise in my mailbox six months later. Regarding the review headlined, \"Offensive and Unfunny\", I'm going to say just one thing, in my campiest voice, \"Oh Mary, lighten up\". (How dare they make a movie in 1969 that offends my 21st century sensitivities!) Yes, some of it is hard to watch, maybe for me especially. It was made about the time of my sexual awakening, and some of the stereotypes depicted underscored for me why I had grown up with so much internalized homophobia. But they were making a farce and all they had to work with was how gays were perceived at the time. It's a little too much to expect them to have transcended the thinking of the time in which it was filmed. But on the other hand, some of it is still laugh out loud funny. Especially the scene where Michael Greer makes breakfast. I laughed, then I turned to my partner of fifteen years and said, \"I suppose as a gay man I ought to be offended, but it's just so silly!\"",
         "\"The Gay Deceivers\" is definitely an odd movie for its time, as in 1969, gay-themed films were certainly NOT mainstream. Now by today's standards the film is ridiculously campy and stereotypical, but it was still a very bold departure for its time. The film begins with two friends (Kevin Coughlin and Larry Casey) pretending to be gay in order to avoid being drafted and sent to Vietnam. Their ruse seems to work, but later one of them sees a fellow from the draft board nosing around so they decide to go all the way--moving in together and pretending to be a couple. They live in a very gay-friendly apartment complex and soon are accepted by their EXTREMELY stereotypical neighbors. And, over time, it becomes less and less certain to those around them that they are actually straight and it's interesting to see how their friends turn against them. I am sure some will blanch at the antics of these gay characters and the language used to describe gays--but considering the time, it was still a rather bold film. It was clearly anti-Vietnam when this wasn't popular and even talking about homosexuality in ANY way was quite unusual. I also thought that it was rather funny--not brilliantly funny but a cute little spoof. I also particularly liked the final scene--you just have to see that one for yourself. A bit offensive, but in this era of extreme over-sensitivity, I think we could use a few films like this. By the way, the film has a bit of nudity here and there.",
         "I thought this was a terrific movie.I'm very sorry to say that Michael Greer of Fortune And Men's Eyes fame died last year of lung cancer.I was devistated.I was such a big fan of his.He was a great actor,and I read alot about him.He was a comedien as well as an actor.This was Greer's first movie,and he did a great job.This movie was made in 1969,about two men who escape the army by pretending to be gay.I thought it was very funny.I have not seen many 60's movies,very few actually,but this one was a great.Watch it,you'll love it!",
         "I just thought of this film after about forty years and remembered it as a real funny feature picture. So, naturally, I went on IMDb and looked it up. I was surprised that the first(rotating?)review was bad and remembered how original and funny a story and movie it was. So, I clicked on \"More reviews\" and was glad to see that I was right. Maybe the one reviewer was not about to get drafted at the time as I was, and I faced going straight (no pun intended) to Nam. I saw it with friends most of whom I suppose were straight. Some were filmmakers and we just 'broke a gut' laughing. And the thing is, the entire audience was laughing just as hard in a major Hollywood theater, as they would have in a small art house. The only (SPOILER)in this review is really not much of a spoiler; it's just describing a neat scene. I just did not want to spoil it for someone lucky enough to see the movie if it is ever brought back. The scene is that funny. So just in case this movie is not re-released for TV or rental, and if tomorrow, Televangilist Pat Robertson is made America's censor, here goes ... It is the visual that is hilarious. Of course the straight boys have to invite their parents to see their one-bedroom apartment. In the boys deception they have had to leave it furnished just as it had been before their taking possession from the very gay prior tenants. They were unable to change anything because they were being investigated by the draft board, who did not believe that they were gay, which of course they were not. When the parents and younger brothers and sisters (I think) walked into the one bedroom, THAT THE BOYS WERE SHARING; I and everyone in the theater were laughing so hard, one could not hear the dialog; that is, if the actors were even talking. Picture a bedroom decorated like a '30s or '40s musical, or as my late parents used to love .. operetta movies featuring women's themes, with titles like, \"Up in Central Park\" and \"Naughty Marietta\" with Jeanette MacDonald and Nelson Eddy. Oh, how I hated those films as a kid. A bedroom decorated so strongly that it shouted-out, \"Ths is a women's room.\" But what got the most screams of laughter was THE BOY'S BIG RED VELVET BED THAT THEY SHARED ... SHAPED LIKE A HUGE HART!!! I remember that today, forty years later! Great, funny film; I wish they would bring it back."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Fanfare Films"],
      "summaries": ["Danny and Elliot avoid military service by pretending to be gay, but they have to act the part when the recruiting officer doesn't buy it."],
      "budget": 0
   },
   "movielensId": 3603,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1969-07-30",
      "dvdReleaseDate": "2000-05-02",
      "directors": ["Bruce Kessler"],
      "runtime": 97,
      "movieId": 3603,
      "title": "The Gay Deceivers",
      "mpaa": "",
      "actors": [
         "Kevin Coughlin",
         "Brooke Bundy",
         "Lawrence P. Casey",
         "Jo Ann Harris",
         "Michael Greer",
         "Sebastian Brook",
         "Jack Starrett",
         "Richard Webb",
         "Eloise Hardt",
         "Dean Cromer",
         "Joe Tornatore",
         "Randee Lynne Jensen",
         "Lenore Stevens",
         "Candice Rialson"
      ],
      "imdbMovieId": "0064363",
      "originalTitle": "The Gay Deceivers",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [
         "pMdkg4qDISs",
         "APHMaBnVo64"
      ],
      "plotSummary": "Danny and Elliot avoid military service by pretending to be gay, but they have to act the part when the recruiting officer doesn't buy it.",
      "tmdbMovieId": 205054,
      "avgRating": 2.3913,
      "releaseYear": "1969",
      "numRatings": 23,
      "posterPath": "/8WyfCLc11EWWQJ3Rmjiv4Xy0EHX.jpg"
   }
}