{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "musical",
            "id": 4344
         },
         {
            "name": "u.s. navy",
            "id": 4410
         },
         {
            "name": "turnstile",
            "id": 196396
         }
      ],
      "imdb_id": "tt0041716",
      "video": false,
      "title": "On the Town",
      "recommendations": [
         17889,
         2769,
         42597,
         134757,
         84886,
         48611,
         128679,
         29376,
         14675,
         53712,
         84762,
         33015,
         45695,
         29872,
         15148,
         207249,
         39309,
         69333,
         104776,
         42390
      ],
      "backdrop_path": "/kwgJmgvTvjTDstqqX6j2xEvOIij.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "556ae48892514174a80034e0",
         "content": "Wonderful town gets a wonderful movie.\r\n\r\nAs would be tradition, the story at the core of On the Town isn't anything to sing from the roof tops, but it plays out as one of MGM's most memorable slices of froth. Propelled by talented stars and singers, it's a musical of comedic delights. \r\n\r\nAdapted from the successful stage production, charges of being dated and that not all the songs are great, is correct. The dated thing is not always a viable debating tool, but certain stereotype and sexist elements here will ring a little hollow with some folk. \r\n\r\nYet if you can just run with it and accept the era of film making it comes from, then this is mostly a joyous and uplifting picture. So roll with the boys and girls, with the wonderful dances and the wonderful singing, for New York New York, A Wonderful Town. 8/10",
         "url": "https://www.themoviedb.org/review/556ae48892514174a80034e0"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Gabey",
               "gender": 2,
               "credit_id": "52fe44839251416c91013637",
               "name": "Gene Kelly",
               "profile_path": "/xbQZidMyhviuLmI1h8cJoJ7F1LV.jpg",
               "id": 13294,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Chip",
               "gender": 2,
               "credit_id": "52fe44839251416c9101363b",
               "name": "Frank Sinatra",
               "profile_path": "/vn9qWseEb2LspaS0LBDntH0L4Qw.jpg",
               "id": 4347,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Ozzie",
               "gender": 2,
               "credit_id": "52fe44839251416c9101363f",
               "name": "Jules Munshin",
               "profile_path": "/bJAlXFk0KVI0QRKMOn6JpgOs1PO.jpg",
               "id": 103704,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Ivy Smith",
               "gender": 0,
               "credit_id": "52fe44839251416c9101364b",
               "name": "Vera-Ellen",
               "profile_path": "/kMpfnWzEnVmkrFUVumIOPjzYSmQ.jpg",
               "id": 77675,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Brunhilde Esterhazy",
               "gender": 0,
               "credit_id": "52fe44839251416c91013643",
               "name": "Betty Garrett",
               "profile_path": "/7uoCfyyFyepLTCqStF8qpwzt1T5.jpg",
               "id": 109614,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Claire Huddesen",
               "gender": 1,
               "credit_id": "52fe44839251416c91013647",
               "name": "Ann Miller",
               "profile_path": "/b2NSm6PsPXP9KyKts5ElUVOUoVe.jpg",
               "id": 15008,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Mme. Dilyovska",
               "gender": 1,
               "credit_id": "583fe955c3a36862db0072cf",
               "name": "Florence Bates",
               "profile_path": "/88b2ljcVKqcIiInibVvQWriXRLP.jpg",
               "id": 3367,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Lucy Schmeeler",
               "gender": 1,
               "credit_id": "583fe9749251417f860078c8",
               "name": "Alice Pearce",
               "profile_path": "/xZdynSG1PSq84QBK3GKx0rdfBnm.jpg",
               "id": 113952,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Professor",
               "gender": 0,
               "credit_id": "583fe98bc3a36862db0072f5",
               "name": "George Meader",
               "profile_path": null,
               "id": 217757,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Francois - Head Waiter (uncredited)",
               "gender": 2,
               "credit_id": "54feee23c3a36810a1001503",
               "name": "Hans Conried",
               "profile_path": "/7JnEMvdZEoA1uumb0HG2qKFh6ZP.jpg",
               "id": 16421,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Daisy - Simpkins' MGM Date (voice) (uncredited)",
               "gender": 1,
               "credit_id": "52fe44839251416c9101364f",
               "name": "Judy Holliday",
               "profile_path": "/pfKChERT9vEzyJrO5sWkJy1go36.jpg",
               "id": 85651,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44839251416c91013627",
               "name": "Stanley Donen",
               "profile_path": "/8r91mtKkWdYri739IilAvTVzr1E.jpg",
               "id": 13284,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44839251416c9101362d",
               "name": "Gene Kelly",
               "profile_path": "/xbQZidMyhviuLmI1h8cJoJ7F1LV.jpg",
               "id": 13294,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44839251416c91013633",
               "name": "Adolph Green",
               "profile_path": null,
               "id": 13286,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44839251416c91013655",
               "name": "Betty Comden",
               "profile_path": "/3fahaK0nLqCulLZtXzfMrGIvhkp.jpg",
               "id": 197796,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5844a3dd9251416a7400e2c0",
               "name": "Arthur Freed",
               "profile_path": "/dzPxN7pBVeSgW46YEOuCzcDbIv2.jpg",
               "id": 9055,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 3.99778,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 31516,
      "vote_count": 65,
      "budget": 2111250,
      "overview": "Three sailors - Gabey, Chip and Ozzie - let loose on a 24-hour pass in New York and the Big Apple will never be the same! Gabey falls head over heels for \"Miss Turnstiles of the Month\" (he thinks she's a high society deb when she's really a 'cooch dancer at Coney Island); innocent Chip gets highjacked (literally) by a lady cab driver; and Ozzie becomes the object of interest of a gorgeous anthropologist who thinks he's the perfect example of a \"prehistoric man\". Wonderful music and terrific shots of New York at its best.",
      "similar": [
         872,
         812,
         11224,
         224141,
         38757,
         10530,
         14128,
         16119,
         15121,
         11970,
         824,
         10020,
         11631,
         621,
         703,
         15969,
         3933,
         744,
         46195,
         196867
      ],
      "original_title": "On the Town",
      "runtime": 98,
      "poster_path": "/1nzJskheUXOZYmfVkbqFgbChH0e.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1949-12-08",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "They Paint The Town With Joy!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": [
         "Stanley Donen",
         "Gene Kelly"
      ],
      "runtime": 98,
      "synopsis": null,
      "writers": [
         "Adolph Green",
         "Betty Comden"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0041716/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM1MDc4MTA2OF5BMl5BanBnXkFtZTYwOTQ3ODY5._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Gene Kelly, Frank Sinatra, Betty Garrett | See full cast and crew »"],
      "reviews": [
         "I've rewatched both these movie musicals in the space of a week, and ON THE TOWN is no SINGIN' IN THE RAIN. I mean, what is? By 1952, the sheer technical mastery of Gene Kelly had melded perfectly with an entire soundtrack of classics and a clever, satirical plotline with some of the best film characters ever created (Lina Lamont, anybody?). Having got *that* out of the way, however, there is simply no denying that ON THE TOWN is essential viewing in the Kelly oeuvre. It tells the story of three lonely sailors who finally get shore leave in New York for 24 hours. Of course, they're on the prowl to paint the town red, preferably with girls on their arms. (Though for a brief while Sinatra does charmingly play a skinny little geek bent on seeing the sights of New York, flinging facts from his guide book and appearing unaffected by Betty Garrett's streetwise cabbie flinging herself at him.) Gabey (Gene Kelly) falls for 'Miss Turnstiles' or Ivy Smith (Vera-Ellen), and spends the day trying to track her down from information on the poster. Chip (Frank Sinatra) meets cabbie Hildy (Garrett) who teaches him how to have a little fun while they romp gaily through two great duets together ('Come Up To My Place' and 'You're Awful'). Ozzie (Jules Munshin), in the meantime, gets entangled with the Claire Huddesen (an absolutely delightful Ann Miller), who likes how much he resembles her ideal 'Prehistoric Man'. They dance and sing their way through a series of misunderstandings between Gabey and Ivy, but all comes right in the end as the girls bid their fellows farewell from the dock. So what's so good about ON THE TOWN, you ask? Well, first of all, it's brilliant fun and very amusing--from the dancing to the singing to the snappy dialogue. It takes a while to get used to the *very* forward New York women (played with marvellous wit and charm by Garrett and Miller), but once you get over their throwing themselves at Chip and 'Specimen' respectively, you really appreciate ON THE TOWN for what it is: pure, unadulterated, and unpretentious entertainment. Granted: The songs aren't as catchy as in SINGIN' IN THE RAIN. But there are definitely some minor classics to be heard here--'You're Awful', Frankie's serenading of Betty, and 'Count On Me' being among them. I thought it was a really nice touch to have Bern Hoffman singing a lazy-morning song, 'I'm Feeling Like I'm Not Out Of Bed' to bookend the film beginning and end, to give the sense of a full day having passed. It should probably also be granted that there isn't quite enough dancing, especially not from Gene Kelly (who is always a delight to watch, even when mostly playing the bystander as he was in the 'Count On Me' number) and Ann Miller, who got the chance to show off her amazing tap-dancing skills and gorgeous gams in the wildly energetic 'Prehistoric Man'. (It only whetted my appetite to see *more* of her dancing and singing! I'd have liked it if Miller's role was expanded, period. She gave her character an indescribable life and vivacity in the limited screen time she had and overshadowed Vera-Ellen easily.). I'd have loved it if Kelly had danced properly with Miller too, the latter being one of the best female tap-dancers in the business. All the same, the sweet ballad 'Main Street' that Gabey sings to Ivy is accompanied by a beautiful dance routine that shades naturally and easily from dancing to walking and back again--a perfect example of Gene Kelly's ability as both dancer and choreographer to present and capture movie magic with no special effects. I actually much prefer the 'New York Ballet' in this film to the one in AN AMERICAN IN PARIS, mostly because it fits the plot beautifully, and is smaller and more intimate and more focused on Gene Kelly the dancer rather than Gene Kelly the choreographer. It gives Kelly the opportunity to shine as both dancer *and* actor: the scenes when he dances with the Miss Turnstiles poster are achingly believable in the way they could only be if Kelly were dancing in them. The shadow sequence at the ballet barre with Vera-Ellen is also something incredible to behold and perfectly-staged. ON THE TOWN is a great night at the movies, and is time well-spent with a few characters you really get to know, an excellent cast (Alice Pearce practically steals the entire show as Lucy Schmeeler, for example--not an easy task considering who she was playing against!), and a great soundtrack. It's probably one of the best precursors you could have to Kelly's much more ambitious musical undertakings in the form of AN AMERICAN IN PARIS and SINGIN' IN THE RAIN. But on its merits, it is definitely worth watching. Perhaps again and again. 8/10.",
         "Here's an idea: Get a group of exceptionally talented performers together, sketch in an outline of a story based on a successful Broadway show, then supply the score, songs and setting in which they can individually and collectively showcase their respective gifts, turn them loose and see what happens, see if it works. Of course, by the time this film was made in 1949, MGM knew it would work, as it had for them many times previously; there was no guess work involved. The result this time around was `On The Town,' a lively musical which marked the directorial debut of co-directors Gene Kelly and Stanley Donen, with Kelly starring and also doing the choreography. The plot is simple: Three sailors get twenty-four-hour shore leave in New York and set off to make the most of it. Chip (Frank Sinatra) wants to see the sights; Ozzie (Jules Munshin) wants to play; and Gabey (Kelly) immediately falls into an obsession over a girl he sees on a subway poster, `Miss Turnstiles' of the month, Ivy Smith (Vera-Ellen), and vows to find her. Along the way they run into a quirky cab driver, Brunhilde (Betty Garrett), and a young woman, Claire (Ann Miller), doing some research at a museum. But what this movie is really all about is entertainment, and it delivers it by the songful. Kelly and Donen bring it all to life through the words and music of Betty Comden, Adolph Green and Leonard Bernstein, and the score, which earned an Oscar for Roger Edens and Lennie Hayton. it kicks off with Sinatra, Munshin and Kelly doing `New York, New York,' in which they enlighten you to the fact that `The Bronx is up and the Battery's down, and people ride in a hole in the ground--' a dynamite opening that sets the stage for all that comes after. And it's pure entertainment that just sweeps you away with it while you hum along with the six stars of the show as they do what they do best, and it's a delight from beginning to end. Without a doubt, Kelly emerges as the star among the stars, and his solo numbers and the ones he performs with Vera-Ellen are especially engaging; but this is one of those musicals in which one memorable number follows another, with each of the principals getting their own moment in the spotlight. Vera-Ellen has a great number early on in the film, in which Miss Turnstiles is introduced; Ann Miller taps her way through a rousing routine in the museum (in which she is joined by Sinatra, Munshin, Kelly and Garrett) that really gives her a chance to show her stuff; and Sinatra and Garrett engage in a memorable bit in song, as she attempts to get him to `Come Up To My Place.' Through it all, Sinatra exudes a certain boyish charm while Garrett and Munshin provide the comic relief. All of which makes for a fun and thoroughly entertaining movie experience. The supporting cast includes Alice Pearce (Lucy), Sid Melton (Spud), Hans Conried (Francois) and Florence Bates (Madame Dilyovska). Some movies are made simply to transport you to another place for a couple of hours, put a smile on your face, a song on your lips and just make you feel good; and `On The Town' is certainly one of them. This is pure, uplifting and satisfying Entertainment, beautifully crafted and delivered and guaranteed to make your day a little brighter. The fact is, they just don't make \u0091em like this anymore, and it's a shame. Because this is what the magic of the movies is all about. I rate this one 9/10.",
         "Grand, sure-fire musical entertainment courtesy of MGM, \"On the Town\" brings euphoric life to the 'Big Apple' like no other piece of celluloid, comedy or drama, before or since. More than just a breath of fresh air, this breezy souffle of a movie is like taking a huge whiff of pure oxygen, leaving you so exhilarated you'd swear you were on some kind of substance-induced high. Drenched in old-fashioned innocence and loaded with dazzling footwork, it gave a tremendous boost to the careers of all involved and helped to create a whole new style of musical film. Three swabbies on a 24-hour shore pass during WWII bask in the sights and delights of NYC while running into new lady loves in the interim. That's all there is to it. The first musical to actually shoot on location, the viewer has the surreal-like thrill of a first-time vacationer as the movie juxtaposes every tourist trap imaginable, plus some, while capturing the pulse and heart of the City to endless effect. Briskly co-directed by Gene Kelly and Stanley Donen, the movie would initially appear to have everything going AGAINST it. The plot is so thin and flaky it almost evaporates into thin air. Moreover, the directors made the seemingly unwise choice of dumping nearly all of the charming Leonard Bernstein score and Betty Comden/Adolph Green libretto for newer, untried songs by Roger Edens. Well, in good reliable hands, this not only works, it dances circles around the original! There's so much going for this movie in the name of talent that its hard to know where to begin. Gene Kelly prepped his choreographic talents here for the later landmark musicals \"An American in Paris\" and \"Singin' in the Rain.\" He is sheer delight as the lovelorn sailor who pines for \"Miss Turnstiles,\" a billboard fantasy. Jules Munshin unleashes pure Ed Wynn buffoonery as the sailor with the least animal magnetism. Even Frank Sinatra, allows himself to get caught up in all the fun. And the girls are irresistible too. Betty Garrett shoots with both barrels as the man-chasing cabbie and proves she is quite capable of stepping up to the plate in the dance department. Lithe and lovely Vera-Ellen, who never won the attention she fully deserved, is poetry in motion as Kelly's dream come true. In particular, her adagios with Kelly are imbued with such unsullied passion that it can't help but tug at the ol' nostalgic heart-strings. Peppy Ann Miller is, as always, a revelation as the toe-tapping anthropologist, taking full advantage of the zingy score's newer songs and embellishing them with now-classic dance routines. As a special treat, my favorite character actress, Alice Pearce, offers side-splitting comedy relief as Kelly's impromptu blind date managing to steal one song from the star ensemble while finding a touching moment of pathos in her final scene. The homely comedienne went on to play nosy neighbor Gladys Kravitz in the \"Bewitched\" TV series to Emmy-winning acclaim. Florence Bates also makes the most of her patented huff and scowl as a tipsy ballet mistress, and see if you can scout out an unbilled Bea Benadaret (Kate in \"Petticoat Junction\") as a subway tootsie. Still the highlight, and there are many highlights, is the infectious title tune atop the Empire State Building with Kelly & Company. Nowhere in the history of filmed musicals will you find such barn-storming talent and exuberant fun packed into one simple little tune. That sequence is a natural tape-rewinder. You know the old saying, \"They don't make 'em like this anymore?\" Oh, they are so right.",
         "Three soldiers on shore in New York City have a 24-hour romp in the city. That's it. There is nothing else to the plot of this fantastic musical, but that doesn't hurt ON THE TOWN one bit. New York has been the focus of film since the beginning of film itself when a 10 minute short about the New York City subway system was made. Here, although not all scenes were actually filmed in New York (and according to Betty Garrett, she and the other girls never saw the city except for the final scene on the harbour, the subject and main character of the film is New York itself: bustling energy, its loud, screeching subway system complete with adverts and pin-up posters (one of Ms Turnstiles which catches Gene Kelly's attention), its (then) tallest building the Empire State Building, its urban landmarks. As I said in the beginning, there is not much plot. What plot there is consists mainly of the three soldiers pairing off with three women: Jules Munshin with Ann Miller, Frank Sinatra with Betty Garrett, and Gene Kelly with Vera-Ellen, the only one with a back-story and a secret, one that has her slipping from Kelly's arms and leading to a remarkable chase against the clock to find her. The musical numbers are outstanding (especially Garrett's and Sinatra's frantic duet \"My Place\" which, if this weren't a musical-comedy, would send men running to the hills at the sight of an aggressive man-hungry cab driver) and all women dance admirably, but the only one who one remembers is Miller in the museum sequence, twirling like a Tasmanian devil and looking fabulous while doing so. Not a great actress, she could move like not many dancers-turned-actresses could, and it's a pity she decided to basically retire from movies so early and only came back for her small role in MULLHOLLAND DR. As a matter of fact, all except Kelly and Sinatra virtually stopped acting in the late 50s, possibly due to MGM-styled musicals coming to an end at that time. As a curious note, there's a cute appearance as well by Alice Pearce who would later be remembered as the nosy neighbor Gladys Kravits in the TV series \"BEWITCHED.\" According to facts, she is the only one from the theatrical version to reprise her role here and this role made her career move ahead as well as it gave her a chance to walk away with the movie as well. ON THE TOWN is one of the best musicals of all time, up there with SINGIN' IN THE RAIN and WEST SIDE STORY.",
         "The Bronx is up and the Battery's down, and Kelly and Sinatra are back in sailor suits, in this effervescent MGM musical. The three matelots (our two heroes are joined by Jules Munshin for this caper) have a 24-hour shore leave in which to savour New York City. \"What can happen to ya in one day?\" asks a shipyard worker, and the guys answer the question by picking up girls, destroying a dinosaur and getting chased to Coney Island by the cops... in just one day. Leonard Bernstein composed the tunes, and the writers of the stage show (Green & Comden) provided the lyrics, supplemented by Bernstein himself and the associate producer, Roger Edens. Of the songs, \"On The Town\" and \"You Can Count On Me\" are nerve-tingling showstoppers. \"Prehistoric Man\" is much weaker, but saved by crisp, playful choreography. The two expressionist ballets, \"Miss Turnstiles\" and \"A Day In New York\" bear the hallmark of Kelly's directorial style, which first reached its maturity in this picture. Kelly's slide on his knees towards the 'Miss Turnstiles' poster is a piece of cinema magic. Kelly plays Gabey, a supposedly worldly-wise lady's man who turns out to be a Mid-Western innocent in the big city, and who falls in love with a struggling hoofer(Vera-Ellen), a girl he takes to be a celebrity. Sinatra is the serious-minded Chip, the enthusiastic sightseer who gets snapped up by Hildie Esterhazy (Betty Garrett), a knowing cabbie who has one aim - to get Chip alone in her apartment. Ann Miller sings and dances impeccably as Claire Huddesen, the bluestocking who gets turned on by Ozzie's primitive quality. \"On The Town\" has a daffy story, as musicals often do, but it fizzes with flirtatious youthful energy. Each of the three couples has its own song and/or dance, and these are sensitively tailored to suit the individuals' personalities. The Empire State Building observation platform set is a knockout, and the film's sense of fun even extends to a sly Ava Gardner joke at Sinatra's expense. Notional time runs from 6am at the start of the boys' leave ('boys', or 'kids' as they are twice described, is not quite accurate - Kelly was 37 and the other two 34 at the time of filming) until 6am the following morning, as it ends. Three new sailors come charging down the gangway to start their 24 hours in the Big Apple, reminding us that love and youth are eternal, and New York's a wonderful town.",
         "On the Town is one great fast moving musical, one in which the dance is supreme. Not surprising because this is the first film that Gene Kelly had total creative control over. On the Town ran for 462 performances on Broadway from December, 1944 to February, 1946 and it's score was composed by Leonard Bernstein with lyrics by Adolph Green and Betty Comden. Naturally the book included some topical war time references for 1944 which were eliminated in 1949. So was about half of Bernstein's score, but Comden and Green wrote the lyrics for the new songs also with Roger Edens. That certainly helped keep the continuity. Of course the signature song of the Broadway score, New York, New York was kept. The rest of the score is really not all that great in terms of marketability. But Kelly was interested in giving the dance center stage in this film and he succeeded admirably. Of course of the six principals in the cast he had both Ann Miller and Vera-Ellen, a pair of very good dancers to help. The plot of On the Town is threadbare. Three sailors, Kelly, Frank Sinatra, and Jules Munshin get 24 hour shore leave and they are determined to experience as much New York as they can. That opening number with the men pouring out of the ship on the Brooklyn Navy Yard dock is unforgettable and then Kelly, Sinatra, and Munshin singing and dancing New York, New York. Munshin attracts the attention of Ann Miller who finds his resemblance to a caveman recreation astounding. Her big moment on the screen is tap dancing to Primitive Man ending with Munshin destroying one of the dinosaur skeletons in the Museum of Natural History. This was Munshin's third film after MGM signed him up for a small role in Easter Parade. He was a borscht belt comedian who got his big break on Broadway in Call Me Mister. With Sinatra and Kelly in Take Me Out to the Ballgame before On the Town, he was a pretty funny fellow. He spent his career equally between the stage, screen, and later television. Perhaps it's why he's not really remembered today by film fans that much. Sinatra catches the eye of cabdriver Betty Garrett. One big reason for rewriting the score was in the original play there was no ballad for Sinatra's character. Besides the ensemble numbers, Sinatra and Garrett sing Come Up to My Place from the original score and You're Awful, Awful Nice to be with. Nothing terribly memorable, in fact Frank never recorded any of the material from On the Town. But to have in the film and not give him one ballad would have been ridiculous. It's the dance numbers that make On the Town. Besides the ones previously mentioned, Kelly and Vera-Ellen do a salute to their common small town in Main Street and there is the lengthy A Day in New York ballet. The year before Kelly had shown what he was really capable of creating in the Slaughter on Tenth Avenue ballet in Words and Music. Now that he had complete creative control and he made maximum use of it. Of course this was nothing compared to what he was to create in later films. Vera-Ellen probably is best known for being Rosemary Clooney's sister in White Christmas. But she's shown to far better advantage here. I'm surprised Kelly did not team with her more often. On the Town is really helped a lot by the location shooting in New York. Director Stanley Donen very skillfully blended his shots of well known New York landmarks like the Brooklyn Navy Yard, the Brooklyn Bridge, Wall Street, Columbus Circle with the later interiors done on the MGM soundstage. Really great job of editing. To see New York in 1949 you couldn't ask for three better guides than those sailors on a 24 hour pass.",
         "I have found that On the Town is one of the best movies from the 1940's. It has the perfect chemistry for a movie. From the all-star cast of Gene Kelly, Frank Sinatra, Ann Miller, Vera Ellen and others to the script itself written by the wonderful Betty Comden and Adolph Green, it is no wonder that this movie is still around. When 3 sailors have a leave in NYC, and their main objective is to pick up girls, you know that you are in for some laughs. From the dinosaur to the cab drivers, this movie is a score on my list. The dancing is also great. Ann Miller taps her heart away and Gene Kelly amazes us yet again. This movie is here to stay!",
         "Another Comden-Green triumph! Although it may not be as good as \"Singin' In The Rain\", it's truly a masterpiece that no home should be with out! Jules Munshin is energetic in the role of Ozzie! Gene Kelly plays the part of the lovesick Gabey absolutely perfect! And although I am a die hard Kelly fan, I must say that the best male performance given in this film was from Ol' Blue Eyes himself, Mr. Frank Sinatra! In the role of Chip, he brings a certain innocence as well as that sailor spunk and vitality! And the three of them crooning songs such as \"New York, New York\", \"Let's Go To My Place\" and \"On The Town\" is absolutely wonderful (especially Kelly and Sinatra)! Ann Miller is fantastic as the leggy anthropologist, Claire! She brings a lot of zest to her role! (It's hilarious to hear her refer to Ozzie as \"Specimen\"!) Vera-Ellen also is WONDERFUL in the role of Ivy, or \"Miss Turnstiles\"! She is a highly underrated actress... and her dancing is truly DIVINE! However, another highly underated actress is Betty Garrett, who portrays the female cabbie, Hildie! She makes the role zippy and sassy... and she and Chip singing \"Let's Go To My Place\" is an absolute knee-slapper that will have you laughing and singing with it every time! Alice Pearce is also rather funny as Hildie's roomate, Lucy Shmeeler. I recommend this movie to anyone who is a fan of musicals, especially the older ones, such as \"An American In Paris\", \"Singin' In The Rain\" and \"Take Me Out To The Ballgame.\" This carefree frolic of a film will leave you laughing and singing for days!",
         "Great score by Bernstein and awesome dancing (of course) by Kelly and company. Nice color and photography, engaging and amusing story lags only at the end. Sinatra is pleasingly pursued by Betty Garrett (much as in the previous \"Take Me Out to the Ball Game\"). Only 4 songs from the original musical by Bernstein, MGM pulls another \"Roger Eden\" (a man whose mission in life seemed to have been to ruin good stage musicals.... as witness his atrocity of \"Funny Face\"). Comden and Green's wonderful sparkling words are often missed, but this musical did fortunately bring their talents to the attention of MGM, Freed, Kelly and Donen. They scripted \"Singing in the Rain\" and I guess the rest is history, although Comden and Green should be better remembered for their outstanding broadway hits: \"On the Town\", \"Wonderful Town\", \"Bells are Ringing\" and so many more.",
         "This film has a very simple plot. Three sailors have 24 hours shore leave in New York. They met three attractive girls, and three romances blossom. And that's about it. The characterisation is really no more advanced than the plot development. The sailors and their sweethearts are each given their own idiosyncrasies, but none of them really emerges as a rounded individual. Fortunately, however, a complex plot and well-developed characters are not always essential to the musical genre, and \"On the Town\" manages to succeed reasonably well without these elements. The film's most important quality is the energy and vivacity of its song-and-dance numbers. It was shot on location in New York itself, and the city is portrayed as a vibrant, exciting place, a new world as far as the sailors, who are all country boys, are concerned. There is also plenty of humour, such as the scene where Frank Sinatra wants to go sight-seeing, unlike his new-found girlfriend, a man-hungry female cab driver, who would rather take him back to \"my place\", Gene Kelly's search for \"Miss Turnstiles\", whom he imagines to be a glamorous and famous beauty queen, and the scene where the three men manage to demolish a dinosaur skeleton in the city's Museum of Anthropology. (Jules Munshin's girlfriend is described as a lady anthropologist, although the scriptwriters seem to have blurred the difference between anthropology and palaeontology). The songs are tuneful, although with the possible exception of \"New York, New York\" none of them are particularly memorable. Some have criticised the more formal balletic sequence near the end, but as far as I was concerned this was one of the best parts of the movie. After all, if you are going to make a film starring a dancer as talented as Gene Kelly, you might as well use his talents to the full. This is not really my favourite musical. It lacks, for example, the indefinable magic of \"Singin' in the Rain\", which also starred Kelly, or the depth and social comment of \"West Side Story\", Leonard Bernstein's other New York musical made twelve years later. (The contrast between these two films shows just how far the genre had progressed in just over a decade). Nevertheless, it is enjoyable enough for anyone in the mood for soft-centred escapist entertainment. 7/10"
      ],
      "genres": [
         "Comedy",
         "Musical",
         "Romance"
      ],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": [
         "Three sailors - Gabey, Chip and Ozzie - let loose on a 24-hour pass in New York and the Big Apple will never be the same! Gabey falls head over heels for \"Miss Turnstiles of the Month\" (he thinks she's a high society deb when she's really a 'cooch dancer at Coney Island); innocent Chip gets highjacked (literally) by a lady cab driver; and Ozzie becomes the object of interest of a gorgeous anthropologist who thinks he's the perfect example of a \"prehistoric man\". Wonderful music and terrific shots of New York at its best.",
         "Sailors Gabey, Chip, and Ozzie are very excited about getting a 24-hour leave and spending it in New York, New York - a wonderful town! They are especially concerned with the female inhabitants of the city, and each finds his own to cuddle up with. Chip tries but can't resist the horny advances of a cab driver, Ozzie gladly fills the role of a lovely anthropologist's \"prehistoric man,\" and after much desperate searching, Gabey finds the model who poses for the Miss Turnstiles advertisements, who isn't quite the glamorous celebrity he envisioned but nevertheless will do.",
         "Three sailors on a day of shore leave in New York City look for fun and romance before their twenty-four hours are up."
      ],
      "budget": 2111250
   },
   "movielensId": 3606,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1949-12-08",
      "dvdReleaseDate": "2000-05-02",
      "directors": [
         "Stanley Donen",
         "Gene Kelly"
      ],
      "runtime": 98,
      "movieId": 3606,
      "title": "On the Town",
      "mpaa": "",
      "actors": [
         "Gene Kelly",
         "Frank Sinatra",
         "Jules Munshin",
         "Vera-Ellen",
         "Betty Garrett",
         "Ann Miller",
         "Florence Bates",
         "Alice Pearce",
         "George Meader",
         "Hans Conried",
         "Judy Holliday"
      ],
      "imdbMovieId": "0041716",
      "originalTitle": "On the Town",
      "genres": [
         "Comedy",
         "Music",
         "Romance"
      ],
      "youtubeTrailerIds": ["x7CIgWZTdgw"],
      "plotSummary": "Three sailors - Gabey, Chip and Ozzie - let loose on a 24-hour pass in New York and the Big Apple will never be the same! Gabey falls head over heels for \"Miss Turnstiles of the Month\" (he thinks she's a high society deb when she's really a 'cooch dancer at Coney Island); innocent Chip gets highjacked (literally) by a lady cab driver; and Ozzie becomes the object of interest of a gorgeous anthropologist who thinks he's the perfect example of a \"prehistoric man\". Wonderful music and terrific shots of New York at its best.",
      "tmdbMovieId": 31516,
      "avgRating": 3.87061,
      "releaseYear": "1949",
      "numRatings": 1024,
      "posterPath": "/1nzJskheUXOZYmfVkbqFgbChH0e.jpg"
   }
}