{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "native american",
            "id": 10322
         },
         {
            "name": "modern western",
            "id": 178402
         }
      ],
      "imdb_id": "tt0070481",
      "video": false,
      "title": "One Little Indian",
      "recommendations": [],
      "backdrop_path": "/quseiuHZWKbKX9Vahq2GYHt14l3.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "Keyes",
               "gender": 2,
               "credit_id": "52fe46d5c3a36847f8114d3b",
               "name": "James Garner",
               "profile_path": "/ek70DefEq6LZZX3JyUjJ125q63f.jpg",
               "id": 16896,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Doris",
               "gender": 1,
               "credit_id": "52fe46d5c3a36847f8114d23",
               "name": "Vera Miles",
               "profile_path": "/qWP9L969DOSFgBhRV2Ik2ve8Z4r.jpg",
               "id": 7303,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Capt. Stewart",
               "gender": 2,
               "credit_id": "52fe46d5c3a36847f8114d27",
               "name": "Pat Hingle",
               "profile_path": "/bW8alHCKEK0UOJjoZwjwwH7T0ga.jpg",
               "id": 3798,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Sgt. Raines",
               "gender": 0,
               "credit_id": "52fe46d5c3a36847f8114d2b",
               "name": "Morgan Woodward",
               "profile_path": "/jEOS9BKrExrXYQdrWpQHAd5lgwS.jpg",
               "id": 13869,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Sgt. Waller",
               "gender": 2,
               "credit_id": "52fe46d5c3a36847f8114d2f",
               "name": "John Doucette",
               "profile_path": "/fgxqNmMIQHHCy0uxN1XXEon9eLq.jpg",
               "id": 34130,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Lt. Cummins",
               "gender": 2,
               "credit_id": "52fe46d5c3a36847f8114d37",
               "name": "Robert Pine",
               "profile_path": "/dZTRdcp57vdnCtxIp8vNYR6pOtp.jpg",
               "id": 74573,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Mark",
               "gender": 2,
               "credit_id": "52fe46d5c3a36847f8114d33",
               "name": "Clay O'Brien",
               "profile_path": null,
               "id": 78399,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Schrader",
               "gender": 2,
               "credit_id": "52fe46d5c3a36847f8114d3f",
               "name": "Bruce Glover",
               "profile_path": "/xIaAA5KFhaB4Z5FmWd5Rd2KenVn.jpg",
               "id": 10194,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Pvt. Dixon",
               "gender": 2,
               "credit_id": "52fe46d5c3a36847f8114d43",
               "name": "Ken Swofford",
               "profile_path": "/7l4GppNqzi2lvs2R1nbTfxwiKcW.jpg",
               "id": 45308,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Jimmy Wolf",
               "gender": 0,
               "credit_id": "52fe46d5c3a36847f8114d4f",
               "name": "Jay Silverheels",
               "profile_path": "/4CiTH9NnF1NVzwdwHXoEzKJikUs.jpg",
               "id": 1229431,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Chaplain",
               "gender": 2,
               "credit_id": "52fe46d5c3a36847f8114d47",
               "name": "Andrew Prine",
               "profile_path": "/4heJy09ohj94DKYN9C4LN44mR2Z.jpg",
               "id": 15668,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Martha",
               "gender": 1,
               "credit_id": "52fe46d5c3a36847f8114d4b",
               "name": "Jodie Foster",
               "profile_path": "/eAIE6bnOQ8rm0f933gyeAQdIwrP.jpg",
               "id": 1038,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe46d5c3a36847f8114d1f",
               "name": "Harry Spalding",
               "profile_path": null,
               "id": 37364,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "538ec14ec3a36832c3000c95",
               "name": "Bernard McEveety",
               "profile_path": null,
               "id": 1211915,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "575dffbdc3a3687f63000519",
               "name": "Winston Hibler",
               "profile_path": null,
               "id": 63670,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "575dffc4c3a3680470001174",
               "name": "Tom Leetch",
               "profile_path": null,
               "id": 1423959,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "575dffcbc3a36805be000f72",
               "name": "Jerry Goldsmith",
               "profile_path": "/e6sd10VuwFXkgRFrCTCygbhMq2q.jpg",
               "id": 1760,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "575dffd3c3a3687bbc00055a",
               "name": "Charles F. Wheeler",
               "profile_path": null,
               "id": 12119,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "575dffda92514103e80017b4",
               "name": "Robert Stafford",
               "profile_path": null,
               "id": 109454,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "575dffe19251411bfe0004e7",
               "name": "LeRoy Deane",
               "profile_path": null,
               "id": 1403614,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "575dffe8925141165400158b",
               "name": "John B. Mansbridge",
               "profile_path": null,
               "id": 12869,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "575dffee9251411bfe0004ee",
               "name": "Hal Gausman",
               "profile_path": null,
               "id": 1261,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "575dfffcc3a3680608000fd5",
               "name": "Emily Sundby",
               "profile_path": null,
               "id": 1634866,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "5916ee08c3a36840aa02bf89",
               "name": "Bobby Somers",
               "profile_path": "/dsiv1YDEJv6T30zQQL1I9LvO9BI.jpg",
               "id": 1208034,
               "department": "Crew",
               "job": "Stunts"
            }
         ]
      },
      "genres": [{
         "name": "Family",
         "id": 10751
      }],
      "popularity": 0.828835,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 45827,
      "vote_count": 6,
      "budget": 0,
      "overview": "An Army deserter (James Garner) flees by camel across the desert with a white boy (Clay O'Brien) raised by Indians.",
      "similar": [
         581,
         196,
         281957,
         57201,
         10530,
         9361,
         49849,
         57212,
         395834,
         11897,
         384680,
         3114,
         9023,
         8584,
         264656,
         10747,
         9359,
         223485,
         1534,
         294963
      ],
      "original_title": "One Little Indian",
      "runtime": 90,
      "poster_path": "/9wvojM2AKUtzXXIaZObUVNp1Ykw.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Walt Disney Productions",
         "id": 3166,
         "origin_country": ""
      }],
      "release_date": "1973-06-20",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "A boy turned Indian, a trooper turned deserter and ROSIE, a camel turned IMPOSSIBLE!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Bernard McEveety"],
      "runtime": 90,
      "synopsis": null,
      "writers": ["Harry Spalding"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0070481/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQzOTk5NjY3OF5BMl5BanBnXkFtZTcwMTE1NDYyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: James Garner, Vera Miles, Pat Hingle | See full cast and crew »"],
      "reviews": [
         "You know I watch a great many movies, being disabled and not very mobile can do that to you. From action to romance and thriller to comedy I pretty much enjoy any genre and being this way I have seen a lot of action packed movies. So when one comes my way that is simply a good story with fun and a pleasant message it is refreshing. This is one of those movies! Good, fun, pleasant to watch and with clean non-violent message. James Garner is good fun and plays the role well. Jodie Foster is in it for only a few scenes but you know even seeing her at that age (11 i guess) was kind of neat! Vera Miles also plays her part well. As for the \"one little Indian\" - Clay O'Brien, he plays his part well, and even the occasional dodgy haircut is forgivable! So in short, if you a looking for a good, clean, family movie I can recommend this one. All the best from Southern Ireland! Kevin",
         "The plot is a little predictable, or maybe I remembered it from 'way back when. As a James Garner fan, it's a sure bet that I've seen this before, but can't remember when. The timing and pace were superb; I was entertained without thinking about time passing. It's a little sentimental for today's tastes. Acting was flawless by the entire cast; every character was believable. The music was unpretentious, and unfortunately, unmemorable, but then it also doesn't date itself, either. At the end, I didn't have the feeling that this is an all time classic, but it did manage to jerk that little tear out of my eyeball. The only major flaw was the poor use of obvious studio shot closeups during the chase scenes, which jarred the viewer from the suspended disbelief necessary to enjoy fiction. Overall, I'm not sorry that I own the DVD. It's a real joy to escape the foul language and smut that passes itself off as entertainment these days.",
         "As a teenager, I have a natural taste for movies with excellent special effects, engaging, innovative plots and good old fashioned gore. However, as a father, I have grown a special appreciation for movies that are simply decent and human. This is one of those. It is a family movie, but with a clever and, well, lovable concept. Well written and well performed, it has the capacity to touch even those who don't want to admit they can be touched, even if it is old.",
         "One Little Indian is the first of two westerns that James Garner and Vera Miles made for Walt Disney Productions in the middle Seventies, the second being The Castaway Cowboy. Vera has less to do in this film as James Garner spends most of his screen time with the actor playing the title role, young Clay O'Brien. The title is really a misnomer because O'Brien isn't an Indian. He's a white captive who is discovered as such after an army patrol brings in some women and kids. He's used to living with the Cheyenne and runs away. While on the run O'Brien meets up with James Garner who is also on the run from the army. He's been sentenced to hang for mutiny and desertion and Sergeant Morgan Woodward is making it a personal mission to bring Garner in. As it turns out Garner finds O'Brien invaluable because he didn't get away on a horse. His getaway animal was a mother camel named Rosebud and her baby named Thirsty. Part of the remnants of Jefferson Davis's camel corps experiment which even today can be found roaming our deserts in the Southwest. Rosie can outlast any horse on the desert, but she does require some special handling and O'Brien proves to have a way with the beast. Where One Little Indian succeeds is in the chemistry between Garner and O'Brien without which the film couldn't work. Rendering them aid and comfort for a while is widowed mother Vera Miles and her daughter Jodie Foster. Garner being an army deserter and under sentence to hang does complicate things for a romance with Miles. This is a Walt Disney production so you know it will all work out. Pat Hingle a gruff army captain who does not like the routine of his well ordered post disrupted proves to be a savior for all, but Woodward. How that is accomplished is something to watch One Little Indian for. One Little Indian is a pleasant piece of entertainment from Walt Disney with the added pleasure of James Garner.",
         "Western Calvary outlaw James Garner (as Clint Keyes) escapes hanging, and heads for the hills. Meanwhile, preteen Clay O'Brien (as Mark) is discovered to be a white boy in an Indian wig, taken from his tribe, and made Christian through baptism by Chaplain Andrew Prine. He runs away and hooks up with Mr. Garner. The bonded pair symbolically travel with a brown adult camel named \"Rosie\" and a young white one named \"Thirsty\". A fantasy family is completed when they happen upon pretty widow Vera Miles (as Doris McIver) and blue-eyed daughter Jodie Foster (as Martha). Alas, the men must hit the trail again. Young O'Brien does well, considering the way characters keep checking his bare buttocks to see if he is a real Indian, or not. After lowering the lad's pants, Garner utters the film's best line, \"You ain't anymore Cheyenne than I am!\" ***** One Little Indian (6/20/73) Bernard McEveety ~ James Garner, Clay O'Brien, Vera Miles, Jodie Foster",
         "I have watched this many times with my children all 7. And everyone enjoys it. Still we have watched it over and over along with their friends and as stated before everyone who has ever seen this movie watchs it again and again. There are not many family movies around anymore. There should be more movies like this made now adays. Kids will always be kids. Everyone enjoys a good comdey. No matter what age they are. This movie is truely a treasure. How can you not like James Garner. One of many Disney movies for the whole family. This should be put on a dvd and brought back out on the shelves for all to see and watch. So get out the popcorn and get ready for a GOOD family movie.",
         "this has always been a sentimental favorite of mine amongst the old studio Disney live action films. doesn't mean it's mushy or not well made however. well, maybe it's a little mushy. and the budget is certainly a lot lower and more economical than a 'Butch Cassidy' or a 'Little Big Man'. but even though Disney always practiced economy, their family films were of the highest quality offered usually. a lot of Disney films at this time were either over the top, over sentimentalized treatments of pseudo dramatics such as 'Castaway Cowboy' or outright slapstick fare like 'Million Dollar Duck' and the 'Ugly Daschund'. it is nice that they tried to be serious about this film. something they didn't do later on with the zany 'Apple Dumpling Gang' westerns with Don Knotts. this film actually attempts some pretty decent cinema and a carries a little weight and substance. it also features Disney regular Jodie Foster, who was then only nine or ten years old. Jodie Foster has helped to make several Disney films memorable and charming and she has a sweet little role here with veteran actress Vera miles. this also has a good history lesson about camels and the United States Calvery, which i hear was true and accurate. this film is certainly more toned down and more intelligent than the non-Disney family feature a few years later, 'Hawmps', which was played mostly for laughs. this really is a sweet little movie that, of course, is not on the scale of a 'Little Big Man', but is very worthwhile in it's own modest way. Disney films from the old Burbank studio days, like this one, often don't gather the respect and recognition they really do deserve. not even from so called die hard Disney fans who often aren't even aware that they existed or to the extent of Walt and the Burbank staff's involvement in these films. it's a little disturbing because that kind of mindless dedication to a icon, while having a flippant disregard for the heart and foundations of what makes the person and the icon great, seems baffling in a kind of depressing way. any true fan of the Disney legacy should find this movie enjoyable and cute fun. if not at least interesting in context to Disney studio history."
      ],
      "genres": [
         "Comedy",
         "Family",
         "Western"
      ],
      "productionCompanies": ["Walt Disney Productions"],
      "summaries": ["On the run from the Cavalry, a man tries to disappear while accompanied by two camels and a runaway boy. His escape is made harder when he meets a widow and her daughter who may turn him in."],
      "budget": 0
   },
   "movielensId": 3607,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1973-06-20",
      "dvdReleaseDate": "2000-05-02",
      "directors": ["Bernard McEveety"],
      "runtime": 90,
      "movieId": 3607,
      "title": "One Little Indian",
      "mpaa": "",
      "actors": [
         "James Garner",
         "Vera Miles",
         "Pat Hingle",
         "Morgan Woodward",
         "John Doucette",
         "Robert Pine",
         "Clay O'Brien",
         "Bruce Glover",
         "Ken Swofford",
         "Jay Silverheels",
         "Andrew Prine",
         "Jodie Foster"
      ],
      "imdbMovieId": "0070481",
      "originalTitle": "One Little Indian",
      "genres": ["Family"],
      "youtubeTrailerIds": [],
      "plotSummary": "An Army deserter (James Garner) flees by camel across the desert with a white boy (Clay O'Brien) raised by Indians.",
      "tmdbMovieId": 45827,
      "avgRating": 2.79412,
      "releaseYear": "1973",
      "numRatings": 17,
      "posterPath": "/9wvojM2AKUtzXXIaZObUVNp1Ykw.jpg"
   }
}