{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0181786",
      "video": false,
      "title": "Regret to Inform",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe4b31c3a36847f81f75b7",
            "name": "Barbara Sonneborn",
            "profile_path": null,
            "id": 1081129,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.140659,
      "production_countries": [],
      "id": 113279,
      "vote_count": 2,
      "budget": 0,
      "overview": "In this film made over ten years, filmmaker Barbara Sonneborn goes on a pilgrimage to the Vietnamese countryside where her husband was killed. She and translator (and fellow war widow) Xuan Ngoc Nguyen explore the meaning of war and loss on a human level. The film weaves interviews with Vietnamese and American widows into a vivid testament to the legacy of war.",
      "similar": [],
      "original_title": "Regret to Inform",
      "runtime": 72,
      "poster_path": "/jX5KdaB827m3U9YcYcJlyOPl9YA.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1999-01-01",
      "vote_average": 8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Barbara Sonneborn"],
      "runtime": 72,
      "synopsis": null,
      "writers": ["Barbara Sonneborn"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0181786/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk4MzA2NDU5Nl5BMl5BanBnXkFtZTcwNzg5MDIyMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Xuan Ngoc Nguyen, Barbara Sonneborn | See full cast and crew »"],
      "reviews": [
         "This is a heartbreaking Oscar-nominated film, 7 years in the making, that brings a war I've only known as history, being 20, to vivid, poignant, and brutally honest life. Sonnenborn brings the Vietnam war home from a bold new perspective- the war's widows, both American and Vietnamese. Sonnenborn herself is such a widow, and so the film's journey to the past begins with her own personal trek to Vietnam, searching for the ordinary field where her husband Jeff was killed. As much as the film depicts the spiritual suffering of American soldiers and their families, it reveals the Vietnamese in the same suffering, a decent people forced to do the unimaginable to survive in war. Sonnenborn brilliantly combines peaceful images of the modern Vietnam with brutal up-front news footage from the war. The soundtrack is a mix of atmospheric music, the testimony of Vietnamese survivors describing their ordeal, and American widows reciting their husbands' words, through letters sent home during the war. I don't know why it is we constantly separate the documentary genre- this is a drama, a social and political film, and just because it has no major actors and relies totally on reality should not disqualify it from showing in your local multiplex. It is a powerful, memorable picture, not just \"another documentary.\" It makes you think and reflect about why we went into war, and it provokes many of the emotions for which we all seek film. \"Regret to Inform\" piercingly reveals how the souls, the humanity, of soldiers and civilians die in war. Seek this film out, whether you lived through Vietnam or not. It will affect you.",
         "This film deeply moved me. I've seen other documentaries about the War, and forgotten them the next morning. I'm still thinking about this one. The juxtaposition of beautiful scenery and truly horrible war stories is very affecting. Everyone in the theater was completely silent throughout the entire film, and EVERYONE stayed for the credits. I think that the women in the movie have a certain emotional honesty that makes the movie much more powerful. It's important to understand the impact that the war had on families and children. Most documentaries focus on the lives of the American soldiers. The music is also very appropriate... It's hopeless trying to review this as a film, I just urge you to watch it.",
         "As a Vietnamese who was born more than 10 years after the Vietnam War, I learned about the War at school, through my parents, through my grandparents; I watched the War on TV, I listened about the War on radio, and I celebrated our victory of the War with my people every April. But then, I rarely think about the War; The War isn't something very real to me, it is history. Watching Regret to Inform, I was saying to myself \"Oh! The War was actually happen, it was real\". The number of deaths is not just raw statistics in my history book, the film make me realized behind the numbers are husbands who had wives and children waited for them. I'm very fortune that both my grandfathers, my uncle, my host dad Mike are not in the statistic. After watching Regret to inform, a moving documentary film with heartbroken testimonies of American and Vietnamese widows of the War, I recognized how careless I'm; I was born only 11 years after the War.",
         "Some have called this documentary 'propaganda,' and I can understand that point of view since there is no mention of Viet Cong atrocities here; but since this was made some thirty years after the war was over, it can hardly be propaganda. It does present a limited point of view, that of the women who suffered because of the war, but that was film maker Barbara Sonneborn's intention. She wanted to show how she personally suffered because she lost her husband in the war and how she has come to grips with that loss, but more than that she wanted to show how other women also suffered and what the war meant to them, including, and perhaps especially, the Vietnamese women. After all, it was their homes that were bombed, not ours. Imbedded within and at the heart of Sonneborn's reflections is the story of Xuan Ngoc Nguyen, the Vietnamese-American woman who served as her translator. Nguyen tells her personal story beginning with the sight of the bombs falling on her village and that of her five-year-old cousin being shot by an America soldier (who became horrified at what he had done). She tells of her stint as a prostitute for G.I.'s, her marriage to an American soldier and her coming to America, the end of her marriage, and the implications of her life afterwards, raising her son and becoming Americanized, and finally her return with Sonneborn to the country of her birth. She is the heroine of this film, a woman who faced the horrors of war, did what she felt she had to do, somehow survived in one piece, and now looks back with tears in her eyes. Sonneborn's documentary owes part of its effectiveness to the contrast between the black and white and fading colored film shot during the war and the brilliant rush of greenery so beautifully photographed today. The effect of seeing the verdant fields of today's Vietnam contrasted with a land torn apart by bombs and sickened with Agent Orange is to show that despite all the damage and death of the war, the fields and those who tend the fields, recover. In this sense--and John Hersey used the same idea in his book, Hiroshima (1946), when he described how the grass grew back after the atom bomb--the futility of war is demonstrated. We kill one another with a ferocious abandonment; nonetheless, the greenery returns, even if, as Carl Sandburg implies in his poem, 'Grass,' it is fertilized by our blood. Consequently this film cannot but play as an indictment of the war in Vietnam, and for some, as an indictment of all wars. I will not argue with that. As anyone who has really thought long and hard about war knows, from Sun Tzu to General Powell, it is always best to avoid the war if that is possible, but there comes a time and a circumstance in which one has no choice. The jury has long since rendered its verdict on the war in Vietnam. We are reminded of that every time we hear a commentator say, 'We don't want another Vietnam.' But there is an enormous difference between the horrendous stupidity of our involvement in Vietnam and the absolute necessity of defending ourselves against the aggression of the fascists and imperialists during World War II. And the war being fought today against terrorism is also one that cannot be avoided. I see Sonneborn's film as a reminder not only of the horror of war, but of our responsibility to be sure that our cause, as Bush has it, 'is just' and our methods restricted to the task at hand, and that the suffering of those involved be ended as soon as humanly possible. (Note: Over 500 of my movie reviews are now available in my book \"Cut to the Chaise Lounge or I Can't Believe I Swallowed the Remote!\" Get it at Amazon!)",
         "A unique documentary film on the Vietnam War and wars in general. Its' focus is on the widows' of war. These are widows' who will always experience the trauma of war. This documentary was made 25 years after the end of the war. Part of it's' focus is on one woman's return to the site her husband had died during the war. The great strength of this film is it also speaks with Vietnamese women whose husbands were killed. Because their country experienced the war directly their stories are very different and more intense. Like other great films on war this clearly points out that one's pain of war never goes away. The war lives on in one's life forever. One woman recounted that she felt her husband's name should have been at the Vietnam Wall in Washington DC. He committed suicide seven years after the end of the war and the reasons' were directly connected to Vietnam. Another woman's husband died from the effects of Agent Orange. In a recent commentary Canadian Romeo Dallaire, who has experienced Post Traumatic Stress Disorder, said that the number of suicides of Vietnam War veterans was far higher than the general population. He said these suicides would raise significantly the count of American war dead from Vietnam.",
         "We ran this film at the \"Normal\" theater, for the Illinois Wesleyan May term series. The director, Barbara Sonneborn, introduced the film, and was on hand after for questions. Our audience was mixed with college students and adults. I am sure the students saw it has history, but the adults had lived this as history. I was one of the adults. Not until this film, did I see the Vietnam war, as more than just a page of history that I missed. During the showing, all you could hear besides the film, was the muffled sound of the projector. After the film, there were 200 plus people on their feet to applaud Barbara.",
         "This unique documentary clearly portrays some of the tragic effects of war on wives of soldiers from both sides of the Vietnam War. (SPOILER) The director (whose husband was killed in action in that war) blames the US and the South Vietnamese governments for those tragedies and fails to mention the dreadful atrocities inflicted by the Vietnamese Communist guerrillas on many innocent South Vietnamese and indigenous tribal men, women, children. Despite this slanted retrospective look, the film is well made and worth seeing. (SPOILER) The film's most redeeming premise is that war indelibly alters the lives of all who suffer the trauma and loss that occurs during wartime."
      ],
      "genres": [
         "Documentary",
         "War"
      ],
      "productionCompanies": ["Sun Fountain Productions"],
      "summaries": ["In this film made over ten years, filmmaker Barbara Sonneborn goes on a pilgrimage to the Vietnamese countryside where her husband was killed. She and translator (and fellow war widow) Xuan Ngoc Nguyen explore the meaning of war and loss on a human level. The film weaves interviews with Vietnamese and American widows into a vivid testament to the legacy of war."],
      "budget": 0
   },
   "movielensId": 3609,
   "movielens": {
      "languages": [""],
      "releaseDate": "1999-01-01",
      "dvdReleaseDate": "2000-05-02",
      "directors": ["Barbara Sonneborn"],
      "runtime": 72,
      "movieId": 3609,
      "title": "Regret to Inform",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "0181786",
      "originalTitle": "Regret to Inform",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "In this film made over ten years, filmmaker Barbara Sonneborn goes on a pilgrimage to the Vietnamese countryside where her husband was killed. She and translator (and fellow war widow) Xuan Ngoc Nguyen explore the meaning of war and loss on a human level. The film weaves interviews with Vietnamese and American widows into a vivid testament to the legacy of war.",
      "tmdbMovieId": 113279,
      "avgRating": 3.57432,
      "releaseYear": "1999",
      "numRatings": 74,
      "posterPath": "/jX5KdaB827m3U9YcYcJlyOPl9YA.jpg"
   }
}