{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "brazil",
            "id": 1161
         },
         {
            "name": "culture",
            "id": 162710
         }
      ],
      "imdb_id": "tt0036326",
      "video": false,
      "title": "Saludos Amigos",
      "recommendations": [
         15947,
         13757,
         20343,
         13465,
         46929,
         13850,
         216971,
         431855,
         82133,
         49948,
         194246,
         313563,
         250480,
         442554,
         238327,
         365279,
         372942,
         383516,
         376477,
         404210
      ],
      "backdrop_path": "/trg7wvn1cVvhltOKIZ789EBexuw.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 14,
               "character": "Joe Carioca",
               "gender": 0,
               "credit_id": "52fe46279251416c7506ef69",
               "name": "José Oliveira",
               "profile_path": "/7BgNCDGiIGchOeXqHp6mn3mFfxz.jpg",
               "id": 77619,
               "order": 0
            },
            {
               "cast_id": 15,
               "character": "Narrator",
               "gender": 0,
               "credit_id": "52fe46279251416c7506ef6d",
               "name": "Fred Shields",
               "profile_path": "/zGkhyK0rYBXa9LRtjtBG5hjkCfT.jpg",
               "id": 566738,
               "order": 0
            },
            {
               "cast_id": 16,
               "character": "Goofy (voice) (archive footage) (uncredited)",
               "gender": 2,
               "credit_id": "5483d46fc3a36829ae0092f3",
               "name": "Pinto Colvig",
               "profile_path": "/iHUSTwJAlqn0OzZpjiZwrkRgzXq.jpg",
               "id": 5462,
               "order": 1
            },
            {
               "cast_id": 17,
               "character": "Himself (uncredited)",
               "gender": 2,
               "credit_id": "5483d4859251416e7e009dc6",
               "name": "Walt Disney",
               "profile_path": "/mrcVG49U2PVm1LpPMmwBtn5ZzOh.jpg",
               "id": 2106,
               "order": 2
            },
            {
               "cast_id": 18,
               "character": "Donald Duck (voice) (archive footage) (uncredited)",
               "gender": 2,
               "credit_id": "5483d4ab9251416e7e009dcd",
               "name": "Clarence Nash",
               "profile_path": "/bEtwgcLncIDovv9qplhTVffQB7e.jpg",
               "id": 78077,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46279251416c7506ef1d",
               "name": "Paul Allen",
               "profile_path": null,
               "id": 77610,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "52fe46279251416c7506ef23",
               "name": "Lee Blair",
               "profile_path": null,
               "id": 77611,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "52fe46279251416c7506ef2f",
               "name": "James Bodrero",
               "profile_path": null,
               "id": 77613,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "52fe46279251416c7506ef35",
               "name": "John P. Miller",
               "profile_path": "/mOHKdXO5sYFaq0wKmliKXjiZYEL.jpg",
               "id": 77614,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "52fe46279251416c7506ef3b",
               "name": "Herbert Ryman",
               "profile_path": "/hRZl0xJjOnTXvF7jsYB0OEgdAnY.jpg",
               "id": 77615,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "52fe46279251416c7506ef41",
               "name": "Charles Wolcott",
               "profile_path": "/gQjga5gwIA3B9CdsYt46E4wFMYg.jpg",
               "id": 3642,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe46279251416c7506ef47",
               "name": "Edward Plumb",
               "profile_path": "/6OnntWx7VA25DhxwtnngZ89Cl5W.jpg",
               "id": 31021,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46279251416c7506ef4d",
               "name": "Paul J. Smith",
               "profile_path": "/y8Z9LQ1vAVWqpjfMOYNmSs6mZd0.jpg",
               "id": 2107,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46279251416c7506ef59",
               "name": "Jack Cutting",
               "profile_path": "/70tV3waJkgbZOh0OXFowFGBRUab.jpg",
               "id": 77616,
               "department": "Visual Effects",
               "job": "I/O Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "52fe46279251416c7506ef5f",
               "name": "F. Molina Campos",
               "profile_path": null,
               "id": 77617,
               "department": "Crew",
               "job": "Thanks"
            },
            {
               "gender": 2,
               "credit_id": "52fe46279251416c7506ef65",
               "name": "Wilfred Jackson",
               "profile_path": "/iQgvspjL7upXGHSG6EbOuzBMg3Y.jpg",
               "id": 11434,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "54e4b46f925141454f0090de",
               "name": "Norman Ferguson",
               "profile_path": "/o6ZqI5lXaQW3q05ri2WyMUZKYLg.jpg",
               "id": 226599,
               "department": "Production",
               "job": "Production Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "565dd093c3a3687ced002ecf",
               "name": "Mary Blair",
               "profile_path": "/vf3PzRot9sDJq7j884RnhTf25yj.jpg",
               "id": 77612,
               "department": "Art",
               "job": "Conceptual Design"
            },
            {
               "gender": 0,
               "credit_id": "564fc5f39251414af90052ee",
               "name": "Merle Cox",
               "profile_path": null,
               "id": 149217,
               "department": "Art",
               "job": "Background Designer"
            },
            {
               "gender": 2,
               "credit_id": "5658bdddc3a3683080003b4b",
               "name": "Wolfgang Reitherman",
               "profile_path": "/p9ywBLS3Pvv3BcocjLsPwnll6mc.jpg",
               "id": 57314,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 2,
               "credit_id": "565a183b92514161be000d28",
               "name": "Milt Kahl",
               "profile_path": "/olKWgwkVShdJnRJRZ4Po6uK0iq6.jpg",
               "id": 138170,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 2,
               "credit_id": "5833c05f925141274200590d",
               "name": "William Roberts",
               "profile_path": "/mkfgT5RdFbFOwJpigXWALq9hOvz.jpg",
               "id": 11427,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5833c06fc3a36833870056b4",
               "name": "Hamilton Luske",
               "profile_path": "/xeyWJsFlMtgjyfZnnElMnc6qFF6.jpg",
               "id": 11429,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5833c08bc3a3683399005ed8",
               "name": "Jack Kinney",
               "profile_path": "/9KEkI1NTzsxU1jLEuBsF22F51cr.jpg",
               "id": 74565,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 5.811503,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 14906,
      "vote_count": 86,
      "budget": 0,
      "overview": "Live-action segments show members of the Disney staff touring South America and recording their impressions in sketches. These segue into four animated sections: \"Lake Titicaca\" depicts tourist Donald Duck's troubles with a stubborn llama; and in \"Aquarela do Brasil,\" Jose Carioca shows Donald the sights and sound of Rio de Janeiro.",
      "similar": [
         598,
         46195,
         666,
         1724,
         7347,
         58496,
         11416,
         206563,
         303,
         245913,
         8833,
         435129,
         47931,
         9796,
         310569,
         1653,
         9749,
         8440,
         7343,
         5203
      ],
      "original_title": "Saludos Amigos",
      "runtime": 42,
      "poster_path": "/ymwQgTSLExdlvOGnQ0doD5alWVj.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Português",
            "iso_639_1": "pt"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/n53F7K9scQWFXYbrCablqLKqJdp.png",
            "name": "RKO Radio Pictures",
            "id": 6,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Walt Disney Productions",
            "id": 3166,
            "origin_country": ""
         }
      ],
      "release_date": "1942-08-24",
      "vote_average": 5.8,
      "belongs_to_collection": {
         "backdrop_path": "/sAD5l7OosB7iczcOfMtnswODCBd.jpg",
         "name": "Caballeros Collection",
         "id": 271668,
         "poster_path": "/yzG4MDr16TRl0EINL8E2bv56hLy.jpg"
      },
      "tagline": "Walt Disney goes South American in his gayest musical Technicolor feature",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Wilfred Jackson",
         "Jack Kinney"
      ],
      "runtime": 42,
      "synopsis": null,
      "writers": [
         "Ted Sears",
         "William Cottrell"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0036326/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU0MjI1MTk3OF5BMl5BanBnXkFtZTcwOTcxMDcxMQ@@._V1_SY317_CR9,0,214,317_AL_.jpg",
      "actors": ["Stars: Fred Shields, José Oliveira, Pinto Colvig | See full cast and crew »"],
      "reviews": [
         "Animators on assignment from Walt Disney tour South America (along with Donald Duck!) to soak up new cartoon ideas. This long-unseen Disney item is full of color and music, but is obviously a holding-pattern release for the company. I watched the film on video, coupled with the quite-entertaining additional 20-minute documentary which regales even more of the non-animated adventures. Never too popular with the kids, probably because a major cartoon segment involving Pedro the Airplane isn't very funny and lacks the local flavor. Otherwise, some visually dazzling bits but not as good as the similar \"The Three Caballeros\", released in the US in 1945. **1/2 from ****",
         "This more than any other film shows the plight of the Disney studio in the years following \"Snow White\" and \"Pinocchio\". WWII had broken out, cutting off Disney's European market. In addition, striking cartoonists and their formation of a guild/union meant that the massive about of labor needed to create a \"Snow White\" or a \"Pinocchio\" now amounted to a substantially higher production cost then either of those two films (which had not been cheap to begin with). Thus, Disney was trying to explore new ways to both package his product for another market, as well as develop new product. They released this movie and capitalized on the then-popular South American craze. Now, however, it looks dated. You can still it watch it though and see the genesis for several of Disney's later films: \"The Three Caballeros\" and the whole \"How-To\" Goofy series are the most obvious.",
         "Like it's sequel, \"Three Caballeros,\" \"Saludos Amigos\" was made to improve the relations between North and South America and to expose Northerners to Latin American culture. Great music and great fun, though the Latin American culture is a bit sugar-coated. A great family film though the concepts of inter-continental neighborship will go right over the kid's heads.",
         "When I first heard that Disney was going to release a number of films from the early years which had been \"almost forgotten,\" I was very intrigued. Would there be another Sleeping Beauty or Fantasia hiding out there? Sadly, Saludos Amigos falls very short of \"Disney classic\" status. It is basically forgettable. There are a few smile-inducing moments, but overall the piece really does feel like a \"keep the Sudamericanos on our side against the Nazis\" period piece from the WW2 era. It's strange to watch a movie made in 1943 with live action sequences of South America looking so peaceful and unaffected by the world's events. Sure, the region was less involved in WW2 than many other regions... but, it is still strange to watch. Anyway, I'd sum it up thusly: 1. Worth buying if you are a Disney collector and 2. Worthy of note simply to see live shots of Buenos Aires, Lago Titicaca, and Rio de Janeiro, filmed almost 60 years ago. Other than that, you can skip this one.",
         "I think the reviews of the other posters has been pretty accurate. It is very nice in the era of pixar to see the lush animation of Disney. The special feature South of the Border is fascinating. I hope these Disney travelogues are preserved and digitally enhanced because it would be a great shame to lose them. The picture quality is poor but it is better than not having any recollection at all. The narration is pure Disney and its all about the research that went into the main feature. Of course its testimony to history that seen through the eyes of middle upper class Americans its not really as accurate as Walt thought it was. Some of the facts are not facts at all. They call one creature a rabbit in the documentary but its certainly not a rabbit. It is a capybara. In the cartoon they even have an ostrich in South America!! Still despite the flaws the documentary is a charming bonus with some nostalgic images. Saludos is a pretty good cartoon although I thought the little aeroplane story was quaint it is anthromorphism gone crazy. Everyone's favourite duck with a speech impediment is fun. I never understood a word Donald said but loved his attitude. Goofy steals the movie. It took me years to realise Goofy was a dog! Its a pleasant Disney movie while not being a great one.",
         "While I may have commented on a number of occasions that Disney documentaries were well-intentioned but highly flawed pieces of work I should also say that they are still well worth seeing when placed in a historical context. Many of the earlier outings from The House Of Mouse managed to show people parts of the world and natural spectacles that they otherwise would have remained completely unaware of. In this respect, the older movies still hold a certain cultural value. Sadly, I still hold the opinion that most of the stuff they put out nowadays in that field (e.g. African Cats) is a waste of time and nothing more than sanitised stories indoctrinating youngsters into the Disney worldview. But let's get to Saludos Amigos, something that I found surprisingly enjoyable. It runs for about 40 minutes and is really just a few cartoons linked by footage of Disney animators visiting Latin America. We get to see some local colour and lovely scenery and we also get cartoons with the following plot lines: 1) Donald Duck visits Lake Titicaca, meets some local folk and gets in a right mess with a stubborn llama. 2) Pedro, a small airplane, sets off on his first perilous journey to pick up mail and bring it home. 3) Goofy is transported from his cowboy life to show what it is like to be a gaucho. 4) \"Watercolor Of Brazil\" mixes wonderful music with great visuals as an animator paints a number of lovely, Latin American scenes and then lets Jose Carioca (a cool parrot) introduce Donald Duck to the fun and exuberance of the Samba. As usual with Disney features of this kind, a number of people took charge of the different sequences and stories. Thankfully, they all do a very good job. The weak spot may be \"Pedro\" but it's still bearable enough in a film with such a short runtime and the other cartoons and snippets of footage from the areas visited more than makes up for that one poor segment. I certainly wouldn't call it an essential viewing for Disney fans but it's very enjoyable, especially if you like Goofy and Donald Duck, and I'd recommend picking it up if you ever stumble across it at a bargain price.",
         "\"Saludos Amigos\" is a very short full-length film that actually consists of several short films created as a result of Walt Disney's good will tour of South America just before the US entered WWII. This tour is discussed at length in the documentary \"Walt & el Groupo\" and \"Saludos Amigos\" is a special feature included on this disk--though it was originally released in theaters in 1942. I know some will be shocked when they read this, but the fact is that the two feature films created as a result of this trip were pretty poor--mostly because they came off more like travelogues than the typical Disney film. IN addition, they simply are not fun and kids will hate them. Of the two, \"Saludos Amigos\" is the best--but it still is sub-par Disney. It consists of several shorts all released together instead of separately. Apparently Disney realized that the shorts had very limited marketability, so he had them bundled together and released. Imagine how sad people must have felt when they saw this dull stuff! The first short involves Donald Duck in Peru. While it has a few moments, it comes off as a dull travel film and not much more. Then, the film switches to an odd and not particularly entertaining film about a tiny plane called Pedro. This really seemed to have little to do with Chile. Then, footage of Walt and his employees visiting the Argentine gauchos is shown--followed by a short featuring Goofy as one of these cowboys. It's a lot like the typical Goofy educational film and shows the differences between the American and Argentinian versions. This is probably the best short of the four in the film but once again, it's far from their best work. Finally, the film jumps to Rio where there is a lot of samba music and lots of footage of Carnival and the short \"Watercolor of Brazil\". The music is the same title music to the Terry Gilliam film \"Brazil\"--a film about as different from this Disney film as you could imagine. This short features Donald Duck and a new character, Joe Carioca--a talking parrot. Mostly you just see them dancing about to samba music and they don't have a lot of personality...or fun. Overall, a pretty dull lot but made a bit better if you see the accompanying documentary. I certainly wouldn't recommend you rush out to see this.",
         "I vaguely remember this cartoon from my childhood. Personally, I don't even find it a particularly interesting piece of Disney fiction and magic. The movie is divided in four segments across the South America, I can only remember three of them though: one in Lake Titicaca where tourist Donald Duck fumbles with a stubborn llama; a rather dull segment about an airplane on a perilous journey across the Andes... This definitely is not the stuff Disney is famous for! However, the last segment, lovely titled 'Aquarelas do Brazil' makes the whole show worthwhile. It follows nothing less than the birth of the amazing José Carioca, a Brazilian parrot who'd go on to become one of the most famous Disney characters in South America! I fondly remember reading his adventures in comics as a child. The cartoon doesn't yet show Carioca with his characteristic traits, namely a mixture of tramp/conman figure who's always broke but always succeeds through luck and wit. In 'Saludos Amigos' he's still in his infancy although one already sees his love for fun and folly. Priceless is watching him teach Donald Duck how to do the Samba and both hitting all the nightclubs in Rio de Janeiro bringing to life the exuberant life of the '40's Brazil! Also beautiful is the song 'Aquarela do Brazil,' which Terry Gilliam would later use in his masterpiece, 'Brazil,' which I've recently seen and made me reminisce about this long-forgotten piece of my childhood.",
         "This is the fore runner of the many of the Disney TV shows of the 50's, 60's and 70's, mixing live action travel footage with cartoons that tie into the subject.It is also the first of the multi-short film that Disney would release as feature through the 1940's and early 1950's, but its one of the better ones since the pieces are all about on the same level. This, to me, is a better film than the Three Caballeros which followed it and which more people know about than this. There are really only only four shorts, Donald a tourist, Goofy as a gaucho, Pedro the mail plane, and a piece set to the song Brazil that introduces Joe Carioca. The real problem with this film is it just stops. Brazil ends and so does the movie. I know they say leave them wanting more but this is ridiculous. This is a renter. The DVD box says its 75 minutes, but only if you include the short documentary, which is almost as long as the movie itself. If you and your kids like it, then buy it, but its too little to be throwing 20 bucks away on.",
         "This feature was made to improve relations with South America. It features a few animated shorts with live action breaking the scenes up. The live action is designed to teach about South American culture. I am someone who really likes this feature (even though it is short). I love the scene with Jose Caricoa (sp?) where Donald can't pronounce his name. \"Joe-say...\". I would watch this at my old job at a video store every chance I got! I would recommend it to everyone, but since some people are not impressed with this feature I would suggest renting it first. Overall very good!!!"
      ],
      "genres": [
         "Animation",
         "Short",
         "Family",
         "Fantasy",
         "Music"
      ],
      "productionCompanies": ["Walt Disney Productions"],
      "summaries": [
         "Live-action segments show members of the Disney staff touring South America and recording their impressions in sketches. These segue into four animated sections: \"Lake Titicaca\" depicts tourist Donald Duck's troubles with a stubborn llama; \"Pedro\" tells of a little mail plane's adventures flying over the treacherous Andes; \"El Gaucho Goofy\" transplants an American cowboy into the Argentine pampas; and in \"Aquarela do Brasil,\" Jose Carioca shows Donald the sights and sounds of Rio de Janiero.",
         "Disney animators tour South America and present four animated shorts inspired by their trip."
      ],
      "budget": 0
   },
   "movielensId": 3611,
   "movielens": {
      "languages": [
         "English",
         "Português"
      ],
      "releaseDate": "1942-08-24",
      "dvdReleaseDate": "2004-03-02",
      "directors": [
         "Wilfred Jackson",
         "William Roberts",
         "Hamilton Luske",
         "Jack Kinney"
      ],
      "runtime": 42,
      "movieId": 3611,
      "title": "Saludos Amigos",
      "mpaa": "NR",
      "actors": [
         "José Oliveira",
         "Fred Shields",
         "Pinto Colvig",
         "Walt Disney",
         "Clarence Nash"
      ],
      "imdbMovieId": "0036326",
      "originalTitle": "Saludos Amigos",
      "genres": [
         "Animation",
         "Family"
      ],
      "youtubeTrailerIds": ["3S1lgfZKdbY"],
      "plotSummary": "Live-action segments show members of the Disney staff touring South America and recording their impressions in sketches. These segue into four animated sections: \"Lake Titicaca\" depicts tourist Donald Duck's troubles with a stubborn llama; and in \"Aquarela do Brasil,\" Jose Carioca shows Donald the sights and sound of Rio de Janeiro.",
      "tmdbMovieId": 14906,
      "avgRating": 2.93919,
      "releaseYear": "1942",
      "numRatings": 148,
      "posterPath": "/ymwQgTSLExdlvOGnQ0doD5alWVj.jpg"
   }
}