{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "hotel",
         "id": 612
      }],
      "imdb_id": "tt0096259",
      "video": false,
      "title": "Things Change",
      "recommendations": [
         88818,
         47701,
         69828,
         48609,
         139324,
         42176,
         20858,
         161460,
         29786,
         22828,
         30653,
         27397,
         15506,
         27224,
         38096,
         70259,
         31674,
         39074,
         34014,
         27465
      ],
      "backdrop_path": "/fDiTpSgyV2H1r8jT37g63pHbb8c.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Gino",
               "gender": 2,
               "credit_id": "52fe4841c3a36847f815e6db",
               "name": "Don Ameche",
               "profile_path": "/q4t9dds6jQuuqpMLvALbOqVJRFV.jpg",
               "id": 18156,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Jerry",
               "gender": 2,
               "credit_id": "52fe4841c3a36847f815e6df",
               "name": "Joe Mantegna",
               "profile_path": "/vd83KyKwcNrxd6EDcezGv16xhsL.jpg",
               "id": 3266,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Joseph 'Don Giuseppe' Vincent",
               "gender": 2,
               "credit_id": "52fe4841c3a36847f815e6e3",
               "name": "Robert Prosky",
               "profile_path": "/9xpt96AOur6MmLIEaYhRiCQLIOE.jpg",
               "id": 10360,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Frankie",
               "gender": 2,
               "credit_id": "5783f45392514121b2000e38",
               "name": "J.J. Johnston",
               "profile_path": null,
               "id": 89461,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Mr. Silver",
               "gender": 2,
               "credit_id": "5783f460c3a3681795000ee2",
               "name": "Ricky Jay",
               "profile_path": "/d9x2dXr37z20yYBpDW4HLY7lrUS.jpg",
               "id": 10743,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Mr. Green",
               "gender": 2,
               "credit_id": "5783f46ec3a3681798000fa5",
               "name": "Mike Nussbaum",
               "profile_path": "/gcsqhh40flXDPJ9s3U6clD9Jb59.jpg",
               "id": 9628,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Repair Shop Owner",
               "gender": 2,
               "credit_id": "5783f47c92514121c1000ec3",
               "name": "Jack Wallace",
               "profile_path": "/83wIH9unPcgk1lIIqYcojhVyOOP.jpg",
               "id": 24435,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Butler",
               "gender": 2,
               "credit_id": "5783f485c3a3681791000fb5",
               "name": "Dan Conway",
               "profile_path": null,
               "id": 940929,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Wheel of Fortune Girl",
               "gender": 1,
               "credit_id": "5783f49792514121c4000ebe",
               "name": "Felicity Huffman",
               "profile_path": "/l1o0j6oWzdVX3gxxpumLNq3nK42.jpg",
               "id": 7427,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4841c3a36847f815e6e9",
               "name": "David Mamet",
               "profile_path": "/gyEERG5App4yST1ivDc8t9JrsjP.jpg",
               "id": 1255,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5783f4a692514121c4000ec8",
               "name": "David Mamet",
               "profile_path": "/gyEERG5App4yST1ivDc8t9JrsjP.jpg",
               "id": 1255,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5783f4b1c3a368179b000f75",
               "name": "Shel Silverstein",
               "profile_path": null,
               "id": 1115092,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 2.110305,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 52770,
      "vote_count": 17,
      "budget": 0,
      "overview": "Jerry, a misfit Mafia henchman, is assigned the low-level job of keeping an eye on Gino, a shoe repairman fingered by the Mob to confess to a murder he didn't commit. But Gino's mistaken for a Mafia boss, and the two are suddenly catapulted to the highest levels of mobster status. Only friendship will see them through this dangerous adventure alive!",
      "similar": [
         5,
         120467,
         132344,
         48650,
         255,
         7303,
         11950,
         1278,
         88,
         786,
         9029,
         539,
         3594,
         76492,
         159824,
         153,
         612,
         254320,
         97630,
         65496
      ],
      "original_title": "Things Change",
      "runtime": 100,
      "poster_path": "/rJZEpf9YBsXkqDoiN83V5LdyBdK.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [{
         "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
         "name": "Columbia Pictures",
         "id": 5,
         "origin_country": "US"
      }],
      "release_date": "1988-10-21",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "Dealing with the mob is always a gamble.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["David Mamet"],
      "runtime": 100,
      "synopsis": "Two Chicago gangsters go to Gino's shoe store and request that he meet them later by giving him a $100 bill. At that meeting, one of the gangsters tells Gino that an important man has been \"mistakenly identified\" as a killer, and shows him a picture of the man, who bears a striking resemblance to Gino. His chief, Mr. Green, explains that if Gino would serve 3-5 years in prison for confessing to the crime, they will pay him enormously, providing a boat for him to live in Sicily. Gino reluctantly agrees, and Mr. Green gives him an old Sicilian coin in gratitude. Jerry is another gangster assigned to take Gino away for a few days to train him on the story for his confession; if he does the job well, Jerry hopes to get off \"probation\" with his mafia bosses. After some time training in a hotel room, Jerry decides to take Gino to Lake Tahoe for two days of pleasure before he has to go to prison. Jerry bumps into an old associate and tries to impress him that Gino is critically important in the mafia, a ruse he carries on when they arrive at a resort, where they are given an elaborate suite and showered with fantastic service, all for not cost. The two men go to the casino with unlimited credit, where Jerry arranges for Gino to win a little on a rigged roulette table, but Gino accidentally wins $35 grand and Jerry is relieved when he loses it all on another game. He handles the loss graciously, saying, \"Things change.\" The gamble gets Gino a lot of attention, including the services of two showgirls. Jerry is upset the next morning when he temporary thinks that Gino has left with the girls, then becomes more concerned when two unknown gangsters show up to invite them to lunch with a local boss, Don Giuseppe. Jerry tells him to not talk business during the meeting. At first Don Giuseppe suspects a problem, but when Gino shows him the Sicilian coin, they bond. The two men walk along the lake, bonding further, and Don Giuseppe invites him to spend the night. Jerry goes back to the resort, and is shocked to learn that Mr. Green is part of a huge mafia meeting at the home of Don Giuseppe that night. Jerry labors to get Gino out before they all cross paths, and steals a car to do so. The car runs out of gas and they don't have the money to fill it up, until Gino happens to see the two showgirls at a gas station and they give him some cash. With that, Jerry drives Gino back to their hotel in Chicago, and they talk about how they will fish together in a few years in Sicily. Jerry suddenly gets a pang of conscience and begs Gino to not go through with the deal. Gino insists that he's given his word, and must honor it. A gangster shows up to take them to court, but tells Jerry that their boss plans to have Gino killed, by Jerry. Meanwhile, Gino walks out to the shore of Lake Michigan, and Jerry beats down the gangster in distress. Gino suddenly gets the idea to call Don Giuseppe to ask for his help. At a court hearing, the judge sentences that other gangster-- disguised as his boss-- to life in prison. Gino and Jerry repair shoes back in his shop. They look at each other and shrug.",
      "writers": [
         "David Mamet",
         "Shel Silverstein"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0096259/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU0NTEwMjMxMF5BMl5BanBnXkFtZTcwMjA2ODkxMQ@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Don Ameche, Joe Mantegna, Robert Prosky | See full cast and crew »"],
      "reviews": [
         "Don Ameche plays a wonderful portrayal of an Italian Shoe repair man thrown into a world of mobsters. Somehow this has very little effect on his spirit or mood, and at the same time driving his caretaker(Joe Mantegna)absolutely insane. By the end of it's whirlwind tour you realize that the old man is very wise in taking it all in stride.It's especially good if you are a fan of Mafia movies like The Godfather and such because it shows a lot of really typical mob types to keep you interested. This movie is a very laid back comedy that would entertain people from many different walks of life. I just told someone the other day that it's the best movie I know of that no one has heard of. If you get a chance see it!",
         "Mamet is intrinsically the classical playwright. Things may change in life but the classical playwright begins the story with a shoe shine setting up his corner in the cobbler's shop and ends the story with a shoe shine. Even the mid-point of the film, when the 3 day dream is about to end, there is the short lecture on how to shine shoes. Though all the actors provide commendable performances, the flow of the story is absorbing. There is a layer of human values and honesty that permeates the world of murders and mafia thugs. Mamet is able to use such contradictions to great effect--threats stated with considerable politeness, women who are apparently in charge (the woman overseeing the arrangements for the meal at the house, the mafia wife/moll in blue) and yet play no significant role, teasing the viewer as it were, use of hats and newspapers to cover faces that seem ridiculous as the story unfolds.. The epilogue makes you wonder if things do change. Change for one may not be change for another. Change for one may come in economic terms, for another in friendship. Early Mamet's work seems to neglect women characters. I wonder why this is so evident.",
         "\"Things Changes\" is a light-hearted look at what happens to an old Italian shoe shiner (Ameche) who's a naive patsy for the mob when a mafia flunky (Mantegna) takes them two of them to Tahoe for a last blast. This Mamet film has a lot of pluses not the least of which is Mantegna and Ameche together in one of Ameche's last films. The story is a cute comedy with a kind of sentimental \"feel\" to it. The kind of movie that's hard not to like.",
         "I loved this picture. Mantegna and Ameche are so opposite and I really can't share the view of other people that Ameche is performing a \"Being There.\" Ameche is much smarter, he realizes from the start something is wrong. First he declines the offer but he knows perfectly well these people will shoot him (remember the scene with the smoking lady). Then, the movie starts, and he's in charge, and he keeps in charge, he accepts a luncheon with a Don in LA., he finds money to get back to Chicago, he uses his coin to call the Las Vegas mob. Nice, entertaining, two and a half stars. I laughed quite a bit. Must be my Italian roots.",
         "Obviously, by my rating, you know I love this film. It is a desert island disc. I read the other reviews and have some comments. These are not criticisms of others criticisms or accolades, just my own thoughts after having seen the movie so many times. Having never been in the mafia myself (and I suspect that none of the other people rating this movie have been either), I find this work consistent with our cinematic understanding of the mafia. First of all, if the mafia does ask you for a favor which it thinks is fair sounding and you decline, depending upon the favor asked, security may demand that you be silenced (killed). Secondly, our cinematic understanding of the mafia also says that very few people, even in the mafia, truly know who, as it is put in the movie 'the man behind the man behind the man' might be. So, when the hotel staff and low level mafia flunkies (hooray for the blond WHM!) at the other end of the country, who are expecting to meet people they don't know, accept DA as someone very important, this is realistic. And with such a classic mafia stereotype as JM's character as front man, DA as shoe shine turned mafioso really sells. After all, DA is Italian and distinguished looking... as well as very old school. As for DA's new mafia friend, it is quite clear in the movie that the luck and skill of DA's character actually traversed some very high barriers to survive and flourish in the situation. While the premise of the circumstance of the ending may be predictable (I don't want to give it away), the actual final actions and outcome are definitely not expected. As for comparison to Mamet's other works, stage and screen, perhaps this isn't his \"best.\" But in terms of appeal, it reaches many more people than most of his work... and in such a pleasing way without being daft. Entertainment and emotional appeal are not vices, even for Mamet. And just because a movie makes you smile and laugh, that doesn't make it a comedy... merely comedic. This is a dark drama, a human study, and features friendship and betrayal. Perhaps the comedic and light-hearted aspects are merely the glue that holds this piece so well together. The glue may be on the surface, but that doesn't mean it doesn't function here. Frankly, I absolutely love House of Games, but a little more comedic treatment might have even improved that masterpiece. One can like Mamet and like smiling as well.",
         "This is a quiet, enjoyable film with Mantegna playing Mantegna, the nervy, edgy man who thinks he is smarter than everyone else but needs to go back to school for a few more lessons. He is saved by Ameche, a little man who plays a fool to get by in a dangerous world, never letting anyone know if it is an act or real. He lets the cat out of the bag in the bath house scene, when he opens his mouth and out comes this magnificent version of \"Return to me\" but in Italian. The film has one problem once the pair arrive in Tahoe, Mantegna passing the gentle shoe shine man off as a Capo. It's quite funny to watch everyone bow and scrape in those scenes from the arrival at the airport until they settle into their suite, but after that Mamet has a problem. Where do he go from here? The ending is predictable, but any other would have chased patrons out of the theater in anger.",
         "In David Mamet's taciturn comedy of errors a simple Sicilian shoe-shiner is hired to take the prison rap for a mob hit man, in return for anything he desires after his release (all he wants is a boat). But the plan goes quietly haywire when his minder decides to treat him to a final weekend fling at Lake Tahoe, where the old man is mistaken for a mafia don from Chicago. Any other director might have played it for easy laughs, but even in such a whimsical mood Mamet is still a very careful, very deliberate filmmaker, and he approaches each scene with the same attention to nuance emphasized in every line of his trademark dialogue. It's a comedy of smiles more than belly laughs, summed up best by Shoe-shiner Don Ameche's childlike air of bewilderment and naïve trust in everyone around him (shades of Chance the gardener in Jerzy Kosinski's 'Being There'). Nothing seems to trouble him, because he knows a secret most people take for granted: the more things change, the more they stay the same.",
         "In \"Things Change\" David Mamet applies his direct, unique directorial style to the classic \"Being There.\" Each is similar thematically, and each leave the viewer with a sense of wonder and affection (for either the film or the characters), however Mamet is not quite as effective as Hal Ashby in that respect. Mamet uses his friends in many of the roles as in many of his movies, and they all fit perfectly. The cast is as strong as the writing and direction, which you know Mamet has filled with surprises. This is a movie that is entertaining and rewarding, a combination seen all too infrequently in modern films.",
         "Things Change is one of my favorite David Mamet films. If you don't know who David Mamet is by now you are a lost cause when it comes to film. For those of you that don't know, he is one of the best director/screenwriters of his Generation and I would put his body of work against any of the great directors and maybe make the case that he is the best. I like most of his work and I loved this film. Things Change is a story driven by great characters and great circumstance. The acting, directing, writing, cinimatography are superb. Don Ameche in one of his last roles on film is awesome as Gino the shoemaker and Joe Mantegna is perfectly cast as Jerry the flamboyant low level mobster on the outs with his boss. Some great performances here, this is a definite can't miss for any guy that likes mob pictures. Check it out, 10 to 1 says you love it.",
         "Maybe I'm a sucker being a Don Ameche fan, but, I completely enjoyed the flick. It was light, great entertainment. There was no message or hidden meanings, nothing that is going to be compared to Citizen Kane or The Godfather. It's fun seeing William H. Macy in an early role. It's fun seeing Joe Mantegna in a role he perfectly fits into. I had a smile on my face at the end of the movie. That is a winner in my book. No big twists in the movie, it pretty much turns out as you expect it to. But, if you don't have a great liking, if not a love, for Don Ameche's character by the end of the movie, then you probably hate Frank Capra movies, also."
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Drama"
      ],
      "productionCompanies": [
         "Columbia Pictures Corporation",
         "Filmhaus"
      ],
      "summaries": ["Gino, an Italian-American shoe-shiner with a remarkable similarity to a certain mafia don, is paid to take the rap for a murder. Jerry, a two-bit gangster on probation, is given a chance for redemption by guarding Gino for the weekend. But instead of sitting around a dingy hotel room, Jerry decides to give Gino a weekend to remember, taking him to Lake Tahoe. Jerry's bragging to his friends of his important charge, as well as Gino's dignified, quiet demeanor, soon result in much complication for them both."],
      "budget": 0
   },
   "movielensId": 3613,
   "movielens": {
      "languages": [
         "English",
         "Italiano"
      ],
      "releaseDate": "1988-10-21",
      "dvdReleaseDate": "2000-05-02",
      "directors": ["David Mamet"],
      "runtime": 100,
      "movieId": 3613,
      "title": "Things Change",
      "mpaa": "PG",
      "actors": [
         "Don Ameche",
         "Joe Mantegna",
         "Robert Prosky",
         "J.J. Johnston",
         "Ricky Jay",
         "Mike Nussbaum",
         "Jack Wallace",
         "Dan Conway",
         "Felicity Huffman"
      ],
      "imdbMovieId": "0096259",
      "originalTitle": "Things Change",
      "genres": [
         "Drama",
         "Comedy",
         "Crime"
      ],
      "youtubeTrailerIds": ["jIXL5ilQZaY"],
      "plotSummary": "Jerry, a misfit Mafia henchman, is assigned the low-level job of keeping an eye on Gino, a shoe repairman fingered by the Mob to confess to a murder he didn't commit. But Gino's mistaken for a Mafia boss, and the two are suddenly catapulted to the highest levels of mobster status. Only friendship will see them through this dangerous adventure alive!",
      "tmdbMovieId": 52770,
      "avgRating": 3.61281,
      "releaseYear": "1988",
      "numRatings": 359,
      "posterPath": "/rJZEpf9YBsXkqDoiN83V5LdyBdK.jpg"
   }
}