{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "hawaii",
            "id": 1668
         },
         {
            "name": "gambling debts",
            "id": 5305
         },
         {
            "name": "woman between two men",
            "id": 7439
         },
         {
            "name": "wedding",
            "id": 13027
         }
      ],
      "imdb_id": "tt0104438",
      "video": false,
      "title": "Honeymoon in Vegas",
      "recommendations": [
         10859,
         6071,
         10169,
         9409,
         9440,
         10660,
         19382,
         14361,
         31000,
         12772,
         10013,
         13203,
         10765,
         18172,
         11310,
         11967,
         10694,
         10433,
         13665,
         12157
      ],
      "backdrop_path": "/gaRVg06EmJSxCyddFDji3QNAx9j.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Jack Singer",
               "gender": 2,
               "credit_id": "52fe44f29251416c7504672b",
               "name": "Nicolas Cage",
               "profile_path": "/fW37Gbk5PJZuXvyZwtcr0cMwPKY.jpg",
               "id": 2963,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Tommy Korman",
               "gender": 2,
               "credit_id": "52fe44f29251416c75046727",
               "name": "James Caan",
               "profile_path": "/g4bxNXWft1jLZX8gKk4G6ypkTUf.jpg",
               "id": 3085,
               "order": 1
            },
            {
               "cast_id": 13,
               "character": "Betsy / Donna",
               "gender": 1,
               "credit_id": "52fe44f29251416c7504675f",
               "name": "Sarah Jessica Parker",
               "profile_path": "/chjO3dDzkT7UzAZk1AGjXdbezyg.jpg",
               "id": 520,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Chief Orman",
               "gender": 2,
               "credit_id": "52fe44f29251416c75046733",
               "name": "Peter Boyle",
               "profile_path": "/hAZw6rJlAemlqND09Km7qGvpZ6D.jpg",
               "id": 1039,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "Mahi Mahi",
               "gender": 2,
               "credit_id": "56060ad4925141305800099c",
               "name": "Pat Morita",
               "profile_path": "/eMLWaQ2uQIpiyVeaU7xl0ozs2B7.jpg",
               "id": 23915,
               "order": 4
            },
            {
               "cast_id": 3,
               "character": "Bea Singer",
               "gender": 1,
               "credit_id": "52fe44f29251416c7504672f",
               "name": "Anne Bancroft",
               "profile_path": "/ydabiabIsMBe2HsNmx43gBpqzxx.jpg",
               "id": 10774,
               "order": 5
            },
            {
               "cast_id": 5,
               "character": "Tony Cataracts",
               "gender": 2,
               "credit_id": "52fe44f29251416c75046737",
               "name": "Seymour Cassel",
               "profile_path": "/atWyQvsLNjmXP5dxsOiaf5Qg9j.jpg",
               "id": 5950,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Johnny Sandwich",
               "gender": 2,
               "credit_id": "53c3d7dfc3a3684cdf009e79",
               "name": "Johnny Williams",
               "profile_path": "/ft15amt3pyRLYG8iOjHlgS3nLaf.jpg",
               "id": 53401,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Little Elvis (as Bruno Hernandez)",
               "gender": 2,
               "credit_id": "596f9d29c3a3686b04010913",
               "name": "Bruno Mars",
               "profile_path": "/535a6grD6XtGwnVQA6OypLjUQvB.jpg",
               "id": 969218,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Buddy Walker",
               "gender": 2,
               "credit_id": "5a7b95db9251414b1200422c",
               "name": "Tony Shalhoub",
               "profile_path": "/jXzlVxS8u64XEZUoNPiuhGcQXDW.jpg",
               "id": 4252,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe44f29251416c7504673d",
               "name": "Andrew Bergman",
               "profile_path": "/gTx35MhqW8MlGv7JlYnCJQClebi.jpg",
               "id": 41550,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f29251416c75046743",
               "name": "Andrew Bergman",
               "profile_path": "/gTx35MhqW8MlGv7JlYnCJQClebi.jpg",
               "id": 41550,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f29251416c75046749",
               "name": "Mike Lobell",
               "profile_path": null,
               "id": 31143,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f29251416c7504674f",
               "name": "David Newman",
               "profile_path": "/vncTIJaBWoYmpdNCPkDnA8hT3PM.jpg",
               "id": 3393,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f29251416c75046755",
               "name": "William A. Fraker",
               "profile_path": null,
               "id": 12846,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f29251416c7504675b",
               "name": "Barry Malkin",
               "profile_path": null,
               "id": 2988,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f29251416c75046765",
               "name": "Neil A. Machlis",
               "profile_path": null,
               "id": 8880,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 9.588688,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 12518,
      "vote_count": 99,
      "budget": 25000000,
      "overview": "On her deathbed, a mother makes her son promise never to get married, which scars him with psychological blocks to a commitment with his girlfriend. They finally decide to tie the knot in Vegas, but a wealthy gambler arranges for the man to lose $65K in a poker game and offers to clear the debt for a weekend with his fiancée.",
      "similar": [
         6557,
         712,
         50124,
         24,
         72207,
         2018,
         25195,
         3563,
         9870,
         1824,
         8273,
         9522,
         9029,
         95,
         1597,
         1979,
         55721,
         222936,
         84174,
         316023
      ],
      "original_title": "Honeymoon in Vegas",
      "runtime": 96,
      "poster_path": "/9D6ZOO5cL4qk1J98IISAzYIh4df.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/iaYpEp3LQmb8AfAtmTvpqd4149c.png",
            "name": "New Line Cinema",
            "id": 12,
            "origin_country": "US"
         },
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         },
         {
            "logo_path": "/7znWcbDd4PcJzJUlJxYqAlPPykp.png",
            "name": "Castle Rock Entertainment",
            "id": 97,
            "origin_country": ""
         }
      ],
      "release_date": "1992-08-28",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "A comedy about one bride, two grooms, and a wedding party you won't believe.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Andrew Bergman"],
      "runtime": 96,
      "synopsis": null,
      "writers": ["Andrew Bergman"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0104438/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM0Mzc1MTA4MV5BMl5BanBnXkFtZTcwOTg2NzE0NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: James Caan, Nicolas Cage, Sarah Jessica Parker | See full cast and crew »"],
      "reviews": [
         "I can't believe this film didn't score higher in the ratings. This film is one of my all-time favorite movies. Ever. Cage has remarkable comic timing! The scene at the airport ticket counter is priceless! This is a great film with excellent performances throughout. It never slows, never lets up and tickles your funny bone all the way till the Elvis' come to town. A highly recommended rental if you have not seen it yet. This movie is a guaranteed winner.",
         "I always thought that it was strange that the film \"Indecent Proposal\" was released not long after \"Honeymoon in Vegas\" and that no one seemed to make anything of the overt similarities between their plots, which involve men who \"gamble\" away their fiancees. Both films take a generally misogynistic approach to \"romance,\" although the antics in \"Vegas\" are generally less repulsive than the typical \"romantic comedy\" fodder that, in most states, would usually constitute some form of stalking or harrassment. \"Honeymoon in Vegas,\" however, is not nearly so maladjusted. Unfortunately, it isn't so funny, either. There are some choice one-liners and a great climactic scene involving the Flying Elvises, but it generally isn't very engaging because the plot and most of the characters are rather dull. But Cage and Parker are both monumentally talented and charming, and they somehow manage to carry this film through its lapses in quality. A side note: \"Honeymoon in Vegas\" has BY FAR one of the best soundtracks EVER-- the wide array of Elvis cover-songs is simply amazing: Billy Joel's take on \"All Shook Up\" and Dwight Yoakam's [he's the singer who covered Queen's \"Crazy Little Thing Called Love\" for the Gap commercial, fyi] rendition of \"Suspicious Minds\" really stand out among a truly stellar collection. Hearing this music in the background will carry you through most of the less-than-interesting moments of \"Vegas.\" Rating: 6 out of 10. Not bad. Parker, Cage, and the soundtrack make \"Honeymoon in Vegas,\" at the very least, a WATCHABLE film with some very enjoyable moments scattered throughout. It's worth seeing once, and the soundtrack is definitely worth picking up from the discount bins.",
         "After seeing the movie about 7 or 8 times, some of the laughs have worn out, but I still have fun watching it. You can't completely negate a movie that involves a desperate man who tries to gain back the love of his fiance by jumping out of a plane dressed like Elvis. The flying Elvises concept is definitely an original touch, but there are others as well. I like the running gag involving Robert Costanzo suspecting that his fat, ugly wife is cheating on him with Mike Tyson because of obviously doctored photos of her and Iron Mike. There's also that great scene with the 5-year-old Elvis impersonator, who's actually quite good. Anne Bancroft makes a brief but funny appearance at the beginning of the film. Peter Boyle also has a funny cameo as Chief Orman, an Indian Chief who has a love for showtunes. James Caan gives his usually savvy performance. I could've done without the cliched fat henchman character, who basically repeats everything that Caan says and bumbles all over the place. Nicolas Cage is over-the-top as the paranoid Jack, but his overacting works in the context of the film, and he's often very funny. And finally, who can resist a film with tons of Elvis songs in the soundtrack? My score: 7 (out of 10)",
         "Like in \"Guarding Tess\", I think this is where Nicolas Cage is at his best, although this one takes the cake as far as his comedies go. A well-written, well-acted all around, original movie with some truly hilarious moments and enough drama and complexity to make it a solid, worth-your-while experience. James Caan is perfect as the love-stricken gangster, and his object of affection, Sara Jessica Parker, is also great as the fiance who slowly begins to come around to his advances. (She's also quite easy to look at I might add). Everything goes wrong for Cage, as he races across hell and high water trying to catch up with the girl he wants to marry, but of course wacky high-jinx ensues. Hey, if nothing else, you can't go wrong with Las Vegas and Hawaii as your two main locations. A very good, funny film.",
         "SPOILERS THROUGHOUT POST: This was a really fun movie. I watched it solely because Nicholes Cage, one of my favorite actors was in it, so I thought it couldn't be that bad. And I was right. It was actually better then I thought it would be. There isn't any way to describe this movie except a lighter, funnier, sappier version of Indecent proposal. While indecent proposal the book, was great, the movie was pretty bad. This however, was a really fun time from beginning to end. Cage and parker make an adorable screen couple and James Caan was absolutely great. This movie hooks you, in the first five minutes, and retains a fun atmosphere throughout. It doesn't hurt that the two main settings for the movie are Las Vegas and Hawaii. The movie will make you want to visit both places. It is also peppered with unforgettable funny characters amidst two great settings, one a non stop party(Vegas) and one stunning peaceful island beauty(Hawai). What's also great about this movie is it is actually unpredictable in a few places and I don't say that lightly because there are not a lot of romantic comedies that can do that. Give you the warm fuzzies-oh yeah most of them do that no problem, but it's the rare romantic comedy that can leave you guessing. For me, I didn't know, at first, who parker's Betsy would actually end up with. Cage is at first, presented as a jerk who yells almost non stop through the first part. And Tommy actually appears to be, if a little questionable, genuinely attracted to Parker. And the two have chemistry as well. So I wasn't quite sure which road the movie would choose to take. That Tommy ultimately becomes much nastier then he was at first presented was, to me, at first a disappointment, and didn't seem to go with what I'd seen so far, but the end made it worth it as this tops many romantic comedies with it's Completely over the top yet somehow appropriate, ending. The sky diving sequence was thrilling, not to mention how fun the Elvis impersonators were. This movie is an easy 7, maybe even a bit higher(7.5) and is a movie I'd completely recommend, it's fun, it's funny, it's pretty, and it's well acted. Makes a great summer's late night watch and should be rated a bit higher on here.",
         "As an Elvis fanatic, this movie is a necessity. Its possible it contains the word \"Elvis\" more than any other mainstream movie. The impersonators of every nationality, the Flying Elvises at the climax and, as user 'lawndale' pointed out, the soundtrack is one of the best. Aside from the King, there is still a very funny movie here. Cage was doing small comedies at the time (\"Guarding Tess\" and \"It Could Happen to You\" are two of them), and this fits in with those other light entertainments, as far as that goes. He does 'frustrated' comedy pretty well; Ben Stiller would have been in this if it were made today, since he seems to be the new 'victim' in today's comedies. All the comedy is totally dependent on Cage's performance, and he delivers in ways I would not have thought possible. His next trip to Vegas (in \"Leaving Las Vegas\")should have been as much fun.",
         "Honeymoon in Vegas is a charming little romantic comedy directed by Andrew Bergman, which sees him working with Nicolas Cage for the first time. Two years later would seem them collaborate once more with \"It Could Happen To You\", a film that is equally as funny and equally as under-appreciated. The pair work really well together as Bergman's style of comedy utilises what makes Cage such a good actor, his ability to portray anxiety in a way that makes you laugh and yet still be fully sympathetic with his plight. In a pretty high concept plot, Cage plays a private detective, haunted with dreams of his dead mother, who is in a long term relationship with a teacher played by Sarah Jessica Parker but is afraid to tie the knot. Relationship troubles persuade Cage to take the plunge, deciding to head off to Vegas to get married as fast as possible before he is able to change his mind. The comedy really kicks in when James Caan's character, a wealthy professional gambler, spots Cage's fiancée and decides to pursue her himself using the most underhand of tactics as she looks similar to his recently deceased wife. Granted, the premise might not be the most edgy or original of ones but it consistently manages to serve up some really funny moments. Towards the end it starts to slightly go off the boil with James Caan's character seeming to change in a way that seems geared to reach a resolution rather than unfold naturally. This problem only really briefly manifests itself in places throughout the last fifteen minutes of the film, but can't really detract from the heartwarming climax involving a planeload of skydiving Elvises. If you are looking for a goofy comedy to watch that you don't need to think about a great deal then you'll not do much better than Honeymoon in Vegas. If you are still not convinced then watch it because Sarah Jessica Parker spends a lot of the time scantily clad, and this is before she looked like some genetic engineering atrocity where the DNA of a horse was spliced with a prune.",
         "Writer/director Andrew Bergman offers a humorous take on romance and the consequences of procrastinating when it comes to commitment, in `Honeymoon In Vegas,' a comedy of love, loyalty, longing and an airplane filled with skydiving Elvis impersonators. Nicolas Cage stars as Jack Singer, a guy in love but hampered by a promise he may or may not have made to his mother, Bea (Anne Bancroft), on her deathbed, which causes him to drag his heels on the path to the altar. When he finally manages a breakthrough, he spirits his girl, Betsy (Sarah Jessica Parker), off to Las Vegas with the intention of tying the knot once and for all. But before the plan can come to fruition, enter professional gambler (and widower) Tommy Korman (James Caan), who spots Betsy in the lobby of a hotel. what follows involves something of a twist in plot, but suffice to say, Jack is about to face a personal baptism by fire. And Betsy may be the flame, but Korman is the flint. It's an amusing comedy that never gets too deep beneath the surface or purports to be anything but what it is, though the plot does dip in to a bit of a gray area, morally speaking. The performances are good all around, though nothing here is anything approaching a stretch for any of the principals involved. Cage conveys the angst of his situation with aplomb, and employs that hang-dog look he does so well to great effect while his emotions implode. Parker looks fetching and makes a credible character of Betsy, but even though the action revolves around her there is not a whole lot for her to sink her teeth into with this part. But to her credit she handles what she is given to work with convincingly enough. Caan looks every bit the part of Korman; in fact, to put this part over he had little more to do than show up. Even at that, there are times when he takes it just a trifle over the top. The supporting cast includes Pat Morita (Mahi Mahi), Johnny Williams (Johnny Sandwich), Seymour Cassel (Tony Cataracts) and Peter Boyle, who creates one of the more memorable scenes in the movie, as Chief Orman. With `Honeymoon In Vegas,' Bergman has put together a film that, while not entirely memorable, is good for some laughs (the highlight of which is when Jack must of necessity interact with the flying Elvis impersonators). In the end, with some popcorn and a little imagination, for Cage fans especially, this movie will make for a satisfying evenings entertainment. I rate this one 6/10.",
         "Many a movie has been set in Las Vegas, and Andrew Bergman's \"Honeymoon in Vegas\" is probably the average kind. I didn't consider it anything special, but also nothing bad. Just an innocuously silly comedy about a man (Nicolas Cage) and his lover (Sarah Jessica Parker) who honeymoon in the noted gambling Mecca, only to have a gangster (James Caan) try to ruin their relationship. Without a doubt the highlight was the skydiving scene. The movie is certainly fun to watch, and I figure that in that great concert hall in the sky, Elvis Presley must smile every time that someone watches it. Also starring Pat Morita, Peter Boyle, Anne Bancroft, Seymour Cassel and Tony Shalhoub.",
         "Cage is a man whose mother preached to him about the evils of marriage and took it with her to the grave, giving him nightmares, especially when his girlfriend, Parker is pressuring him to marry her. Caan is a mobster who lost his wife that looked a lot like Parker. The setting is a romantic backdrop surrounding the sights of Las Vegas. I like how they mentioned Bally's casino & hotel so many times, but my girlfriend said that the place is no longer open. Cage is a fanatic about getting his girl back when Caan sets him up to lose her in a poker game. He might be a fanatic, but he's also an idiot! He couldn't see that he was cheated, but then, to top it off, Caan comes up with a solution SO QUICKLY when it comes time for Cage to pay back the money! The movie is not bad! Caan makes a good bad guy, as he's proved so many times. Cage takes the uneasiness about getting married to a new limit and Parker...well, I think the only reason Parker was there was to look cute. I realize that she didn't have much to say when it came time for Cage to pay up and I don't think that much of Cage for him to even consider the option when presented to him. It's almost like a romantic comedy version of \"Indecent Proposal.\""
      ],
      "genres": [
         "Comedy",
         "Romance",
         "Thriller"
      ],
      "productionCompanies": [
         "Castle Rock Entertainment",
         "New Line Cinema"
      ],
      "summaries": ["On her deathbed, a mother makes her son promise never to get married, which scars him with psychological blocks to a commitment with his girlfriend. They finally decide to tie the knot in Vegas, but a wealthy gambler arranges for the man to lose $65K in a poker game and offers to clear the debt for a weekend with his fiancée. Suddenly the man is insanely jealous, and pursues his fiancée and her rich companion, but finds pitfalls in his path as the gambler tries to delay his interference."],
      "budget": 25000000
   },
   "movielensId": 3614,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1992-08-28",
      "dvdReleaseDate": "2000-04-28",
      "directors": ["Andrew Bergman"],
      "runtime": 96,
      "movieId": 3614,
      "title": "Honeymoon in Vegas",
      "mpaa": "PG-13",
      "actors": [
         "Nicolas Cage",
         "James Caan",
         "Sarah Jessica Parker",
         "Peter Boyle",
         "Pat Morita",
         "Anne Bancroft",
         "Seymour Cassel",
         "Johnny Williams",
         "Bruno Mars",
         "Tony Shalhoub"
      ],
      "imdbMovieId": "0104438",
      "originalTitle": "Honeymoon in Vegas",
      "genres": [
         "Action",
         "Comedy",
         "Romance",
         "Thriller"
      ],
      "youtubeTrailerIds": ["MbrZBvSUMkM"],
      "plotSummary": "On her deathbed, a mother makes her son promise never to get married, which scars him with psychological blocks to a commitment with his girlfriend. They finally decide to tie the knot in Vegas, but a wealthy gambler arranges for the man to lose $65K in a poker game and offers to clear the debt for a weekend with his fiancée.",
      "tmdbMovieId": 12518,
      "avgRating": 3.11559,
      "releaseYear": "1992",
      "numRatings": 2219,
      "posterPath": "/9D6ZOO5cL4qk1J98IISAzYIh4df.jpg"
   }
}