{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "college",
            "id": 3616
         },
         {
            "name": "lost and found",
            "id": 178226
         },
         {
            "name": "older brother younger sister",
            "id": 178229
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "young adult",
            "id": 206298
         },
         {
            "name": "college student",
            "id": 207844
         }
      ],
      "imdb_id": "tt0217630",
      "video": false,
      "title": "Loser",
      "recommendations": [
         20009,
         6020,
         10878,
         10985,
         10342,
         16261,
         15037,
         19366,
         16300,
         11857,
         13163,
         2752,
         9099,
         10035,
         11630,
         15413,
         10694,
         9536,
         10563,
         23719
      ],
      "backdrop_path": "/qTvcR6F5HM0IbFlahZH2zuRqZNK.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Paul Tannek",
               "gender": 2,
               "credit_id": "52fe439a9251416c75016da1",
               "name": "Jason Biggs",
               "profile_path": "/7CcISIHMvpzcUVo4NmxgA6f71RQ.jpg",
               "id": 21593,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Dora Diamond",
               "gender": 1,
               "credit_id": "52fe439a9251416c75016da5",
               "name": "Mena Suvari",
               "profile_path": "/xnc7WgBvfefwu3nJ5IkCjQrhPz0.jpg",
               "id": 8211,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Adam",
               "gender": 2,
               "credit_id": "52fe439a9251416c75016dad",
               "name": "Zak Orth",
               "profile_path": "/rKupoahQ3pgeVVXS8EWd1WSnKEO.jpg",
               "id": 6212,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Chris",
               "gender": 0,
               "credit_id": "56b72a11c3a36806f100b89d",
               "name": "Thomas Sadoski",
               "profile_path": "/76x2G7gyY25krEc3OBMUWaEzgnB.jpg",
               "id": 1218218,
               "order": 3
            },
            {
               "cast_id": 20,
               "character": "Noah",
               "gender": 2,
               "credit_id": "5988a83bc3a36862d3000260",
               "name": "Jimmi Simpson",
               "profile_path": "/eONdiJpMZMdsHgiBVeSW1R2MQWG.jpg",
               "id": 22125,
               "order": 4
            },
            {
               "cast_id": 3,
               "character": "Edward Alcott",
               "gender": 2,
               "credit_id": "52fe439a9251416c75016da9",
               "name": "Greg Kinnear",
               "profile_path": "/agOTbOC76I6rC7TPuCTquvngXRu.jpg",
               "id": 17141,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Dad",
               "gender": 2,
               "credit_id": "5747d38992514135d10011e8",
               "name": "Dan Aykroyd",
               "profile_path": "/lV7t37Dla8SILS1G7KpOplmviPg.jpg",
               "id": 707,
               "order": 6
            },
            {
               "cast_id": 21,
               "character": "Gena",
               "gender": 1,
               "credit_id": "5988a878c3a36862bd0002b9",
               "name": "Twink Caplan",
               "profile_path": "/a6iDJoy42QZP1DfL3ybHQeXT5DU.jpg",
               "id": 66160,
               "order": 7
            },
            {
               "cast_id": 22,
               "character": "Sal",
               "gender": 2,
               "credit_id": "5988a8809251413e4e0002ac",
               "name": "Bobby Slayton",
               "profile_path": "/nFTCMgev1PrIwyn9EpZNDSgeyyN.jpg",
               "id": 53601,
               "order": 8
            },
            {
               "cast_id": 24,
               "character": "Annie",
               "gender": 0,
               "credit_id": "5988a892c3a36862d30002cb",
               "name": "Mollie Israel",
               "profile_path": null,
               "id": 1000241,
               "order": 9
            },
            {
               "cast_id": 23,
               "character": "Victor",
               "gender": 2,
               "credit_id": "5988a889c3a36862e30002a0",
               "name": "Robert Miano",
               "profile_path": "/sszrBivDN2Ry0I3vWY5k8CjxYdB.jpg",
               "id": 62715,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Homeless Woman",
               "gender": 1,
               "credit_id": "5747d3a49251416356000a53",
               "name": "Colleen Camp",
               "profile_path": "/3SbQnaC4SjykOIPDzrDlyIKzD9I.jpg",
               "id": 13023,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Another City Worker",
               "gender": 2,
               "credit_id": "5747d3b3c3a3686bc1001431",
               "name": "Andy Dick",
               "profile_path": "/ebNRu8oV7Ifv5aoP23UyNnx0lZS.jpg",
               "id": 43120,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Panty Hose Customer",
               "gender": 2,
               "credit_id": "5747d3c59251416356000a5c",
               "name": "Steven Wright",
               "profile_path": "/m9827iUNPGTbAsfjHD9tpMCXYbR.jpg",
               "id": 3214,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Doctor",
               "gender": 2,
               "credit_id": "5747d3e492514162c1000b5c",
               "name": "Brian Backer",
               "profile_path": "/eTrqeVT8qDJrJuTHVIiHcZZs0B8.jpg",
               "id": 118946,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "Photographer",
               "gender": 2,
               "credit_id": "5747d403c3a3686bba001276",
               "name": "Taylor Negron",
               "profile_path": "/l641HJtE8WSjWAJGHAer5Hx89SG.jpg",
               "id": 37043,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe439a9251416c75016db3",
               "name": "Twink Caplan",
               "profile_path": "/a6iDJoy42QZP1DfL3ybHQeXT5DU.jpg",
               "id": 66160,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe439a9251416c75016db9",
               "name": "Amy Heckerling",
               "profile_path": "/c68tZT9Be1triBbKmSOKCS3dsBI.jpg",
               "id": 57434,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe439a9251416c75016dbf",
               "name": "Amy Heckerling",
               "profile_path": "/c68tZT9Be1triBbKmSOKCS3dsBI.jpg",
               "id": 57434,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe439a9251416c75016dc5",
               "name": "Amy Heckerling",
               "profile_path": "/c68tZT9Be1triBbKmSOKCS3dsBI.jpg",
               "id": 57434,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe439a9251416c75016dcb",
               "name": "John M. Eckert",
               "profile_path": null,
               "id": 58038,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe439a9251416c75016dd1",
               "name": "John Shepphird",
               "profile_path": null,
               "id": 69918,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe439a9251416c75016dd7",
               "name": "David Kitay",
               "profile_path": null,
               "id": 25143,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 1,
               "credit_id": "52fe439a9251416c75016ddd",
               "name": "Debra Chiate",
               "profile_path": null,
               "id": 57426,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 9.6096,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10642,
      "vote_count": 149,
      "budget": 0,
      "overview": "On a university scholarship, a good natured student from the midwest gets a crash course in city life while dealing with three evil roommates. He befriends a virtually homeless college student whom he falls for, but she's dating a nasty professor.",
      "similar": [
         27586,
         10735,
         23169,
         270302,
         292280,
         440021,
         858,
         141,
         634,
         242224,
         114150,
         112160,
         437557,
         11137,
         258480,
         9469,
         43923,
         340485,
         250124,
         297762
      ],
      "original_title": "Loser",
      "runtime": 98,
      "poster_path": "/b3aYI05e1iAc7ouFeBpSUQADxsi.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
         "name": "Columbia Pictures",
         "id": 5,
         "origin_country": "US"
      }],
      "release_date": "2000-07-21",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "Dare to be different.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Amy Heckerling"],
      "runtime": 98,
      "synopsis": null,
      "writers": ["Amy Heckerling"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0217630/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY1MDE5MTc5Nl5BMl5BanBnXkFtZTYwNzIzMzE3._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jason Biggs, Mena Suvari, Zak Orth | See full cast and crew »"],
      "reviews": [
         "Amy Heckerling's latest teen comedy, 'Loser', is an old-fashioned charmer where nice guys finish first, sweet girls end up making the right choices, and pushy 'users' get their just desserts! Perhaps nobility is passe in films today, but 'Loser' makes a great case for working class heroes who succeed by 'doing the right thing'. Paul Tannek (Jason Biggs) is a farm boy who wins a scholarship to a college in New York City. Bright, awkward, and shy, and possessing the worst haircut since Adam Sandler's in 'Little Nicky', he accepts his family's celebration of his success with embarrassment, and a fear of failure, but his father (Dan Aykroyd, who is wonderful in his brief scenes) offers simple advice: \"Listen to people, look them in the eye. Be a friend, and you'll succeed.\" Cut to New York City (which has never looked more beautiful), and Paul's worst fears are coming true. His dress is ridiculed, his roommates are 'too cool' jerks who take advantage of him while dissing him, and his instructors, particularly Professor Alcott (Greg Kinnear, at his smarmiest!) snub him imperiously. Paul is lonely and frustrated, which makes a simple act of kindness by fellow student Dora Diamond (Mena Suvari, in her best performance, to date) take on special significance to him. Diamond is a kindred spirit, although she has been manipulated into believing Professor Alcott loves her, and has become his clandestine lover. As both of their lives take downward turns (he gets thrown out of his dorm, she loses her waitress job), they develop a platonic friendship (he is far too much a gentleman to attempt to break up a relationship!), and the film becomes a game of guessing when these two terrific people will realize they belong together! 'Loser' features a lot of very funny cameos, by Andy Dick, David Spade, Andrea Martin, Colleen Camp, many others, and, to Heckerling's credit, these 'guests' never detract from the positive message of the film. This makes a great date movie (particularly if your date loves kittens!), and is a 'feel-good' flick you can enjoy again and again! I loved it, and I think you will, too!",
         "Unfairly condemned by the critics, this movie worked for me as a comedy and as a somewhat dark look at the mores of college life. Our hero may be branded a loser, but he's definitely a believable three-dimensional character (with a heart of gold, naturally). The story takes for granted some unethical and potentially unsettling behaviour, and allows the characters to rise above it. Lets you smile throughout, and gives you some insights into contemporary life on campus without resorting to cliches.",
         "*** out of **** Loser is a breath of fresh air considering the amount of vulgar comedies (American Pie, Road Trip, and Scary Movie) that have been released recently. It relies on little sex and profanity, but instead has its success rooted firmly in the acting and charisma of young stars Jason Biggs and Mena Suvari. The film centers around Paul Tannek (Jason Biggs), an all-around nice guy from a small town who is now going to college in a big city due to a scholarship he's received. His personality is a contrast to most people around him, particularly his roommates, who like to party all night and taunt Paul. Because of his kindness and his apt studying each night, he's considered a loser. Yet, not everything is bad for Paul. He's met a girl, Dora (Mena Suvari), in his European Literature class, and he develops a fast crush on her. However, he doesn't know that she's secretly having a relationship with the class's teacher, Professor Alcott (Greg Kinnear). After some mishaps involving a party, Paul begins to develop a strong friendship with Dora and his feelings for her begin to go even farther as he wonders if he even has a chance to have a relationship with her. A warning before watching this film: if you're expecting similar antics from Biggs in American Pie, prepared to be disappointed. Loser is a contrast to that movie. It prefers to develop relationships rather than put in some sort of sex joke, and it's all the better for it. True, there aren't exactly a huge amount of belly laughs in the proceedings, but it's always entertaining, fast, witty, and charming. As I said before, the movie's success lies squarely on the shoulders of Jason Biggs and Mena Suvari, and they're as good as ever. Biggs nice-guy performance is his best to date and he creates one of the most genuinely likeable and true characters I've seen in movies for a while. Suvari is equally appealing as the role of a girl whose also kind but is mixed up in the wrong relationship. The chemistry between them is strong and the best praise I can give this film is the fact that I cared for their characters and wanted to see them get together. The other performances are suitable enough. The other standout is probably Greg Kinnear as the professor, whose smug performance makes hims a character easy to hate. There are also appearances from well-known comics like Andy Dick and David Spade, and their brief cameos bring a few good laughs. Amy Heckerling wrote and directed this film, and while her script may be rather predictable, her direction is still good and she shows the same talent she had in the 80's. This may not be her funniest film, but it's easily the most likeable. Loser also has other little elements that work to its advantage. The film features a good soundtrack, playing songs that are actually appealing and also work with the scenes and situations it's played along with. With standout performances, excellent chemistry between the two leads, Loser is a great date movie and one you certainly cannot pass up if you're a fan of both Biggs and Suvari. This is definitely the most pleasant surprise I've seen in a long time.",
         "Yes, Loser is a very predictable film. Plotwise, it follows most other romantic comedy type movies. But still, there is enough here to make it stand out somewhat. Granted, being better than most teen romantic comedies isn't much of an accomplishment, but Loser is a good movie, even though I knew what was going to happen. I thought Jason Biggs played his part as Paul very well. He had the loser-like goofiness that inspired quite a few laughs, but you could also tell how much the character loved Mena Suvari's character, Dora. Greg Kinnear is also very good as Professor Alcott, Dora's love interest at the beginning of the movie. When all is said and done, Paul comes out as a winner, not a Loser, because he realizes that you don't have to fit in with everyone else to be \"cool.\" That's what really sets this movie apart from lots of other recent teen movies. It does have a point. Obviously, it's not extremely deep, and it won't change your life or anything, but it's still good, and it makes the movie very worthwhile. I think that lots of people didn't like this movie because they were expecting something along the lines of American Pie, given that both Biggs and Suvari were in that. If you're looking for American Pie, you will not like Loser. Although billed as a comedy, there are some times when it's downright serious, especially further into the movie. If you want non-stop gross-out humor, Loser is not for you. If, however, you want to see a good romantic film, that's funny at times, but serious at other, just like real life, then I think you will enjoy Loser. Yes, the basic plot is quite familiar, but there's enough extra stuff to keep it interesting and make it stand out from the crowd of bad teen comedies that have been around lately. Rating: 8/10",
         "I don't know why people like to bash this movie, it is a nice little remake of the 1960 classic \"the apartment\" where in a businessman sells out to his bosses so they can use his apartments to have affairs with other women, but when one attempts suicide in his house, it happens to be the one he falls in love with, the same story is evident here, Biggs plays the role well, and Suvari could play Shirley MacLaine in future remakes, the same with Kinnear and MacMurray, this could become one of those films that could get young people involved into the classics.",
         "Well here we go... another teen/young adult college comedy coming your way, spiced up with a little romance, the usual boy-meets-girl-falls-in-love-but-she's-already-with-someone storyline, and that's really all there is to tell, aside from a few notable college pranks that kinda make you wonder what _you_ did with your time back then... The acting is alright, teen-movie poster child Jason Biggs as the \"Loser\" delivers well, Greg Kinnear does a great job in his role as the slick, uppity, self-important, boneheaded college professor with a dirty little secret.... an let's not forget the one and only true reason why this movie just might be for you after all: Mena Suvari!! (Yes folks, I gotta admit that I, for one, will never find true happiness until one fine day I'll get to be with somebody like her.) Cute as ever, she gives a standout performance as the sweet, attitude-laden little grunge girl. Really something to see! As for the rest of the movie, it's more like \"same old, same old...\" - if you like Mena Suvari, you're bound to love it, but otherwise, not that I'd tell you not to bother, but just don't expect to be too thrilled because it's really all been done before (and some of it actually by none other than Jason Biggs in some of his better-known flicks).",
         "I have always been the outsider as a teenager (why do you think I have hundreds of movies on my comment list), so I can relate to this film. Not because I have gone to a college from a far off land and am not familiar with the area. But because I have always known what It's like to not always get the girl, always to be alone and to have such low self-esteem you make eeyore from Winnie the Pooh look like Richard Simmons. So I can sympathize. But saying did I like the entire movie, no. Because the main heroine (Mena Suvari) knows who is the right one in her life (her choices are the teen Jason Biggs and a married professor Greg Kinnear) and takes too long to find out who the right one is (I am not revealing who that is). While she and Biggs are likeable characters, they also make dumb choices in the dating game. Sort of like Boys and Girls which came out last month. Yet, I can reccomend this film to teen film fans, Everclear fans, or fans of writer/director/co-producer Amy Heckerling's work (she is of Fast Times at Ridgemont High and Clueless fame). Just don't go into it looking for a way to find better love. B+",
         "I really enjoyed this film! Its a real and genuine feel good movie which will undoubtedly charm you. Many films you watch once and never watch again, but for me i can watch this film many times and still get that same fuzzy feeling from when i first watched it. The acting is pretty good, I think pairing Mena Suvari and Jason Briggs was perfect as they'd already worked together in American Pie. The film is also more plot to it than most teen-comedy movies. It may not be as funny as the likes of American Pie, But it has many of its own qualities. Jason Briggs does really well and you end up really liking his Character, He does a really good job at playing Mr Nice and really charming you. Give this film a watch. You never know, you might just agree with me",
         "Most teen movies are obnoxious fantasies which insult the viewer's intelligence, but not \"Loser\". All the major characters closely resemble people I met in college. The movie is sweet without romanticising the Midwesterner's fashion sense, the rich New Yorkers' morality or the professor's ethics. The dialogue is also very true-to-life. For example, the loser's roommates greet him by mockingly asking whether he thinks tongue studs enhance sexual please. That's exactly the sort of thing a rich NY kid would say in such a situation. In another scene, the loser asks his exploited friend Dora: \"Can't you be in love without being madly in love?\" That's a very good question.",
         "I was surprised how good this movie actually is. It's more romance than a comedy because there were not many jokes but a story, characters and soundtrack made this film great. There were no boring moments. I've watched this film because of Wheatus music video Dirtbag Baby (this song is a theme of Loser) expecting to see something like that in a movie but a movie was different than music video and still I wasn't disappointed. Most of jokes were about Jason Biggs character and it wasn't very funny, actually it made me feel sorry for him. But anyways the movie itself was great. So if you are expecting this movie to be funny you may be disappointed but on the other hand it's a great love story."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Branti Film Productions",
         "Cockamamie"
      ],
      "summaries": [
         "Is there room in Manhattan for a decent kid? Can a young woman see past a cad to true love? Paul, from rural upstate, comes to New York City for college. To keep his scholarship, he must study hard and do well. That makes him a loser to his partying roommates who connive to kick him out of their suite. He's assigned a room in an animal hospital. In class he meets Dora, a pretty coed who needs a job to pay for school, and who's the very young lover of their sarcastic and selfish lit professor. When Dora is slipped some drugs at a party, Paul nurses her back to health, and a friendship follows. For Paul, though, it's more than friendly feelings. Can they work things out for them to become a truly lucky couple?",
         "On a university scholarship, a good-natured student from the midwest gets a crash course in city life while dealing with three evil roommates. He befriends a virtually homeless college student whom he falls for but whom dates a nasty professor.",
         "Clueless Midwesterner Paul Tannek arrives in New York City to go to college at NYU only to run into one complication and mishap after another. When Paul is branded a loser by his three outgoing dorm roommates (who then boot him from their room), he's relocated to a spare room at a veterinary clinic where, by accident, Dora Diamond, a fellow coed who is dating their unscrupulous literacy professor, falls under his care following an overdose.",
         "A college student, branded a loser by his roommates and booted from the dorm, falls in love with a coed who has eyes for their condescending professor."
      ],
      "budget": 20000000
   },
   "movielensId": 3616,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-07-21",
      "dvdReleaseDate": "2000-12-19",
      "directors": ["Amy Heckerling"],
      "runtime": 98,
      "movieId": 3616,
      "title": "Loser",
      "mpaa": "PG-13",
      "actors": [
         "Jason Biggs",
         "Mena Suvari",
         "Zak Orth",
         "Thomas Sadoski",
         "Jimmi Simpson",
         "Greg Kinnear",
         "Dan Aykroyd",
         "Twink Caplan",
         "Bobby Slayton",
         "Mollie Israel",
         "Robert Miano",
         "Colleen Camp",
         "Andy Dick",
         "Steven Wright",
         "Brian Backer",
         "Taylor Negron"
      ],
      "imdbMovieId": "0217630",
      "originalTitle": "Loser",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [
         "kSALPinwy3U",
         "vWoXkC7udK0"
      ],
      "plotSummary": "On a university scholarship, a good natured student from the midwest gets a crash course in city life while dealing with three evil roommates. He befriends a virtually homeless college student whom he falls for, but she's dating a nasty professor.",
      "tmdbMovieId": 10642,
      "avgRating": 2.63631,
      "releaseYear": "2000",
      "numRatings": 1647,
      "posterPath": "/b3aYI05e1iAc7ouFeBpSUQADxsi.jpg"
   }
}