{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "russia",
            "id": 2139
         },
         {
            "name": "hidden fortune",
            "id": 186378
         }
      ],
      "imdb_id": "tt0066495",
      "video": false,
      "title": "The Twelve Chairs",
      "recommendations": [
         42470,
         12535,
         44941,
         10970,
         22998,
         39578,
         100343,
         51469,
         106122,
         53581,
         47947,
         16303,
         45838,
         288778,
         48218,
         23001,
         77368,
         15313,
         55106,
         42010
      ],
      "backdrop_path": "/6xKjQ6ixveYm1lNivzS0UMIkWRS.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "tiailds",
         "id": "5699f4979251415aba000562",
         "content": "For a Mel Brooks movie, far from the best. For a 60-70's comedy, I've definitely seen better. A poor man's Mad Mad Mad Mad World.\r\n\r\n\"Was it interesting?\" That was the best part. The story is complex, characters were developed with reasonable motivations. It's just the transition to a movie that didn't really do it justice.\r\n1.5 out of 3\r\n\r\n\"Was it entertaining?\" The comedy was slightly humorous in parts, but mostly predictable or too drawn out.\r\n1 out of 3\r\n\r\n\"Was it memorable?\" The locations were pretty well done, and the acting was better than the dialog. The problem is that pacing was so slow I almost fell asleep 2/3 through and was wanting to fast-forward in the last 5 minutes.\r\n1 out of 3\r\n\r\n1.5+1+1=3.5+1(default 1)=4.5\r\nRound up or down for overall feeling and this feels like a 4. This is not a movie I would want to see and felt like my time was somewhat wasted.",
         "url": "https://www.themoviedb.org/review/5699f4979251415aba000562"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Ippolit Vorobyaninov",
               "gender": 2,
               "credit_id": "52fe44aec3a368484e030f25",
               "name": "Ron Moody",
               "profile_path": "/21sEsEm1yRmDO9UxrG1WNDVfwPl.jpg",
               "id": 41236,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Ostap Bender",
               "gender": 2,
               "credit_id": "52fe44aec3a368484e030f29",
               "name": "Frank Langella",
               "profile_path": "/wMlcjLBQouQjE0iceseNTxUF3BF.jpg",
               "id": 8924,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Father Fyodor",
               "gender": 2,
               "credit_id": "52fe44aec3a368484e030f2d",
               "name": "Dom DeLuise",
               "profile_path": "/u1DOOocPOgaiCucbbbxPkdOTuo8.jpg",
               "id": 6844,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Nikolai Sestrin",
               "gender": 0,
               "credit_id": "52fe44aec3a368484e030f31",
               "name": "Andréas Voutsinas",
               "profile_path": "/ydBwnErUYKKLDdQGRWbGkb6bWdo.jpg",
               "id": 2172,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Diana Coupland",
               "gender": 0,
               "credit_id": "52fe44aec3a368484e030f35",
               "name": "Diana Coupland",
               "profile_path": null,
               "id": 94370,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Engineer Bruns",
               "gender": 2,
               "credit_id": "52fe44aec3a368484e030f39",
               "name": "David L. Lander",
               "profile_path": "/l4EMljqd2d9L6LTrHN0cmPAlSUw.jpg",
               "id": 78619,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Tikon",
               "gender": 2,
               "credit_id": "52fe44aec3a368484e030f49",
               "name": "Mel Brooks",
               "profile_path": "/ndFo3LOYNCUghQTK833N1Wtuynr.jpg",
               "id": 14639,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44aec3a368484e030f3f",
               "name": "Mel Brooks",
               "profile_path": "/ndFo3LOYNCUghQTK833N1Wtuynr.jpg",
               "id": 14639,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44aec3a368484e030f45",
               "name": "Doris Mudie",
               "profile_path": null,
               "id": 94373,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44afc3a368484e030f4f",
               "name": "Mel Brooks",
               "profile_path": "/ndFo3LOYNCUghQTK833N1Wtuynr.jpg",
               "id": 14639,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44afc3a368484e030f55",
               "name": "Ronald H. Gilbert",
               "profile_path": null,
               "id": 1123040,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44afc3a368484e030f5b",
               "name": "Michael Hertzberg",
               "profile_path": null,
               "id": 67675,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44afc3a368484e030f61",
               "name": "Sidney Glazier",
               "profile_path": null,
               "id": 69571,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44afc3a368484e030f67",
               "name": "Đorđe Nikolić",
               "profile_path": null,
               "id": 1123041,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44afc3a368484e030f6d",
               "name": "Alan Heim",
               "profile_path": null,
               "id": 853,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44afc3a368484e030f73",
               "name": "Miodrag Nikolić",
               "profile_path": null,
               "id": 37780,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe44afc3a368484e030f79",
               "name": "Ilya Ilf",
               "profile_path": "/iK4P71Fd6P5h38z85gBLQNk9fSd.jpg",
               "id": 94371,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe44afc3a368484e030f7f",
               "name": "John Morris",
               "profile_path": null,
               "id": 719,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 4.299062,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 24918,
      "vote_count": 37,
      "budget": 0,
      "overview": "A treasure hunt. An aging ex-nobleman of the Czarist regime has finally adjusted to life under the commisars in Russia. Both he and the local priest find that the family jewels were hidden in a chair, one of a set of twelve. They return separately to Moscow to find the hidden fortune.",
      "similar": [
         708,
         47964,
         657,
         667,
         691,
         1620,
         502,
         6687,
         430,
         51300,
         21028,
         32613,
         89704,
         366901,
         37176,
         55699,
         424322,
         140164,
         276296,
         457307
      ],
      "original_title": "The Twelve Chairs",
      "runtime": 94,
      "poster_path": "/dvtiZCFOBBmzz7NDIMuvSeP91nO.jpg",
      "spoken_languages": [
         {
            "name": "Pусский",
            "iso_639_1": "ru"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Crossbow Productions",
            "id": 1296,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "The Twelve Chairs Company",
            "id": 11717,
            "origin_country": ""
         }
      ],
      "release_date": "1970-10-28",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "A wild and hilarious chase for a fortune in jewels.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mel Brooks"],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "Ilya Ilf",
         "Yevgeni Petrov"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0066495/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIwMjUxMjk1NV5BMl5BanBnXkFtZTYwODIyMzE5._V1_SY317_CR10,0,214,317_AL_.jpg",
      "actors": ["Stars: Mel Brooks, Ron Moody, Frank Langella | See full cast and crew »"],
      "reviews": [
         "It is the forgotten Brooks movie. Probably because it has the most controlled script story, and had the least wild, satyric inventiveness of any of his films. After he wrote and directed the original THE PRODUCERS, Brooks did not do another film for a few years. The second one was this one set in the post-Russian Revolution period in the Soviet Union. Ron Moody (Fagin in the musical OLIVER) is a minor Tsarist nobleman who discovers, when attending his mother-in-law on her death bed, that she hid her fortune in jewelry in one of the dining room chairs. There were a set of twelve chairs, and they were appropriated by the government to be given to deserving members of the proletariat. Moody discovers that his mother-in-law did confess this to one person besides him: the local Russian Orthodox Priest (Dom DeLuise). Moody finds the latter a difficult opponent to beat to the fortune first. By chance he falls in with a young swindler (Frank Langella) and he and Langella pursue the chairs, and also send DeLuise on a wild goose chase following a second set of similar chairs. What we get is a view of the Soviet Union in 1928, as the Civil Wars died out and the regime consolidated power. Trotsky's name is now dismissed (as a street shows). The stage is dominated by the state oriented drama that is anti-capitalist. Witness the performance of Andreas Voutsinas - the original \"Carmen Ghia\" in the first PRODUCERS, as the government backed manager of the theater group that Moody and Langella join. There is a life and death threat behind comments he gives to one of the stage crew he controls. We also see how the common people try to cope with the changes - being sent across country on government sponsored jobs - to houses that the government may furnish. Brooks has his first role in his own films in this one - as Tikhon, the drunken, ex-servant of Moody. He receives a slap from the latter, and considers it exactly like a hug. Like IT'S A MAD, MAD, MAD, MAD WORLD, THE TWELVE CHAIRS looks at the antics people will go through for hidden wealth. Langella, who is a street criminal anyway, is the only sane member of the three treasure seekers. He is a realist (the first really serious one in Brooks' films), and has adapted to the new conditions fairly easily by living on his considerably keen wits. He realizes that he is hampered as well as helped by his alliance with Moody, but manages to figure out how to live with Moody as best as possible. Moody has become a bureaucrat to survive in the new regime (he's suspect as an aristocrat), but he still has his pretenses. It takes the events he shares with Langella for him to finally give up his pretenses. Together both men find out what is really worthwhile about living. DeLuise is less lucky. He just discovers the perils of being a loner.",
         "\"Hope for the best, expect the worst\", as the title song goes, is exactly how I felt when I picked up my copy. Having read the original Russian novel and being a fan of Mel Brooks, I was curious how the two would come together. I was rather apprehensive, knowing how Russian literature usually suffers in translation, but hopeful that Brooks would somehow make something of it anyway. The film disappoints on both counts - there's precious little of the original in it, and Brooks isn't at his best here either. Moody is actually OK as Vorobyaninov, but the casting of Langella as Bender is just plain wrong, as he cannot possibly convey the depth and subtlety of the original character. Langella alone is enough to kill this film for anyone familiar with the book. None of the uproarious humor of the novel is anywhere to be found, while the few semi-funny visual gags are merely typical Brooks slapstick and have nothing to do with the source material. And even those aren't among Brooks' best. However, having expected the worst, I wasn't exactly disappointed. An OK little comedy, if you don't expect too much. If you want more, read the book.",
         "As Mel Brooks films go, I rate it second only to Young Frankenstein. The action takes place in Russia 10 years after the Revolution. Ron Moody is marvelous as a low IQ and totally inept former nobleman, now hiding out as a clerk in a government office, who learns that the family jewels had been sewn into one of the 12 dining room chairs. He returns to his former residence, now an old folks home, and learns from former servant, now janitor, Mel Brooks that the chairs are gone, confiscated by the government. Con man Frank Langella threatens to turn Moody in if he does not allow him in on the quest. Of course, the chairs have been widely distributed. A major fly in the ointment is Dom Deluise, the village priest, who has also learned the secret. He relinquishes all for greed (\"O, Thou who knowest all---you know.\") and competes in the search. Not a perfect movie, but loaded with laughs. May be Dom's funniest role. I give it an 8 out of 10.",
         "A long time ago, Mel Brooks had a subtle side. Hard to believe, isn't it? The man responsible for such guffaw-fests as \"Blazing Saddles\", \"Silent Movie\", \"High Anxiety\" and such.... SUBTLE? In \"The Twelve Chairs\", he does get laughs out of the story of a Russian nobleman searching for jewels sewn into one of twelve of his family's chairs that have been sold with the rest of his family's possessions. But not the way we're use to seeing Mel earn them. This, time, he gets them through character study, human nature, individuals' reactions to certain embarrassing situations and, of course, good old-fashioned greed. And the laughs are there, to be sure. I'm actually surprised that I liked this as much as I did. I'm used to Mel up there with the lampshade on his head, yucking it up with wild abandon. This film, subtle as it is, makes me laugh. Of course, for purists, there's always good old DeLuise as another conniver searching for the same jewels. He makes with the wildness and insanity that makes a Mel Brooks film a Mel Brooks film, and he's a joy to see. The others, Moody and Langella in particular, play regular human beings who see a situation, assess it and act as (nearly) anyone else would. More humorously, of course. Seek out \"The Twelve Chairs\". Rare as it is, a rose by any other name.... And you know the rest. Eight stars. Hey! Hey, hey, hey!",
         "In his lifetime Mel Brooks has created many motion pictures which have established him as an artistic genius. \"The Twelve Chairs\" is another milestone for him. From the very beginning of this film, to its ending, there is a sense of serious, but humanistic brilliance. The era is the aftermath of the Russian Revolution and a dying woman wants to clear her conscience and reveal her greatest sin. As thousands of the nobility are fleeing for their lives, she decides to hide her family's fortune inside the lining of a set of handcrafted chairs. That secret is her dying revelation and is said unfortunately into more than one set of ears. This initiates a mad dash for the lost treasure. Seeking the cache of jewels are three intrepid, but greedy set of characters. The first is incredibly talented Ron Moody who adroitly and brilliantly plays the legitimate, greedy and opportunistic son, Ippolit Vorobyaninov. Once a Marshall of the nobility, he is now reduced to a minor banking clerk and opportunistic son-in-law. Frank Langella is superior as Ostap Bender, a handsome, street-wise, traveling Gypsy, who also wants in on the treasure hunt. Finally there is Dom DeLuise who plays Father Fyodor, an Orthodox but impoverished monk who believes, God will help him find the elusive chair first. What the trio soon discover is that the chair is one of Twelve which have been scattered across the vast twelve thousand miles of Russia. If Mel Brooks sought to create an amusing memorable movie, he succeeded. By the time one reaches the end of this film, we realize . . . . a Classic has been born. ****",
         "I rented this film because it was the only Mel Brooks movie I hadn't seen. I had enjoyed all of his other movies and thought,\"Why not see 'em all?\" I thought since I hadn't heard of it it would be stupid. And, Man, was I wrong. This movie could be described as hilarious. I loved it. And it's not exactly like all other Mel Brooks movies. If you like Mel Brooks I recommend this film to you. Dom DeLuise is hilarious in this. Now go watch it with your family.",
         "Knowing that Mel Brooks usually makes the silliest movies possible, it's a surprise that he directed the lightweight comedy \"The Twelve Chairs\". It portrays a former Czarist (Ron Moody, happy birthday!) and a young soldier (Frank Langella) looking for some jewels hidden in chairs in the Soviet Union in the 1920s. I will say that not much really happens throughout much of the movie, but it is a famous part of Russian literature. I haven't read the novel, but the movie is worth seeing, if only as a look at Brooks's early career. Also starring Dom DeLuise and Brooks in a small role. Epilepsy...",
         "Fans of Mel Brooks' 'The Producers' will find particular delight in 'The Twelve Chairs'; the two are of a distinctly different style than the more biting parodies that make up his later works. 'The Twelve Chairs' is not a new story, even by 1970 standards. The chase for treasure is an often-used hook to hang a madcap plot. Slapstick and physical humor are employed liberally, most effectively by Dom Deloise as Father Fyodor, the Russian priest who has turned on the church to join in the run for the jewels. His adventures as he is sidetracked to Siberia by the self-described 'handsome young desperado' Ostap Bender (Frank Langella) are funny and completely in character. What makes 'The Twelve Chairs' different is its human side. The former Russian nobleman I.M. Vorobyaninov is portrayed by Ron Moody perfectly: now reduced to a file clerk, he still lives in his pre-Revolutionary past, flatly refusing to beg when he and Bender are down to their last few rubles and still in pursuit of the chairs. The audience roots for the flashy, smart Bender but also for the pitiable Vorobyaninov as his character grows through the experience. Characters we meet along the way define other human conditions (the traveling show producer's haughtiness, his assistant's greed, the railworkers' pride). These elements make 'The Twelve Chairs' more like 'The Producers' than 'High Anxiety,' and a film worthy of a listing with Brooks' best.",
         "A \"serious comedy\" from Mel Brooks. \"The Twelve Chairs\" borders on farce but is relatively restrained. This restraint is all the more remarkable in light of Dom DeLuise's manic attempts to take over. Ron Moody (who is best remember as Fagin in 'Oliver' on film and on the West End and Broadway)is superb. Frank Langella is less impressive, but he does bring the necessary character to the role. If you expect and want \"Blazing Saddles\" this movie is not for you. Nor is it as perfect a picture as \"Young Frankenstein\". But this Brooksian take on a Russian comedy of errors is well worth your attention. The belly laughs are few and far between, but the tugs on the heartstrings (along with some slapstick) suffice. If I am spare on the details, it is only because I have not seen this motion picture since its theatrical release in 1970; it's definitely one to which I have to renew my acquaintance.",
         "THE TWELVE CHAIRS is a different kind of Mel Brooks comedy. Its story, from a Russian novel by Ilf and Petrov, will seem very tasteful and human to those who are acquainted with Brooks' usual raunchiness. This movie is a nice change. Ron Moody and Frank Langella star, with Dom DeLuise and a special appearance by Mel Brooks as Tikon."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Crossbow Productions",
         "The Twelve Chairs Company",
         "Twelve Chairs Company"
      ],
      "summaries": [
         "A treasure hunt. An aging ex-nobleman of the Czarist regime has finally adjusted to life under the commisars in Russia. Both he and the local priest find that the family jewels were hidden in a chair, one of a set of twelve. They return separately to Moscow to find the hidden fortune.",
         "It's the late 1920's Soviet Union. Ippolit Matveevich Vorobyaninov was an aristocrat prior to the Russian Revolution, but in addition to squandering away most of his wife's family's money at that time, lost everything during the revolution and now is a lowly government bureaucrat. He learns from his mother-in-law, on her deathbed, that during the revolution she hid all her jewels in what were then one of their twelve dining room chairs so that the Bolsheviks could not get a hold of them. Those jewels would now be worth upwards of 200,000 rubles, enough for Vorobyaninov once again to live a lavish life. Going back to the old family home where the dining room set should still be, he finds that the chairs have been largely dispersed individually. As he is a feckless man, he goes into cahoots with Ostap Bender, a con artist, to search for the twelve chairs, the prize being the unknown one with the hidden jewels. In addition to their task, they find that they have to steer one other off that search, namely the family priest, Father Fyodor, who learned of the jewels in Vorobyaninov's mother-in-law's last confession and who now wants the jewels for himself. Through and after the process of trying to locate the prized chair, Vorobyaninov may find out his true lot in life, or at least that for his immediate future.",
         "Years after the Russian Revolution in 1917, the former aristocrat Ippolit Matveevich Vorobyaninov is informed by his terminal mother-in-law that she has hidden her jewels in a the upholstery of chair from a set of twelve chairs. The Orthodox Father Fyodor also hears and leaves the Church to seek out the treasure. Vorobyaninov travels to his old house and meets his former servant Tikon that adores him. He learns that the chairs had been expropriated by the new government and sent to another place. However the con artist Ostap Bender convinces Vorobyaninov to be his partner. They travel to Moscow where Ostap succeeds in luring Father Fyodor, telling that the chairs belong to the Engineer Bruns, who has very similar chairs and lives with his wife in Siberia. Will Vorobyaninov and Ostap find the twelve chairs?",
         "In 1920s Soviet Russia, a fallen aristocrat, a priest and a con artist search for a treasure of jewels hidden inside one of twelve dining chairs, lost during the revolution."
      ],
      "budget": 0
   },
   "movielensId": 3622,
   "movielens": {
      "languages": [
         "Pусский",
         "English"
      ],
      "releaseDate": "1970-10-28",
      "dvdReleaseDate": "2000-05-09",
      "directors": ["Mel Brooks"],
      "runtime": 94,
      "movieId": 3622,
      "title": "The Twelve Chairs",
      "mpaa": "G",
      "actors": [
         "Ron Moody",
         "Frank Langella",
         "Dom DeLuise",
         "Andréas Voutsinas",
         "Diana Coupland",
         "David L. Lander",
         "Mel Brooks"
      ],
      "imdbMovieId": "0066495",
      "originalTitle": "The Twelve Chairs",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["Wt1lHyuTDWE"],
      "plotSummary": "A treasure hunt. An aging ex-nobleman of the Czarist regime has finally adjusted to life under the commisars in Russia. Both he and the local priest find that the family jewels were hidden in a chair, one of a set of twelve. They return separately to Moscow to find the hidden fortune.",
      "tmdbMovieId": 24918,
      "avgRating": 3.53297,
      "releaseYear": "1970",
      "numRatings": 364,
      "posterPath": "/dvtiZCFOBBmzz7NDIMuvSeP91nO.jpg"
   }
}