{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "loss of loved one",
            "id": 697
         },
         {
            "name": "parent child relationship",
            "id": 970
         },
         {
            "name": "harem",
            "id": 9194
         },
         {
            "name": "illegal prostitution",
            "id": 33625
         }
      ],
      "imdb_id": "tt0154443",
      "video": false,
      "title": "8 ½ Women",
      "recommendations": [
         41653,
         87693,
         135380,
         80310,
         57489,
         246166,
         68569,
         34787,
         9646,
         79406,
         87208,
         71065,
         56503,
         122671,
         52331,
         64719,
         28277,
         49653,
         32891,
         324259
      ],
      "backdrop_path": "/xr1ROSZ5jghD6AXUCecby08EB3R.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 12,
               "character": "Philip Emmenthal",
               "gender": 2,
               "credit_id": "52fe44289251416c7502ac7b",
               "name": "John Standing",
               "profile_path": "/npS8a4mKgqpJJiNeRPn0Ftl7pxj.jpg",
               "id": 11282,
               "order": 0
            },
            {
               "cast_id": 13,
               "character": "Storey Emmenthal",
               "gender": 2,
               "credit_id": "52fe44289251416c7502ac7f",
               "name": "Matthew Delamere",
               "profile_path": null,
               "id": 69032,
               "order": 1
            },
            {
               "cast_id": 14,
               "character": "Kito",
               "gender": 1,
               "credit_id": "52fe44289251416c7502ac83",
               "name": "Vivian Wu",
               "profile_path": "/sCB8qsYL8Qqf6pG2Z6gBEjOszNz.jpg",
               "id": 69033,
               "order": 2
            },
            {
               "cast_id": 15,
               "character": "Simato",
               "gender": 0,
               "credit_id": "52fe44289251416c7502ac87",
               "name": "Annie Yi",
               "profile_path": null,
               "id": 69034,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "Griselda",
               "gender": 1,
               "credit_id": "52fe44289251416c7502ac8b",
               "name": "Toni Collette",
               "profile_path": "/oMps1ZPH3dHmqZmrpZcRiyUBgA.jpg",
               "id": 3051,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Amelia, Philip's Wife",
               "gender": 1,
               "credit_id": "573606b19251410b210004b0",
               "name": "Claire Johnston",
               "profile_path": "/xTTYpI9aGCurrpXhmlLz4MaPPQu.jpg",
               "id": 54275,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Palmira",
               "gender": 1,
               "credit_id": "573606c9c3a3687e240004b5",
               "name": "Polly Walker",
               "profile_path": "/nUYl7W4QcO9ud2ig6qvLQ2qs0HZ.jpg",
               "id": 6416,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Beryl",
               "gender": 1,
               "credit_id": "573606da92514113dd0003f6",
               "name": "Amanda Plummer",
               "profile_path": "/uICpVUj29yBcwCEGVZzE77FL98W.jpg",
               "id": 99,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Celeste",
               "gender": 1,
               "credit_id": "59d1858fc3a368791602c5bd",
               "name": "Elizabeth Berrington",
               "profile_path": "/wFz71bIKTlQoa8v1s243TIh5wUm.jpg",
               "id": 42998,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Simon",
               "gender": 0,
               "credit_id": "59d1859cc3a36878d702bcc3",
               "name": "Don Warrington",
               "profile_path": "/szlydzWoMaCGcgpB853ZcRN7Da8.jpg",
               "id": 49813,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Mio",
               "gender": 0,
               "credit_id": "59d185bac3a368786c02cb3a",
               "name": "Kirina Mano",
               "profile_path": "/wp1geaRWg4JDyTTCOyPK9PBFsYP.jpg",
               "id": 133462,
               "order": 10
            },
            {
               "cast_id": 23,
               "character": "Giulietta/Half Woman",
               "gender": 0,
               "credit_id": "59d185d6925141145202f518",
               "name": "Manna Fujiwara",
               "profile_path": null,
               "id": 1898366,
               "order": 11
            },
            {
               "cast_id": 24,
               "character": "Giaconda",
               "gender": 1,
               "credit_id": "59d185ef925141145202f54f",
               "name": "Natacha Amal",
               "profile_path": "/bX6xF83hk2a5frVVIv9DrJ1kML2.jpg",
               "id": 932035,
               "order": 12
            },
            {
               "cast_id": 25,
               "character": "Clothilde",
               "gender": 1,
               "credit_id": "59d1860c925141142f02f086",
               "name": "Barbara Sarafian",
               "profile_path": "/3AuVl37heFu3PU9q4sNmN4UMU7X.jpg",
               "id": 234568,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44289251416c7502ac3b",
               "name": "Peter Greenaway",
               "profile_path": "/mJVkXKdlDbwYoGMZpr0Qg57r69w.jpg",
               "id": 30309,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44289251416c7502ac41",
               "name": "Peter Greenaway",
               "profile_path": "/mJVkXKdlDbwYoGMZpr0Qg57r69w.jpg",
               "id": 30309,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44289251416c7502ac47",
               "name": "Terry Glinwood",
               "profile_path": null,
               "id": 69029,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44289251416c7502ac4d",
               "name": "Bob Hubar",
               "profile_path": null,
               "id": 69030,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44289251416c7502ac53",
               "name": "Kees Kasander",
               "profile_path": null,
               "id": 51919,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44289251416c7502ac59",
               "name": "Denis Wigman",
               "profile_path": null,
               "id": 69031,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44289251416c7502ac5f",
               "name": "Reinier van Brummelen",
               "profile_path": null,
               "id": 23582,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44289251416c7502ac65",
               "name": "Sacha Vierny",
               "profile_path": null,
               "id": 9752,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe44289251416c7502ac6b",
               "name": "Elmer Leupen",
               "profile_path": null,
               "id": 31436,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe44289251416c7502ac71",
               "name": "Frank Loesser",
               "profile_path": null,
               "id": 41747,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44289251416c7502ac77",
               "name": "Giuseppe Verdi",
               "profile_path": "/cpNvwEiVcSAoFkZ1oah7woszifq.jpg",
               "id": 15130,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 1.916631,
      "production_countries": [
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "LU",
            "name": "Luxembourg"
         },
         {
            "iso_3166_1": "NL",
            "name": "Netherlands"
         }
      ],
      "id": 11332,
      "vote_count": 16,
      "budget": 0,
      "overview": "After the death of his wife, wealthy businessman Philip Emmenthal and his son Storey open their own private harem in their family residence in Geneva (they get the idea while watching Federico Fellini's 8½ and after Storey is \"given\" a woman, Simato (Inoh), to waive her pachinko debts). They sign one-year contracts with eight (and a half) women to this effect. The women each have a gimmick (one is a nun, another a kabuki performer, etc.). Philip soon becomes dominated by his favourite of the concubines, Palmira, who has no interest in Storey as a lover, despite what their contract might stipulate. Philip dies, the concubines' contracts expire, and Storey is left alone with Giulietta (the titular \"½\", played by Fujiwara) and of course the money and the houses.",
      "similar": [
         334,
         11631,
         425,
         745,
         10054,
         1562,
         393,
         319,
         1374,
         1547,
         2024,
         8967,
         49519,
         112160,
         858,
         13,
         69,
         88,
         401,
         39254
      ],
      "original_title": "8 ½ Women",
      "runtime": 118,
      "poster_path": "/9HXeaaFjiNYkkEHmbjnBFfgbqwp.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         },
         {
            "name": "日本語",
            "iso_639_1": "ja"
         },
         {
            "name": "Latin",
            "iso_639_1": "la"
         },
         {
            "name": "Pусский",
            "iso_639_1": "ru"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Delux Productions",
            "id": 1472,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Kasander & Wigman Productions",
            "id": 4506,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Continent Film GmbH",
            "id": 23143,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Movie Masters",
            "id": 23140,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Woodline Productions",
            "id": 23138,
            "origin_country": ""
         }
      ],
      "release_date": "1999-05-22",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "When sexual desire becomes an obsession, it's every man for himself.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Peter Greenaway"],
      "runtime": 118,
      "synopsis": null,
      "writers": ["Peter Greenaway"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0154443/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA1NTA5MTIwMF5BMl5BanBnXkFtZTcwMDU1NDAyMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: John Standing, Matthew Delamere, Vivian Wu | See full cast and crew »"],
      "reviews": [
         "Actually, Greenaway has nearly always been laughing. It's just that many people fail to notice that. \"8 1/2 Women\", however, is different in that even the people who hate it (of which there will be plenty; it's Greenaway) will have no doubts that it is a comedy, and Greenaway's lightest-toned film yet. It is a playful tribute to Fellini and Godard, and it features - prominently - understanding, affection and warmth, none of which are emotions one would have easily associated with Greenaway's previous work. (In an after-screening interview, he commented that age makes one want to look more at the better side of things.) Because this is still very much a Peter Greenaway film, the ways in which emotions such as filial love are going to be explored are going to be very quirky indeed; but to interpret the film's \"taboo\" scene as intended to shock is a disservice to the film, the director's intentions (and his ability to *truly* shock when he wants to - check \"The Baby of Macon\") and your own enjoyment. \"8 1/2 Women\" is full of odd little moments (and one SPECTACULARLY odd image which I won't spoil much, except to mention that it involves a pig, a Japanese Noh performer and a stunning Swiss villa) and offbeat humour; and it is about male bonding and male delusions about women. I can see how many people have taken the facile route of viewing it as misogynistic; these people have obviously not seen the same film as I have, which is all about control from behind the scenes, strategy, and the presentation of male supremacy for what it is - a fallacy. \"8 1/2 Women\" was badly received at Cannes, got a tremendous backlash against it and died a death commercially. All of which is very unfair. If you like eccentric humour, give this film a chance. It's a little Wonderland of sorts and, in its own peculiar way, far more heartwarming than the average plastic Hollywood tear-jerker.",
         "A master visual allegorist reaches farther and fails. But not for the reasons others claim here. Greenaway has never centered his films in the narrative -- we'd always be frustrated to look for satisfaction there. (`Drowning' which among his works most delivers a story does so incidentally.) And this is a film about women, not sex, which will frustrate others. Here is his most character-driven film. At last, he works on closeups and some character definition. The primary ordering of the film is by basic archetypes of women, particularly archetypes drawn by men. This is supposed to be his most painterly film: the representative women are to be presented in scenes that reference famous paintings. Greenaway has stated that painting cuts to the basic drivers in cultural revolution, and the representations of women therein are tokens for everything conceived. Women thus are both humans and basic tokens in the redefinition of life. Such a rich conception is thoroughly Greenawayan and might have formed the skeleton for another masterpiece. Along the way, we have by now familiar devices. Numbers: random as in pachinko rather than ordered. Contrasts between Eastern (here just Japanese) and Western management of concept and image. Some slight use of layered images, here in the self-reference of displaying the screenplay. My complaints are two. I consider them fatal, but still celebrate Greenaway. The notion of archetype depends on clarity, a natural orthogonality and completeness of classes. Here we have the nun, whore, Chinadoll, servant, cripple, childbearer, fetishist, butch, and spontaneous addict. Time is invested in defining these. A few are singled out to be something more than props for lush compositions: the geisha chinadoll, the lesbian accountant, the gambler and the opportunistic, openly enthusiastic whore. But in bringing them to life, they escape their categories: two of these are male impersonators, another two financial manipulators, another two vamps. Three are Japanese. Usually, Greenaway's combination of painting (erudite structure and framing of scenes) and film (narrative, development) reinforce one another. Here, they dissonate. The second problem may be more fundamental. You really have to know your stuff to enjoy these films. My knowledge of The Tempest is rather deep, so I saw how rich was `Prospero's Books.' I read up on restoration comedy for `Draughtsman,' and discovered art in the viewing that I presume no one else in the theater saw. This film is supposed to reference the feminine archetype not as defined by popular culture, but by the history of painting. My knowledge of the art is poor, so I cannot attest to how deep the annotations are here. (Little use is made here of the layered image and narrative comment. Wonder why, since it would have been so natural. But I do know Gauguin, who also was a visual allegorist, who also worked with feminine archetypes and also the fascination with Asian differences. His monumental canvas `Where are We Going?' does just what this film purports. I wonder if there is little there in this film.",
         "Despite being hissed at Cannes this film is still well worth seeing. I purchased the DVD and the more I watch it the better I like it. For a start, as with all Greenaway's work since The Falls, the photography is ravishing. I don't think anyone makes films which look better. What few have picked up on is that (as well as an attempt to pick up Fellini's 8 1/2-ball and run with it), this is almost a remake of \"A Zed and Two Noughts\". Both films study bizarre responses to bereavement. both films play on doubling, in this case a father and son rather than two brothers. Both films touch on bestiality (with animals called Hortense!), gynecology, sex with amputees, a menagerie (in this case of women rather than animals), prostitution, uses of light, storytelling, and the colours black and white. Where that film referenced painting, this references performance in many guises - cinema, kabuki, cross-dressing, opera, television, prostitution, as well as painting. Contrary to at least one other user comment, there is no sexual intercourse shown in the film, although there is a quantity of nudity. It's very odd, if perhaps unsurprising, that this film has been sold as a sexy movie. SexIST? Well, confusing an ironic depiction of men's sexual fantasies with a reduction of women to the level of fantasy is 'politically correct' laziness at best. And as with most of Greenaway's films, the women are the winners in the end. One reason this is harder work than the earlier film is the lack of Michael Nyman's ravishing music. I'm not sure why Greenaway stopped working with Nyman; possibly he felt he was stuck in a rut - perhaps he was nettled by charges that any old footage looked like Greenaway if you played Nyman's music behind it. Either way, he's yet to arrive at a truly satisfactory alternative. Here we have \"Slow Boat to China\" sung a capella by the two leads, rather after the manner of Morecambe and Wise. It's quite funny, but it's not the marriage of sound and image of earlier films. The extent to which Philip Emmenthal represents Greenaway himself is perhaps worth considering. A character makes reference to Fellini having Mastroianni make love to all the women Fellini couldn't, and asks whether all directors make films to fulfil their own sexual fantasies. Emmenthal is notably the same age as Greenaway. He may not be sweeping the art-house scene before him these days (in fact there's not much of an art-house scene left these days), but in the end, even below-par Greenaway is better than 99% of directors can even aspire to.",
         "I've heard and read much criticism about Greenaway's homage to Fellini, \"8 1/2 Women\", and have found it both predictable and amusing. Every Greenaway film evokes raw, often disturbing emotions in the viewer-- this is nothing new, yet is treated like a revelation with every new release. And some fans and critics of Greenaway seem to be keeping a running score of his visual/emotional offenses, even tending to get irate when he fails to shock or disturb on the level of his other films. But again, this is nothing new. So I'm humored at the reaction to \"8 1/2 Women\", for it is as visually stunning/arousing/disturbing as many of its predecessors while it is actually quite tame by Greenaway's standards (for one, the cannibalism/mutilation theme is missing). Yet we have those who are disappointed at the lack of shock or those who are too easily shocked, and Greenaway has long proven that you can't make everyone happy in filmmaking and, honestly, he really doesn't care what you think. You only have to watch. He is really very similar to Fellini in this way as he is in so many others. I'm no great fan of Fellini's, not as much as I am of his successors anyway, but the parallels are apparent. Fellini worked in absurdities the way Greenaway works in the dire or some artists work in oils. He made the most ridiculous scenarios seem beautiful, artful... even sexy. He imprinted upon film as art and future filmmakers that strange and disjointed often equals desirable, and Greenaway clearly took this to heart. But like Fellini, Greenaway films come with an automatic caveat: You will see things that we are taught to abhor and despise in our society, you will have to think about things from which humans naturally shrink away and you will bear witness to the possibility that great beauty can be found in the mire if you can manage to look long enough. Greenaway's \"awfulness\" and attempt to disgust you is his medium and his brilliance (and his great joke on you), and if this doesn't sit well with you then you shouldn't watch Greenaway. It's as simple as that. So, that being said - \"8 1/2 Women\". Not Greenaway's best, but certainly not his worst. Again we get to share in his great love of the human form in all its beauty and imperfection-- both of body and of character. But this is his most lighthearted attempt and is thoroughly enjoyable for that alone. The relationship between the widower Philip Emmenthal and his earthshakingly prattish son Storey is genuinely touching, as are their relationships with the various women they bring into their lives to replace their lost wife/lover/mother. Equally moving is the fact that these women become much more than mere objects or possessions in their house, but rather individual character studies on the strength of femininity and the power that women have over men. While Fellini's \"8 1/2\" may have been semi-autobiographical, here Greenaway seems to have tapped into the fantasies and realities of the relationships between men and women everywhere, focusing on the fact that neither are as simple as they seem. And that while mere sex will inevitably falter in the face of deeper love, such meaningful relationships are elusive and fleeting. He doesn't tap very far through, which is this film's only failing; the relationships and characters, some of whom are downright silly, are often taken at surface value and the themes, especially regarding sexual dynamics, are nothing new to cinema. Nevertheless, \"8 1/2 Women\" is a lovely, surprisingly sincere and often humorous account of men, women, family, self-identity and the rewards of living out your fantasies along with their tempering costs. Highly recommended for anyone who has been scared away by Greenaway's other films or for anyone else who truly enjoys the beauty found in strong women and faltering men.",
         "I went in expecting the worst and left completely turned around. 8 1/2 Women doesn't hold a candle to The Pillow Book, The Cook the Thief..., or his earlier Drowning By Numbers, but I had fun! It was almost like Peter Greenaway does Woody Allen (wanna talk about film makers who purge their sexual fantasies on screen!) With the exception of a couple of scenes, the visual style of this film is stark and simple (much like Drowning...) and relied heavily on smart dialogue, which at times got a bit over the top, intellectually speaking, but kept the film going. I never got bored with it, I never got too disgusted, and even if I can't recommend it to most of the people I know, I still feel it's a strong feature. Now, even though this is Greenaway Lite, it still isn't for people who didn't like any of his earlier films. But even if you only liked The Cook The Thief, you should give this one a chance. Forget that you have hang ups about sex and sit back and watch the perversion unfold! Pure, sick fun!",
         "Frederico Fellini's \"8 1/2\" is a movie this one is theoretically inspired by. There are consistent references to it in this film, some subtle, and some glaringly obvious. One should take this into account so that it will not hamper one's voluntary suspension of disbelief, though this movie definitely stands on its own if the viewer has never seen \"8 1/2\". Voluntary is, perhaps, an inappropriate word. This movie takes disbelief, which should certainly be present, and suspends it for you, in a most amusing way. The film may well attempt to say something deep about human nature, and the interaction between a fickle heart which has lots of love to give and a bored brain with so many thoughts - but it doesn't say it so loud that you can't just sit back and enjoy the picture. Some scenes are funny to all; some scenes may cause you to be the only hysterical person in the theater. In any case, it's well worth the ticket or rental cost. Some male nudity is present, though no more than the average British movie containing male nudity. No sex scenes are overly graphic, though one should definitely have an open mind going into the movie in order to enjoy it. If you didn't feel a significant need to leave the theater during \"Gouttes d'eau sur pierres brûlantes,\" which I was last week, you should be able to thoroughly enjoy this film. (Lighting designers watch for the Kabuki scene; it won awards in Europe and definitely looks very cool.)",
         "I went to see it because I am fascinated with Japanese culture. Furthermore, I admire mr. Greenaway for the typical British way in which he exposes hypocrisy, yet in a very tasteful manner, and combines this with baroque visuals. I was warned however that it had nothing resembling a coherent story. It might even be boring. Call me a twisted European, but I actually like \"8.5 women\", more than \"Eyes wide shut\"! The characters are indeed to unnatural to empathize with, and the movie will certainly stimulate your mind more than it will entertain you.....or arouse you sexually. The characters find themselves in a loosely connected stream of little scenes. Rather than making normal conversation, everyone seems to say what they think in this stream of sub-consciousness. Mr. Greenaway plays with all aspects of sex and connects these, often in a disturbing manner, with death, religion, procreation and age and gender roles. He jumps across the cultures and taboos of this globe. Of course you might be offended by the candid way in which these ideas are treated. However, explicit scenes aren't shown. It doesn't need this effect to create a strange but compelling movie about our confused sexual morals on the threshold of a new millennium.",
         "This is a great Greenaway film. And like most Greenaway films, it is stuck in its own little universe. If you step into that universe and not like it, you will most likely walk out, never to return. But for us that love Greenaway's universe, we will stay and make ourselves a pot of the strangest tea and drink it, greedily. The plot revolves around an older man, who had just lost his wife of many years, and his son. They watch Fellini and decide to capture some woman to make a harem of their desires. Some women come there to satisfy a debt, another comes of her own free will, as long as they pay her $75,000 a year. Each woman has an interesting back story. One is addicted to gambling, one loves her horse, one loves to have babies, one is a nun, one is a martyring maid, one is in a wheelchair. Each of these woman could be a character from a Fellini film. The movie is filled with a lot of wit and irony, once the women come to the house. The women start making demands and by the end, the movie is dropped into a metaphoric and Shakespearian tragic end. I won't give any more details than that. The lighting, mood and story of this movie is completely original. Some viewers might not like the frankness of the dialog and/or the nudity of both sexes, but I feel it ranks right up there with Greenway's other films, like Tulse Luper Suitcases, The Falls, Zoo, Drowning by Numbers, etc. I heard it was a sexist movie, but I have seen more sexism in slapstick comedies and films like In The Company of Men. I usually look for a good story and interesting characters, be they flawed or not, and 8 !/2 Women delivers both. I wasn't bored for a second watching this. The director makes his own little world. It's an odd world and has different moral standards, but that is part of its charm viewers tend to miss.",
         "Fans of Peter Greenaway will not be disappointed. This film seems to be following an on-going trend of a creating more subtle approach to subjects of sexualities. If Greenaway is maturing, it's by leaving even more unsaid about the various subjects he chooses for study. This may result in works which are even more inaccessible than previous works like \"The Cook...\" and \"Prospero's Books\". Patience is the key with Greenaway, and this film certainly demands it.",
         "It seems that when Peter Greenaway lets his hair down, he automatically reverts back to adolescence. 8 1/2 WOMEN is visually striking and the dialogue has a rhythm and cadence to it that's a joy to listen. But the whole thing is simply infantile. I'm aware that the movie is not meant to be taken seriously and that the characters in the story are immature spoiled brats but that doesn't mean the movie itself has to feel like it was done by an immature, spoiled artist. The end product feels more like someone who's got too much time on his hands and creates movies from whatever pops in his head than something that comes from the heart or mind. Few of the characters are interesting, as people or as subjects for a movie. The dialogue was funny and caustic but the constant need to blurt out certain \"shocking\" words was really silly, and got only sillier by the end of the film. Only the brilliant visual and aural feast that usually typifies a Greenaway film made this worth watching."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Woodline Productions",
         "Movie Masters",
         "Delux Productions"
      ],
      "summaries": [
         "After his wife dies, 55-year-old businessman Philip Emmenthal, at the prompting of his playboy son Storey, populates his Geneva villa with eight and a half concubines. Three are from Kyoto, where Storey manages Pachinco palaces. Each has a distinctive personality: a nun, a child bearer, a gambler, a student of Kabuki, a horsewoman with a pet pig, a maid. Philip throws off his strait-laced and repressed attitudes, immersing himself in pleasure. After about a year, the women begin to assert their own power. Side adventures pre-figure the household's breakup, and the women depart in one way or another, one at at time. Philip's fate is in the hands of Palmira, his favorite.",
         "Following the death of a mother, a father and son open up a brothel in their Genevan estate after watching Achteinhalb (1963)."
      ],
      "budget": 0
   },
   "movielensId": 3626,
   "movielens": {
      "languages": [
         "English",
         "Deutsch",
         "Italiano",
         "日本語",
         "Latin",
         "Pусский"
      ],
      "releaseDate": "1999-05-22",
      "dvdReleaseDate": "2000-10-10",
      "directors": ["Peter Greenaway"],
      "runtime": 118,
      "movieId": 3626,
      "title": "8 ½ Women",
      "mpaa": "R",
      "actors": [
         "John Standing",
         "Matthew Delamere",
         "Vivian Wu",
         "Annie Yi",
         "Toni Collette",
         "Claire Johnston",
         "Polly Walker",
         "Amanda Plummer",
         "Elizabeth Berrington",
         "Don Warrington",
         "Kirina Mano",
         "Manna Fujiwara",
         "Natacha Amal",
         "Barbara Sarafian"
      ],
      "imdbMovieId": "0154443",
      "originalTitle": "8 ½ Women",
      "genres": [
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": ["QOnVU5V6H68"],
      "plotSummary": "After the death of his wife, wealthy businessman Philip Emmenthal and his son Storey open their own private harem in their family residence in Geneva (they get the idea while watching Federico Fellini's 8½ and after Storey is \"given\" a woman, Simato (Inoh), to waive her pachinko debts). They sign one-year contracts with eight (and a half) women to this effect. The women each have a gimmick (one is a nun, another a kabuki performer, etc.). Philip soon becomes dominated by his favourite of the concubines, Palmira, who has no interest in Storey as a lover, despite what their contract might stipulate. Philip dies, the concubines' contracts expire, and Storey is left alone with Giulietta (the titular \"½\", played by Fujiwara) and of course the money and the houses.",
      "tmdbMovieId": 11332,
      "avgRating": 2.8367,
      "releaseYear": "1999",
      "numRatings": 297,
      "posterPath": "/9HXeaaFjiNYkkEHmbjnBFfgbqwp.jpg"
   }
}