{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "organ",
            "id": 4572
         },
         {
            "name": "car crash",
            "id": 9844
         },
         {
            "name": "b movie",
            "id": 11034
         },
         {
            "name": "female protagonist",
            "id": 11322
         },
         {
            "name": "cult film",
            "id": 34117
         },
         {
            "name": "organ music",
            "id": 188709
         }
      ],
      "imdb_id": "tt0055830",
      "video": false,
      "title": "Carnival of Souls",
      "recommendations": [
         25508,
         31417,
         25319,
         27130,
         13581,
         16372,
         11772,
         57283,
         11167,
         26857,
         15856,
         11773,
         3031,
         24106,
         17965,
         13666,
         27632,
         39891,
         32569,
         3763
      ],
      "backdrop_path": "/f050RIqYVsba517sJw8Jgwogmmx.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "53370cb19251417da4001177",
         "content": "We open with a car crash...\r\n\r\nMary and her two friends leave the road and fly off a bridge during a friendly dragster race. She is the only survivor and after her recovery she takes up a job as the church organist in a new town, but she is constantly blighted by a ghostly like visitor and periods of time when nobody seems to know she exists.\r\n\r\nA hinted spoiler follows.\r\n\r\nCarnival Of Souls has thankfully found a whole new audience in the new millennium, the advent of cheap triple pack DVDs and a lush Criterion release have brought it firmly to the attention of Horror/Ghost fans who were not aware that the film even existed. That said, there is no doubting that many big name directors were fully aware of it, tho, for Carnival Of Souls has influenced such luminary genre masters from Romero to Carpenter, and from Hooper to Shyamalan, be it the low budget DIY ethic, or its now genre staple twist ending, it's a film (along with it's director Herk Harvey) that is referenced as much as it is copied.\r\n\r\nThe tag often used for the film is that it's an elongated Twilight Zone episode, and sure enough I think that is a perfect fit. Its whole structure feels like a part of that wonderful and amazing Rod Serling show, and for sure this story owes a doff of the cap to An Occurrence At Owl Creek Bridge (an Ambrose Bierce short that was reworked and used on Serling's show), but to merely suggest a retread of a previously used idea would be very unfair. Carnival Of Souls is full of eerie sequences that are dream like in quality yet goose pimply in effect. Scored at frequent intervals by a jangling organ shrill, the ghostly phantoms that plague poor Mary actually bring a shiver to the spine; while a surrealistic dance of the carnival is a stunning eerie highlight. It's a wonderfully brought together story that has one pondering uneasily from the get go, managing to jolt your senses adroitly with a very special ending.\r\n\r\nWith a small budget of only $30,000 and a cast of friends, Herk Harvey crafted one of the best independent horror sub-genre films ever made. Don't believe me? Then go ask Romero, Raimi or Hooper. 8/10",
         "url": "https://www.themoviedb.org/review/53370cb19251417da4001177"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Mary Henry",
               "gender": 0,
               "credit_id": "52fe46a29251416c7507e7af",
               "name": "Candace Hilligoss",
               "profile_path": "/ykyX2nOP8LLiVqQnkHOPqo82VMp.jpg",
               "id": 79298,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Mrs. Thomas, Landlady",
               "gender": 1,
               "credit_id": "52fe46a29251416c7507e7b3",
               "name": "Frances Feist",
               "profile_path": null,
               "id": 79299,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "John Linden",
               "gender": 2,
               "credit_id": "52fe46a29251416c7507e7b7",
               "name": "Sidney Berger",
               "profile_path": null,
               "id": 79300,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Minister",
               "gender": 2,
               "credit_id": "52fe46a29251416c7507e7bb",
               "name": "Art Ellison",
               "profile_path": null,
               "id": 79301,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Dr. Samuels",
               "gender": 2,
               "credit_id": "52fe46a29251416c7507e7bf",
               "name": "Stan Levitt",
               "profile_path": null,
               "id": 79302,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Organ Factory Boss",
               "gender": 2,
               "credit_id": "52fe46a29251416c7507e7c3",
               "name": "Tom McGinnis",
               "profile_path": null,
               "id": 79303,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Organ Factory Worker",
               "gender": 0,
               "credit_id": "52fe46a29251416c7507e7c7",
               "name": "Forbes Caldwell",
               "profile_path": null,
               "id": 79304,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Gas Station Attendant",
               "gender": 0,
               "credit_id": "52fe46a29251416c7507e7cb",
               "name": "Dan Palmquist",
               "profile_path": null,
               "id": 79305,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Mechanic",
               "gender": 0,
               "credit_id": "52fe46a29251416c7507e7cf",
               "name": "Bill de Jarnette",
               "profile_path": null,
               "id": 79306,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Chip, Man at Juke Box",
               "gender": 0,
               "credit_id": "52fe46a29251416c7507e7d3",
               "name": "Steve Boozer",
               "profile_path": null,
               "id": 79307,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Dress Sales Lady",
               "gender": 0,
               "credit_id": "52fe46a29251416c7507e7d7",
               "name": "Pamela Ballard",
               "profile_path": null,
               "id": 79308,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Drag Racer",
               "gender": 0,
               "credit_id": "52fe46a29251416c7507e7db",
               "name": "Larry Sneegas",
               "profile_path": null,
               "id": 79309,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Lake Zombie",
               "gender": 0,
               "credit_id": "52fe46a29251416c7507e7df",
               "name": "Cari Conboy",
               "profile_path": null,
               "id": 79310,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "Dress Store Customer",
               "gender": 0,
               "credit_id": "52fe46a29251416c7507e7e3",
               "name": "Karen Pyles",
               "profile_path": null,
               "id": 79311,
               "order": 13
            },
            {
               "cast_id": 20,
               "character": "Dancing Zombie",
               "gender": 0,
               "credit_id": "52fe46a29251416c7507e7e7",
               "name": "T.C. Adams",
               "profile_path": null,
               "id": 79312,
               "order": 14
            },
            {
               "cast_id": 21,
               "character": "Mary's Girlfriend",
               "gender": 0,
               "credit_id": "52fe46a29251416c7507e7eb",
               "name": "Sharon Scoville",
               "profile_path": null,
               "id": 79313,
               "order": 15
            },
            {
               "cast_id": 22,
               "character": "Mary's Girlfriend",
               "gender": 0,
               "credit_id": "52fe46a29251416c7507e7ef",
               "name": "Mary Ann Harris",
               "profile_path": null,
               "id": 79314,
               "order": 16
            },
            {
               "cast_id": 23,
               "character": "A Walking Corpse",
               "gender": 0,
               "credit_id": "52fe46a29251416c7507e7f3",
               "name": "Peter Schnitzler",
               "profile_path": null,
               "id": 79315,
               "order": 17
            },
            {
               "cast_id": 24,
               "character": "Lake Zombie",
               "gender": 0,
               "credit_id": "52fe46a29251416c7507e7f7",
               "name": "Bill Sollner",
               "profile_path": null,
               "id": 79316,
               "order": 18
            },
            {
               "cast_id": 25,
               "character": "Bus Ticket Customer",
               "gender": 0,
               "credit_id": "52fe46a29251416c7507e7fb",
               "name": "Reza Badiyi",
               "profile_path": "/1GNPaOZNtst6rm9tTwK07EpN4ta.jpg",
               "id": 79317,
               "order": 19
            },
            {
               "cast_id": 26,
               "character": "Man At Bridge",
               "gender": 0,
               "credit_id": "52fe46a29251416c7507e7ff",
               "name": "Ed Down",
               "profile_path": null,
               "id": 79318,
               "order": 20
            },
            {
               "cast_id": 27,
               "character": "'The Man'",
               "gender": 0,
               "credit_id": "52fe46a29251416c7507e803",
               "name": "Herk Harvey",
               "profile_path": "/oEhShEz4Eh53EoFLSgdkn8fYsjU.jpg",
               "id": 79294,
               "order": 21
            },
            {
               "cast_id": 28,
               "character": "Sheriff At Bridge",
               "gender": 0,
               "credit_id": "52fe46a29251416c7507e807",
               "name": "Wayne Shmille",
               "profile_path": null,
               "id": 79319,
               "order": 22
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe46a29251416c7507e793",
               "name": "Herk Harvey",
               "profile_path": "/oEhShEz4Eh53EoFLSgdkn8fYsjU.jpg",
               "id": 79294,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46a29251416c7507e79f",
               "name": "Herk Harvey",
               "profile_path": "/oEhShEz4Eh53EoFLSgdkn8fYsjU.jpg",
               "id": 79294,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46a29251416c7507e7a5",
               "name": "Gene Moore",
               "profile_path": null,
               "id": 79296,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe46a29251416c7507e7ab",
               "name": "Maurice Prather",
               "profile_path": null,
               "id": 79297,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "545dbde5c3a368535800563a",
               "name": "John Clifford",
               "profile_path": null,
               "id": 79295,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5558b665c3a3687774008fe3",
               "name": "George Corn",
               "profile_path": null,
               "id": 1468158,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 4.952723,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 16093,
      "vote_count": 124,
      "budget": 30000,
      "overview": "Mary Henry ends up the sole survivor of a fatal car accident through mysterious circumstances. Trying to put the incident behind her, she moves to Utah and takes a job as a church organist. But her fresh start is interrupted by visions of a fiendish man. As the visions begin to occur more frequently, Mary finds herself drawn to the deserted carnival on the outskirts of town. The strangely alluring carnival may hold the secret to her tragic past.",
      "similar": [
         15472,
         50456,
         297762,
         376290,
         293768,
         11412,
         9392,
         390582,
         70,
         315837,
         290595,
         459928,
         7442,
         9542,
         340584,
         3525,
         9491,
         360814,
         10017,
         10765
      ],
      "original_title": "Carnival of Souls",
      "runtime": 78,
      "poster_path": "/9ddPGH7kMe81xznwIKCt17VFUPi.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Harcourt Productions",
         "id": 3138,
         "origin_country": ""
      }],
      "release_date": "1962-09-26",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "She Escaped Death. Now It Wants Her Back!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Herk Harvey"],
      "runtime": 78,
      "synopsis": "While out for a drive, three girlfriends get into a car race with two boys. As the car chase takes them down backroads, they come to a bridge. Trying to get across it, the girls car ends up crashing through the side and the car sinks into the water. Some time afterward, a search party is brought out, but after several hours, there appears to be no sign of the car. However, things take a turn for the surprising, when one of the girls, Mary Henry (Candace Hilligoss), emerges from the water, cold and shaken. Some people ask her questions, but she does not give any answers at that time. Some time afterward, Mary gets a job as an organ player in Utah. Before she leaves, she stops by the organ factory in town, and places on their organ for them. The place she is going to has an organ made from the same factory as well. When the Factory owner requests that Mary come back some time to play for them again, she claims she will not be returning. Mary then takes off on her trip. As she nears Salt Lake City, Utah, her vision is drawn to a dark pavilion lying back a ways towards the horizon. As she glances out the passenger side window, she is shocked to see a man staring in at her! Mary turns away and looks back, but the figure is soon gone. However, Mary is shocked again when the same figure appears on the road in front of her, causing her to drive off the road. Collecting herself, Mary gets back on the road, and heads towards Salt Lake City. Mary rooms at a residence, presided over by a woman named Mrs Thomas (Frances Feist). There is another person rooming at the house, a rather slimy warehouse worker named John Linden (Sidney Berger). After putting her things in her new residence, Mary goes off to the church to meet the Minister (Art Ellison). She practices on the organ, but after some time, stops and sits by a window to contemplate. The Minister asks her if she would like to take a ride with him to an appointment. Mary also makes a request that since the appointment is outside of town, if they could drive by the pavilion she saw on the way in. The Minister agrees, and they drive up to the entrance. The Minister explains that the place is gated off to keep people out. Mary seems curious to go in, but the Minister says he won't, given that there are rules forbidding people to enter. Returning back to the apartment, Mary takes a bath, but is interrupted when John knocks on her door. He offers to buy her dinner, but she refuses. After John has left, Mary walks out and looks over the railing, only to see the man she saw before standing in the 1st floor foyer! As he walks towards the stairs, Mary returns to her room and bolts the door. Sometime afterwards, Mrs Thomas comes up with a sandwich and some coffee. When Mary inquires about the man she saw, Mrs Thomas claims she didn't see anyone on the way upstairs. Mary insists she saw someone, but the landlady claims that Mary's mind must be playing tricks on her. Mary soon after attempts to go to sleep, but her mind finds itself drifting away to the pavilion. Waking up, Mary finds a knock on the door, and John enters offering homemade coffee. As they talk, Mary then explains to John her job as being an organist for a church in town. John thinks that Mary must be a very religious girl, but she explains that she doesn't care either way, and that she plays just so she can get paid. Mary thanks him for the gesture, and then goes out to shop for clothing. Going into a Department Store, she tries on a dress, and then changes back into her own clothes. However, upon exiting the dressing room, Mary is surprised when it seems that the sound of the world has stopped around her, and nobody can hear or see her! Wandering out of the store and into a nearby park, she breathes a sigh of relief when she hears some birds chirping, and the sounds of the world seem to start up again. Going over to a drinking fountain, Mary stops to drink, but upon seeing a black suit in front of her, Mary looks up and panics! Rushing over to a nearby man, she insists that the man by the drinking fountain is the one she's been seeing...but it soon appears she was in error, even though Mary insists it was him. The man she rushed to is a Doctor. Intending to calm her down, he takes her to his office nearby, and listens to everything Mary has to say. The Doctor assumes that the appearance of this apparition to Mary may have something to do with the trauma she experienced after surviving the car crash. When pressing Mary to see if the figure resembles anyone she knows, Mary insists she's never seen the man before. Feeling that the man may have some connection to the abandoned pavilion outside of town, Mary decides to go there, cutting off the Doctor in mid-analysis. Mary soon arrives at the abandoned pavilion, and begins to walk around. Strange things happen here and there, but she soon calms as she walks around. Returning back to the house, she meets up with Joe who again offers to take her out to dinner. Mary claims she already ate, but when Joe offers to pick her up after her organ practice at the church, Mary agrees, claiming she doesn't want to be alone. Mary then goes to the church, but as she plays the organ, something strange comes over her, and she finds herself playing a strange, and eerie melody on the organ. As she plays, a vision comes to her of a group of people inside the pavilion's enormous ballroom area, dancing. Each of them resembles the man with pale skin, and dark areas around their eyes. Suddenly, the Minister's hands press down on Mary's, ending the song. The Minister is shocked at the music that Mary has chosen to play, and orders her to resign from her post. At these words, Mary quietly gathers her things and leaves. Outside, she runs into John, who eagerly takes her to a club. John keeps trying to be sociable to Mary, but she just seems distant and unable to respond, even though she claims she likes being with him. Going back to the house, John attempts to get intimate with Mary, but she does not seem to welcome any of his advances. As she goes over to her dresser with a mirror on it, John walks up behind her, but to Mary, the reflection is that of the eerie man she's seen before! Mary then yells for John to stay away from her, and John leaves, as Mary pleads that she doesn't want to be alone. The next day, the doctor whom Mary had met previously shows up. Inquiring to Mrs Thomas, she explains that Mary was moving furniture in her room around all night, and would not let her in in the morning. The Doctor claims he gave Mary advice, but Mrs Thomas claims to the Doctor that she doesn't want Mary lodging with her any longer. The Doctor then assures the landlady that Mary intends to leave soon. Sometime afterwards, Mary packs her suitcases, and quietly leaves the house, not saying a word to Mrs Thomas when she speaks to her. Mary's car gives her transmission trouble, and she ends up going to a local service station. When the station attendant asks her if she wishes to get out of the car, Mary refuses. She stays in the car as it is lifted into the air on the service station's platform. As a customer pulls in for gas, the attendance leaves Mary alone in the garage. As she waits, she hears the sound of a door open, and heavy footsteps. A hand then turns the release valve for the lift, and the car slowly lowers to the ground. Mary has the doors locked, but as she hears something that makes her back towards the passenger door, it suddenly flies open! Mary runs for her life down the street. As she does so, suddenly she finds that like in the Department Store, she has become invisible to people, as well as the sound of the world cuts off. Rushing into a bus station, she finds tries to buy a ticket, but the attendant will not listen. Suddenly, a loud speaker blares of a bus leaving from gate 9. Mary rushes from the gate and quickly rushes onto the bus...only to be met with the wide-eyes stares of the apparitions she saw dancing in the pavilion's dance hall! They smile and chase her off the bus as Mary runs for her life, calling out and pleading for someone to hear or see her! Mary returns to the park from the day before, and just like the day before, she hears birds chirping and the sounds of the world start back up again. Mary then rushes to the Doctor's office, requesting that he help her,feeling that she is really going crazy. The Doctor's chair has been turned away from her, but as it turns around, she finds the man from before sitting in it! Mary lets out a scream- -and wakes from her daydream, still in her car in the garage (though the lift is now down instead of up). Mary quickly throws the car into reverse, and heads out of town, back to the pavilion. Going into the abandoned ball room, she soon finds the same apparitions she has seen in her dream (as well as on the bus). Slowly, they start to dance. Mary watches, and as the music begins to turn eerie and the beat of the organ fills her ears, she cries out and runs off, with the apparitions in pursuit. They chase her all over the pavilion grounds. Mary tries to escape but falls and lies screaming as the dead-eyed figures close around her. Sometime afterward, a search party looking for Mary finds her car at the Pavilion's gates. Searching the grounds, they find her foot prints rushing off into a sandy area, and an imprint on the ground where her body was, but no sign of her. Back in Kansas, the search party has finally recovered the car that fell into the lake. After pulling it out of the water, we see that not only are the other two girls still in the car, but so is Mary's body as well!",
      "writers": ["John Clifford"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0055830/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjI1OTI1NDY0MV5BMl5BanBnXkFtZTgwMjU2NzcyMjE@._V1._CR9.883331298828125,8.533340454101562,378,482_SY317_CR17,0,214,317_AL_.jpg",
      "actors": ["Stars: Candace Hilligoss, Frances Feist, Sidney Berger | See full cast and crew »"],
      "reviews": [
         "This is something like a full-length episode of the Twilight Zone, popular at the time of the movie's release. It's cheaply made, the photography is grainy, the story basically simple, and the acting nothing to write home about -- but this is one effective film if you're into dread. Candace Hilligoss is a pretty blonde with a sharp nose and a vulnerable quality about her. (She might remind the viewer of that Twilight Zone episode that starred Inger Stevens continually running into a guy in black, \"The Hitch Hiker,\" maybe?) Candace Hilligoss is not a major actress but it's difficult to imagine a better fit between the individual and the role. She's pretty enough so that men might find it pleasant to stand next to her in the supermarket checkout line, but not too pretty. Her face is defined by its bone structure so that you can almost see the skull beneat the skin. Her slanted, over-sized blue eyes suggest some sort of startled prey animal. And her movements, her body language, are both clumsy and extremely feminine. She wobbles when she runs and minces when she walks. And she's the right age too -- thirtyish -- not a fledgling with a great big Future ahead of her. The successive loss of her friends, her home town, her job in Utah, her room in the boarding house, and eventually her car, is enough to leave anyone in a state of desperation -- especially someone whose sole marketable skill seems to be playing the organ. The narrative has been gone over so I'll skip any description of it. What distinguishes this movie from others of its type is that, with the exception of the opening scenes of the accident at the bridge, there is no one at all who acts in a perfectly normal manner. (Unlike Inger Stevens, Hilligos has no ordinary sailor to pick up and talk to.) The pervading sense of disquiet is enhanced by the efficient use of locations -- a church, a vast ballroom, a decrepit and deserted amusement park at the end of a pier. And I think the performers contribute as well, their very amateurish awkwardness promoting in the viewer a feeling that \"something\" is not quite right about what we're witnessing. Even the scenes of quotidian life -- finding a job, fending off a neighbor's advances, trying to be polite to a polite landlady -- seem to be imbued with a kind of hard-to-define cockeyed quality, as in a De Chirico painting. Hilligoss is living in a universe in which nothing, and nobody, has an identity whose validity can be taken for granted. Not even her psychiatrist can be trusted to be what he seems. There are no big shock moments. Nobody gets slaughtered in a shower. Nothing is \"evil\" in any ordinary sense. Everything is simply \"wrong.\" And the only music in the score is played on a church organ, mostly eerie chords that shimmer in the background. It's quietly done by director Herk Harvey. Sidney Berger, who plays Hilligoss's odd neighbor, was in real life a speech instructor at the nearby University of Kansas. The leader of the dead is played by the director. This weird, subdued piece comes to us out of Lawrence, Kansas. It's pretty good for Lawrence, Kansas. But don't set your expectations too high. It's an old black-and-white horror movie, made by amateurs on a minescule budget. But within the limits set by those conditions, it's pretty good for anywhere, for that matter.",
         "After viewing this legendary flick for the first time, I have to say that the quality they achieved on a shoestring is still impressive today. Every penny spent on this little film makes its way before the viewer, which is something that can't be said of most major budget films then or now. Corman used \"getting the money up on the screen\" as his yardstick for his own success as low budget producer and director. But while I like the Corman cheapies, like Bucket of Blood and Little Shop of Horrors, and acknowledge that they possess a relatively high level of workman-like resourcefulness, it's hard to deny that Carnival makes many of Corman's films look slapped-out and unimaginative in comparison. Corman usually steered clear of anything poetic, dabbling with it most pointedly in the dream sequences in his first Poe adaptations. In contrast, this films makers are quoted to the effect that they were inspired by Bergman and Cocteau. Now, with such heroic ambition, Carnival could have turned out a laughable mess. But the films dark waking dream atmosphere is well realized. They had some really great locations\u0096 the pavilion, the wooden bridge, the organ factory and the church with the \"casting out demons\" stained glass. The actress playing the heroine is lucky (or skillful) casting, too; she doesn't look or act quite like the average person, which is perfect for the story. If I picked one thing to complain about, it would be the interlude with the guy from across the hall in the rooming house, about the writing of that section and especially about the actor who played him. But I won't. There's just too much good to be said about this small masterpiece of independent film making. Ten stars. See it.",
         "Not many people know of this film, surprisingly--this is one of the most intelligently constructed and atmospheric horror (for lack of a better term) movies of all time. Whenever I do run across someone else who has seen this film, there is an instantaneous, unspoken understanding in regards to the enduring creepiness of this film. My first viewing of COS occurred when I had inexplicably awoke in the middle of the night as a boy and switched on the TV. I had missed the opening minutes, but was powerfully drawn into the story. I sat transfixed until the shock ending, and think I just stared until after the sign off and following screen static. The next day I was not entirely sure I had actually watched this film or dreamed it--nobody else had ever heard of it and I never did catch the title (for some reason, its never shown much). Needless to say I was creeped out for days! Films that can affect one's sensibilities like this are golden! Find it and watch it in the middle of the night--alone.",
         "The unexpected popularity that sneaks up on movies like 'Carnival of Souls' is a double-edged sword. The positive aspects, of course, are renewed interest in undeservedly forgotten and neglected gems, as well as gloriously informative 2-disc DVD editions put out by Criterion. The negative result, however, is that the glowing aura created by the excitement and publicity of rediscovery often outshines the actual value of the given film, leaving one feeling underwhelmed. This happened for me with 'Carnival of Souls,' which is undeniably a film that has a creepy and eerie effect, but is also a film that is slight and does not stand up against the reputation that now precedes it. Movies like this work best when encountered casually on television late at night, where one might be blindsided by its hypnotic pull. When one goes to it after having read adjectives like \"creepy\" and \"eerie\" applied to it, the movie is confronted by expectations which are likely to be disappointed. And while the Criterion edition offers an insanely satisfying cache of supplements, having access to materials such as interviews with director Herk Harvey, detailed backstory, production stills, advertising materials, and television documentaries on the film and on the current condition of the locations used offers a sense of comfort and reassurance that destroys the movie's mystique. The paper-thin story follows a young church organist named Mary who survives a nasty car wreck and leaves town to take a job in Utah, where she lodges in a boarding house and fends off the aggressive advances of her across-the-hall neighbor. Strange things begin happening to Mary. She is haunted by visions of a ghastly-looking stranger, is entranced by a decaying nearby bathhouse/carnival grounds long abandoned, and experiences inexplicable episodes where sounds of the outside world are suddenly muted and others fail to notice or respond to her. The movie's most notable attribute is its skill in establishing atmosphere and a sense of dread. Yet, there's no payoff, and while that's okay, the movie is modest and, at 78 minutes (or 83, if you're watching the director's cut), rather short. If you come to this movie from a position of curiosity, there's a danger of being left with a \"that's it?\" sort of feeling. The element I found most intriguing was the pointed passivity of the Mary character. Indifferent to her job and to those around her, Mary is completely detached, and the movie very nearly becomes a character study of a schizoid personality. Surprisingly, the parts that were most engaging for me involved Mary's across-the-hall neighbor, a man named John Linden who is alcoholic, persistent, and very, very horny. Linden's scenes all entail his trying to get into Mary's pants, and he is almost jarringly sexually coercive -- a rapist in the making. Screenwriter John Clifford and actor Sidney Bergen invest this character with an unexpected degree of dimension. If the movie obviously foretells Romero's 'Night of the Living Dead,' it also hints at 'Repulsion.' There are a great many tasty lost artifacts from the prime of drive-in fare and B-movies, some of which get ostentatiously found and marketed as cult films, thus depriving one of the pleasure of personal discovery. The less you know about 'Carnival of Souls' before viewing it, the more likely you are to enjoy it.",
         "\"I don't belong in the world\u0085.something separates me from other people\" says Mary Henry (Candace Hilligoss) in perhaps the most lyrical horror film ever made. It is the unlikely 1962 masterpiece \"Carnival of Souls\" which philosophically fleshes out the premise of \"Twilight Zone's\" \"The Hitch Hiker\" episode (January 1960). The one where Inger Stevens (as Nan Adams) plays a young woman driving cross country who keeps passing the \"same\" man standing by the side of the road. Its masterpiece quality was unlikely because it was the low budget first feature film of Herk Harvey (a director of educational short films), using actors with little acting for the camera experience, and with a story structure adapted to fit sets and locations to which Harvey had free access. One of these locations was an organ factory. This not only dictated the film's unique and beautiful score but it suggested a profession for the main character (Mary Henry), a church organist. With this they really got lucky because it brings in many disturbing religious images and undertones. A church organist seemingly possessed by her instrument, as her playing alternates between the spiritual and the profane, deeply disturbs her wrapped-too-tight\" minister who would have benefited from Pollyanna's advice about the \"rejoicing texts\". The organ factory also serves nicely for a Carol Reed-type angular shot with the huge organ pipes in the foreground and the diminutive figure of Hilligoss far below. This early shot sets the existential tone for what will follow. Finally, there is the moment when she is alone on the highway and her radio will only pick up organ music. The other location is the abandoned Saltair Pavilion outside Salt Lake City. Much of the story takes place here as Mary Henry is mysteriously drawn to the place. Watch for this shot of her in front of a promotional poster for the Pavilion, on the poster is a look-alike blonde with the same hairstyle. Since the late 19th century, Saltair had been a family swimming/recreational facility built out into the Great Salt Lake. The huge pavilion looks like a strange cross between an Eastern Orthodox church and an Arabian Nights palace. The falling lake level doomed the swimming feature but the place operated as an amusement park until abandoned five years before the filming of \"Carnival of Souls\". At the time of filming the actual pealing paint, broken glass, collapsed staircases, and general disorder made for a better location than even the best production designer could have constructed. It also works well from a \"language of film\" symbolic perspective as Mary is shown walking through an unnatural circular passage, which reinforces other subtle off-kilter elements that occur throughout the film. While much of the film's texture was the happy result of the low budget necessity of using these available locations, the casting of Hilligoss worked out even better. Probably cast because she was the most beautiful actress available for the price, Harvey hit a home run because she brings exactly the right sterile and distanced qualities that the film needs in its main character. Hilligoss might have been an acting-for-the-camera novice but she had extensive stage experience. Harvey was able to get an extraordinary nonverbal performance from her, unexpectedly taking the film deep into the concept of human alienation. Much like \"The Incredible Shinking Man\", with its existential theme of separation from society, \"Carnival of Souls\" also transcends its genre and explores the isolation of someone who feels they no longer belong. And like \"TISM\", the resolution is the realization that loss of identity is freedom, that the infinite and the infinitesimal are the same, that you are not alone because you are a part of something bigger. The two occasions where Mary Henry suddenly becomes invisible to everyone are much more vivid because Hilligoss is so beautiful. Unlike a person of average appearance, an especially beautiful woman walking down the street is used to drawing stares from virtually everyone. For such a person the phenomenon of sudden invisibility would be far more jarring than for those who are used to not being noticed in the passing crowd. For budget reasons, egg white was used on the faces of the \"dead\" cast members, including Harvey himself who plays Mary's recurring apparition. This has an especially eerie effect with black and white film and would be adopted a few years later by George Romero for \"Night of the Living Dead\". Educational film veteran Frances Feist plays Mary's cherubic landlady and John Linden plays her slimy (on the make) neighbor. Both are excellent, and the disjointed and stilted acting style of their scenes with Hilligoss will remind many viewers of David Lynch's \"Eraserhead\". Then again, what do I know? I'm only a child.",
         "The film is so engaging that you manage to overlook the flaws while you're watching it. Sure some of the acting and editing are below par, but you don't realize that fact until after the film is done. During viewing you get caught up with the story, and Hillgoss' performance. Mary didn't have to be multi-dimension, but Hillgoss' performance makes her so. She is cold, alone, and isolated from the world. She has no friends, and doesn't feel the need for any. Despite the coldness of her character, you feel sympathetic for her and even begin to hope she gets out okay. Due to her lack of companionship, she eventually turns to the chauvinistic man who lives across from her. This is another interesting character, one who obviously lusts for Mary but doesn't know how to express his feelings, and it seems if it wasn't for the censorship at the time, he could've become more fleshed out. As another reviewer noted, he is obviously on the verge of rape and is emotionally abusive. The story is simple, yet it grabs you by the throat and refuses to give up until the film is over. A woman bizarrely comes out of water three hours after an accident occurred. How did this happen? As she tries to get away as far as possible from the incident, strange events continuously occur and she finds herself drawn mysteriously to an abandoned carnival. Also, a strange specter appears constantly. Is this a human stalking Mary? Or is it something supernatural or of the psyche? No one else can see him. Things continue to get worse and worse, and many times Mary is unable to communicate or hear the people around her, yet strangely it goes back to normal within moments. The film's ending is slightly predictable, but suiting. Something more flashy would've destroyed the feel. As many have noted, this isn't a technically flawless film. But you get so sucked in by the film it isn't until the ending that you realize some of the flaws. For one the editing isn't the greatest, but you must remember that the crew had an obscenely low budget to work with. It wasn't for lack of talent, it was for lack of resources. Also some of the supporting actors aren't very good, but again the film is so low-budget that it would've been impossible to pay better performers. Did you really expect to see Oscar winners in a b-film anyways? There are several aspects that easily trump the mild flaws. For one, the camera work is incredible, on par with many Hollywood films. The angles of the organ were particularly affecting, and the upward shots of the ghouls gave you the feeling of helplessness that Mary feels. Also, Hillgoss' performance is, as I stated above, very good. She manages to make a cold and isolated character human and sympathetic instead of the cardboard stereotype that haunts most films of the nature. The actor who plays the neighbor isn't the best, but his character is certainly interesting, a perverted peeping tom that if the film had been made ten years later would've surely been more developed. Also, the crudeness of the acting adds to the feel. Due in fact that Hillgoss provides the only good acting in the film, you get the feeling that something isn't right. The lack of development for almost every other character adds to the dreamlike quality. When was the last time you had a nightmare in which the other people involved where fleshed out. The most impressive aspect is Harvey's direction. He knew how to make something out of absolutely nothing, and it certainly shows. The angles and pacing are some of the film's benefactors. And the dream sequences and sped-up carnival footage are nothing short of breathtaking, showing his masterful Harvey was. It's a shame he never made another film, but than again if you make only one film, why not have it be a masterpiece? \"Carnival of Souls\" transcends its limitations. It contains no special effects for the most part, and very minimalist makeup. It shows that imagination is what makes a film work, not flashy dynamics and special effects. Due to this, many fans of newer horror films will not appreciate its genius. For fans of cult films and surrealist films will be impressed. The latter camp will be amazed how the film is very avant-garde despite no budget to work with. The film is one of the ultimate cult films. Ignored when it came out, only decades later was it appreciated on its rerelase in 1989. The same thing happened with \"Reefer Madness\", \"Glen or Glenda\", and \"Spider Baby\". That is, in my opinion, is one of the factors that makes a film a cult film, definitely more so than if the film is just a sleeper hit. Even if it didn't have the cult following, this is still a film that must be seen. It never outright scares you, but it gets under your skin. It leaves a lasting impression, and I guarantee you'll not forget it for the rest of your life. (10/10)",
         "I love this film! It's one of my all time favourite movies and I'd rate it as a deservedly acclaimed cult classic and the eeriest, most strangely compelling, most unforgettable and greatest horror movie of all time. The camera work is beautiful. The organ music, creepy carnival and director Herk Harvey as the figure of Death are all unforgettably eerie. The first time I saw this film (I had already read about it's making in an issue of Fangoria) was on BBC2's Moviedrome introduced by Alex Cox (himself the director of Repo Man, the lacklustre and innacurate Sid & Nancy and the amazing Well Did You Evah music video. On watching the film I was captivated and fascinated and ultimately at the film's conclusion had a strange feeling of deja vu, as if I'd seen it before in a dream or something, long ago. There are a number of surreal and creepy scenes in the film. The scene where Mary (Candace Hilligoss) goes to the abandoned carnival during the day has a surreal, dreamlike and sensual beauty. Whereas the later scenes of Mary playing the church organ and seeing in her mind, the dead rising from the sea and the film's carnival/beach conclusion are at once dreamlike and yet somehow documentarylike at the same time. It's unforgettable imagery like this that makes this film such an unforgettable experience. On the other hand, the drunk lodger's attempts to seduce Mary are amusing and some of her biting dialogue and sarcasm helps keep the non horror moments entertaining. The film is also notable for having a clear influence on films and filmmakers like George A Romero's classic \"Night Of The Living Dead\" (another 60s b/w horror classic) and David Lynch (compare Herk Harvey's ghoul with Killer Bob's surreal and frightening appearances at unexpected times in Twin Peaks). Be warned however, once you experience the dreamlike qualities of this eerie masterpiece, I can't guarantee you'll ever awake from it.",
         "The sound was horrible in this film. The acting seemed like it was done by high school students. The score was unneeded. The direction was horrible. Nothing was explained. I loved this film. I know, many of you are probably wondering why I loved a film that denounces everything I feel is needed in a film, but for some odd reason in this film it worked. This was a very scary movie. Not the kind of scary that you need blood or violence to make you jump, but the kind that the violins seemed to shrill your way to behind a pillow. I was really impressed that this film was released in 1962. I would put money down that if this film were to be released today it would do really well. As I watched this film, I made the comment that this could very well have been a Mystery Science Theater 3000 film. There were certain elements to it that I could see Joel or the bots just making fun of. So, in that sense, I am glad that I didn't see the film with those guys commenting through it, I may not have enjoyed it as much. This was a film full of symbolism, of imagination, and of surprises. I loved the way that Mary went from real life to when people couldn't hear or see her. It showed that something supernatural was at work instead of just some crazy guy following her around. The carnival was spooky. This is one of those films that you would put on at Halloween with a great bottle of wine and your best girl by your side. Without giving too much away, I enjoyed how this film came to it's conclusion. As the visions of the phantom man became greater and greater, it was obvious that the cops were getting closer and closer to finding the car. I also enjoyed the fact that the \"undead\" of the film all came out of water to be reborn. It was great foreshadowing to what would happen to Mary. The director took many risks with the symbolism that he used, and it worked better than some films with today's CGI abilities. You could tell as you watched this film that imagination was flowing with the writer of this film. It proved that even without a budget you could make a film that would last the test of time, and even be remade over and over again. The surprises were easy, but fun. I saw the ending of this film coming a mile away, but it still kept my attention. Overall, this film is like a great wine. Imagine opening a bottle of merlot from 1962 and having the whole afternoon to enjoy it. That is how I feel about this film. A definite for anyone to have in their collection!! Grade: ***** out of *****",
         "Herk Harvey toiled away for over a decade in educational and industrial films before taking a chance on filming a feature length movie in the Fall of 1961. He gathered backers from Lawrence, Kansas, used a graduate film student (Sandy Berger) to cast the lead (Candace Hilligoss), and filmed the movie during a three week vacation period. The center set piece was the abandoned Saltair amusement park in Utah, which has its own mysterious history. The story goes that Harvey was traveling home to Lawrence, Kansas on business and came upon the Saltair amusement park from afar, stopped, became fascinated by it, and then returned with the idea of making a horror movie featuring it. He approached his colleague John Clifford to write the script and Carnival Of Souls was born. Often cited as an influence on Directors George A. Romero and David Lynch, Carnival Of Souls is an eerie film about what happens when a young girl emerges from what looks to be certain death. Herk Harvey creates a spooky little chiller that draws us in right from the beginning. The black and white cinematography is Bergmanesque in construction with inventive camera angles and an ethereal feel. The scenes that come to mind are the ones in the organ factory and the amusement park pavilion. Gene Moore's music on the organ may be one of the most unique soundtracks ever created, especially for a horror film; it adds immeasurably to the moody atmosphere. The make-up effects are also very effective,considering the film is in black and white. The film relies on its Twilight Zone-like ability to make everyday people, places, and activities seem suspect. The acting by Candace Hilligoss is very good for such a low budget production, and reportedly she didn't know what her character's motivation was throughout the filming; Harvey's intent was to maintain a look of confusion on Hilligoss' face. This is very evident in retrospect, and is the main reason why the audience identifies with her so easily. For a film that had to be edited so quickly, with an entire reel of film being lost by the developer, there are very few technical errors. Although the film is somewhat predictable eventually, it still remains a fascinating, influential, original work of horror outside the Hollywood mainstream. Unfortunately, this was the only feature film Herk Harvey made due to the fact that he was never paid by the distributors, who went out of business. Today it has become a cult staple among horror film buffs; that's quite an achievement for an industrial filmmaker from Lawrence, Kansas. *** of 4 stars.",
         "The is finest film ever made in America, barr none. That it was directed by a professional documentarian on what appears to be a budget of a hundred bucks, with a cast of total unknowns, only makes it all the more remarkable. First, let's get the 'low-budget' issue out of the way, because during the later '80s this film developed a following among those who especially admire cheap films. Applying that to this film is a big mistake. This film isn't about money, it's about cinema - what you can and cannot do with a camera and an editing board, using whatever it is one has to work with. As with all pure cinema - from Citizen Kane to the Wild Bunch, from the Battleship Potemkin to the Seven Samurai - this film works on many levels at the same time. It is, first, an effective ghost story, in fact probably the only instance of a film that has a real ghost story to tell (most ghost-story films are really horror movies or romances). Then it is also an uncompromising psychological analysis of female frigidity. It is also surrealistic psycho-drama, but it is also a genuine slice of Americana - the film certainly has resonance with the films of Swedish director Ingmar Bergman, but it is determined to present its American characters in their American locations as American, and not as europhilic wannabes. Consequently it is also an historical document of what America was like in the early '60s - really a kind of weird place by today's standards. One of the qualities that makes a film 'pure cinema' is that the viewer should, on reflection, feel utterly convinced that there is not a camera shot out of place, not a wasted moment, not an image or sound we don't need to have the complete film before us. But of course while watching the film, we should be so captivated by it, we set our critical mind to rest. Despite the darkness of its themes and images, this film drags us along like some obsessive-compulsion we didn't even know we had. Finally, when watching a truly great film, when the final credit rolls, we should feel as if we have actually experienced the film, not simply watched it. This quality does diminish after repeated viewing - when you find yourself reciting the dialog by heart, you know that you've passed onto the level of remembering the film's experience, rather than living it. But certainly, after the initial viewing we should feel as though we have been changed by the film, and that we now look at the world through different eyes. This film is really about the fundamental puritanism that remains the core of the American world-view. It treats that world-view with both outrage, sympathy, and even, if one pays close attention, a touch of humor. The souls in this movie are lost souls - but its their carnival, after all; and we're welcomed to it any time we care to visit. However, be forewarned: once inside, we may have to stay."
      ],
      "genres": [
         "Horror",
         "Thriller"
      ],
      "productionCompanies": ["Harcourt Productions"],
      "summaries": [
         "Mary Henry is enjoying the day by riding around in a car with two friends. When challenged to a drag, the women accept, but are forced off of a bridge. It appears that all are drowned, until Mary, quite some time later, amazingly emerges from the river. After recovering, Mary accepts a job in a new town as a church organist, only to be dogged by a mysterious phantom figure that seems to reside in an old run-down pavilion. It is here that Mary must confront the personal demons of her spiritual insouciance.",
         "A street race results in one of the cars careening off a bridge and into the muddy river below. Of the three people in that car, only Mary Henry emerges alive from the river. Mary seems desensitized to life after that incident. She escapes that town and the memory of the accident by accepting a job in another town in Utah as a church organist, despite she not being religiously minded. She vows never to return. However, on her drive to Utah, she begins to see visions of a man - almost as an apparition - who she believes is out to get her. Other strange occurrences are that she at times seems possessed, and at other times seems to be physically invisible to the world. All these occurrences make her at times repulsed by her lecherous rooming house neighbor, John Linden, while other times feeling the need for his companionship. Despite the help of a therapist, Mary believes that specifically the visions of the man have something to do with an abandoned carnival site located at the outskirts of town, the carnival site to which she is nonetheless drawn.",
         "While driving her car with two girlfriends, the driver is challenge to a drag race and falls off a bridge over a river. When it seems that the girls have drowned and there are no survivors, Mary Henry surprisingly get's out of the water. A couple of days later, she drives to another town to work as organist in a church despite not being religious. While driving, she has visions of weird people. When she arrives, she moves into a room of the house owned by Mrs. Thomas. However Mary is haunted by spirits and is frequently drawn to a nearby abandoned carnival, where she discloses a dark secret.",
         "After a traumatic accident, a woman becomes drawn to a mysterious abandoned carnival."
      ],
      "budget": 30000
   },
   "movielensId": 3627,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1962-09-26",
      "dvdReleaseDate": "2000-09-26",
      "directors": ["Herk Harvey"],
      "runtime": 78,
      "movieId": 3627,
      "title": "Carnival of Souls",
      "mpaa": "",
      "actors": [
         "Candace Hilligoss",
         "Frances Feist",
         "Sidney Berger",
         "Art Ellison",
         "Stan Levitt",
         "Tom McGinnis",
         "Forbes Caldwell",
         "Dan Palmquist",
         "Bill de Jarnette",
         "Steve Boozer",
         "Pamela Ballard",
         "Larry Sneegas",
         "Cari Conboy",
         "Karen Pyles",
         "T.C. Adams",
         "Sharon Scoville",
         "Mary Ann Harris",
         "Peter Schnitzler",
         "Bill Sollner",
         "Reza Badiyi",
         "Ed Down",
         "Herk Harvey",
         "Wayne Shmille"
      ],
      "imdbMovieId": "0055830",
      "originalTitle": "Carnival of Souls",
      "genres": [
         "Horror",
         "Mystery"
      ],
      "youtubeTrailerIds": [
         "w81n8BUWixM",
         "VhoH5XPy-Ag",
         "q0w_4vaGqD8"
      ],
      "plotSummary": "Mary Henry ends up the sole survivor of a fatal car accident through mysterious circumstances. Trying to put the incident behind her, she moves to Utah and takes a job as a church organist. But her fresh start is interrupted by visions of a fiendish man. As the visions begin to occur more frequently, Mary finds herself drawn to the deserted carnival on the outskirts of town. The strangely alluring carnival may hold the secret to her tragic past.",
      "tmdbMovieId": 16093,
      "avgRating": 3.45856,
      "releaseYear": "1962",
      "numRatings": 724,
      "posterPath": "/9ddPGH7kMe81xznwIKCt17VFUPi.jpg"
   }
}