{
   "tmdb": {
      "original_language": "de",
      "keywords": [
         {
            "name": "nazi",
            "id": 2652
         },
         {
            "name": "propaganda",
            "id": 2903
         },
         {
            "name": "artists' life",
            "id": 2936
         },
         {
            "name": "nazi germany",
            "id": 11064
         },
         {
            "name": "filmmaker",
            "id": 11614
         }
      ],
      "imdb_id": "tt0107472",
      "video": false,
      "title": "The Wonderful, Horrible Life of Leni Riefenstahl",
      "recommendations": [
         125702,
         56515,
         47981
      ],
      "backdrop_path": "/dozVZ8eBWJLaVUcvpJkHhq92PKw.jpg",
      "revenue": 449707,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Herself",
               "gender": 1,
               "credit_id": "52fe45d7c3a36847f80dd827",
               "name": "Leni Riefenstahl",
               "profile_path": "/imaDmGuvU8mc3c61vg4jMV8UGTl.jpg",
               "id": 10139,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Herself",
               "gender": 1,
               "credit_id": "52fe45d7c3a36847f80dd82b",
               "name": "Marlene Dietrich",
               "profile_path": "/eZFuvNCV0kkI9MHFKxTKYegAfIK.jpg",
               "id": 2896,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe45d7c3a36847f80dd82f",
               "name": "Walter Frentz",
               "profile_path": null,
               "id": 10141,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe45d7c3a36847f80dd85d",
               "name": "Horst Kettner",
               "profile_path": null,
               "id": 1144713,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe45d7c3a36847f80dd861",
               "name": "Ray Müller",
               "profile_path": null,
               "id": 226963,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe45d7c3a36847f80dd865",
               "name": "Luis Trenker",
               "profile_path": "/qNgStsxP2bju7A5ygj5kXAgwmYl.jpg",
               "id": 1050751,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe45d7c3a36847f80dd869",
               "name": "Guzzi Lantschner",
               "profile_path": null,
               "id": 10142,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe45d7c3a36847f80dd81d",
               "name": "Ray Müller",
               "profile_path": null,
               "id": 226963,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45d7c3a36847f80dd823",
               "name": "Ray Müller",
               "profile_path": null,
               "id": 226963,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45d7c3a36847f80dd835",
               "name": "Hans-Jürgen Panitz",
               "profile_path": null,
               "id": 1144710,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45d7c3a36847f80dd83b",
               "name": "Jacques de Clercq",
               "profile_path": null,
               "id": 1029767,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45d7c3a36847f80dd841",
               "name": "Dimitri de Clercq",
               "profile_path": null,
               "id": 28669,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45d7c3a36847f80dd847",
               "name": "Beate Köster",
               "profile_path": null,
               "id": 1144711,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe45d7c3a36847f80dd84d",
               "name": "Vera Dubsikova",
               "profile_path": null,
               "id": 1144712,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe45d7c3a36847f80dd853",
               "name": "Ulrich Bassenge",
               "profile_path": null,
               "id": 38812,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45d7c3a36847f80dd859",
               "name": "Wolfgang Neumann",
               "profile_path": null,
               "id": 38813,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 1.127869,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "BE",
            "name": "Belgium"
         }
      ],
      "id": 41647,
      "vote_count": 6,
      "budget": 0,
      "overview": "This documentary recounts the life and work of one of most famous, and yet reviled, German film directors in history, Leni Riefenstahl. The film recounts the rise of her career from a dancer, to a movie actor to the most important film director in Nazi Germany who directed such famous propaganda films as Triumph of the Will and Olympiad. The film also explores her later activities after Nazi Germany's defeat in 1945 and her disgrace for being so associated with it which includes her amazingly active life over the age of 90.",
      "similar": [
         637,
         14574,
         424,
         613,
         914,
         1771,
         423,
         228150,
         289222,
         821,
         16869,
         5925,
         2253,
         289,
         582,
         203833,
         339259,
         9045,
         351339,
         15121
      ],
      "original_title": "Die Macht der Bilder: Leni Riefenstahl",
      "runtime": 180,
      "poster_path": "/lTiL9emewC7DLS9A9O5aZf7Ywum.jpg",
      "spoken_languages": [{
         "name": "Deutsch",
         "iso_639_1": "de"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Arte",
            "id": 201,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Channel Four Films",
            "id": 181,
            "origin_country": "GB"
         },
         {
            "logo_path": null,
            "name": "Nomad Films",
            "id": 12914,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Omega Film GmbH",
            "id": 12915,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Without Walls",
            "id": 12916,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Zweites Deutsches Fernsehen (ZDF)",
            "id": 4606,
            "origin_country": ""
         }
      ],
      "release_date": "1993-09-11",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Ray Müller"],
      "runtime": 180,
      "synopsis": null,
      "writers": ["Ray Müller"],
      "originalLanguage": "German",
      "imdbLink": "http://www.imdb.com/title/tt0107472/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNzQ0OTM1NjQ2M15BMl5BanBnXkFtZTYwMzkwNTE5._V1_SY317_CR10,0,214,317_AL_.jpg",
      "actors": ["Stars: Leni Riefenstahl, Marlene Dietrich, Walter Frentz | See full cast and crew »"],
      "reviews": [
         "Interesting. This is a good documentary about a great documentarian. I guess the normal form for commenting on this is to take a side on the art/politics controversy. Or perhaps to note film as propaganda tool today. I think I would rather simply remark that you just cannot watch movies as a lucid viewer without understanding something about who you are in the things. And that means wondering about who the filmmaker thinks you are. And that in turn means considering what it means when a camera is placed or moves in a certain way. If you do, you will find yourself wondering about the camera of Hitchcock and Welles. Surely that is at least as fundamental as you need to go. But you can go a half step further back and you will find yourself here, with this woman and her dancing eye. Yes, her personality at 90 is still German, which means she is a romantic idealist and an apologist for her generation. Annoying, but typical. And does it matter? Does it matter if, say, van Gogh was an anti-Semite? You decide. For me, I assume the artist is often the dumbest person involved in the process and the last person to ask. So the art is the thing. There are three great things she did, and these are apart from the idealization of the body, a constant theme. She advanced the art of filters to create abstract frames. In this, she was merely one in a line of talents. She was an innovator in creating a new philosophy of the camera. In this, she was a genius. But that wouldn't have mattered if she wasn't also a genius innovator in the art of editing. She understood that in addition to the story, the images themselves have a rhythm and song apart from the thing depicted. I think she really means it when she says her great propaganda film could have been of any choreographed event. She was a master of exploiting the movement of the eye as well as the movement of the subject, even the rhythm of the greyscales and depths. You need to watch \"Triumph\" and \"Olympia\" ignoring the subject, perhaps upside down as I did to see the music. Having said that, the effect of these two films undeniably altered life. The Nazi film was the single greatest influence in convincing the rural German public to support Hitler. That's huge. But perhaps a larger impact was on sports. Until that point, sports were something you did or read about. You might go to a contest purely for the association of the thing. What her art did, incidentally, was she made sports cinematic. And we may all be the worse for it. Ted's Evaluation -- 3 of 3: Worth watching.",
         "In this year that Bowling For Columbine -- an unapologetically political and controversial film -- has won the Oscar for best documentary, the story of Leni Riefenstahl and her work seems very timely indeed. This engaging montage of primary and contemporary interviews with her, together with samples of her oeuvre beginning in the era of silent film, accomplish precisely what a documentary is designed to do. Director Mueller spares no effort to uncover his subject's motivation, even as he focusses on the history and nature of her art. There is some irony at work here. We see a very German director attempting to dissect thoroughly the life and craft of another very German director. Not that there is any comparison to be made between the subject matter of one to the other, but when Riefenstahl takes Mueller to task for his filmmaking style in drawing her out, we cannot help but find delight in it. And his bit of eavesdropping on her between takes is priceless. Far from the perennial films about the Holocaust that portray Germans as something less than human, this documentary offers ample evidence that genius and human frailty are universal and far from mutually exclusive attributes in all sorts of people. But if one may deduce anything at all about the nature of the German soul in contrast to that of, say, a typical American, the life of Leni Riefenstahl as offered here stands out vividly by example of first one and then the other seemingly contradictory characteristic. She was after all the \"nice\" girl who stayed home and played patriot while Marlene Dietrich was the \"bad\" girl who betrayed her country. One can almost smell the cordite in the air during their related encounters. Much is made of the fact that Ms. Riefenstahl protests too much. Indeed that is a complaint one hears often about Germans who lived through the Hitler epoch seeing nothing, hearing nothing. But that surely begs the question, considering that it was and is a nation of eighty million descended from a vast cross section of central European races, including uncounted geniuses, saints, and criminals alike. If there is anything uniquely German about such a pose, it is only that they tend to be meticulously accurate in everything they do, whether for good or evil. The most annoying thing about Germans is their uncanny zeal in trying to find exact words that reflect logical and complicated reasons for everything -- including their own behavior. Under that circumstance, it is but a short step to denial once no easy answers appear. As a bilingual viewer of this documentary, I had the benefit of second-guessing the subtitles as well. Some were wildly wrong, and none could capture the tonal nuances, the careful phrasing, and the subtle interplay between Mueller and Riefenstahl as they parried one another's verbal thrusts. While far less original and profound than the master's work being discussed, Mueller did a very creditable job here.",
         "This documentary was apparently one of the first to examine Leni's life with her actually being interviewed at great depth. The film is broken up into two parts, her films as an actress and her relations with the Nazi party, and then her later films and the rest of her life. The film is fascinating, showing many lengthy clips from all her films. There is no questions that she was a very, very talented filmmaker, and very innovative for her time. Many of the camera angles and shots that she used were invented by her, and are still in wide use today. It is very clear that at the time the film was made, that Leni was still used to being in control. She is apparently difficult as an interview subject, and is seen in many shots refusing to do what the cameraman tells her. She is also very highly defensive of our association with the Nazi party. At one point, the interviewer asks her about her relationship with Goebels. She replies that she knew him only casually and then had a falling out, after which they never spoke again. However, when she is confronted with the diaries of Goebels, and according to them, they both saw each other at numerous social and political functions, Leni becomes mad and walks out. My own personal belief is that she has tried to whitewash her association with the Nazi party in her later years.",
         "\"The Wonderful, Horrible Life of Leni Riefenstahl\" is a documentary film about the german filmmaker Leni Riefenstahl. Known for 'Olympia' and the notorious but no less brilliant 'Triumph of the Will', this woman was persecuted for her work commissioned by the Nazi party and was never allowed to make another film. 'Olympia' is a stunning documentary of the 1936 Olympics and has nothing to do with Hitler or the Nazi party. While making the film, Riefenstahl was a pioneer of angles and camera and filmmaking techniques which forever changed both documentary and feature filmmaking. It should be studied by every film student and lover of photography, both still and moving. 'Triumph of the Will' is an astonishing documentary of the 1934 Party Congress. Of 'Triumph of the Will' she says, \"To me the film wasn't about politics. It was an event. I'd have made exactly the same film in Moscow, if the need arose, though I'd prefer not. Or in America, if something similar had taken place there. I shot the subject matter as well as I could and shaped it into a film.\" She then goes on to deny any participation in the political party and talks about turning down all offers to make any other political movies. She admits openly that she got swept up in the passion of the early movement, when all the talk was of work (when so many were unemployed), freedom and peace. She was not in the minority: Hitler had the support of 90% of the people at that point. She also says that she did not want to make 'Triumph of the Will', resisting Goebbels' advances and offers, accepting only when Hitler himself asked her to film the event. Hitler's wish was his command and he told her, \"I want this film to be made by an artist and not a Party film director.\" The filmmaker posits, \"I feel people are expecting an admission of guilt from you.\" She replies: \"Well, what do you mean by that? What am I guilty of? I can and do regret making the film of the 1934 Party Congress, 'Triumph of the Will.' I regret...no, I can't regret that I was alive in that period. But no words of anti-semitism ever passed my lips. Nor did I write any. I was never anti-semitic and I never joined the Nazi party. So what am I guilty of? Tell me that. I didn't drop any atom bombs. I didn't denounce anyone. So where does my guilt lie?\" In the end, we see that Riefenstahl was a brilliant filmmaker of the highest order and an extraordinary woman. Her alleged association with the Nazi party completely destroyed her career for the rest of her life and robbed the world of 50 years of potentially brilliant, innovative filmmaking. Whether your interest lies in photography, filmmaking or political or European history, this documentary is not to be missed.",
         "This film explores the boundaries between the artistic and the political (or, when does fiction have to pay for the reality it may help to create?). Why is Leni Riefenstahl, who created propaganda for the murderous Hitler (\"Olympia\" -- which pioneered many of the techniques now cliche in sports camerawork and editing, and the notorious \"Triumph of the Will\"), despised and reviled while the work of Eisenstein and others who created propaganda for the murderous Stalin is lovingly taught in film schools? Well, maybe it was because Stalin was on the winning side of the war, according to Ms. Riefenstahl, a tough old broad who was apparently ecstatic about being interviewed. Up to a point. This is a top-notch documentary. The cinematography is gorgeous. The probing questions are important. Riefenstahl is alternately combative, charming, evasive . . . and a whole lot of other things. I give it a 9 of 10.",
         "She was first and foremost a visual artist. What comes across here is her being duped, along with so many Germans, by the aim of the Nazi party. Her two most famous documentaries were made under the delusion that the prevailing party had a worth mission. This documentary helps to explain this perspective from Riefenstahl's eyes. Her true awakening came toward the end of the war, when she saw Hitler not visiting bombed out cities to witness the devastation. The final blow was her visiting the concentration camps and seeing the horror there. This documentary shows many shots of Leni sharing things from her perspective, and denouncing the Nazi regime. It goes on to show her film work during the war, followed first by her African trip to Nubian tribes, then to her fascinating under water film work. In all cases, her interest comes across as artistic and apolitical. This is a most informative documentary on one of cinema's most controversial figures.",
         "This is an excellent biography of one of the most influential filmmakers in history. It not only gives a comprehensive overview of her body of work but reveals many of innovative techniques she pioneered. Her accomplishments are all the more impressive when one considers the role of women in her heyday. However, the most interesting aspect of this film for me is how this intelligent woman (still lucid in her 90's) deals with queries about her political involvement during the National Socialist period in Germany.",
         "This is a a pretty good biography of Leni Riefenstahl; done in her dotage- about ten years before she died when she was relatively still quite active. Though the film does not really emphasize this, Leni was VERY active for a 90 year old woman and ultimately lived to be 101! Now, having mentioned that it should also be noted that about 80% of this movie covers the work she did before she reached the age of 43. Imagine a biographical movie of Bob Hope (her closest contemporary) that profiles his work from age 24 to 42 (end of WWII) and then passes over most of what he did afterwords until he was 90! One would certainly miss a lot of good biography! In the case of Riefenstahl the years from her early 40s to her early 60s are not of much interest, biography wise, as she was inactive due to one fact: Her side had lost the war. If the Allied side had lost the war then I think Leni Riefenstahl would have been quite active and well known throughout most of the world during that time. Since the side she was on did lose the war Leni was very hesitant to say that she really supported the National Socialist movement in Germany. When confronted with some written facts concerning her involvement (such as entries in Goebbels diary) she either denies it, or when she cannot deny something (such as her congratulatory telegraph to Hitler when German forces marched into Paris in 1940) she offers a different \"interpretation\" of why she sent the telegram. Obviously she was lying then, but I do believe she was truthful to some degree about her ambivalence towards the National Socialist movement. Suffice to say that there are some pointed questions directed at her (in her dotage) during this documentary, and she does try to answer most of them. For the movie maker enthusiast there are some real good segments on how she (and her workers) did the filming of Nazi marches and Olympic sporting events as well as in some of her theatrical released films. The biography makers seem to give her at least grudging admiration for her work and accomplishments. I am of the same opinion myself. Perhaps the final judgment of her (if not of her work) lies with the \"De Nazification\" Panel that reviewed her during the post war era. They came to the conclusion (which I, for one, support) that though she was not a Nazi; she was definitely a Nazi sympathizer. And, it would be hard to refute that finding. All things considered that was not necessarily that terrible of a finding (at least for most people living in Germany then), but the horrified look on her face (in a photograph taken when the finding was announced) showed that she realized, at that very moment, that her career as a movie maker was finished. Had she been working for the equally repulsive dictator Joseph Stalin a finding that she was a Communist sympathizer would not have hurt her as much as the Russians were on the winning side. But, the side she did work for lost the war, and she lost her career as a result of that.",
         "For American tastes, this documentary is much too long for the subject matter. Yet, it is worth watching for several reasons. Considerable insight into the early appeal of Hitler to the German people shows through Frau Riefenstahl's comments. More than that, though, is the detailed presentation of a master documentary filmmaker and her secrets. As evidenced through her later work in Africa and under the sea, she is an amazing woman. Her comments and her work are presented in such a way that both can be appreciated.",
         "****CONTAINS SPOILERS**** Finally somebody has ventured out to examine Leni Riefenstahl's career, films, life and images without pointing a finger at her and calling her a facist or a Nazi. I'd read about Riefenstahl before and knew her work but never once did I realize the scope of her work, the odds she has faced. Never did I really understand her, or at least feel like I did. I certainly feel that I understand her more now. At age 90 (or so), we follow Leni, still a charismatic and vivacious woman, to the barren, snow-covered mountains she climbed in those lyrical Bergfilms that she began her film career with. It's incredible to see her walk though the very same UFA sound stage where she first met von Sternberg and Marlene Dietrich, or to watch her as she stands on the exact spot in a subway where she saw an advertisement that changed the course of her life. It's also amazing to see the footage that was shot for the documentary of the Nuba tribespeople, footage that was never made into a movie. And where did they find all that behind-the-scenes footage from The White Hell of Pitz-Palu and Olympia?!? Just seeing that is worth viewing this movie. Throughout the documentary, Riefenstahl keeps telling us that Triumph of the Will was just a job, and from what she says, I believe her. I'm sorry, but I just do. There's no question she made probably the best propaganda film ever (Bowling for Columbine not with standing; of course they're two VERY differant movies). It's just that she wanted to do do something new on film, something that had never been done before. I'm not trying to justify anything the Nazis did. That's just the way I see it. My favorite scenes in this movie are the ones in which Riefenstahl is caught behind the scenes, arguing with her long-suffering director, proving that she's still very much an individual, still very much a director herself. When she says something to the effect of \"The camera must always be on me!\" you can tell that being recognized as an artist and an important person is clearly getting to her head. Frankly, I don't blame her. If I'd done as much as she had to push the bounderies of cinema and then be scorned because of one film, I'd want all the sudden attention I could get."
      ],
      "genres": [
         "Documentary",
         "Biography",
         "History"
      ],
      "productionCompanies": [
         "Arte",
         "Channel Four Films",
         "Nomad Films"
      ],
      "summaries": [
         "This documentary recounts the life and work of one of most famous, and yet reviled, German film directors in history, Leni Riefenstahl. The film recounts the rise of her career from a dancer, to a movie actor to the most important film director in Nazi Germany who directed such famous propaganda films as Triumph of the Will and Olympiad. The film also explores her later activities after Nazi Germany's defeat in 1945 and her disgrace for being so associated with it which includes her amazingly active life over the age of 90.",
         "A documentary about the life and work of Leni Riefenstahl, a German film director most notorious for making the most effective propaganda films for the Nazis."
      ],
      "budget": 0
   },
   "movielensId": 363,
   "movielens": {
      "languages": ["Deutsch"],
      "releaseDate": "1993-09-11",
      "dvdReleaseDate": "2003-09-02",
      "directors": ["Ray Müller"],
      "runtime": 180,
      "movieId": 363,
      "title": "The Wonderful, Horrible Life of Leni Riefenstahl",
      "mpaa": "NR",
      "actors": [
         "Leni Riefenstahl",
         "Marlene Dietrich",
         "Walter Frentz",
         "Horst Kettner",
         "Ray Müller",
         "Luis Trenker",
         "Guzzi Lantschner"
      ],
      "imdbMovieId": "0107472",
      "originalTitle": "Die Macht der Bilder: Leni Riefenstahl",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["91607Aqn-mo"],
      "plotSummary": "This documentary recounts the life and work of one of most famous, and yet reviled, German film directors in history, Leni Riefenstahl. The film recounts the rise of her career from a dancer, to a movie actor to the most important film director in Nazi Germany who directed such famous propaganda films as Triumph of the Will and Olympiad. The film also explores her later activities after Nazi Germany's defeat in 1945 and her disgrace for being so associated with it which includes her amazingly active life over the age of 90.",
      "tmdbMovieId": 41647,
      "avgRating": 3.99015,
      "releaseYear": "1993",
      "numRatings": 660,
      "posterPath": "/lTiL9emewC7DLS9A9O5aZf7Ywum.jpg"
   }
}