{
   "tmdb": {
      "original_language": "it",
      "keywords": [
         {
            "name": "holiday",
            "id": 65
         },
         {
            "name": "tourist",
            "id": 5159
         },
         {
            "name": "vacation",
            "id": 6876
         }
      ],
      "imdb_id": "tt0068863",
      "video": false,
      "title": "Lisa and the Devil",
      "recommendations": [
         28050,
         28061,
         27636,
         28051,
         5481,
         39988,
         87734,
         5485,
         27328,
         61904,
         65899,
         104317,
         30559,
         68146,
         27359,
         56531,
         39342,
         28049,
         142329,
         38706
      ],
      "backdrop_path": "/ltqxFwiHqxpNU5l2B4MPedVdF7O.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 11,
               "character": "Leandro",
               "gender": 2,
               "credit_id": "52fe4408c3a36847f807e435",
               "name": "Telly Savalas",
               "profile_path": "/pN5jiLdHKzDXn8GZHPnJHwdax1H.jpg",
               "id": 10169,
               "order": 0
            },
            {
               "cast_id": 12,
               "character": "Lisa Reiner",
               "gender": 1,
               "credit_id": "52fe4408c3a36847f807e439",
               "name": "Elke Sommer",
               "profile_path": "/eVx7RyK6FCBb1HZEdyx5UacL0Df.jpg",
               "id": 17844,
               "order": 1
            },
            {
               "cast_id": 13,
               "character": "Sophia Lehar",
               "gender": 1,
               "credit_id": "52fe4408c3a36847f807e43d",
               "name": "Sylva Koscina",
               "profile_path": "/jwkKgsRYHIkHMSNcGAeuYA829i3.jpg",
               "id": 21606,
               "order": 2
            },
            {
               "cast_id": 14,
               "character": "Max",
               "gender": 0,
               "credit_id": "52fe4408c3a36847f807e441",
               "name": "Alessio Orano",
               "profile_path": null,
               "id": 44972,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "George",
               "gender": 2,
               "credit_id": "52fe4408c3a36847f807e445",
               "name": "Gabriele Tinti",
               "profile_path": "/gxk5AeoGvkYV1pIXe2Jrk39W4xV.jpg",
               "id": 31991,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Contessa",
               "gender": 1,
               "credit_id": "52fe4408c3a36847f807e449",
               "name": "Alida Valli",
               "profile_path": "/p2aBH2hXwNPjQGRNuMUfycku0Za.jpg",
               "id": 15385,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Carlo",
               "gender": 2,
               "credit_id": "52fe4408c3a36847f807e44d",
               "name": "Espartaco Santoni",
               "profile_path": "/3eBciU8vicbbdr64UbFUsRJSt65.jpg",
               "id": 33827,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Shopkeeper",
               "gender": 2,
               "credit_id": "52fe4408c3a36847f807e451",
               "name": "Franz von Treuberg",
               "profile_path": null,
               "id": 106679,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Francis Lehar",
               "gender": 0,
               "credit_id": "52fe4408c3a36847f807e455",
               "name": "Eduardo Fajardo",
               "profile_path": "/tREl0gqM9L2X334p2EDx6ETpBtM.jpg",
               "id": 100409,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Lisa's friend",
               "gender": 0,
               "credit_id": "52fe4408c3a36847f807e459",
               "name": "Kathy Leone",
               "profile_path": null,
               "id": 1116336,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4408c3a36847f807e3fb",
               "name": "Mario Bava",
               "profile_path": "/7IAC3ab2HeveW537a3bymiDrVce.jpg",
               "id": 25826,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4408c3a36847f807e407",
               "name": "Mario Bava",
               "profile_path": "/7IAC3ab2HeveW537a3bymiDrVce.jpg",
               "id": 25826,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4408c3a36847f807e40d",
               "name": "Alfredo Leone",
               "profile_path": null,
               "id": 44965,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4408c3a36847f807e413",
               "name": "Alberto Cittini",
               "profile_path": null,
               "id": 44970,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 0,
               "credit_id": "52fe4408c3a36847f807e419",
               "name": "Joaquín Rodrigo",
               "profile_path": null,
               "id": 44971,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe4408c3a36847f807e41f",
               "name": "Carlo Savina",
               "profile_path": null,
               "id": 29389,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe4408c3a36847f807e425",
               "name": "Cecilio Paniagua",
               "profile_path": null,
               "id": 40896,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4408c3a36847f807e42b",
               "name": "Alfredo Leone",
               "profile_path": null,
               "id": 44965,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4408c3a36847f807e431",
               "name": "Carlo Reali",
               "profile_path": "/fc5LTUaduPG1U24UB7jqQgg12j6.jpg",
               "id": 44967,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "56c9ddb292514102ad002c6f",
               "name": "Nedo Azzini",
               "profile_path": null,
               "id": 1313634,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "56c9ddc292514130a9000c24",
               "name": "Rafael Ferri",
               "profile_path": null,
               "id": 1298627,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "56c9dde392514123f8000c60",
               "name": "Emilio Varriano",
               "profile_path": null,
               "id": 31542,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "56c9ddfa92514130a9000c2d",
               "name": "Franco Tocci",
               "profile_path": null,
               "id": 1313635,
               "department": "Crew",
               "job": "Special Effects"
            },
            {
               "gender": 0,
               "credit_id": "56c9de0f92514123b8000d10",
               "name": "Franco Freda",
               "profile_path": null,
               "id": 1461764,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            }
         ]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 2.56279,
      "production_countries": [
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "ES",
            "name": "Spain"
         },
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 5483,
      "vote_count": 26,
      "budget": 1000000,
      "overview": "Lisa is a tourist in an ancient city. When she gets lost, she finds an old mansion in which to shelter. Soon she is sucked into a vortex of deception, debauchery and evil presided over by housekeeper Leandre.",
      "similar": [
         11395,
         9479,
         9021,
         1585,
         8871,
         10147,
         13673,
         17979,
         287903,
         1581,
         634,
         296100,
         5255,
         10719,
         364,
         10510,
         10437,
         9279,
         48395,
         13188
      ],
      "original_title": "Lisa e il diavolo",
      "runtime": 92,
      "poster_path": "/1oF64AdklM307bG9nWl93C8MfoY.jpg",
      "spoken_languages": [{
         "name": "Italiano",
         "iso_639_1": "it"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Leone International",
            "id": 1913,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Euro America Produzioni Cinematografiche",
            "id": 1919,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Roxy Film",
            "id": 101,
            "origin_country": ""
         }
      ],
      "release_date": "1973-05-08",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "Every corner of the soul is lost to the icy clutch of the supernatural!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Mario Bava"],
      "runtime": 95,
      "synopsis": "[note: this synopsis is only for Mario Bava's true and original Lisa and the Devil (1973), not the re-shot, re-edited version 'The House of Exorcism' (1975)] Lisa Reiner (Elke Sommer) is a young American woman vacationing in Spain with some friends of hers. During a stop in a small town square with her tour group, Lisa grows to admire a fresco of the devil carrying a dead man's body which her tour guide describes as the devil carrying away lost souls back to Hell. As her group disperses, Lisa hears a beautiful piece of music. She leaves her companions and traces its source to an elaborate music box in a little antique shop just outside the main square. While inside the shop, she encounters a strange man (Telly Savalas) purchasing parts of a life-size mannequin. After making eye contact, Lisa is startled when the man bears an uncanny resemblance to the devil depicted in the painting. The man's peculiar behavior distresses Lisa, so she flees from the shop to rejoin her friends. However, she becomes hopelessly lost in the maze of back streets of the town. Though she has only walked a short distance beforehand, the back streets and alleyways seem totally alien to her. The locals refuse to give her directions, as side streets lead to dead ends. Lisa runs into the mysterious man a second time, though this time he is carrying a full-length, life-sized mannequin eerily similar to the painting depicted in the main square, as well as carrying the music box still playing the haunting tune. Introducing himself as Leandro, he gives Lisa some vague directions back to the main square, then walks around a corner and disappears. But the direction that Leandro points to the main square leads only to more unfamiliar streets. Next, Lisa encounters a strange man who looks a lot like the mannequin that Leandro was carrying. These bizarre coincidences begin to terrify Lisa, and the stranger acts as though she is his long-lost lover. Frantic, Lisa pushes him away and the man falls down a flight of stone steps, apparently dead. Lisa runs off in a panic. Night falls on the village, and Lisa remains lost. However, her luck seems to be improving when she hitches a ride in a old vintage 1940s limousine which contains Francis Leher (Eduardo Fajardo) and his wife Sophie (Silvia Koscina) whom are driving through the village with their chauffeur George (Gabriele Tinit). But their limousine soon breaks down just outside a old villa on the town's outskirts. The four travelers push their car into the villa grounds and knock on the front door asking for assistance. The villa turns out to be occupied by an elderly blind countess (Alida Valli), and her neurotic son Maximilian (Alessio Orano). When Maximilian spots Lisa, he becomes convinced that she is the reincarnation of a woman that loved and lost. Maximilian implores his mother to allow the four stranded tourists to stay for the night while he helps the chauffeur repair the car's engine. Though the villa is well-appointed, it has a strange atmosphere. Lisa is subsequently shocked to discover that Leandro is the family butler, who also recognizes her from their brief meetings earlier, and seems a little too friendly to Lisa. As Leandro settles Lisa, Francis and Sophie, and George into their living quarters for the night, Lisa jumps with fright when she sees the same man from the village who tried to attack her, staring at her through the window. Lisa tries to get away from the house, but her departure is thwarted by Maximilian, who begs her to stay. As she feels some attraction to the young man, as well as pity for him, Lisa relents. The four travellers are settled down to dinner, while the food is served by Leandro. Lisa further notices the weird atmosphere of the place, when Maximilian continues to remind Lisa that she has a resemblance towards his lost lover, Elena. But Francis and Sophie's relationship becomes more strained as dinner progresses. Francis' cold, dispassionate nature forces Sophie to walk away from him, and she falls into the arms of George, whom they have quick passionate sex. A short while later, George is found dead, with a pair of scissors plunged into his throat. Sophie immediately assumes that her husband did it, and she flees outside into the car where she starts it up, When Francis comes out to stop her from leaving, she runs over him over and over again. But upon returning into the house, Sophie is killed by Maximilian in a hurtful, gory way. It was Maximilian who murdered the chauffer to prevent Lisa from leaving. With the meddling strangers out of the way, Maximilian turns his attention to Lisa where it's revealed that the man who pursued Lisa in the village is actually Maximilian's stepfather Carlos (Espartaco Santoni). Like Maximilian, he had previously fallen in love with Elena, the woman displayed in a few old photographs who bears an amazing resemblance to Lisa. Carlos had abandoned the countess and ran off with Elena, who was also Maximilian's lover. Before she had a chance to join him, Maximilian had murdered Elena and stored her body in a concealed room so he could continue to have her, even in death. Apparently when Carlos returned to the village, he assumed after seeing Lisa that she was Elena. Now that Maximilian had murdered Carlos, he puts him display in an open coffin in the parlor so that nobody can take Lisa away from him. At this point, Lisa still has no idea that Maximilian is completely deranged, and on top of that, she's still being casually nice to him. When Maximilian decides to share his secret with Lisa about his lost love Elena, he takes her to the concealed room, and shows her Elena's skeletal remains, Lisa finally then backs away in horror and rejects Maximilian. But rather than kill her, he chloroforms Lisa and puts her in the bed next to Elena's remains. Maximilian strips Lisa naked and tries to have sex with the unconscious woman. But in his twisted state of mind, he feels that the skeletal remains of Elena is mocking him and he cannot perform. Apparently deciding that in order to consummate the relationship, he will have to marry her. Maximilian meets his mother in the parlor who's paying respects to her dead husband where he tells her of his intentions. The Countess, jealous of the hold Elena, in the form of Lisa, continues to hold over the men in her life, demands that Maximilian kill Lisa and dispose of her and the rest of the bodies before the police show up looking for her and the other murder victims. But Maximilian's devotion to Lisa is complete, and rather then get rid of her, he stabs his mother dead as she stands by the coffin that contains Carlos' body. All of these events are observed by Leandro, whose presence seem to haunt the villa, and who seems to be orchestrating the bizarre occurrences as some kind of sick game. Unsettled by this act of matricide, Maximilian rushes about the house looking for Leandro who, for once, is nowhere to be found. Instead, Maximilian finds the bodies of all his victims, including the skeletal Elena, seated at the dinner table looking at him. He turns around and sees his undead mother shambling towards him. In shock, Maximilian recoils backwards, only to fall out a second floor window, and onto the spikes of a gate. Emerging from behind the body of the dead Countess, Leandro remarks, \"oh, it slipped\". The next morning, Lisa wakes up, naked and in unfamiliar surroundings. Though it seems to be the exact same concealed room, it is now infested with vegetation and she is alone with no bodies anywhere. Putting her clothes back on, Lisa walks through the house and finds that its entirely deserted. In fact, it looks that nobody has lived in the house for a long time. Confused, but somewhat relieved that the entire night's experience was apparently nothing but a bad dream, Lisa leaves the house and runs into a group of schoolgirls playing ball in the street. The balls rolls in her direction and she catches it. One of the the girls points to Lisa and proclaims her a ghost because nobody has lived in the villa for a hundred years. The girls run away screaming. Lisa walks around a little and within minutes finds herself back in the town square from the beginning of the movie. She is observed by Leandro a short distance away who is being given a mannequin likeness of her. Lisa takes a taxi to the airport and enters a plane. After the plane takes off, Lisa notices the she is the only passenger. She searches section after section, only to discover the dead bodies of Maximilian, the Countess and all the others in the first class compartment. Frantically, Lisa makes her way to the cockpit where she opens the door and discovers that Leandro is the pilot, who lets out a devilish laugh. Lisa transforms into a ghastly pale mannequin and slumps to the floor.",
      "writers": [
         "Mario Bava",
         "Alfredo Leone"
      ],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0068863/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg2MjQ5MzAzOF5BMl5BanBnXkFtZTYwMTUzOTc4._V1_SY317_CR10,0,214,317_AL_.jpg",
      "actors": ["Stars: Telly Savalas, Elke Sommer, Sylva Koscina | See full cast and crew »"],
      "reviews": [
         "Well I finally managed to get to see 'Lisa And The Devil' as Bava originally intended it, rather than the very dodgy 'House Of Exorcism' version I had previously seen, and the original is ten times better! Stripped of the tacked-on possession scenes and Robert Alda's priest role, the movie reveals itself to be a superior, atmospheric and stylish \"nightmare on celluloid\" movie. It reminded me a little bit of Jean Brismee's 'The Devil's Nightmare' in places, and at other times the work of Jean Rollin, without the overt eroticism. It's surreal touches and foreboding feel with probably appeal to fans of David Lynch or Herk Harvey's 'Carnival Of Souls' more than hardcore horror nuts. The cast are all good, but Telly Savalas gives a standout performance just on the right side of over the top, and Elke Sommer appears much more believable as the confused protagonist of this movie, rather than the unconvincing Linda Blair wanna-be of 'House Of Exorcism'. All in all one of Mario Bava's most original and interesting movies. Recommended.",
         "As oft repeated here: the version titled \"Lisa and the Devil\" is the more serious of the two versions of this film. \"Lisa\" captures perfectly that nightmarish atmosphere that Italian filmmakers such as Bava and Argento seem to have such a knack for creating. This is one of the first films I ever saw that relied on visual narrative instead of a solid script to make its point, and even at an early age this really held my interest. Of course, the argument could also be made that this film suffers from slow pacing and a telegraphed conclusion, but I still think the movie is gorgeous, and Elke Sommer is a delight. But don't let that stop you from checking out \"House of Exorcism\", either! This takes the film to the other end of the spectrum, exploiting the loose narrative by forcing a possession plot that finds Elke's character now confined to a hospital bed doing her best Linda Blair impression. Everyone involved with the making of these scenes had to have known they were trashy, including Elke herself, so it's a riot to see how game she was to go over the top. She just cuts loose & goes for it, mugging for the camera, vomiting toads, and dripping lots of green bile (natch). Compared to \"Lisa and the Devil\", \"House of Exorcism\" is an absolute abomination, but the producer was a demented genius in forcing the issue of the possession subplot, since the film in its original form was far too \"art house\" to make any money on the drive-in circuit. If you get ahold of the special edition DVD with both cuts of the film on it, be sure to listen in to the commentary track, which features some great chat from Alfred Leone (the film's producer) and Elke Sommer herself. The opportunity to view both versions of the film gives the viewer a unique opportunity to experience two radically different visions of one film: first as a sumptuously filmed dreamlike masterpiece, then as a masterpiece defiled, hacked to pieces for an exploitation thrill.",
         "Lisa (Elke Sommer) who is a tourist gets lost from her group in an ancient Spanish city, but she come across a couple Mr Frank Lehar, his wife Sofia and chauffeur and gets a lift off them. Though, its short-lived as the car breaks down near an old villa. So they are invited to spend the night in the old, dark villa. The mansion's occupants are acting all strange and the dreary atmosphere takes hold. One by one, they meet their doom and Leandro (Telly Savalas) the villa's butler seems to have something to do with it. Could he be the devil himself who's toying with these guests or is it all a nightmare? Well, this was the first film I've seen of director/writer Mario Bava and I got to say I was truly amazed by it. Bava's \"Lisa and the devil\" is a slickly well-crafted surreal thriller that messes with our minds with its simply fetching details and a disquietingly grim atmosphere. It's one very picturesque film that holds superb composition and such flair in the lighting, backdrop, score and atmosphere. From the elegant scenery of the ancient city to the old fancy villa that holds such a morbid awe and to what builds on that is a strikingly eerie, but delicate score. While the brood atmosphere is sheer alienating and the fluid camera-work truly does capture that disorientating mood. The villa is covered with colourful artwork and luxurious furniture, which fills every room. The film is gracefully shot with plenty of zooms and also catching reflections and silhouettes. The location photography was excellent. These sublime images and score really built on the absorbing texture and peculiar state of the film. Plus under all that are an elegantly erotic undertone and a film that flows with pure originality. Premise is incredibly absurd and there's hardly no characterisation. Maybe there was too much going on in the flawed story, as it was downright confusing at times to know what was actually happening because the story would lead to a dead end. Overall it just felt like a blur. Though, yet again maybe it was meant to be like that? You are definitely lost and put off-balance just like Lisa is to what's reality and what's not. It's a baffling mystery that you could say comes across as rich poetry and art and you also pick up on little subtle hints throughout the story. The dialogue is rather sparse, but interesting if a little cheesy at times. You could probably say not much is going on with Lisa just wandering around the villa and there's a fairly slow pace to it all to begin with, but this is an atmospheric and physiological builder. Some scenes did drag on for too long and sometimes it gets a bit too sappy, but these things didn't take away from the film. The horror isn't that horrific, but it plays more on the images, sounds and atmosphere. Definitely the second half of the film is when it starts to get exciting and even more unnerving. This is when Bava tightens the screws with some well-designed shocks and jolts. By achieving some haunting images and a heart-stopping finale, literally. As each one the characters give into jealousy, hatred, lust and finally into their own demise. The characters turn out to be nothing more than pawns in this story and you question who's pulling whose strings. Most of the acting does come across as rather one-note or melodramatic. Telly Savalas steals the film as a lollipop sucking butler, who seems to have some hidden agenda and playing with these people's souls. His performance is sinisterly impressive in a manipulative nature and his dialogue is always a play on words. The gorgeous Elke Sommer shines in her role. Her dialogue might be pretty limited but her presence is enough to fit the bill. Incredibly lavish film-making that is particularly dreamlike and a marvel to look at. When it ends you'll be left scratching your head.",
         "(Small spoilers included) According to the title, I'm reviewing the House of Exorcism here but I better start by saying that the below discussed version is `Lisa and the Devil' in all the glory like Mario Bava intended it! The House of Exorcism adds a whole bunch of needless elements and it doesn't even credit Bava as a director! Talking about blasphemy! Lisa and the Devil however, is a pure Bava masterpiece and one of the most beautiful horror movies ever made. Like only he can show it, this film breathes a horrific atmosphere of mystery and morbidity. It's about the young American girl \u0096 Lisa \u0096 who's lost in the Spanish city of Toledo. She spends the night in a ghoulish and ancient house with the blind landlady, her vicious son and the spooky housekeeper (a terrific portrayal by Telly Savalas) Lisa is seen as the reincarnation of the lost love-interest of the son and he becomes possessive over her. Unfortunately, the lost lover of son Maximillian wasn't very faithful and Lisa might take the punishment for that now\u0085 Once again, Bava gives a nightmarish portrayal of a sinister setting, filled with bizarre figures and religious themes. Unlike some of his other films, Lisa and the Devil has an intelligent and compelling script that thrills you right from the first second and until the very last. You just stare at this film with wide-open eyes and huge fascination. Beautiful scenery, stunning cinematography and magnificent make-up effects\u0085all trademarks that make horror so great are present in Lisa and the Devil. If you're looking for breath-taking horror, Mario Bava is the way!",
         "During the sightseeing in Toledo, Spain, the tourist Lisa Reiner (Elke Sommer) sees an ancient painting of the devil on the wall and leaves her group for a moment; however she gets lost in the narrow streets. Later she gets a lift with the wealthy Francis Lehar (Eduardo Fajardo) and his wife Sophia (Sylva Koscina). However, their car breaks and stops in front of an old manor. While the driver George (Gabriele Tinti) tries to fix the car, the trio is hosted by the blind owner (Alida Valli) and her son Maximilian (Alessio Orano) that invites Lisa to spend the night in the mansion. During the dinner, they are served by the butler Leandro (Telly Savalas) that resembles the image of the devil of the painting. Lisa seems to be living a strange nightmare, recalling her love from a past life, and trapped in the house with that bizarre family. The stylish and surrealistic \"Lisa and the Devil\" is a weird and spooky ghost story developed in a nightmarish atmosphere. The movie is visually very impressive and despite of the flaws and inconsistencies in the ambiguous screenplay, it startles many times. Elke Sommer is extremely sexy and Telly Savalas is very frightening. The conclusion is a little disappointing. My vote is seven. Fortunately I saw \"Lisa and the Devil\" first; the opportunist commercial version released in USA with the title \"The House of the Exorcism\" on the trail of the success of \"The Exorcist\" is terrible and destroys the creepy atmosphere of the original movie. The good thing is the greater eroticism and exposure of the naked body of Elke Sommer. My vote is four. Title (Brazil): Not Available",
         "Lisa (Elke Sommer) is a young woman as tourist in a Spanish old city named Toledo . She then is lost and taken by a marriage (Sylva Koscina and Eduardo Fajardo) and their chauffeur (Gabriele Tinti) . They find shelter into a luxurious mansion where inhabits strange characters , a countess (Alida Valli) , his son (Alessio Orano) and the butler (Telly Savalas). The picture belongs to Italian horror genre , Mario Bava along Riccardo Freda (Secret of Dr Hitchcock , Vampires , The spectre) and subsequently Dario Argento (Deep red , Suspira , Inferno) are the fundamental creators of Latin terror genre . Mario Bava directed excellent horror movies (Mask of demon , Black Sunday , Black lace , Planet of vampires) and mediocre (Baron of blood , Bay of Blood , Shock) horror films . These movies are characterized by slick edition , usual zooms , special overblown use of colour in a glimmer red blood and utilization of shock-images . The film gets an attractive and enjoyable casting , a gorgeous Elke Sommer (The prize) , an enticing Sylva Koscina (Miguel Strogoff) , a veteran Alida Valli (The Paradine trial) and a sympathetic devil with lollipop included played by Telly Savalas (Kojak) . Magnificent and colorful cinematography by Cecilio Paniagua with intervention by the same Bava like is habitual in all his movies , as he's usually cameraman . The musical background was composed by Joaquin Rodrigo with his famous 'Concert of Aranjuez' and the score by Carlo Savina . There is another version called ¨House of Exorcism¨ for the American market adding some images about a priest (Robert Alda) , rip off from ¨The exorcist¨ , making spells , enchantment , exorcisms which results to be embarrassment and ridiculous . The motion picture will appeal to Mario Bava's hardcore fans .",
         "Lisa and the Devil features many of Bava's trademarks; a devilish atmosphere, superbly chilling use of lighting and a general foreboding feel to the movie that gives the impression that something bad will happen. However, the movie is also fairly messy; there are too many ideas in the film and all together it comes out more than a little confusingly. The version I saw was the Redemption release of \"Lisa and the Devil\", which is not to be confused with badly intercepted release, \"The House of Exorcism\". The plot follows the story of Lisa, a young lady that gets lost in an ancient city in Spain. She then hitches a ride with a couple and their chauffeur, but they end up breaking down and happening on a house inhabited by a blind woman, her strange son and a creepy housekeeper. What follows is a nightmarish and morbid ride that touches on themes such as love, lust and death. Mario Bava is a master of the horror genre, many of his films have inspired whole areas of cinema, most notably \"Bay of Blood\", to which slashers owe their existence and \"The Girl Who Knew Too much\", which is often credited as the first Giallo. But I feel that this is one of his lesser efforts. That's not to say that this is a bad film by any means, it features a lot of nice elements, particularly the spooky sequences with main characters and their dead ex-lovers, which almost touches on necrophilia, and therefore gives the film a very morbid and nasty feel. The actors in the movie are also fairly accomplished; it features Elke Sommer, who also starred in Bava's atmospheric shocker, \"Baron Blood\", among other films and Telly Savalas, who gives a great turn as the creepy butler of the house. But it seems to have too many ideas going on, and a lot of them aren't really explained, which left me feeling confused. Overall, Lisa and the Devil is a good horror movie with much to admire, most notably the superb creation of atmosphere from Mario Bava but I feel that if it had concentrated less on putting lots of ideas into it, and more on concentrating on the ones it already had; then it would have been a better film.",
         "Lovely tourist Lisa becomes lost in a European town and soon finds herself at an isolated estate where she's plagued by bizarre and frightening occurrences. The handsome master of the house seems to think Lisa is the reincarnation of his dead lover, a phantom stranger may or may not be a ghost, and the smug family butler is possibly the devil himself! Lisa and the Devil is perhaps the most unique of the great Mario Bava's horror films. It broods with the lavish and colorful direction that the great filmmaker was well known for and it has a terrifically weird atmosphere. The story is a compelling mosaic of mystery, murder, and otherworldly surrealism as it provides for one effectively nightmarish journey. The fluid camera-work is excellent, the Gothic scenery and sets are nicely captured, and the haunting music score is perfectly pitched to give this film a stylish and chilling atmosphere. The cast is also quite good. Gorgeous Elke Sommer gives a strong performance as bewildered Lisa. Dashing Alessio Orano is terrific as the master of the house. Veteran actress Alida Valli is great as the blind countess. However the biggest show-stealer is Telly Savalas as the charismatic and possibly fiendish butler. The supporting cast is also quite solid. Lisa and the Devil is simply a must-see for all fans of Bava and particularly for fans of surrealist horror. It's a truly original horror gem and one of Bava's greatest works. Footnote: Avoid a terribly re-edited and re-worked version of the film re-named House of Exorcism. This was a poorly constructed version of the film forced onto the market after distribution problems. Stick with the film that Bava intended to make instead! **** out of ****",
         "Lisa's life will never be the same when she gets lost in an unfamiliar European city. Eluding a strange man who confuses her with someone else, Lisa(Elke Sommer)bums a ride with Frank and Sophia Lehar(Eduardo Fajardo & Sylva Koscina), an unhappily married wealthy couple. Their vehicle, however, is on the fritz and George(Gabriele Tinti;the Lehar's chauffeur and Sophia's lover)must stop somewhere for repairs. They happen across a blind countess' manor and her son, Maximilian(Alessio Orano)invites them to stay. Lisa gets quite a shock when she realizes that the lolly-pop sucking butler of the manor(Telly Savales chewing scenery with his usual cool) is a spitting image of an artistic rendition of Satan on an old decrepit building wall in the European city she just escaped from. When the unexpected death of George occurs, the group is rocked in fear. Maximilian, like the previous strange gentleman she met in the last city, responds to Lisa as if he knows her. He wishes to passionately embrace Lisa, but she has no idea how to react to all the strange happenings upon her. In a dream sequence, Lisa reminisces a past life where she was embracing the first gentleman who now has a name:Carlo(Espartaco Santoni)..here's the kicker, Carlo is actually Max's mother's husband who had ran off with a woman named Helen who seemed to have been attached to Max. All this drama, with Sophia in deep mourning over her beloved George's death, and how Lisa reminds others of Helena spirals out of control as a sneering Leandro, the butler, looks on in cheeky delight, often mumbling about the situational developments as they occur.Bava, as Gothic as ever, has lots of stylish camera tricks up his sleeve(particularly how he frames reflections of faces using such items as a cigarette case with a mirror, wine spill reflecting Savalas's face, etc). And, his use of the fish-eye lens is astounding. And, that ending, which might dismay many, I felt was a knock-out. Like the fresco containing the devil carrying a dead man, no one can escape fate. Within the film there's a killer on the loose bashing heads in with a cane(with blood splattering like spilled paint on the camera lens)so Bava also lets his grisly side run rampant. Bava injects his film with the sordid history of two families..Max and his mother's and Sophia & Frank. These elements add spice to the proceedings as a victim is run over numerous times by a vehicle and tragic consequences await others at the hands of a very unbalanced Maximilian who will do whatever it takes to not lose Lisa like he *lost* Helena. I really got a kick out of Savales and his behavior towards the mannequins, and just the delight he carries when around potential victims. It seems Bava and Savales both knew how to relate their macabre joy to the viewer, and their collaborative efforts go noticed. They understand what lies within the framework of the story(..these characters and how they are doomed, destined for tragic ends)and have fun with the material, presenting to us in only the grandest way possible from start to finish. These two were made for each other. House of Exorcism is basically a travesty, an abomination where a co-producer(..this being Alfred Leone)takes a perfectly fine film well visualized by a true master of the macabre and creates instead a ludicrous, unnecessary rehash of The Exorcist, adding material with Robert Alda(..attempting desperately to bring sincerity and dignity to his role as a wounded priest, despite the hilariously profane gibberish coming from a possessed Elke Sommer's mouth), splicing in footage from \"Lisa and the Devil\" to pad everything out to cash in on another religious shocker's success. Also added that you won't see in Bava's finished product of \"Lisa and the Devil\", are scenes of Sommer and Koscina's nice breasts being fondled and kissed(..Sommer's by Orano during the notorious lovemaking scene where an unconscious Lisa has been drugged by Maximilian who subsequently disrobes her as his imprisoned former flame, Helena's skeletal corpse lies a few feet away;Koscina's by Tinti during their sordid sex scene while hubby Fajardo is away looking for a tub to bathe in). And one nasty aftermath of Koscina's demise displaying the spiked-end of a cane buried in her skull. But, a great deal of \"House of Exorcism\" displays the ugly side of a demon inside Lisa causing her to move and convulse her body wildly while saying vulgar comments toward the priest. There's even a scene where the demon takes the shape of the priest's naked wife, who we see dying in a burning car in a haunting flashback. But, all this is quite an embarrassment, especially if you have just finished the elegant, romantic, yet lurid and morbid \"Lisa and the Devil\". Sommer sure commits to the role of possessed innocent, really piling on the histrionics. Stick with a true artist's vision and watch \"House of Exorcism\" for laughs if you're really bored. I can't even imagine what it must feel like to have your film butchered in such a way.",
         "I love Italian films from the 60s and 70s. I picked up Lisa and the Devil on DVD and then realized that the House of Exorcism is a re-edited, totally different version of Lisa and the Devil. I feel like I need to see the House of Exorcism now. If you like Bava films, then you will surely enjoy Lisa and the Devil. This is a surreal piece of film making in that you are not quite sure what is reality and what is in the mind of the characters. There is no over the top gore, but Bava uses camera work and generates a creepy atmosphere. I may not reccomend this film to Mario Bava \"first timers\" or \"gore hounds\". While I love to watch a Fulci or Bruno Mattei zombie fest anyday, I still enjoy a classic Bava film the same way I enjoy classical music. They both hit a chord, but a different chord."
      ],
      "genres": [
         "Horror",
         "Mystery"
      ],
      "productionCompanies": [
         "Euro America Produzioni Cinematografiche",
         "Leone International",
         "Roxy Film"
      ],
      "summaries": [
         "Lisa is a tourist in an ancient city. When she gets lost, she finds an old mansion in which to shelter. Soon she is sucked into a vortex of deception, debauchery and evil presided over by housekeeper Leandre.",
         "Surreal goings-on at a Spanish villa in this poetic horror fairytale, which was crassly re-edited into The House of Exorcism (1975) for US release."
      ],
      "budget": 1000000
   },
   "movielensId": 3630,
   "movielens": {
      "languages": ["Italiano"],
      "releaseDate": "1973-05-08",
      "dvdReleaseDate": "2000-05-16",
      "directors": ["Mario Bava"],
      "runtime": 92,
      "movieId": 3630,
      "title": "Lisa and the Devil",
      "mpaa": "R",
      "actors": [
         "Telly Savalas",
         "Elke Sommer",
         "Sylva Koscina",
         "Alessio Orano",
         "Gabriele Tinti",
         "Alida Valli",
         "Espartaco Santoni",
         "Franz von Treuberg",
         "Eduardo Fajardo",
         "Kathy Leone"
      ],
      "imdbMovieId": "0068863",
      "originalTitle": "Lisa e il diavolo",
      "genres": [
         "Fantasy",
         "Horror",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [
         "FpS2ZUrkbFk",
         "f8UHebNYpn0"
      ],
      "plotSummary": "Lisa is a tourist in an ancient city. When she gets lost, she finds an old mansion in which to shelter. Soon she is sucked into a vortex of deception, debauchery and evil presided over by housekeeper",
      "tmdbMovieId": 5483,
      "avgRating": 2.65254,
      "releaseYear": "1973",
      "numRatings": 59,
      "posterPath": "/1oF64AdklM307bG9nWl93C8MfoY.jpg"
   }
}