{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "gay",
            "id": 237
         },
         {
            "name": "aids",
            "id": 740
         },
         {
            "name": "homophobia",
            "id": 1013
         },
         {
            "name": "coming out",
            "id": 1862
         },
         {
            "name": "lesbian relationship",
            "id": 9833
         },
         {
            "name": "homosexuality",
            "id": 10180
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "lesbian",
            "id": 10768
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0116661",
      "video": false,
      "title": "It's in the Water",
      "recommendations": [
         196967,
         10125
      ],
      "backdrop_path": "/qRgpjyqiTVYJVXOwLGdsxYjAfrA.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Alex Stratton",
               "gender": 0,
               "credit_id": "52fe440ac3a368484e00c071",
               "name": "Keri Jo Chapman",
               "profile_path": null,
               "id": 87045,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Grace Miller",
               "gender": 1,
               "credit_id": "52fe440ac3a368484e00c075",
               "name": "Teresa Garrett",
               "profile_path": null,
               "id": 87046,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Mark Anderson",
               "gender": 2,
               "credit_id": "52fe440ac3a368484e00c079",
               "name": "Derrick Sanders",
               "profile_path": null,
               "id": 87047,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Tomas",
               "gender": 2,
               "credit_id": "52fe440ac3a368484e00c07d",
               "name": "Timothy Vahle",
               "profile_path": null,
               "id": 61565,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Lily Talbott",
               "gender": 1,
               "credit_id": "52fe440ac3a368484e00c081",
               "name": "Barbara Lasater",
               "profile_path": null,
               "id": 87048,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Sloan",
               "gender": 0,
               "credit_id": "52fe440ac3a368484e00c085",
               "name": "Nancy Chartier",
               "profile_path": null,
               "id": 87049,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Spencer",
               "gender": 0,
               "credit_id": "52fe440ac3a368484e00c089",
               "name": "John Hallum",
               "profile_path": null,
               "id": 87050,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Mrs. Bracken",
               "gender": 0,
               "credit_id": "52fe440ac3a368484e00c08d",
               "name": "Beverly May",
               "profile_path": null,
               "id": 87051,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe440ac3a368484e00c06d",
               "name": "Kelli Herd",
               "profile_path": null,
               "id": 87043,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe440ac3a368484e00c093",
               "name": "Kelli Herd",
               "profile_path": null,
               "id": 87043,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 1.683709,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 21060,
      "vote_count": 8,
      "budget": 0,
      "overview": "When hordes of gays and lesbians come out \"of the closet\" in the fictional town of Azalea Springs, Texas, intolerant residents go into a panic about the water supply.",
      "similar": [
         513,
         370663,
         12793,
         449176,
         20770,
         258480,
         10938,
         11000,
         401898,
         10806,
         4369,
         18212,
         152584,
         2255,
         9090,
         9800,
         376867,
         540,
         142,
         43923
      ],
      "original_title": "It's in the Water",
      "runtime": 100,
      "poster_path": "/aGWhJDIz4wrlcc4dNBa753jr4DB.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Keli Herd Film Company, Inc",
         "id": 3897,
         "origin_country": ""
      }],
      "release_date": "1997-01-30",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Kelli Herd"],
      "runtime": 100,
      "synopsis": null,
      "writers": ["Kelli Herd"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116661/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkzNjM3ODA2Ml5BMl5BanBnXkFtZTcwMzgzNDgxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Keri Jo Chapman, Teresa Garrett, Derrick Sanders | See full cast and crew »"],
      "reviews": [
         "This isn't the best gay and lesbian comedy around, but it certainly isn't the stinker that some of the other IMDb user comments claim it to be. It's camp and extravagantly acted -- okay, maybe a bit overacted -- in the way, say, \"But I'm A Cheerleader\" is. But it more than makes up for that in its upbeat and affirming ending and particularly through its gentle treatment of the two main characters. It's very unusual that these two are a gay and a lesbian. Most LGBT movies stick to one group; \"It's In The Water\" shows a lesbian discovering what she is from out of a loveless marriage and a \"cured\" gay guy finding love with an unashamed gay decorator. If only more LGBT movies were as inclusive... Sure, this isn't one of those LGBT movies that could be claimed to be in the same league as mainstream Hollywood movies. But frankly, even so, I'm happy to give this one a \"7\". And hell, I'd watch this anytime rather than some of the \"gay\" tripe that the \"mainstream\" serve us up, such as \"In & Out\" or \"Three To Tango\". Don't expect a masterpiece, and don't expect the raving farce that the blurb promises. But do sit back and enjoy a good-hearted, sweet, story.",
         "If you grew up in the South, especially if you are gay, you will see people you know or knew in all of these characters - even the ones that seem a little extreme. I have even recommended it to my Mom -- and Alex can eat crackers in my bed any time! This movie made me feel good!",
         "I would have never seen (or heard of) this film without having met and studied under Kelli at SMU. Seeing her reaction as she told us that in 6 years she'd never shown in at school made me begin to understand how exposed we are putting not only our 'projects' but our entire life in front of people for the sake of art. \"It's in the Water\" is lots of fun. The character of Spencer is HILARIOUS, but not drawn up as a caricature like most of the straight people in the film. His lines are fabulous and delightfully droll, but human. One of the truest pleasures of the film. Otherwise, the previous reviewer was right--the love making scenes are tasteful and...pretty for lack of a better word. It helps, of course, that the two leading couples (Alex and Grace, and Mark and Tomas) are absolutely gorgeous, but the characters individually just light up from the inside out. Witty, excellent visual design and touching, this is certainly a film that I would recommend. As a huge fan of all things Texas, this is going up as one of my favorite films.",
         "I worked on \"It's in the Water\" back in '96, '97. It was one of the funnest projects I've worked on. I can tell you that Kelli Herd is a brilliant, bold story-teller with a great sense of timing. The casting was great. Regarding the actors, I was impressed at the effortless risk taking that took place not only in the auditions, but more over, on the big screen. Barbara Lassiter (mom) is too much, I remember when they were shooting the scene where she is lecturing her daughter Alex about her gay kiss,noting \"Couldn't you have done something like this on the weekend?\" The scene when shot, was very moving, dramatic, powerful. Once edited, I was amazed that they turned that scene into its own mini-melodrama with a comic twist. The whole cast and crew was very friendly. One of the more outstanding moments in the making of the movie was when we were filming in the hospital. In the middle of a scene, one of the 1K lights set off the building alarm and sprinkler system, made for a short delay, but all was well. Kelli provided some of the best craft service food I've ever had much! All behjind the scenes stuff aside, The plot is outrageous. Who'd think It's in the Water? Can't say I don't relate though. For whatever reason, this is truly one of my favorite movies, very smart.",
         "The person who reviewed this film from L.A obviously has some issues. Does that surprise us of an L.A. person? How can you down a church choir. Get a life. I thought the film was very funny and has a lot of great scenes. Rent the film its good. I thought the \"water\" issue was not played out very well. This film has some very good characters,especially the scene with the mother finding out about her daughter being a lesbian,very Cruella DeVille,I laugh until it hurts when I saw this scene. The film was shot in Texas \"George Bush Country\" I can only imagine that some people here in Texas would think the water could cause people to become gay.You should really check out this film it has some great laughs.",
         "This movie pokes fun at society and how narrow minded people can really be, you can actually see some of these things happening, maybe not all in the same town, but happening still. The issues are portrayed in a great light, humor. If messages wanted to be sent, they would be understood in this movie. A definite must see.",
         "This enjoyable movie relies largely on caricature to achieve its comedic ends and it does so quite well. Lots of good lines here especially for the Spenser character. I thought the love scenes were handled tastefully if somewhat conventionally. I give it 7 out of 10.",
         "This is a very strange amalgamation of brutally embarrassing stereotypes mixed with insights and issues that I can't remember having seen addressed by a gay-related film before. The main lesbian relationship is handled in a satisfying and balanced manner and the secondary gay relationship has some nice elements as well. Worth seeing. But these are surrounded with such jaw-dropping stereotypes -- both gay and straight -- that I was left wondering how these could be co-existing in the same film, written and directed by the same person. The difference is so extreme you could get whip-lash. Performance quality is all over the map, characters are given prime placement in the story but nothing comes of them. The best thing the film has going for it is the central lesbian and gay characters; the worst thing is that they are given cartoon characters to interact with.",
         "The friend who rented this thought the story line was that something actually WAS in the water which turned everyone in town gay for a short period of time. That would have been an interesting idea for a film. Unfortunately, this benighted offering gets its title from a joke told by one of the characters about a third of the way through the film. Sadly, the film is as lame as the joke. The story follows the residents of Azalea Springs, a small, Southern town, as they deal with an AIDS hospice opening in their midst. Most who live in the town are unhappy about the idea, and more than a few are downright hostile. However, Alex Stratton (Keri Jo Chapman) thinks it's a good idea, and despite the objection of her overbearing mother (Barbara Lasater), and wimpy, uncaring husband (Matthew Tompkins), she goes to work there. Once employed she reunites with Grace Miller (Teresa Garrett), her best friend from high school. Meanwhile, Mark Anderson (Derrick Sanders), son of the owner of the local paper, wants to cover the story in a light sympathetic to the hospice, but his father (Tommy Townsend) is only interested in sensationalistic news. And Mark has a few secrets of his own, which he shares with those who attend Brother Daniel's (John Addington) weekly meetings to cure those with homosexual tendencies. And Spencer (John Hallum), the requisite wise old queen with great style and wit, is busy overseeing the death of his unacknowledged lover. However, when Alex and Grace's friendship turns to romance, and Mark finds happiness in the arms of Tomas, a Latin house painter, the whole town is turned upside down. Will these couples be happy together, or will the forces of prejudice keep them apart? It's hard to know where to begin with this film. Just about everything in it was poorly done. The writing was atrocious. Characters are merely stereotypes who are not developed at all. Their actions make little sense because they seem to have little motivation. And the dialogue was either painfully wooden, or ridiculously clichéd. Even the production values weren't very good, as the cinematography was rather uninspired. The acting was equally bad. Lasater is so over the top, that you stop listening to her tirades (and that seems to be all she has in the way of lines) pretty early on. Sanders and Townsend are both wooden, and show no sense of any kind of father-son relationship. Tompkins' jilted husband is merely ridiculous and annoying. Garrett attempts to breathe some life into her character, but doesn't succeed terribly well. The only one who does reasonably well is Chapman, and it's not enough to carry the film. Sad to say, I think there was a good premise here, but the execution was so poor that it just doesn't manage to generate a film that is either entertaining or thought provoking. In the end, it's just a curiosity piece, which fails to engage the viewer. You win some, you lose some...",
         "We were prepared for either hitting stop after 10 minutes or going the distance. We went the distance though at times we were not sure why. The acting and dialogue are uneven, brilliant at times and embarrassing at others. The two leads, Keli Jo Chapman as Alex and Teresa Garrettt as Grace were exceptions, they were always right on and believable, their dialogue also rarely hit a false note. Another total stand out and always worth watching when on screen was Sloan the ex cheerleader clueless society social climber whose facial expressions were priceless. Spencer, was also one of those you know someone just like that characters.(as were all of the gay men for that matter, with the exception of \"Brother Dan\" who was a little too over the top. It would have been better if he wasn't so despicable. What didn't work and got in the way of a perfectly wonderful movie, was the obvious good health of the dying Bruce.(Although his old queen was again a stereotype that must exist in every American town.) The anguish and eventual coming out of the newspaper owners son was flawed as was Alex's coming out by the fact that we wanted to see personal reaction and got political statement. Scenes that should have had emotional depth more often showed how mean spirited straight people are (true enough but I wish that my characters have feelings it is a personal problem of mine). Then there is the funeral-it just didn't play true and seemed like a bad scene from Ally McBeal the only other media event where white people go to churches and sway to Gospel choirs. Pluh-leese! Two of us watched like Siskel and Ebert one was an energetic thumbs down the other was a mild thumbs up- if you don't mind re runs of Ellen (and I fit in that category) you will find more to like than dislike)"
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": ["Kelli Herd Film Company Inc."],
      "summaries": [
         "In the small southern town of Azalea Springs, the country club set still rules. Here, being a member of \"The League\" is a must, big hair is still favored by the ladies who lunch, and only hair-dressers and interior designers are supposed to be gay. The addition of an AIDS facility in Azalea Springs has The League unsettled. And the announcement that their charity work will include contact with \"those people\" leaves them stunned. But the real frenzy begins with a drunken comment regarding the local drinking water. Rumor has it that the water is contaminated with something that actually \"turns\" people gay. Mix in Brother Daniel's \"Homo-No-Mo\" meetings, the local newspaper, and a group of rabid homophobic picketers, and you've got a recipe for panic. Heads reel. Women weep. Mothers, hide your children! In the midst of it all, we find Alex Stratton, a young woman dealing with a distant husband, an overbearing mother, and the tedium of meaningless society chatter and endless shoe critics. Going against her husband's and her mother's wishes, Alex accepts a job at the Hospice where she is reacquainted with Grace Miller, her best friend from high school who has returned to Azalea Springs after a nasty divorce. It is here that Alex falls out of 'grace' with society when the two are caught kissing in the Hospice supply room. Mark Anderson works at the local newspaper his father owns and regularly attends Brother Daniel's Turn-or-Burn meetings. As the rumor about the water and the protesters get plenty of front page coverage, Mark finds himself becoming involved with Tomas, a Latin house painter who mistakes the ex-gay meeting for an A.A. meeting. The events that unravel as a result of these two love affairs bear witness to what happens when hysteria and homophobia take control of their lives.",
         "Residents of the fictional town of Azalea Springs, Texas go into a panic after a gay local says the town's water supply is what made him gay."
      ],
      "budget": 0
   },
   "movielensId": 3631,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-01-30",
      "dvdReleaseDate": "2000-05-16",
      "directors": ["Kelli Herd"],
      "runtime": 100,
      "movieId": 3631,
      "title": "It's in the Water",
      "mpaa": "",
      "actors": [
         "Keri Jo Chapman",
         "Teresa Garrett",
         "Derrick Sanders",
         "Timothy Vahle",
         "Barbara Lasater",
         "Nancy Chartier",
         "John Hallum",
         "Beverly May"
      ],
      "imdbMovieId": "0116661",
      "originalTitle": "It's in the Water",
      "genres": [
         "Romance",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "When hordes of gays and lesbians come out \"of the closet\" in the fictional town of Azalea Springs, Texas, intolerant residents go into a panic about the water supply.",
      "tmdbMovieId": 21060,
      "avgRating": 3.05682,
      "releaseYear": "1997",
      "numRatings": 44,
      "posterPath": "/aGWhJDIz4wrlcc4dNBa753jr4DB.jpg"
   }
}