{
   "tmdb": {
      "original_language": "fr",
      "keywords": [],
      "imdb_id": "tt0118834",
      "video": false,
      "title": "Those Who Love Me Can Take the Train",
      "recommendations": [2382],
      "backdrop_path": "/1umTw6E1yyPukQuyUcMRNd6u9ql.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "François",
               "gender": 2,
               "credit_id": "52fe44769251416c9101191d",
               "name": "Pascal Greggory",
               "profile_path": "/1J3QISHIZg6C1xkhvshtX2lEiDG.jpg",
               "id": 16923,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Claire",
               "gender": 1,
               "credit_id": "52fe44769251416c91011921",
               "name": "Valeria Bruni-Tedeschi",
               "profile_path": "/ioMCjkUWngWjS0nXWYLqvBsm4mI.jpg",
               "id": 5077,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Jean-Marie",
               "gender": 2,
               "credit_id": "52fe44769251416c91011919",
               "name": "Charles Berling",
               "profile_path": "/5W9uDe33eFYFNOW5lqJVvlzHkzb.jpg",
               "id": 48576,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "Jean-Baptiste Emmerich",
               "gender": 2,
               "credit_id": "52fe44769251416c91011915",
               "name": "Jean-Louis Trintignant",
               "profile_path": "/rvwO5Rsm2ZohPCQjwEvY30PBp68.jpg",
               "id": 1352,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Louis",
               "gender": 2,
               "credit_id": "52fe44769251416c91011941",
               "name": "Bruno Todeschini",
               "profile_path": "/pQTC4RrrEbshv5B5nDsykPQw1tq.jpg",
               "id": 56285,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Bruno",
               "gender": 0,
               "credit_id": "52fe44769251416c91011945",
               "name": "Sylvain Jacques",
               "profile_path": null,
               "id": 550415,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Viviane",
               "gender": 2,
               "credit_id": "52fe44769251416c91011949",
               "name": "Vincent Pérez",
               "profile_path": "/elPFKCVOZyMni2hx7mLlaYkyifD.jpg",
               "id": 20239,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Thierry",
               "gender": 2,
               "credit_id": "52fe44769251416c9101194d",
               "name": "Roschdy Zem",
               "profile_path": "/d2589ZaPsk4mpxlUYxSaOvaZdo3.jpg",
               "id": 20442,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Catherine",
               "gender": 1,
               "credit_id": "52fe44769251416c91011951",
               "name": "Dominique Blanc",
               "profile_path": "/l52O3muXMMlUQMgY27o8vgUmTcq.jpg",
               "id": 19068,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Elodie",
               "gender": 0,
               "credit_id": "52fe44769251416c91011955",
               "name": "Delphine Schiltz",
               "profile_path": null,
               "id": 120627,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Sami",
               "gender": 0,
               "credit_id": "52fe44769251416c91011959",
               "name": "Nathan Kogen",
               "profile_path": null,
               "id": 550416,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Lucie",
               "gender": 0,
               "credit_id": "52fe44769251416c9101195d",
               "name": "Marie Daëms",
               "profile_path": null,
               "id": 550417,
               "order": 11
            },
            {
               "cast_id": 19,
               "character": "Geneviève",
               "gender": 1,
               "credit_id": "52fe44769251416c91011961",
               "name": "Chantal Neuwirth",
               "profile_path": "/vHPORFjUCqI74qpuJGaYMfzdkeZ.jpg",
               "id": 17901,
               "order": 12
            },
            {
               "cast_id": 20,
               "character": "Dominique",
               "gender": 0,
               "credit_id": "52fe44769251416c91011965",
               "name": "Thierry de Peretti",
               "profile_path": null,
               "id": 550418,
               "order": 13
            },
            {
               "cast_id": 21,
               "character": "Bernard",
               "gender": 2,
               "credit_id": "52fe44769251416c91011969",
               "name": "Olivier Gourmet",
               "profile_path": "/y1g5UGYEiRiBqdc35zrekZox0tu.jpg",
               "id": 45152,
               "order": 14
            },
            {
               "cast_id": 22,
               "character": "Marie-Rose",
               "gender": 1,
               "credit_id": "52fe44769251416c9101196d",
               "name": "Geneviève Brunet",
               "profile_path": "/3JER8Lahj03pjvIO4prsCBIcorq.jpg",
               "id": 13845,
               "order": 15
            },
            {
               "cast_id": 23,
               "character": "Cédric",
               "gender": 2,
               "credit_id": "52fe44769251416c91011971",
               "name": "Didier Brice",
               "profile_path": "/bK8obyfUnGQq33B6NbXiSm04iGC.jpg",
               "id": 51109,
               "order": 16
            },
            {
               "cast_id": 6,
               "character": "L'auto-stoppeur",
               "gender": 2,
               "credit_id": "52fe44769251416c91011925",
               "name": "Guillaume Canet",
               "profile_path": "/qnDVthzAPxJTKxkUWIRBhuuMI2x.jpg",
               "id": 19866,
               "order": 17
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44769251416c91011911",
               "name": "Patrice Chéreau",
               "profile_path": "/8Qbylwv2JLQVQsEYz9u1oUnVruf.jpg",
               "id": 23724,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe44769251416c9101193d",
               "name": "Danièle Thompson",
               "profile_path": "/iZ87eYEoy9rM2oRHCSLNAriX3o3.jpg",
               "id": 1963,
               "department": "Writing",
               "job": "Idea"
            },
            {
               "gender": 2,
               "credit_id": "534502e00e0a267bc30014ee",
               "name": "Patrice Chéreau",
               "profile_path": "/8Qbylwv2JLQVQsEYz9u1oUnVruf.jpg",
               "id": 23724,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "534502ef0e0a267bd400159c",
               "name": "Pierre Trividic",
               "profile_path": "/rNUEM4DAIXJ2KvobJrak4s4VAS9.jpg",
               "id": 32503,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "534502b20e0a267bd4001591",
               "name": "Danièle Thompson",
               "profile_path": "/iZ87eYEoy9rM2oRHCSLNAriX3o3.jpg",
               "id": 1963,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "534503180e0a267bc00014de",
               "name": "François Gédigier",
               "profile_path": null,
               "id": 6794,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "534503090e0a267bc00014dc",
               "name": "Eric Gautier",
               "profile_path": null,
               "id": 18494,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.31673,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 31353,
      "vote_count": 4,
      "budget": 0,
      "overview": "Friends of painter Jean-Baptiste Emmerich gather at a Paris railroad station for a four-hour journey to Limoges, where Emmerich wanted to be buried. The dozen travelers include art historian François and his lover Louis, who develops an interest in teenage Bruno. Traveling parallel with the train is a station wagon with Jean-Baptiste's body, and this vehicle is driven by Thierry, husband of Catherine, who's on the train with their daughter. François plays a taped interview with Jean-Baptiste, revealing his sexual appeal to both men and women. Lucie is convinced that she was his main love. Also on board is his nephew, Jean-Marie and Jean-Marie's estranged wife Claire. After the funeral in \"Europe's largest cemetery,\" the story continues in the mansion of Jean-Baptiste's brother Lucien.",
      "similar": [],
      "original_title": "Ceux qui m'aiment prendront le train",
      "runtime": 122,
      "poster_path": "/zSeh1JNt4CCP2PiQuwCxkeCrWUP.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Téléma Productions",
            "id": 885,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Canal+",
            "id": 5358,
            "origin_country": "FR"
         },
         {
            "logo_path": null,
            "name": "France2 Cinéma",
            "id": 7089,
            "origin_country": ""
         }
      ],
      "release_date": "1998-05-15",
      "vote_average": 3.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Patrice Chéreau"],
      "runtime": 122,
      "synopsis": null,
      "writers": [
         "Danièle Thompson",
         "Patrice Chéreau"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0118834/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUzNjY0NTY4NF5BMl5BanBnXkFtZTcwNzc2MDIyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Pascal Greggory, Valeria Bruni Tedeschi, Charles Berling | See full cast and crew »"],
      "reviews": [
         "They all loved him. Jean Louis Trintignat is the focus of their love. He is dead. Love is not. The shape, light and nature of one's love for another changes from character to character. I was riveted by that puzzle that love usually implies. And Vincent Perez? Where is he? I kept waiting for him to appear in all its unbearable beauty. The film was almost over and no sign of Perez. But, I was rapidly falling in love with a young woman I had never seen before on the screen. She is not just a superb actress but a monumental beauty. Hold on a minute. I think I've seen her before. God almighty! It's Vincent Perez! Among the many delightful, thoughtful surprises of this, unusual, french import is Vincent Perez as a girl. If you let the film happen and you don't fight it. You are going to have a wonderful experience.",
         "A minor but charismatic painter dies, and his friends and lovers and family go by train to Limoges for his funeral. There is a lot of bitterness and regret and desire: sometimes sudden and apparently irresistible, and it's given a very warm and lovely treatment here. The beauty of the men and their desire for each other is attractive (one does not have to be gay, though it helps to be sympathetic). However, the whole complicated story seems to me to be soaked through with the glum assumption that everything, everything is expendable, and the only good to be achieved is in brief moments of passion, and passion inevitably fades. There is no point in holding on to anyone. Is this apotheosis of fickleness strictly a gay theme? Certainly not, but it is central here. Apparently critics have talked of something being reborn in the story, but I could see only sadness. Happy endings may often be contrived, but sometimes I suspect the ineluctable dissolution ending can be just as contrived. Perhaps I just don't get it, but all this short-term loving, this coming close only to be set drifting outward into darkness seems unnecessarily painful, and I resent being told that's the way it is.",
         "A drama queen's wet dream. It offers up a magnificent, almost epic gloss of the melodrama of at least 14 characters. The problem is that with a Robert Altman-sized cast crammed into 2 hours (Altman would take 3 or more), and screen time distributed more or less democratically, it's hard to get to know the characters--but some are very compelling anyway. The film is narrated and edited ridiculously, as if a novel had been tossed into a blender. Most scenes feel like they're less than a minute long yet are packed with dialogue. You might wonder if the filmmakers are trying to obscure script problems by making routine exposition an unusual chore. However, the film's melodrama is presented in a lushly dark, romantic, Gallic way. There's something heady about the experience. And the film has some extraordinary settings. The cemetery is one of the most stunning locations since Scarlet O'Hara walked through the endless Confederate dead. And the train, crowded and zipping through the French countryside, is metaphoric in an undeniably physical way. Since Americans don't support public transportation, esp. trains, this experience struck me as unique.",
         "I saw it three times in a theater, and on DVD far too many times to count. I can't recall a film that has touched me so deeply. Maybe it's the way it encapsulated every funeral I've been to over the past ten years (and believe me, there have been a lot of them.) Maybe it's the way it reflected gay life as I've known it -- which is not one in which the imitation-straight couple rules (as in that pathetic HRC March on Washington), but rather consists of a complex network of friends and lovers. Just as Chereau's \"L'Homme Blesse\" captured coming out as I experienced it, so does this film deal with middle-age, loss, and regret. Part of what makes it so exceptional is that Chereau refuses to privilege straights in the narrative. For once THEY are the ones who have to explain themselves. Gayness is a given. It's hard to speak of \"big scenes\" in a film that gives you one after another. But the one in which the mourners watch the coffin go by in a car as Jeff Buckley's \"The Last Goodbye\" plays on the soundtrack has got to be one of the finest of modern cinema. And the finale, where Francois (Pascal Greggory) says goodbye to everyone without saying a word breaks my heart every time.",
         "Hard to avoid the Wellesian overtones here which begins with a death and goes on to explore the impact of the dead man not so much on the upper-case World as in Kane but on his own lower-case world as a fairly respectable number of those whose lives he touched travel to and assemble at his childhood home in Limoges. Amazingly one of the comments I've just read suggested that next time around the director employ a scriptwriter. This comment displays an ignorance verging on the colossal given that Daniele Thompson, who co-wrote the script from her own Original idea, is one of the outstanding screenwriters in French cinema having started with a classic 'Le Grand Vadrouille' at the age of 24 and progressing through such well-received titles as Le Follies de Grandeur, La Reine Margot until she began - with La Buche - to direct her own screenplays. Be that as it may the script is right up there with the best as are the performances not least the ever luminescent Valeria Bruni-Tedeschi whose performance alone is reason enough to see this. Okay, there are strong elements of homosexuality because it's inevitable that homosexuals are very much a presence in the modern world. As a heterosexual I wouldn't have a great deal if any at all interest in out-and-out homosexual films, literature or plays but neither did the homosexual content here bother/disturb me because it was shown in context within a highly complex, swiss-movement be-jewelled story. One that bears repeated viewings.",
         "Twice as ambitious as an Altman ensemble yet half as accessible, this lurid drama from the French director of Queen Margot begins at full-speed-ahead and hardly slows down thereafter. The film follows a disjointed, motley crew as they travel by train to the funeral of a condescending painter they all once loved. Director Chereau has enough faith in his ideas to incite scenes of tortuous incoherence, most in the first 20 minutes, but when the dust settles the film develops into a character-driven masterpiece in which every scene is the big one. The ensemble is superb, especially Jean-Louis Trintignant as both the painter and his brother, and the Americanized-in-vain Vincent Perez, back in his homeland where he belongs as a sharp-tongued transsexual.",
         "A movie that was badly promoted and that confirms, however, the recovery of French cinema. The characters in Ceux qui m'aiment... could be any of us, the plot is as real as our daily train rides. The best of us and the worst of us exposed in a particular situation. Love, hate, anger, our darkest side. A knowledge of French is, unluckily, indispensable to enjoy this movie, the power of certain dialogues cannot be translated. And yet, this movie will disrupt your quiet life for a few weeks, its power remains in its realism. A funeral, a bunch of family and friends and a great cast. Don't miss it. P.S. The music is superb.",
         "Let me say first of all that I'm not a train freak - but for train freaks, the shots on board the train were well done, there was a good sense of movement all through. Even after the funeral - and no trains, this was sustained. I was amused at Jean-Baptiste's desire for everyone who loved him to go by train, but his coffin to be transported by car - and did have to ask if those who came to the funeral by car did it from lack of love for the dear departed or from geographical necessity? I enjoyed this film more than I expected to; it was well paced, the characters were compelling, if not exactly your average circle of family and friends. The standard of acting was generally very good - I particularly enjoyed Vincent Perez's performance. If it reminded me of anything, the use of a widely varied soundtrack put me in mind of some of Fassbinder's better work. I feel this film justifies watching more than once, if only to sort out who's who and where they fit together, but, from first viewing, plenty of life, despite being based round a death.",
         "I perfectly understand the comment of the person who wrote that they needed a script. They do need better defined characters, an interesting story, a more intriguing atmosphere, more realistic scenes with recognizable reactions to human events, and perhaps something else that will make a viewer want to keep watching. The characters in this movie are so grotesque that I kept expecting one to begin to eat another. First, the fact that people are in some kind of emotional pain does not thereby cause one to find them sympathetic - particularly when there is little attempt whatever to relieve each other's troubles. That is fine, so long as the characters are made nevertheless interesting - through their actions, their dialogue, something. These eight or so principal characters seem to cry, rage, fight, yell, grab one another, insult one another, kiss each other, scream, slap, hug, kick -- non-stop without any dramatic build-up or suspense. It's just relentless displays of extreme emotion - whether it's of someone truly sobbing after finding that the water in the bath is cold (yes,undoubtedly some metaphor, but so poorly done); whether it's because someone else saw the deceased more recently than they; whether it's because someone they fancy doesn't want to be buggered on a train; -- or just for no reason at all. This is awful stuff - a portrait of self-absorbed decadence without anything interesting to say - and to boot, it's excruciatingly slow because terribly muddled for a long time. I don't at all mind working to figure out a movie - but there must be something intriguing to motivate the work. Thus, for example in Place Vendome, we don't know what is going on but it's well worth finding out. Not here - not with these characters who serve simply to embarrass those around them. This is an ugly movie - not because the ugly side of people is realistically shown, but because characters who never become real are created -- to personify ugliness of character. I had high hopes - and am very disappointed.",
         "This movie was ok--and probably better if you speak French since it would be easier to watch and not strain to see the poor subtitles on the DVD. The region 1 DVD isn't an especially great value. For one thing, the subtitles are part of the letterboxed movie image--not a separate subtitle track that you can turn on or off (as you can on most DVDs). The subtitles were also difficult to see since they were small and there were a number of times that they were white lettering on a white background and almost impossible to read. The transfer to DVD didn't seem to be especially great since most scenes were very dark or with very dark portions and then extremely bright portions. It seemed very contrasty and I suspect the original film didn't have this much contrast. It's my guess that they made the DVD transfer off an English language reprint of the film with subtitles embedded in the image and not off the best available French masters. I also suspect they used the same transfer for both DVD and VHS versions of the film. I found it difficult to see what was going on since a lot was extremely dark and I could only see silhouettes of people's hair or heads while at the same time trying to read small, poor-quality English subtitles. I find it hard to comment extensively on the content of the movie since I was so bothered by the poor quality of the DVD and I couldn't pay the best attention to the story. I would guess that many non-French-speaking audiences wouldn't be especially interested in this film because there are many characters to keep track of and they all seem most interested in bickering with other characters about romantic or sexual escapades. It all began to make some sense by the end of the movie--when I finally could put together some context for the characters. But by the end of the movie I was already too tired of petty bickering to care very much what happened to these people (and straining at the poor subtitles and transfer didn't make the movie very enjoyable either)."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Téléma",
         "Canal+",
         "France 2 Cinéma"
      ],
      "summaries": [
         "Friends of a recently deceased minor painter Jean-Baptiste take a train in Paris for Limoges, where he wished to be buried, and all the people on the train have their problems.",
         "Charismatic artist and teacher Jean-Baptiste has died. He has asked to be buried in the provincial city of Limoges, where his family runs a shoe-making company. He had said, \"those who love me can take the train.\" And here they are, in a Paris train station platform: lovers, old friends, casual acquaintances, and relatives. The long day in the lives of all these people is a journey toward illumination. At first the idea of spending a day in Limoges leaves them irritated and impatient. But as the train gets going, time begins to stand still and people start to talk, and laugh, and forget to behave themselves."
      ],
      "budget": 0
   },
   "movielensId": 3636,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1998-05-15",
      "dvdReleaseDate": "2000-05-16",
      "directors": ["Patrice Chéreau"],
      "runtime": 122,
      "movieId": 3636,
      "title": "Those Who Love Me Can Take the Train",
      "mpaa": "",
      "actors": [
         "Pascal Greggory",
         "Valeria Bruni-Tedeschi",
         "Charles Berling",
         "Jean-Louis Trintignant",
         "Bruno Todeschini",
         "Sylvain Jacques",
         "Vincent Pérez",
         "Roschdy Zem",
         "Dominique Blanc",
         "Delphine Schiltz",
         "Nathan Kogen",
         "Marie Daëms",
         "Chantal Neuwirth",
         "Thierry de Peretti",
         "Olivier Gourmet",
         "Geneviève Brunet",
         "Didier Brice",
         "Guillaume Canet"
      ],
      "imdbMovieId": "0118834",
      "originalTitle": "Ceux qui m'aiment prendront le train",
      "genres": [
         "Romance",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Friends of painter Jean-Baptiste Emmerich gather at a Paris railroad station for a four-hour journey to Limoges, where Emmerich wanted to be buried. The dozen travelers include art historian François and his lover Louis, who develops an interest in teenage Bruno. Traveling parallel with the train is a station wagon with Jean-Baptiste's body, and this vehicle is driven by Thierry, husband of Catherine, who's on the train with their daughter. François plays a taped interview with Jean-Baptiste, revealing his sexual appeal to both men and women. Lucie is convinced that she was his main love. Also on board is his nephew, Jean-Marie and Jean-Marie's estranged wife Claire. After the funeral in \"Europe's largest cemetery,\" the story continues in the mansion of Jean-Baptiste's brother Lucien.",
      "tmdbMovieId": 31353,
      "avgRating": 2.925,
      "releaseYear": "1998",
      "numRatings": 60,
      "posterPath": "/fE0f8cRij3e36P5kFhiYGyA9xld.jpg"
   }
}