{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "homeless person",
            "id": 960
         },
         {
            "name": "french",
            "id": 4653
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0089960",
      "video": false,
      "title": "Vagabond",
      "recommendations": [
         125150,
         106196,
         105711,
         85016,
         44065,
         147159,
         148050,
         147312,
         148068,
         148118,
         139772,
         227289,
         47425,
         50183,
         104378,
         97513,
         88309,
         125154,
         222226,
         69913
      ],
      "backdrop_path": "/9HNTLoRUtqR82FwbiFWJdRE6mUe.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1007,
               "character": "Mona Bergeron, a vagabond",
               "gender": 1,
               "credit_id": "52fe4672c3a36847f80ff747",
               "name": "Sandrine Bonnaire",
               "profile_path": "/i8Os6hHPZKyDQerX4qtG6njCcDN.jpg",
               "id": 19161,
               "order": 0
            },
            {
               "cast_id": 1005,
               "character": "Mme Landier",
               "gender": 1,
               "credit_id": "52fe4671c3a36847f80ff73f",
               "name": "Macha Méril",
               "profile_path": "/iwjgrJtcwwJaIKzIrRB7GUMPHZ5.jpg",
               "id": 9766,
               "order": 1
            },
            {
               "cast_id": 1006,
               "character": "Jean-Pierre",
               "gender": 2,
               "credit_id": "52fe4672c3a36847f80ff743",
               "name": "Stéphane Freiss",
               "profile_path": "/rlUdl4jnh5drYjqi9FBKAC0q7QR.jpg",
               "id": 40305,
               "order": 2
            },
            {
               "cast_id": 1008,
               "character": "the Moroccan who discovers Mona",
               "gender": 0,
               "credit_id": "539c4157c3a36810ba002012",
               "name": "Setti Ramdane",
               "profile_path": null,
               "id": 1330556,
               "order": 3
            },
            {
               "cast_id": 1016,
               "character": "Assoun",
               "gender": 0,
               "credit_id": "5aa9a3bc0e0a2664f9000406",
               "name": "Yahiaoui Assouna",
               "profile_path": null,
               "id": 1998404,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe4671c3a36847f80ff735",
               "name": "Agnès Varda",
               "profile_path": "/zfStaPgZo9aAHUH4sntmnpRcldd.jpg",
               "id": 6817,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe4671c3a36847f80ff73b",
               "name": "Agnès Varda",
               "profile_path": "/zfStaPgZo9aAHUH4sntmnpRcldd.jpg",
               "id": 6817,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5648d7e7c3a36826010086eb",
               "name": "Oury Milshtein",
               "profile_path": null,
               "id": 68373,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5648d7efc3a368261a0083a2",
               "name": "Joanna Bruzdowicz",
               "profile_path": null,
               "id": 1536671,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "5648d7f79251413ade008094",
               "name": "Patrick Blossier",
               "profile_path": null,
               "id": 20683,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5648d7ffc3a368260c00849c",
               "name": "Patricia Mazuy",
               "profile_path": "/aDG8yzzRAYh04D9Bcb9GyLPbMaG.jpg",
               "id": 284816,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "5648d8069251413ade00809a",
               "name": "Agnès Varda",
               "profile_path": "/zfStaPgZo9aAHUH4sntmnpRcldd.jpg",
               "id": 6817,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5648d80fc3a36826010086f2",
               "name": "Oury Milshtein",
               "profile_path": null,
               "id": 68373,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 2,
               "credit_id": "5648d8199251413ade0080a0",
               "name": "Jean-Paul Mugel",
               "profile_path": null,
               "id": 9890,
               "department": "Sound",
               "job": "Sound"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 3.292276,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 44018,
      "vote_count": 42,
      "budget": 0,
      "overview": "Mona Bergeron is dead, her frozen body found in a ditch in the French countryside. From this, the film flashes back to the weeks leading up to her death. Through these flashbacks, Mona gradually declines as she travels from place to place, taking odd jobs and staying with whomever will offer her a place to sleep. Mona is fiercely independent, craving freedom over comfort, but it is this desire to be free that will eventually lead to her demise.",
      "similar": [
         258480,
         12793,
         27586,
         858,
         141,
         634,
         244772,
         242224,
         112160,
         394117,
         401898,
         376867,
         17130,
         11421,
         370663,
         43923,
         152532,
         3981,
         437557,
         297762
      ],
      "original_title": "Sans toit ni loi",
      "runtime": 105,
      "poster_path": "/MANiWklet9doKRMNMxYnvuCguJ.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Ministère de la Culture",
            "id": 10901,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Films A2",
            "id": 875,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Ciné Tamaris",
            "id": 14683,
            "origin_country": ""
         }
      ],
      "release_date": "1985-12-04",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Agnès Varda"],
      "runtime": 105,
      "synopsis": null,
      "writers": ["Agnès Varda"],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0089960/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE3NDgxMzA5OV5BMl5BanBnXkFtZTcwOTYxMDMyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Sandrine Bonnaire, Macha Méril, Stéphane Freiss | See full cast and crew »"],
      "reviews": [
         "There are many different reasons to watch a film. I personally enjoy casual get out the six pack of beer type movies and I appreciate sincere great film art. Vagabond is one of the greatest films I have ever seen. I was drawn into this deeply tragic tale from the very opening scene with the wonderful music and cinematography. The documentary style used as a device to tell the story of Mona was bold and very appropriate to convey the depth of the impact this person had on the other characters in the film. The acting of Ms. Bonnaire convinced me to care about this deeply troubled character and the isolated existential life she led. I personally have met in my own life people living in this way and I am always perplexed that I can not understand what is going on in that person's head. This film is and example of what makes great art. It tells a story that is universal and yet very personal. See this film. (10 out of 10).",
         "Perhaps Sandrine Bonnaire's \"Mona\" represents my greatest fear -- of being alone and broke. That is why she has remained with me for almost twenty years. Remembering the first time I met her is nostalgic to me. I walked the roads of rural France with her and liked her for not begging to be liked. Perhaps it was love more than like. Her journey made me tearful. I mourned the inevitability of her existence. Such is Agnes Varda's talent that the movie affected me so deeply -- my favourite movie of hers, by the way. The landscapes are so vivid, the dead tree branches so bare yet so brittle in the harsh elements. The compositions possess a fixed, absolute nature that conveys a hopeless destiny. There is no offensive beauty in Mona's destitution, there is merely purity. Because so few motion pictures resonate with this much intensity and feeling for me, I go through periods in which I feel like I'm wasting my life away seeing so many, but when I consider the alternative, Mona's choices suddenly feel real to me. Extraordinary in every sense. Make a gallant effort to see VAGABOND. It will touch you deeply and wake you from the slumber of indifference.",
         "Vagabond, Agnes Varda's bleak and uncompromising film about a free-spirited drifter on the road in southern France is difficult to watch yet it is filled with images that are hard to forget: dark rooms in abandoned houses, brown muddy fields, a young woman thumbing a ride in tattered clothes carrying a backpack, and, at the end, huddling under a makeshift blanket facing the frigid night. The fact about where she ends up is clear from the outset as we see her frozen body lying in a ditch and the film attempts to piece together what brought her to her sad ending. 18-year-old Mona Bergeron (Sandrine Bonnaire) is infuriating and largely unlikable, but the film does not judge her actions or lifestyle and Varda offers no explanations, psychological insights, or admonitions to society, there is just Mona - a spunky but deeply troubled young woman. On the surface she is a free spirit. She smokes a lot of cigarettes and pot, drinks cheap booze, and enjoys the company of men, but it is clear that there is a lot going on beneath - some untold story, perhaps a rejection from a member of her family or a boyfriend, an event that has instilled confusion and self-loathing, but we never find out. Like Charles in Bresson's The Devil Probably, Mona turns her anger inward without recognizing a problem, much less attempting to find its source and the film becomes one long suicide watch. Little by little we find out bits and pieces of information about Mona through interviews and recreated flashbacks but they do not add up to much. We learn that she comes from a middle class family, she has employable skills but there is no answer as to why she has dropped out of life, tuning out everything and everyone except the open road. Angry and self-righteous yet strangely passive, Mona drifts from one encounter to another without connection, commitment, or joy. She meets a college professor, a tree agronomist looking into the diseases that kill plants, a Turkish migrant worker who wants her to stay until his fellow workers reject the idea, a goat-herding intellectual who offers her a piece of land to cultivate, and a wealthy old woman who needs a companion. The reactions of the participants help us to create a picture but we learn more about the witnesses than about Mona. Each person reacts to her in a different way, and some romanticize her out of all proportion to reality. A young girl helps her fill her water bottle at the farm and later tells her parents that she wants to be free like that girl. Yolande, the maid at the old woman's estate, feels that Mona's relationship with a fellow drifter is her idea of true love. Some offer her a way out but she will have none of it. She prefers the road with its adventure and uncertainty. The farmer disappointedly says: \"It's not wandering, it's withering.\" One of the best scenes is when she gets drunk with the old woman who knows everyone is waiting for her to die. Both have a moment of laughter but it is only a mask for world-weariness and will not hold off the night, encroaching like a thief. In a truly accomplished performance, Ms. Bonnaire creates a memorable character that forces us to bear witness to our own humanity. As one powerful moment blends into another, she forces us to see a face behind the statistics we see each day in the newspaper and to look this woman in the eye knowing that she is a part of us, perhaps the part that we would rather not see. Mona is not a person I would particularly care to meet, but I also know that she is one that I cannot ignore or ever forget.",
         "A Rave! Beautifully photographed by Patrick Blossier, every shot, every frame is a delightfully balanced composition of light, color, and framing. What's more amazing still is how Varda can make such a depressing story so mesmerizing. It is a touching, enchanting story of a lost girl slowly sinking deeper and deeper into society's refuse pile. And even though from the first reel we know her fate, we have to see how it unfolds. I don't remember the last time I saw such a beautiful film. One for the film schools. A masterpiece of French neo-realism.",
         "Do you want to know how Absolute Freedom looks like? In Agnes Varda's film it is a frozen in a ditch young woman, dirty, lonely - a vagabond, without roof or rule. Why did she end up in that ditch? Why did she choose to be alone, to drift aimlessly in the wintry country side? Does being free always mean the encounters with violence, hunger, fear, and cold? The girl (we learn that her name was Mona, that she used to be a secretary in a big city) deeply touches the lives of the people she meets on the road. She is not likable but why can't all of them forget her, why did she touch their lives so deeply? Agnès Varda does not answer the questions and she does not judge her anti-heroine (star making performance by 18 years old Sandrine Bonnaire); she tries to understand her and she mourns the life that was promising once, that supposed to have meaning but ended up so tragically and abruptly.",
         "sans toit ni loi ( without a roof nor rule) by Agnes Varda Visual poetry in films is rarely sublime.Mostly its an interpretation that is fed to us either by the director of the film or some high-faultin critic who manages to see color in sepiated walls.The rare film that manages to transcend leaves you speechless with nothing to say as words fail to capture the essence , beauty and enigma of that film. All you can say is today I was blessed. Like a born again christian or a corpulent evangelist you wish to celebrate your new found faith with words , gestures , anything that says to the director of the film, you gave me a day of absolute completeness today and a film that will forever stay with me like unrequited love. That transcendental, evocative , sensitive , visually dazzling , transcendence is sans toit ni loi by agnes Varda. The film as has been pointed out is the cinematic equivalent of ulysses . Like James Joyce , varda lets rip a stream of consciousness that is disturbing , sincere and beautifully sublime.The protoganist is a young female drifter, a vagabond who is eternally free. She requires human contact only to fulfill her basic needs and her solitude is complete and absolute , accentuated by her complete disdain for authority or advise.The people she meets are all left with indelible memories of her.Those that pity her are later assailed by thier own infirmities. She refuses to blend or compromise and as one character says is perpetually withering.She dies alone and uncared for and she leaves absolutely no conventional emotional baggage behind.This isnt about a hippie , or a bum , or a dope addict or just a mentally unsound person. Its about a compassionate person who choses to abnegate all her social bonds and moral barriers and lives for nothing more than basic survival. She is the eternal soul that is freedom. Pure , absolute and totally decadent freedom.",
         "What I admired the most about \"Vagabond\" is the objective, evenhanded approach of the director towards her \"heroine\". She neither praises nor condemns her chosen \"lifestyle\", she simply observes it - and she observes it so well that this feels like the work of someone who's had first-hand experiences with similar people and surroundings. To be perfectly honest, the film doesn't have much psychological (or sociological) depth, and it can get boring at times while you're watching it, but right after it's over, you know that you've seen a good movie. (***)",
         "Vagabond begins with the discovery of a woman's corpse in a ditch. She has frozen to death in the night. Police officers lift the lifeless body out of the ditch as if it were a rigid statue. The rest of the film follows the last leg of this woman's life. We drop in on interviews with people who had come into contact with her in the recent past. Sometimes it is a police officer interviewing, sometimes the bits of information are given without solicitation, as an aside to the camera. Agnes Varda's presence is always felt behind the camera. She speaks aloud at the beginning of the film, announcing the subject of the film. Vagabond is a study of this woman, Mona, and also of the different thoughts projected on her by different people. To some, she was a piece of meat, to be screwed. To others, she represented freedom. \"I wish I were free like her\" we hear from a couple of speakers (incidentally, not all of the interviewees know that she is dead; the interview structure is never clearly defined, giving it a ghostly feeling; oh, and also incidentally, the structure of the film is co-opted from Citizen Kane; that's not something that most will notice (the film is too strong on its own to be reduced like that), and it's not something that's at all important, but it's kind of a neat fact). To others, she represents a lost cause. Yet others feel pity towards her. A college professor whom Mona meets gives her a long lift in her car. Later, when this professor has a near-death experience, she violently regrets that she left her alone on the side of the road. Varda refuses to judge Mona or to idolize her. The film is not very emotionally draining. Neorealism isn't the goal here. If you do want to see a related film more in the melodramatic style of Neorealism (and there's nothing wrong with that, of course), try Erick Zonka's excellent 1997 film The Dreamlife of Angels. But not Vagabond, no. I'm guessing that this film is actually based on a real person. It certainly could be, anyway. Varda's only purpose seems to be the questioning of how this could happen. What kind of person is Mona? How did she end up where she did? Bringing back Citizen Kane, Vagabond's point isn't too different from that all-time great masterpiece. As much as you can possibly learn about Charles Foster Kane or Mona, you can never know enough to understand them.",
         "I don't know what it was about the first few episodes that turned me off, but something did. -- Perhaps the (mistaken) impression that the film and its author were entirely embracing and espousing Mona's philosophy. But I was won over by the middle, and quite positive about it after re-viewing the beginning sections. I somewhat disagree with a previous comment about the documentary-style scenes. They might have turned out badly, indeed, if done mechanically, for instance always showing the \"interview\" scene with someone just after showing the narrative scenes involving that person with Mona, and making them all just about the same length. Instead, the connections and handling of the \"interview\" scenes are varied, and become interesting, even rather intriguing as when we start getting the story of Yolanda (maid to the half-blind old woman Aunt Lydie), told directly to the camera, *long* before meeting her in the narrative with Mona. Also intriguing are the almost-last-minute revelations of pre-existing connections among many of those who have encountered Mona -- e.g., when the agronomist (former student of the electrocuted professor) turns out to be Aunt Lydie's nephew that Yolanda has been discussing. Incidental note: there is at least one additional comment on this 1985 Varda film misfiled in the IMDB comments for a different, 1992 film also known as \"Vagabond\", at http://us.imdb.com/Title?0105718 . Question for other viewers [perhaps a slight spoiler]: Can you please explain what's going on in that town, when Mona (and apparently others) are attacked by the mud-covered men wearing trees??? Are those grapevines? Are these guys agricultural workers, like Assoun? Is it a spontaneous riot, or some sort of semi-recognized local ritual?",
         "Agnès Varda is commonly associated with the Nouvelle Vague and more than François Truffaut, Jean-Luc \"God Ard\" or Eric Rohmer, she delivered some of the jewels of this French trend with \"Cléo De 5 à 7\" (1961). It doesn't mean that everything she made turned into gold. One can skip \"les Créatures\" (1966) without remorse. Twenty years later, she issued her strongest work since \"Cléo De 5 à 7\" which justifiably dominated from an artistic perspective French cinematographic production: \"Sans Toi Ni Loi\" that caused a stir. It works as an alternation of flashes-back and interviews with people about their recollections involving a female rambler named Mona. We won't know much about herself. After she passed her high school diploma, she started to work for different bosses as a secretary but grew tired of his job. So, she packed in to leave for adventure through odd jobs. However, Varda's heroine keeps all her mystery and ambiguity. Are we really sure about what she says? Doesn't she lie? The female filmmaker doesn't comfort the audience because as the elements of the puzzle are pieced together, she throws the people who met Mona out in the same basket, either it is this university professor, this Maroccan guest worker or this former philosophy student who believed in the events of May 1968 in France: they are all responsible for Mona's death because of their egoism, their lack of communication with her. Varda delivers a similar message to her 1961 film: loneliness is a burden and it's better to open oneself to others to make things improve. \"Sans Toi Ni Loi\" has the form of a documentary with a gritty tonality in which the female filmmaker keeps a certain distance with her heroine and everything she goes through. Thanks to this, tawdry or violent sequences take another dimension like the moment when the garage owner leaves Mona's tent pulling up his trousers or the man who rapes her in the woods. We won't see the horrid act. Varda hired non-professional actors and that's why her film has a larger than life feel. An impression accentuated by Sandrine Bonnaire's sensational performance. She \"lives\" more than she acts her role. The role of this rambler fits her like a glove. This is one that can stand multiple viewings."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Ciné Tamaris",
         "Films A2",
         "Ministère de la Culture"
      ],
      "summaries": ["In winter in the south of France, a young woman is found frozen in a ditch. She's unkempt, a vagabond. Through flashbacks and brief interviews, we trace her final weeks as she camps alone or falls in with various men and women, many of whom project their needs onto her or try to give her life direction. She squats in an old house smoking hash with a man, falls for a Tunisian laborer and works beside him pruning grape vines, stays with a couple shepherding goats, meets an agronomist trying to save plane trees, gets tipsy with an old woman, and has an offer to appear in porn films."],
      "budget": 0
   },
   "movielensId": 3637,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1985-12-04",
      "dvdReleaseDate": "2000-05-16",
      "directors": ["Agnès Varda"],
      "runtime": 105,
      "movieId": 3637,
      "title": "Vagabond",
      "mpaa": null,
      "actors": [
         "Sandrine Bonnaire",
         "Macha Méril",
         "Stéphane Freiss",
         "Setti Ramdane"
      ],
      "imdbMovieId": "0089960",
      "originalTitle": "Sans toit ni loi",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["Xwp5aos5FXY"],
      "plotSummary": "Mona Bergeron is dead, her frozen body found in a ditch in the French countryside. From this, the film flashes back to the weeks leading up to her death. Through these flashbacks, Mona gradually declines as she travels from place to place, taking odd jobs and staying with whomever will offer her a place to sleep. Mona is fiercely independent, craving freedom over comfort, but it is this desire to be free that will eventually lead to her demise.",
      "tmdbMovieId": 44018,
      "avgRating": 3.77604,
      "releaseYear": "1985",
      "numRatings": 192,
      "posterPath": "/MANiWklet9doKRMNMxYnvuCguJ.jpg"
   }
}