{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "revolution",
            "id": 2020
         },
         {
            "name": "communist",
            "id": 2109
         },
         {
            "name": "salesman",
            "id": 10332
         },
         {
            "name": "king",
            "id": 13084
         },
         {
            "name": "tv",
            "id": 156634
         }
      ],
      "imdb_id": "tt0050598",
      "video": false,
      "title": "A King in New York",
      "recommendations": [
         28974,
         30588,
         28971,
         73455,
         47249,
         46435,
         45991,
         21454,
         91471,
         49559,
         42238,
         28528,
         87859,
         31819,
         122683,
         15366,
         26851,
         37360,
         44445,
         51371
      ],
      "backdrop_path": "/k69jSaKy2KtMMM7PfPUBf0RrDIz.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "King Shahdov",
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06c99b",
               "name": "Charlie Chaplin",
               "profile_path": "/pcvSg2LqnyVFel9dPIwTRagpfur.jpg",
               "id": 13848,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Queen Irene",
               "gender": 1,
               "credit_id": "52fe45bfc3a368484e06c99f",
               "name": "Maxine Audley",
               "profile_path": "/1hsZ54YqubfXJcyGj8QFA1OcxPz.jpg",
               "id": 30141,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Prime Minister Voudel",
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06c9a3",
               "name": "Jerry Desmonde",
               "profile_path": null,
               "id": 102514,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Ambassador Jaume",
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06c9a7",
               "name": "Oliver Johnston",
               "profile_path": null,
               "id": 29308,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Ann Kay - TV Specialist",
               "gender": 0,
               "credit_id": "52fe45bfc3a368484e06c9ab",
               "name": "Dawn Addams",
               "profile_path": "/rNQtgnahRE9y0BpFbBwbFiZpRux.jpg",
               "id": 72717,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Johnson - TV Advertiser",
               "gender": 2,
               "credit_id": "547ee5c792514124af000df9",
               "name": "Sid James",
               "profile_path": "/9dMtCoy4lvc7blUersBo4ypao1M.jpg",
               "id": 40952,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Mona Cromwell - Hostess",
               "gender": 1,
               "credit_id": "547ee5db92514124bb000f3b",
               "name": "Joan Ingram",
               "profile_path": null,
               "id": 1010507,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Rupert Macabee",
               "gender": 0,
               "credit_id": "547ee5f6c3a3683968000ded",
               "name": "Michael Chaplin",
               "profile_path": null,
               "id": 147981,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Macabee Senior",
               "gender": 2,
               "credit_id": "547ee608c3a3683961000cae",
               "name": "John McLaren",
               "profile_path": null,
               "id": 115068,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Headmaster",
               "gender": 2,
               "credit_id": "547ee66292514124b3000ea5",
               "name": "Phil Brown",
               "profile_path": "/exkyN66HiZWJDmpcOza2hWoswOo.jpg",
               "id": 33032,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Lawyer",
               "gender": 2,
               "credit_id": "547ee677c3a3683965000ec2",
               "name": "Harry Green",
               "profile_path": "/njPQkFZ1BcRX1d9jrJ0pRCIJDzI.jpg",
               "id": 112363,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Liftboy",
               "gender": 2,
               "credit_id": "547ee6c3c3a3683965000ecb",
               "name": "Robert Arden",
               "profile_path": "/l8lx4yA8IQtgxPsd47p9dnoPWgQ.jpg",
               "id": 535977,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "School Superintendent",
               "gender": 0,
               "credit_id": "547ee6d4c3a368395a001009",
               "name": "Alan Gifford",
               "profile_path": "/rB3wxxeKK7EuflIWIQoB7dbFk99.jpg",
               "id": 93948,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "U.S. Marshal",
               "gender": 0,
               "credit_id": "547ee6e592514124bb000f5d",
               "name": "Robert Cawdron",
               "profile_path": "/lZKk1dgb7NwSde6hhIEaB7aebuG.jpg",
               "id": 189826,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Member of Atomic Commission",
               "gender": 2,
               "credit_id": "547ee6f5c3a368395c00110d",
               "name": "George Woodbridge",
               "profile_path": "/lX0Q7oAPgu53iF6oNtg44X6TkV9.jpg",
               "id": 104305,
               "order": 14
            },
            {
               "cast_id": 18,
               "character": "Member of Atomic Commission",
               "gender": 0,
               "credit_id": "547ee706c3a368395e00105e",
               "name": "Clifford Buckton",
               "profile_path": null,
               "id": 1393333,
               "order": 15
            },
            {
               "cast_id": 19,
               "character": "Member of Atomic Commission",
               "gender": 0,
               "credit_id": "547ee718c3a368396c000fdb",
               "name": "Vincent Lawson",
               "profile_path": null,
               "id": 1393334,
               "order": 16
            },
            {
               "cast_id": 20,
               "character": "Singer",
               "gender": 1,
               "credit_id": "547ee72992514124af000e2c",
               "name": "Shani Wallis",
               "profile_path": "/cGDZ8oiOwRUnf8m5b5wAQVWrmA6.jpg",
               "id": 129437,
               "order": 17
            },
            {
               "cast_id": 21,
               "character": "Singer",
               "gender": 0,
               "credit_id": "547ee73992514124b3000ecd",
               "name": "Joy Nichols",
               "profile_path": null,
               "id": 1393336,
               "order": 18
            },
            {
               "cast_id": 22,
               "character": "Comedian",
               "gender": 0,
               "credit_id": "547ee74a92514124b9000f14",
               "name": "Lauri Lupino Lane",
               "profile_path": null,
               "id": 1336772,
               "order": 19
            },
            {
               "cast_id": 23,
               "character": "Comedian",
               "gender": 0,
               "credit_id": "547ee77f92514124b9000f1e",
               "name": "George Truzzi",
               "profile_path": null,
               "id": 1393340,
               "order": 20
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06c9b1",
               "name": "Charlie Chaplin",
               "profile_path": "/pcvSg2LqnyVFel9dPIwTRagpfur.jpg",
               "id": 13848,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06c9b7",
               "name": "Charlie Chaplin",
               "profile_path": "/pcvSg2LqnyVFel9dPIwTRagpfur.jpg",
               "id": 13848,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 5.546569,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 28973,
      "vote_count": 46,
      "budget": 0,
      "overview": "Due to a revolution in his country, King Shahdov comes to New York - almost broke. To get some money he goes to TV, making commercials and meets the child from communist parents. Due to this he is suddenly a suspected as a communist himself and has to face one of McCarthy's hearings.",
      "similar": [
         294016,
         8587,
         567,
         582,
         1402,
         1417,
         68734,
         197,
         310307,
         746,
         10140,
         869,
         262504,
         131634,
         262500,
         192141,
         17295,
         3291,
         336,
         38543
      ],
      "original_title": "A King in New York",
      "runtime": 110,
      "poster_path": "/b3z82K4UCHSJR2w8uoBmhl1tOVw.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Charles Chaplin Productions",
         "id": 1315,
         "origin_country": ""
      }],
      "release_date": "1957-10-25",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "The king of comedians!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Charles Chaplin"],
      "runtime": 110,
      "synopsis": null,
      "writers": ["Charles Chaplin"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0050598/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ2ODExODkyOV5BMl5BanBnXkFtZTYwNjQ0NDc4._V1_SY308_CR1,0,214,308_AL_.jpg",
      "actors": ["Stars: Charles Chaplin, Maxine Audley, Jerry Desmonde | See full cast and crew »"],
      "reviews": [
         "It's not only one of Chaplin's best films, but one of the most important films about America ever made. Thrown out of the US for his liberal views, Chaplin became very irate at America. This is his response, a bare-knuckle boxing match with Uncle Sam - and this tramp doesn't pull punches. He doesn't leave a stone unturned, movies, music, high culture, television, education, fame, and especially the communist witch hunts. Best of all, he still exhibits his comic brilliance, and almost all the jokes land. Chaplin's son Michael is very good as a young boy who espouses communist ideals without the slightest provocation. The film ends without resolution, as this dark period of American history was still going strong. Only the hope that it is only a phase is expressed, but otherwise, the darkness is left to brood. People have accused the film of not being subtle, but it is far more so than the infinitely more popular The Great Dictator, and also more so than his other two talkies, Monsieur Verdoux and Limelight. All of those films are great, but they all end up with Chaplin telling us directly what he wants us to walk away with. A King of New York is, even if it has its clunky moments, an exceptional achievement. It's about time that it was rediscovered. 10/10.",
         "\"A King in New York\" is one of those few films that gets better and better every time you see it. Yes, it's flawed--the sets look shabby, and some of the dialogue is stilted and melodramatic. Yet despite these shortcomings, AKINY still stands out as a wonderful, playful satire of 1950's America. For those of you who may not know, Chaplin himself was targetted by the U.S. government at the time for his alleged communist leanings. In fact, AKINY had to be shot in Britain (Chaplin's birthplace) only because Chaplin and his family had been forbidden to re-enter the U.S after a short vacation overseas. AKINY was Chaplin's response to the nonsense and paranoia that pervaded American society at that time. Chaplin also pokes fun at America's obsession with technology and the media--a point which is even more relevant today. Chaplin plays King Shahdov, a deposed monarch who flees to America in the hopes of selling his plans for a peaceful, nuclear-based society (which never happens). Chaplin plays Shahdov as an honest, but hapless European monarch thrust into the dizzying whirl of modern America. Chaplin is at his absolute best here as a befuddled and somewhat puzzled outsider. Shahdov soon meets up with two people. The first is Ann Kay (Dawn Addams), a beautiful young woman who seduces the King and lures him into appearing in her television commercials, and Rupert Macabee (played by Chaplin's son, Michael), a brilliant young boy whose parents have been imprisoned by HUAC. Also worth noting is Ambassador Jaume (Oliver Johnston), Shahdov's loyal friend and confidante. Johnston and Chaplin play off each other beautifully, and together they share some of the film's funniest moments. AKINY is full of priceless \"bits of business,\" as Chaplin used to say--there's a hilarious restaurant scene in which Chaplin mimes his order to the waiter in order to overcome the dreadful racket from the house band. Then there's the scene in which Shahdov's newly lifted face become \"unhinged\" as he bursts into laughter at a comedy show. Chaplin slyly slips in and out of these bits (which are essentially silent comedy pantomimes dating back to his earliest days in English Music Halls) with great ease. Such scenes provide the most satisfying moments in the film. Here, behind Chaplin's aged face and body, you can still see the little tramp come to life, and it's wonderful. AKINY is vastly underrated by most critics who, for some reason, obsess over the sets, and virtually ignore what is truly one of Chaplin's masterpieces. AKINY is rarely screened in North America for some reason, so if you get the chance to see it, don't pass it up.",
         "A great film that was neglected by the good old US of A when it was released in the late 50's. It was brandished as being to critical of the political atmosphere of the United States at the time. It's funny that Chaplin could manage to offend both Adolf Hitler (The Great Dictator) and the fascist-like/inspired 'anti-communist' movement of the 50's/early 60's U.S.A. There is actually a common link in those two movements (Naziism and the 50-60's 'anti-communist movement in the USA but I won't get into that here). Anyway, it is sad that this film is overlooked as it is one of Chaplin's best and should be looked as one in a career overview of this great filmmaker. Besides him, in the film there really is not any awe-inspiring actor/actress but Chaplin brings out the best in everyone and elevates them from eternal anonymity to something of recognition. His son Michael Chaplin for example is used quite wonderfully in this film. I later bought Michael Chaplin's late teenage memoir 'I Couldn't Smoke the Grass on my Father's Lawn' based on seeing him in this film and him impressing me so. It's too bad he could not develop more as an actor or recording star (he released a single in Britain in the mid-60's). I heartily recommend this film. See it and be open minded. Take a look at the way your country was run 50 years ago and ask yourself have things really changed this day in age when the 'communists' have know been replaced by the 'terrorists'.",
         "A King In New York was a pure delight to watch. Seeing perhaps the greatest actor of the first half of the century is always a treat and he doesn't disappoint in this film. Chaplin made this satire as a shot at the United States, who only five years earlier had denied him re-entry into the country. This was based on the fact he wouldn't come before the McCarthy hearing and make a statement on his supposed ties to the Communist party. Regardless of the basis for this film's comedy pieces, one can find a few moments where Chaplin is taking a direct shot at those who had doubted him. The plot involves Chaplin as King Shadov, a ruler of a ficticious country whose people have ousted him based on his unwillingness to manufacture Atomic Bombs. He would rather spend the taxpayers money on finding ways to create atomic energy. Obviously this is a deliberate analogy of Chaplin being thought of as a communist although the complete opposite was the truth. So, the exiled leader goes to America in search of a fun vacation in which he can experience the excitement that he had heard about so many times before. The viewer follows Shadof and his trust aide throughout New York City and their many hilarious experiences. The best of which that come to mind are the scenes in which Chaplin pantomimes his order to a waiter who cannot hear him, the scene in which Chaplin recites the famous \"to be or not to be\" soliloque from Hamlet to guests at a dinner party and the scene in which Chaplin gets his finger stuck in a fire hose and cannot get it out. One can see some elements of the tramp in Chaplin in this film including the facial expressions, his smile and the way he moves about gracefully. I had never seen Chaplin in a talking film before this one and was somewhat surprised to see how much of a great talking actor he truly is. For an actor who had done so much in silent films and only silent films, this film shows that Chaplin is one of the top actors of this century. The only element of this film that somewhat disappointed me was the manner in which the hearings were brushed off. I believe that there was plenty of room for some gags to be thrown in here. Perhaps Chaplin felt as if he had already taken enough shots and didn't need to exploit this area. This film is yet another example of the Chaplin greatness and I would recommend it to anyone who loves films or are interested in seeing film making magic. 8/10 stars.",
         "Charlie Chaplin's A King in New York is a fine film to see when it's a laid-back afternoon and it comes on TV, as it's a bit of a surprise to come upon. It's a later Chaplin film, where he's no longer the iconic Tramp, yet in a way the logic of one of those films in terms of the society at large is still being toyed with. This time, instead of being on poverty row with holes in his shoes and a sweet and enduring love for a street girl, he plays a king whose country has gone to war and without many prospects financially comes to America to do commercials for products that he would surely rather not be pushing on the public. As life does imitate art (as far as the stereotype goes it does have a ring of constant truth), Chaplin at the time was an exile, kicked out of America for being a supposed communist, and with his non-prolific career going a little bit on the slide, he made the film as a quasi-light attack on American consumerism, of the vanity and stupidity that can come out of prosperity. But at the same time, there is still the sensibility that Chaplin loves life and individuals, if not certain groups. This can be seen in the child character- one of Chaplin's own sons- who through his very intelligent but arrogant manner is one of the nicer and funniest characters in the film. While a lot of the humor, sometimes rather dry, is in seeing Chaplin's King and his assistant/butler talk of money problems and in the observations of the 'other', the best scenes come in showing what levels King Shadhov has to sink to in trying to pay his expensive hotel bills and stay afloat in a strange land. My favorite scenes where Shadhov's botched plastic surgery debacle, where it's funnier seeing the King trying not to laugh at a slapstick spectacle than the actual spectacle itself, and the scenes of the King trying to shill the items, often to the dissatisfied directors (I'm reminded of Lost in Translation, and in fact Chaplin's scenes are probably more successful than Coppola's). Although the film is preachy at times- it's best when Chaplin goes for the more succinct jabs as opposed to the grandstanding, ironic since it worked perfectly at the end of the Great Dictator- the overall high-spirited and serenely theatrical direction makes this a worthwhile effort. Far from being the controversial film it got a reputation as following a non-release in the 50s in the US, it's only a cunning satire, with moments light and foreboding, and it deserves to be seen just as much as Chaplin's classics (if only by his fans, who might be apprehensive at the filmmaker making too many 'statements').",
         "When I was a child, Charlie Chaplin's name was anathema. Here was the personification of the \"Red Peril,\" made worse still by the fact that we had loved and trusted him through a lifetime of film. When A KING IN NEW YORK came out it couldn't even get a distributor in the U.S. so virulent was the hatred for \"turncoat\" Charlie. Now, forty seven years later, and thanks tp the amazing TCM, I have finally seen A KING IN NEW YORK and though it is somewhat uneven and episodic, I believe it to be one of the best of Chaplin's films. A mixture of broad slapstick and wry and subtle satire, the film is often hilarious while at the same time touching and thought provoking. Satire has to be the hardest form of art to translate to the screen and there are few films that even try to tackle it, (Frank Tashlin's hilarious WILL SUCCESS SPOIL ROCK HUNTER? one delightful example), so A KING IN NEW YORK is welcome as an attempt to satirize a rather unsettling time in US history. There are many brilliant scenes in A KING IN NEW YORK; the ones in the movie theater, at the \"Montesori\" type school and shooting the Scotch commercial among the best. Above all, the warmth, humanity and total befuddlement of the King, as performed by Chaplin, is the glue that holds the enterprise together. In every frame, Chaplin is mesmerizing and Dawn Addams, playing it way over the top as the epitome of the \"woman in the grey flannel suit\" (one, by the way,that is covered by a floor length mink!), is a constant delight. Excellent too is Michael Chaplin, the director's son, as a young genius who spouts the joys of Communism at the drop of a hat. Joe McCarthy is gone (so far!), Chaplin is dead and we are left in yet another unsure world. Comedy, as always, will help get us through. A KING IN NEW YORK gives us that comedic respite, while proving, so many years later, that governments are, after all, transitory things while art last forever. A comedic gem!!!!!!!!!!!!!!!!!",
         "When I rented this movie, I had no idae what to expect. Charlie Chaplin in a talkie?! I had just seen (heard?) how poor Buster Keaton's awful voice destroyed his presence as the classic stone-faced pantomine. Might Mr. Chaplin's performance in a speaking role be as sadly disappointing??? The answer in a resounding word was, \"NO!\" If anything, Chaplin's voice and accompanying ability to express himself with words enhanced his screen presence by providing a new dimension with which to appreciate his seemingly limitless talent. I'm not sure just how to explain this other than the fact that I watched most of the film with a big grin glued to my face. I marvelled at the subtleties of Chaplin's performance which distinguish him not only as a silent movie actor, but as an actor of ANY era! In today's world of over-the-top silliness and questionable acting passing as good comedy, his performance is a clear indication that intelligent comedy is not an oxymoron and that the \"King\" of it is the same person as the king of slapstick. If you're the kind of person who appreciates the subtlety in Woody Allen's humor, you will find yourself marvelling at \"A King in New York\" and you will see (and hear!) a part of Charlie Chaplin you may not ever have known existed.",
         "Charles Chaplin had a love-hate relationship with the United States of America. On the one hand, it was in Hollywood that the British-born comedian and filmmaker built a successful life and career, immortalising himself as one of the most beloved directors and stars in the history of cinema. On the other hand, Chaplin's political attitudes during the 1940s \u0096 that America should form an alliance with the Soviet Union in order to fight Adolf Hitler's fascist regime \u0096 led to his being labelled a Communist or Communist sympathiser. In 1952, Chaplin returned to his home-town of London for the premiere of the brilliant 'Limelight (1952),' where he was greeted with great enthusiasm, though with his arrival came the news that the American government had rescinded his re-entry visa into the United States. Over the next few years, the aging filmmaker toyed with numerous ideas for his next film \u0096 including a possible resurrection of the Little Tramp \u0096 before settling upon 'A King in New York,' whose screenplay took about two years to complete. 'A King in New York (1957)' tells the story of King Shahdov (Chaplin), a dethroned monarch who seeks refuge in the United States, his entire wealth cunningly stolen from him. The film starts off as an amiable slapstick comedy, which is basically what I had been expecting, before branching off into darker territory, become a scathing satiric assault on almost everything that America stands for. When he first arrives in the country, King Shahdov revels in the peace and liberty of this grand nation, exclaiming to his dedicated ambassador, Jaume (Oliver Johnston): \"if you knew what it means to breathe this free air. This wonderful, wonderful America. Its youth, its genius, its vitality!\" However, through his relationship with a brilliant young boy, Rupert Macabee (Chaplin's own son, Michael), whose parents happen to be members of the Communist party, Shahdov becomes embroiled in the period's rampant McCarthyist witch-hunts, revealing the devastating truth that perhaps America's notions of freedom have become a mere illusion. Despite Chaplin's insistence that \"my picture isn't political,\" it most undoubtedly is, with the director \u0096 just as he did in the final scenes of 'Monsieur Verdoux (1947)' \u0096 evidently expressing his distaste for what society has become. It's easy to dismiss 'A King in New York' as pro-socialist propaganda, but to do so would be completely missing the very idea behind the film. Personally, I'm unsure of Chaplin's official stance on Communism itself, but the filmmaker certainly reviled the manner in which the United States government approached the issue, citing it as an immoral invasion of privacy and liberty. Chaplin described himself as having no political convictions: \"I am an individualist, and I believe in liberty.\" Perhaps referring to the Hollywood blacklist, he once said: \"These are days of turmoil and strife and bitterness. This is not the day of great artists; this is the day of politics.\" 'A King in New York' was filmed at Shepparton Studios in London, and the film does a very successful job of imitating the hustle-and-bustle of the Big Apple. As well as expressing his stance on McCarthyism, Chaplin also aims a few effective jabs at commercialisation and popular culture, prophetically predicting the prominence of commercial chain-stores, cosmetic surgery and reality television {when King Shahdov is unwittingly coaxed into attending a televised dinner party, continually baffled as to why his lady interest (Dawn Addams) keeps unexpectedly launching into advertisements}. Though my review has stressed the political implications of the film, 'A King in New York' also works pretty well as a light comedy, and I almost died laughing when Chaplin walked into the House Committee on Un-American Activities with a fire-hose attached to his finger. Michael Chaplin's impassioned tirades on the degradation of America were also a riot to watch, even if the young actor can occasionally be spotted mouthing his father's lines. Owing to its somewhat disagreeable stance towards the United States, Chaplin was unable to find any willing American distributors, and so 'A King in New York' remained unseen there until the 1970s. \"Freedom of speech,\" indeed.",
         "This is the best film dealing with the communist witch trials I have ever seen. It is black-comedic spoof on a subject that still hasn't been spoofed enough...the UnAmerican Activities Hearings. Sure it has a funny and effective \"european royalty thrown into American culture\" plot but this film really has more serious and important plans for the viewer.... Watch it and don't feel guilty think",
         "I am pleased to find I'm not the only reviewer who thinks this film is an overlooked part of the Chaplin filmography. It contains some very pungent observations on the American way of life and American society which are still relevant today. Apart from popular culture and materialism, Chaplin takes very careful aim at the \"Reds under the bed\" hysteria of the 1950's (the equivalent of this century's \"war on terror\"). He tells the story through the character of a young boy whose parents are charged with contempt by the HUAC. When the boy goes on the run and finds shelter with King Shahdov he is collected by an apparently kindly and fatherly law officer. Later, however, we see him put under enormous psychological pressure to name his parents' friends (the so-called \"fellow travellers\"). The boy's final appearance is very moving. His school superintendent says \"how well\" Rupert is doing. All we see is someone whose spirit has been broken, and who is tormented by guilt and shame - all in the name of the Land of the Free. This film is very well worth watching, and not just in the context of its own times."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": ["Attica Film Company"],
      "summaries": [
         "Due to a revolution in his country, King Shahdov comes to New York - almost broke. To get some money he goes to TV, making commercials and meets the child from communist parents. Due to this he is suddenly a suspected as a communist himself and has to face one of McCarthy's hearings.",
         "A recently-deposed European monarch seeks shelter in New York City, where he becomes an accidental television celebrity and is later wrongly accused of being a Communist."
      ],
      "budget": 0
   },
   "movielensId": 3640,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1957-10-25",
      "dvdReleaseDate": "2000-05-16",
      "directors": ["Charlie Chaplin"],
      "runtime": 110,
      "movieId": 3640,
      "title": "A King in New York",
      "mpaa": "",
      "actors": [
         "Charlie Chaplin",
         "Maxine Audley",
         "Jerry Desmonde",
         "Oliver Johnston",
         "Dawn Addams",
         "Sid James",
         "Joan Ingram",
         "Michael Chaplin",
         "John McLaren",
         "Phil Brown",
         "Harry Green",
         "Robert Arden",
         "Alan Gifford",
         "Robert Cawdron",
         "George Woodbridge",
         "Clifford Buckton",
         "Vincent Lawson",
         "Shani Wallis",
         "Joy Nichols",
         "Lauri Lupino Lane",
         "George Truzzi"
      ],
      "imdbMovieId": "0050598",
      "originalTitle": "A King in New York",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["1zQ-K64hD0c"],
      "plotSummary": "Due to a revolution in his country, King Shahdov comes to New York - almost broke. To get some money he goes to TV, making commercials and meets the child from communist parents. Due to this he is suddenly a suspected as a communist himself and has to face one of McCarthy's hearings.",
      "tmdbMovieId": 28973,
      "avgRating": 3.31301,
      "releaseYear": "1957",
      "numRatings": 123,
      "posterPath": "/b3z82K4UCHSJR2w8uoBmhl1tOVw.jpg"
   }
}