{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "silent film",
            "id": 154802
         },
         {
            "name": "pearl necklace",
            "id": 164636
         },
         {
            "name": "high society",
            "id": 165282
         },
         {
            "name": "railroad station",
            "id": 185435
         }
      ],
      "imdb_id": "tt0014624",
      "video": false,
      "title": "A Woman of Paris",
      "recommendations": [
         87859,
         147681,
         162186,
         73455,
         42842,
         42984,
         28973,
         157091,
         168947,
         131366,
         147719,
         246193,
         36102,
         46149,
         115647,
         91426,
         70496,
         42718,
         99657,
         110733
      ],
      "backdrop_path": "/fWrMXTxLz4DGjXjpYfwdXMEor1h.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Marie St. Clair",
               "gender": 1,
               "credit_id": "52fe45bfc3a368484e06c9f1",
               "name": "Edna Purviance",
               "profile_path": "/lbu4Ji7ePiozKMfYlAazX6HkHUj.jpg",
               "id": 21301,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Marie's Step-Father",
               "gender": 0,
               "credit_id": "52fe45bfc3a368484e06c9f5",
               "name": "Clarence Geldart",
               "profile_path": null,
               "id": 132320,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Jean Millet",
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06c9f9",
               "name": "Carl Miller",
               "profile_path": null,
               "id": 63378,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Jean's Mother",
               "gender": 0,
               "credit_id": "52fe45bfc3a368484e06c9fd",
               "name": "Lydia Knott",
               "profile_path": null,
               "id": 132321,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Jean's Father",
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06ca01",
               "name": "Charles K. French",
               "profile_path": "/4tt3JVMEDXj2DULJTehQDMFnlnU.jpg",
               "id": 132322,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Pierre Revel",
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06ca05",
               "name": "Adolphe Menjou",
               "profile_path": "/jAZRVhDGvEfRfJgGQCGk1GXMp1C.jpg",
               "id": 14563,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Fifi",
               "gender": 0,
               "credit_id": "52fe45bfc3a368484e06ca09",
               "name": "Betty Morrissey",
               "profile_path": null,
               "id": 132323,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Paulette",
               "gender": 0,
               "credit_id": "52fe45bfc3a368484e06ca0d",
               "name": "Malvina Polo",
               "profile_path": null,
               "id": 132324,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Woman \"Unwrapped\" at Party",
               "gender": 1,
               "credit_id": "52fe45bfc3a368484e06ca47",
               "name": "Bess Flowers",
               "profile_path": "/akbW8jJl8GSXFpixFaobMOqvNv4.jpg",
               "id": 121323,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Station Porter (uncredited)",
               "gender": 2,
               "credit_id": "5402e1250e0a2658d8006d3c",
               "name": "Charlie Chaplin",
               "profile_path": "/pcvSg2LqnyVFel9dPIwTRagpfur.jpg",
               "id": 13848,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06c9e7",
               "name": "Charlie Chaplin",
               "profile_path": "/pcvSg2LqnyVFel9dPIwTRagpfur.jpg",
               "id": 13848,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06c9ed",
               "name": "Charlie Chaplin",
               "profile_path": "/pcvSg2LqnyVFel9dPIwTRagpfur.jpg",
               "id": 13848,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06ca13",
               "name": "Charlie Chaplin",
               "profile_path": "/pcvSg2LqnyVFel9dPIwTRagpfur.jpg",
               "id": 13848,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06ca19",
               "name": "Charlie Chaplin",
               "profile_path": "/pcvSg2LqnyVFel9dPIwTRagpfur.jpg",
               "id": 13848,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45bfc3a368484e06ca1f",
               "name": "Louis F. Gottschalk",
               "profile_path": null,
               "id": 1120149,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45bfc3a368484e06ca25",
               "name": "Fritz Stahlberg",
               "profile_path": null,
               "id": 1120150,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06ca2b",
               "name": "Roland Totheroh",
               "profile_path": null,
               "id": 14020,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "52fe45bfc3a368484e06ca31",
               "name": "Jack Wilson",
               "profile_path": null,
               "id": 148066,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06ca37",
               "name": "Monta Bell",
               "profile_path": null,
               "id": 1024473,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe45bfc3a368484e06ca3d",
               "name": "Charlie Chaplin",
               "profile_path": "/pcvSg2LqnyVFel9dPIwTRagpfur.jpg",
               "id": 13848,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe45bfc3a368484e06ca43",
               "name": "Arthur Stibolt",
               "profile_path": null,
               "id": 1120151,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 3.470476,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 28974,
      "vote_count": 24,
      "budget": 0,
      "overview": "When Marie St. Clair believes she has been jilted by her artist fiance Jean, she decides to leave for Paris on her own. After spending a year in the city as a mistress of the wealthy Pierre Revel, she is reunited with Jean by chance. This leaves her with the choice between a glamorous life in Paris, and the true love she left behind.",
      "similar": [
         19,
         6620,
         74643,
         12153,
         2292,
         81003,
         460793,
         227156,
         82023,
         205601,
         455661,
         458663,
         705,
         96724,
         828,
         9662,
         62214,
         11113,
         251516,
         9833
      ],
      "original_title": "A Woman of Paris: A Drama of Fate",
      "runtime": 78,
      "poster_path": "/8PMhoUySwDPGdKDPKysl6Q5blLo.jpg",
      "spoken_languages": [{
         "name": "No Language",
         "iso_639_1": "xx"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Charles Chaplin Productions",
            "id": 1315,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Regent",
            "id": 11511,
            "origin_country": ""
         }
      ],
      "release_date": "1923-10-01",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Charles Chaplin"],
      "runtime": 78,
      "synopsis": null,
      "writers": ["Charles Chaplin"],
      "originalLanguage": null,
      "imdbLink": "http://www.imdb.com/title/tt0014624/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNjI5MDcxNjE3NF5BMl5BanBnXkFtZTYwNDUyNDg4._V1_SY317_CR10,0,214,317_AL_.jpg",
      "actors": ["Stars: Edna Purviance, Clarence Geldart, Carl Miller | See full cast and crew »"],
      "reviews": [
         "Charles Chaplin is noted for his comedy performances, and deservedly. His direction, though, should be more highly regarded, if only for this one motion picture. Compare the quality of the photography and the smoothness of the editing to, for example, \"The Gold Rush,\" of about the same time. \"A Woman of Paris\" is very modern; \"The Gold Rush\" is downright primitive (but, in spots, brilliant). \"A Woman of Paris\" also shows some admirable acting talent in, really, all the players. Some of the lesser characters are still played beautifully, despite being \"lesser,\" especially Marie's maids and her, more or less, friends, and very especially the masseuse. And the scene where the artist's mother, played by Lydia Knott, bent on revenge, comes upon Marie -- with no words, just body movement and facial expression -- she tells the audience what the proverbial thousand words could not so well. Credit for part of that good acting must, of course, go to the director, but even the best director can't make much of poor actors. Chaplin had very good actors. Adolphe Menjou reached stardom, and deservedly. What a tremendous talent; he could do everything. Edna Purviance should have achieved much more acclaim. She performed admirably, especially in this movie, and she was attractive. Fame is certainly fickle. In some ways, \"A Woman of Paris\" might be written off by a few as \"soap opera.\" But it is well worth watching for the performances and, especially, for the directing.",
         "Finally saw Woman of Paris: this was a legendary film in its day, but mostly because it was virtually never re-released for sixty years after it premiered in 1923, so the legend grew in its absence. The parts of the story that were not told would have made a better movie than the movie, for example why the lovers' fathers at the beginning of the film are against the marriage, and how Marie (Edna Purviance) became a (shudder) \"Woman of Paris\" during the year following her departure from her fiance. So I didn't buy the story but the camera work and editing do marvelous things with the story that is there. The melodramatic climax is a bit much to be believed, but not comical as a lot of silent mellers appear today. A little D.W. Griffith (sophisticated early use of photography to tell story and set mood), a little Tolstoy (\"bad woman\" story contrasted with storyteller's emphasis on happy marriages and wholesome family life), a touch of Dreiser (\"sinful\" characters shown with realistic insight) and I'd guess a soupcon of Terrence Ratigan (sophisticated attitudes) but I doubt he was around then. The ad copy for this film says Chaplin has a cameo as a railway porter but I didn't notice one in the train scene: I suspect instead he was the ticket agent whose hand appears pointing out the ticket window toward the train. Altogether a satisfying and entertaining film, but the story would have been better if Chaplin had worked on it a little longer.",
         "If nothing else, you have to give Charlie Chaplin a lot of credit for taking a shot at something so different from his usual fare. (Though he himself only appears on-screen for a few seconds this time, he did almost everything else in the production.) And while \"A Woman of Paris\" is certainly a cut below his comedy features, it's a pretty good melodrama, and you'd have to think that with experience Chaplin could have gone on to become almost as effective with straight melodrama as he was with his sentimental comedies. It's not really surprising that after this he returned to comedy for good, but that was just to keep audiences happy, not because he couldn't do drama, since this is a decent effort. Chaplin's own frequent lady Edna Purviance is convincing as the young woman whose tangled love affairs pull her away from her true love and into a set of tangled relationships in the empty, decadent world of the Parisian idle classes. Except for being rather contrived - there are far too many coincidences and pat developments in the plot, and they do not work as well in serious drama as they would in a comedy - the story is interesting and fairly creative. It does get a bit heavy at times, since there is very little comic relief, but Adolphe Menjou helps keep it from getting unbearably serious with a good performance as the carefree, irresponsible Pierre. He shows that even without dialogue he can make this kind of character lively and memorable. Since it doesn't quite measure up to the standard of either the best Chaplin features or the best silent melodramas, \"A Woman of Paris\" may not have a niche of its own, except for its historical interest. But it's quite an interesting change of pace from Chaplin, and an above average movie that's worth seeing.",
         "In the 1920s Charlie Chaplin tried to break away from his double dependence on the \"little tramp\" and comedy. His first attempt (still a comedy) was \"The Kid\", where he made Jackie Coogan an equal in the film (althought Chaplin did get higher billing). Then he thought (quite seriously) of starring in a film biography of Napoleon I. There is a photo of him in costume as the Emperor, and Alistair Cooke (in his book \"Six Men\") mentions Chaplin demonstrating a piece of dialog that Napoleon would say regarding \"perfidious Albion\". Later Chaplin would concentrate on his co-star (and lover) Edna Purviance, doing this film and later having a second film called \"The Sea Gull\" that was shot by Joseph Von Sternberg but never released. The poor box office of this film, \"A Woman Of Paris\" really ended the attempts. Chaplin was a good businessman, and the bottom line was box office. So his next film returned to the tramp - \"The Gold Rush\". \"A Woman Of Paris\" is a well made movie, and never fails to hold one's interest, particularly watching the budding elegant career of Adolphe Menjou. His Pierre Revel is a perfect boulevardier type - he dresses well, knows how to order great food (truffles), and is cynical separating a financial/socially promising marriage from continuing seeing his mistress Purviance. Edna is from the French countryside, and wants luxury and financial security. She also wanted to marry Jean Millet (Carl Miller) but the death of his father on the night they were to elope causes him to miss the planned elopement - and she leaves for Paris. We follow her there and her reunion with Miller - which leads to tragedy. Belatedly realizing what she has lost, Edna goes back to the countryside to assist Miller's mother (Lydia Knott) in charity work. The conclusion where she is happily riding home on a horse and wagon, while a fast touring car (with Menjou in it) drives by without seeing her is wonderful - Menjou was just asked by a friend whatever happened to Purviance, and he shrugs his shoulders. Purviance is competent but not much more. Her success in Chaplin's comedies was as a reactor to Charlie, not as the creator of humor. She's not Mabel Normand, who was a clever comedienne. Miller is good, but stiff (possibly due to the character's limitations - Chaplin rarely tried to make a Pierrot character who was not the self-sufficient tramp). The best thing about Miller's character is his talent for painting. One final note - Henry Bergmann who was one of Chaplin's regular actors (sometimes playing fat women, but he played other roles as well) is the head waiter at a posh restaurant Menjou takes Purviance. His indignation at a junior waiter \"trying to muscle in\" on this rich, big tipping special customer are quite funny. Not the greatest Chaplin film work, but worth watching.",
         "A Woman of Paris is probably best known, ironically, by the fact that it is a Chaplin film that Chaplin does not appear in. It opens with a title card in which Chaplin himself wishes to clear up any misunderstanding by mentioning that he does not appear in the film, but my understanding is that it was a popular and critical failure at the time of its release. He does appear in the film, but walks on and off screen so fast and looks so little like himself that there is really no reason for him to be there. The film's popular failure seems to have been something that plagued him through the rest of his career, since he returned to the film and re-scored it at the age of 87. It was the last work he ever did as a filmmaker, and the result was that people finally recognized the film for the master work that it is. We meet a young woman whose father keeps her in the house under lock and key, but who nevertheless escapes at night to visit her lover, whom she plans to marry. One night, her father sees her leaving, and then locks her out. He then proceeds over-react to the point where he won't allow her in the house, so she is forced to try to go find a place to stay at her boyfriend's house. It is a curious illustration of 1920s society that his parents want to kick her out of the house as though she were a diseased rodent. They are committing an unpardonable sin by being together at night outside of marriage. It's easy to sympathize with their desperate situation. Soon, tragedy strikes, which leads to a tragic misunderstanding which, I have to say, is not presented very well in the movie. This is, however, probably the film's only weak point. I had to wonder why this even allowed for a level of misunderstanding that enabled her to move to Paris and join high society without ever talking to the man for long enough for him to explain what happened. It's also a little strange that they both appear to be in their mid-30s or so and are yet not only unmarried but still live with their parents. Nevertheless, she joins a wealthy social circle and becomes involved in their wealthy and loveless life, surrounded by rich people in constant leisure, smoking cigars, drinking champagne, and eating truffles (\"a delicacy for pigs and gentlemen\u0085\"). It is inevitable that they will meet again at some point, and when they do, time has, indeed, made strangers of them, but his love is still alive. He has become an accomplished artist and she hires him to paint her portrait, which again intertwines their lives. It is interesting that he is still mourning the death of his father, even years later. But he comes from a world where relationships are extremely important, whether romantic or family, and she, on the other hand, has entered a world of money where relationships are startlingly meaningless. She drags her feet at talking about the history between them, saying that she doesn't want to dig up the past, while he interestingly looks directly at the camera and explains that he is still badly hurt by what has happened. Soon, she is forced to choose between a life of love or a life of luxury, and it is notable that the rich man that she was in a \"relationship\" is pointedly indifferent when she leaves him, explaining that he'll never see her again. \"Okay, phone me sometime,\" he says as he casually walks out the door, leaving her to do as she will. Soon, things seem to be looking up for their mutual happiness, but another tragic misunderstanding (or at least badly timed conversation), throws everything into chaos again. When she leaves, Jean, her boyfriend, becomes desperate. The ending of the film is deeply symbolic, and involved a long road, like the ending of some of Chaplin's better known short comedies. The film's message, that time heals and the secret of happiness is in service to others, doesn't need to be delivered as directly as it is, but it also doesn't hurt the movie that this happens. It's a deeply moving story that illustrates an unfortunate aspect of a certain level of society, a level about which Chaplin was certainly no stranger. It is definitely, as the title says, a drama of fate, and makes a strong comment about what is important in life. It's interesting to consider Chaplin's personal life at the time that the movie was made, but I think it's more important to let the film stand on it's own. This is a brilliant piece of film-making.",
         "This film was not accepted by the public when it debuted, as it was only directed by Charlie Chaplin and it was not a comedy. Yes, he does appear VERY briefly in a tiny cameo, but other than that you'd hardly know it was his film. Edna Purviance, a long-time co-star in many of Chaplin's shorts, is the star of this melodrama. Adolph Menjou is an amoral playboy who loves her--mostly for her body. Carl Miller is the old boyfriend who apparently has a very poorly defined role in the film and ultimately kills himself. In some ways, the movie is quite in advance of its time--taking on topics such as a sexually liberated woman and suicide. But, it also has its feet firmly grounded in the overly melodramatic past, with its occasion over-the-top script and its very old fashioned ending. The film has excellent direction and cinematography. In addition, just before his death, Chaplin re-edited the film--adding a new score he wrote himself (something he did for most of his features). A beautiful to look at but just a little bit too old fashioned melodrama. It's worth a look for the curious, but it not an exceptional film--and I think that's what America and the world expected from this film genius.",
         "A Woman Of Paris was an acclaimed success with the critics when it was Originally released on 1st October 1923. However, the audience despised it as they wanted to see Charlie Chaplin the tramp starring in a film not a film directed by Chaplin in which he does not appear (albeit in a small cameo role). When i first saw the film on BBC2 around Christmas 1998 i thought Chaplin had a starring role so was naturally disappointed when i found out this wasn't the case. However, since then i have become a huge fan of Chaplin and all his work so now I think this film is rated among Chaplin's best features. His musical score composed in 1976 with Eric Rogers was Chaplin's last ever work in his film career which spanned 62 years. By 1976 Chaplin was very frail and struggled to communicate so the fact that he could compose the music for a near 80 minute film is amazing and the fact that the music score is as good as any of his other films is also astonishing. Charles Chaplin was a true genius of Cinema and A Woman Of Paris is an excellent example of Chaplin as director, writer and composer.",
         "The second film in my somewhat unusual Charles Chaplin double feature (after the delightfully black 'Monsieur Verdoux (1947)'), 'A Woman of Paris' is perhaps the silent comedy master's least mentioned film, perhaps partly due to it not actually being a comedy, or because Chaplin himself appears only in a very brief cameo role. His first and, I'll venture, his only strictly dramatic feature, the film traces the romantic dilemma of a young French woman living in Paris. It was Chaplin's first film with United Artists \u0096 which he had founded in 1919 with Douglas Fairbanks, Mary Pickford and D.W. Griffith. Originally entitled 'Public Opinion' and then 'Destiny,' Chaplin considered a dozen more titles before he finally settled on a name. Marie St. Clair (Edna Purviance) and her romance Jean Millet (Clarence Geldart), an aspiring artist, residents of a small French village, have plans to move to Paris and get married. However, unfortunate circumstances delay their plans, and Marie impulsively boards the train without Jean. A year or so later, Marie has assimilated into the upper-class lifestyle of Paris, having become the mistress of a wealthy, cynical businessman, Pierre Revel (Adolphe Menjou). It is then that she and Jean suddenly meet again. Though there are undoubtedly still feelings between them, Marie must decide whether she can sacrifice all of Pierre's luxuries to pursue the man that she loves. Written, produced and directed by Chaplin, 'A Woman of Paris' is a tightly-paced drama/romance, employing a lot of dialogue (somewhat unusual for Chaplin, who usually relied on extended slapstick comedic set pieces to drive his silent films) and a three-way relationship that has since become commonplace in films of this sort. The film allowed Chaplin to extend his skills beyond the realm of the lovable little Tramp. Unfortunately, this seemingly was not what audiences wanted. Perhaps perceived as a harmful satire of the American way of life, 'A Woman of Paris' was banned in several US states on the grounds of immorality, and it was a commercial flop. Chaplin had conceived the film as a means of launching the individual acting career of Edna Purviance, though this bid was unsuccessful. It did, however, make an international star of Adolphe Menjou. Many critics, despite the poor box office performance, praised the film's startling realism. Notably, director Michael Powell ('Black Narcissus,' 'Peeping Tom') cited 'A Woman of Paris' as his greatest inspiration to become a filmmaker. In 1976, a frail Charles Chaplin \u0096 just one year before his death \u0096 reissued the edited film with a new musical score he had composed, aided by music arranger Eric James. A criminally underrated silent classic, 'A Woman of Paris' is yet another testament to Chaplin's undeniable cinematic genius.",
         "I don't understand how \"A Woman of Paris\" has received a good deal of bad publicity. Sure, it may have been because Chaplin wasn't in it, but I found the movie to be pretty good. The plot itself isn't all that exciting, considering the basic love triangle has been overused in recent years, but in 1923, this was fairly new- for movies at least. I enjoyed highly \"A Woman of Paris\". Adolphe Menjou is fantastic as a rich, snobbish, playboy who treats women like toys. Edna Purviance did good as well. Some may say that her character was \"confused\". Well, yes. When you're in love, you do strange things. Same thing applies to anger. Marie St. Clair simply was in love with Jean and had feelings for Pierre. She didn't know what she wanted, though. Did she want luxury or did she want true love. She obviously chose true love, even if didn't mean physically being with Jean. Great movie!",
         "Have to give this film a BIG TEN, it is a wonderful look back into the 20's when things were silent on the big screen and it was a different generation than 2000 plus. In those days everything was Radio and the Film Studio's. This is a great production by Charlie Chaplin and his mistress Edna, who was the love of his life, Edna Purviance. The story is about a young man who falls in love with a young gal and his dad and mom disapprove and at the same time tragedy hits the young man's family and he misses out on a very important date. Years go by and the young man still hangs on to his mother and finally meets up with the young gal he was deeply in love with years ago. Charlie Chaplin, produced, directed and composed the music for this film and did have a brief walk on appearance in the film. The public at the time were disappointed in this film, because Chaplin did not appear in the film, which he should have. In real life Charlie should have married Edna Purviance and ended all the scandal he created. This is too great a Classic film to find fault or criticize a masterpiece of the 1920's."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Charles Chaplin Productions",
         "Regent"
      ],
      "summaries": [
         "Marie St. Clair believes she has been jilted by her artist fiance Jean when he fails to meet her at the railway station. She goes off to Paris alone. A year later, mistress of wealthy Pierre Revel, she meets Jean again. Misinterpreting events she bounces back and forth between apparent security and true love.",
         "A kept woman runs into her one-time fiancé and finds herself torn between love and comfort."
      ],
      "budget": 351000
   },
   "movielensId": 3641,
   "movielens": {
      "languages": ["No Language"],
      "releaseDate": "1923-10-01",
      "dvdReleaseDate": "2000-05-16",
      "directors": ["Charlie Chaplin"],
      "runtime": 78,
      "movieId": 3641,
      "title": "A Woman of Paris",
      "mpaa": "",
      "actors": [
         "Edna Purviance",
         "Clarence Geldart",
         "Carl Miller",
         "Lydia Knott",
         "Charles K. French",
         "Adolphe Menjou",
         "Betty Morrissey",
         "Malvina Polo",
         "Bess Flowers",
         "Charlie Chaplin"
      ],
      "imdbMovieId": "0014624",
      "originalTitle": "A Woman of Paris: A Drama of Fate",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "When Marie St. Clair believes she has been jilted by her artist fiance Jean, she decides to leave for Paris on her own. After spending a year in the city as a mistress of the wealthy Pierre Revel, she is reunited with Jean by chance. This leaves her with the choice between a glamorous life in Paris, and the true love she left behind.",
      "tmdbMovieId": 28974,
      "avgRating": 3.37209,
      "releaseYear": "1923",
      "numRatings": 86,
      "posterPath": "/8PMhoUySwDPGdKDPKysl6Q5blLo.jpg"
   }
}