{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "individual",
            "id": 30
         },
         {
            "name": "paris",
            "id": 90
         },
         {
            "name": "algerienkrieg",
            "id": 2506
         },
         {
            "name": "cancer",
            "id": 10163
         },
         {
            "name": "singer",
            "id": 10229
         },
         {
            "name": "nouvelle vague",
            "id": 155518
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0055852",
      "video": false,
      "title": "Cléo from 5 to 7",
      "recommendations": [
         15244,
         4495,
         38360,
         31217,
         44018,
         778,
         30017,
         2912,
         5801,
         776,
         20532,
         800,
         20108,
         896,
         216,
         897,
         11602,
         44065,
         9797,
         27019
      ],
      "backdrop_path": "/ucq13Todio2v1N3sQOJqtXQD4EA.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "talisencrw",
         "id": "5711b8479251413174000094",
         "content": "When I think of interesting filmmakers, the world over, whose movies are always a pleasure to watch, I thank God every day for Agnès Varda. I had her '4 Films by' Criterion boxed set, seemingly forever, left unwatched, and I don't really know why. Perhaps I felt her films wouldn't excite me enough, I don't know. I certainly enjoy foreign, and French, filmmaking enough. Maybe it was because she was female, I don't know. I hope not, but I'm simply being honest. Sometimes I'm apprehensive about starting to investigate the works of a director who's different from me: Female, non-English, non-Caucasian. I think it's difficult for me to start, because I'm afraid that I won't be able to fully emphasize with their sphere of reference, and thus won't be able to either appreciate or enjoy the filmic experience as much as I should. Once I start, and watch that first film I see of theirs, I'm fine. But until that point, it's truly a challenge.\r\n\r\nMy university library had her two recent critically-acclaimed films, 'The Gleaners and I' and its sequel, on one DVD, and one of my favourite critics, Roger Ebert, had made a 'Great Movie' article about the original. So I gave that series a viewing, each film a separate night, and I fell in love with her as a person, and found that her films were not going to be a challenge for me at all. Thus I then turned to my previously-imposing, aforementioned boxed set, and went through it chronologically.\r\n\r\nThis, the second film of the set, was extraordinary, basically a real-time cinematic exercise of a lady who is waiting for the results of a biopsy, and thus wondering if her quality of life is going to be seriously challenged or not. In it, as I've found in all of her films so far, there's an extraordinary visual flair, a great and natural storytelling facility present, and you can really tell that Varda both loves people and is glad to be alive, and it shows in everything she does. If you are in a similar boat, and are reluctant to investigate Varda's works, please do yourself a favour and don't hesitate any longer. Appreciate this extraordinary woman and her work while she is still alive. You will never be the same.",
         "url": "https://www.themoviedb.org/review/5711b8479251413174000094"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Cléo Victoire, Florence",
               "gender": 1,
               "credit_id": "52fe424ac3a36847f8012c65",
               "name": "Corinne Marchand",
               "profile_path": "/1PDv2xR3qze2J9F1biHRBSmfUDu.jpg",
               "id": 7565,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Antoine",
               "gender": 0,
               "credit_id": "52fe424ac3a36847f8012c69",
               "name": "Antoine Bourseiller",
               "profile_path": null,
               "id": 7566,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Angèle",
               "gender": 1,
               "credit_id": "52fe424ac3a36847f8012c6d",
               "name": "Dominique Davray",
               "profile_path": "/7OdDW0wgQ4O32ihZxuof9F62Kff.jpg",
               "id": 7568,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Dorothée",
               "gender": 0,
               "credit_id": "52fe424ac3a36847f8012c71",
               "name": "Dorothée Blanck",
               "profile_path": null,
               "id": 1151713,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "Bob, the Pianist",
               "gender": 2,
               "credit_id": "54d48a469251413fc10139c0",
               "name": "Michel Legrand",
               "profile_path": "/ewYlyU0UvONnt7jjHhaSXCKVHVa.jpg",
               "id": 10934,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "The Lover",
               "gender": 0,
               "credit_id": "54d48a5e9251417c23009cd4",
               "name": "José Luis de Vilallonga",
               "profile_path": null,
               "id": 590099,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Irma",
               "gender": 0,
               "credit_id": "54d48a789251413fd6013da3",
               "name": "Loye Payen",
               "profile_path": null,
               "id": 1423674,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe424ac3a36847f8012c55",
               "name": "Agnès Varda",
               "profile_path": "/zfStaPgZo9aAHUH4sntmnpRcldd.jpg",
               "id": 6817,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe424ac3a36847f8012c5b",
               "name": "Agnès Varda",
               "profile_path": "/zfStaPgZo9aAHUH4sntmnpRcldd.jpg",
               "id": 6817,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "54d488e79251417a0400a78b",
               "name": "Agnès Varda",
               "profile_path": "/zfStaPgZo9aAHUH4sntmnpRcldd.jpg",
               "id": 6817,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "54d488d39251417c23009cb3",
               "name": "Michel Legrand",
               "profile_path": "/ewYlyU0UvONnt7jjHhaSXCKVHVa.jpg",
               "id": 10934,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "54d4896e92514173cf008216",
               "name": "Jean Rabier",
               "profile_path": "/29EbAiWCdqcvhjpcaNZZ93fF2mO.jpg",
               "id": 19086,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "54d489aec3a368616e0129b3",
               "name": "Bernard Evein",
               "profile_path": null,
               "id": 24296,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "54d489bac3a3686ac201261d",
               "name": "Jean-François Adam",
               "profile_path": null,
               "id": 3538,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "54d489f4c3a3686abc01329d",
               "name": "Alyette Samazeuilh",
               "profile_path": null,
               "id": 1423673,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "54d48a15c3a3686abc0132aa",
               "name": "Georges de Beauregard",
               "profile_path": null,
               "id": 3779,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "54d48a219251413fd6013d96",
               "name": "Carlo Ponti",
               "profile_path": "/zgCkHXt5HdXjaiIk8kOcZyQJlZh.jpg",
               "id": 3778,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 5.338974,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         }
      ],
      "id": 499,
      "vote_count": 78,
      "budget": 0,
      "overview": "Agnès Varda eloquently captures Paris in the sixties with this real-time portrait of a singer set adrift in the city as she awaits test results of a biopsy. A chronicle of the minutes of one woman’s life, Cléo from 5 to 7 is a spirited mix of vivid vérité and melodrama, featuring a score by Michel Legrand and cameos by Jean-Luc Godard and Anna Karina.",
      "similar": [
         147,
         5781,
         40807,
         112160,
         858,
         141,
         254470,
         587,
         634,
         437557,
         340666,
         242224,
         255,
         43923,
         6637,
         297762,
         1826,
         527,
         546,
         27586
      ],
      "original_title": "Cléo de cinq à sept",
      "runtime": 90,
      "poster_path": "/uLFAS8ySyjHWkkupotAIEnVzd1J.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Ciné Tamaris",
            "id": 14683,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Rome Paris Films",
            "id": 109,
            "origin_country": ""
         }
      ],
      "release_date": "1962-04-11",
      "vote_average": 7.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Agnès Varda"],
      "runtime": 90,
      "synopsis": null,
      "writers": ["Agnès Varda"],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0055852/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ5Njk1NzE2N15BMl5BanBnXkFtZTgwMzUyNTM3MjE@._V1_SY317_CR11,0,214,317_AL_.jpg",
      "actors": ["Stars: Corinne Marchand, Antoine Bourseiller, Dominique Davray | See full cast and crew »"],
      "reviews": [
         "Cleo. The woman who is in practically every scene, whether in front of the camera, nervous and flighty, or behind it as it seems to follow her and allow us to know how the world affects her internally. Agnes Varda is the woman behind Cleo, the one who brings us a unique vision of a woman in suspended animation waiting for her medical diagnosis (and subsequent fate). In 90 minutes of real time, she introduces us, first in color (to specify an incident which will preside over all that follows), then in smooth black and white, to the world of this young woman (played by Corinne Marchand) who by the threat of possible death in the future slowly begins a road to a certain self-discovery which will leave her changed at the end. As a matter of fact, Death, one of the cards in the Tarot, features largely throughout without actually coming forth menacingly, but staying quietly, unnoticed, in the background. While everything surrounding Cleo teems of life -- her own apartment, the streets and cafés of Paris -- she in turn seems to be living under the shadow of her own death and superstitions (fed by Angele) and goes from emotional to emotion as if she were to cease to exist at any moment. It is only once she leaves her own confining place and takes to the street that she begins to evolve, and Death seems less and less the threat and more the Thing to conquer. Characters like Dorothee and Antoine only reinforce this in their appearances -- Dorothee by telling her she doesn't believe in superstitions (therefore disproving the psychic's dire predictions at the beginning of the story), Antoine by reinforcing Cleo that since her actual name is Florence, she is Summer, and therefore, Life.",
         "While waiting for the result of a biopsy, the French singer Florence \"Cleo\" (Corinne Marchand) visits the Tarot fortune-teller Irma (Loye Payen); drinks a coffee and buys a new hat with her maid Angèle (Dominique Davray); is visited by her lover (José Luix de Villalonga) and her composers Bob (Michel Legrand) and Plumitif (Serge Kober); visits her model friend Dorothée (Dorothée Blank); and meets and has a brief affair with the military Antoine (Antoinne Bourseiller). Finally she meets Dr. Valineau (Robert Postec), who gives her diagnosis. This is the first movie I see of the Belgium director Agnès Varda, who is considered the \"grandmother\" of the French movement Nouvelle Vague. This wonderful original movie actually has the style of the Nouvelle Vague, with the camera following the characters on the streets and common people looking to the camera. I liked the story, developed in real time, a lot, and I believe it is an ode to life, showing along one hour and half, how life is so important although composed by little fragments and feelings. Along this period, you can meet a lover, friends, work or find a new love, be futile or thoughtful, but you are living. This is the message of this great movie: enjoy life, as if it were the last two hours you have. My vote is eight. Title (Brazil): \"Cleo das 5 às 7\" (\"Cleo from 5 to 7\")",
         "This film is a perfect example of why I love French film. In a word, realism. In many words, the desire to capture life's most important, daring, fanciful, yet haphazard moments with the faith that by doing so you are illustrating a timeless notion. Cleo from 5 to 7 plucks a single string from a singer's life and by pulling at it, illustrates the fabric of the beautiful and unique, but predetermined world that it is woven into. What illustrates this best is the third scene of the movie when the heroine flits about a local shop browsing hats. The camera shows her shopping but also captures many reflections that expose the larger world around her. The window pane showcases soldiers marching by, foreshadowing the war in Algiers. The mirrors take snapshots of Cleo with different head-dresses all be-speaking a future she won't choose. In the background, her maid sits disapprovingly. Small details like these, that are often neglected in other movies, are the backbone of this work of art. Cleo from 5 to 7 is a movie about much more than two hours in the lead character's life. It is about the character's whole life as illustrated by two hours. Like Joyce's Uylsses, it finds parallels between the struggles of a day with the struggles of a life.",
         "\"Cleo from 5 to 7\" tells the story of a young French singer, who fears that she may be seriously ill. What could have been maudlin \"movie of the week\" soap opera, is transformed by Agnes Varda into a unique movie experience. The film contrasts Cleo's fear of death with the teeming life of the Paris streets, where street entertainers swallow live frogs and puncture their biceps; and the more normal members of the crowd busy themselves with the usual affairs of business and the heart. A large amount of the film takes place outdoors, with Cleo and the people in her life always walking, running or driving. There is a wonderful scene of Cleo-Distraught over an ominous tarot reading by the fortune teller- descending a circular staircase, her shoe heels clicking out a counterpoint to Michel Legrand's pensive music. Sometimes just watching the way someone moves is very revealing. Director Varda has a fluid camera style which enlivens every scene. As often happens in European art films the story unfolds in a slow undramatic fashion, but their is so much going on in the image and the text, that you don't mind. Essential viewing.",
         "One of the most remarkable documents from cinema's Renaissance, the French New Wave, criminally unsung, probably because it's by a woman. On paper the film seems schematic - in the first half a popular singer fears she has cancer, but tries to continue her flippant lifestyle; in the second, she realises the shallowness of her life, rejects frippery, and begins to look at the world properly. But as a viewing experience, we are given unprecedented access into the emotional workings of a heroine's mind. The film is a mixture of the spontaneous (the lingering wading through the Paris streets, its cafes, crowds, cinemas, street theatres etc.), formal elegance (the extraordinarily complex Ophulsian camerawork, best seen when Cleo visits the hat shop; the play with mirrors and frames) and an Expressionist sensibility (much of what Cleo sees is not 'realistic' observation, but highly coloured by her experiences. The ending is surprisingly bracing considering its open-ended shadow of death.",
         "To me, this is a movie about looking on the bright side of life... from the point of view of someone who isn't. We follow Cleo, a beautiful singer, through a day of her life (from 5:00 to 7:00) as she waits to find out if she has cancer. It's a very simple plot, and I think this simplicity is what allows the film to show Cleo's inner turmoil so well. This movie has strong existential undertones. In the beginning of the film, Cleo believes her fate is just that: fate. She is superstitious to the point of paranoia. Through the course of the film, she discovers that she is in control of her own life, and even in something that seems out of her control -- like cancer -- she has the freedom to decide how she will look at it and whether or not she will let it ruin her life.",
         "First scene (shot in color):Cleo visits the fortune-teller:ignorance,confusion.Last scene:Cleo is a responsible woman now,she's ready to cope with a not-so-rose future:enlightenment. Between the scenes ,one hour and a half (the title is a misnomer).Historically,it's not the first film whose story unfolds in real time (see Robert Wise:the set up).But the concept is here totally mastered. At the beginning of the movie,Cleo is a precious,soft ,selfish young girl.The fortune-teller epitomizes naïvete,a non-scientific attitude.And however,the lady says something important when Cleo draws a skeleton from the tarot pack:\"do not panic,the arms and the legs are still covered with flesh.Your own being is about to change deeply.\" The fortune tells that to comfort Cleo -later she'll tell her husband \"cards say \"death!\",and as for me I've seen cancer\"-and the end would prove she was right though. After leaving the fortune-teller,Cleo meets some people ,most of them indifferent,she cannot communicate her anguish to any of them.Everybody' s busy about himself.They listen to her,but they can't hear her. Then she takes her black glasses off!It's a symbol,now she's ready to see the world as it is.She meets Antoine ,he's a soldier about to return to Algeria to fight in a dirty war.Both are afraid,both have found the comfort they needed so!Now Cleo has opened up,she can face the terrible illness.\"I'm not afraid anymore,she says,I think that I'm happy\"",
         "Cleo, a young singer in Paris, visits a woman who reads Taro cards. It's clear to the seer that Cleo's future is an enigma, at best, judging by the cards she has picked. When Cleo goes, she even tells her husband she has just seen death, and what's more, cancer, being the cause of it, which is what the young woman fears the most. What follows is Cleo trying to make sense of her life before she hears the inevitable fate she fears. Cleo runs into friends and goes all over Paris at a feverish pace, not knowing what will her doctor tell her is the cause that brought her to see him in the first place. At the same time, Cleo never appears to really be concerned, or evidently has made up her mind about the worst case scenario of her medical condition. It is not until almost the end of the film that Cleo runs into the kind soldier, Antoine, in the park. He is concerned about the conflict in Algeria. Antoine too, must face an uncertain future because he will be sent to fight. Antoine turns out one of the best things that happen to Cleo because of his positive outlook at a time when she feels despondent because of what appears it will be a death sentence. Agnes Varda, a director with a large trajectory in the French cinema, was at her best when she undertook this project. Ms. Varda, a feminist, never received her due by the same people that went to praise her male contemporaries. The film shows the contrast between a Cleo that is expecting such dire news and the life of the city around her. Ms. Varda employed three men to capture the magnificence of the city of Paris as Cleo goes through different parts of the city. This is a Paris that is not the sort of touristy version one is accustomed to seeing in some other glossy pictures. Thus, the black and white cinematography of Paul Bonis, Alain Levent and Jean Rabier show in vivid detail a city alive and in all its splendor while the main character is having doubts about what life has for her in store. Corinne Marchand is perfect as the young Cleo. Ms. Marchand is about the best thing in the film. She is always at the center of almost every frame in the picture. Antoine Bourseiller who appears as Antoine makes a tremendous contribution even when he is only seen at the last moments of the movie. Dominique Davray, Dorothee Blank, have good moments. Michel Legrand shows up as a pianist, as well as the composer of the musical score. \"Cleo de 5 a 7\" is also a fun film where to watch such French film stars as Anna Karina, Yves Robert, Jean-Claude Brially, Danielle Delorme, Sami Frey, the excellent Eddie Constantine, and even Jean-Luc Goddard appear in cameos. In a way, Agnes Varda pays tribute to Mr. Godard by imitating his style in the way she conceives the film. This 1960 film shows the talented Agnes Varda on her own merits in a film that is a tribute to life itself.",
         "I loved this film. I wasn't expecting to, but from the very beginning you are drawn into Cleo's world. You understand a woman whom nobody understands, something that is extremely hard to do but Agnes Varda carries it off beautifully. Her coworkers don't care for her, her lover isn't really in-tune with her life, and her best friend likes her, but is busy with her own life. It isn't until she meets the someone new, someone who like herself is about to face a real danger, that she not only faces her problem, but can in a sense conquer it. It's not an easy film to explain, but it's beautifully done and a true winner. I heard that they want to remake it with Madonna. It would be nice for it to be in English, but a remake isn't necessary. They certainly got it right the first time.",
         "Like any of Agnès Varda's movies, this one displays all her talents as a filmmaker: a strong story to contrast the 'flighty' main character; her playfulness with form, which later became a common technique for Godard's and Truffaut's as well as other French New Wave filmmakers; the same playfulness in casting, as in having the great composer Michel Legrand as Cléo's pop- song writer, or the cameo appearance of Godard, all wonderful, unpretentious and charming moments, inter-leaved within the worries of the narcissistic main character, Cléo. The movie is less existential than it is about life, and Varda has masterfully juxtaposed a range of moments and emotions and situations to create a true classic with Cléo's day from 5 to 7."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Music"
      ],
      "productionCompanies": [
         "Ciné Tamaris",
         "Rome Paris Films"
      ],
      "summaries": [
         "This movie shows us Cléo, a French singer, who is afraid of getting the result of a test from her doctor. She believes that she has cancer and will die of the disease. We follow her for two hours while she cruises through the streets of Paris. At the end, she meets a soldier who is going to the war in Algeria the next day.",
         "While waiting for the result of a biopsy, the French singer Cléo, aka Florence, visits a fortune teller; drinks coffee and buys a new hat with her housekeeper; is visited by her lover and her composers; visits her model friend; and meets and has a brief affair with a military man. Finally, she meets her doctor who gives her his diagnosis.",
         "An hour and a half (despite the title) of the life of a singer who learns she is merely being put on display. She visits a fortune teller who predicts stomach cancer (although after she has left), which is what she is afraid of what she might be dying. During this period, she meets with her boyfriend in a room full of cats and swings, then her composers in the same place. After deciding to work against the capriciousness with which the composers pigeonhole her, she puts on a black dress, takes off her wig, and tries to see things from a different perspective, learning much from her friend Dorothée, who poses nude for sculptors, and a passing soldier named Antoine."
      ],
      "budget": 0
   },
   "movielensId": 3645,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1962-04-11",
      "dvdReleaseDate": "2000-05-16",
      "directors": ["Agnès Varda"],
      "runtime": 90,
      "movieId": 3645,
      "title": "Cléo from 5 to 7",
      "mpaa": "",
      "actors": [
         "Corinne Marchand",
         "Antoine Bourseiller",
         "Dominique Davray",
         "Dorothée Blanck",
         "Michel Legrand",
         "José Luis de Vilallonga",
         "Loye Payen"
      ],
      "imdbMovieId": "0055852",
      "originalTitle": "Cléo de cinq à sept",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": [
         "sdjskdSjzhw",
         "jqNw-zaM6r4"
      ],
      "plotSummary": "Agnès Varda eloquently captures Paris in the sixties with this real-time portrait of a singer set adrift in the city as she awaits test results of a biopsy. A chronicle of the minutes of one woman’s life, Cléo from 5 to 7 is a spirited mix of vivid vérité and melodrama, featuring a score by Michel Legrand and cameos by Jean-Luc Godard and Anna Karina.",
      "tmdbMovieId": 499,
      "avgRating": 3.84685,
      "releaseYear": "1962",
      "numRatings": 333,
      "posterPath": "/uLFAS8ySyjHWkkupotAIEnVzd1J.jpg"
   }
}