{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "himalaya",
            "id": 486
         },
         {
            "name": "expedition",
            "id": 1963
         },
         {
            "name": "mystic",
            "id": 2795
         },
         {
            "name": "yeti",
            "id": 8873
         },
         {
            "name": "cryptozoology",
            "id": 11220
         },
         {
            "name": "cult film",
            "id": 34117
         },
         {
            "name": "monastery",
            "id": 41592
         },
         {
            "name": "mountain climbing",
            "id": 159212
         },
         {
            "name": "avalanche",
            "id": 162327
         }
      ],
      "imdb_id": "tt0050095",
      "video": false,
      "title": "The Abominable Snowman",
      "recommendations": [
         28752,
         18990,
         27003,
         3127,
         39044,
         28667,
         26865,
         43010,
         3145,
         119586,
         84719,
         28426,
         29468,
         43033,
         39263,
         3484,
         3104,
         3079,
         26278,
         3103
      ],
      "backdrop_path": "/ujfEeymR8FRC1RMp2hzWO6v1eLq.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Tom Friend",
               "gender": 0,
               "credit_id": "52fe46889251416c9105779f",
               "name": "Forrest Tucker",
               "profile_path": "/yqdE1cqCXWhLTgIRHDgqHJMrJlY.jpg",
               "id": 41214,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Dr. John Rollason",
               "gender": 2,
               "credit_id": "52fe46889251416c910577a3",
               "name": "Peter Cushing",
               "profile_path": "/1qtKVu16REL2YLVrhayjVey4al.jpg",
               "id": 5,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Lhama",
               "gender": 2,
               "credit_id": "54e4ebb292514109f700006a",
               "name": "Arnold Marlé",
               "profile_path": "/lAo0qUsGFk6wFulVMOgMH5IsoZP.jpg",
               "id": 101939,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Helen Rollason",
               "gender": 1,
               "credit_id": "52fe46889251416c910577a7",
               "name": "Maureen Connell",
               "profile_path": "/85K16vnxrNdukdCk5BHucX6JR1L.jpg",
               "id": 119369,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Dr. Peter Fox",
               "gender": 2,
               "credit_id": "52fe46889251416c910577ab",
               "name": "Richard Wattis",
               "profile_path": "/hLD8EPfIER8JwlCWclUEWqjAuz5.jpg",
               "id": 85935,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Edward Shelley",
               "gender": 2,
               "credit_id": "52fe46889251416c910577af",
               "name": "Robert Brown",
               "profile_path": "/8L1cp6Py2YCC5LdmWbJcyry4swZ.jpg",
               "id": 10513,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Andrew McNee",
               "gender": 0,
               "credit_id": "54e4eb8cc3a3682b0800007e",
               "name": "Michael Brill",
               "profile_path": null,
               "id": 1428673,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Kusang",
               "gender": 0,
               "credit_id": "54e4eb999251410a0300004f",
               "name": "Wolfe Morris",
               "profile_path": null,
               "id": 73982,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Majordomo",
               "gender": 0,
               "credit_id": "54e4ebc292514109f9000057",
               "name": "Anthony Chinn",
               "profile_path": "/vDan4SUtiJ8HXD4GWREqg090Vjv.jpg",
               "id": 1211876,
               "order": 8
            },
            {
               "cast_id": 23,
               "character": "Yeti (face)",
               "gender": 2,
               "credit_id": "56c7d4a1925141172f001177",
               "name": "Fred Johnson",
               "profile_path": null,
               "id": 89898,
               "order": 9
            },
            {
               "cast_id": 24,
               "character": "Yeti",
               "gender": 0,
               "credit_id": "56c7d4acc3a3684087001338",
               "name": "Jack Easton",
               "profile_path": null,
               "id": 1471663,
               "order": 10
            },
            {
               "cast_id": 25,
               "character": "Yeti",
               "gender": 0,
               "credit_id": "56c7d4b99251411ea8001080",
               "name": "Joe Powell",
               "profile_path": null,
               "id": 1580388,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46889251416c9105778f",
               "name": "Val Guest",
               "profile_path": "/99rZHWC9WKCyVgFLpBy1fKDkyLB.jpg",
               "id": 39853,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46889251416c91057795",
               "name": "Nigel Kneale",
               "profile_path": null,
               "id": 66202,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe46889251416c9105779b",
               "name": "Nigel Kneale",
               "profile_path": null,
               "id": 66202,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "54e4ebd992514109f900005c",
               "name": "Aubrey Baring",
               "profile_path": null,
               "id": 996903,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "54e4ebe7c3a3682b0200006b",
               "name": "Michael Carreras",
               "profile_path": null,
               "id": 29664,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "54e4ebf49251410a01000056",
               "name": "Anthony Nelson Keys",
               "profile_path": null,
               "id": 29665,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "54e4ec0292514109f7000070",
               "name": "Humphrey Searle",
               "profile_path": null,
               "id": 70443,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "54e4ec10c3a3682b0b0000b6",
               "name": "Arthur Grant",
               "profile_path": null,
               "id": 30138,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "54e4ec1cc3a3682af600005a",
               "name": "Bill Lenny",
               "profile_path": null,
               "id": 40355,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "54e4ec2992514109f7000076",
               "name": "Bernard Robinson",
               "profile_path": null,
               "id": 30139,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "54e4ec36c3a3682b05000067",
               "name": "Ted Marshall",
               "profile_path": null,
               "id": 30175,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "54e4ec4292514109f700007a",
               "name": "Beatrice Dawson",
               "profile_path": null,
               "id": 29894,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "54e4ec5192514109fe00008e",
               "name": "Philip Leakey",
               "profile_path": null,
               "id": 30703,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "56e2d3bdc3a3686ff9002daf",
               "name": "Len Harris",
               "profile_path": null,
               "id": 578077,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "56e2d3dd92514143a1000f88",
               "name": "Jock May",
               "profile_path": null,
               "id": 1095444,
               "department": "Crew",
               "job": "Sound Recordist"
            },
            {
               "gender": 0,
               "credit_id": "56e2d3f1c3a3687001002c71",
               "name": "John Hollingsworth",
               "profile_path": null,
               "id": 1555746,
               "department": "Sound",
               "job": "Music Director"
            },
            {
               "gender": 0,
               "credit_id": "56e2d41cc3a3687001002c7f",
               "name": "Henry Montsash",
               "profile_path": null,
               "id": 30182,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Horror",
            "id": 27
         }
      ],
      "popularity": 2.269169,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 38006,
      "vote_count": 28,
      "budget": 0,
      "overview": "A kindly English botanist and a gruff American promoter lead an expedition to the Himalayas in search of the legendary Yeti.",
      "similar": [
         9392,
         16436,
         11678,
         21736,
         46636,
         318279,
         133441,
         487283,
         59248,
         333591,
         54112,
         30329,
         248450,
         490694,
         281190,
         94658,
         186079,
         263636,
         313759,
         313760
      ],
      "original_title": "The Abominable Snowman",
      "runtime": 91,
      "poster_path": "/ew09BjLLwvEBhQsUhmk14IKH6q6.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Clarion Films",
            "id": 1313,
            "origin_country": ""
         },
         {
            "logo_path": "/pi7SHIi3CNAyDUCt6Jpr1q9UW3t.png",
            "name": "Hammer Film Productions",
            "id": 1314,
            "origin_country": "US"
         }
      ],
      "release_date": "1957-08-26",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "See It With Someone Brave! -- A Timeless Terror to Freeze You to Your Seats!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Val Guest"],
      "runtime": 91,
      "synopsis": "Titles and credits run over wide shots of the Himalayas. We open with a party on horseback approaching a Buddhist temple. Inside the courtyard some monks work as others chant in prayer. The majordomo (Anthony Chinn) announces himself and enters the Lhama's (Arnold Marle) chamber with refreshments. Dr. John Rollason (Peter Cushing) and his assistant, Peter Fox (Richard Wattis) examine some plant specimens the Lhama has provided the pair to study. The Lhama explains the plant is used to treat skin rashes. Explaining that it is the wrong time of year to collect fresh specimens, the Lhama offers his supply to Rollason. The Lhama comments on Fox, known affectionately as Foxy, not liking the tea provided. He mentions that Rollason's wife is brave to come to such a hard, rough place. The Lhama displays his ability to read people very well. Rollason volunteers that he has come to know the mountain, the people, and customs very well through climbing, but an accident caused him to give it up. Another party is six days overdue. The Lhama presses Rollason for details; He seems to sense their visit is not purely a scientific one. Foxy returns to their lab and sleeping accommodation with a plant sample. He asks Helen Rollason (Maureen Connel) for specimen jars. Foxy informs Helen he is ready to leave, \"So I'm ready. The sooner we get out of here, out of this infernal country with its cold, and bad smells, and the superstition.\" Helen also reminds him of his dislike for Tibetan tea. Foxy asks Helen to take the jars to her husband. The Lhama continues to inquire about the arriving party and specifically about a man by the name of Friend. The Lhama asks point blank, \"What is this man searching for?\" Rollason is uncomfortable and hesitates to respond, but the Lhama demands an answer and Rollason's interest. Rollason explains his interest is purely a pursuit of scientific knowledge. The Lhama predicts the arrival of Rollason's wife. He then tells Helen she will remain under his protection while her husband engages in his climbing expedition. Both Rollasons register surprise. The Lhama dismisses himself leaving John Rollason to explain his decision to his wife. She is dead set against his climbing and confronts her husband with her concerns over his obsession, \"with the creature.\" Outside the monks prepare a ceremony as the party arrives. Tom Friend (Forrest Tucker) arrives, and like the stereotypical \"Ugly American\" begins shouting at the locals and ordering his Sherpas around. Kusang (Wolfe Morris) takes the brunt of the abuse. Rollason comes out to greet Friend. Friend introduces the other members of his expedition, Ed Shelley (Robert Brown) and Andrew McNee (Michael Brill). Friend introduces McNee as Jacques. Helen invites all to join them for dinner of stew. Ed Shelley tells all that will listen, \"I don't know what's worse about it? The stink of everything or the ignorant natives or the filthy food they eat or what. You tell me.\" When Shelley finally gets to the heart of the matter--the Abominable Snowman, Helen informs him, \"It doesn't exist.\" McNee tells the assembled that he saw their footprints on a prior expedition. Friend shows Rollason a silver container housing a tooth. He believes it is a Yeti tooth. The silver cylinder had been stolen from the monastery some time earlier. Friend intends to return it to the Lhama. Outside the monks start their ceremonial dance. Friend explains his climbing plan and it includes no porters, just the five men. Friend invites Rollason along for his expertise. Rollason, Helen and Friend go to see the Lhama with the tooth. The Lhama explains the tooth was carved and that the Yeti is imaginary. The Lhama warns Rollason that he expects only good intentions on his involvement. Rollason doesn't fully understand or appreciate the advise. The next morning the party departs. Before they leave, Helen makes one last attempt to dissuade her husband, \"It's those men, Friend and Shelley. I don't trust them and I don't like them.\" The party sets off and notices three men shadowing them. It is apparent McNee is in no shape for the climb and the three men are definitely following them. Then shots ring out and Kusang is convinced, \"These men bandits. They kill us.\" Rollason sees their faces through his binoculars as Shelley scares them away with gun shots of his own. Rollason recognizes the men from the monastery but tells Friend otherwise. They continue their climb up to the hut and provisions placed there earlier. They eat and discuss their plans. Friend asks Rollason for his expert advise, such as what they live on. Rollason tells him, \"Small animals, hares, mice, voles...roots and plants under the snow.\" Friend finally explains the real purpose of their expedition. He intends to capture a creature, alive if possible. McNee senses something outside. They exit the hut to see, but it is late. They bed down for the night. Rollason and Friend go back outside for a smoke and to talk. Friend tells Rollason his interest is commercial and he intends to both learn and profit from his expedition. At the monastery, the Friend Expedition porters pester Helen and Foxy for their money. Friend refused to pay them until he returned. Helen is convinced the party is doomed. Foxy goes to talk to the Lhama, but he is in deep meditation and ignores Foxy. Rollason digs up a highly nutritious species of moss, confirming his theory about how the creatures manage to survive in such a harsh environment. McNee volunteers he doesn't trust Tom Friend and observes Rollason doesn't either. Rollason asks why he came. McNee explains the obsession with finding the creatures and that he paid Friend to join the expedition. It is now apparent that McNee is dangerously unsuited for the trek. McNee walks into a spring trap. Rollason tries to free him, but the arrival of Shelley, who set the trap, is able to free McNee's leg. Shelley explains they have already caught a Yeti. They help McNee back to camp. Kusang and Friend show Rollason their Yeti, but Rollason explains it is a Himalayan monkey. Rollason does his best to treat McNee's leg. A weather report on their portable radio indicates a blizzard coming in twenty-four hours. Rollason accuses Friend, \"You're nothing but a cheap fairground trickster.\" They scuffle and damage the radio and any future weather reports. A commotion outside, brings them all to investigate. They find the monkey is gone and the cage door torn off its hinges. They see sixteen inch long footprints in the snow. Back in the tent McNee sees a hand of the creature exploring inside. Kusang's screams brings the party to the tent. Kusang bolts the encampment and runs back to the monastery. Friend notices that the traps they set earlier are torn apart. McNee stirs in pain, despite narcotics administered by Rollason. McNee falls back to sleep after Shelley shoots and kills one of the creatures. They follow a bloody trail back to the body lying in the snow. Friend pronounces the find as dead, and at least eleven feet tall. At the monastery, Kusang arrives exhausted and still frightened. Helen witnesses his arrival and tells Foxy. Helen goes to see the Lhama, but gets lost in the building. She explains to the Lhama she saw Kusang and the Lhama confirms only that her husband is in danger but he can do nothing. Foxy takes her back to their quarters. Helen proposes to go find her husband by engaging the porters. They were not paid by Friend, so she pays them with her own funds. McNee is better the next day. Rollason tells him they are moving to the cave and they have a dead creature. They hear the cries of something echoing in the mountains. McNee is strangely drawn to the calls and walks away from camp. He falls from a cliff and is killed. Friend believes the creatures killed McNee. \"It was the sound of that howling. He couldn't stand it; It drove him mad,\" Friend accuses. Several reports from Shelley's rifle brings Rollason and Friend running back to the cave. Shelley is hysterical. He recounts that two very large creatures ran towards him. He is convinced they are after him personally because he killed their comrade. Friend proposes to set a trap in the cave and use Shelley as bait for the creatures. Shelley reluctantly agrees to the plan. Rollason returns to McNee to bury the body. Helen, Foxy and the porters walk up the mountain in search of her husband. Friend explains to Rollason that the tungsten steel net will stop anything. He gives Shelley a cleaned and loaded weapon, but since he wants it alive and Shelley is far too trigger happy, he actually gives him a gun loaded with dummy ammunition. Rollason and Friend return to the tent. A blizzard kicks up and Friend can barely see the cave from the tent. Rollason tries to convince Friend to be satisfied with a dead Yeti, but Friend is adamant--he will settle for nothing less than a live specimen. The creatures spring the trap, and as expected, Shelley fires at them. Rollason and Friend notice the net torn to pieces and Shelley is dead. Rollason attributes the death to a heart attack from fright. He also notices the dummy ammunition. The Yeti came for their dead comrade but left without it. Rollason and Friend bury Shelley next to Andrew McNee. They return to the cave to wait out the storm. Rollason proposes that the Yeti can read their minds, and that they may be just waiting for humans to go extinct to take their place in the world. The cold, altitude, and exhaustion cause them to hallucinate. Rollason hears a weather report on the broken radio. Rollason begins to panic and is cured with oxygen. Next Friend begins to hear calls for help from Shelley. Friend overpowers Rollason and exits the cave to search for Ed Shelley. Revolver shots by Friend start an avalanche that buries him alive. Rollason searches for Friend but finds no trace, and returns to the cave. He sees two creatures inside the back of the cave. One approaches and stares at Rollason. Helen is awakened by the distant howls of the creatures. She exits the hut to get a bearing on the sounds. Foxy wakes and sees that Helen has gone and sets out to search for her. He quickly returns and rousts the porters to join him on the search. Helen finds her husband nearly dead in the snow and large footprints near his body. They return to the Monastery and the Lhama consoles Rollason. To keep their secret and the only chance to keep them alive, Rollason lies and tells the Lhama they don't exist. \"There is no Yeti,\" are the final words uttered by the Lhama. We close with a panoramic shot of the mountains.",
      "writers": ["Nigel Kneale"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0050095/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc0Nzc1NzE0OF5BMl5BanBnXkFtZTcwNzY0NDAzMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Forrest Tucker, Peter Cushing, Maureen Connell | See full cast and crew »"],
      "reviews": [
         "Dr. John Rollason (Peter Cushing), his wife, Helen (Maureen Connell), and a colleague, Peter Fox (Richard Wattis), have traveled to a remote location in the Himalayas, ostensibly to study rare plant specimens. However, Helen and Peter soon learn that John had an ulterior motive, when he reveals that a ragtag group of explorers, headed by Dr. Tom Friend (Forrest Tucker) are on their way to meet up with John. They plan to lead a small expedition further into the mountains, in search for the infamous abominable snowman, or Yeti. The Abominable Snowman is a marvelous combination of adventure, horror, and a film with a broader message. The beginning may seem a bit slow to younger viewers, but it is crucial to the plot, and Peter Cushing, as always, turns in a tremendous performance. The monastery setting seems authentic, as do the climbing shots that follow, even though most of the film was shot in Hammer's UK studios and the mountains are actually the Pyrenees in France. It doesn't take long for director Val Guest to build tension, first dramatically with the ulterior motive revelation and the conflict is causes between John and his wife, then during the Friend expedition's climb, and most importantly, when our crew nears the Yeti. Because the creature effects, especially in the 1950s, can't rival the viewer's imagination, Guest wisely keeps the creatures off-screen for the bulk of the film, and when we see more, it's in heavy shadows. This makes the Yeti material extremely effective. The message at the end is sincere and poignant, as it also would have been at the time of the film's release, when anthropological exploration of seemingly alien cultures was still regular, captivating news. Overall a 9 out of 10 for me, and very close to being a 10.",
         "I absolutely LOVE the Hammer studios. Regardless what most people claim, this production company offers a lot of diversity and fables for all tastes. Take this for example\u0085in the same year they personified evil through the face of Baron Frankenstein, the also presented a mythical tale of the Himalayan Yeti. Unlike you'd expect, this movie is filled with though-provoking theories, moral speeches and criticism towards typically human greed. Those who're setting their minds to seeing an exiting snowman-hunt with violent and aggressive creature make-up might feel cheated after watching this film. The `horror' is mainly reached through a slow and tense atmosphere and the unpredictable twists in the search for the bizarre species of the Himalayas. The Abominable Snowman is very effective horror! The story makes you think and sympathize, while the locations and photography stuns you. There's a terrific interaction between the two protagonists \u0096 Forrest Tucker and Hammer regular Peter Cushing \u0096 which automatically forces you to pick sides. The final sequences are a bit of a blotch, I reckon\u0085but by then, you're already impressed more then enough by this film. Val Guest was a terrific choice to direct, his previous efforts for the Hammer studios (The Quartermass Experiments) both were suspenseful movies as well. Nigel Kneale re-wrote the story that was turned in a TV-movie already two years earlier and he succeeds in upholding the unique premise. Cushing is at the peak of his respectable career at this point. In a period of only 3 years after this, he appeared in multiple other Hammer milestones like The Curse of Frankenstein, The Mummy, the Hound of the Baskervillers and the Horror of Dracula. His entire career is highly recommended and the Abominable Snowman even receives and extra plus.",
         "Hammer studios made a variety of films for many years before they struck gold with horror movies. One of their first steps in that direction was 'The Quatermass Xperiment', directed by Val Guest and written by Nigel Kneale who adapted his own highly successful TV production. A couple of years later Guest and Kneale did the same again with 'Quatermass 2'. Both were science fiction with some horror, and both were very, very good. Guest and Kneale had an uneasy relationship (\"relationship\" is probably not even the right word, Guest said he only ever met Kneale a few times), but they collaborated once again on 'The Abominable Snowman'. Despite the title it isn't a monster movie, it's more of an adventure tale with some mysticism and philosophical touches. It was successful commercially, but coming out just before the one-two punch of 'Curse Of Frankenstein' and 'Dracula' (the two movies that really put Hammer on the map) has meant it has all but been forgotten today. When people list the best of Hammer you rarely if ever see 'The Abominable Snowman' mentioned, which is a shame. It's consistently interesting, well acted, stylish and suspenseful. Sadly I haven't seen Kneale's original TV version ('The Creature') so I can't compare the two, but I really enjoyed this movie, especially the performance from Peter Cushing, soon to become a Hammer legend. Forrest Tucker is best known to people of my generation for his comic role in the popular 1960s sitcom 'F Troop'. Pairing him with Cushing might seem an odd choice at first but it really works. Their contrasting styles play off each other, and Tucker is perfect for the role of the ambitious Tom Friend. There's also a good supporting performance from Robert Brown, who later appeared as a caveman in Hammer's 'One Million Years BC'. Later still in the 1980s he played M in several Bond movies. The more Hammer movies I watch the more I am impressed by this legendary studio. \"Hammer House Of Horror\" yes, but also so much more. 'The Abominable Snowman' is a great example of their originality and versatility.",
         "In the fifties, Hammer produced a few highly noted films that were scripted by Nigel Kneale and directed by Val Guest. Among them were QUATERMASS EXPERIMENT and the highly disturbing QUATERMASS II (a.k.a. ENEMY FROM SPACE). Though produced on low budgets, these productions were of a higher quality than most of the usual Science-Fiction releases at the time. Kneale's literate screenplays were directed towards a more sophisticated audience and Guest's direction displayed much creative imagination, proving that innovation can often override a limited budget. The story begins as botanist Peter Cushing teams up with crass hustler Forrest Tucker for the purpose of finding the ever elusive Yeti, despite protests and warnings from Cushing's wife (Maureen Connell) and the llama. As the research team progresses on its expedition, they begin to find subtle clues that the yeti may truly exist. While they sleep, they are awaken by the sounds of strange wailing in the night. Upon investigating, they find large footprints of something not apparently human. Cushing, an honorable man of decent principles, is outraged when he learns that Tucker's real aim is to capture and cheaply exploit the yeti for monetary and personal status gain. During the night, a claw reaches into the tent, sending their superstitious guide out into the night in a fit of total panic. The other members, with the exception of Cushing who tries to maintain his sense of reason, become more and more unhinged as they fear that the creatures are now stalking them. Member Macnee (who claims he once caught a glimpse of one on a previous expedition) believes that they are trying to psychically attack him and he falls to death. Cushing asserts that Macnee was mentally unstable and fell victim to his own frightened carelessness, while Tucker cynically feels that they deliberately drove him to his death. Tucker proposes a reckless trick to entrap one of the creatures in a cave with a steel net, as his trapper buddy stands by with a gun, just in case. As Cushing and Tucker wait in a nearby tent, a raging blizzard breaks out. Cushing deduces that the Yeti may actually be intelligent beings, perhaps the missing link between man and ape and are a lost chapter in our history of evolution. He feels its possible that they may actually be biding their time, waiting for mankind to die out, so that they can then take over. Tucker only has money-money-money on his sleazy mind and thinks the scientist has flipped-out from cabin fever and is off on an intellectual tangent. Besides, being the hollow man he finally reveals himself to be, Tucker couldn't care less. The pair hear the hunter's scream and a roar from the cave. They find his dead body with an expression of sheer horror on his face and see that the steel net has been ripped to shreds. As the remaining two members decide to hold-up in the cave til morning, Cushing then hears the radio announcer saying that they are strongly advised to leave their gear and get out of the area immediately. There is only one problem: The radio was busted earlier and is not working, and Tucker says that he didn't hear any such announcement. I won't say anymore. In many ways Kneale's intriguing story (based on his acclaimed BBC serial THE CREATURE) bears allegorical similarities to Huston's TREASURE OF THE SERRA MADRA, in that the characters are actually pursuing a myth and are inevitably destroyed by their own greed and paranoia. Like TWILIGHT ZONE and OUTER LIMITS, the science-fiction premise takes on supernatural overtones and serves as a cautionary morality play. Though some may think that that old \"there are some things that man should not meddle with\" message is a preachy cliche, it does have validity when the man's sense of perception, judgement, personal ethics and real motives are highly in question. Director Guest creates an absorbing atmosphere of mounting terror from beginning to end as the characters' (and the viewers') smugness and complacency is gradually devoured; then the unknown takes over, and total helplessness and fear become the terrifying and tragic results. What at first seemed far-fetched now becomes all too real. This skillful technique was effectively employed in the Quatermass films as well as Tourneur's memorable scare classic NIGHT OF THE DEMON. The B & W photography evokes the proper dark, eerie mood which leaves you with that unsettling feeling that something truly is out there and it's inevitably closing in on you. Though many critics and viewers felt that the highly overpraised BLAIR WITCH was original with its idea of the unseen menace that preys upon your doubt and paranoia, it's now obvious that it was nothing more than a slipshod rehash of these notable films that were produced decades earlier. As long as you're not expecting some stupid, slasher monster movie, sophomoric puns and another overblown demo roll of special-effects, then give this unique, intelligent film your serious consideration. It may leave you haunted and disturbed.",
         "Another great thriller from Hammer Films and another in a long line of British horror flick in which Man turns out to be a bigger menace than the monsters. Peter Cushing plays a botanist who uses a scientific expedition to Nepal as an excuse to further study rumors of the Yeti, better known as the Abominable Snowman. He is so intrigued that he joins a climbing expedition led by an unscrupulous American businessman played by Forrest Tucker (in his pre-\"F-Troop\" days). Arnold Marle is especially effective as the leader of the monastery where Cushing has been studying. He tries to warn off Cushing and Tucker and seems to know more about the Yeti than he lets on, especially since he can read both men like books. Cushing, as always, is superb. Tucker is excellent, here playing essentially a boorish American bad guy as opposed to some of the unconvincing good guys he played in later films. Tucker and Cushing play off each other very well and you can almost see Cushing's dander rising for having joined up with what he calls a \"fairground trickster.\" What works best here, as opposed to American films, is that the producers decided not to actually show the Abominable snowmen. You hear the growls of the Yeti, even seen an arm, but not until the end do you truly comprehend just what the Yeti might be. Even then, much is left to the imagination. The story is well-paced as members of the expedition slowly descend into a fit of fear and madness, fighting one another while foolishly clinging to the same personality traits that caused it in the first place. By the end of the film, the viewer is left wondering who is really the monster.",
         "Fabulous little implicit horror gem from Hammer Studios with subtle performances by Forrest Tucker and Peter Cushing. I was amazed to see how youthful looking Peter Cushing looked in this movie compared to just a few years later. Seemed to have come after The Curse of Frankenstein(1957) and The Horror of Dracula(1958). The Abominable Snowman(1957) looks at the notion of the yeti in an abstract manner. The legendary yeti in the film is given an ambiguous quality that makes them into a fearful presence. Intellgent film that could only have been done by the British for filmmakers of Hollywood(many of them) would not make a film richly deep with implicit fright and intellegence. When it comes to creating Science fiction flicks that are scary as well as intellegent the British filmmakers for the most part are bar none the best. Parts of the story reminds me of Frank Capra's Lost Horizon(1937) which also took place in the Himalayas mountains. Both The Abominable Snowman(1957) and Lost Horizon(1937) deal with ideas of spiritality and humanity. Peter Cushing as Dr. Rollason is a good counterpart to the money and fame hungry Dr. Friend played by Forrest Tucker. Peter Cushing gives a gentle and thoughtful performance that is uncharacteristic of the many roles he had for Hammer studios. Imaginating written by Quatermass creator, Nigel Kneale who is a master of suggestive terror. The Abominable Snowman(1957) is one of the main influences besides Cannibal Holocaust(1979) for Blair Witch Project(1999). Abominable Snowman(1957) is a more effective film in suggesting terror than Blair Witch Project(1999) for a couple of reasons. First, the former does show bits and pieces of the yeti which is more imaginative than not showing anything of the witch at all as the latter. Second, the fear and terror felt by the characters in The Abominable Snowman(1957) feels geniune unlike in Blair Witch Project where emotions of fear and terror feel manipulated and forced. An excellent motion picture for a someone like Val Guest whose career is filled with ups and downs. The Abominable Snowman(1957) ends on a thought provoking note about the Yeti as well as other intellegent metaphysical issues.",
         "I can remember barely being able to keep my eyes open watching this on a late night horror movie show, because it's not a movie for kids. Didn't realize that then, and so I always remembered it as being a pretty weak film. However, a viewing of the widescreen laserdisc version left me with a strong impression of a very fine adult feature that is more a thriller than a horror film. It lives up to the reputation of Hammer during this period, and of course that of Peter Cushing as the premier actor of the studio. Even Forrest Tucker's typical heavy-handed hamminess cannot take away from this absorbing tale of scientific endeavor clashing with crass commercialism, with a creature of an intellect that bests the men chasing it. I must say that the whole mental telepathy plot point was completely missed upon first viewing, but then I was only 10 at the time, however it now makes all the sense in the world.",
         "The Abominable Snowman of the Himalayas was a surprisingly good film. It wasnt a typical horror story--the monster turned out to be quite familiar--making it all the more horrifying. The script was very well written-with profound and timeless ideas. This is the sci-fi/fantasy genre at its best. It had solid performances by Cushing and Tucker, and some great cinematography. If you like to think--this is the film for you.",
         "It's rather strange seeing Hammer horror in black and white after all the vibrant colours that their later offerings show off so boldly; but the black and white gives it that old monster movie feel (which is what the movie is anyway...) and it's a good factor for that reason. It's true that this isn't Hammer's finest work, but it's a very nice early offering; and shows some early ingeniousness of the studio. That's what I like best about Hammer Horror; when you see one of their movies, you know that you're going to be in for a fun and imaginative ride and this film certainly delivers on that front. The plot follows botanist Peter Cushing as he joins a group of arctic explorers that go off into the Himalayas in search of the mythical beast - the Yeti. The film then follows, in adventure style, their misadventure as they come face to face with the beast itself and get more than they bargained for... The snow setting gives the film a feeling of isolation that invokes a constant feeling of dread and we get the impression that if something bad does happen - there wont be anyone there to save our hero's. This mind game has been carried off in many films since this one (Alien, most notably), but here is a good early example of that. The film is also different from most other horror films as it handles a subject and a monster that hasn't often been covered. This sets it apart in a good way as it's something different from the viewer and also goes some way to showing Hammer's inventiveness as most studios are happy to continue taking the safe option and making horror films that have been tried and tested. The fact that the Yeti doesn't appear for much of the film will no doubt annoy some viewers, and it did me somewhat, but it helps the film as it ensures that the audience will be intrigued to finally see the monster. The film is very well paced and doesn't get boring either, which is a plus. As I said, this isn't Hammer's best film. However; it's definitely well worth tracking down for the Hammer fan, and people in general that want to see a good monster movie.",
         "I just saw \"The Abominable Snowman\" today and was pleasantly surprised by the film. When I read the preview for it on the TV it was under the Horror category, and knowing it was made in 1957, I wasn't sure I wanted to see it in fear that it would be too out-dated to be enjoyable. But what the movie did was, at a relatively quick pace, told a story of 5 men who travel into the Himmalayin mountains in search of a Yeti. As our travelers progress, we find out that not everyone has the same intentions for this creature. One thing I liked about this movie is how they don't show the creature fully, allowing people to enjoy the movie years later without ever having to worry about why the Yeti looks so stupid and fake. *Possible Spoilers* In my opinion, one of the best things about the movie was how the entire plot set up the Yeti to be a fierce and man-eating creature. But the doctor realizes that the creature may not be this terrible monster but instead, a species that is saddened and hidden away in the cold mountains, away from humans. The final encounter with the creature proves this, when we see that their face doesn't resemble a monster but much more human-like. Overall, I give this movie a 7.5/10 and I recommend it because it makes you think at the end, something most horror movies truly don't."
      ],
      "genres": [
         "Adventure",
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Clarion Films",
         "Hammer Film Productions"
      ],
      "summaries": [
         "At a remote lhamasery in the Himalayas, scientist John Rollason studies rare mountain herbs with the help of his wife Helen, and associate Peter, while awaiting the arrival of an American named Tom Friend. Over Helen's objections and warnings by the High Lhama, he sets out with Friend on an expedition to find the elusive Yeti, accompanied by another American named Shelley and a young Scotsman, McNee, who claims to have seen the thing. Footprints are found in the snows and McNee seems queerly affected the closer they get to their quarry's likely habitat but the biggest shock to Rollason is discovering Friend is a showman who only intends to exploit their find, with Shelley his gamehunter-marksman. The conflict between science and commercialism only increases when an enormous anthropoid is shot, and the horror only increases as the party realizes the other Yeti intend to retrieve their fallen comrade and have powers to do so which seem extra-human...",
         "A kindly English botanist and a gruff American scientist lead an expedition to the Himalayas in search of the legendary Yeti."
      ],
      "budget": 0
   },
   "movielensId": 3648,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1957-08-26",
      "dvdReleaseDate": "2000-05-23",
      "directors": ["Val Guest"],
      "runtime": 91,
      "movieId": 3648,
      "title": "The Abominable Snowman",
      "mpaa": "",
      "actors": [
         "Forrest Tucker",
         "Peter Cushing",
         "Arnold Marlé",
         "Maureen Connell",
         "Richard Wattis",
         "Robert Brown",
         "Michael Brill",
         "Wolfe Morris",
         "Anthony Chinn",
         "Fred Johnson",
         "Jack Easton",
         "Joe Powell"
      ],
      "imdbMovieId": "0050095",
      "originalTitle": "The Abominable Snowman",
      "genres": [
         "Adventure",
         "Horror"
      ],
      "youtubeTrailerIds": [
         "eUcMsy96sps",
         "B4SraQM15LI"
      ],
      "plotSummary": "A kindly English botanist and a gruff American promoter lead an expedition to the Himalayas in search of the legendary Yeti.",
      "tmdbMovieId": 38006,
      "avgRating": 2.79167,
      "releaseYear": "1957",
      "numRatings": 96,
      "posterPath": "/fr3CCAjXst0IujSvWLnv9Uv0ocS.jpg"
   }
}