{
   "tmdb": {
      "original_language": "es",
      "keywords": [],
      "imdb_id": "tt0090644",
      "video": false,
      "title": "Anguish",
      "recommendations": [
         24922,
         31596,
         15736,
         20850,
         76804,
         18196,
         38446,
         88922,
         30913,
         39857,
         31319,
         39986,
         125540,
         40447,
         24923,
         40365,
         39875,
         87524,
         30559,
         56345
      ],
      "backdrop_path": "/mGnyA2h0ukj0DNDLKh4lZb5re91.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Alice Pressman, the Mother",
               "gender": 1,
               "credit_id": "52fe45e8c3a36847f80e140f",
               "name": "Zelda Rubinstein",
               "profile_path": "/xCqgUXqwv4Fndx2w3iK1weqlzN9.jpg",
               "id": 10091,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "John Pressman",
               "gender": 2,
               "credit_id": "52fe45e8c3a36847f80e1413",
               "name": "Michael Lerner",
               "profile_path": "/7VlkzO1z5wh96UCXpPZ0rUFx8aN.jpg",
               "id": 4250,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Patty",
               "gender": 0,
               "credit_id": "52fe45e8c3a36847f80e1417",
               "name": "Talia Paul",
               "profile_path": null,
               "id": 144267,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "The Killer",
               "gender": 0,
               "credit_id": "52fe45e8c3a36847f80e141b",
               "name": "Àngel Jové",
               "profile_path": null,
               "id": 144268,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Linda",
               "gender": 0,
               "credit_id": "52fe45e8c3a36847f80e141f",
               "name": "Clara Pastor",
               "profile_path": null,
               "id": 144269,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Caroline Robinson",
               "gender": 1,
               "credit_id": "52fe45e8c3a36847f80e1423",
               "name": "Isabel García Lorca",
               "profile_path": "/lf3R1h5kMZNjkl3BR3ddL0pvu3u.jpg",
               "id": 144270,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45e8c3a36847f80e1429",
               "name": "Bigas Luna",
               "profile_path": "/jjl6wHNVCqjXydfCDi87KlLDd6b.jpg",
               "id": 37577,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45e8c3a36847f80e142f",
               "name": "Bigas Luna",
               "profile_path": "/jjl6wHNVCqjXydfCDi87KlLDd6b.jpg",
               "id": 37577,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5748a4e0c3a3682853002cd7",
               "name": "Michael Berlin",
               "profile_path": null,
               "id": 169912,
               "department": "Writing",
               "job": "Dialogue"
            },
            {
               "gender": 0,
               "credit_id": "5748a54dc3a3682853002ce7",
               "name": "Pepón Coromina",
               "profile_path": null,
               "id": 37540,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5748a532c3a3682853002ce5",
               "name": "George Ayoub",
               "profile_path": null,
               "id": 1308814,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "5748a544925141309100004c",
               "name": "Andreu Coromina",
               "profile_path": null,
               "id": 1627100,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "5748a55b9251415452001dca",
               "name": "Xavier Visa",
               "profile_path": null,
               "id": 1627101,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "5748a570c3a3681365002e2f",
               "name": "José Manuel Pagán",
               "profile_path": null,
               "id": 1498858,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "5748a577c3a3683cd8001a36",
               "name": "Josep M. Civit",
               "profile_path": null,
               "id": 90267,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5748a57fc3a3686331000004",
               "name": "Tom Sabin",
               "profile_path": null,
               "id": 1627102,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5748a5869251415452001dd4",
               "name": "Felipe de Paco",
               "profile_path": null,
               "id": 1627103,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "5748a592c3a368329a0019af",
               "name": "Consol Tura",
               "profile_path": null,
               "id": 28501,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "5748a599c3a368633100000d",
               "name": "Matilde Fabregat",
               "profile_path": null,
               "id": 1627104,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "5748a5a39251414c4b0019a7",
               "name": "Paco Poch",
               "profile_path": null,
               "id": 1627105,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "5748a5ab9251413476000003",
               "name": "Joan Porcar",
               "profile_path": null,
               "id": 1627106,
               "department": "Production",
               "job": "Production Manager"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 2.938821,
      "production_countries": [{
         "iso_3166_1": "ES",
         "name": "Spain"
      }],
      "id": 42002,
      "vote_count": 36,
      "budget": 0,
      "overview": "An ophthalmologist's assistant with an unhealthy interest in human eyeballs goes on a killing spree to collect eyeballs for his overbearing mother's collection. Reality soon takes a bizarre turn, both for the characters and the audience.",
      "similar": [],
      "original_title": "Angustia",
      "runtime": 86,
      "poster_path": "/yWFA9UrrXtrVdhv3fsxsLBQ3MIb.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Samba P.C.",
            "id": 77451,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Luna Films",
            "id": 77452,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Pepon Coromina",
            "id": 77453,
            "origin_country": ""
         }
      ],
      "release_date": "1987-11-10",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "The eyes of the city are mine.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Spain",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Bigas Luna"],
      "runtime": 86,
      "synopsis": "John (Michael Lerner) is at home with his mother. While he is playing with the pet pigeons in their cages, a bird flies out and around the room, until he manages to catch it and return it to his mother. John goes to work at an eye clinic where a doctor (Nat Baker) shows John and a group of students (Gustavo Gili, Antonio Regueiro and Joaquín Ribas) a collection of eyeballs in jars. John then goes to a patient, named Caroline (Isabel García Lorca), whom he tries to help put contact lenses in her eyes. John leaves after Caroline makes a comment about his eyes and a nurse (Patrice Manget) tells her that John is sensitive to such comments because John is a diabetic and he is slowly losing his vision. Caroline continues her complaints, and from home John's mother (Zelda Rubinstein) seems to listen to the conversation through a shell. \"You'll be sorry!\" John's mother says. Later, John is at home eating dinner and his mother plays a spiral on the turnstable, takes off John's thick-lenses glasses, and relaxes him through hypnosis. \"Now you are with Mommy as one.\" John visits Caroline at her house, telling her that he has the correct prescription for her eyes. John lets himself into the house to ask Caroline to let him try out her new contact lenses. After fitting them in, Caroline seems content, so John apologizes about that morning and he suddenly pulls out a scalpel and slashes Caroline's throat. When Caroline's boyfriend (José María Chucarro) walks into the room and sees Caroline's dead body, John throws the scalpel at him and then stabs him in the stomach. At home, John's mother gets a phone call from the hospital. She says that John is not coming back (a conversation that John \"hears\" through his merging of minds with his mother. John's mother thinks that the entire hospital is against John and she tells him via telepathy to cut out all people's eyes. As John is cutting out the dead Caroline and her husband's eyes, the image slowly pulls back to reveal that this whole thing is a movie being shown to a small audience in a small movie theatre. The slasher film is called The Mommy and it is having a matinee showing in this theater somewhere in Los Angeles. Among the audience are two teenage girls named Patty (Talia Paul) and Linda (Clara Pastor). Patty is disgusted and frightened by the film and of John's character. The unfeeling Linda, munching on popcorn, tells Patty that it is only a movie. In the film, John is called home by his mother and she confronts him to kill all of the people in the city saying \"all of the eyes of the city will be ours\". Patty begins to complain about her eyes becoming irritated from her own contact lenses, and she sees a weird looking man (Ángel Jové), sitting across the aisle from her also rubbing his eyes. In the film, Mother begins an eerie trance for John involving spirals, and many people in the theater audience seem dazed by the movie. Patty tells Linda that she feels dizzy, and her breathing gets heavier, until finally the on-screen trance is over and John stands up to leave and tells his mother, \"they are going to be very sorry, Mother.\" John goes out and goes to a movie theater, sits behind a man, stabs him with a screwdriver and cut out his eyes with a scalpel. Patty finally leaves Linda to watch the film alone. Mother tells John to go for more people in the theater. John sits behind a couple as the woman (Diane Pinkley) goes for more popcorn, and he kills the unaccompanied husband (Benito Porcino). In a women's room stall, Patty sees a pair of shoes outside the door and when they are gone, she runs back into the theater and tells her that the weird looking man was in the bathroom. Linda points him out, still sitting in his chair. But Patty is convinced that a man was in the bathroom and she persuades Linda to go check. Linda, who wants more popcorn anyway, finally agrees to check it out and tells Patty to stay to tell her what happened. In the film, the woman returns to her seat and offers popcorn to her dead husband (which John accepts). John then puts a cloth around her face. Patty continues staring at the weird looking man, who looks at his wristwatch as if timing the movements in the movie. Patty becomes more uneasy when he stands up and leaves the theater. In the movie, Mother tells John to come home, but John refuses saying that he can do all this alone. He goes to a restroom and begins to count his eyeballs. In the theater lobby, the girl at the concession (Josephine Borchaca) stand and the woman at the ticket booth (Antonella Murgía) are shot and killed by the weird looking man who has a silenced .38 caliber pistol. Linda comes out of the ladies room to see the killer dragging the bodies away. A terrified Linda takes cover in the mens room and hides in a stall while the killer enters to hide the two bodies in a stall right next to hers. In the movie, a woman confronts John for being in the ladies room and he chokes her to death, and in the struggle loses his glasses when they fall off and break on the floor. Mother continues to plead with John to come back home, but John refuses. The ticket lady enters the bathroom and screams when she sees John hanging over the stall and is swiped with the blade. John goes to the lobby for some popcorn and then attacks the concession girl as well. In the real world, the killer reloads his gun and he seems to be mimicking John's actions on the screen. A man sitting behind a very anxious Patty asks her if she is okay, and she tells him that her friend has been gone for a long time. The man asks Patty what her friend's name is and says that he will go to find her. The man enters the now deserted theater lobby and enters the mens room where he is shot through the neck by the killer. In parallel to both movies, the killer and John both secure the theater doors as the killer in the real world says \"Don't worry Mother. I won't leave.\" A terror-stricken Linda slips out of the mens room and manages to get outside. Linda stops a passing salesman in the street and tells him that there is a murderer in the theater. The man walks with Linda to the theater where he goes inside, sees the secured doors, and blood on the floor. The man runs back out and the two of them run down the street to call the police. Back in the theater, the woman who was with the helpful man tells Patty that she will be right back for her husband has not returned. The woman is grabbed by the killer when she walks past a curtain and he shoots her as well. The killer then grabs Patty and holds her hostage while she is still in her seat, further mimicking John's onscreen dialogue. In the movie, a little girl in the audience finds the results of John's killings and soon people are screaming in the theater. John stabs a man who tries to get out the secured fire escape door and he grabs a teenage girl hostage and stands in front of the theater screen which is playing the silent movie Lost World. John screams out for his mother to come get him and Mommy leaves her house and takes a taxi to the theater. She tells the driver to call the police to save the people John has in the theater. At the same time, the killer then yells at the on-screen John when a man in the audience stands to confront him and is shot dead. Panic breaks out as the killer begins shooting at other people and he drags Patty to the front of the screen. Outside in both movies, the police arrive and surround both theaters. In the old movie, the police break into the theater and Mommy enters with them and tries to reason with John still holding the teen girl hostage in front of the theater screen. In the real world, SWAT teams enter the theater through the roof and cut the movie's sound and tell the killer to let Patty go. The killer refuses saying that he has to wait until his mother comes to get him. He shoots at the screen at John, and thus drops Patty to the floor. The police sharpshooters then open fire, killing the man. When Patty looks at the screen to see Mommy hypnotizing John out of his trance, a policeman opens fire, and accidentally hits Mommy instead and John cradles her. Suddenly, John looks right at Patty and address her directly saying \"I want your eyes too!\" He throws the scalpel out of the screen and hits Patty right in her left eye. The police break into the theater and all of the terrified patrons flee. They find Patty on the ground screaming hysterically (but with no scalpel in her eye). They get her outside where she is reunited with Linda and they take her to a hospital for evaluation. At the hospital, Linda and Patty's parents are with her relieved that Patty is fine and just a little emotionally shaken from her horrific experience. When Patty's parents leave, Linda stays a while longer. A little later, Linda tells Patty that she will return tomorrow. In a nearby elevator, Linda is suddenly grabbed by an orderly and a scalpel is aimed at her throat. The orderly walks into Patty's room with a tray and she sits up in her bed and tries to scream. The orderly is John.... and he wants her eyes! John tells Patty, \"like the doctor said, its all in your imagination. I really don't exist.\" Patty finally manages to scream. During the closing credits, the theater audience watching this movie leaves the theater, and the last patron (Jaume Figueras) leaves for the left.",
      "writers": [
         "Bigas Luna",
         "Michael Berlin"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0090644/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEzMzk3NzU5Ml5BMl5BanBnXkFtZTcwNjEyMTgyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Zelda Rubinstein, Michael Lerner, Talia Paul | See full cast and crew »"],
      "reviews": [
         "I was surprised to see some of the reviews of Anguish (Angustia). I had the opportunity of playing an L.A. cop in the film - it must have been 100 years and 25 pounds ago! As the film seems to have elicited some interest, I'll volunteer some background information. The film was mostly shot in.... Barcelona, on an obviously shoestring budget. I was initially \"signed on\" as an ambulance attendant, but either my \"delivery\" or size turned me into a cop with a couple of lines, learned the same day as the shoot. The exteriors for the \"new movie\" sequences were shot on a street created in a large parking lot in the \"Zona Franca\" of Barcelona. Apparently a stock background depicting Culver City Ca. was shipped to Spain, and a good portion of Barcelona's American cars were used to create the traffic background. Did I mention the shoestring budget? Most of the scenes I participated in were shot at least twice - from different angles - because only one camera was used. I don't say this as a criticism - if anything it is a tribute to Bigas Luna, who was able to create a piece of America on the Mediterranean, and to make a number of non-actors seem credible even with speaking roles (including yours truly).",
         "This creepy motion picture ingeniously realized exploring the hypnotic effects of cinema talks about a timid eye clinic intern (Michael Lerner, Omen 4) under the sway of his psychic and authoritarian mother (Zelda Rubinstein, Poltergeister). Hypnotized by swirling spirals and screechy bursts of gleaming wails, the ominous son packs up his surgical tool set and goes out a rampage . Our hapless soon-to-be victims arrive for a view a horror flick only to watch the gore unfold in the audience as well as on screen in which are showing the silent film titled ¨The lost world¨ and ¨ The mummy¨ . As a group of viewers are killed in the form of a screening of a horror movie that brings naturalism to life. As the terror picture shown to the audience gets more and more violent. The spectators (Talia Paul, Clara Pastor) see Lerner carving eyes on screen while a psycho-killer (Angel Jove) obsessed with the movie unleashes his own criminal spree on the unsuspecting spectators and he attacks anyone who crosses her way and soon the place is filled with people killed. The survivors trapped in the theater must fend off attacks of the murderers. At the ending the remaining public start the desperate battle for their lives and eventually, the theatre turns a walled-in trap. Soon it becomes clear that the parallel arguments gather together in deadly synchronization. The picture is full of suspense,thrills, mystery, and lots of blood and gore .This slick gore-feast is a triumph of style over movie logic. It's packed with overwhelming body count, excessive gore, grotesque killing, and rivers of red blood. This is one of the most original utilization of the movie-within-a-movie with terror argument, such as formerly made Lambert Bava in ¨Demons¨(1985). The picture is smartly designed ,stylishly photographed filming in Barcelona by Civit and with a suspenseful musical score by Pagan . Bigas Luna delivers the terror movie goods with sense of style. He's an expert on murky atmosphere such as proved in ¨Caniche¨, ¨Bilbao¨ and ¨Reborn¨. The picture will appeal to horror buffs and Bigas Luna fans.",
         "A demented mother telepathically directs her middle-aged son on bloody missions of revenge.And when he's finished murdering his victims,he gouges their eyes out and adds them to the bizarre family collection.But that's only a movie:The real horror is in the cinema where the audience watching this terrifying vision is being murdered one by one.\"Angustia\" is a pretty bizarre Spanish horror film.The concept is certainly interesting and the director J.J.Bigas Luna perfectly mixes the line between the reality and the fantasy world of film.The acting is first-rate and there is plenty of gore and tension to satisfy fans of slasher films.The film is relatively unknown,but if you get a chance watch it.Highly recommended.8 out of 10.",
         "I have just watched \"Angustia\" for the fourth or fifth time, now on DVD, and I do not get tired of this original, bizarre and surrealistic cult-movie, very underrated in IMDb. I am a fan of Bigas Lune, and in my opinion \"Angustia\" is his masterpiece. The story is simple, but tense, with a soundtrack that recalls Dario Argento's movies. Michael Lerner, in the role of the mad ophthalmologist; Talia Paul, in the role of a scared viewer that becomes impressed with the film she is watching on the screen; and Ángel Jovè, in the role of a lunatic killer, are perfect. Zelda Rubinstein, with her weird tune of voice, completes the lead cast of this gem with a great performance. My vote is nine. Title (Brazil): \"Os Olhos da Cidade São Meus\" (\"The Eyes of the City Are Mine\")",
         "Before the film even begins, a message is displayed on screen warning you about the possibility of hypnosis and dizziness etc. In my opinion, that's a great way to hype someone up. And with hype, disappointment usually follows. But not with Anguish, this was a really cool little flick. The flick actually is pretty much two movies in one. I'll only describe the first story, since if I tell you about the second, it's kinda ruining it for you. The initial story follows a son who is being hypnotized and forced into murder by his mother, played by Zelda Rubinstein, the tiny lil paranormal investigator in Poltergeist. It's a pretty simple premise at first, but once the other story kicks in, the movie's tension and entertainment value is severely upped. The direction and atmosphere is all fantastic, the only minor problems is the acting, it's pretty amateur to a degree. But there are also strong performances as well, the son/murderer did a really good job. And it's killing me trying to recall what I remember him from! And at under 90 minutes, the movie doesn't last too long. Poifect! It's a rare lil horror flick that should definitely have more of a following. With a cool idea leading the way Anguish is one flick any fan of horror or of our beloved lil Zelda should without a doubt check out.",
         "Undoubtably one of the scariest and under-raved horror films of all time. Zelda Rubinstein is unforgettable, and if u liked her in the Poltergeist films she is even more stellar here. Known to horror buffs as the all-time movie within a movie... but its psychological mind-warp scene is as tense as it gets. The under-tones of the snails and doves contribute highly to the paranoia. A re-release definitely should be in order; this film deserves a second look by all. Anyone who has extreme phobia of \"anything\" to do with harm to the eyes- beware! Unfortunate that most mark this off as a \"gore-fest\" when its anything but. It is a brilliant study of the mind, and will blow you away with its oddity.",
         "This movie reminded me of many others at some points but at the same time seemed original. It was fun to watch and even though there was a lot of gore, I could stand it since I was so puzzled by the exact plot and motives. The movie inside of a movie plot worked wonders here and the appearances of Zelda Rubinstein made me want to give this an 8, since they made the characters seem as though twirling their hair would take too much intelligence.",
         "I'm not sure why this 1980s horror film is so overlooked. It is a very unique film, if a bit gimmicky. It stars Tangina (wait, I mean, Zelda Rubenstein, of course!) as a psycho-mommy whose relationship is a bit too tight with her son. In fact, she hypnotizes him on a nightly basis and has him going out about town, gouging out people's eyeballs for her personal collection! Just when you think the story couldn't get more bizarre, it does. This is definitely for fans of films about messed-up mother/son relationships. For those who can't stomach Tangina, you still might get a kick out of this truly original 80s horror flick. It's been compared to \"Demons,\" but such a comparison is superficial. Beware, most reviews on this one feature major plot spoilers!",
         "Bigas Luna's \"Anguish\" is a uniquely curious and creatively constructed Spanish horror film that'll unquestionably impress you a lot more than the average routine and dull 80's (American) slasher picture. Luna presents an odd film-within-film structure and, surprisingly enough, both segments contain equal amounts of suspense, creepiness and gruesome images. At first, we follow a middle-aged and slightly insane mother-obsessed optometrist as he goes out at night to butcher as many people as possible & cut out their eyeballs for his collection. His freaky mother (the squeakily voiced midget Zelda Rubinstein) commands him under hypnosis and his modus operandi isn't exactly subtle, as John removes his victims' eyeballs sadistically and without the slightest sense of emotion. Okay, pretty twisted & sick horror tale we got here, or so you think until, after the first couple of murders, it suddenly becomes clear that mother & son's crazed adventure is just an ordinary movie being watched in a fully-occupied theater. We're subsequently introduced to two attractive young girls \u0096 one of them feeling very uncomfortable with what she sees on screen \u0096 and then \"Anguish\" truly becomes a one-of-a-kind experience, since a totally new (and supposedly non-fictional) psycho-killer plot develops itself parallel with the macabre (and fictional?) events on screen! Yeah okay, I realize this all sounds very confusing and perhaps even a bit stupid, but director Luno presents it all dead serious and plausible. Simultaneously with John entering a movie theater in \"The Mommy\" (the title of the first movie) to collect more eyeballs, an actual deranged psychopath spots the two girls and intends to kill them. The film-within-film concept has been done before, but usually very messy and resulting in a severe anti-climax. In \"Anguish\", however, the tension is masterfully developed and the transitions from 'old' movie to 'new' movie are literally perplexing. Michael Lerner's eyeball escapades are grotesque and really gore (with extreme close-ups of gouged out eyes\u0085yuck), whereas Patty & Linda's nightmarish trip to the movie theater is intense and claustrophobic. The final twist is predictable, yes, as Luna attempts to connect the characters of both films with each other, but I honestly think I would have been disappointed if something similar wasn't done. The acting performances are excellent. Especially Michael Lerner and Talia Paul are splendid, and even Zelda Rubinstein is tolerable. She annoyed the hell out of me in the overrated \"Poltergeist\" films, but her odd appearance is ideal for an artsy Spanish horror experiment like this. \"Anguish\" is a terrific film for trained genre lovers, regretfully underrated and misunderstood to this date. Highly recommended!",
         "I first saw ANGUISH years ago and really enjoyed this film. I have yet to buy it only because I can find either only tattered VHS copies or over-priced DVD versions...Anyway the film starts off with a telepathically controlled \"mama's-boy\" who kills people and collects their eye's as souvenirs for his freaky mother. This goes on for a while, and then you find out that THIS part is just a film, and cuts to the audience. One of the members in the audience is \"hypnotized\" by the film and begins picking off the other audience members. ANGUISH is a really original and stylish film. Good story, decent acting and some cool gore make this an all-around winner...now if I could just find a cheaper copy....Recommended 8.5 out of 10"
      ],
      "genres": ["Horror"],
      "productionCompanies": [
         "Luna Films",
         "Pepon Coromina",
         "Samba P.C."
      ],
      "summaries": [
         "A film-within-a-film thriller about two teen girls among a small group of people whom are terrorized in a movie theater by a killer while watching a horror film about a murderous optometrist who stalks his victims in a movie theater in the film.",
         "John, a loutish optometrist orderly, louses up on the job and is dismissed. His odd, little mother, using a form of hypnosis, sends him out on a killing spree, starting with Caroline, the woman who caused his dismissal. But this is all just a movie titled \"The Mommy\" being shown to a small matinee crowd at a seedy movie theater in Los Angeles. As it happens, two teenage girls in the audience, the strong-willed Linda and the squeamish Patty, discover that one of the patrons sitting near them is a real maniac. In the old movie, when the scalpel-weilding John enters a movie theater and beings killing the patrons and theater employees one by one, and removing their eyeballs for his mother's collection, the killer in the audience, armed with a silenced .38 pistol, begins killing the patrons and employees of the theater in a manner which parallels the action on the movie screen.",
         "This gruesome horror film is about a mother-fixated ophthalmologist's assistant with an unhealthy interest in eyeballs and goes on a killing spree to collect human eyeballs for his mother's collection. But this is all just a horror movie viewed by a small crowd where a very real killer in the audience begins killing the patrons one by one paralleling the action in the other movie.",
         "A controlling mother uses telepathic powers to send her middle-aged son on a killing spree."
      ],
      "budget": 0
   },
   "movielensId": 3650,
   "movielens": {
      "languages": [
         "English",
         "Español"
      ],
      "releaseDate": "1987-11-10",
      "dvdReleaseDate": "2000-05-23",
      "directors": ["Bigas Luna"],
      "runtime": 86,
      "movieId": 3650,
      "title": "Anguish",
      "mpaa": "",
      "actors": [
         "Zelda Rubinstein",
         "Michael Lerner",
         "Talia Paul",
         "Àngel Jové",
         "Clara Pastor",
         "Isabel García Lorca"
      ],
      "imdbMovieId": "0090644",
      "originalTitle": "Angustia",
      "genres": [
         "Crime",
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": ["OAW_7xghhkw"],
      "plotSummary": "This gruesome horror film is about a mother-fixated ophthalmologist's assistant with an unhealthy interest in eyeballs and goes on a killing spree to collect human eyeballs for his mother's collection. But this is all just a horror movie viewed by a small crowd where a very real killer in the audience begins killing the patrons one by one paralleling the action in the other movie.",
      "tmdbMovieId": 42002,
      "avgRating": 2.90244,
      "releaseYear": "1987",
      "numRatings": 41,
      "posterPath": "/yWFA9UrrXtrVdhv3fsxsLBQ3MIb.jpg"
   }
}