{
   "tmdb": {
      "original_language": "es",
      "keywords": [
         {
            "name": "bride",
            "id": 3582
         },
         {
            "name": "mutilation",
            "id": 157512
         }
      ],
      "imdb_id": "tt0069029",
      "video": false,
      "title": "The Blood Spattered Bride",
      "recommendations": [
         120129,
         180879,
         27409,
         73740,
         72785,
         115527,
         118955,
         65448,
         119555,
         69578,
         55616,
         65317,
         43713,
         39931,
         49823,
         88176,
         38279,
         114096,
         82576,
         330222
      ],
      "backdrop_path": "/wtuBO8NOU7jL2CX2aFv2Q5OVrKR.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Husband",
               "gender": 2,
               "credit_id": "52fe458dc3a36847f80cdc19",
               "name": "Simón Andreu",
               "profile_path": "/yLP9SQRjSxwqfmfXVDftEpDmDgs.jpg",
               "id": 24496,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Susan",
               "gender": 1,
               "credit_id": "52fe458dc3a36847f80cdc1d",
               "name": "Maribel Martín",
               "profile_path": "/tQkQOfTP6sGrXvhHln0D1olo9M7.jpg",
               "id": 146796,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Mircalla Karstein",
               "gender": 1,
               "credit_id": "52fe458dc3a36847f80cdc21",
               "name": "Alexandra Bastedo",
               "profile_path": "/oDV5AgvOLXgsa62pAVrmpLBRHlq.jpg",
               "id": 105159,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Doctor",
               "gender": 0,
               "credit_id": "52fe458dc3a36847f80cdc25",
               "name": "Dean Selmier",
               "profile_path": null,
               "id": 147081,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Carol's Father",
               "gender": 0,
               "credit_id": "52fe458dc3a36847f80cdc35",
               "name": "Ángel Lombarte",
               "profile_path": null,
               "id": 237354,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Carol's Mother",
               "gender": 0,
               "credit_id": "59ca01a492514123b9005746",
               "name": "Montserrat Julió",
               "profile_path": "/iMknY3ijc4uCJUq54x9hiADufMY.jpg",
               "id": 97668,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Carol",
               "gender": 1,
               "credit_id": "5a8e56780e0a263e7700ce0f",
               "name": "Rosa M. Rodriguez",
               "profile_path": null,
               "id": 1982773,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe458dc3a36847f80cdc15",
               "name": "Vicente Aranda",
               "profile_path": "/npkQpgXnpvIUcc6vyabqBNWq0is.jpg",
               "id": 105153,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe458dc3a36847f80cdc2b",
               "name": "Vicente Aranda",
               "profile_path": "/npkQpgXnpvIUcc6vyabqBNWq0is.jpg",
               "id": 105153,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe458dc3a36847f80cdc31",
               "name": "Joseph Sheridan Le Fanu",
               "profile_path": "/bjvU12t8Qlk60OU82Lw1TbKlBW8.jpg",
               "id": 11573,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "5a8e56f3c3a368267200cc21",
               "name": "Jaime Fernández-Cid",
               "profile_path": null,
               "id": 1697469,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5a8e57030e0a263e7d00d5f2",
               "name": "José López Moreno",
               "profile_path": null,
               "id": 1625239,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "5a8e570f0e0a263e6e00dab8",
               "name": "Antonio Pérez Olea",
               "profile_path": null,
               "id": 33823,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "5a8e571cc3a368266a00b96f",
               "name": "Fernando Arribas",
               "profile_path": null,
               "id": 33824,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5a8e572a9251416c9000c2cc",
               "name": "Pablo G. del Amo",
               "profile_path": null,
               "id": 32212,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5a8e5767c3a368266a00b9b1",
               "name": "Juan Alberto Soler",
               "profile_path": null,
               "id": 33786,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "5a8e577b0e0a263e7700cf04",
               "name": "Nieves Aguado",
               "profile_path": null,
               "id": 1982775,
               "department": "Directing",
               "job": "Script Supervisor"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 2.272326,
      "production_countries": [{
         "iso_3166_1": "ES",
         "name": "Spain"
      }],
      "id": 40365,
      "vote_count": 17,
      "budget": 0,
      "overview": "A young husband's sexual fantasies frighten his new wife and cause her to seek advice from Carmilla, a descendent of Mircalla de Karnstein. Carmilla seduces the young bride and forces her to commit gory acts of mutilation.",
      "similar": [
         712,
         2959,
         24,
         50124,
         11003,
         10521,
         214,
         11931,
         6557,
         10330,
         15590,
         1597,
         37247,
         1894,
         3933,
         8273,
         9029,
         9522,
         82695,
         11778
      ],
      "original_title": "La novia ensangrentada",
      "runtime": 100,
      "poster_path": "/87g4ediyCcrGcsiqvGtLxeparYz.jpg",
      "spoken_languages": [{
         "name": "Español",
         "iso_639_1": "es"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Morgana Films",
         "id": 13996,
         "origin_country": ""
      }],
      "release_date": "1972-09-30",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "Till Death Do They Part!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Spain",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Vicente Aranda"],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "Vicente Aranda",
         "Sheridan Le Fanu"
      ],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt0069029/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcxODY4MDYwOV5BMl5BanBnXkFtZTcwODgzMzgyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Simón Andreu, Maribel Martín, Alexandra Bastedo | See full cast and crew »"],
      "reviews": [
         "By turns mysoginistic and feminist, this one has some spooky metaphorical comments on marriage, virginity and lesbianism. It also has the gorgeous cinematography, splendidly dreary autumnal locations and beautiful women going absolutely demented that we've come to expect from European horror movies of the time. Nudity is kept to the minimum, unusually, but the classically beautiful Alexandra Bastedo of cult TV series The Champions is the vampire this time, and the scene where she's discovered buried in the sand is totally surreal and inspired, almost Bunuelian. The movie flags a little in the middle, as most of them do, but the ending is suitably hysterical and subversive. It also seems to be almost a prequel for Vampyres, another stylish and sexy Spanish vampire flick.",
         "It would seem that there are two types of lesbian vampire movie; there's trashy sort (e.g. Vampyros Lesbos) and the classy sort (e.g. Daughters of Darkness). Both have their own set of merits, but in my opinion, the classier ones are the best; and this is firmly one of the latter variety. It has to be said that The Blood Splattered Bride isn't exactly a thrill a minute roller-coaster ride; but even when the plot isn't doing much, the film oozes sexy undertones, which was enough to keep me entertained, and the luscious Gothic atmosphere is a treat to behold also. The plot focuses on a newly wed couple who go to live at the husband's expansive mansion. While there, the wife becomes afraid of her husband's insatiable desire for sex and this coupled with the fact that she begins to see a supposed 'ghost' dressed in a wedding gown in the woods - who may or may not be a descendant of one of the previous family members' wives. As she becomes more alienated from her husband, she drifts further into the arms of this ghostly stranger... Unlike most lesbian vampire films, this one actually has a point beyond the obvious lesbian vampire theme. The theme is a battle between the sexes; with the husband and seductive lesbian vampire battling it out for control over his wife. This theme is laden with various images and symbols that help to portray it. Compared to other genre entries - both classy and trashy ones - this one doesn't have a great deal of blood or naked women, which is a shame - although director Vicente Aranda does give us a couple of excellent death scenes - both of which involve the sexy Maribel Martín wielding a knife. The Blood Splattered Bride seems to be a film of two halves - with most of the exciting stuff coming in the second half. This is not a problem, however, as the two sides of the film join together well and while this is not quite a classic; I'm sure that most people who bother to track it down won't be disappointed. The final fifteen minutes are excellently executed and bring good closure to a lovely slice of lesbian vampire cinema. Recommended viewing!",
         "\"The Blood-spattered Bride\" is a remarkable film filled with haunting imagery gorgeously photographed by veteran cinematographer Fernando Aribas.Wonderful Alexandra Bastedo stars as a lesbian vampire who woos frigid newlywed Maribel Martin from her husband Simon Andreu on their honeymoon.After the film is over,you'll feel like you're waking from a dream,and all the inconsistencies and leaps of logic will surely infuriate many.There is also a nice amount of nudity and gore,so fans of Euro-horror will not be disappointed.",
         "The wet-blanket editors at \"Maltin's Movie Guide\" have done it again. \"Poorly done,\" they sniff, giving a measly 1 1/2 stars to Spanish director Vicente Aranda's 1972 offering, \"The Blood Spattered Bride.\" Countering this claim is the very laudatory review in \"DVD Delirium,\" which describes the picture with words such as \"bizarre,\" \"visceral,\" \"sexy\" and \"dreamlike.\" I concur. This film, I feel, presented in its uncensored form on this great-looking DVD from Blue Underground, should prove a godsend of sorts for all lovers of adult Eurohorror. In it, a new bride moves into the childhood home of her husband, and is soon plagued by stroboscopic and hideously, uh, heart-gripping dreams featuring a beautiful blond woman. When her husband finds this dream gal buried naked at the beach, with only her snorkel protruding from the surface (one very strange scene, lemme tell you!), and brings her back home, that's when the fun begins, as the woman, Carmilla (yes, this IS another variation of Sheridan Le Fanu's oft-filmed 1871 novella), turns out to be nothing less than a bloodsucking...but perhaps I've already said too much. Featuring uniformly fine acting by all (sexy Maribel Martin as the young bride, giallo favorite Simon Andreu as the perplexed husband, the ridiculously gorgeous Alexandra Bastedo as Carmilla, and Rosa Rodriguez as a pretty 12-year-old who, in perhaps the film's strangest scene, drinks from a humongous cup of coffee), a subtle yet effective score by Antonio Perez Olea, beautiful outdoor photography of woodlands, seaside and moldering crypts, and some genuinely shocking bursts of gory carnage, this movie is my idea of an almost perfect horror package. Peppered with psychosexual allusions and concluding on a note both bleak and grisly, the film was a very pleasant surprise for me, and one that I do highly recommend. If you love the great \"Daughters of Darkness,\" you should certainly suck this one right up. Don't trust Maltin here; trust me!",
         "I'm not sure why this has such a low imdb rating. It is a very well made/smart movie compared to many of the other European female vampire movies. Not as over-the-top sexy as say...Vampyres - this may be the problem that many have with this film?? Inspired by Le Fanu's story Carmila. Pretty much the same old story: a castle, a curse, Karsteins...but BSB is artfully told. Mandatory viewing for fans of the genre. SPOILERS!!SPOILERS!!SPOILERS!!SPOILERS!!SPOILERS!!SPOILERS!!SPOILERS!!SPOILE RS!!SPOILERS!!SPOILERS!!SPOILERS!!SPOILERS!! A couple of things set Blood Spattered Bride apart from the garden variety T&A vampire flick. One: The \"vampire\" experience in this film is tied to themes of virginity and rape - most other vampire flicks sort of hint at this but none that I can remember spell it out so clearly. Tons of Freudian stuff to unwrap in this film. Second, the lesbian vampire motivation this film is fueled more by hatred for men (well...a couple of specific men at least...) than a hunger, a need for blood. The killing is revenge, the blood drinking is an aside. Very interesting. Especially unsettling is Mircala Karstein's rant to Susan about her husband violating her, spitting inside her. A genuinely creepy man-hating rant that would make Valerie Solanas proud. Other than that the film does a good job of keeping the audience off balance by cleverly smudging the line between reality and Susan's fantasies/delusions. Kept me guessing until the end. Watch the movie yourself. I don't want to completely spoil the story. There is a lot of great Freudian stuff for all you English Majors out there. BSB is a little long, but the plot is complex. After all is said and done the film actually makes sense (unlike many films in the genre). It would be great if someone remade this film - tightened the pacing a bit. BSB couldnt be made today today without probably softening the tone and cramming the film full of pointless cheesy CGI scenes. A coven of man-hating, man-hunting, man slaughtering, psychotic lesbian vampires - plenty there for a movie - maybe shoot it in black and white? Make sure the chicks win this time around.",
         "***SPOILERS*** ***SPOILERS*** When I first watched The Blood Spattered Bride nearly a year ago, I was truly wowed. The film was powerful, violent, symbolic, and, in its own bizarre and often twisted fashion, extremely erotic. It's based on the classic novel Carmila by Joseph Sheridan Le Fanu, and while I have not read that work, I get the impression that the themes of lesbianism and female sexuality have been tweaked a bit for this film. It has to do with a young virgin bride, Susan (Maribel Martin, who bears a striking resemblance to Catherine Zeta Jones!) living in the family home of her slightly older husband (Simon Andreu). Her husband is almost obbsessive about seeking sexual pleasure from his young bride, and she begins to grow repulsed by his overt sexual dominance. She is also growing fascinated by the family legend of Mircalla Karstein (Alexranda Bastedo), an infamous ancestral figure who killed her husband on their wedding night. Susan starts to have violent (and I mean REALLY violent!) nightmares about Mircala, and becomes convinced that her ghost is attempting to push Susan towards killing her husband. The main \"problem\" with The Blood Spattered Bride is that the first half and the second half are quite different. The first half of the film is reminiscent of Hitchcock's Marnie and Polanski's Repulsion, the tale of a woman's sexual frigidity and its ensuing effect on her life and mental stability. The first half of the film is easily my favorite, for it manages to be probing AND erotic at the same time...not to mention extremely violent. Although The Blood Spattered Bride is not actually a \"gore movie\", some of Susan's sexual nightmares are among the most graphic sequences captured in cinema. They are also fascinating to watch, and there is something strangely sexy about the execution of these scenes...which is perhaps symbolic of Susan's sexual frustration and fear of insanity. (MINOR SPOILERS in the next paragraph!) The second half of the film involves the appearance of Carmila, a strange woman who bears an uncanny resemblance to the woman of Susan's nightmares. I don't want to give too much away, but anyone with a familiarity of the film knows that it was one of the early films in the \"lesbian vampire\" subgenre, so you can probably guess where it's headed... The second half of the film is probably more erotic and almost as violent as the first half, and it pushes the female sexuality exploration in a whole new direction. However, this is where the vampire aspect comes into play in a big way, and the film at times feels more like a Hammer film than it does Repulsion (which is the closest parallel for the first half). (The next paragraph contains MAJOR SPOILERS as I disucss the ending of the film...please skip over this paragraph if you have not yet seen the film!) Like many other people, I could not help but feel that the ending was a bit of letdown. It's not a bad ending by any means-it's definitely a major shocker-but it was also quite abrupt, and the final shot did not exactly fit the mold for the preceding film. However, looking back at the film after seeing David Lynch's Mullholland Drive....I almost wonder if perhaps the second half of the film was actually one of Susan's nightmares?? Since it was based on a classic novel, this might not have been the intent, but clearly it could work: the turning point in the film is her husband's discovery of Carmila on the beach, easily the film's weirdest and most surreal scene. And for the rest of the film, when the vampiric themes come into play (vampirism was only referenced in her dreams prior to this), the film is NOT told from Susan's point of view. In the beginning everything is seen through her eyes, while the second half is about her husband discovering her latent lesbianism and relationship with Carmila. As such, it could easily be interpreted as a nightmare about killing her husband and then being killed...hence the abrupt, seemingly misogynistic ending. The Blood Spattered Bride is not a perfect film, but in my opinion, it is a great one. The performances are all wonderful (this is some of the best casting I have ever seen in a European horror film), and it's one of the rare EuroHorror films in which the performances are crucial to the effectiveness of the film. I don't think that interested viewers will find the film scary at all, but that's not a reason to avoid the film...as fans of EuroHorror know, there's more to a horror film than just being scared. And this film clearly exemplifies the use of a \"horror\" film to explore human psychology in a unique and thoroughly fascinating manner. High praise goes to Anchor Bay Entertainment (as usual!!) for offering The Blood Spattered Bride on DVD in its uncut form, for the first time ever on home video. The DVD restores 20 minutes of footage previously cut from home video versions in the US (I have never seen the old video versions, but am told that the cut film is, understandably, quite awful). Furthermore, the DVD presents a goregous anamorphic widescreen print of the film that makes the experience all the more pleasing...you might want to think twice before purchasing a film as unusual as this one sight unseen, but I would highly recommend seeing the DVD incarnation of the film if at all possible. My Grade: A-",
         "In the form of a story about a newly wed woman who we witness losing her virginity the exploitation-y titled 'The Blood Spattered Bride' thematically covers a lot of the same and similar grounds to 'Valerie and Her Week of Wonders' albeit very much focusing on all the psychosexual aspects. Where \"Valerie\", summed up, is a film about a girl's sexual awakening after her menarche (=first menstrual bleeding) and all the other realizations that can result from that awakening, for example about religion and the government, \"Bride\" is about a young woman's sexual awakening (her age is never specified, the actress was about 18 years old at that point) which makes the woman fall into a psychotic state that makes her feel fear and disgust of men so this character's psychology isn't dissimilar to Catherine Deneuve's in 'Repulsion', it also roughly covers the events of one week although just like in \"Valerie\" it seems like development in a compressed form, showing a psychological evolution that usually would have to take considerably longer. Despite the supernatural elements in the story other than in \"Valerie\" one is prone to take the ongoings in the film literally because of its mundane visual style and the relatively coherent plot that wouldn't obviously suggest a symbolic reading although if one takes things on face value here it would be a rather ridiculous and unintelligently written film, but if taken metaphorically, always with the theme in mind, it's just the opposite. There certainly are quite a few surreal touches, though, both movies also include a good share of vampirism as well as lesbianism although neither of them really is a vampire, a horror nor an erotic movie, at least they aren't predominantly any one of those things. Another prevalent theme (especially as \"Bride\" reaches its conclusion) is that of the inspirational power of history as well as having a certain responsibility to act upon sacrifices other people made in the past, in this specific case especially in regards to feminism. Carmilla, the vampire with lesbian tendencies who becomes increasingly more real, is like a figure conjured up by the bride's fears and desires and that figure is a resurrection of a person that really existed within the fiction of the film, most likely materialized in idealized form to fit the bride's purposes. Although I think the film is feminist in its intent it interestingly has no qualms to come off as misogynist at times (especially in the first half) when showing the often violent male oppression and sexual dominance since, unlike \"Valerie\" or 'Repulsion', it doesn't choose a point of view, it's (almost) as much the husband's film as it is hers. I think the sympathies are clearly with the bride (which makes the ending all the more refreshing) but thematically the husband's male psychology is almost as fleshed out as hers and his psychological torture can at times also be felt. While I obviously think that thematically it's a great and intelligent movie it's certainly a minus that if taken literally the movie doesn't hold up well. Visually it's largely unremarkable although it does have its moment, especially one gory fantasy sequence in the middle section and the much talked about surreal beach sequence offer some notable visuals. The characterizations are coherent and believable but I wouldn't go as far as to call any of them well-developed. In one scene the movie's themes are actually blatantly spelled out with the characters reading out of psychology books that quote Plato and Jung. This being my first contact with Sheridan Le Fanu's Carmilla novel possibly helped my appreciation of the film, had I read the book or seen other films that were based on it things might look differently, but I haven't.",
         "After getting married with her husband (Simón Andreu), Susan (Maribel Martín) travels with him to his isolated manor. The sexual drive of the husband is intense, and Susan feels repulse for his sexual games and perversions. Susan notes that there are only paintings of his male ancestors and none of their wives and she learns that the pictures are kept in the basement. When she sees the painting of Mircalla Karstein (Alexranda Bastedo), a.k.a. Carmilla, without her face, her husband tells that Carmilla killed her husband in the honeymoon. During the night, Susan has dreadful nightmares with Carmilla. When Susan's husband finds a naked woman buried on the beach, he brings her home and finds that she is Carmilla. Susan is seduced by the woman and they have a lesbian relationship. Meanwhile her husband realizes that his life is in danger and Carmilla is a vampire. \"La Novia Ensangrentada\", a.k.a. \"The Blood Spattered Bride\", is an erotic and gore vampire film with an ambiguous story developed in a nightmarish atmosphere, but having a weak conclusion. The story is never clear that Mircalla Karstein is a vampire indeed and based on the news in the disappointing conclusion, the plot may be understood differently, with the disturbed and dysfunctional Susan meeting the deranged stranger and having sexual attraction and making lesbian love with her. My vote is six. Title (Brazil): Not Available",
         "A vulnerable, virginal young bride, Susan(Maribel Martin)slowly unravels upon moving to her husband's(Simón Andreu)ancestral castle estate due in part to nightmares involving a vampiress names Mircalla(Alexandra Bastedo, without make-up)who motivates a growing hatred for men and heterosexual sex. A dagger turns up and seems to always return to Susan's hands and the film shows possible danger looming for the husband's life after we witness a horrifying dream sequence where Mircalla convinces her to stab him viciously. A local doc(Dean Selmier)seems to be the only one the Susan's husband can confide in regarding her declining mental state. Soon, a human Mircalla(..identifying herself as Carmilla)is found by the husband buried under sand(?!)and given a guest room for the night. Soon Susan and Carmilla are holding hands as they stroll at midnight to the ruins of a castle, emerged a bit in water, which holds the crypt of Marcalla..Carmilla begins to take the blood of Susan turning her into a vampire and violent slave securing a wrath which many men amongst the husband's inner circle find out unfortunately first-hand. Whether it be the doc or groundskeeper, Susan obeys Carmilla's command, burying the dagger into torsos or slashing and hacking wildly like a madwoman(..one even receives blasts to the face with his shot-gun). The quiet, delicate Susan has become an unstable, destructive cold-blooded vessel for Carmilla to exact her rage towards the opposite sex. Susan's husband will have to take matters into his own hands or else the blood-shed will continue without end. Young 12-year old Carol(Maria-Rosa Rodriguez)is also being used by Carmilla as a tool to capture Susan. I know this opinion might not be popular, but I was rather disappointed with this particular tale based on Carmilla. I didn't find it particularly erotic, although there is some nudity(Martin's gown and bra are ripped away by Andreu in both a rape fantasy, with him wearing a stocking over his head molesting her, and the real sexual confrontation which occurs with a much closer view of the event). The height of this film should be the budding sexual relationship between Carmilla and Susan, but this seems rather abandoned with director Vincente Aranda instead focusing more on bloodshed. The dagger stabbings are rather bloody and intense with Susan plunging the blade in multiple times with red going all over the place. The setting is of course atmospheric(..what is it about these European locales that adds so much to horror films?)and the particular season seems to be Autumn with Winter on the horizon. I have no problems with the \"slow burn\" approach and consider myself a patient movie viewer, but I have to admit to looking at my watch a few times..the film often crawls. I felt that the husband waits a bit too long to move into action, and why he allows Susan to fall under Carmilla's spell instead of leaving the estate or seeking proper guidance(..he obviously is wealthy and could probably get his wife the best psychiatry money could afford)bothered me. He sits idly by and lets Susan slowly sink deeper into the abyss, Carmilla's hypnotic grip tightening. I do believe others will rate this film much higher than me based on how nice it looks visually, but I found the story a bit padded and this should've been more erotic than it turns out to be. Most of Carmilla and Susan's love-making is hinted at through the dialogue of the doc than elaborated on screen. Aranda instead opts to show Carmilla biting her on the neck pulling away before they embrace in lesbian passion.",
         "The 'Lesbian Vampire' sub-genre, which was quite popular in European Horror/Exploitation cinema of the 70s, has brought forth a variety of films that are worth watching including remarkably artistic gems like Harry Kümel's \"Les Levres Rouges\" (\"Daughters of Darkness\", 1971) and entertainingly trashy flicks such as those by Jess Franco and Jean Rollin. Vincente Aranda's \"La Novia Ensagrentada\" aka. \"The Blood Spattered Bride\" of 1972 is one of the artistic ones, and it certainly also ranks among the highly recommendable contributions to the 'Lesbian Vampire' sub-genre. As the British Hammer Studios' great \"The Vampire Lovers\", which is the first part of Hammer's 'Karnstein' trilogy and one of the films that started the Lesbian Vampire trend, \"The Blood Spattered Bride\" is based on Joseph Sheridan Le Fanu's brilliant Gothic novel \"Carmilla\". This film transfers the plot to the present day (1972); when a newlywed couple move into the huge mansion belonging to the husband (Simón Andreu), the young wife (Maribel Martín), who is somewhat frightened by her husband's sexual fantasies, soon becomes disturbed. When looking through family portraits in the cellars, the wife stumbles across a mysterious portrait of a woman, the face of whom was cut out of the painting. The painting says \"Mircalla Karnstein\"... While \"La Novia Ensangrentada\" isn't the best adaptation of Sheridan LeFanu's novel (\"The Vampire Lovers\" is, no doubt), it is yet another very good film based on this classic of Gothic literature. Plot-wise, the film has some small holes; the narration is sometimes slow and then seems rushed again. These minor faults are easily made up for by the hauntingly beautiful imagery and wonderfully creepy atmosphere. The family mansion, which is set in a forest estate, makes a magnificent horror setting and the beauty and variety and of the colors of darkness in this film is amazing. \"The Blood Spattered Bride\" has a nice cast, with actors that should be known to Eurohorror fans. The husband is played by cult-actor Simón Andreu, who was the leading man in many Spanish and Italian Horror productions (including Luciano Ercoli's Gialli). The very beautiful but very young Maribel Martin (she was 17 at the time the film was shot) is great in the role of the wife and ravishing Alexandra Bastedo is wonderful in her mysterious and seductive role. Great praise also has to go to Maria-Rosa Rodriguez, another child actress who proves that children actually can be good actors. Rodriguez, who I estimate was about 13 when this film was made delivers a great performance and some genuine eeriness. Overall, \"La Novia Ensangrentada\" is a very good addition to the Lesbian Vampire sub-genre that should be seen by any Eurohorror fan who has seen the genre-masterpieces like \"Les Lèvres Rouges\" and \"The Vampire Lovers\". My rating of \"La Novia Ensangrentada\": 7.5/10"
      ],
      "genres": ["Horror"],
      "productionCompanies": ["Morgana Films"],
      "summaries": [
         "A young husband's sexual fantasies frighten his new wife and cause her to seek advice from Carmilla, a descendent of Mircalla de Karnstein. Carmilla seduces the young bride and forces her to commit gory acts of mutilation.",
         "After getting married with her husband, Susan travels with him to his isolated manor. The sexual drive of the husband is intense, and Susan feels revulsion towards his sexual games and perversions. Susan notes that there are only paintings of his male ancestors and none of their wives and she learns that thir pictures are kept in the basement. When she sees the painting of Mircalla Karstein, a.k.a. Carmilla, without her face, her husband tells that Carmilla killed her husband during their honeymoon. During the night, Susan has dreadful nightmares about Carmilla. When Susan's husband finds a naked woman buried on the beach, he brings her home and finds that she is Carmilla. Susan is seduced by the woman and they have a lesbian relationship. Meanwhile her husband realizes that his life is in danger and Carmilla is a vampire."
      ],
      "budget": 0
   },
   "movielensId": 3651,
   "movielens": {
      "languages": ["Español"],
      "releaseDate": "1972-09-30",
      "dvdReleaseDate": "2000-05-23",
      "directors": ["Vicente Aranda"],
      "runtime": 100,
      "movieId": 3651,
      "title": "The Blood Spattered Bride",
      "mpaa": null,
      "actors": [
         "Simón Andreu",
         "Maribel Martín",
         "Alexandra Bastedo",
         "Dean Selmier",
         "Ángel Lombarte",
         "Montserrat Julió"
      ],
      "imdbMovieId": "0069029",
      "originalTitle": "La novia ensangrentada",
      "genres": ["Horror"],
      "youtubeTrailerIds": ["zDvTRe6M1cY"],
      "plotSummary": "A young husband's sexual fantasies frighten his new wife and cause her to seek advice from Carmilla, a descendent of Mircalla de Karnstein. Carmilla seduces the young bride and forces her to commit gory acts of mutilation.",
      "tmdbMovieId": 40365,
      "avgRating": 2.37879,
      "releaseYear": "1972",
      "numRatings": 33,
      "posterPath": "/87g4ediyCcrGcsiqvGtLxeparYz.jpg"
   }
}