{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "surfer",
            "id": 1524
         },
         {
            "name": "surfboard",
            "id": 1671
         },
         {
            "name": "surfing",
            "id": 5349
         }
      ],
      "imdb_id": "tt0060371",
      "video": false,
      "title": "The Endless Summer",
      "recommendations": [
         24257,
         15292,
         43459,
         79554,
         114903,
         44284,
         41648,
         306547,
         297421,
         96171,
         144156
      ],
      "backdrop_path": "/8vtPfPla4biTyLu28SOc88XXG1f.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 13,
               "character": "Himself",
               "gender": 0,
               "credit_id": "55a58678c3a36812f1000041",
               "name": "Michael Hynson",
               "profile_path": null,
               "id": 1487339,
               "order": 1
            },
            {
               "cast_id": 14,
               "character": "Himself",
               "gender": 2,
               "credit_id": "55a586a492514171ca00005b",
               "name": "Robert August",
               "profile_path": null,
               "id": 92,
               "order": 2
            },
            {
               "cast_id": 15,
               "character": "Himself",
               "gender": 0,
               "credit_id": "55a586c992514171c4000056",
               "name": "Lord 'Tally Ho' Blears",
               "profile_path": null,
               "id": 1487342,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "Narrator",
               "gender": 2,
               "credit_id": "55a586d4c3a36812f100004f",
               "name": "Bruce Brown",
               "profile_path": "/t2yDx3OLqFNzCjIOWIjEHbzrRcb.jpg",
               "id": 86,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Himself",
               "gender": 0,
               "credit_id": "55a586e4c3a36812ea000083",
               "name": "Chip Fitzwater",
               "profile_path": null,
               "id": 1487343,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Himself",
               "gender": 0,
               "credit_id": "55a586f2c3a36812f500006b",
               "name": "Chuck Gardner",
               "profile_path": null,
               "id": 1487344,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Himself",
               "gender": 0,
               "credit_id": "55a58701c3a3681301000052",
               "name": "Wayne Miyata",
               "profile_path": null,
               "id": 1487345,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe420fc3a36847f8000dc1",
               "name": "Bruce Brown",
               "profile_path": "/t2yDx3OLqFNzCjIOWIjEHbzrRcb.jpg",
               "id": 86,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe420fc3a36847f8000dc7",
               "name": "Bruce Brown",
               "profile_path": "/t2yDx3OLqFNzCjIOWIjEHbzrRcb.jpg",
               "id": 86,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe420fc3a36847f8000dcd",
               "name": "Bruce Brown",
               "profile_path": "/t2yDx3OLqFNzCjIOWIjEHbzrRcb.jpg",
               "id": 86,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 0,
               "credit_id": "52fe420fc3a36847f8000dd7",
               "name": "Gaston Georis",
               "profile_path": null,
               "id": 95,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "55a5860092514171bb00004c",
               "name": "Robert Bagley",
               "profile_path": null,
               "id": 1487336,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "55a5861fc3a36812ec000050",
               "name": "John Blakeley",
               "profile_path": null,
               "id": 1487337,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "55a58631c3a36812ea00006f",
               "name": "Walter Georis",
               "profile_path": null,
               "id": 1487338,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "55a5864692514171c1000052",
               "name": "Bruce Brown",
               "profile_path": "/t2yDx3OLqFNzCjIOWIjEHbzrRcb.jpg",
               "id": 86,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "55a58654c3a36812ec000054",
               "name": "Bruce Brown",
               "profile_path": "/t2yDx3OLqFNzCjIOWIjEHbzrRcb.jpg",
               "id": 86,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 2.20971,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 21,
      "vote_count": 28,
      "budget": 0,
      "overview": "The Endless Summer, by Bruce Brown, is one of the first and most influential surf movies of all times. The film documents American surfers Mike Hynson and Robert August as they travel the world during California’s winter (which back in 1965 was off-season for surfing) in search of the perfect wave and an endless summer.",
      "similar": [
         291,
         1089,
         9408,
         34096,
         22271,
         230294,
         11544,
         1824,
         676,
         1979,
         222936,
         9870,
         65057,
         332567,
         43959,
         316023,
         82684,
         255343,
         23470,
         12518
      ],
      "original_title": "The Endless Summer",
      "runtime": 91,
      "poster_path": "/jqsZQPxeMjcvVN5aFGgAk7qQodr.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Bruce Brown Films",
         "id": 13723,
         "origin_country": ""
      }],
      "release_date": "1966-06-15",
      "vote_average": 7.8,
      "belongs_to_collection": {
         "backdrop_path": "/rbeqwDmy0yPMxBqA2ELvu08okcn.jpg",
         "name": "The Endless Summer Collection",
         "id": 252313,
         "poster_path": "/zhG3P4ALlXxoFi0CGfcVsR3qmDL.jpg"
      },
      "tagline": "The Search for the Perfect Wave!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Bruce Brown"],
      "runtime": 95,
      "synopsis": "Ils l'appellent l'Été Sans fin ..... L'aventure de surf ultime, en traversant la grosse goutte à la recherche du signe parfait.... Des eaux inexplorées de l'Afrique Ouest, aux mers remplies d'aigrefin de l'Australie, au paradis tropical de Tahiti et au-delà, ces surfeurs de Californie accomplissent en quelques mois ce que la plupart des personnes ne font jamais dans une vie... Ils vivent leur rêve. Le directeur Bruce Brown crée un film si puissant c'est devenu un chef-d'uvre sans âge qui continue à capturer l'imagination de chaque nouvelle génération. .... Quand il a d'abord été joué dans les théâtres, les audiences ont doublé jusqu'à le voir le à plusieurs reprises, ensorcelé par son excitation saisissante et photographie impressionnante. Mais en fait, ce qui est le plus fascinant du film est le sport de surf lui-même et dès que vous l'aurez vu, vous n'oublierez jamais pourquoi..........",
      "writers": ["Bruce Brown"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0060371/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEzODQ1Njg4M15BMl5BanBnXkFtZTgwODIyOTcwMjE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Robert August, Michael Hynson, Lord 'Tally Ho' Blears | See full cast and crew »"],
      "reviews": [
         "What a fun little film this is! Every 5 or 6 years I revisit this work and enjoy it as much as the first time I saw it. My hat is off to Bruce Brown for having the vision and determination to create this film. With cinematography, music, and narration that is easy on the mind and eyes, this film floats through the screen and has you envisioning your own paradise, whether or not you're a surfing aficionado. The two featured surfers in this film are at the top of their sport and seem to be doing it only for love - NOT for big prizes or cash purses. There is a unique innocence about this film that is very appealing. See this film because it is not violent. See it because there are no special effects (save one or two jerky camera moves). See it because it takes you back to a simpler time when the world (and you do see much of the world) seems much simpler. Still fun and still an inspiration, this film will remain forever timeless...",
         "Back before Sean Penn gave us his hilarious interpretation of a surfer as a drugged-out loser with a limited vocabulary in \"Fast Times At Ridgemont High\", the common image of a surfer was that of a clean-cut guy who surfed just like other people sailed or fished. They were normal people. This film was made during that time, when surfing was a sport and surfers were athletes. And its that charm that makes this film special. Bruce Brown had made 4 feature-length films prior to making this one, but this film's incredible success made him a cult hero, a Cinderella story who came out of nowhere to give us a film that could quite possibly be the best surfing documentary ever made. His premise was simple: take 2 surfers and try to achieve what everyone dreams of: an endless Summer of sun, surf, and girls (but mostly surf). Brown's narration, with its soft California tone, really gives the film that comfortable, easy feeling, like watching an old Walt Disney film from the early 60's, which contributes to the film's charm. We know, we just know, that these two guys are going to go out on an adventure and nobody will die, nobody will get arrested, and nobody will do anything immoral (or at least _too_ immoral). From the west coast of Africa, to South Africa, to Australia, to islands in the Pacific, to Hawaii, we go along as two young men from California introduce the sport of surfing to people who have never seen a surfboard before. It is quite hilarious to see villagers in Ghana and Senegal try to surf a longboard in heavy surf for the first time, and Bruce's narration really tells a funny story, and all along we're relaxing to the gentle guitar sounds of The Sandals. We also get to see some of the best surfers riding some great waves in the age before the beaches got crowded with jet skis, racing boats, and more surfers. \"Endless Summer\" is one of those films that acts like a time capsule, and is just as entertaining now as it was when it first came out. I highly recommend it for everyone. Adults, kids, surfers, non-surfers. There's something for everyone in this film. You don't need to know how to surf to enjoy this movie.",
         "Despite the fact that this film is over thirty years old it's just as good as when it first came out in 66. No plot, No stars. Two guys who take off to surf the world (or at least as much of it as they can)in search of the perfect wave and are photographed as they do it. Good narration and great surfing footage along with the right amount of humor thrown in makes it an endless classic without really being a documentary.",
         "Forget the Hollywood teen scene movies from the 60's with Frankie and Annette. That was teen exploitation (and the teens knew it and didn't watch them, either). This movie is completely different. \"Endless Summer\" is not exactly a drama, but not exactly a documentary either. You follow two young surfers as they travel the globe looking for the elusive \"Endless Summer\" of year-round surfing. The narration is hilarious and the surf action will make even the novice landlubber want to grab a raft and skip across the backyard pool. No bikini-clad girls trying to understand boys. No swim-trunk clad boys trying to understand girls. No meddling chaperones and hilarious hi-jinks. No musical guest stars. What you get is one of the best films about surfing and Life. Period. Surfers will own it already, but for those who haven't seen it - see it.",
         "Beautifully filmed, wonderfully nostalgic trip to a simpler time. A labor of love by those who lived the life and embraced the philosophy of the lifestyle. Characterized by friendly exploration of different beaches (as they chased Summer around the globe) as well as different cultures; a true escape in every sense of the word. These ambassadors of the sport don't perform a high energy showcase of different surfing moves, rather they exhibit the beauty and grace of 60's style surfing, making friends along the way. A must for anyone who has ever been on a board or dreamed of it. A great film for the whole family, I put it on on a Sunday night to forget the stress of the upcoming week. Watch it over and over-- it gets better every time.",
         "THE ENDLESS SUMMER is a terrific Documentary and a really great \"trip\" (in every sense of the word) to another era: the 1960's. Basically, the film is a photographic journal of two American surfers who start off from California, USA, and travel the world to find \"the perfect wave\". We follow them as they travel, and, if we're in a receptive mood, we have a lot of fun also. The film includes most of their trip, but the focus is on their journey through North and South Africa, New Zealand,Hawaii, Tahiti and Australia. The film features some typical surfer humour that some would find a bit \"lame\", but it always makes me laugh. One silly example: The two surfers pack their bags for their trip. One of them reads about possible shark attacks. The next thing that we see is the other one packing a single \"band-aid\"...for emergencies! Typical surfer humour!! Interestingly, but unfortunately for us, the only place the boys can't find a decent surf is here, in Australia! During their Australian trip they are constantly told by the younger and older surfers alike: \"You guys really missed it. You should have been here yesterday!\" This really means: \"You guys really missed it. You should have been here last winter!\" There are so many good things in the film to enjoy: the laconic narration by Bruce Brown; the personalities of the two surfers, Robert and Mike; the evocative music score; the excellent photography and editing; and the scenic locations all combine to make this a great experience. This is one of the few films that will make you really appreciate surfing...and documentary films. It's a fine example of how to make an imaginative film with a small budget. THE ENDLESS SUMMER is truly one trip definitely worth taking!",
         "This was an entertaining and educational trip around the world. It follows two American surfers who are seen visiting West Afrcia, South Africa, India, Australia, New Zealand and, of course, Hawaii. For one thing, it was interesting to see how they looked at prices of things. For example, in Africa, they are astounded at having to pay $30 a night to stay in a motel or pay $1 for a gallon of gasoline. (I'll bet they would change their tune today!) The film gives you a good feel for the '60s surf scene with the lingo (\"stoked, hang ten, etc.\") The surging can get boring after awhile but Bruce Brown, who made this film and narrates it, usually didn't overdo those parts and he does an outstanding job narrating to keep our history. He's interesting and he's funny. There are some memorable moments: seeing a place where the waves go past the sand right to the shore and then back out again; the famous Waimea Bay of Hawaii, of the biggest waves ever to be surfed; the perfect waves on the east side of Africa, the incredible scenery in New Zealand and the flies in Perth, Australia! A fun movie. If you enjoyed this, check out the sequel \"Endless Summer II.\" That is very good, too, and with better camera-work.",
         "The sport of surfing has changed much over the years and this insightful documentary gives us a snapshot of the sport in the 60's. What is most impressive about the movie is the excellent narrative and photography. I recently have received the movie poster from allposters.com and I recommend this to anyone who is a Bruce Brown or surfing enthusiast.",
         "Interesting, intelligent and well-narrated movie done in the days of innocence before boring thrash-metal soundtracks drowned out commentary from surf-movies. No matter what age you are, if you like surfing (and probably if you don't) you will find this movie interesting as it travels around the world examining cultures and people as well looking for the \"perfect wave\". Sure, Bruce Brown's commentary may sometimes sound goofy but it enhances the innocent feel of the movie and its place in time. This is the definitive surf movie - the measure by which other movies can only be judged. A recent \"Realsurf\" website (Realsurf publishes worldwide surf reports on the internet) reader pool of '000's voted \"Endless Summer\" as the best surf movie of all time with daylight second and Endless Summer 2 next.",
         "Outstanding documentary about two young surfers who travel the world looking for a good wave. Bruce Brown's cinematography is breath-taking, and the ongoing narration (also by Bruce) is inspired and truly funny. One of those rare movies that you wish would never end. Followed by the equally-good Endless Summer II 30 years or so later, which must be close to a record for sequels."
      ],
      "genres": [
         "Documentary",
         "Sport"
      ],
      "productionCompanies": ["Bruce Brown Films"],
      "summaries": [
         "They call it The Endless Summer the ultimate surfing adventure, crossing the globe in search of the perfect wave. From the uncharted waters of West Africa, to the shark-filled seas of Australia, to the tropical paradise of Tahiti and beyond, these California surfers accomplish in a few months what most people never do in a lifetime...They live their dream. Director Bruce Brown creates a film so powerful it has become a timeless masterpiece that continues to capture the imagination of every new generation. When it first played in theaters, audiences lined up to see it again and again, spellbound by its thrilling excitement and awesome photography. But in fact, what's most compelling about the film is the sport of surfing itself, and once you've seen it, you'll never forget why.",
         "The crown jewel to ten years of Bruce Brown surfing documentaries. Brown follows two young surfers around the world in search of the perfect wave, and ends up finding quite a few in addition to some colorful local characters."
      ],
      "budget": 50000
   },
   "movielensId": 3653,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1966-06-15",
      "dvdReleaseDate": "2000-05-23",
      "directors": ["Bruce Brown"],
      "runtime": 95,
      "movieId": 3653,
      "title": "The Endless Summer",
      "mpaa": "PG",
      "actors": [
         "Michael Hynson",
         "Robert August",
         "Lord 'Tally Ho' Blears",
         "Bruce Brown",
         "Chip Fitzwater",
         "Chuck Gardner",
         "Wayne Miyata"
      ],
      "imdbMovieId": "0060371",
      "originalTitle": "The Endless Summer",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["yZsuQXKkPdw"],
      "plotSummary": "The Endless Summer, by Bruce Brown, is one of the first and most influential surf movies of all times. The film documents American surfers Mike Hynson and Robert August as they travel the world during California’s winter (which back in 1965 was off-season for surfing) in search of the perfect wave and an endless summer.",
      "tmdbMovieId": 21,
      "avgRating": 3.79259,
      "releaseYear": "1966",
      "numRatings": 769,
      "posterPath": "/jqsZQPxeMjcvVN5aFGgAk7qQodr.jpg"
   }
}