{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "suicide",
            "id": 236
         },
         {
            "name": "callgirl",
            "id": 550
         },
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "eating and drinking",
            "id": 1240
         },
         {
            "name": "childhood friends",
            "id": 160246
         }
      ],
      "imdb_id": "tt0070130",
      "video": false,
      "title": "La Grande Bouffe",
      "recommendations": [
         42631,
         43379,
         104317,
         246473,
         69913,
         129971,
         67378,
         56693,
         364002,
         58702,
         76482,
         38438,
         10319,
         35797,
         44658,
         36143,
         80441,
         119555,
         147287,
         227245
      ],
      "backdrop_path": "/cRlV4LoIKQc3LGozJRaKeVOTaHs.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Marcello",
               "gender": 2,
               "credit_id": "52fe43269251416c75005735",
               "name": "Marcello Mastroianni",
               "profile_path": "/mZCdZhu5UfS8As8gSoyxYAsXVNl.jpg",
               "id": 5676,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Ugo",
               "gender": 2,
               "credit_id": "52fe43269251416c75005739",
               "name": "Ugo Tognazzi",
               "profile_path": "/3CKdR5x869QViYxjv4tp92JcfHT.jpg",
               "id": 32312,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Michel",
               "gender": 2,
               "credit_id": "52fe43269251416c7500573d",
               "name": "Michel Piccoli",
               "profile_path": "/gz91b4tVn6yYsKemek2YkUdjlSH.jpg",
               "id": 3784,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Philippe",
               "gender": 2,
               "credit_id": "52fe43269251416c75005741",
               "name": "Philippe Noiret",
               "profile_path": "/13vb0RuOI0t8I1y04pnz81vLptl.jpg",
               "id": 24366,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Andrea",
               "gender": 1,
               "credit_id": "52fe43269251416c75005745",
               "name": "Andréa Ferréol",
               "profile_path": "/s2S1HoKHbUaSGx5fbS4nXBPwL0j.jpg",
               "id": 10262,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Danielle",
               "gender": 0,
               "credit_id": "55deaa15c3a3686e8c001382",
               "name": "Solange Blondeau",
               "profile_path": "/9hVDfZ9CzuKIxTCYq5N0d65uf3D.jpg",
               "id": 1500819,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Anne",
               "gender": 0,
               "credit_id": "55dead2e925141472d0012af",
               "name": "Florence Giorgetti",
               "profile_path": "/sdANlZ8LsOW9GKMFzxV9NrUHITD.jpg",
               "id": 225235,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Nicole",
               "gender": 0,
               "credit_id": "55deae629251414729001325",
               "name": "Michèle Alexandre",
               "profile_path": null,
               "id": 1500822,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Madeleine",
               "gender": 1,
               "credit_id": "55deaf65925141472000130d",
               "name": "Monique Chaumette",
               "profile_path": "/enNBaOZfgEXOdlhrfEvoNBgNRNG.jpg",
               "id": 36315,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Hector",
               "gender": 0,
               "credit_id": "55deb0c6c3a3686e88001325",
               "name": "Henri Piccoli",
               "profile_path": null,
               "id": 1500823,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Chef",
               "gender": 0,
               "credit_id": "59a421b79251414d4c0150f1",
               "name": "Giuseppe Maffioli",
               "profile_path": "/sgOKax9dOirGEpx8dQcFHJU02Oo.jpg",
               "id": 240092,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43269251416c75005707",
               "name": "Marco Ferreri",
               "profile_path": "/ne613TRedYwJf44C6gopz1pKD8P.jpg",
               "id": 34264,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43269251416c7500570d",
               "name": "Rafael Azcona",
               "profile_path": "/gYOUk2TKJxe48oaoToiLiN24x9V.jpg",
               "id": 37590,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43269251416c75005713",
               "name": "Francis Blanche",
               "profile_path": "/qVsqVa28aUG2zm9snBog2ZJPQTv.jpg",
               "id": 39645,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43269251416c75005719",
               "name": "Vincent Malle",
               "profile_path": null,
               "id": 19052,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43269251416c7500571f",
               "name": "Philippe Sarde",
               "profile_path": null,
               "id": 20075,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe43269251416c75005725",
               "name": "Mario Vulpiani",
               "profile_path": null,
               "id": 63947,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe43269251416c7500572b",
               "name": "Claudine Merlin",
               "profile_path": null,
               "id": 34908,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe43269251416c75005731",
               "name": "Gina Pignier",
               "profile_path": null,
               "id": 63948,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5a9bfe35c3a3680b570336fa",
               "name": "Michel de Broin",
               "profile_path": null,
               "id": 11211,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "5a9bfe3fc3a3680c08030e24",
               "name": "Claude Suné",
               "profile_path": null,
               "id": 11210,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "5a9bfe490e0a2605c6030a4b",
               "name": "Gitt Magrini",
               "profile_path": null,
               "id": 18214,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "5a9bfe52c3a3680beb032328",
               "name": "Jacky Bouban",
               "profile_path": null,
               "id": 1551400,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "5a9bfe5bc3a3680b5703371b",
               "name": "Alfonso Gola",
               "profile_path": null,
               "id": 32912,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "5a9bfe690e0a2605f20314db",
               "name": "Jean-Pierre Ruh",
               "profile_path": null,
               "id": 19344,
               "department": "Sound",
               "job": "Sound Engineer"
            },
            {
               "gender": 2,
               "credit_id": "5a9c00be925141286d030df4",
               "name": "Marco Ferreri",
               "profile_path": "/ne613TRedYwJf44C6gopz1pKD8P.jpg",
               "id": 34264,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 6.661335,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         }
      ],
      "id": 10102,
      "vote_count": 98,
      "budget": 0,
      "overview": "A group of men hire some prostitutes and go to a villa in the countryside. There, they engage in group sex and resolve to eat themselves to death.",
      "similar": [
         979,
         22705,
         2149,
         25832,
         11826,
         6075,
         4771,
         80752,
         339692,
         19053,
         8067,
         226,
         429733,
         1024,
         23949,
         49950,
         86838,
         8012,
         2275,
         59967
      ],
      "original_title": "La Grande Bouffe",
      "runtime": 135,
      "poster_path": "/om8Kka9e4GStOAcX6gVEBJAoAXc.jpg",
      "spoken_languages": [
         {
            "name": "Italiano",
            "iso_639_1": "it"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Capitolina Produzioni Cinematografiche",
            "id": 1415,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Films 66",
            "id": 918,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Mara Films",
            "id": 16352,
            "origin_country": ""
         }
      ],
      "release_date": "1973-05-16",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Marco Ferreri"],
      "runtime": 130,
      "synopsis": null,
      "writers": [
         "Marco Ferreri",
         "Rafael Azcona"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0070130/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI2NTg0Njg4NV5BMl5BanBnXkFtZTYwOTk1MDA5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Marcello Mastroianni, Michel Piccoli, Philippe Noiret | See full cast and crew »"],
      "reviews": [
         "The European arthouse movie, since the 50s at least, has been generally seen in opposition to Hollywood. Instead of relying on cartoonish genre, broad comedy and loud, violent action, it supposedly offers analysis, detail, character, critique, context, civilised intelligence. Crudely put, Hollywood appeals to the senses, European films to the mind. LA GRANDE BOUFFE is an almost archetypally European movie - a Franco-Italian co-production, directed by a noted auteur, Marco Ferreri, and starring arguably the three greatest of all European actors, Marcello Mastroianni, Michel Piccoli and Phillipe Noiret. It features allusions to philosophy, art history and literature, and is confined, Bunuel-like, to the single set of a decaying town mansion. It is also about four middle-aged men stuffing themselves to death, blocking toilets until they messily explode, and, er, breaking wind. Ferreri treats his theme of excess - food, sex, self-pity - with an almost Oriental restraint, matching lengthy, static long shots so dense with detail and so darkly lit that it's often difficult to make anything out, to extreme close-ups, pitilessly exposing yet also strangely moving: a bit like Ozu filming Fellini. It's hard to know how to recommend this film - and I do, very strongly. Four professionals - a cook, a pilot, a TV producer and a judge - convene at the latter's unused mansion to spend a weekend non-stop eating a prodigiously elaborate feast made from the choicest meats: many prospective meals are walking about in the garden. We gradually learn that they have come here to die, but Marcello is unable to continue without sex, so they hire some prostitutes, as well as inviting a local, seemingly innocent, teacher, who is soon revealed to have appetites equal to any of the men. And so the men eat. And eat. And eat. They sometimes have sex, watch antique 'erotic' slides, drive cars, get sick. But mostly they eat. They even have competitions to see who can eat the fastest. This, ironically, does not sound very appetising for the viewer. There is no narrative drive for instance - any conflict possibly brought by the pure, innocent Andrea, a symbol of life in an atmosphere of decay, to whom Phillipe proposes marriage, are quickly dashed by her own taste for depravity. The men decide to die, and we watch them do it. The film begins with a methodical introduction to all four characters, and ends as methodically picking each one off. So what is the film about? Is it an allegory - a group of fairly representative French bourgeois gathered in a knackered mansion with a sparse, dying garden, might suggest so. But an allegory of what? The decline of French masculinity, patriarchy, capitalism? The judge and TV producer especially are examples of the most powerful, potentially corrupting forces in Western society, the law and the media. The women all escape and survive, although the closing shot of Andrea returning to the home is highly ambiguous. BOUFFE is very Bunuellian, from the EXTERMINATING ANGEL-like idea of bourgeoisie trapped in a mansion (figured in the inability of Marcello to leave in his sportscar, doomed to drive up and down the avenue), to the profusion of animals, observing the men's descent into bestiality, as they grunt and hoot and growl, and become fatal slaves to their appetites. Is it a study in decadence - there are many shots framed like grotesque parodies of Renaissance paintings; that optimistic project is flatulently shot here. There are allusions made to both Boileau - the father of French neo-classicism - and Brillat-Savarin, whose Physiognomy of Taste is a famous combination of philosophy and gastronomy which the four men take to nihilistic limits. Is it a death knell of film, as the parody of Don Corleone suggests, as four old men watch slides like a corruption of early cinema? I don't know. But for me the pleasures were many. The home itself, stuffed with so much bric-a-brac you can barely make out the characters. The fragmentary motifs returning in the coolly formal style - the replaying of certain scenes and shots; the repetition of the inchoate, beautiful, yearning tango music, which is connected to one character but shifts as he becomes a ghost. The museum of the dead culminating in the extraordinary, triangular shot of the sprawled Ugo, with Marcello and Michel behind him. The limitless, ingenious, grotesque variations on sex and food. The gross comedy. The genius compositions. The colours. The sight of three actors who have starred in some of the 20th century's supreme artistic achievements running from faecal rivers, and putting the rump back into rumpo.",
         "If you want to see what freedom of artistry and wild imagination is all about, don't miss this movie. It's a one of a kind and leaves you wondering - why don't they make movies like these anymore? OK, so it's grosse, and anarchic, and discomforting. But it's also a brilliant tragicomic story about four middle-aged friends who lock themselves away in a country house and feast literally to death. Plus there's this unbeatable quartet of actors - Mastroianni, Piccoli, Noiret and Tognazzi - playing roles with their own Christian names, which says a lot about artistic honesty. A pity there are no more Marco Ferreris around. 9/10",
         "Marco Ferreri is one of my all time favourite directors, for both his fearlessness in pushing boundaries and his piercing originality. Ferreri's greatest achievement was making relentlessly intellectual films that also managed to entertain. While many other European directors could get caught up in their own genius, Marco Ferreri was never pretentious enough to forget about his audience. La Grande Bouffe is one of Ferreri's best and most notorious films. The premise is infamous, four friends gather at a country mansion with the intention of literally eating themselves to death. When this becomes tiresome they hire three prostitutes and invite the local school teacher to join them. This is not a film that follows a linear narrative, instead it expertly crafts a sense of atmosphere from a series of acutely observed vignettes. There are enough unforgettable images and surreal happenings in this film to make Salvador Dali green with envy. The meat garden, Andrea and Michel's flatulent love making and Philippe's relationship with his nanny are just three that come to mind. There is genius at work here, this is not an exercise in empty symbolism but a disturbing slice of modern life. The impact of La Grande Bouffe has not wearied with age. The sex scenes are possibly less confronting (although Marcello's inventive use of a champagne bottle still raises eyebrows) but the film's psychological impact has not been dulled. The characters' ruthless pursuit of death is all the more disturbing given their unadulterated appreciation for life's pleasures. For a film with such disturbing content, La Grande Bouffe is also effortlessly entertaining. Ferreri somehow manages to balance the building tension with black humour, raunchy sex scenes and even budding romance. This is probably a good time to mention the cast. Ferreri has gathered together a who's who of European cinema. Ferreri regulars like Mastroianni and Tognazzi combine brilliantly with French heavyweights like Piccoli and Noiret. Andrea Ferreol more than matches it with these acting giants. She deserves significant credit for her illuminating performance as the open minded school teacher with the appetite of a blue whale. La Grande Bouffe is intelligent, disturbing and unrelenting. Most importantly, it is also entirely non-judgemental. Ferreri would never insult his audience by suggesting to them what they should think. If only more modern directors had taken note.",
         "A pilot, a cook, a choreographer, and a judge (+ a teacher!). Every key aspect of the western culture is present in this brilliant, surreal farce. The only ideology the men and the poor Andréa hold is one of hedonistic consumption of food and sex. The prostitutes are the sensible ones, leaving out of the game in time. They represent the \"outsiders\", people who refuse to take part in the destructive lifestyle, and are saved. If you hate symbolism, you might watch this as a very funny and brilliantly acted comedy. If you don't mind the symbolism, every time you watch it again you'll find new depths in Ferreri's witty commentary of modern western lifestyle. Personally I don't mind it, hence 10/10. Belongs to my top 10 of all times.",
         "'La Grande Bouffe' (aka 'Blow-Out') is an extraordinary movie, the kind of movie you just can't imagine getting made these days. While shot through with black humour it is very sad and depressing, and for me just as bleak as say, 'Leaving Las Vegas'. Instead of alcohol these dissatisfied men decide to kill themselves using food. Marcello Mastroianni is the best known of the four stars but Michel Piccoli (Belle De Jour), Ugo Tognazzi and and Philippe Noiret are equally impressive. The acting from all four is first rate and really makes the premise believable. Director Marco Ferreri went on to make the Bukowski adaptation 'Tales Of Ordinary Madness' another uncompromising, f*cked up and beautiful movie. I highly recommend both films which are difficult viewing, but worth the effort.",
         "The aircraft pilot Marcello, the chef Ugo, the TV choreographer Michel and the judge Phillipe decide to terminate their lives with a great pleasure, eating and having sex with three prostitutes and one school teacher invited to participate in their orgy. I watched this unforgettable film in the 70's and I was very disturbed with this impressive metaphoric movie. In Brazil, it remained unreleased on video until a couple of months ago, when fortunately it was 'rescued' and released on DVD by the Brazilian distributor 'Versátil', specialized in masterpieces such as Fellini, Rosselini and Visconti. Now I have just had the chance to watch again this weird and daring movie about the decay of the society of consumption, empty and compulsive, searching for \"sex and food\" (material goods) much more than they need. The main characters use their Christian names. This movie is also a great black humor comedy. My vote is nine. Title (Brazil): \"A Comilança\" (\"The Binge\")",
         "What can be a better protest against hedonism than to kill oneself in the most hedonistic way: to sate oneself with food and luxury and sex to death? So four old friends gather together in the luxuriant family villa belonging to the one of the participants and start devouring their way to exotic quietus, I should warn you though, the spectacle isn't for the hungry, and however difficult the task may seem it turns out to be quite feasible. What is the most great in this movie is its thick atmosphere of absurdity and surreality of everything happening on the screen and at the same time a verisimilitude of this occurrence. This movie also brilliantly managed to catch a zeitgeist of its epoch. At the time the film was announced to be a scandal of the year.",
         "You smell it, you taste it, you feel it in your stomach, it nauseates you, but it also enchants you. Never found another senses-involving movie like this. SPOILERS Four friends, Marcello, Ugo, Michel and Philippe (Ferreri kept the actors' real names here), tired of their ordinary lives, decide to commit suicide just by eating and eating and eating to death. They get together at Philippe's house on the outskirts of Paris, and their ritual begins. After some time passed just eating, Marcello and Michel decide to invite some prostitutes, to cheer up the situation. Philippe invites a female teacher instead. Her presence in the house will be determining, for she turns out to be insatiable, both for her eating and sexual appetites, bringing all of the four friends to death. The prostitutes leave the house soon, disgusted by its inhabitants eating behavior, and there Andrea, the teacher, will soon encircle herself of corpses, the dead bodies of the four poor friends. Director Marco Ferreri reached perfection in this fantastic, opulent representation. Very few things connect with reality here, thanks also to the stunning locations, decòr and photography. Philippe's house is one of the best sets I ever saw. I'm going to take a trip to Paris and try to find it. The four great protagonist, taken from an ideal \"top ten\" of the best european actors, give a great prove of mere role-playing, together with the humongous, unreal Andrea Ferreol, who fills up the house and the screen. This is art in its purest form. 10/10.",
         "Four individuals plan to eat themselves to death at a retreat surrounded by women and non-stop catering. Throughout the film each character philosophizes, make sexual innuendos, have sex, and gorge themselves in one vice or another in every scene. I've seen the film a few times and it remains enjoyable. Each character has their own traits and different ways of exiting life. Prostitutes come and go yet a female school teacher decides to join the horde until the very end. Sadean to the core, without the pessimism, their hedonistic lifestyles continue until their bodies (or mind) can no longer take it. A satire of course, but given the time it was filmed can probably be looked at in a few ways. Three of the four characters greatly enjoyed their time even when facing death. Half expecting to see them have a revelation or biting realization on life, instead they continued on the same path. Kind of hard to have a satire without some sort of tragic ending or change in plans of the patronized characters. Not a masterpiece but worth seeing. The film is even strangely erotic. I don't think it comes together as a full fledged mock of society either. I dare one male to deny he would not enjoy a weekend at a retreat such as this.",
         "Marco Ferreri's film \"La Grande Bouffe\" is a scathing attack on the hypocritical ways of our modern society in which too much importance is given to wealth creation.His film is also a truly accurate portrait of the decadence of materialist society which promotes hedonism.The film goes on to make a vitriolic assault on people who have wealth and their ways and manners to spend such a wealth.All the acts shown in the film like over eating, orgies,\"living life to the fullest without giving a damn about morals and what the society would say I don't care attitude\" are all the products of human mind which does not like to rest.This is the reason why three young men of different socio economic backgrounds who happen to be friends decide to make merry knowing fully well that they have adequate means to engage themselves in such a wild pursuit.It can be surmised that by showing that irresponsible wealthy people can even die of over eating Marco Ferreri wanted to suggest that it is not only the countless unfortunate poor people in this world who die of hunger."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Films 66",
         "Mara Films",
         "Capitolina Produzioni Cinematografiche"
      ],
      "summaries": [
         "Four successful middle-aged men Marcello, a pilot; Michel, a television executive; Ugo, a chef; and, Philippe, a judge go to Philippe's villa to eat themselves to death. After the first night, Marcello insists that women should join them. Three prostitutes make it through a day or two; Andrea, a local school teacher, stays to the end. The villa, the food, and a Bugati roadster are essential props.",
         "A group of men hire some prostitutes and go to a villa in the countryside. There, they engage in group sex and resolve to eat themselves to death."
      ],
      "budget": 0
   },
   "movielensId": 3655,
   "movielens": {
      "languages": [
         "Italiano",
         "Français"
      ],
      "releaseDate": "1973-05-16",
      "dvdReleaseDate": "2000-05-23",
      "directors": ["Marco Ferreri"],
      "runtime": 135,
      "movieId": 3655,
      "title": "La Grande Bouffe",
      "mpaa": "NC-17",
      "actors": [
         "Marcello Mastroianni",
         "Ugo Tognazzi",
         "Michel Piccoli",
         "Philippe Noiret",
         "Andréa Ferréol",
         "Solange Blondeau",
         "Florence Giorgetti",
         "Michèle Alexandre",
         "Monique Chaumette",
         "Henri Piccoli",
         "Giuseppe Maffioli"
      ],
      "imdbMovieId": "0070130",
      "originalTitle": "La Grande Bouffe",
      "genres": [
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A group of men hire some prostitutes and go to a villa in the countryside. There, they engage in group sex and resolve to eat themselves to death.",
      "tmdbMovieId": 10102,
      "avgRating": 3.58724,
      "releaseYear": "1973",
      "numRatings": 384,
      "posterPath": "/om8Kka9e4GStOAcX6gVEBJAoAXc.jpg"
   }
}