{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "london england",
            "id": 212
         },
         {
            "name": "undercover",
            "id": 1568
         },
         {
            "name": "fashion designer",
            "id": 7024
         },
         {
            "name": "serial killer",
            "id": 10714
         },
         {
            "name": "taxi dancer",
            "id": 176798
         },
         {
            "name": "personals column",
            "id": 192266
         }
      ],
      "imdb_id": "tt0039589",
      "video": false,
      "title": "Lured",
      "recommendations": [
         43380,
         69472,
         53714,
         21336,
         35896,
         20942,
         145691,
         47256,
         30855,
         17218,
         25503,
         36516,
         44626,
         30162,
         42286,
         61095,
         25876,
         37041,
         25501,
         24214
      ],
      "backdrop_path": "/iMl218KDr61DpADVjchRrMJyVeZ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Robert Fleming",
               "gender": 2,
               "credit_id": "52fe440b9251416c9100319b",
               "name": "George Sanders",
               "profile_path": "/6fvK8vUTgSMRvuw77PjjuIOMl6.jpg",
               "id": 3361,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Sandra Carpenter",
               "gender": 1,
               "credit_id": "52fe440b9251416c9100319f",
               "name": "Lucille Ball",
               "profile_path": "/56f15aAkHkdVDrFgfly5cUa1bbD.jpg",
               "id": 40174,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Inspector Harley Temple",
               "gender": 2,
               "credit_id": "52fe440b9251416c910031a3",
               "name": "Charles Coburn",
               "profile_path": "/vuQEpr6ae3vcvpDxw2V9iKB1wUT.jpg",
               "id": 11169,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Charles van Druten",
               "gender": 2,
               "credit_id": "52fe440b9251416c910031a7",
               "name": "Boris Karloff",
               "profile_path": "/3kY1eEgGFAoVyy8MjNolCS5wouj.jpg",
               "id": 2922,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Julian Wilde",
               "gender": 2,
               "credit_id": "52fe440b9251416c910031ab",
               "name": "Cedric Hardwicke",
               "profile_path": "/yaOgPrY8PBPkyqXHm7NVl0p2er7.jpg",
               "id": 99461,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Dr. Nicholas Moryani",
               "gender": 0,
               "credit_id": "52fe440b9251416c910031af",
               "name": "Joseph Calleia",
               "profile_path": "/xyb6l5Epo5NXbKUXD7puhLoYca2.jpg",
               "id": 33747,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Lyle Maxwell",
               "gender": 2,
               "credit_id": "52fe440b9251416c910031b3",
               "name": "Alan Mowbray",
               "profile_path": "/s49NhpPmbn9ZaADRTJJAgDADDZt.jpg",
               "id": 8240,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Officer H.R. Barrett",
               "gender": 2,
               "credit_id": "52fe440b9251416c910031b7",
               "name": "George Zucco",
               "profile_path": "/hduZG2CH9UeGuBamxnohkd3DEVg.jpg",
               "id": 30417,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Officer Barret",
               "gender": 2,
               "credit_id": "52fe440b9251416c910031bb",
               "name": "Robert Coote",
               "profile_path": "/erN2R5UYBvVsYfnscQi7AEEXEoP.jpg",
               "id": 92908,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Detective Gordon",
               "gender": 2,
               "credit_id": "52fe440b9251416c910031bf",
               "name": "Alan Napier",
               "profile_path": "/mmOemlQeMp0ViF4cy8QL1bArm4y.jpg",
               "id": 6933,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Lucy Barnard",
               "gender": 1,
               "credit_id": "52fe440b9251416c910031c3",
               "name": "Tanis Chandler",
               "profile_path": "/gNaMyc9jwj1Fo1B04Xt4re2O438.jpg",
               "id": 106031,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Nelson",
               "gender": 0,
               "credit_id": "52fe440b9251416c910031c7",
               "name": "Jimmy Aubrey",
               "profile_path": "/nDEzS7B7C2Lrn2Wopn7OJ2SKIMa.jpg",
               "id": 88778,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Medical Examiner",
               "gender": 2,
               "credit_id": "52fe440b9251416c910031cb",
               "name": "Cyril Delevanti",
               "profile_path": "/ldqsp9NS3cbTQfQvp6JJ5WgTWxA.jpg",
               "id": 88906,
               "order": 12
            },
            {
               "cast_id": 23,
               "character": "Robert's Rejected Girlfriend (uncredited)",
               "gender": 0,
               "credit_id": "574d95e6925141016200189f",
               "name": "Lynn Baggett",
               "profile_path": "/xlq1ww1zqIbziKfiwER95FWwBrW.jpg",
               "id": 83988,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe440b9251416c91003197",
               "name": "Douglas Sirk",
               "profile_path": "/8DugkBzRKKNDcspnZRCd10wlXn7.jpg",
               "id": 46712,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe440b9251416c910031d1",
               "name": "Jacques Companéez",
               "profile_path": null,
               "id": 58232,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe440b9251416c910031d7",
               "name": "Simon Gantillon",
               "profile_path": null,
               "id": 131130,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe440c9251416c910031dd",
               "name": "Ernest Neuville",
               "profile_path": null,
               "id": 131131,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe440c9251416c910031e3",
               "name": "Leo Rosten",
               "profile_path": null,
               "id": 87392,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe440c9251416c910031e9",
               "name": "Michel Michelet",
               "profile_path": null,
               "id": 29727,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe440c9251416c910031ef",
               "name": "William H. Daniels",
               "profile_path": null,
               "id": 3637,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe440c9251416c910031f5",
               "name": "John M. Foley",
               "profile_path": null,
               "id": 131132,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe440c9251416c910031fb",
               "name": "James E. Newcom",
               "profile_path": null,
               "id": 68417,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "57549f9dc3a3687b94001366",
               "name": "Henry S. Kesler",
               "profile_path": null,
               "id": 933697,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "57549facc3a3687b9400136a",
               "name": "James Nasser",
               "profile_path": null,
               "id": 1631219,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "57549fbf9251415b6a002e7c",
               "name": "Hunt Stromberg",
               "profile_path": null,
               "id": 109853,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 1.955333,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 30308,
      "vote_count": 21,
      "budget": 0,
      "overview": "A woman helps the police catch the serial killer who murdered her best friend.",
      "similar": [
         274,
         1696,
         39874,
         2252,
         2832,
         948,
         12521,
         984,
         8843,
         9533,
         5486,
         12662,
         10092,
         10285,
         12149,
         30833,
         1359,
         1991,
         1949,
         562
      ],
      "original_title": "Lured",
      "runtime": 102,
      "poster_path": "/llDvOc4pDx3CjM1EBaF0se3hzCo.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Hunt Stromberg Productions",
         "id": 5235,
         "origin_country": ""
      }],
      "release_date": "1947-08-28",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "Don't answer this ad... Don't... don't... don't...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Douglas Sirk"],
      "runtime": 102,
      "synopsis": null,
      "writers": [
         "Jacques Companéez",
         "Simon Gantillon"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0039589/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk1MjQ4MzEzNV5BMl5BanBnXkFtZTcwMjYzMjY3MQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: George Sanders, Lucille Ball, Charles Coburn | See full cast and crew »"],
      "reviews": [
         "This excellent noir film was somewhat copied forty years later as \"Sea of Love,\" with several changes bringing it up-to-date. One surprise in store for viewers is the comic talents of George Zucco, obviously kept hidden throughout most of his brilliant acting career. He is an excellent comedic sparring partner for Lucille Ball. They work well as a team, providing laughs that are sorely needed in an otherwise serious murder mystery thriller. Boris Karloff adds to the fun as well, giving a monster performance as an insane dress designer--can you believe? The stellar lineup also includes the likes of George Sanders, Charles Coburn, Cedric Hardwicke, and Alan Mowbray. The cast alone is worth the price of admission. Directed with savvy by Douglas Sirk, the film has a script put together by a hodgepodge of writers. Still, the dialog is filled with witty and intelligent lines. The mystery will keep the viewer guessing until the serial killer is revealed. There are red herrings along the way to lead the best sleuth astray. Even when the movie seems to be ending with the mystery solved, it becomes the wrong solution to the case under investigation. The film proceeds to fool the viewer a second time before the ultimate meanie is apprehended. There are thrills aplenty throughout this delicious cinematic whodunit. The story involves a serial killer running amok in London who kills beautiful young women lured by newspaper ads. The madman fancies himself a poet copying his style from the dark poetry of Charles Baudelaire, who once wrote about a tempting woman being more beautiful in death. One such poem is sent to Scotland Yard before each murder. Inspector Harley Temple (Coburn) is determined to catch the psycho any way possible, even using a young woman, Sandra Carpenter (Ball), as a decoy to lure the monster out into the open. Sandra is chosen when she inquires about her good friend's disappearance. Coincidentally, her friend's moniker is Lucy. In the process of finding the perpetrator of the crimes, Sandra makes several interesting encounters, eventually meeting a stranger named Robert Fleming (Sanders) with whom she falls in love. Their favorite song becomes \"All For Love,\" which serves as a clue in the mystery.",
         "An interesting curio for Lucille Ball fans as well as those who enjoy old horror and mystery films. This one is worth seeing for its cast alone, featuring (in addition to Ms. Ball): Boris Karloff, Sir Cecric Hardwicke, Alan Napier, George Zucco and George Sanders! This solid mystery/thriller stars Lucille Ball in a dramatic part before she became Lucy Ricardo. She plays a feisty American gal in England who is hired by Scotland Yard to go undercover to trap a serial killer who claimed one of her friends. Boris Karloff's role is a small one but it's absolutely wonderful, and it's an essential watch for the actors' legion of fans. George Zucco is a cop who keeps an eye out for Ball to make sure she doesn't get into too much trouble. *** out of ****",
         "For those of you who only know Ms. Ball as the \"dizzy redhead\" in the 50's sitcoms, you're in for a TREAT! Before making the above, she was in many films -- Marx Brothers, The \"Annabel\" series, and this great film. Backed by a solid cast (Zucco, Sanders, Karloff, Napier, Coburn), she acts as the \"bait\" to lure a London killer out of hiding. Even tho (at least to ME) it was obvious who the killer is, it is fascinating watching her in a non-comedy role! And, she certainly was lovely! If you get a chance to see this, DO SO! You won't be disappointed! It's a shame that she didn't make more films in this genre.",
         "Director Douglas Sirk, later best-known for sappy Hollywood melodramas, makes this early Lucille Ball vehicle about a killer that writes poetry to the police about the victim he is going to kill. Ball plays a dance hall girl that loses a friend and decides to help by joining the Scotland Yard force. She begins to answer personal ads by men looking for attractive young women. Along the way she comes in contact with a slaving-like operation and a bizarre eccentric fashion designer played with incredible gusto by Boris Karloff. Karloff has roughly 5 minutes of screen time, but boy does he know how to use it. This is a very enjoyable film. If you are looking for a lot of action - look somewhere else. What you get here is a lot of talk and character studies. The cast is one of the most complete I have seen in some time. George Sanders, Cedric Hardwicke, Charles Coburn, Robert Coote, Alan Napier, George Zucco and Alan Mowbray round out this incredibly talented cast. Zucco really stands out as a plain-clothes policeman. Ball is beautiful, and she does a very credible job in the lead. Sometimes I forget that she was a gorgeous woman with a lot of talent other than making you laugh. But that was certainly her greatest gift. Lured is a good, old-fashioned mystery yarn. The killer is painfully obvious about halfway through, but the actors go through the motions with obvious relish. Unfortunately the DVD release I had by KINO had nothing on it all all in terms of extras...didn't even separate chapters from main feature!",
         "For a serial killer film, this one must rank as the most reserved and dignified ever made. No blood nor gore, just urbane and sophisticated dialogue throughout, and especially from the killer, plus a bit of very enjoyable George Sanders-Lucille Ball romantic wit. Perhaps all victims die without bleeding/suffering/discomfort in meddy old England? \"In England, we musn't dirty our hands while killing, musn't we?\" But, that was typical of the bloodless killings of crime movies of that time. George Sanders as a good guy was a total waste here. He is at his best as a witty, sarcastic and selfish cad, which he was somewhat at the start but then soon lost his lust and fell hard for Ms Ball, at which time he lost my interest as he became just another central casting rich guy in love. Unfortunate decision by the studio, as he would have been much better using more of his well known crackling wit. As a result, Charles Coburn and Cedric Hardwicke were the best things in this film, after the radiant and gorgeous Lucille Ball. Coburn had most of the best dialogue, and came off as a brilliant mix of the philosophical and practical. The methodical way he discovered the killer was a bit long in coming, but interestingly effective overall. The film needed editing and story tightening to eliminate a lot of the too-long and languid story development dragginess that held it back from being one of the better mystery flicks I've seen over the years. I still give it a 7 out of 10, mainly for quality of dialogue and acting.",
         "Director Douglas Sirk is generally known for producing weepy melodramas, so 'Lured (1947)' seemed like an exciting exception to the rule. The title alone has the feel of a dark and claustrophobic film noir thriller, with stark silhouettes skulking in alleyways and the shadow of gnarled fingers reaching toward a heroine's throat. The Production Code Administration apparently took a dislike to the film's name, perhaps conjuring up similar mental images to my own, and the film's title was subsequently changed to the less-lurid 'Personal Column,' which sounds more like a Lubitsch romantic comedy. Neither title quite does justice to the film's tone, which is somewhere between thriller and melodrama, stranded hopelessly in middle-ground between the two distinct genres. An impressive cast \u0096 including Lucille Ball, George Sanders, Boris Karloff, Cedric Hardwicke, Joseph Calleia and Charles Coburn \u0096 does its best with the uneven material. The tone of the screenplay shifts markedly between the moody and sophisticated first half and the less-interesting second, when each character abandons all the traits that had made them appealing. Sandra Carpenter (Ball) is a smart-mouthed taxi dancer, the sort of girl who doesn't take any nonsense from the opposite sex. When her colleague goes missing after answering an ad in the newspaper personals column, the police suspect that she is the latest victim of a deranged serial killer, who sends the authorities flowery poetry readings to boast of his crimes. To prevent the next murder, Sandra is unexpectedly recruited to identify the man responsible, going undercover as his next prospective victim. Among the suspects is Boris Karloff, unfortunately underused as a hilariously demented fashion designer, and George Sanders, playing one of those charmingly smug suitors that he always played so well. Veteran cinematographer William Daniel's creates a nice, moody black-and-white atmosphere, perhaps lacking the grittiness of your typical 1940s film noir, though that would hardly have worked alongside a screenplay where even the most depraved murderers speak with a high degree of elegance and sophistication. Apparently, that's just how everybody is in England. The first half of the film delicately develops a mysterious and slightly Gothic air of uneasiness, and then something happens: Douglas Sirks' melodramatic instincts kick in, and his characters suddenly become less interesting than before. Lucille Ball's sassy and independent woman becomes enamoured with George Sanders, discarding all her saucy wise-cracks in favour of the anguished cries of a weepy and vulnerable damsel-in-distress. Sanders, likewise, is effectively neutered by the onset of love, losing his indomitable lust and becoming all quiet and contemplative. George Sanders quiet and contemplative, you say? Outrageous! Even so, Cedric Hardwicke singlehandedly rescues the film's final half, refusing to subdue his grotesque depravity even before we're supposed to guess that he's the man responsible for the serial murders. I don't know if I could confidently recommend 'Lured' to fans of Douglas Sirk, but the excellent cast of actors means that most viewers should find some degree of fulfillment in his unusual brand of film noir film-making. This is worth a look.",
         "Great Film Noir, Well acted by all, One of the best 1940's crime movies, George Sanders and Lucille Ball have perfect chemistry, The movie will keep you guessing until the end. This \"rediscovered\" classic from 1947 has one of Lucille Ball's best dramatic roles of her career. A Jack-the-Ripper-like serial killer is looking for and murdering beautiful young women, and Lucille Ball's characters friend is the killer's latest victim. Wanting desperately to help the police find the brutal murderer, she is hired by Scotland Yard to become a decoy for the killer, who lures his victims through newspaper advertisements. Lots of plot twists keep movie exciting to the end.",
         "A killer lures lonely young women via the \"personals\" column in a London newspaper. A friend of one of the victims, an attractive dancer named Sandra Carpenter (Lucille Ball), acts as bait to catch the killer, under direction of Police Inspector Temple (Charles Coburn). One of the suspects is Robert Fleming (George Sanders) who may, or may not, be the killer. Fleming, suave and sophisticated, charms Carpenter into romantic complications. The whodunit element of \"Lured\" gets off to a strong start, with good direction, some spooky lighting at the beginning, and an assortment of interesting suspects. But, as the film progresses, the whodunit element gets undercut by the developing romance between Carpenter and Fleming. The upbeat \"All For Love\" musical score, combined with elegant costumes, reinforce the romantic theme. The whodunit element sputters out about two-thirds through the film. My impression is that the screenplay for this film was adapted from \"Pieges\", a 1939 French film (which I have not seen), billed as a romantic thriller. In \"Lured\", we certainly have a romantic theme; thrills maybe, depending on how you define \"thrills\". You get the feeling that the film's director (Douglas Sirk) started with the intention of making a whodunit, but later changed his mind and decided to make a romantic melodrama. The film's split personality may also be the result of the casting of two strong lead actors (Ball and Sanders), whom we do not usually associate with murder mysteries. \"Lured\" certainly has entertainment value. I love Lucy no matter what role she plays. Coburn and Sanders are nearly always engaging. The film has good B&W cinematography. The dialogue is crisp. And the film provides some great nostalgia, via 1940's clothes, hairstyles, and music. Overall, \"Lured\" has a great cast and some wonderful atmosphere. But, when I want to watch a murder mystery from the 30's or 40's, I will be more inclined to watch a film whose sole aim is to present a whodunit puzzle, such as, for example, a good old fashion Charlie Chan film with Sidney Toler ... romance be damned.",
         "LURED starts out promisingly with Scotland Yard on the trail of a serial killer and enlisting a friend of the latest victim (LUCILLE BALL) to help them solve the crime. CHARLES COBURN is the police inspector who sends Lucille on a dangerous mission to trap a killer. GEORGE SANDERS, in one of his more colorless roles, is the man with romantic designs on Ball the minute he has a phone conversation with her when she applies for a showgirl job opening. Sanders without witty dialog plays his straight role in a rather bored fashion, but there's some colorful work by ALAN MOBRAY, SIR CEDRIC HARDWICKE, GEORGE ZUCCO, ROBERT COOTE and ALAN NAPIER. Best of all is BORIS KARLOFF in an offbeat role as a mad dress designer who gets the chance to chew all the scenery in sight and then some. But somewhere towards the middle, the story loses steam and whatever dramatic tension was built up in the earlier scenes. Still, it manages to hold the interest with several red herrings tossed in the mix to throw off suspicion. However, any true mystery fan ought to be able to guess the murderer from the start. Best when it's going along at a brisk pace, but it does slow down to a trot toward the end. Lucille Ball does well in a dramatic role (delivered with some typical light touches) and all in all it manages to entertain despite some flaws. Douglas Sirk, noted more for his Technicolored melodramas in the '50s, does a nice job of direction.",
         "As an user has pointed out,\"lured\" is the remake of Robert Siodmak's movie \"Pièges\" (1939) starring Marie Dea (Lucille Ball's part),Maurice Chevalier (Sanders' part) ,Erich Von Stroheim (Karloff's) and Pierre Renoir (Cedric Hardwicke's) Both versions are good.If ,like me,you've seen Siodmak's version first ,you'll probably find Sirk's work less interesting and vice versa . The differences between the treatments are minimal. -George Sanders is a better choice than Maurice Chevalier ,cause we do believe he might be a serial killer,which is difficult with the French chanteur. -On the other hand the scene featuring Boris Karloff is weaker than its French equivalent where Stroheim was more disturbing. -In both movies,the weakest link is the part of the story where the heroine is a servant in a shady house."
      ],
      "genres": [
         "Crime",
         "Film-Noir",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": ["Hunt Stromberg Productions"],
      "summaries": ["A serial killer in London is murdering young women whom he meets through the personal columns of newspapers; he announces each of his murders to the police by sending them a cryptic poem. After a dancer disappears, the police enlist an American friend of hers, Sandra Carpenter, to answer advertisements in the personal columns and so lure the killer."],
      "budget": 0
   },
   "movielensId": 3656,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1947-08-28",
      "dvdReleaseDate": "2000-05-23",
      "directors": ["Douglas Sirk"],
      "runtime": 102,
      "movieId": 3656,
      "title": "Lured",
      "mpaa": "",
      "actors": [
         "George Sanders",
         "Lucille Ball",
         "Charles Coburn",
         "Boris Karloff",
         "Cedric Hardwicke",
         "Joseph Calleia",
         "Alan Mowbray",
         "George Zucco",
         "Robert Coote",
         "Alan Napier",
         "Tanis Chandler",
         "Jimmy Aubrey",
         "Cyril Delevanti",
         "Lynn Baggett"
      ],
      "imdbMovieId": "0039589",
      "originalTitle": "Lured",
      "genres": [
         "Drama",
         "Thriller",
         "Mystery"
      ],
      "youtubeTrailerIds": ["1IlbW2LCue0"],
      "plotSummary": "A woman helps the police catch the serial killer who murdered her best friend.",
      "tmdbMovieId": 30308,
      "avgRating": 3.12069,
      "releaseYear": "1947",
      "numRatings": 29,
      "posterPath": "/llDvOc4pDx3CjM1EBaF0se3hzCo.jpg"
   }
}