{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0102728",
      "video": false,
      "title": "Puppet Master III Toulon's Revenge",
      "recommendations": [
         26957,
         26954,
         26959,
         26958,
         26962,
         26953,
         26960,
         26961,
         38499,
         40649,
         19286,
         48302,
         19287,
         19288,
         55377,
         139659,
         35945,
         28859,
         16146,
         41848
      ],
      "backdrop_path": "/9kp9LukiGwRYLgPP8L7tX30js7v.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Andre Toulon",
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04ac05",
               "name": "Guy Rolfe",
               "profile_path": "/fEXyb49srKS2XQuD8md0JFw9Ene.jpg",
               "id": 44883,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Major Krauss",
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04ac09",
               "name": "Richard Lynch",
               "profile_path": "/kjdYPy2r65rHR3rYsOy8nzPKXuF.jpg",
               "id": 97878,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Dr. Hess",
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04ac0d",
               "name": "Ian Abercrombie",
               "profile_path": "/uywWX3MCmr9N2WFBcsInPzGFV4X.jpg",
               "id": 11764,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Lt. Eric Stein",
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04ac11",
               "name": "Kristopher Logan",
               "profile_path": null,
               "id": 98554,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Peter Hertz",
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04ac15",
               "name": "Aron Eisenberg",
               "profile_path": "/eGiESuzF9XZhzqelYiYY4PcQQ4Z.jpg",
               "id": 74072,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "General Mueller",
               "gender": 0,
               "credit_id": "52fe4524c3a368484e04ac19",
               "name": "Walter Gotell",
               "profile_path": "/1VZFqeruev1IQBIKmUpgo5DGBA9.jpg",
               "id": 6610,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Elsa Toulon",
               "gender": 1,
               "credit_id": "52fe4524c3a368484e04ac1d",
               "name": "Sarah Douglas",
               "profile_path": "/t0FE7AH4c9O7ro4QK6wis3RfzEv.jpg",
               "id": 31364,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Lili",
               "gender": 1,
               "credit_id": "52fe4524c3a368484e04ac21",
               "name": "Michelle Bauer",
               "profile_path": "/nGbCOkBl2rhPR4qchHJqR0hj1rx.jpg",
               "id": 97698,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Hertz",
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04ac25",
               "name": "Matthew Faison",
               "profile_path": null,
               "id": 98555,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Prostitute",
               "gender": 0,
               "credit_id": "52fe4524c3a368484e04ac29",
               "name": "Jasmine Touschek",
               "profile_path": null,
               "id": 98556,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Airport Agent",
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04ac2d",
               "name": "Lenny Rose",
               "profile_path": null,
               "id": 32543,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Brothel Girl",
               "gender": 1,
               "credit_id": "52fe4524c3a368484e04ac31",
               "name": "Landon Hall",
               "profile_path": "/wdV47cGH433aQqnkJnEjbwejMjr.jpg",
               "id": 98557,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04abdd",
               "name": "David DeCoteau",
               "profile_path": "/nFOFizArK1Vwoo2v4HRKdKXJlrl.jpg",
               "id": 97618,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04abe3",
               "name": "C. Courtney Joyner",
               "profile_path": null,
               "id": 19713,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04abe9",
               "name": "Charles Band",
               "profile_path": "/ulNdloEQNPhKrFOloAwW2R3m6DU.jpg",
               "id": 19707,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04abef",
               "name": "David DeCoteau",
               "profile_path": "/nFOFizArK1Vwoo2v4HRKdKXJlrl.jpg",
               "id": 97618,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04abf5",
               "name": "John Schouweiler",
               "profile_path": null,
               "id": 97859,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04abfb",
               "name": "Richard Band",
               "profile_path": null,
               "id": 19711,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4524c3a368484e04ac01",
               "name": "David P. Barton",
               "profile_path": null,
               "id": 98542,
               "department": "Crew",
               "job": "Makeup Effects"
            },
            {
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04ac37",
               "name": "Charles Band",
               "profile_path": "/ulNdloEQNPhKrFOloAwW2R3m6DU.jpg",
               "id": 19707,
               "department": "Writing",
               "job": "Original Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04ac3d",
               "name": "David Schmoeller",
               "profile_path": "/qXfp7TR5E0nFpKBpoL41rOOP3MK.jpg",
               "id": 52268,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 0,
               "credit_id": "52fe4524c3a368484e04ac43",
               "name": "Carol Oblath",
               "profile_path": null,
               "id": 48586,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4524c3a368484e04ac49",
               "name": "Adolfo Bartoli",
               "profile_path": "/weoIgV80gRk7LxzUtdYFwI0hdMG.jpg",
               "id": 19710,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4524c3a368484e04ac4f",
               "name": "David Allen",
               "profile_path": null,
               "id": 187067,
               "department": "Visual Effects",
               "job": "Visual Effects"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 3.909434,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 26956,
      "vote_count": 41,
      "budget": 800000,
      "overview": "Set in Berlin during WWII, the Nazi regime is attempting to develop a drug that will animate the dead, in order to use in the war effort. Toulin arouses suspicion as a Nazi dissident, and his secret is discovered. During a Nazi raid on his home, Toulin's beautiful wife is murdered. Toulin vows revenge, with the help of his animated puppets.",
      "similar": [],
      "original_title": "Puppet Master III Toulon's Revenge",
      "runtime": 86,
      "poster_path": "/BF7jnHlq8rwG1X0H7nFXQSbNlX.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Full Moon Entertainment",
         "id": 4867,
         "origin_country": ""
      }],
      "release_date": "1991-10-17",
      "vote_average": 6,
      "belongs_to_collection": {
         "backdrop_path": "/crDZjaOpoUCIOoiQ9nLIAt8ZBul.jpg",
         "name": "Puppet Master Collection",
         "id": 107949,
         "poster_path": "/wuLaEcy10wqgiVi4nCjdPXvcCyw.jpg"
      },
      "tagline": "When Good Puppets Go Bad",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["David DeCoteau"],
      "runtime": 86,
      "synopsis": null,
      "writers": [
         "Charles Band",
         "C. Courtney Joyner"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0102728/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BOTkwMTE2NjM0MF5BMl5BanBnXkFtZTcwNjI0NTYzNQ@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Guy Rolfe, Richard Lynch, Ian Abercrombie | See full cast and crew »"],
      "reviews": [
         "This horror flick doesn't pretend to be anything but a simple revenge story, and I like that. There are no pretensions. \"Toulon\" (Guy Rolfe, replacing William Hickey who played the role the first two films) is the puppeteer-extraordinaire whose creations are literally lifelike. Rolfe and his deadly puppets go after the Nazis after they seek him out for his scientific genius of reanimating puppets. They want that information to use for their evil purposes so \"Toulon\" and his puppets fight back. It's sort of a do-it-to-them- before-they-do-it-to-us mentality. The head Nazi is played by Richard Lynch and the man reminded me facially of Rutger Hauer. We see the Mr. Clean-type puppet with the little head and massive body; the puppet who \"screws\" everyone; the femme fatale and the cowboy \"Six Shooter.\" There is probably someone I forgot, too. All are fun to watch. The plot is secondary to the puppets doing their thing, eliminating all the bad guys one-by-one and it's all entertaining and done with in less than an hour- and-a-half. I have found the first three in this series all to be good but this is my only \"keeper.\" I sure wish this was available on DVD. Note: It's rated \"R\" not just for the violence. There are a couple of quick sex scenes showing bare breasts. Although the film in general might not be considered grade-A quality, it's not as dumb as you might think, either.",
         "Toulon's Revenge is the best in the whole Puppet Master series (With the exception of part 1 of course. This one goes back to World War II where the Nazi's are p****d off because of Aundre Toulon's puppet shows giving negative buzz about the Gustopo. And soon they discover that his puppets are actully alive and decide to use Toulon's technology to revive soldiers that were dead to replenish their army. Needless to say everything goes south and puppets spring into action to protect their master. What makes this movie great is it tells who the puppets are and shows the making and birth of leech woman I give it a 10",
         "Full Moon's attempt at a World War II flick on a low budget is ambitious. Yeah, the acting is a little wooden (what do you expect from puppets? heh), but Lynch, Wolfe, Abercrombie, and Gottell all do okay. Setting up Lynch's character as a puppet is a cute touch since Blade does look like him. This gives some background to the puppets, and sets them up as the potential good guys for subsequent sequels and to take advantage of their popularity. Overall, entertaining.",
         "The third \"Puppet Master\" movie is a prequel to the original two movies, showing events occurring in war-time Germany involving Andre Toulon, his wife Elsa and his band of merry wooden men (the puppets not the actors). This time, we see what happens when \"Good Puppets Go Bad\" as the ensemble of 12\" killer characters seek revenge against the Nazis. \"Puppet Master III - Toulon's Revenge\" is another building block in the series' mythology, filling in some of the back-story of the main protagonists. There's a continuity error with the timeframe, however, as this film is set in 1941 and, in the original, Toulon committed suicide in 1939! As expected, this is a really fun movie - the film's cast includes the late Walter Gotell as the Nazi general who commands his men with an iron fist but who also has a soft-spot for the local brothel. Gotell's best known for playing the Russian equivalent of \"M\" in numerous Bond movies. Sarah Douglas who plays Elsa Toulon will be familiar to genre fans as the evil Ursa from \"Superman\" and \"Superman II\". Guy Rolfe (Toulon), Richard Lynch (Major Krauss) and Ian Abercrombie (Doctor Hess) also deliver strong performances. I was surprised at how high budget this film looks. Due to the season in which the film was made, the director settled on filming the external shots over 3 days on the Universal backlot rather than shoot on location in Europe. The results are impressively convincing. My only complaint was that on the DVD I watched, the Ultra-Stereo soundtrack mixing had a heavy bias to the left channel. \"Puppet Master 3\" is something of a rarity thesedays but it's well worth tracking down if you're a fan of the series.",
         "Well when I saw Puppet Master 3 in the video store I thought to myself just another stupid sequel. I was fooled this was a great Puppet Master movie. It gives you alot of background information about Toulan and his puppets. The WW2 plot was good too. Alot of people like this one cause it was the most creative. Come on nazis getting slained by little tiny puppets. You also find out how Leech Woman came about. There is some crazy parts like the beginning where the guy awakes on the morgue table burnt to a crisp. Oh yea you find out how every puppet is based on. This movie is a great Full Moon flick. Buy it if you have the money. Or just rent it. It will not dissapoint you. Rated R for Nudity, Horror Violence, and some language",
         "During the pre-war era of Berlin in 1941, the Nazi regime is working at creating a drug which will reanimate the dead. Their intent is to use the serum on fallen soldiers in order to render their army invincible. After many failed attempts, Dr. Hess soon learns that the local puppet master Andre Toulon holds the ancient secret of giving life to inanimate objects. Toulon and his legion of puppets must now defend themselves and flee from the pursuing Nazis as they try to capture him and use his powers for evil. This is an exciting and adequately-scripted entry in the still-continuing Puppet Master series, even though the story suffers from a gaping, inexcusable plot hole: the original movie has Toulon committing suicide in 1939, two years before the events in this film. All imperfections aside, however, this still is a decent little flick.",
         "The most imaginative and best-acted title in the long-running PUPPETMASTER series, Part 3 is actually a prequel that details how Andrte Toulon came to create his puppets during the dark days of World War II. The Nazis wants to use Toulon's secrets to create an army of the undead, and that's when the fun begins. Toulon sics his killer puppets on the Nazis, to spectacularly bloody effect. The puppets are the good guys in this one. What also makes a huge difference here is the introduction of Guy \"Mr. Sardonicus\" Rolfe as Toulon, a role he would essay in two more sequels. Rolfe is a great Toulon, a charismatic and even sympathetic character who loves his deadly puppets as only a papa creator could. Rolfe lent an air of integrity and distinction to the series. Part 3 is a great little B-horror addition to the series that was shot on the Universal back lot instead of Europe to surprisingly solid effect. A must-see.",
         "This is the very best movie in the whole series...and it's still a total pile. I love these movies for the puppets themselves (Blade, Six-Shooter, Torch, etc) and this movie in particular gives you the lovable team of misfits killing Nazis during WWII. Andre' Toulon's wife is murdered by a SS officer for some reason, so he uses his creations to get revenge...hence the title. This movie still sucks but is very fun. Again, cool puppets kill Nazis. As a bonus, this third entry in the series introduces the first appearance of the gunslinging puppet Six-Shooter, which doesn't make sense because this takes place during WWII and the previous, Six-Shooterless two movies take place in \"present time.\" But whatever. What makes this movie stand out above the rest is that the cast, most of all Toulon himself and the main villain, seem to be actually trying to make their characters cool. The lead Nazi is an interesting enough villain for a cheap horror movie and he has a small bit of charisma to keep him going. Toulon himself...at least has an interesting look and voice. The story seems to have a much better construction than any of the other titles. (By the way, do NOT watch \"Retro Puppet Master.\" You will hate yourself for it.) So, this is my favorite. Enjoy.",
         "Maybe this isn't the \"Citizen Kane\" of rampaging puppet movies, but it's hard to deny the appeal of \"Puppet Master III: Toulon's Revenge\" as an extremely entertaining B-movie. A prequel to the imaginative series, \"Toulon's Revenge\" recounts how Andre Toulon brought his puppets to life, how the Nazis tried to steal his experiments to raise their dead, and how Toulon struck back with the help of his puppets \u0097 Six-Shooter, Blade, Tunneler, Pin Head and Ms. Leech. The film features above-average acting for a Full Moon production, and Guy Rolfe convincingly portrays Toulon. Especially notable is Ian Abercrombie, who played Mr. Pitt in \"Seinfeld,\" as Dr. Hess. Of course, the highlight of this series is the puppets, and \"Toulon's Revenge\" does not disappoint. Both the live-action and stop-motion sequences are well-crafted and downright creepy. Don't ask too many questions, like why the Germans speak English or why Toulon is presented as a good guy when the first \"Puppetmaster\" painted a much different picture. Just enjoy \"Toulon's Revenge\" for what it is: an entertaining prequel, no strings attached.",
         "The third part in the Puppet Master films is quite a surprise actually. It might even be better than the first in story telling! The acting is superb, the story is superb and the movie well...it's superb as well! This is actually a prequel to the original films, introducing the characters to us, including a new one named Six Shooter. This film, without spoiling anything is about killing Nazi's who have destroyed the Puppet Master. It is a very interesting look at events from World War II. A great installment in the series and well worth watching for the story alone!"
      ],
      "genres": [
         "Fantasy",
         "Horror",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": ["Full Moon Entertainment"],
      "summaries": ["Set in Berlin during WWII, the Nazi regime is attempting to develop a drug that will animate the dead, in order to use in the war effort. Toulon arouses suspicion as a Nazi dissident, and his secret is discovered. During a Nazi raid on his home, Toulon's beautiful wife is murdered. Toulon vows revenge, with the help of his animated puppets. This movie gives a new perspective on Toulon and his \"friends\"."],
      "budget": 800000
   },
   "movielensId": 3662,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1991-10-17",
      "dvdReleaseDate": "2000-05-23",
      "directors": ["David DeCoteau"],
      "runtime": 86,
      "movieId": 3662,
      "title": "Puppet Master III Toulon's Revenge",
      "mpaa": "R",
      "actors": [
         "Guy Rolfe",
         "Richard Lynch",
         "Ian Abercrombie",
         "Kristopher Logan",
         "Aron Eisenberg",
         "Walter Gotell",
         "Sarah Douglas",
         "Michelle Bauer",
         "Matthew Faison",
         "Jasmine Touschek",
         "Lenny Rose",
         "Landon Hall"
      ],
      "imdbMovieId": "0102728",
      "originalTitle": "Puppet Master III Toulon's Revenge",
      "genres": ["Horror"],
      "youtubeTrailerIds": ["Sq4MjUNvguI"],
      "plotSummary": "Set in Berlin during WWII, the Nazi regime is attempting to develop a drug that will animate the dead, in order to use in the war effort. Toulin arouses suspicion as a Nazi dissident, and his secret is discovered. During a Nazi raid on his home, Toulin's beautiful wife is murdered. Toulin vows revenge, with the help of his animated puppets.",
      "tmdbMovieId": 26956,
      "avgRating": 2.14535,
      "releaseYear": "1991",
      "numRatings": 344,
      "posterPath": "/BF7jnHlq8rwG1X0H7nFXQSbNlX.jpg"
   }
}