{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "puppet",
            "id": 6300
         },
         {
            "name": "sequel",
            "id": 9663
         }
      ],
      "imdb_id": "tt0107899",
      "video": false,
      "title": "Puppet Master 4",
      "recommendations": [
         26958,
         26959,
         26956,
         26954,
         26961,
         26960,
         26962,
         26953,
         32595,
         34312,
         38500,
         48302,
         40649,
         16846,
         19286,
         50687,
         38499,
         56242,
         55377,
         27651
      ],
      "backdrop_path": "/mGvLt7Qqnxk8M9yczKGv3Qu0HTb.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Rick Myers",
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04ac89",
               "name": "Gordon Currie",
               "profile_path": "/h06Vpwv0XHCogV4xULwNBVXN6dI.jpg",
               "id": 51539,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Susie",
               "gender": 1,
               "credit_id": "52fe4524c3a368484e04ac8d",
               "name": "Chandra West",
               "profile_path": "/7iUjeknSaQZtbcy07k1vKMjQAFm.jpg",
               "id": 54634,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Cameron",
               "gender": 0,
               "credit_id": "52fe4524c3a368484e04ac91",
               "name": "Ash Adams",
               "profile_path": "/vue39JS70MUxeT7flXMa6bsZBjC.jpg",
               "id": 224322,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Lauren",
               "gender": 1,
               "credit_id": "52fe4524c3a368484e04ac95",
               "name": "Teresa Hill",
               "profile_path": "/lUCwVSoh1ETkvNGEiJzgmYYLD4C.jpg",
               "id": 43433,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Toulon",
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04ac99",
               "name": "Guy Rolfe",
               "profile_path": "/fEXyb49srKS2XQuD8md0JFw9Ene.jpg",
               "id": 44883,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Dr. Carl Baker",
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04ac9d",
               "name": "Felton Perry",
               "profile_path": "/ax2YtmbicXvsjayLtK5VUxQh8fC.jpg",
               "id": 44042,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Dr. Leslie Piper",
               "gender": 0,
               "credit_id": "52fe4524c3a368484e04aca1",
               "name": "Stacie Randall",
               "profile_path": "/nwkRnODUw3vXAJlt5f0MVxXhhUn.jpg",
               "id": 106708,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Stanley",
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04aca5",
               "name": "Michael Shamus Wiles",
               "profile_path": "/upfSW6BGze446iqsZRehzcToNm8.jpg",
               "id": 9291,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Delivery Man",
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04aca9",
               "name": "Dan Zukovic",
               "profile_path": null,
               "id": 158480,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04ac85",
               "name": "Jeff Burr",
               "profile_path": null,
               "id": 31621,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04acaf",
               "name": "Charles Band",
               "profile_path": "/ulNdloEQNPhKrFOloAwW2R3m6DU.jpg",
               "id": 19707,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04acb5",
               "name": "Richard Band",
               "profile_path": null,
               "id": 19711,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4524c3a368484e04acbb",
               "name": "Todd Henschell",
               "profile_path": null,
               "id": 1174322,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4524c3a368484e04acc1",
               "name": "Steven E. Carr",
               "profile_path": null,
               "id": 1174323,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4524c3a368484e04acc7",
               "name": "Jo Duffy",
               "profile_path": null,
               "id": 1174324,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04accd",
               "name": "Douglas Aarniokoski",
               "profile_path": "/dQ5FUVrjKNzXEADBCg3DDSWewhW.jpg",
               "id": 71901,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4524c3a368484e04acd3",
               "name": "Keith S. Payson",
               "profile_path": null,
               "id": 1174325,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04acd9",
               "name": "David Schmoeller",
               "profile_path": "/qXfp7TR5E0nFpKBpoL41rOOP3MK.jpg",
               "id": 52268,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 0,
               "credit_id": "52fe4524c3a368484e04acdf",
               "name": "Adolfo Bartoli",
               "profile_path": "/weoIgV80gRk7LxzUtdYFwI0hdMG.jpg",
               "id": 19710,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04ace5",
               "name": "Mark S. Manos",
               "profile_path": null,
               "id": 42371,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe4524c3a368484e04aceb",
               "name": "Margeret-Anne Smith",
               "profile_path": null,
               "id": 1171851,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04acf7",
               "name": "Arlan Jay Vetter",
               "profile_path": null,
               "id": 7416,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "58271d54c3a368360b01be9a",
               "name": "Milo",
               "profile_path": null,
               "id": 24526,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 2.947978,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 26957,
      "vote_count": 29,
      "budget": 0,
      "overview": "A young scientist working on an artificial intelligence project is the target of strange gremlin-like creatures, who are out to kill him and thus terminate his research. By coincidence, in one of the rooms he uses, there's a mysterious case containing the puppets of the \"puppet master\". When the puppets are brought to life, they help destroy the creatures.",
      "similar": [
         11249,
         11932,
         11187,
         11186,
         10895,
         250546,
         11899,
         927,
         10585,
         13597,
         863,
         492,
         214756,
         10193,
         862,
         72105,
         644,
         11551,
         64328,
         167032
      ],
      "original_title": "Puppet Master 4",
      "runtime": 79,
      "poster_path": "/zaisXz8RRIqRy0Tnw20q7whKuM8.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Full Moon Entertainment",
         "id": 4867,
         "origin_country": ""
      }],
      "release_date": "1993-11-24",
      "vote_average": 4.8,
      "belongs_to_collection": {
         "backdrop_path": "/crDZjaOpoUCIOoiQ9nLIAt8ZBul.jpg",
         "name": "Puppet Master Collection",
         "id": 107949,
         "poster_path": "/wuLaEcy10wqgiVi4nCjdPXvcCyw.jpg"
      },
      "tagline": "When Bad Puppets Turn Good",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jeff Burr"],
      "runtime": 79,
      "synopsis": null,
      "writers": [
         "Todd Henschell",
         "Steven E. Carr"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0107899/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzU5MTYwNjc0MV5BMl5BanBnXkFtZTcwNTI0NTYzNQ@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Gordon Currie, Chandra West, Ash Adams | See full cast and crew »"],
      "reviews": [
         "This is strange and unlike the other puppet master movies in the series. But it is funny in many ways, for instance take Cameron's high pitched shrieking of obcenities, and the Head monster at the Beginning is Hilarious looking HA HA HA. I was very pleased the girl who plays Lauren, man is she attractive or WHAT? The puppets are good guys who have to fight off Evil? What happend to the Evil gene and the lust to get brain chunks HUH? Well it's pretty cool that they are good though. The soundtrack by Quiet Riot and Joker is the icing on the cake for me. Watch this movie it's not that long. and its pretty GOOD.",
         "In this third sequel Gordon Currie makes his first really big role of a movie . Rick (G.Currie) is the caretaker to a hotel . Him and three other friends find the puppets Pinhead, Jester , and you know all the others . In this moviee the puppets are good and are fighting evil . Tons of action pretty good . Followed by Part 5 witch is horrible . Believe me . If your a horror fan you should watch this movie . ** stars out of four . Guy Rolfe ( Toulon also makes his return . He was in the third .",
         "I though that PM4 and 5 were the best of the series. the puppets are fighting the Totems, minions of Sutek, who want the secret Toulon stole from him back. To help the Puppets, a new one, Decapitron (originally an idea for an unmade Empire Pictures filck) is made. This has always been my favorite Full Moon flick, and I love part V. Keep up the work Mr. Band. As usual, the video contains an excellent videozone, and the video itself was distributed by Paramount. A Puppet Master Box Set was released in 2000 by Full Moon, but was quickly recalled by Paramount because they still claimed the rights to these films. Paramount needs to stop being an ass and let Mr. Band release all of his great films through Full Moon, not the Paramount \"Full Screen Collection\". Bless Full Moon.",
         "The PUPPET MASTER series continues to be highly entertaining with this really fun sequel! Director JEFF BURR (Who became the first director to helm a PUPPET MASTER movie & not be named David) steers the series back to it's darker horror movie roots, that were seemingly abandon in PUPPET MASTER III: TOULON'S REVENGE. His direction is really good & he knows how to direct horror movies because it's clear he is a horror fan himself. I knew the series was in good hands with him at the helm, since I've been utterly impressed with his roster of films. What should be noted is how this sequel does away with any sexual elements & tones the gore down a bit (though it is still somewhat bloody) & adds a more fantasy like element to it. It also continues with the idea of the puppets once again being good guys & not evil as they were seen in the first two outings. This was mainly due to the amount of fan mail Producer Charles Band received from kids, who claimed they were big fans of the series & would even send him drawings of their favourite puppets. As is tradition with the series, the film adds a new puppet named \"Decapitron\" a head master that can change multiple heads & is really a channeller for Toulon's spirit to enter into. This is a very interesting puppet indeed, since Producer Band had a movie in production way back in the 80's that would feature this puppet, that unfortunately never happened when his EMPIRE PICTURES outfit crumbled into extinction. Sadly along with TORCH, this puppet would only be used in two movies, before being jettisoned with no mention of it's whereabouts after PART 5. The acting is well above par for the genre. GORDON CURRIE really shines as the likable college wiz kid & JASON ADAMS is perfection as his smart, but not as smart & very jealous, stuck up rival. While CHANDRA WEST is appealing as Rick's (GORDON CURRIE) girlfriend Susie. THERESA HILL is interesting as Susie's friend, a Channeler psychic. What I really enjoyed about this entry, is how it never lets up from start to finish, always providing us with new information & adds more back story to the serum. The plot is fun & the film features some good suspenseful moments, atmosphere & tension. The late David Allen really tops himself here, the puppet effects are pretty awesome & some of the best stop motion animation the series has to offer by far. The story in & of itself is very engaging & really easy & interesting enough to get sinked into. The Totem creatures are also a very interesting addition to the PUPPET MASTER fold & make for great villains for the puppets. The set design is really good, the totem puppets weird & creepy, in fact they have an almost Aztec like quality to them. On the downside though, there were a few things that kind of bugged me, but nothing to to spoil the fun of the movie: The SUTEK demon although an interesting character & creation is to rubbery looking to be taken seriously & you could tell it was a puppet, since it moved like one. I also had trouble stomaching the idea that the Bodega Bay Inn was open yet again for business, despite it's bloody history & the fact that the murderer(s) were never caught (the puppets themselves). I mean there is no way the authorities & government would allow it & even if they did, who would want to spend a night at an Inn, where a whole bunch of people were horribly mutilated on two separate occasions? The film also leaves some questions unanswered like: Whatever became of Camille, who became the puppets new master at the end of Part II? didn't her & the puppets leave the Bodega Bay Inn at the end of that movie? if so, why are the puppets back at Bodega Bay Inn again? Wasn't Toulon evil in Part II? if so, why do the puppets trust in Toulon again after he turned his back on them? Why is he a good guy yet again? the only answer I could come up with, was that this was Producer CHARLES BAND's idea of turning him good again, since the fan response was really positive for the character in III & they really grew to like the character in that film, since he was so sympathetic. Lastly, where was TORCH? despite being on the video box art, he is nowhere to be found here & no answers are given as to his whereabouts? where was Six Shooter in Parts 1 & 2? plus if the film takes place after II, & the puppets were weak from having no fluid in that one, then why are they all asleep here, but BLADE isn't? since he is still roaming around the Inn, does he not need serum too? & didn't TUNNLER die in PUPPET MASTER II? if so how is he alive here? See PUPPET MASTER: LEGACY for a correct chronological order of the series. In the end, PUPPET MASTER 4 is a very fun movie & a real treat for fans of the series. It's got all the things really fun & great sequels have, new elements & plot twists, more story with plenty of interesting avenues explored, better effects, better acting, great directing, a fun story & just enough suspense, tension & gore added & some fun & interesting villains to help make it one of the best in the series. Even after all these years the film never loses it's freshness & still manages to entertain you, despite having viewed it multiple times (which I have over the years) but question: Did they really need five writers to make an 80 minute movie & it's sequel? Shot simultaneously with PUPPET MASTER 5 **** stars",
         "The notorious Bodega Bay Inn is now inhabited by a whiz-kid science major named Rick Myers who is working for an elite team of scientists in hopes of finding out the secret of artificial intelligence. Meanwhile, in Hell, at the EXACT SAME MOMENT, a legion of evil rubbery demons send a horde of minions to the surface to kill anyone who has anything to do with Andre Toulon's elixir of animation. It certainly would be bad luck if Rick just happened to stumble upon a vial of the damning potion, now wouldn't it? Even though the plot of this particular chapter in the Puppet Master series is razor-thin and the acting stays consistently mundane throughout, it has a certain flair that most of the other entries don't. The puppets are much more likeable this time around, and their movements, although not as detailed or complex, are a lot more amusing and believable.",
         "I thought this was best one yet, (No, I am not Drunk lol ) I really enjoyed this one the most. I had fun of start to end of this movie, it's started of as Cheese as you can get, in the underworld of Hell (It''s kind of reminds of old Power ranger shows I used to watch when I was kid lol ) , the demon Sutekh send to of Totems which really nasty little creatures Rick Myers who ends up coming cross the Puppets and then bring they back for his own entertainment. Soon the puppets turn good and defend the Humans against the Totems and battle break with Blade and one of Creature. I love Jester face kept changing in fight scenes, I found it's really funny, I think could of helped that if thee kids in this movie instead of Adults. I can see why not many people like this movie, there was really limited on on kill scenes, there not many bloody moment. Some of the acting in this movie, as got to be worse anything in this series so. I think lead guy the only you acting didn't not bother me. Overall going to give this a 6 out of 10 (I was going give 7 but I was hoping of for more gore) I wasn't even thinking of seeing 5, i might end up having fun with it",
         "Toulon's puppets battle a bunch of gremlin-like monsters who want to steal the elixir from boyish young scientist Rick Myers (a lively and engaging performance by Gordon Currie). Director Jeff Burr relates the entertaining premise at a brisk pace, maintains a generally serious tone throughout, makes neat occasional use of funky stop-motion animation, and delivers a generous sprinkling of gore. This film further benefits from solid acting from a capable cast: pretty Chandra West as Rick's sweet girlfriend Susie, Jason Adams as smug and jealous jerk Cameron, and foxy Teresa Hill as sensitive psychic Lauren. Gulf Rolfe makes a welcome return appearance as Andre Toulon while Felton Perry has a regrettably small part as amiable scientist Dr. Carl Baker. The gremlin creatures are real gnarly. Moreover, it's cool to see the puppets as the good guys for a change. The tight 80 minute running time ensures that this movie never gets dull or overstays its welcome. Adolfi Bartoli's crisp cinematography gives the picture a pleasing polished look. Richard Band's spirited score hits the nicely spooky spot. Worth a watch for fans of this franchise.",
         "Puppet Master is one of those franchises that every horror fan knows, and has a peculiar fondness for despite the fact that it isn't very good at all. Here, in the fourth instalment we see a demonic creature out to destroy anything associated with the eponymous puppet master, Anton Toulon himself. The subjects of his wrath? The lethal and animate toys Toulon created, as well as an improbably young scientist working on a project to bring life to the inanimate and a clutch of his witless friends and associates. Sound dreadful? Well, it's not. Harking back to the glory days of American horror, this is retro stuff that feels as if it was made ten years before it actually was. And that's a good thing, kids. Trust me, if the only horror you have seen is 'Shrooms, Thir13en ghosts and other such nonsense that gets the green light in modern horror cinema, you really are missing out and would do well to check out pretty much anything pre 1989 as an educational experience. Whilst the production levels and acting are bordering on the inane, this has atmosphere by the bucket load. In truth, the Puppet Master movies feel like really dark kids films, as there is next to nothing in the way of gore or violence, though this one at least has an entertaining death scene near the start which is relatively tense. Special mention must go to the metal soundtrack, which was great, as well as the device used to end the demonic menace: The Decapitron, a puppet with the power of mimicry. Entertaining enough horror yarn.",
         "A severe backwards step for the puppets in this mainly dull and tedious outing. Guy Rolfe, so fantastic as Andre Toulon in part three barely features this time and Richard Band's fantastical them tune appears with the puppets a fair few minutes in to the film. For the start of the movie we are introduced to the caretaker of Bodega Bay Inn (Gordon Currie) and some youth friends of his (many of the cast are Canadian and are all very good in unfortunately rather undemanding roles - Teresa Hill is quite yummy). Totems, minions of the Egyptian God Sutek want the secret of animation life back and the puppets (when they surface) act with a previously unseen cleverness to attempt to destroy the ugly and very computer game looking Totems. The Totems merely complicate the series and distract from the things that previously made the series so unique - they don't share the weird beauty of the puppets and thus don't really fit in. Top scene is Pinhead using a rag to clean blood from Tunnelers drill bit, classic and about the goriest this film goes. The fifth film was filmed concurrently with this one so expect similar sections of mediocre and a Toulon performance that seems to have been filmed in a different era (or even galaxy). Guy Rolfe deserved better and series fans certainly do. Grrrrrrr.",
         "I absolutely love the first three movies, they were great! I once caught Part 5 on VHS 10 years ago, and I was disappointed. But perhaps that was because I never saw the fourth one, because they were shot back-to-back. but after finally viewing a copy today, I have to say it was no way better than number 5. My expectations weren't high to begin with, but this is cheap direct-to-video stuff, not even a horror movie, it's PG-13. The acting was not convincing, the story was rather dumb without any excitement and there were not many effects. But the main problem is that there were no kills or any gore (the annoying kid who gets killed in his car was supposed to be the highlight, but come on..) Surprisingly, both Parts 4 and 5 were directed by Sequel-director Jeff Burr who gave us the excellent Stepfather II and Leatherface: Texas Chainsaw Massacre III. I liked Puppet Master: The Legacy, even if it was nothing else than a tribute with the best scenes from all movies. Overall, Puppet Master is very much like the Hellraiser Series: A great trilogy but forget the rest.."
      ],
      "genres": [
         "Fantasy",
         "Horror"
      ],
      "productionCompanies": ["Full Moon Entertainment"],
      "summaries": ["A young scientist working on an artificial intelligence project is the target of strange gremlin-like creatures, who are out to kill him and thus terminate his research. By coincidence, in one of the rooms he uses, there's a mysterious case containing the puppets of the \"puppet master\". When the puppets are brought to life, they help destroy the creatures."],
      "budget": 0
   },
   "movielensId": 3663,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1993-11-24",
      "dvdReleaseDate": "2000-05-23",
      "directors": ["Jeff Burr"],
      "runtime": 79,
      "movieId": 3663,
      "title": "Puppet Master 4",
      "mpaa": "R",
      "actors": [
         "Gordon Currie",
         "Chandra West",
         "Ash Adams",
         "Teresa Hill",
         "Guy Rolfe",
         "Felton Perry",
         "Stacie Randall",
         "Michael Shamus Wiles",
         "Dan Zukovic"
      ],
      "imdbMovieId": "0107899",
      "originalTitle": "Puppet Master 4",
      "genres": ["Horror"],
      "youtubeTrailerIds": ["_Ry0urSxtF0"],
      "plotSummary": "A young scientist working on an artificial intelligence project is the target of strange gremlin-like creatures, who are out to kill him and thus terminate his research. By coincidence, in one of the rooms he uses, there's a mysterious case containing the puppets of the \"puppet master\". When the puppets are brought to life, they help destroy the creatures.",
      "tmdbMovieId": 26957,
      "avgRating": 1.95306,
      "releaseYear": "1993",
      "numRatings": 245,
      "posterPath": "/zaisXz8RRIqRy0Tnw20q7whKuM8.jpg"
   }
}