{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "puppet",
            "id": 6300
         },
         {
            "name": "sequel",
            "id": 9663
         },
         {
            "name": "demon",
            "id": 15001
         }
      ],
      "imdb_id": "tt0110916",
      "video": false,
      "title": "Puppet Master 5: The Final Chapter",
      "recommendations": [
         26957,
         26959,
         26961,
         26956,
         26954,
         26960,
         26962,
         59762,
         40649,
         26953,
         36859,
         48302,
         139659,
         35945,
         38499,
         32595,
         131847,
         27651,
         34312,
         38500
      ],
      "backdrop_path": "/ol4wv7jB5knZgsONHC9K03eJSfY.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Rick Myers",
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04ad31",
               "name": "Gordon Currie",
               "profile_path": "/h06Vpwv0XHCogV4xULwNBVXN6dI.jpg",
               "id": 51539,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Susie",
               "gender": 1,
               "credit_id": "52fe4524c3a368484e04ad35",
               "name": "Chandra West",
               "profile_path": "/7iUjeknSaQZtbcy07k1vKMjQAFm.jpg",
               "id": 54634,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Dr. Jennings",
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04ad39",
               "name": "Ian Ogilvy",
               "profile_path": "/9v9ko9rO3rpGfSJNnSW5AE68eGS.jpg",
               "id": 51755,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Lauren",
               "gender": 1,
               "credit_id": "52fe4524c3a368484e04ad3d",
               "name": "Teresa Hill",
               "profile_path": "/lUCwVSoh1ETkvNGEiJzgmYYLD4C.jpg",
               "id": 43433,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Andre Toulon",
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04ad41",
               "name": "Guy Rolfe",
               "profile_path": "/fEXyb49srKS2XQuD8md0JFw9Ene.jpg",
               "id": 44883,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Hendy",
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04ad45",
               "name": "Nicholas Guest",
               "profile_path": "/ohlltWmy7xiyQ7CwEZhV6KnyeKO.jpg",
               "id": 36821,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Jason",
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04ad49",
               "name": "Willard E. Pugh",
               "profile_path": "/iihJATSCFfsXnjcKR6OMDm1bDSS.jpg",
               "id": 13310,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Attorney",
               "gender": 1,
               "credit_id": "52fe4524c3a368484e04ad4d",
               "name": "Diane McBain",
               "profile_path": "/kdkt1nzaCaoGRdHNefufnoeNkkG.jpg",
               "id": 83462,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Scott",
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04ad51",
               "name": "Duane Whitaker",
               "profile_path": "/cFSmuGjUNonH683dmvx0mZ2Uots.jpg",
               "id": 11804,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Man #2",
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04ad55",
               "name": "Kaz Garas",
               "profile_path": null,
               "id": 102640,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Man #1",
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04ad59",
               "name": "Clu Gulager",
               "profile_path": "/bjmydNfO5v5LocgBGTmCcBSSe6A.jpg",
               "id": 62019,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Krankenschwester",
               "gender": 1,
               "credit_id": "52fe4524c3a368484e04ad5d",
               "name": "Harri James",
               "profile_path": "/2fePgW7EG9k2JU9pfLm9Iega44Y.jpg",
               "id": 230464,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Dectective",
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04ad61",
               "name": "Ron O'Neal",
               "profile_path": "/zagW0Cr1rhSpUQMxNC0fVpjPUrs.jpg",
               "id": 55841,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04ad2d",
               "name": "Jeff Burr",
               "profile_path": null,
               "id": 31621,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4524c3a368484e04ad67",
               "name": "Steven E. Carr",
               "profile_path": null,
               "id": 1174323,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4524c3a368484e04ad6d",
               "name": "Jo Duffy",
               "profile_path": null,
               "id": 1174324,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4524c3a368484e04ad73",
               "name": "Todd Henschell",
               "profile_path": null,
               "id": 1174322,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04ad79",
               "name": "Douglas Aarniokoski",
               "profile_path": "/dQ5FUVrjKNzXEADBCg3DDSWewhW.jpg",
               "id": 71901,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4524c3a368484e04ad7f",
               "name": "Keith S. Payson",
               "profile_path": null,
               "id": 1174325,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04ad85",
               "name": "Charles Band",
               "profile_path": "/ulNdloEQNPhKrFOloAwW2R3m6DU.jpg",
               "id": 19707,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4524c3a368484e04ad8b",
               "name": "Adolfo Bartoli",
               "profile_path": "/weoIgV80gRk7LxzUtdYFwI0hdMG.jpg",
               "id": 19710,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe4524c3a368484e04ad91",
               "name": "Margeret-Anne Smith",
               "profile_path": null,
               "id": 1171851,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4524c3a368484e04ad97",
               "name": "Milo",
               "profile_path": null,
               "id": 24526,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "55298607c3a3683e5200108e",
               "name": "Joel Fletcher",
               "profile_path": null,
               "id": 1452932,
               "department": "Visual Effects",
               "job": "Animation"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 2.927126,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 26958,
      "vote_count": 25,
      "budget": 0,
      "overview": "The puppets battle their most powerful enemy yet as they protect the new puppet master from the demon God that created the Secret of Life.",
      "similar": [
         250546,
         561,
         11249,
         9003,
         184346,
         11932,
         11187,
         9552,
         91586,
         588,
         622,
         764,
         805,
         396422,
         10014,
         259693,
         409297,
         11186,
         441701,
         10895
      ],
      "original_title": "Puppet Master 5: The Final Chapter",
      "runtime": 82,
      "poster_path": "/9EFZ9aHCjTh4XufIkg1mG3mocRP.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Full Moon Entertainment",
         "id": 4867,
         "origin_country": ""
      }],
      "release_date": "1994-09-21",
      "vote_average": 4.1,
      "belongs_to_collection": {
         "backdrop_path": "/crDZjaOpoUCIOoiQ9nLIAt8ZBul.jpg",
         "name": "Puppet Master Collection",
         "id": 107949,
         "poster_path": "/wuLaEcy10wqgiVi4nCjdPXvcCyw.jpg"
      },
      "tagline": "Puppets Vs. An All New Evil!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jeff Burr"],
      "runtime": 82,
      "synopsis": null,
      "writers": [
         "Steven E. Carr",
         "Jo Duffy"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0110916/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNzI3MDg3NTEzMV5BMl5BanBnXkFtZTcwMjE0NTYzNQ@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Gordon Currie, Chandra West, Ian Ogilvy | See full cast and crew »"],
      "reviews": [
         "First of all don't believe ALL of the harsh words that were said about this film. In my opinion it is definitely worth a try. Part six was MUCH worse. This one was creative and different as each movie in the series. I know what I am talking about; I've been a huge fan since I was a kid, I've seen all of the movies, and I even own a Blade replica. Maybe the reason why I liked this movie so much is because when I first saw it I was very young (yet at the same time an obsessed fan) and found the plot perfect for me: all of our favorite little puppets, including a very cool new one who only appears in parts four and five, are this time completely good and fighting pure evil and equally small enemies. It was neat seeing the puppets really work together, it was neat seeing them interact and communicate with humans in a friendly way for a change, and it was also neat that there was sequel that I could actually watch with my family. (keeping in mind that I was young and that the other films were much more \"hard core\", not that I didn't love the carnage candy myself) The point is we know that while these puppets are good they have done a million ultra-violent,perverse,maniacal, and destructive things, which makes a perfect stand off between our little anti-heros and the absolutely evil demons. And a lot of fans seem to forget that the puppets did not turn good, but in fact were always good. If you've seen part 3 you would know that they were nice people in life, and if you are a steady viewer in the puppets adventures you should notice the fact that the puppets up untill know have killed for only two reasons: survival or because their master(s) forced them to. So give the flick a try, I know that some of you will not like it but it is one of my favorites in the ever-expanding Puppet Master universe.",
         "PUPPET MASTER 5 (was intended at the time) to be the last film in the PUPPET MASTER series. Shot back to back with Part 4. PUPPET MASTER 5 picks up right where that film ended. Returning director JEFF BURR does great behind the camera. Able to pull of a few suspenseful moments, adds plenty of tension & throws in a few bloody murders here & there. The acting remains reasonably above par for this type of film. GORDON CURRIE is perfection as Rick, the wiz kid set to become the new puppet master, while CHANDRA WEST is fun to watch as his girlfriend. The human villains are really fun to watch as well, especially the one playing the head of the company Rick works for, who has comes to Bodega Bay Inn to capture the puppets & their secret in order to sell it to the highest bidder. Sadly THERESA HILL who is rather talented who had her character put to good use in the last film, is wasted in her role as the psychic channeller Lauren. Since she spends the entire film in a coma, lying in a hospital bed. Her part could so easily have been written around since she serves the plot none at all. David Allen returns to do the stop motion animation & was clearly having a ball since the effects seen here are really something special & best of all TORCH is back (though where he was in Part 4 is never explained). That said there were some problems that I had with the film, nothing major to spoil the viewing experience though, they were as follows: As I already mentioned in my review for Part 4, the SUTEK demon looked to rubbery & was clearly a puppet, since it moved like one. It's not featured as much in this one, as it was in Part 4 though. Plus it's clear that FULL MOON deliberately took one film apart in order to make two movies, since there really isn't that much going on in Part 5, that it couldn't have been added to Part 4 to make one movie. The vast majority of the scenes here feature people walking down dark hallways looking for the puppets or stumbling around when running from the Totem demon, which added alongside a five minute flashback sequence, a three minute opening credits intro & a four minute closing credits sequence, & several pointless scenes of Sutek trying to bring the totem to life after several pelvic thrusts, scattered throughout the first forty minutes of the movie eats up a sizable chunk of the films sparse 80 minute running time. A lot of the footage here seemingly was padded in, to max out the films running time. Not that this is surprising, since FULL MOON did the same with their TRANCERS/SUBSPECIES series around the same time, with them (like this movie), announcing that there would be no more entries to either cannon, only for FULL MOON to recant on that promise a few years later by making more sequels. Look for CLU GULAGER in a bit part. In the end despite some short comings, PUPPET MASTER 5 was a really fun film that I felt closed the series out quiet nicely. In my eyes the PUPPET MASTER series would never be the same again. This would also be one of the last films FULL MOON would release through it's gates before it's departure from PARAMOUNT. It would mark the end of the series story lines at Bodega Bay Inn (PUPPET MASTER: LEGACY's plot doesn't count). It would mark the end of David Allen's involvement (he would sadly pass away a few short years later from cancer) & the last one to feature a really good plot, great effects, suspense, tension & atmosphere & fun characters, all the things that virtually none of the sequels that would follow had & would mark the last time we would see TORCH & DECAPITRON. In short, this is literally the last one you had to see! the next few prequels & sequels were nowhere near as good as the first five films in the series, they didn't even come close. Had this been truly the last film in the series it would have gone out on top! Producer CHARLES BAND would later announce a spin off series called PUPPET WARS, that never happened, when FULL MOON collapsed briefly in the mid 90's, with plans for a PUPPET MASTER VS. DEMONIC TOYS movie going with it. Before resuming in the late 90's without PARAMOUNT'S backing, meaning they were on their own to try & fund their own films, that were nowhere near as good (mainly due to budget constraints & really bad plots) as the films they made with PARAMOUNT in the early to mid 90's. See PUPPET MASTER: LEGACY for a correct & complete chronological order of the series. Despite the title, the Puppets came back four years later in - CURSE OF THE PUPPET MASTER: THE HUMAN EXPERIMENT **** stars",
         "The final chapter\u0085 ah where have I heard this before? \"Sorry your reservation has just been cancelled!\" Well we know that's definitely not the case, as Full Moon's killer doll franchise is still kicking on. Chapter 5 pretty much follows on from the fourth film (as they were virtually shot back-to-back by director Jeff Burr with the same cast and crew) and I found it a little more enjoyable than previous instalment. After recapping what had already occurred, again the new puppet master Rick Myers must face up against the ancient Egyptian God Sutek who wants to destroy any sort of evidence about its reanimated ancient magic that Toulon had stolen and also cope with an interfering scientist played with devious glee by Ian Ogilvy. The outlandish story layout is simply as before, repeating what happened in the fourth chapter (even with a storm brewing) but the pacing is a lot better and energy much more spruce with the Gothic seaside hotel having a little more of an impression. The thing was that the sequences involving Sutek just didn't seem to work (with its unconvincing voice reciting ridiculous dialogues and the dramatic body movements). It looked good it detail, but I preferred when it wasn't focusing on that demon. Director Jeff Burr ably constructs some atmospheric set-pieces, creating more a nightmarish tone like a very odd, but jarring dream sequence that was just as darkly unpleasant as any of the scenes from the original. Quite uneven in mood, due to its unbalanced material of humour and horror, but at times the goofiness does take away from it. Like some of the attack / death set-ups follow a formula; run, fall on ground, begin crawling and wrestle than die a bloody death. Not much else to it. The illuminating special effects are just as potent as before with it colourful optical work and masterful puppet creations. The creativity shows in the puppet work forming their own characteristics, from the animation and the effective movements of the puppets. All the iconic puppets return, also with the new creation Decapitron that's inhabitant by the spirit Andre Toulon when resurrected by electricity. Modest acting by returning leads Gordon Currie and Chandra West. Teresa Hill returns in a lesser part and Guy Rolfe. Ian Ogilvy is great and Clu Gulager makes a cameo appearance. There's good support by Nicholas Guest, Willard E. Pugh and Duane Whitaker.",
         "Certainly not the 'final chapter' and though sometimes subtitled 'the latest chapter' this is also true of Puppet Master 2, 3, 4 and the other sequels. Filmed concurrently with Chapter 4 (NOT back-to-back as often mis-claimed) this has the same director (Jeff Burr) and most of the main cast - though yummy Teresa Hill is in a coma and Gordon Currie beefcakes his way through police questioning and whatever with the help of sex interest (not love) Chandra West. English actor Ian Ogilvy joins the English (and frankly quite amazing) Guy Rolfe as Toulon. Ogilvy plays a villainous doctor wanting to steal the puppets secret but of course has to battle with the lovely puppets, their saviour Gordon Currie and the Egypyian God, Suketh and Mr Totem from the third film. Many of the extras in this one (including the thugs that Ogilvy hires to steal the puppets) are actual animators and special effects people so its fun to see them acting alongside that which they normally create. Toulon barely features again and its truly a pity that the team at Full Moon couldn't produce a stronger story and one where Toulon could truly feature (Guy Rolfe was deceased before any demanding sequel was made). Not sure why this seemed better than volume four but it is less dull and the English/Canadian cast make good viewing. Top scenes include menacing Six-Shooter fires the fingers from Totems' claws and a dream sequence (usually so tedious) where Teresa Hill (the psychic from number four who is in a coma now) is orgasmic in a blood filled bath tub as Pinhead holds her head as Tunneler drills her skull - it's a job to explain why this scene is so great but see it and you'll probably agree. Special mention for Jester because he rocks and in a way his head rolls!..!",
         "I don't have much to say about Puppet Master V. It more or less treads all the waters of its predecessor. The movie takes place just after PM4. The next day in fact (they were shot back to back). Rick is being questioned by the cops (who else, the sushi bar attendents?) about the previous nights ensuing mayhem. While trying to sort out all of this crap, Rick finds out from Lauren that more puppet-related chaos is on the way. It appears Suteckh, the villian from the previous chapter, has decided he has no choice but to take things into his own hands after lastnight's failure. He transfers his power and mind into a single totem and sends it to the human realm. This doesn't settle all that well with our protagonists. A totem-puppet tustle erupts. Since this was shot right with PM4 it is more or less the same movie. Same actors, same puppets (except for Torch, who for some reason was conspicuous by his absence in the last), same villain, same everything. Which brings up a question. If Suteckh could just put himself into a totem or more, why didn't he do that in the first place? What did he want to get paid for TWO movies? I really can't find myself to recomend this to anyone except hardcore Puppet Master fans. Even a large group of them dislike. Not that it's any worse than the previous (which is unpopular as well). But it doesn't bring anything new to the table. Only for PM fans who want to see all of the pictures as part of a huge Puppethon.",
         "This movie start off just Day after Puppet Master 4, which I thought was decent idea, to give a hint of first in it. This movie did have bit more of plot then the one before, everyone from last movie turn, even Sutekh who creates a new creature. This was entertaining to watch and it's never it's boring at all as them movie flows really well.. The acting was decent in this movie, better then the one before. I give this movie 5 out of 10 I going to skip sixth, really messed thing up with no Torch and bring back Leech Woman, when she killed in part 2! By missing 6, Part 7 is sequel to Part 3 ?",
         "This picks up days after part 4 with Rick Myers being charged with the murders of his colleagues. He gets bailed out by the company he was working for and, while the authorities don't believe his stories of killer mini-demons, Dr. Jennings (Ian Ogilvy) is intrigued. He gets together a shady group of folks to head to the Inn to retrieve these puppets. Of course, Myers has shown up there too. And our old pal Sutek is still around and sends his ultimate creation (the same old mini-demon puppet but with a cape) back to kill. If you needed a sign that the wheels were coming off at Charles Band's Full Moon, look no further than this fifth entry in his top series. Showing pre-Weinstein intuition (without the dollars), Band chopped the script of one film into two and we get this sad excuse for a film, complete with credit padding and a 5 minute on screen recap of the previous entry. Poor director Jeff Burr, a true talent who has been relegated to lower level horror sequels. This just features folks walking around the hotel getting killed. The saddest/funniest/strangest thing is the point of this entry is to once again resurrect Decapitron and have Toulon tell Rick he is the puppet master. Didn't we already do that? Ron O'Neal and Clu Gulagher both have small cameos. Subtitled \"The Final Chapter\" on the VHS box, this was the last PUPPET MASTER film released by Paramount. The next entry, CURSE OF THE PUPPET MASTER, would appear in 1998.",
         "I like the Puppet Master movies and Puppet Master 5: The Final Chapter is one of my favourite sequels, it was shot back to back with Puppet Master 4 since the story takes place after part 4. One interesting thing is that Torch is in this one but not in Puppet Master 4 even though on the box I've got for Puppet Master 4 he's shown with the other Puppets. The plot sees Richard Myers under arrest since they think he killed Dr. Baker and Dr. Piper and the others with the Puppets since they think he programmed them to. He then meets the boss of the company who is interested about Puppets with a mind of their own and after leaving he comes up with a plan to go to the Inn and steal the Puppets with the help of a few people, meanwhile Richard's girlfriend pays bail to get him out and Blade who was taken in the evidence room escapes and goes into their bag. That night Richard sees Blade and finds out that the other Puppets are still in the Inn so they go to get them while Sutek plans to get his secret by sending his own Totem to the Inn, Richard goes into the Inn to get the Puppets and soon his girlfriend helps him, the psychic keeps on having nightmares and through telekinesis informs Richard to make more of the formula. Meanwhile the Puppets are trying to stop the thieves while the Sutek Totem is killing them off and searching for the secret. Soon Richard re-activates the Decapatron and with the help of Toulon's Spirt stop the Sutek Totem for good and then Richard Myers is the new Puppet Master. Puppet Master 5: The Final Chapter wasn't really the last in the series because four more films was made, Curse of the Puppet Master, Retro Puppet Master, Puppet Master: The Legacy and Puppet Master Vs Demonic Toys. Puppet Master 5: The Final Chapter is a great sequel. Check it out. 10/10",
         "The fifth and apparent last Puppet master movie, LIE! They made another 4 if u include PM VS DT. This movie continues straight after the 4th and it is more of a fantasy rather than a horror, Totem the evil god sets his spirit in a puppet size daemon and travels to the human realm to kill Andre Toulon and his puppets, true this is not as gory as some of the other PM movies but it really doesn't matter it is still a good movie worth seeing if u want to see what happens in the PM story.The acting isn't really bad but not great but u can accept that for a B-Movie. Unfortuanly the movie is quite short and thats not nice they could of made the battles longer and better and made even a few more fights between those totems from the 4th movie.",
         "PUPPET MASTER V: THE FINAL CHAPTER 🌕🌕🌕🌗🌑 3.6 This movie has the same elements of four, puppets vs puppets, a similar plot and many of the same actors, except PM5 does it better. It has a well flowing plot, good camera work, a satisfying conclusion, and more horror. So yes it is much better than the third. It also adds some more characters, who provide the human enemy that horror films need, more of the maze-like hotel, which boosts the horror well, and gives decapatron a better role. There still are the cheesy moments such as Toulon being channeled through a puppet and sutek the demon god of Styrofoam's appearances, but they add comic relief, and this is a B- movie, so what ever. Recommended for fans of gremlins, PM. Series, or any other little monster movie, and for the tween horror audience."
      ],
      "genres": [
         "Fantasy",
         "Horror"
      ],
      "productionCompanies": ["Full Moon Entertainment"],
      "summaries": [
         "After having his demon destroyed, an anciet evil creates a puppet of himself to release on the world. With the help of Toulon's spirit the Risk Myers destroys the demon and becomes the new puppet master",
         "The puppets battle their most powerful enemy yet as they protect the new puppet master from the demon God that created the Secret of Life."
      ],
      "budget": 0
   },
   "movielensId": 3664,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-09-21",
      "dvdReleaseDate": "2000-05-23",
      "directors": ["Jeff Burr"],
      "runtime": 82,
      "movieId": 3664,
      "title": "Puppet Master 5: The Final Chapter",
      "mpaa": "R",
      "actors": [
         "Gordon Currie",
         "Chandra West",
         "Ian Ogilvy",
         "Teresa Hill",
         "Guy Rolfe",
         "Nicholas Guest",
         "Willard E. Pugh",
         "Diane McBain",
         "Duane Whitaker",
         "Kaz Garas",
         "Clu Gulager",
         "Harri James",
         "Ron O'Neal"
      ],
      "imdbMovieId": "0110916",
      "originalTitle": "Puppet Master 5: The Final Chapter",
      "genres": ["Horror"],
      "youtubeTrailerIds": ["VsV2XJTg8hc"],
      "plotSummary": "The puppets battle their most powerful enemy yet as they protect the new puppet master from the demon God that created the Secret of Life.",
      "tmdbMovieId": 26958,
      "avgRating": 1.81489,
      "releaseYear": "1994",
      "numRatings": 235,
      "posterPath": "/9EFZ9aHCjTh4XufIkg1mG3mocRP.jpg"
   }
}