{
   "tmdb": {
      "original_language": "pt",
      "keywords": [
         {
            "name": "puppet",
            "id": 6300
         },
         {
            "name": "puppet master",
            "id": 10100
         }
      ],
      "imdb_id": "tt0132451",
      "video": false,
      "title": "Curse of the Puppet Master",
      "recommendations": [
         26957,
         26958,
         26961,
         26956,
         26960,
         26954,
         26962,
         27651,
         38499,
         36859,
         48302,
         38500,
         55377,
         41671,
         35945,
         139659,
         39930,
         16846,
         50687,
         70553
      ],
      "backdrop_path": "/yyZu82fL7pBccF6NeZ34qqXLd1h.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Dr. Magrew / Puppet Master",
               "gender": 0,
               "credit_id": "52fe4524c3a368484e04addb",
               "name": "George Peck",
               "profile_path": null,
               "id": 1048436,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Jane Magrew",
               "gender": 0,
               "credit_id": "52fe4524c3a368484e04addf",
               "name": "Emily Harrison",
               "profile_path": "/63sRIANIrJrpkkE3Ki4qkI2JiPj.jpg",
               "id": 75311,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Robert 'Tank' Winsley",
               "gender": 0,
               "credit_id": "52fe4524c3a368484e04ade3",
               "name": "Josh Green",
               "profile_path": "/sffsuliMMAZnR08L55lrRYaC0Zh.jpg",
               "id": 168020,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Joey Carp",
               "gender": 0,
               "credit_id": "52fe4524c3a368484e04ade7",
               "name": "Michael Guerin",
               "profile_path": null,
               "id": 1014964,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Station Owner",
               "gender": 0,
               "credit_id": "52fe4524c3a368484e04adeb",
               "name": "Michael Sollenberger",
               "profile_path": null,
               "id": 181625,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Art Cooney",
               "gender": 0,
               "credit_id": "52fe4524c3a368484e04adef",
               "name": "Marc Newburger",
               "profile_path": null,
               "id": 100174,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Larry",
               "gender": 0,
               "credit_id": "52fe4524c3a368484e04adf3",
               "name": "Scott Boyer",
               "profile_path": null,
               "id": 1048437,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Pogo",
               "gender": 0,
               "credit_id": "52fe4524c3a368484e04adf7",
               "name": "Jason Dean Booher",
               "profile_path": null,
               "id": 1048438,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Sherrif Garvey",
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04adfb",
               "name": "Robert Donavan",
               "profile_path": "/61aRNCMA27E8TkC3IiASDZePIoR.jpg",
               "id": 83387,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Deputy Wayburn",
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04adff",
               "name": "Jason-Shane Scott",
               "profile_path": "/fBtD5iQabf08YTg1fXlGHE1dCiZ.jpg",
               "id": 98658,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Medical Examiner",
               "gender": 0,
               "credit_id": "52fe4524c3a368484e04ae03",
               "name": "William Knight",
               "profile_path": null,
               "id": 95571,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Shipping Agent",
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04ae07",
               "name": "Patrick Thomas",
               "profile_path": null,
               "id": 98859,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Operator",
               "gender": 1,
               "credit_id": "52fe4524c3a368484e04ae0b",
               "name": "Ariauna Albright",
               "profile_path": "/haC2jejpRor6HSHSLNeQ6rzbCtv.jpg",
               "id": 99053,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Tommy Berke",
               "gender": 0,
               "credit_id": "52fe4524c3a368484e04ae0f",
               "name": "J.R. Bookwalter",
               "profile_path": null,
               "id": 31624,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Komparse",
               "gender": 0,
               "credit_id": "52fe4524c3a368484e04ae13",
               "name": "Brandon Ikels",
               "profile_path": null,
               "id": 1048439,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04add1",
               "name": "David DeCoteau",
               "profile_path": "/nFOFizArK1Vwoo2v4HRKdKXJlrl.jpg",
               "id": 97618,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4524c3a368484e04add7",
               "name": "Benjamin Carr",
               "profile_path": null,
               "id": 31625,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4524c3a368484e04ae19",
               "name": "Kirk Edward Hansen",
               "profile_path": null,
               "id": 100530,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04ae1f",
               "name": "Albert Band",
               "profile_path": null,
               "id": 19708,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04ae25",
               "name": "Charles Band",
               "profile_path": "/ulNdloEQNPhKrFOloAwW2R3m6DU.jpg",
               "id": 19707,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04ae2b",
               "name": "Richard Band",
               "profile_path": null,
               "id": 19711,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4524c3a368484e04ae31",
               "name": "Jeffrey Walton",
               "profile_path": null,
               "id": 99741,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4524c3a368484e04ae37",
               "name": "J.R. Bookwalter",
               "profile_path": null,
               "id": 31624,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4524c3a368484e04ae3d",
               "name": "Allison Shavitz",
               "profile_path": null,
               "id": 1187809,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04ae43",
               "name": "Howard Wexler",
               "profile_path": "/7giJ8jJdJ0YY9zn0yKKaP1Y4P6Y.jpg",
               "id": 98559,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 2.635885,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 26959,
      "vote_count": 25,
      "budget": 0,
      "overview": "Robert \"Tank\" begins to work for Dr. Magrew sculpting a puppet for the Doctor to bring to life using the work of Andre Toulon. Robert begins to fall in love with the Doctors daughter, Jane. Unbeknownst to Robert the Doctor is trying to create a \"perfect race\" of puppet humans. Jane discovers a \"matt puppet\" which is from his first assistant. She comes back just in time to see her father, cut up by the puppets, has succeeded in putting a living human, Robert, into the puppet he carved.",
      "similar": [
         11249,
         11932,
         11187,
         11186,
         10895,
         250546,
         11899,
         927,
         10585,
         10193,
         862,
         863,
         492,
         13597,
         72105,
         214756,
         644,
         64328,
         11551,
         167032
      ],
      "original_title": "Curse of the Puppet Master",
      "runtime": 90,
      "poster_path": "/xYUPZ6uz2bXeyQt0fs2kibAldSm.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Full Moon Entertainment",
         "id": 4867,
         "origin_country": ""
      }],
      "release_date": "1998-05-26",
      "vote_average": 3.3,
      "belongs_to_collection": {
         "backdrop_path": "/crDZjaOpoUCIOoiQ9nLIAt8ZBul.jpg",
         "name": "Puppet Master Collection",
         "id": 107949,
         "poster_path": "/wuLaEcy10wqgiVi4nCjdPXvcCyw.jpg"
      },
      "tagline": "Four Years Ago, the Puppets of Andre Toulon Vanished Without a Trace. Now The Puppets have Found a New Home, And a New Puppet Master.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["David DeCoteau"],
      "runtime": 90,
      "synopsis": null,
      "writers": ["Neal Marshall Stevens"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0132451/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNzY4ODczNTQyMl5BMl5BanBnXkFtZTcwNDE0NTYzNQ@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: George Peck, Emily Harrison, Josh Green | See full cast and crew »"],
      "reviews": [
         "About 95% of the Puppet shots were patched together from other Puppet Master movies. This produces the interesting effect of having someone from the present chatting face to face with a puppet in 1940's Germany. Did they think we wouldn't notice? It just shows you what these film makers think of their audience. Then there's the scene in which Tunnler drills a guy between the legs. Where are the guys hands? Flailing around! I think I see a way out of this. Pick up the puppet that is drilling into your balls! Idiocy. This was the beginning of Full Moon's death.",
         "After not being terribly impressed by the last two additions to the franchise, I wasn't expecting all that much from \"Curse\" and this was a blessing disguise. I found David DeCoteau's sequel somewhat a step-down in quality (which at times looked very second-rate), but probably a little more enjoyable if a tad creative in its story (despite a silly script, unintentionally humorous plotting and an abrupt ending). While still being one of the weakest, it skipped that childish feel of the recent ventures\u0085 to only deliver on the nasty and gory quota with its nightmarish details (resembling the tone of the original features), but while the jolts and cruelty is there it seemed to meander on its characters interactions and the constant mystery surrounding a disappearance, which is rather predictable to figure out. The puppets have always been the stars and that's nothing new here, as the creations are well-used despite some obvious stock footage from other features. The uncanny appearances and personalities come through, although some are underused; The Jester and especially Leech woman. However there are plenty of images of the puppets cementing how they are best of pals. DeCoteau's practical direction is raw and threadbare, but there's a lyrical guidance that shows in some atmospheric visuals. Most of the performances are particularly lousy and over-enthusiastic, but Emily Harrison seems to be an exception to the trend.",
         "Okay, who the hell is this Doctor Magrew and what ever happened to Rick Myers? Just because Rick wins against the forces of Sutec, doesn't meant he series of movies is over. There is always new evil a foot. Plus did the Puppets turn against him or what? Where did this Doctor Magrew come from? How did he learn that the Puppets could movie on their own? Why did Charles Band stop working on the Puppet Master series, what happened to the promised Puppet Wars? These are questions I want answers to. As for the curse of the Puppet Master, it takes forever to get going, you barely see any of the puppets in the movie, it's mostly about Tank. But still it's not totally a waste a time I give it 7 STARS to the series, but fans of the series will be disappointed. Charles please get your Puppets back!",
         "When FULL MOON went bankrupt in the mid 90's, PUPPET WARS (which was supposed to follow Part 5 of this series, as a spin off franchise), along with a slew of other FULL MOON features went into oblivion. Now we get CURSE OF THE PUPPET MASTER: THE HUMAN EXPERIMENT, despite Band's on screen assurance during the Video Zone featurette on the tape of Part 5, that the story was completely told. Three years later, Band re-started FULL MOON ENTERTAINMENT. The difference here was that he would not have PARAMOUNT's backing & thus would have to fund his own movies. So he decided to do a sequel to the franchise that earned him the most money PUPPET MASTER. Due to a small budget, Full Moon couldn't hire a name actor & had to settle for no name actors, even David Allen wasn't around to do some of his fantastic stop motion animation work with the puppets (he was gravely ill at the time). As a result of all this, FULL MOON had to re-use stock footage of the puppets from the previous five films & the scenes that are not stock footage with the puppets, are poorly done, as we can see that the puppets are merely being held up & moved by crew members. Producer Band then re-listed director David DeCoteau (credited as VICTORIA SLOAN) to take the helm, after his previous effort with the puppets, PUPPET MASTER III: TOULON'S REVENGE was considered by many fans & critics to be the best of the series. One would assume with DeCoteau at the helm that this film too would manage to recapture that films magic, but no luck...DeCoteau's direction is absolutely awful! whatever changes that happened in DeCoteau's career since he helmed Part III, clearly were not for the best. For starters he over lights everything, clutters the film up with fog & a lightning storm every time there's a shot set up at night & at certain points in the film, it feels like he was sitting in a row boat as he was filming, since the camera seems to float in the air. Another problem is with this films glaring continuity errors. Right from the opening shot till last, we have a whole bevy of questions that go unanswered like: How is LEECH WOMAN in this movie? wasn't she burned to death in PUPPET MASTER II? Where did TORCH & DECAPATRON go? whatever became of puppet master Rick Myers, who swore to be with them & guard Toulon's secrets against the forces of evil? The climax is also muddled, early in the film, we see the lead character Robert carve a wooden puppet out over a series of a few days, but when the puppet is revealed, it's a mechanical puppet, NOT made of wood? so where did the wooden puppet go? it seems as though the film-makers were hinting at something here, but the film just ends to abruptly to figure out what, even after repeated viewings. Another problem is the main story, all though the characters are well fleshed out & the story interesting, it leaves out one important factor - the puppets! they barely serve the plot at all, in fact you could take them out of the story & you would still have a movie! the puppets are only here to sell the film & have nothing to do with the plot at all. The film despite it's short comings, is the first one since Part II wherein the puppets are evil & the last entry to make them so & this would also be officially the last entry that tries to be a dark & violent horror movie & although the gore flows freely, the kills only occur in the last fifteen minutes of the movie. On the upside, the story that tends to dominate this sixth instalment is interesting, the idea of transferring one's soul into that of a puppet he or she has put their heart into, has never been touched upon in previous instalments (or any of the ones after) the fact that a nice person working on said puppet, can slowly turn into a cold blooded killer is also a nice addition to the mythology. What's notable is how this entry seems to abandon the elixir that keeps the puppet alive, it's the first & only instalment in the series not to deal with the re- animation serum, it's just never seen or mentioned in the film & the acting is pretty good, despite the miscasting of both George Peck (who despite his fine talents can't seem to get a good handle on the character) & the actor playing Robert, the latter of whom is to big the be playing a bullied kid. All in all, despite it's many short comings outweighing it's positives, I will say I enjoyed PUPPET MASTER 6, maybe not as much as the first five, but at least FULL MOON was trying here & I honestly believe if they would have had a better director & more money to do better puppet effects & if they could have only integrated the puppets more into the story, there's no doubt in my mind, this would have been a better reviewed movie. If you can look past it's extremely low budget, it actually remains a pretty good instalment to the franchise. See PUPPET MASTER: LEGACY for a complete chronological order of the series. Followed by a prequel - RETRO PUPPET MASTER *** stars",
         "Curse is a standalone movie, which is part of the problem. You got this wacked out scientist who got hold of Toulon's puppets, and who obligingly let him know they're alive and willing to help him. Why they're willing to (initially) kill for him isn't clear. George Peck's off-key performance is another problem: he acts like a thirty-year old in bad aging makeup. Maybe he is 60-70 like he is supposed to be, but he looks and acts really odd. And why does he have a 25 year old daughter?!? There are very few people to like here, which also hurts. The romantic leads are vaguely sympathetic, but the scientist, the obnoxious town sheriff, the local town bully, etc., are all very unlikeable, making them slaughter-fodder. The worst problem though, is the end. The movie just...stops. run credits! Whaaatt? Who knows. Catch the sequel, #7, when it comes out, I guess. The uninteresting human characters mean that the puppets have to hold center stage. They're pretty much relegated to the odd gory slaughter or two, though. Even they seem somewhat confused as to what their motives are here. Jester and Leech Woman are relegated to the background as always, Blaze is missing (despite, as noted, his appearance in the opening credits), and the only new puppet we get is the new TV/Tank puppet, which appears for about 30 seconds at the end of the movie. Definitely the weakest entry in the Puppet Master series. Even at the worse of time, the others in the series have had something to contribute. But Curse... just hangs there with nothing to support it or recommend it.",
         "A scientist (George Peck) attempts to master the art of transferring people's souls into puppets. With the film directed by David DeCouteau and edited by J. R. Bookwalter, you may not know what to expect. Bookwalter is pretty great, but does it show through with editing? DeCouteau is very hit and miss, with many more misses than hits. His Full Moon days may be among his best work, and that is not usually a compliment. Despite being a short film, they used a good deal of recycled footage from earlier films in the series (which is something the series as a whole tends to do). If you cut down to only the new footage, the film may be an hour long... maybe.",
         "\"Curse of the Puppet Master: Human Experiment\" is one of the series better entries. **SPOILERS** Returning home from college, Jane Magrew, (Emily Harrison) and her father, Dr. Magrew, (George Peck) run into town for chores and meet gas station worker Tank Winsley, (Josh Green) being picked on. Noticing his carving skills, they take him to visit their house, a museum of magic props and puppets. Shown a special group of puppets that are alive without being attached to strings, he is commissioned to help carve a new puppet for their show, and he does so at the expense of everything else. When he becomes implicated in a series of murders around town, no evidence is gathered up. Realizing that there's a sinister force at work that's causing the murders, they recruit the help of the puppets to put an end to the danger around town. The Good News: There's some good stuff here that really helps the film. The fact that there's a return to the original puppets after introducing either new ones or different designs for the classic names is something to appreciate, and it gives the film a more natural slot with the rest of the series pitted back with it's familiar assortment of puppets. The stronger rating definitely comes into play here, making it much more graphic and violent and really letting loose at times. The blood does flow in it's few kills, as there's a couple of face slashings, a hook used to chop up legs and ankles, a drill to the crotch and a couple flurries of stabbing that really come off nicely. There's also a strong opening bit, as a dark-coat clad figure works feverishly to bury an unknown object in the ground during a raging thunderstorm, and sets it on fire bury burying it. The murders in the museum are fun, and the ending has a really nifty gore scene to go out on. It's all apart of the revenge section at the end, which here is justified, fun and comes off as wholly satisfying considering what had been spent on it before. This one also has a really nice ability to still be fun despite the brevity, and it doesn't seem as short as it is and it remains fun throughout. On the whole, this one wasn't as bad as it easily could've been. The Bad News: There's a few problems with this one that do manage to keep it down. The fact that the relationship with the dolls being in their possession makes no sense, as this one has no scene of the elder passing on the secrets to the next generation. This one doesn't even give any knowledge they know how the dolls came to life to begin with. There's more emphasis on getting the structure right, meaning that it has more significance than the formula which brings them to life, a stark contrast from the others and something that should've been addressed. There's also how easily the newcomer takes to the revelation that they're alive, merely acknowledging it and then dismissing it, getting to the main crux of the story easier but also pointing out the flaw in the pacing. As is usual, the short time means that it plays cruel tricks on the pacing, as the police investigations with the friends, the first dinner time meal and the scene in the postal office go on for too long to beat a simple idea to death, but there's the ending, which just comes out of nowhere and then it's over, when it should've been stretched out a little more. The last flaw is the discussion of the inner will, shoe-horned into the plot for no reason and certainly isn't needed. These here hold the film down. The Final Verdict: A much better entry than expected, this one has some good parts and a few mild flaws to put this one down. If you've come this far into the series, it's not a bad one and is certainly watchable by series standards, but if there's a problem with the series up until here, heed caution with it. Rated R: Graphic Violence and Language",
         "Based totally on the interesting looking cover I saw, I decided to see this movie. I had not seen any of the previous sequels, so I started from scratch. It starts out strange as a man is burning something and tells whatever it is that he was sorry. This man turns out to be Dr. Magrew, an old tinkering man that appears to be a scientist or something. There are these dolls, strange looking ones that move by themselves. One with a knife, a top's head, pinhead, and a cowboy with six arms. I assumed that they were evil, but they only seemed to kill humans that seemingly deserved to die. Two sheriffs and a bully were the victims. The most evil of the beings turns out to be Dr. Magrew who is turning an innocent man named \"Tank\" into some puppet. Jane Magrew is also innocent and for some reason loves the \"Pinhead\" doll. This doll loves her more than the human Tank whom she falls in love with. A very strange ending as Tank's anger gets the best of him with Dr. Magrew receiving his wrath. Poor Jane just survives but with many questions to answer with all the dead bodies laying around her house. If you like strange then this film is for you.",
         "Dr. Magrew (George Peck) strives to give human attributes to expertly crafted wooden puppets. Emily Harrison who plays Jane Magrew is the bright spot of the movie. But the puppets themselves are the real stars. The killer puppets do away with the bad guys. The action scenes are good, but there are too few to get excited about. Even with the finale slamming the door on you; this mild horror movie is still fun to watch. Peck is less animated than the puppets. Also starring are Michael Guerin, Josh Green and Jason Dean Booher.",
         "Dr. Magrew (George Peck) and his daughter Jane (Emily Harrison) run Magrew's Marvels, a sideshow that features the puppets of Andre Tulon (Magrew simply states that he bought Tulon's trunk of puppets at an auction; we're never shown what happened to them post-parts 4 & 5). They hire a guy named Robert (Josh Green) to work the show and carve some new puppets for Magrew. Naturally, the doc has more nefarious plans for his new hire. CURSE OF THE PUPPTER MASTER finds the series back in the hands of David DeCoteau, who previously made the good part III. Without the help of Paramount's funds though, the difference is quite noticeable. This is the first entry to not feature any original stop motion by David Allen. Even worse, 90% of the footage of the puppets is stolen from the previous 5 entries. There is one genuinely creepy scene where Jane discovers the burnt remains of a human-puppet hybrid in the woods and DeCoteau does have two surreal dream sequences where Robert thinks he is made of wood. But it isn't enough to salvage such a cheap production. It literally just ends with the characters never heard from again as the team went old school with RETRO PUPPET MASTER (1999) after this."
      ],
      "genres": [
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": ["Full Moon Entertainment"],
      "summaries": [
         "Robert \"Tank\" begins to work for Dr. Magrew sculpting a puppet for the Doctor to bring to life using the work of Andre Toulon. Robert begins to fall in love with the Doctors daughter, Jane. Unbeknownst to Robert, the Doctor is trying to create a \"perfect race\" of puppet humans. Jane discovers a \"matt puppet\" which is from his first assistant. She comes back just in time to see her father, cut up by the puppets, has succeeded in putting a living human, Robert, into the puppet he carved.",
         "Back for retribution, the living puppets of Andre Toulon are stirred to action, mounting a crusade to foil the diabolical plans of their new insane villainous master. Can they stop the dastardly Dr. Magrew before he transforms another unwitting victim into the newest member of the puppet lineage? Companion action figures sold separately!",
         "The new puppet master, Dr. Magrew and his daughter Jane take a drive and arrive for a gasoline refill and meet the supposibly gental giant, Robert \"Tank\" Winsley and defend him from bully Joey Carp and his gain. And after seeing what special work Tank can do, Magrew hires him as his new assistant since his earlier one dissapeared without a trace. The time they spend together, Tank and Jane start having feelings for each other that cause her father to go off his nut. As he controls the puppets, he will use them to wreak bloody attacks against his enemies.",
         "A scientist attempts to master the art of transferring people's souls into puppets."
      ],
      "budget": 250000
   },
   "movielensId": 3665,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-05-26",
      "dvdReleaseDate": "2000-05-23",
      "directors": ["David DeCoteau"],
      "runtime": 90,
      "movieId": 3665,
      "title": "Curse of the Puppet Master",
      "mpaa": "R",
      "actors": [
         "George Peck",
         "Emily Harrison",
         "Josh Green",
         "Michael Guerin",
         "Michael Sollenberger",
         "Marc Newburger",
         "Scott Boyer",
         "Jason Dean Booher",
         "Robert Donavan",
         "Jason-Shane Scott",
         "William Knight",
         "Patrick Thomas",
         "Ariauna Albright",
         "J.R. Bookwalter",
         "Brandon Ikels"
      ],
      "imdbMovieId": "0132451",
      "originalTitle": "Curse of the Puppet Master",
      "genres": ["Horror"],
      "youtubeTrailerIds": ["Jq8r1Xv7Lyw"],
      "plotSummary": "Robert \"Tank\" begins to work for Dr. Magrew sculpting a puppet for the Doctor to bring to life using the work of Andre Toulon. Robert begins to fall in love with the Doctors daughter, Jane. Unbeknownst to Robert the Doctor is trying to create a \"perfect race\" of puppet humans. Jane discovers a \"matt puppet\" which is from his first assistant. She comes back just in time to see her father, cut up by the puppets, has succeeded in putting a living human, Robert, into the puppet he carved.",
      "tmdbMovieId": 26959,
      "avgRating": 1.86885,
      "releaseYear": "1998",
      "numRatings": 183,
      "posterPath": "/xYUPZ6uz2bXeyQt0fs2kibAldSm.jpg"
   }
}