{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "paris",
            "id": 90
         },
         {
            "name": "puppet",
            "id": 6300
         }
      ],
      "imdb_id": "tt0189047",
      "video": false,
      "title": "Retro Puppet Master",
      "recommendations": [
         26961,
         26959,
         26958,
         26957,
         26962,
         26956,
         27651,
         26954,
         39930,
         46695,
         85567,
         59762,
         84951,
         5751,
         37901,
         40252,
         139659,
         27816,
         98209,
         70553
      ],
      "backdrop_path": "/ltpURho7XaQRqu8Hqvo2nDfDngs.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Andre Toulon",
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04ae93",
               "name": "Greg Sestero",
               "profile_path": "/ySLUoDUVQB1IjgsaX9ktPaz58Rh.jpg",
               "id": 81918,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Ilsa",
               "gender": 0,
               "credit_id": "52fe4524c3a368484e04ae97",
               "name": "Brigitte Dau",
               "profile_path": null,
               "id": 1048496,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "First Servant",
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04ae9b",
               "name": "Stephen Blackehart",
               "profile_path": "/659GdpZSQVMQSRZDWsynvUrvMCl.jpg",
               "id": 85096,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Afzel",
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04ae9f",
               "name": "Jack Donner",
               "profile_path": "/wQXy1mchbrxVtyDihKDRbgpNgXF.jpg",
               "id": 16052,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Older Andre Toulon",
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04aea3",
               "name": "Guy Rolfe",
               "profile_path": "/fEXyb49srKS2XQuD8md0JFw9Ene.jpg",
               "id": 44883,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Second Servant",
               "gender": 0,
               "credit_id": "52fe4524c3a368484e04aea7",
               "name": "Robert Radoveanu",
               "profile_path": null,
               "id": 1048497,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Third Servant",
               "gender": 0,
               "credit_id": "52fe4524c3a368484e04aeab",
               "name": "Vitalie Bantas",
               "profile_path": null,
               "id": 1048498,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Latour",
               "gender": 0,
               "credit_id": "52fe4524c3a368484e04aeaf",
               "name": "Sando Teodor",
               "profile_path": null,
               "id": 1048499,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Valentin",
               "gender": 0,
               "credit_id": "52fe4524c3a368484e04aeb3",
               "name": "George Calin",
               "profile_path": null,
               "id": 31637,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Vigo",
               "gender": 0,
               "credit_id": "52fe4524c3a368484e04aeb7",
               "name": "Juliano Doman",
               "profile_path": null,
               "id": 1048500,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Duval",
               "gender": 0,
               "credit_id": "52fe4524c3a368484e04aebb",
               "name": "Vlad Dulea",
               "profile_path": null,
               "id": 1048501,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Beggar",
               "gender": 0,
               "credit_id": "52fe4524c3a368484e04aebf",
               "name": "Dan Fintescu",
               "profile_path": null,
               "id": 1048502,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Vater",
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04aec3",
               "name": "Serban Celea",
               "profile_path": "/1jK48TpJk6QeF4zxPVg4X6yRUdZ.jpg",
               "id": 62506,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Margarette",
               "gender": 0,
               "credit_id": "52fe4524c3a368484e04aec7",
               "name": "Elvira Deatcu",
               "profile_path": null,
               "id": 111919,
               "order": 13
            },
            {
               "cast_id": 19,
               "character": "Leader",
               "gender": 2,
               "credit_id": "52fe4525c3a368484e04aecb",
               "name": "Claudiu Trandafir",
               "profile_path": "/cY9ewAGhoj76Jc9Cef0eooaOYK0.jpg",
               "id": 31639,
               "order": 14
            },
            {
               "cast_id": 20,
               "character": "First Tough Guy",
               "gender": 0,
               "credit_id": "52fe4525c3a368484e04aecf",
               "name": "Marcel Cobzariu",
               "profile_path": null,
               "id": 1048503,
               "order": 15
            },
            {
               "cast_id": 21,
               "character": "Second Tough Guy",
               "gender": 0,
               "credit_id": "52fe4525c3a368484e04aed3",
               "name": "Viorel Manole",
               "profile_path": null,
               "id": 1048504,
               "order": 16
            },
            {
               "cast_id": 22,
               "character": "First Pursurer",
               "gender": 2,
               "credit_id": "52fe4525c3a368484e04aed7",
               "name": "Mihai Verbintschi",
               "profile_path": null,
               "id": 1048505,
               "order": 17
            },
            {
               "cast_id": 23,
               "character": "Second Persurer",
               "gender": 0,
               "credit_id": "52fe4525c3a368484e04aedb",
               "name": "Adrian Ciobanu",
               "profile_path": null,
               "id": 1048506,
               "order": 18
            },
            {
               "cast_id": 24,
               "character": "Assistant",
               "gender": 0,
               "credit_id": "52fe4525c3a368484e04aedf",
               "name": "Razvan Popa",
               "profile_path": null,
               "id": 60659,
               "order": 19
            },
            {
               "cast_id": 25,
               "character": "Official",
               "gender": 0,
               "credit_id": "52fe4525c3a368484e04aee3",
               "name": "Aurelian Popa",
               "profile_path": null,
               "id": 1048507,
               "order": 20
            },
            {
               "cast_id": 26,
               "character": "Leiter",
               "gender": 0,
               "credit_id": "52fe4525c3a368484e04aee7",
               "name": "Cristian Irimia",
               "profile_path": null,
               "id": 1048508,
               "order": 21
            },
            {
               "cast_id": 27,
               "character": "Ticket Agent",
               "gender": 0,
               "credit_id": "52fe4525c3a368484e04aeeb",
               "name": "Ion Bechet",
               "profile_path": null,
               "id": 1048509,
               "order": 22
            },
            {
               "cast_id": 28,
               "character": "Ticket Agent",
               "gender": 0,
               "credit_id": "52fe4525c3a368484e04aeef",
               "name": "John R. Ellis",
               "profile_path": null,
               "id": 113084,
               "order": 23
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04ae83",
               "name": "David DeCoteau",
               "profile_path": "/nFOFizArK1Vwoo2v4HRKdKXJlrl.jpg",
               "id": 97618,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4524c3a368484e04ae89",
               "name": "Charles Band",
               "profile_path": "/ulNdloEQNPhKrFOloAwW2R3m6DU.jpg",
               "id": 19707,
               "department": "Writing",
               "job": "Original Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe4524c3a368484e04ae8f",
               "name": "Benjamin Carr",
               "profile_path": null,
               "id": 31625,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4525c3a368484e04aef5",
               "name": "David Schmoeller",
               "profile_path": "/qXfp7TR5E0nFpKBpoL41rOOP3MK.jpg",
               "id": 52268,
               "department": "Writing",
               "job": "Characters"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 1.700467,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 26960,
      "vote_count": 17,
      "budget": 0,
      "overview": "Toulon runs a puppet theatre in the heart of Paris and meets the sorcerer (the mysterious Afzel).  When his life is saved by the lovely Swiss Ambassador's daughter Ilsa, we bear witness to the origin of the Puppet Master.",
      "similar": [
         11249,
         11932,
         3989,
         11187,
         11186,
         10895,
         707,
         591,
         95,
         342473,
         250546,
         628,
         927,
         256274,
         10585,
         8195,
         6637,
         1427,
         10112,
         10193
      ],
      "original_title": "Retro Puppet Master",
      "runtime": 80,
      "poster_path": "/kz8FpCrNwoIwwKy1H3H4asLG5jW.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Full Moon Pictures",
         "id": 1369,
         "origin_country": ""
      }],
      "release_date": "1999-11-09",
      "vote_average": 2.7,
      "belongs_to_collection": {
         "backdrop_path": "/crDZjaOpoUCIOoiQ9nLIAt8ZBul.jpg",
         "name": "Puppet Master Collection",
         "id": 107949,
         "poster_path": "/wuLaEcy10wqgiVi4nCjdPXvcCyw.jpg"
      },
      "tagline": "The Legacy Begins ...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["David DeCoteau"],
      "runtime": 80,
      "synopsis": null,
      "writers": [
         "Charles Band",
         "Neal Marshall Stevens"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0189047/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNjU1NzQ3MjcxM15BMl5BanBnXkFtZTcwMzI0NTYzNQ@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Greg Sestero, Brigitta Dau, Stephen Blackehart | See full cast and crew »"],
      "reviews": [
         "I don't understand all these bad reviews. I believe this movie was one of the best in the Puppet Master series. Being made on a low budget, one can comprehend why the special effects and acting were not spectacular, but they were not completely horrible. Greg Sestero brought a lot of charisma to the role of Andre Toulon. He has a lot of potential, and I hope to see more of him soon. And though the cinematography was not excellent, and there was minimal violence and gore, this film was a lot of fun. I am a big Puppet Master fan and have grown to expect blood and gore from the films of this series, but I can say that I was never bored through the entire course of watching Retro Puppet Master. So, if you ever get an opportunity to see this movie, don't automatically regard it as unworthy of your time. Give it a chance. You might like it.",
         "This is where it was said that the Puppet Master series begins, but it has also been the last Puppet Master movie made before \"Puppet Master: The Legacy\", so in a way you can say that it acts as a beginning and an end to Full Moon's brilliant movie series. The puppets all have a new (or since this movie has the word \"retro\" in the title, I suppose it's an old) look to them, but not all of them do. The ones that were left out were Torch, Jester and Leech Woman (thank God). This movie relates mostly to the storyline of Puppet Master #4 and #5. There were some scenes in this movie that I found to carry on and have less action then they deserved, such as random fight scenes. If you're ever planning on watching the Puppet Master movies, watch this one first. This was actually the last Puppet Master film that Guy Rolfe starred in, which really is a shame; he portrayed the role of Andre Toulon better than any of the previous actors. Guy Rolfe passed away in the year 2003, so that means that if any more Puppet Master movies are made (other than \"Puppet Master vs Demonic Toys\"),an other actor will have to play as Toulon. Let's hope that person is as good as Guy Rolfe, although that will be impossible.",
         "I have seen only of one of the other Puppetmaster movies and remember that it was about an older man with his killing puppets. So I had no knowledge of the beginning of the old man but this Retro film gave me a feel for the man named Andre Toulon played by Greg Sestero. It was not a movie filled with overwhelming killing like the other film I saw but gave the characters a heart. Toulon was a young man that cared for the downtrodden. A man that was falling in love with a woman named Ilsa who likewise cared for people in need when she helps to save an old man attacked. This old man was Afzel, a sorcerer that stole the secret of life. Afzel is being hunted by servants of Sutekh because of this secret. These servants kill all of the friends and fellow puppeteers of Andre but they live again in the puppets of their own creations. Now it is a battle to the death between the servants of Sutekh and Andre and friends when Ilsa is taken hostage. The ending leaves you wondering why these friends would become so evil later in chronological time?",
         "Six-shooter, Tunnel Sergeant, Dr. Death, Pinhead, Cyclops, and Blade help the young Andre Toulon take out Sutek's Egyption henchman in the best sequel this series has seen. Retro Puppet Master is atmospheric with many sets, quality acting and some fun puppet FX. What it lacks in gore, it makes up for with an interesting well-paced plot. Best Quote: Dr. Death: \"Don't you know, my friends? Smell the sulfur, see the smoke...\" This is easily the best Dave DeCoteau film I've seen. The actors do a more-than-credible job: Jack Donner as \"Azfel\" turns in an inspired performance, and the young Toulon does well with the puppets. Oh, and the ring-needle is cool. John Massari's score is a nice symphonic take on the original Puppet Master tunes by Richard Band, keeping the movie playful and eerie. It's rare for a Full Moon score to actually add something to a film, and this one does. Unfortunately, Dave Allen didn't seem to be affordable enough for Band and Co. in the late-90's and beyond, so all of the puppet action is done rod and string. There's no stop motion such as the famous and funny scene in the original where Pinhead's looking for his pinhead. And, of course, as with all of the Full Moon fare of this time period, RPM was shot in and around Castel Studios in Bucharest, so most of the bit parts were cast to Romanians: hearing their \"Parisian\" accents was a bit annoying. All in all, this is probably one of the top-10 Full Moon films. It's certainly the most inventive of the Puppet Master sequels.",
         "In 1989, writer Charles Band and director David Schmoeller created \"Puppet Master\", an inventive horror film about a group of puppets magically brought to life by its maker, Andre Toulon, and took to America during World War II. While the original film and its sequel were basically straightforward slashers, the third film made an important big change in the format, moving away from horror to fantasy and setting the movie in the WWII, explaining how Toulon escaped from the War and moved to America. The following three films in the series had the Puppets as heroes and took place in the present, returning the gore and violence to the series by walking the fine line between horror and fantasy. \"Retro Puppet Master\", the seventh chapter of the Puppets' saga, takes the series again further into fantasy, telling the story about the origins of Andre Toulon and the Puppet's first adventure. In turn of the century Paris, young puppeteer Andre Toulon runs a small puppet theater where every night he and his crew make a living. One night after a show, he meets Ilsa, the Swiss Ambassador's daughter who secretly watched his act, however, the circumstances of their meeting are not nice as Ilsa found the body of the mysterious Afzel after he was brutally attacked by a pair of thugs. Andre takes care of the wounded Afzel, who claims to be a 3000 years old sorcerer, but while at first he believes the man is crazy, soon Andre begins to believe, as the dying Afzel tells him the secret that will put Andre in danger for the rest of his life: the ancient gods' secret of giving life to inanimate things. Ever since it was released, \"Retro Puppet Master\" became quite a controversial movie among fans of the series, as the screenplay (by Benjamin Carr) is definitely more a fantasy adventure than a horror film, making it receive many critics due to the lack of gore and suspense. Personally, I think the move really helps to the story, as for the first time in years the focus of the film is not on the Puppets, but on the Puppetmaster himself, so the toning down of the horror is a reasonable change. The story is also about how he met his future wife Ilsa, so romance plays a very important part of the story (another difference with the previous installments). Directed by a long time Full Moon regular, the notorious David DeCoteau, \"Retro Puppet Master\" is surprisingly a change of tone from the typical late 90s Full Moon releases. It's a lot subtler, and even classier than other DeCoteau films, and is probably his best film in a long time. While the cinematography looks like the average TV movie and the special effects are of a terribly bad quality (due to budgetary constrains), the movie looks very good considering its a period piece, and even the score (by John Massari) fits the new tone of the film as a glove. Newcomer Greg Sesstero has a big challenge when playing the younger version of a character that basically was created by the great Guy Rolfe (who has a cameo), however, Sestero makes a terrific job and adds a lot of charm to the role. Brigitta Dau makes a good job as Ilsa, and like Sestero often make sup her lack of experience with her charming personality. Jack Donner does a terrific low-key performance as Afzel, but the efforts of these three actors get ruined by the average performance of basically everyone else in the film. Worth to point out are the terribly bad performances of the three servants (the main villains of the movie), who easily are the worst part of the film. While some of this may not be entirely their fault (as their lines are also the less inspired part of the script), their lack of talent make a bad role atrocious, as it literally kills what could had been a good movie. While I praised Carr's original take on Band's idea, it's safe to point out that his work does not help the film to reach its true potential, as some lines of dialog are simply awful. Many has been written about the simplistic special effects, and while sadly they are not on the level of the previous films (they are of TV Series quality at best), at least there isn't an overuse of them through the movie. \"Retro Puppet Master\" has received a lot of what I think is an undeserved bash through the years, however, it's safe to say that it's one of the best film sin the series. While it certainly could had been a lot better, it really shows that Band was concerned in saving his beloved franchise (he would do a better job in \"Legacy\"), and DeCoteau's direction is remarkably effective (almost reminiscent of his better earlier work). While many fans don't like the change to fantasy, I think it was what this particular chapter needed. Watch it with an open mind and low expectations, and you'll be rewarded. 6/10",
         "This is the kind of movie that you rent when you are incredibly tired, or impaired in some other way... The acting in this movie is so bad it seems intentional, and to let you know how bad the special effects are, there is one scene when the puppets are coming alive where you can see most of a hand holding the puppet, moving it about. The movie looked as if it was filmed with a camcorder. When I saw this movie for the first time, a fistfight nearly erupted when my friends and I were calling each other names from this flick, that's how terrible it was. If you enjoy getting mad at movies, I recommend this to you, otherwise, flee as though your very life depended on it.",
         "It is great to see a new batch of puppets creating havoc in this series. I found this chapter a lot of fun. In fact, it would probably be my second favorite in the series. This movie has very little violence and is only rated PG-13. This is notably different from the other R-rated puppet master movies which were loaded with gore and violent mayhem. The lack of violence does not diminish the fun though. This film also has notably better special effects than the last movie in this series. Good.",
         "First off, I Hate Sci Fi Stuff, And Although This Movie got a little Sci Fi at times, That's Allright, Because At Least It Focused On Andre Toulon. In the last 3, Andre seemed to have kind of been Mentioned, but the Stories Never really focused on him, which made me mad. What also makes me mad is The Amount of 0's it Got on the Voting Chart. Give It a Rest People. If you saw this Movie and Liked it, Please vote for it. Please. What I Loved About this Movie is that It went back to Where it all started. When Andre first learned the Secret to Life. I would Recommend Renting this if you Have seen a Puppet Master Movie before and liked it. But not renting it if this is your First Time viewing one from the PM Collection, Mainly Because you might think all the Puppet Masters are as \"Dull\" as this one.",
         "David DeCoteau directed 'Curse of the Puppet Master' (the sixth Puppet Master movie) as Victoria Sloan and here directs the seventh as Joseph Tennent. Not sure why a director of some of the most ridiculous movies ever made would replace their name on their more credible work but there we go. This seventh instalment is well made and excellently acted with the last actual performance of Guy Rolfe, not just as Andre Toulon, but ever. Rolfe is without doubt one of the world's greatest actors and as Andre Toulon the most fantastical performer of Full Moon Productions' entire catalogue. This film travels back to early 20th century Paris to find the origins of the Puppets, there are a few extra puppets here that - as yet unexplained - do not appear in other films. Our favourites here, such as Pinhead; Torch and Tunneler are more traditional wooden puppets, not yet fully developed and very low on personality and colour - their oak finish makes them seem far more sinister though. For the first time Richard Band's amazing Puppet theme does not appear and is ultimately the only major error of judgement in a fun and fantastically produced addition to the series. Watch the dead homeless man on the steps though (who first gives his 'life' to the puppets) - though dead and looking almost like a puppet himself he can't help blinking in full camera shot. The film is old fashioned and almost Sunday afternoon family fun (like an old detective drama or something). Surprising.",
         "Retro puppet master This tale precedes the events of Puppet Master III, and explores the origins of the puppets themselves. Sadly, as grand a concept as this has- a story starting in Egypt in the late 1800's where the secrets of a God's power are stolen and then moving to a young Toulon running a puppet show in Paris in the early 1900s, the whole affair is a little too drawn out to fulfil it's potential. It's a shame because director Decoteau has previously directed two of the stronger Puppet Master entries- part 3 (perhaps my favourite) and 6- a fun return to form after a couple of really bad sequels. This is not to say it's a film without merit- any fan of the Puppet Master series will enjoy finding out about how it all began, the cronies of the god are fairly sinister in an Agent Smith/ Matrix kind of way, and there are a couple of new puppets to keep you entertained. The film could be described as ambitious too, considering budgetary constraints. Creating a period piece obviously creates complications in filming, so this, as with Puppet Master III, is admirable- the simplest route was not selected. On the downside, the puppets themselves move especially badly in this entry- it's a far cry from the beautiful stop-motion animation of earlier films- we really are talking about movement like a 4 year old's Barbie. Also considering these are meant to be early versions of the puppets we know and love, some of these wooden versions really miss the mark. Blade especially. When looking at the cover I actually assumed Dr Death's skeletal appearance was an early, and quite impressive, early version of Blade, when in fact he's this bizarre troll-faced puppet, with only the hair and costume in common. Quite sad really, as the puppets are after all the stars. And the male lead, Greg Sestero as a young Andre Toulon, is perhaps more wooden than the puppets. Still, it's worth renting perhaps rather than buying, (I'm not sure how much replay value it has) for those who have to know how it all began. Just don't expect anything super special."
      ],
      "genres": [
         "Adventure",
         "Romance",
         "Fantasy",
         "Horror"
      ],
      "productionCompanies": ["Kushner-Locke Company, The"],
      "summaries": ["It's 1892 and Sutekh is hopping mad. It seems a 3,000 year old Egyptian sorcerer has stolen one of the God's secrets of life - that of instilling the souls of the dying into inanimate things. Sutekh raises three mummified former high priests, led by the villainous \"First Servant\", and charges them with recovering both the Sorceror and his secret. There is no lack of victims for the 3 high-faluting, stylish villains as they pursue their prey to 19th century Paris, and the very young puppeteer, Andre Toulon. Toulon runs a puppet theatre in the heart of Paris, and meets the sorcerer (the mysterious Afzel) when he is found by the lovely Swiss Ambassador's daughter Ilsa, after being nearly killed. It is there and then that we find the seed of things to come, and the origin of the Puppetmaster series of tales."],
      "budget": 0
   },
   "movielensId": 3666,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-11-09",
      "dvdReleaseDate": "2000-05-23",
      "directors": ["David DeCoteau"],
      "runtime": 80,
      "movieId": 3666,
      "title": "Retro Puppet Master",
      "mpaa": "PG-13",
      "actors": [
         "Greg Sestero",
         "Brigitte Dau",
         "Stephen Blackehart",
         "Jack Donner",
         "Guy Rolfe",
         "Robert Radoveanu",
         "Vitalie Bantas",
         "Sando Teodor",
         "George Calin",
         "Juliano Doman",
         "Vlad Dulea",
         "Dan Fintescu",
         "Serban Celea",
         "Elvira Deatcu",
         "Claudiu Trandafir",
         "Marcel Cobzariu",
         "Viorel Manole",
         "Mihai Verbintschi",
         "Adrian Ciobanu",
         "Razvan Popa",
         "Aurelian Popa",
         "Cristian Irimia",
         "Ion Bechet",
         "John R. Ellis"
      ],
      "imdbMovieId": "0189047",
      "originalTitle": "Retro Puppet Master",
      "genres": ["Horror"],
      "youtubeTrailerIds": ["JfEZzUzum5c"],
      "plotSummary": "Toulon runs a puppet theatre in the heart of Paris and meets the sorcerer (the mysterious Afzel).  When his life is saved by the lovely Swiss Ambassador's daughter Ilsa, we bear witness to the origin of the Puppet Master.",
      "tmdbMovieId": 26960,
      "avgRating": 1.93694,
      "releaseYear": "1999",
      "numRatings": 111,
      "posterPath": "/kz8FpCrNwoIwwKy1H3H4asLG5jW.jpg"
   }
}