{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "prostitute",
            "id": 549
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "street shootout",
            "id": 188907
         }
      ],
      "imdb_id": "tt0095977",
      "video": false,
      "title": "Rent-a-Cop",
      "recommendations": [
         86367,
         84735,
         72096,
         109962,
         35810,
         31942,
         17978,
         123770,
         88067,
         24254,
         16219,
         57190,
         26798,
         45096,
         18167,
         41938,
         28932,
         26581,
         11221,
         80546
      ],
      "backdrop_path": "/xrxuPxpjvmiOXGrtA0lo0AIivdG.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Tony Church",
               "gender": 2,
               "credit_id": "52fe47b49251416c9107300d",
               "name": "Burt Reynolds",
               "profile_path": "/g5AyPAhdr5OtHVRGLD3i8Gw4oas.jpg",
               "id": 16475,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Della Roberts",
               "gender": 1,
               "credit_id": "52fe47b49251416c91073011",
               "name": "Liza Minnelli",
               "profile_path": "/1G5DNqKJ4ufFryQTGmmTqCqYsY4.jpg",
               "id": 66776,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Dancer",
               "gender": 2,
               "credit_id": "52fe47b49251416c91073015",
               "name": "James Remar",
               "profile_path": "/AeSuQlBclvWqztlpkf9nIhvvhsc.jpg",
               "id": 1736,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Roger",
               "gender": 2,
               "credit_id": "54bc55519251416eae00265d",
               "name": "Richard Masur",
               "profile_path": "/w8qQdmxLRRSXNXkjHKHlY5vawXG.jpg",
               "id": 15416,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Beth",
               "gender": 1,
               "credit_id": "54bc55989251416e6000282f",
               "name": "Dionne Warwick",
               "profile_path": "/aubfx1cK4hlkLWzBDTykRqLQXyI.jpg",
               "id": 160573,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Lemar",
               "gender": 2,
               "credit_id": "54bc55c992514148f0006aea",
               "name": "Bernie Casey",
               "profile_path": "/rvL40yyewKgTDVm7doR1ym09sUj.jpg",
               "id": 10939,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Pitts",
               "gender": 2,
               "credit_id": "54bc55dcc3a368389c002ab1",
               "name": "Robby Benson",
               "profile_path": "/wUqGufwQwXn3Y6rFdtZ80HqLDPm.jpg",
               "id": 15048,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Wieser",
               "gender": 2,
               "credit_id": "54bc560ec3a368145e00706d",
               "name": "John P. Ryan",
               "profile_path": "/lMdObPGv8eNscCpC0ICYSc01t75.jpg",
               "id": 15213,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Alexander",
               "gender": 2,
               "credit_id": "5984314c925141075900a60b",
               "name": "John Stanton",
               "profile_path": "/fnJPaky55FPJ8YCjtw9ATqHevVG.jpg",
               "id": 107028,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47b49251416c91073009",
               "name": "Jerry London",
               "profile_path": null,
               "id": 80609,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "54bc56339251416e9b002959",
               "name": "Michael Blodgett",
               "profile_path": "/qeXXGXFl3VFCWQlEr8gH5mw4quI.jpg",
               "id": 45114,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "54bc5653c3a3686c61008f42",
               "name": "Dennis Shryack",
               "profile_path": "/e169Giwe3PK5K0cXOORm6J4U32A.jpg",
               "id": 53006,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "59ce5791c3a3686a63017ab3",
               "name": "Jerry Goldsmith",
               "profile_path": "/e6sd10VuwFXkgRFrCTCygbhMq2q.jpg",
               "id": 1760,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "59ce579ac3a3686aca016fd4",
               "name": "Raymond Wagner",
               "profile_path": null,
               "id": 53007,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "59ce57a39251416c59016da0",
               "name": "John D. Schofield",
               "profile_path": null,
               "id": 12756,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "59ce57acc3a3686aca016fe5",
               "name": "Giuseppe Rotunno",
               "profile_path": null,
               "id": 15131,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "59ce57bb9251416c82017e5b",
               "name": "Robert Lawrence",
               "profile_path": null,
               "id": 14491,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "59ce57c7c3a3686aa9017d42",
               "name": "Francesco Cinieri",
               "profile_path": null,
               "id": 1481690,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "59ce57cf9251416c20018932",
               "name": "Judith Holstra",
               "profile_path": null,
               "id": 1730,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "59ce57d5c3a3686aca017036",
               "name": "Marcia Ross",
               "profile_path": null,
               "id": 51557,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "59ce57dfc3a3686a92015aa7",
               "name": "Anthony Masters",
               "profile_path": "/32OGKBShuM420L7FxP1XfXfjqBz.jpg",
               "id": 12510,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "59ce57eb9251416c2001895d",
               "name": "Aurelio Crugnola",
               "profile_path": null,
               "id": 5492,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "59ce57f29251416c86016c5a",
               "name": "Franco Fumagalli",
               "profile_path": null,
               "id": 32350,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "59ce57f9c3a3686aa9017dab",
               "name": "Moss Mabry",
               "profile_path": null,
               "id": 14727,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Action",
            "id": 28
         }
      ],
      "popularity": 1.047378,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 80287,
      "vote_count": 13,
      "budget": 0,
      "overview": "When call-girl Della gets caught in the middle of a drug bust at a hotel where she was meeting a trick, she is held hostage by a robber that busted in on the drug agents and the drug dealers. She gets rescued by vice cop Church who is accused of staging the aborted bust. Ex-ballplayer turned drug dealer Roger is in tight with corrupt vice cops and their superiors And the fireworks start popping.",
      "similar": [
         507,
         979,
         4771,
         281,
         339692,
         39927,
         2142,
         26196,
         429733,
         3134,
         8012,
         298312,
         261023,
         17494,
         8810,
         6075,
         1427,
         769,
         4141,
         562
      ],
      "original_title": "Rent-a-Cop",
      "runtime": 96,
      "poster_path": "/vCRkBrTPZzBJubcUnkxUsbhL7Ro.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Zealcorp Productions Limited",
            "id": 95585,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Kings Road Entertainment",
            "id": 4255,
            "origin_country": ""
         }
      ],
      "release_date": "1987-11-28",
      "vote_average": 4.7,
      "belongs_to_collection": null,
      "tagline": "Deadlier than Dirty Harry, faster than Cobra",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jerry London"],
      "runtime": 96,
      "synopsis": null,
      "writers": [
         "Michael Blodgett",
         "Dennis Shryack"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0095977/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE4ODkxOTY4NV5BMl5BanBnXkFtZTcwMjk2MTQyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Burt Reynolds, Liza Minnelli, James Remar | See full cast and crew »"],
      "reviews": [
         "Chicago cop Burt Reynolds is suspended after a sting operation goes terribly wrong; he turns in his badge but finds work playing bodyguard to hooker Liza Minnelli, who was a witness to the massacre that got Reynolds in hot water. Burt seems to be suffering from Chronic Fatigue--he's barely present--however vivacious Liza (too old really to be playing prostitutes) does manage to greatly elevate this crime-drama, although the solid technical aspects, fine supporting cast and gritty locales are also quite good. While combining corny comedic asides, a very odd villain, and jarring bursts of violence, \"Rent-a-Cop\" is pretty much a mess, and professional critics snubbed it, yet it is entertaining enough and the two stars share some great chemistry (even with Burt so sleepy). **1/2 from ****",
         "Didja know that, contrary to popular belief (and the Razzies), Liza-with-a-Z actually received rave reviews from Variety and the NEW YORK TIMES (!) for her performance in this otherwise utterly ordinary cop thriller. She's actually very funny in it, and Reynolds has his moments as well. There is an absolutely hysterical scene near the beginning with Burt as a security guard disguised as Santa in a department store, bantering with his new boss, an overly officious matron yammering about his failure to scrutinize his \"policy manual.\"",
         "In 1981, Burt Reynolds did a movie called SHARKEY'S MACHINE. He played a cop who is demoted to the vice squad after a shootout with a drug dealer results in several deaths. In RENT-A-COP, he plays a cop who is reduced to working as a security guard when a masked killer botches a drug bust and kills his fellow police officers. In the former movie, Burt watches a hooker, played by Rachel Ward, whom he hopes will help him nab a crimelord. In the latter movie, a hooker, played by Liza Minnelli, joins forces with Burt to track down the killer. Both of these movies co-starred Bernie Casey. The plots of both movies seem familiar, and Liza is not really believable as a hooker, but RENT-A-COP is just one of those Eighties movies that is far more fun to watch on TV rather than the big screen.",
         "A low-rent, cheaply made police thriller that's kept bearable by some fair humorous bits, the nice chemistry between the two leads and, especially, by James Remar's satisfying turn as a narcissistic, psychopathic (and, naturally, indestructible) villain. Obviously a low-quality picture, both visually and dramatically, with a rather resigned Burt, but not unwatchable. (**)",
         "I love the music score, the relaxed jokes and the expected turns in the story. I have no idea how it did in 1987, but it is among my favorite cop comedies from the period. A little rip of off Beverly Hills Cop but I'm able to forgive them. It is among those I go back to watch again when I have forgotten it. The worst thing about it is the villains. None of them go down in history. No special features to mention on the DVD I got, which is crappy. However, I believe they could have created a lasting DVD audience if they had invested a little in the extra quality features. You can probably drop buying it if you're not likely to enjoy the genre, Minelli or Reynolds. If you can rent/borrow it cheap and are able to enjoy simple action/comedy from the eighties then pop the corn, relax and enjoy.",
         "Why did some one hire Liza Minnelli? Did they not think she she would show up? Was it a prank phone call that backfired horribly? These are the key questions that lie at the heart of Rent-A-Cop. Surely Ms. Minnelli wasn't hired for her looks or talent, so why did she end up on film? Her acting reminds one of the dangers of coke addiction. Hey and can you believe it, Burt Reynolds shows up in this movie too, I think he might even play the lead role as Detective Bandit, the Trans Am is in the shop. A human is given a writing credit for this movie which must be a typo, also Bobby Benson appears as the voice of the Beast for Disney's Beauty And The Beast, although he has to dress like a human in Rent-A-Cop, I guess Disney wouldn't let Benson wear the costume, something about copyright law.",
         "Here's a film I reckon, was judged quite unfairly, if harshly. Although it's no hit, it's still a lot of fun, with danger at many a turn, and a worthwhile view. What makes the film work is the bonding and excellent casting of Minelli and Reynolds. Starting out very much like Code Of Silence, one of the producers attached to that, worked on this one. We have a drug buy, gone to s..t and a very p..sed off Captain who pushes Burt's buttons, not a good thing to do. A psychotic (Remar) highjacks the shipment, Minelli a hooker with heart, witness to Remar's features. She was with a sicko client in the next room, of this ritzy hotel when this mayhem went down, resulting in a score of Burt's men being taken down. Now Burt's demoted, working as a rent a cop, his new job has him undercover in Santa Claus guise. With a few attempts made on Minelli's life, running scared, she implores Burt's services, which at first, he's so very much reluctant, zero tolerance I'm talking, as she is a stroke of bad luck for him as far as his career prospects go. With the story that moves unhurriedly along, the building of the relationship, between our leads, I really liked. Minelli provides a lot of laughs, where things even turn romantic, something that had to happen I guess. Minelli's larger than life character sold the film, where Burt is just Burt here. He's done far better work. There are moments you think, he really doesn't care. Australia's own John Stanton (Bellamy) makes an appearance, as a bad guy, and it was good to see him in this, his second overseas flick, after that so called dud Taipan. It's good to see Bernie Casey re team with Burt after Sharky's Machine. On the surface, Rent a Cop appears pretty weak and washy, and this is cause of Burt and Liza's antics, stuffing about, straying away the business of the story, but it has a good moments of action, well executed in a not a half bad flick. You get laughs, like you don't expect, and it's quite the adventure with our two, where we owe most of our thanks to the wonderful Liza. For Burt fans especially, and others who don't enjoy a not so bad action flick. Love the instrumental theme song.",
         "Detective Frank Church resigns from his job when a drug bust goes wrong with the blame being put on him, as he survived along with prostitute Della Roberts who happened to be at the wrong place at the wrong time. Della saw the face of killer and now finds herself a target. So she seeks help from the out-of-work Church. Burt Reynolds seems to have his fair share of nothing features and the late 80s crime-thriller \"Rent-a-Cop\" is hard not to categorise in that bracket, but still it can be amusing and at the same time overbearing. Thanks to the appearance of Liza Minnelli as a flamboyantly overactive hooker who just won't quit talking. She overpowers many scenes. Not helping the case is that the off-balance script is asinine. I just wished it kept on the straight and narrow, than throwing in some light-hearted touches and trite comedy elements. It can be violent pulp and the main killer (a terrifically threatening James Remar) is rather a cold-hearted maniac who has a noticeable costume get-up and deadly arsenal, although he does like to dance (swaying back-and-forth in front of a mirror) and a good dancer he is too. With a nickname Dancer, he must be. Burt Reynolds is pretty much on cruise-control and the chemistry with Minnelli just doesn't seem to click. Someone has already mentioned it, but its true that I couldn't get Reynolds 1981 cop-thriller \"Sharky's Machine\" out of my mind when watching this. Both films have similar plot threads and are staged in the windy city Chicago, but \"Rent-a-Cop\" felt like a self-parody of it. Also making appearances are Richard Masur, Bernie Casey and a stern John P. Ryan. Director Jerry London (who mainly does TV) surprisingly gives the film a certain crisp slickness, creating moments of suspense (like the glorified cat and mouse shootout climax that ends with someone losing their head) and uses the wintry urban Chicago backdrop to good affect. Jerry Goldsmith contributes the music score. Routine, clingy star vehicle. \"Read my lips. Don't screw around.\"",
         "Hard enough to believe that Liza would do this Drivel. And man does she bomb,Whos idea was it to portray her as a high priced call girl at 42 y/o? .Liza has done some wonderful movies but she is neither sexy nor pretty/She looks like a tired old whore who needs to be in detox half the time. Burt Reynolds doesnt do much better as a washed up cop who Liza hires to protect her.Some of the dialogue and plot scenes are so ridiculously bad its unintentionally funny. Like Liza getting ready to do it with a guy dressed like the big bad woof.Burt stealing a ladys car right in front of her and she is standing there saying are you a crazy person ,help hes stealing my car and then she says give me back my purse after hes already pulled away.she should have been shot.James Remar is a dud as a bad guy but at least in the scene where he is taking Liza to the bad guys house he tells her to shut up when he asks her what plays shes been in since he was a dancer and she says flower drum song.His response ,flower drum song? Would you shut up bi**h. He finds out shes been wired and says You bi*** your wired, and that sums up this movie.. Stinks Bomb",
         "I was sick one day and was skimming channels and I came upon this terribly rank movie. The plot and even the subplots (if you can find one) have been done to extinction. BUT, as bad as the story was, I reserve a special comment for Liza Minelli. Her character was absolutely one of the most annoying characters I have ever has the misfortune of seeing on film. Her only two competitors in this category are John Leguziamo in \"The Pest\" and Julia Stiles in anything she's done (or half-done). Maybe she performed exactly as the script suggested or maybe (groan!) that is the limit she has to her acting range. Either way, they should have had a rewrite and killed her off in the first 30 seconds of the film (eg. Like the girl that fell off the balcony in Lethal Weapon (I) (but at least she had nice breasts)) Most Humbly Submitted...Douglas Neidermeyer"
      ],
      "genres": [
         "Action",
         "Comedy",
         "Crime",
         "Thriller"
      ],
      "productionCompanies": [
         "Kings Road Entertainment",
         "Zealcorp Productions Limited"
      ],
      "summaries": [
         "When call-girl Della gets caught in the middle of a drug bust at a hotel where she was meeting a trick, she is held hostage by a robber that busted in on the drug agents and the drug dealers. She gets rescued by vice cop Church who is accused of staging the aborted bust. Ex-ballplayer turned drug dealer Roger is in tight with corrupt vice cops and their superiors And the fireworks start popping.",
         "Detective Tony Church is forced to retire and become a store rent-a-cop when his drug sting operation comes to a tragic end by a masked killer. He joins forces with a prostitute, the only one able to identify the killer, to bring him to justice."
      ],
      "budget": 0
   },
   "movielensId": 3667,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1987-11-28",
      "dvdReleaseDate": "2000-05-23",
      "directors": ["Jerry London"],
      "runtime": 96,
      "movieId": 3667,
      "title": "Rent-a-Cop",
      "mpaa": "",
      "actors": [
         "Burt Reynolds",
         "Liza Minnelli",
         "James Remar",
         "Richard Masur",
         "Dionne Warwick",
         "Bernie Casey",
         "Robby Benson",
         "John P. Ryan",
         "John Stanton"
      ],
      "imdbMovieId": "0095977",
      "originalTitle": "Rent-a-Cop",
      "genres": [
         "Comedy",
         "Crime",
         "Action"
      ],
      "youtubeTrailerIds": ["WB0S0CtDu-E"],
      "plotSummary": "When call-girl Della gets caught in the middle of a drug bust at a hotel where she was meeting a trick, she is held hostage by a robber that busted in on the drug agents and the drug dealers. She gets rescued by vice cop Church who is accused of staging the aborted bust. Ex-ballplayer turned drug dealer Roger is in tight with corrupt vice cops and their superiors And the fireworks start popping.",
      "tmdbMovieId": 80287,
      "avgRating": 1.92708,
      "releaseYear": "1987",
      "numRatings": 144,
      "posterPath": "/vCRkBrTPZzBJubcUnkxUsbhL7Ro.jpg"
   }
}