{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "spoof",
            "id": 11931
         },
         {
            "name": "televison",
            "id": 194170
         },
         {
            "name": "satellite dish",
            "id": 226241
         }
      ],
      "imdb_id": "tt0105466",
      "video": false,
      "title": "Stay Tuned",
      "recommendations": [
         23303,
         26603,
         28762,
         21362,
         150889,
         91101,
         89634,
         15278,
         79509,
         39411,
         13903,
         56120,
         28498,
         18034,
         71112,
         69828,
         178687,
         183661,
         11607,
         100416
      ],
      "backdrop_path": "/vEL86RCVx0h0H1c1XKLIZwvsQqn.jpg",
      "revenue": 10736401,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Roy Knable",
               "gender": 2,
               "credit_id": "52fe4479c3a368484e0251bf",
               "name": "John Ritter",
               "profile_path": "/2WIkWe5UASXpZgLQ1pMTtHNJKJX.jpg",
               "id": 27772,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Helen Knable",
               "gender": 1,
               "credit_id": "52fe4479c3a368484e0251c3",
               "name": "Pam Dawber",
               "profile_path": "/VJMohGYpYa7ovRZmumqICkyfPr.jpg",
               "id": 90654,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Darryl Knable / Narrator",
               "gender": 2,
               "credit_id": "52fe4479c3a368484e0251c7",
               "name": "David Tom",
               "profile_path": "/ZdUUjXp4BPJNRXNxcWK9o216yW.jpg",
               "id": 65059,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Diane Knable",
               "gender": 1,
               "credit_id": "52fe4479c3a368484e0251cb",
               "name": "Heather McComb",
               "profile_path": "/zthsKWkqe6qBMvKlEww6sVhG4Eu.jpg",
               "id": 22248,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Spike",
               "gender": 2,
               "credit_id": "52fe4479c3a368484e0251db",
               "name": "Jeffrey Jones",
               "profile_path": "/96J47E34mbjqnhiW9dbLuBqyqmD.jpg",
               "id": 4004,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Crowley",
               "gender": 2,
               "credit_id": "55a29291c3a3681cde003620",
               "name": "Eugene Levy",
               "profile_path": "/69IBiDjU1gSqtrcGOA7PA7aEYsc.jpg",
               "id": 26510,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Wetzel",
               "gender": 2,
               "credit_id": "55a292a19251412974003912",
               "name": "Don Calfa",
               "profile_path": "/4jnB2f6ADtC7pIuvGCzuZUzQhAn.jpg",
               "id": 41262,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Pierce",
               "gender": 2,
               "credit_id": "55a292e29251412971003816",
               "name": "Erik King",
               "profile_path": "/svrv513FlrnRshuA5YSaCLIcix9.jpg",
               "id": 154759,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Ducker",
               "gender": 1,
               "credit_id": "55a29305c3a3681cde003628",
               "name": "Susan Blommaert",
               "profile_path": "/pAzu79y0zHGaPfZNsT6t2ywTfzs.jpg",
               "id": 1913,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Murray Seidenbaum",
               "gender": 2,
               "credit_id": "55a2931ec3a3681cfa003436",
               "name": "Bob Dishy",
               "profile_path": "/bZrKpqwqrbfWVeIFBn00HaMxlIb.jpg",
               "id": 19889,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Sarah Seidenbaum",
               "gender": 1,
               "credit_id": "57238d26c3a36809db000e22",
               "name": "Joyce Gordon",
               "profile_path": "/3s2peH67CLItQ8waINYEeEhZ4B.jpg",
               "id": 127037,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4479c3a368484e0251d1",
               "name": "Tom S. Parker",
               "profile_path": null,
               "id": 13582,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4479c3a368484e0251d7",
               "name": "Peter Hyams",
               "profile_path": "/dAuDsStGGlUESaaAYQf0GCE2JWo.jpg",
               "id": 37710,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5543df04925141586d0026d1",
               "name": "Maria Gonzalez",
               "profile_path": null,
               "id": 1447573,
               "department": "Visual Effects",
               "job": "Color Designer"
            },
            {
               "gender": 2,
               "credit_id": "5652292cc3a368070f00b809",
               "name": "J.J. Makaro",
               "profile_path": null,
               "id": 1007395,
               "department": "Crew",
               "job": "Stunts"
            },
            {
               "gender": 1,
               "credit_id": "56bd37bcc3a36817f40017cf",
               "name": "Helen Jarvis",
               "profile_path": null,
               "id": 22061,
               "department": "Art",
               "job": "Set Decoration Buyer"
            },
            {
               "gender": 2,
               "credit_id": "58f7ea79c3a36875bf0000ba",
               "name": "Bruce Broughton",
               "profile_path": null,
               "id": 20897,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "58f7ea81c3a368759f0000cd",
               "name": "Peter Hyams",
               "profile_path": "/dAuDsStGGlUESaaAYQf0GCE2JWo.jpg",
               "id": 37710,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "58f7ea929251415c070000cf",
               "name": "Peter E. Berger",
               "profile_path": null,
               "id": 2033,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "58f7ea99c3a368758f000100",
               "name": "Lynn Stalmaster",
               "profile_path": "/rhyzo2qgsGAXIpGTN5OabbZU95U.jpg",
               "id": 1263,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "58f7eaa79251415c270000e4",
               "name": "Philip Harrison",
               "profile_path": null,
               "id": 10936,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "58f7eaad9251415bf90000ee",
               "name": "Richard Hudolin",
               "profile_path": null,
               "id": 18885,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "58f7eab4c3a368761b0000e5",
               "name": "David Willson",
               "profile_path": null,
               "id": 1237456,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 5.188264,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 23939,
      "vote_count": 59,
      "budget": 25000000,
      "overview": "Salesman Roy Knable spends all his free time watching television, to the exasperation of his wife, Helen. One day, TV salesman Spike convinces Roy to buy a satellite dish offering 666 channels. The new addition to Roy's home entertainment system sucks him and Helen into Hellvision, a realm run by Spike, who is an emissary of Satan. For 24 hours, the couple must survive devilish parodies of TV programs if they want to return to reality alive.",
      "similar": [
         40264,
         4258,
         11072,
         8005,
         9593,
         813,
         4247,
         808,
         4638,
         64688,
         9255,
         19908,
         109414,
         3034,
         4232,
         351819,
         9486,
         9595,
         9267,
         308369
      ],
      "original_title": "Stay Tuned",
      "runtime": 87,
      "poster_path": "/7k9r0Qq5OmCDissX1pDE5AWVScQ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Morgan Creek Productions",
            "id": 10210,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1992-08-14",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "Something weird's on the air.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Peter Hyams"],
      "runtime": 88,
      "synopsis": "Roy Knable (John Ritter), a couch potato, is a struggling Seattle plumbing salesman and former fencing athlete who spends most of his spare time watching hours of television. Roy's neglected wife Helen (Pam Dawber), a senior vitamin product manager, resents the fact that they never do anything special or romantic together anymore. After a fight (which involved Helen smashing the family television screen with one of Roy's fencing trophies as a wake-up call to reality), a shady man named Mr. Spike (Jeffrey Jones) appears at the couples' door, offering him a new high tech satellite dish system filled with 666 channels of programs one cannot view on the four big networks (CBS, NBC, ABC, and Fox). What Roy doesn't know is that Spike (later referred to as \"Mephistopheles of the Cathode Ray\") is an emissary from hell who wants to boost the influx of souls by arranging for TV junkies to be killed in the most gruesome and ironic situations imaginable. The 'candidates' are sucked into a hellish television world, called Hell Vision, and put through a gauntlet where they must survive a number of satirical versions of sitcoms and movies. If they can survive for 24 hours they are free to go but if they get killed then their souls will become the property of Satan (the latter usually happens). The dish eventually sucks Roy and Helen into this warped world. Roy and Helen first appear on a bizzare game show called 'You Can't Win' where they are forced by the game show host to answer personal questions about their failing marriage or be \"eliminated\". They succeed and as their prize are pushed through a porthole into another world called 'Underworld Wrestling Foundation' and are forced to wrestle a stout couple called The Gorgons. When Roy is bested, Helen defeats Mr. and Mrs. Gorgon by bashing them with a microphone stand and for their reward, are pushed into another porthole to another channel. Watching the Knables from the confines of HTV's control room is Spike, who is soon joined by Crowley (Eugene Levy), a nerdish employee who brings along Pierce (Erik King), a younger upstart employee to the TV center. Crowley explains the events happening to Pierce. They watch another couple, the Seidenbaums, on another channel where the shrewdish wife is crushed to death by a Godzilla monster while her henpecked husband escapes. After Crowley makes a sly comment to Spike about a previous individual who survived the 24 hours in HTV's dimension. Spike bannishes Crowley to the Hell TV world by zapping him with a special remote control device he always keeps on him. Back in the real world, Roy and Helen's 11-year-old son Darryl (David Tom), and his older sister Diane (Heather McComb) arrive home from school and are puzzled to their parents absence. They find the large HTV set in the living room as well as the large sattelite dish in their back yard. While Diane invites some of her school friends over, Darryl watches the new TV set and is behildered by the various HTV programming which includes hellish spoof shows like \"Cruel Practical Jokes\", \"Three Men and Rosemary's Baby\", \"thirtysomething-to-life\", etc. When Darryl goes into the backyard, the motion sensitive dish activates and tries to suck him into the Hell TV world, but zapps his bicycle instead. When Darryl sees his bicycle on the TV later in a show called \"Meet the Mansons\" he tries to convince Diane that something sinister is going on, but she dimisses his theories. Meanwhile, Roy and Helen are trapped in a sub-freezing snowy forrest area on the HTV show \"Northern Overexposure\" where they venture to a frozen lake and meet Crowley who is digging holes in the ice to find a conduit to the next channel. Just when Crowley finds a dimentional opening, they are attacked by savage wolves and forced to take shelter in a nearby shack where Crowley explains to them about their situation and that they have 15 hours left to survive HTV's world. In attempting to escape from the shack, Crowley is overwhelmed by the wolves and the shack is set on fire from a dropped oil lamp. Roy and Helen are forced to leave Crowley behind and jump through the dimentional porthole and find themselves as animated mouse characters in a cartoon and are forced to battle a mechanical robot cat that chases them. Darryl sees his parents as animated characters and watches their actions on the screen. Helen travels through a mousehole into another channel, but Roy is left behind to deal with the robot cat, which he defeats by sending for a mechanical robot dog. Roy then runs through the conduit to find Helen and ends up on a Saturday Night Live theme show called 'Saturday Night Dead' on a segment called \"Duane's Underworld\" as a captive guest. Roy manages to escape and finds himself in a black-and-white channel as a private detective in his search for Helen. In the meantime, Darryl finally convinces Diane where their missing parents are by showing them on the TV set and they try to help them survive any way possible. Roy finds Helen being held by Mr. Seidenbaum, their former next door neighbor, who has set himself up in this cloak-and-dagger show as a nightclub owner. When a gangster arrives and begins shooting up the place, Seidenbaum is fataly hit and as his final act, gives Roy and Helen his remote control device that he has somehow smuggled into the HTV world. Roy and Helen use it to escape but they loose the remote control after they find themselves in the next channel on a period piece show called \"Off With His Head\" set in 18th Century France where Roy and Helen are aristrocrats being chased by Parisian citizens during the French Revolution. They are reunited with Crowley, who has survived he wolf attacks despite the loss of his right leg and arm, who tries to help them escape, but they are soon captured by French soldiers and taken to a town square to be executed. Darryl and Diane try to help by hacking into the TV set's cable database to access the system just as the countdown to Roy and Helen's time is to expire. They manage to prevent Roy from being beheaded long enough for the clock to expire and Roy and Helen are saved by the clock to announce the end of their 24 hour trial period in HTV. This infuriates Spike to the point that he makes good on Roy's contract, releasing him but not Helen as she was not in the system under contract. Spike then transports himself into the HTV world and spirits Helen away to a Western site where he ties her to a cart sitting across a railroad track for her to be run over by an oncoming train in order to lure Roy back into HTV to kill him once and for all. Roy re-enters the HTV system to save Helen, bringing his own remote control with him, allowing him to control their journey. Roy battles Spike in a climatic chase across the HTV system shows from \"Star Deathtreck: The Next Generation\", to \"Driving Over Miss Daisy\" to \"Underworld Professional Hockey\" to a medivial show were Roy's remote control gets destroyed. With assistance from Darryl who throws a fencing sword at the sattalite dish to fight with Spike, they battle across a medivial mansion where Roy tries to get at Spike's remote control device. Roy confronts Spike in a Salt-N-Pepa music video where after both men chase Spike's remote control around, Roy finally gets a hold of it and bannishes Spike back to the medival world and uses it to save Helen from being run over by a train in the western movie. By pressing the \"off\" button on the remote, they are evicted from the TV set moments before it sucks their neighbor's abusive Rottweiler into the TV and it destroys itself. Spike gets eliminated by the Rottweiler in the medivial world while Crowley shows up to watch, and Pierce takes over Spike's place in the HTV control room. In the final scene, Roy, who has learned a valuable lesson after his adventure, has dramatically cut back on his TV viewing and taken a new job as a fencing teacher.",
      "writers": [
         "Tom S. Parker",
         "Jim Jennewein"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0105466/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BOTUzMTAxMjQ1NV5BMl5BanBnXkFtZTYwMzM0MDk5._V1_SX214_AL_.jpg",
      "actors": ["Stars: John Ritter, Pam Dawber, Jeffrey Jones | See full cast and crew »"],
      "reviews": [
         "Roy Knable (John Ritter) loves watching television so much that his marriage is falling apart because of it. When a door-to-door salesman shows him a high-tech remote control, Ritter listens to his pitch, and buys into it when he discovers that it's for a new television and satellite system that offers 666 channels of programming--much of which is not available anywhere else. However, the salesman may not have been what he seemed to be, and Knable soon discovers that he may have agreed to a contract that obligated him to give up more than money. Oh, how I loved this film! Director Peter Hyams and the writing crew of Tom S. Parker, Jim Jennewein and Richard Siegel definitely had my number on this one. Stay Tuned is a very clever horror comedy that is extremely underrated and perhaps was a bit mismarketed. Although I'm a huge horror fan, and love horror comedies, I'd never heard of this one before (however, later I did find references to it in a couple horror sources, so it seems it wasn't completely overlooked by the industry and fans). But the horror aspect of the film doesn't appear to be advertised anywhere. I watched this on HBO's Family Channel. Even though Knable's son is important to the plot and there are strong fantasy aspects, this is not really a family film. Not that kids might not like the film, but they'd have to be kids who like horror (comedies) and whose parents let them watch horror (comedies). Enjoyment of the film is also helped by having a familiarity with the material that is being spoofed, and the references are broad enough that it would take years of experience to acquire that familiarity. Why spoofed? Well, on one level, Stay Tuned is just a long series of crafty takes on film and television programs and genres, giving many well-known classics a more immediate horror twist--immediate because they all put our heroes, Knable and his wife Helen (Pam Dawber), in peril in some way. There are many more subtle jokes, as well, and the film even pokes fun at film students/film geeks. The spoofs range from silly to poignant, and can be as quick as a title or as long as ten minutes or so. One of the best is a classic Warner Brothers-styled animated segment. The style and the quality should not be surprising, as Chuck Jones designed and supervised the animation. Under different hands, maybe this material wouldn't be quite as good as it is. Hyams' direction is spot-on throughout the film, the script (including the dialogue) is very intelligent, and in addition to Ritter and Dawber being as good as I've seen them, Stay Tuned also features Jeffrey Jones (one of my favorite character actors) and Eugene Levy. Both are fantastic. Stay Tuned deserves much wider recognition. It is funny, suspenseful and seems to draw from a well of endless inventiveness. It's as good as any other horror comedy I've seen. There is also a surface message of turning off the television and living your life, which is a worthwhile sentiment, but perhaps a harder sell when it is packaged in a film as excellent as this. A 10 out of 10 from me.",
         "I stumbled upon this movie while channel flipping, ironically enough. I thought that the film was very well done, with just enough cheesy humor to keep me groaning and laughing. The jewels of the film were found in it's references and TV jokes. Some humor at actor Ritter's expense gives the impression that movie is making fun of itself. Jeffery Jones plays an excellent role, further showing off the actor's versatility. What the film lacked in plot, it made up for in originality. The highlight of the film is a cartoon segment done by the legendary Chuck Jones, parodying the Tom and Jerry clichés we all grew up with. All in all, a funny if not cheesy film, definitely worth watching.",
         "This was a clever and funny movie, much better than I anticipated. Most of the humor involves takeoff or parodies of television programs and movies. Being familiar with most of them, I enjoyed the humor. The takeoff involved having the devil take charge of some of these programs. John Ritter and Pam Dawber play husband-and-wife \"Roy and Helen Knable\" who get sucked into buying a TV dish package straight from The Devil. After the purchase, which comes complete with 666 channels, mayhem ensues. There were a number of spots in here I just laughed out loud. Knowing a lot of the TV programs that were being spoofed helps a lot, of course, but there is a lot of good material in this film. The special-effects were pretty good, too, especially for a film that really never got a lot of exposure nor, I assume, had a huge budget. Jeffrey Jones and Eugene Levy, two guys who are usually pretty funny, supply some good humor here, too. I looked at this strictly for laughs even though I know the devil is somebody to take seriously, but this film was anything but played for seriousness. As a bonus, we even got a Chuck Jones cartoon in the middle of the story. This is one wacky movie and I'd like to see it on widescreen DVD. I last saw it on tape. This is recommended to those who enjoy dark humor.",
         "I've read a few bad-type reviews on this, but that just shows what I know. i think Stay Tuned is one of the funnier movies to roll along in a while. Yeah, it's filled with TV rejects like Ritter, Dawber, and Levy, but they're still kinda funny. The funniest thing are the TV parodies (yes, they're funny, dammit), and the whole parody of the modern entertainment industry. Plus you've got a great Chuck Jones cartoon set right in the middle. Moves along just fast enough to keep your interest, and the characters are just tolerable enough you don't want to turn off on it. As was noted, it grows on you.",
         "Stay Tuned is a excellent movie! John Ritter, Pam Dawber, and Eugene Levy was good. Jeffrey Jones performed well. I like how the film was made. The scenes were really cool and the segment of Duane's Underworld was really funny! The wrestling match segment was awesome! George Gray played Mr. Gorgan. He was better known in the old wrestling days (when it was special in My opinion) of the WCW in the early 1990s as The One Man Gang and in the old WWF days in the 1980s as The One Man Gang and \"The African Dream\" Akeem! It was so cool seeing this 6'6, 400 plus pound wrestler because he is one of My all time favorites and also it was good to see Captain Lou Albano! Good music by Bruce Broughton and direction by Peter Hyams! Anyway, there is a whole bunch in the movie and is all I can say is that if you like Ritter, Dawber, Levy, and Jones and want a wild ride of a movie then I suggest you see Stay Tuned!",
         "A very long time ago i saw a trailer of this movie when i was on vacation in the US and i said that one day i´d get to see this movie, some years went by and on my first trip to California i went into a Suncoast store bought some movie souveniers and asked for this film, I found it with a regular price and bought it,at this time i had just seen the trailer, not read any reviews or nothing, i just knew i had to have it cause it looked cool on the trailer, I was so right in buying it, this movie is great, being myself a couch potato i can relate to George Knable (Played wonderfully by the recently deceased John Ritter) and the stuff that happens to him when hes sucked inside his new satellite dish with his wife into a programming of 666 channels into alternative horror versions of classic shows and movies,Theres even an MTV kind of video with Salt N Pepa that is so cool i had to buy the soundtrack of this movie, i love that sequence when theyre all dancing, To me this film rocks and its a must see, John has passed away just 2 days ago and i feel this movie as being his best movie of all because he is the main character and he does a great job at being funny, I will always remember John Ritter.",
         "I have always liked this film, since I was younger. It's an expensive flop but at the same time I think it has plenty of laughs and is entertaining. The late great John Ritter is always good value and likeable as is Pam Dawber, the ultimate fanciable former sitcom star. She is differently attractive and I have always fancied her like many others, particularly from the Mork And Mindy days, you know that sitcom with Robin Williams that you used to find funny but when you look back now it kinda sucks! This is good family entertainment. It's inconsistent and some of the references aren't that funny but on the most part the referencing of old movies and TV shows is where most of the humour lies. Good fun. ***",
         "The funniest bit is probably Roy Knable being plopped into a certain Santa Monica three story house, tripping over a sofa, and being questioned by a certain blonde and brunette, \"Where have you been?!\" Is \"Three's Company\" John Ritter's personal Hell? Who knows, but it's a broad wink to the couch potatoes in the audience.",
         "My friend Kenn Harris recommended this movie to me and I was against it from the start weeks ago because it always looked stupid to me and I hate John Ritter with a passion. But I called him and apologized for doubting him - this film is a hidden treasure. While it is true that John Ritter is a one-dimensional actor, this film does not rely heavily on his acting or even his speaking. The bulk of this film is visual gags and pop culture references. If you grew up watching TV, you should catch most of these and they're hilarious. \"Different Strokes\" was great, and so was \"Fresh Prince of Darkness\"... and who can forget \"Frankensteinfeld\"? If that's not enough, two great actors round out the cast - Jeffrey Jones and Eugene Levy. Jones is often a minor actor, but he is given top spot in this film, and rightfully so. As we later saw in \"Ravenous\", this man has a full potential for evil and his screen presence is terrific. Levy is classic, his character is the real hero of this film. Best of all, this is a younger Levy, years before he became known as the father from \"American Pie\"... this is pure Levy, untainted. This film highly recommended.",
         "I haven't seen the movie in years but do remember liking it. Both Ritter,Dawber and Jones are perfectly cast in this comedy. A married couple,one of which is totally obsessed with TV like many of us all..kidding...anyway both husband and wife are sucked into the TV through the Satel light dish and thus the real fun begins. I won't spoil the movie for anyone but there's a very amusing sequence where both are animated mice. If you happen to see it in the video store rent it. Even though it didn't fair well at Box Office it still is a pretty good flick. One of Ritter's best movies in my opinion. I bought it at a yard sale shortly after Ritter died in memory as well as I knew it was a good movie having first seen after it was first released on VHS. Everyone in the movie was awesome. Sure there's spots where it could of been better but for the most was pretty good flick."
      ],
      "genres": [
         "Comedy",
         "Fantasy"
      ],
      "productionCompanies": [
         "Morgan Creek Productions",
         "Warner Bros."
      ],
      "summaries": [
         "The Knables are having marriage problems: Roy is a lousy plumbing supplies salesman by day and couch potato by night, and his wife, Helen, is a successful senior product manager for a vitamin company. Roy watches too much TV every night and Helen just cannot stand it. Then one night, Helen offers Roy a night to save their relationship: a romantic getaway without phones, their children, and especially no TV. Unfortunately, when Roy's hooked on the big screen, there's no going back. This frustrates and angers her and Helen decides to smash the family console with one of Roy's trophies as a wake-up call to reality. A heartbroken-to-disoriented Roy then hears the doorbell and finds out that it's a mysterious salesman named Spike who offers him the \"ultimate getaway\" from all the hate, frustration, and failures: a new remote controller and a new state-of-the-art satellite TV. Roy accepts the new TV by signing a free trial contract not knowing that he just sold his soul to the devil himself. But later, Helen is both not impressed and steamed. After a fight outside, the \"dish\" activates. Roy and Helen try as hard as possible to escape, but it was too late for the force of gravity from the dish sucks them into the \"Cable Television World of Hell\" - all six hundred and sixty-six channels worth. Now they must survive through every episode of shows such as the game show \"You Can't Win\", the U.W.W.F. (Underworld Wrestling Federation) match, \"Northern Overexposure\", \"Driving Over Miss Daisy\" and a cartoon sequence called \"RoboCat\", \"Autopsies of the Rich and Famous\", \"Duane's Underworld\", \"HTV\", and \"Off With His Head\", all within 24 hours. If successful, they will return back to home, but if they fail, the devil keeps their souls forever. After they survived one day without harm, Roy gets sent back home while Spike hold Helen hostage. Now with the help of their children, Daryl, a communication whiz, and Diane, a fashion freak, Roy must re-enter the underworld of Hell Vision TV and save his wife, while keeping a distance from Spike. It is then that Roy will learn the hard way that there's more things in life than only a television. Like commitment. (Formerly written by Christopher Howell)",
         "A husband and wife are sucked into a hellish TV and have to survive a gauntlet of twisted versions of TV shows they find themselves in."
      ],
      "budget": 0
   },
   "movielensId": 3669,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1992-08-14",
      "dvdReleaseDate": "2000-05-23",
      "directors": ["Peter Hyams"],
      "runtime": 87,
      "movieId": 3669,
      "title": "Stay Tuned",
      "mpaa": "PG",
      "actors": [
         "John Ritter",
         "Pam Dawber",
         "David Tom",
         "Heather McComb",
         "Jeffrey Jones",
         "Eugene Levy",
         "Don Calfa",
         "Erik King",
         "Susan Blommaert",
         "Bob Dishy",
         "Joyce Gordon"
      ],
      "imdbMovieId": "0105466",
      "originalTitle": "Stay Tuned",
      "genres": [
         "Comedy",
         "Fantasy"
      ],
      "youtubeTrailerIds": ["qOZdWWDFKVE"],
      "plotSummary": "Salesman Roy Knable spends all his free time watching television, to the exasperation of his wife, Helen. One day, TV salesman Spike convinces Roy to buy a satellite dish offering 666 channels. The new addition to Roy's home entertainment system sucks him and Helen into Hellvision, a realm run by Spike, who is an emissary of Satan. For 24 hours, the couple must survive devilish parodies of TV programs if they want to return to reality alive.",
      "tmdbMovieId": 23939,
      "avgRating": 2.53537,
      "releaseYear": "1992",
      "numRatings": 410,
      "posterPath": "/7k9r0Qq5OmCDissX1pDE5AWVScQ.jpg"
   }
}