{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "journalist",
            "id": 736
         },
         {
            "name": "italian",
            "id": 924
         },
         {
            "name": "world war ii",
            "id": 1956
         },
         {
            "name": "german",
            "id": 2349
         },
         {
            "name": "northern africa",
            "id": 4515
         },
         {
            "name": "u.s. army",
            "id": 4595
         },
         {
            "name": "army",
            "id": 6092
         },
         {
            "name": "infantry",
            "id": 11106
         },
         {
            "name": "reporter",
            "id": 12193
         }
      ],
      "imdb_id": "tt0038120",
      "video": false,
      "title": "The Story of G.I. Joe",
      "recommendations": [
         35849,
         80705,
         43596,
         54195,
         93834,
         53522,
         48599,
         99657,
         24041,
         156316,
         219924,
         49671,
         151545,
         23620,
         44190,
         43488,
         20372,
         48994,
         43691,
         43031
      ],
      "backdrop_path": "/it1GrAF5AfaTr4zRW3YBmo1EK6G.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Ernie Pyle",
               "gender": 2,
               "credit_id": "52fe4701c3a36847f811e969",
               "name": "Burgess Meredith",
               "profile_path": "/lm98oKloU33Q7QDIIMSyc4Pr2jA.jpg",
               "id": 16523,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Bill Walker",
               "gender": 2,
               "credit_id": "52fe4701c3a36847f811e96d",
               "name": "Robert Mitchum",
               "profile_path": "/q8imDThRFNQnfyRxadlBrKzGp4u.jpg",
               "id": 10158,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Sgt. Steve Warnicki",
               "gender": 0,
               "credit_id": "52fe4701c3a36847f811e977",
               "name": "Freddie Steele",
               "profile_path": "/nDwu3IppGvKEMx6eZccUX9J4q9x.jpg",
               "id": 85898,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Pvt. Dondaro",
               "gender": 2,
               "credit_id": "52fe4701c3a36847f811e97b",
               "name": "Wally Cassell",
               "profile_path": "/rR7idcD1L1rav40uXRNzsYnbqQV.jpg",
               "id": 78794,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Pvt. Spencer",
               "gender": 0,
               "credit_id": "52fe4701c3a36847f811e97f",
               "name": "Jimmy Lloyd",
               "profile_path": "/vX9t8M6Vb2zIS1aePIJ8StbWt42.jpg",
               "id": 138388,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Pvt. Robert 'Wingless' Murphy",
               "gender": 0,
               "credit_id": "52fe4701c3a36847f811e983",
               "name": "John R. Reilly",
               "profile_path": null,
               "id": 138389,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Nurse Lt. Elizabeth 'Red' Murphy (uncredited)",
               "gender": 1,
               "credit_id": "5951faffc3a36809c601ce3f",
               "name": "Dorothy Coonan Wellman",
               "profile_path": "/4oU591tBYgLx7fGgrfQrhboDswj.jpg",
               "id": 148574,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4701c3a36847f811e973",
               "name": "William A. Wellman",
               "profile_path": "/m0RSN7IQTXF9ZFUrqoZJUzZqu02.jpg",
               "id": 14643,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4701c3a36847f811e989",
               "name": "Leopold Atlas",
               "profile_path": null,
               "id": 543922,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4701c3a36847f811e98f",
               "name": "Guy Endore",
               "profile_path": null,
               "id": 102935,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4701c3a36847f811e995",
               "name": "Philip Stevenson",
               "profile_path": null,
               "id": 1146292,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "War",
            "id": 10752
         }
      ],
      "popularity": 1.789143,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 46614,
      "vote_count": 9,
      "budget": 0,
      "overview": "War correspondent Ernie Pyle joins Company C, 18th Infantry as this American army unit fights its way across North Africa in World War II. He comes to know the soldiers and finds much human interest material for his readers back in the States.",
      "similar": [
         2016,
         21876,
         8741,
         1654,
         16869,
         5925,
         1949,
         2253,
         613,
         637,
         11615,
         676,
         14574,
         857,
         65754,
         423,
         424,
         228150,
         374720,
         339259
      ],
      "original_title": "Ernie Pyle's Story of G.I. Joe",
      "runtime": 108,
      "poster_path": "/lU6tzA1XOsO1YUh15PAllxRBM70.jpg",
      "spoken_languages": [
         {
            "name": "Italiano",
            "iso_639_1": "it"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Lester Cowan Productions",
            "id": 9382,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "United Artists",
            "id": 60,
            "origin_country": ""
         }
      ],
      "release_date": "1945-07-13",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "The mightiest action drama ever filmed !",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["William A. Wellman"],
      "runtime": 108,
      "synopsis": null,
      "writers": [
         "Leopold Atlas",
         "Guy Endore"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0038120/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BODc5OTE4NzMzN15BMl5BanBnXkFtZTcwMjAzNjAyMQ@@._V1_SY317_CR10,0,214,317_AL_.jpg",
      "actors": ["Stars: Burgess Meredith, Robert Mitchum, Freddie Steele | See full cast and crew »"],
      "reviews": [
         "I entered for 17 weeks of infantry basic training at Camp Roberts California in January,1945. I was just 18. I was in the 96th, inf, training battlion. I am 73 now. The movie about Ernie Pyle was being made there in part. Some of the trainees were in the film. I recall my company marching over and over on this same hill to make it look like there was a full army there for the picture. My company commander was in the film as was the company mascot dog. I can't recall much more about the film as I have'nt seen it in a long time, getting old I guess. I surely would like to have a VCR copy of it too. If anyone has a copy to sell, please let me know. I recall that Burgess Meredith had lunch in the mess hall and shot the bull with the G.I.s there. Thats about all that I can remember for now. Hope this helps. G",
         "After searching for the best war films all my life, and after seeing so much tripe, I was completely flabbergasted by this film, of which I had heard, but had never seen until last night. Most films made during the Second World War were pure propaganda, all dash and glory, but with little resemblance to real battle. \"The Story of G.I. Joe\" is the real McCoy, especially considering that it was made near the end of the war. You can feel, taste and smell the muck and fear these men lived with. The dialogue is gritty, the combat scenes, especially of urban fighting bang on. One exceptional and rare scene was of an anti-tank gun crew swinging into action and firing 12 rounds a minute in a town. It was a battle ballet and an example of the lethality of a well-trained and seasoned team. In my opinion, this film ranks with Steven Spielberg's \"Saving Private Ryan\" as the best film of infantry in combat ever made. In fact, I believe that Spielberg may even have made 'Ryan' as an homage to Wellman's great earlier film; many of the scenes and much of the dialogue is very similar. In 1945, General Eisenhower called 'G.I. Joe' the greatest war film ever made. I'm sure he would say the same thing today. This should be a must-see for every student studying this country's fighting history and every American in uniform should see it.",
         "William A. Wellman is one of the American cinema's greatest craftsmen. The Story of G.I. Joe is one of his best, if not his best. It presumably inspired a lot of later films. It especially reminds me of Stanley Kubrick's Vietnam film, Full Metal Jacket (the second half of it, anyway). This film should also be praised for its dedication to realism, and its lack of propaganda, surprising in such a vivid war film that was being made in the thick of the action in both Europe and the Pacific. I also really love the script. The structure is very tenuous. Unlike most American films, it has no real \"goal.\" Take a look at the infinitely inferior Steven Spielberg film Saving Private Ryan. In that film, the story centered around the search for Private Ryan. In The Story of G.I. Joe, the goal is simply the arrival at Rome, but this isn't at all what the film is about. It concentrates mostly on how the soldiers passed the time and how they felt. In this way, it's the second most sensitive war film I can think of, only following Jean Renoir's unsurpassed The Grand Illusion. There are some excellent battle scenes, as well. As with most war films, there isn't a lot of overt characterization. It works really well here, though. Instead of opting for the old two-dimensional types of soldiers - you know, the \"tough guy\" the \"young guy\" the \"religious guy\" and what have you - Wellman just lets the characters develop within the actors. We may not know all of their names, or even recognize the same characters throughout the film, but, with each close-up of a soldier's face, we know as much about that person as we could know. The acting is very good. The three who stand out are Burgess Meredith, who plays Ernie Pyle, the writer whose works the film is based on, Robert Mitchum, wonderfully sensitive as the troop leader (he was probably never better; he received his one and only Oscar nomination for the role), and Freddie Steele. Early in the film he receives a phonograph recording of his young son speaking. He spends most of the film first looking for a phonograph player and then trying to repair it. This subplot is especially touching. Wellman's direction is superb. The cinematography is, as well, and so is the music. The only problem that the film has is that it runs into war movie cliches, but one would expect that those cliches probably existed in real life, as well. 10/10.",
         "I found this to be a particularly poignant film about WWII - no heroics, just the simple getting through the day & night of a company of US infantry. Much like Ernie Pyle humanized the 'G. I.' in his written pieces, Wellman does the same on film. The heat, dirt, cold, mud, rain...fear, uncertainty, waste - it's all here without the bombast and manipulation of \"Saving Private Ryan'. The performances are wonderful - most of the performances were given not by professionals but by the soldiers themselves. There is one scene between Mitchum and Meredith that was apparently an audition film - it was so right, it was simply inserted into the film. There are human touches throughout, as well as the insanity of war. I would strongly recommend this film to anyone who has an appreciation for the director, actors, theme. It's not a grisly film, and it is slow, but overall well worth watching.",
         "As a rule, war movies made in wartime are propaganda; critical and realistic movies about war appear after the fact. An exception is THE STORY OF G.I. JOE, easily the best film about World War II made during the war, and one of the best American war movies of any era. It's not about famed correspondent Ernie Pyle so much as seen through his eyes; his compassionate observations create a portrait of an infantry company in North Africa and Italy, and a tribute to its commanding officer Captain Bill Walker (Robert Mitchum.) The film culminates in a set-piece based on Pyle's essay, \"The Death of Captain Waskow.\" Unlike most WWII movies, with their stentorian narration, maps and speeches and clear-cut missions, THE STORY OF G.I. JOE is reticent and nearly formless. There are many scenes of soldiers marching along roads, or waiting around in damp caves; one patrol after another sets out and returns without accomplishing anything in particular. Except for Dondaro, the resident \"wolf\" who thinks of nothing but dames, the soldiers don't fall into the usual stereotypes. Nor do they look like movie stars; they have real, varied faces. They're just a bunch of ordinary guys, with no obvious ethnic or regional characteristics. One is obsessed with his failure to get into the air corps; another incessantly tries to play a record of his son's voice. (This repetitive motif gets tiresome, but pays off in a big way. Freddie Steele is wonderful as the rough-edged, hard-working sergeant desperate to get back to his wife and child.) There are sentimental touches, especially the presence of a small dog whose whining and whimpering underscores tragic moments, but even this doesn't cloy. The dog is actually an effective symbol of the men's emotional vulnerability, their need for comfort and companionship. A little sentimentality is allowable because the film overall is uncommonly realistic. Like ALL QUIET ON THE WESTERN FRONT, it's a war movie in which nearly every major character dies, and it conveys equally well the reality of the soldier's life: as the hero in ALL QUIET says, \"Our bodies are earth and our thoughts are clay, we eat and sleep with death.\" There is a touch of stylized lyricism in the film, and also a good deal of wry humor. Many of the comic lines are copied directly from the cartoons of Bill Mauldin, whose depiction of scruffy, un-heroic, grousing dogfaces was attacked by General MacArthur, but is brought faithfully to life in THE STORY OF G.I. JOE. There is very little action, and the film will disappoint anyone who seeks out war movies for the excitement and explosions. The few battle scenes have the quality of tasteful newsreels; they look realistic but aren't very engaging because they don't focus on the characters we have come to know and care about. Most of the deaths take place off-screen, and are accepted with numb resignation. Understatement is a rare quality in a war movie, and it's what makes THE STORY OF G.I. JOE so powerful. In one wordless scene Pyle sits in a cave while men return from a patrol, collapsing wet and exhausted. Pyle keeps turning nervously to the entrance as each man comes in, and you realize he is waiting to see who doesn't come back. Burgess Meredith is appropriately self-effacing as a man who admires the infantry soldiers so much he feels compelled to suffer alongside them, ashamed of his own safety and of his fame. Mitchum is characteristically cool, sleepy-eyed and low-key, but his emotional sincerity and the nobility of his character belie his reputation for irreverent cynicism and his dismissal of his acting abilities with comments like, \"Look, I got three expressions: looking left, looking right, and looking straight ahead.\" (He gives a similarly heartfelt performance in HEAVEN KNOWS MR. ALLISON, again as a soldier.) Here, beneath his tough, no-nonsense exterior he's soft-hearted and humane, anguished by his responsibility for sending men to their deaths. There's always a suggestion of sadness in Mitchum's mask-like face (he very rarely smiles) and in his deep weary voice, and both work beautifully here. His character is constructed subtly of small pieces: the way he responds to the crack-up of his faithful sergeant, the humorous scene where he strong-arms a quartermaster into getting turkey and cranberry sauce for his men on Christmas, and above all his conversation with Burgess Meredith as he exhaustedly swigs grappa while writing letters to the families of the dead. This was the scene Mitchum did to audition for the part, and his performance made William Wellman cry. Wellman later said it was one of the most compelling things he ever saw, and he wished he'd had the sets complete, so he could have incorporated the test into the finished film. By the end of the film, you so love and admire this man that the sight of his corpse, brought down from a mountain by mule, is enough to convey the true heartbreak of war. One soldier sits beside him and strokes his hand; when he has to leave, he straightens the captain's collar and gently touches the side of his face before limping after the company. The fact that this mourner is a character we have not liked up to this point\u0097the conceited, irritating Dondaro\u0097and who has not had a warm relationship with the captain, somehow makes the scene even more touching, saving it from emotional overkill. The field of white crosses behind Pyle's head in his reaction shot is a mute rebuke to triumphalism\u0097an astonishing comment to make just months before the end of the war.",
         "It's odd that a director noted for his aviation films would choose to direct a film about the infantry, but William Wellman knew a great subject when he saw it. Remember he also did the deservedly highly acclaimed Battleground. Independent producer Lucas Cowen got together with Ernie Pyle and approached Wellman. They left copies of the stories Pyle wrote from the front in Africa and Italy and Wellman read them in a night's sitting and agreed to do the film. The Story of GI Joe is based on the various stories and characters that World War II's most famous correspondent encountered. In fact aside from Robert Mitchum and a couple of other actors, the men in this film are real GIs who were in transit from the European to the Pacific Theater and a lot were killed after they arrived in the Pacific as did the real Ernie Pyle who never got to see the finished product. Burgess Meredith does a fine job recreating the modest chronicler that was Ernie Pyle. In civilian life aside from news stories, Pyle was famous for his cross country travels and stories he wrote about people from all walks of life. Very much like the late television commentator Charles Kuralt did on CBS morning news on Sundays. When war broke out Pyle did not cover the war of the generals, he spent his time with the troops and told their story. For that he was respected and beloved as now other war correspondent has ever been before or since. In this film Pyle is introduced to the men of one company which transports him to that first American battle and defeat at Kasserine Pass in north Africa. And he runs into them again and again through Sicily right to the liberation of Rome. Robert Mitchum plays the lieutenant later captain in charge of this company. He'd broken into films with some Hopalong Cassidy pictures and did bits in other films. In fact when its cowboy star Tim Holt enlisted in the armed forces, RKO pictures had signed Mitchum to be his replacement and he'd done two films Nevada and West of the Pecos when he read for the part of Lieutenant Walker. If it weren't for this film, Robert Mitchum might have continued to be a B picture cowboy star. For his portrayal of the stern, but compassionate officer in whom Pyle finds a kindred spirit, Robert Mitchum got his only Academy Award nomination for Best Supporting Actor. He lost that year to James Dunn for A Tree Grows in Brooklyn. He never received another nomination, but he certainly became a legend although he'd have been the first to debunk that title. Lots of newsreel footage from the Mediterranean theater make The Story of GI Joe one of the most realistic war films ever done. That's remarkable too, considering most of the Hollywood product back then was propaganda hype, good and bad. It has remained a classic to this day and a wonderful tribute to that chronicler of the infantry, Ernie Pyle.",
         "I rank this film with \"The Paths of Glory\", \"All Quiet on the Western Front\", and \"A Walk in the Sun\"; which I consider to be the most poignant and best acted war or anti-war films. The direction, dialogue, and acting in this film differ in the respect that the bloodshed and action are not graphic but obviously evident. It is certainly better than \"Saving Pvt. Ryan\", which is too long, pretentious, and relies on gory special effects to entice the younger audience. The acting in \"The Story of G.I. Joe\" is realistic (not to be confused with the \"method style\") and understated. Burgess Meredith and Robert Mitchum give two of their best performances and I really felt as though this was a portrayal of the every day conditions of the infantryman and not an exercise in false heroics. I would rate this film a 9 out of 10. And I thank Turner Classic Movies for showing it. It is truly a CLASSIC.",
         "One of the most fascinating tributes to the foot soldier is this 1945 war film that follows Ernie Pyle, beloved war correspondent, as he treks along through mud and ambushes with a platoon of weary G.I. Joes. Robert Mitchum earned an Oscar nomination as Lt. Bill Walker and many of the other males in the cast were real combat soldiers who actually participated in the making of the film. The plot is no more than a series of skirmishes the platoon faces on a mission against Nazis in Italy. Burgess Meredith makes Ernie Pyle a likeable human being who wins the trust and affection of the platoon as he trudges with them across marshlands and all of the \"up front\" activity involved. Human touches abound without the emphasis on cliches that often abound in war films. Mitchum gives just the right touch to his role as the leader who understands the strain his soldiers are under. The inclusion of a sub-plot involving a soldier anxious to hear the sound of his son's voice on a recording; and a pooch that becomes the mascot for the troops, are touches that give the film added humanity. There is some editing that seems a bit jumpy in the latter part of the film, as though some cuts were made--but all in all this is a very watchable war film with a close-up look at the men and their courage under fire. A fine tribute also to Ernie Pyle, a famous Pulitzer Prize-winning war correspondent during the dark days of World War II. Highly recommended.",
         "The Story of G.I. Joe chronicles the experiences of an infantry unit in Italy as told by war correspondent Ernie Pyle, who is played by Burgess Meredith. War weary Robert Mitchum plays the platoon leader. While we can see that the movie was largely made in the studio, the great photography and direction move it along. Cold feet, mud, frustration, and homesickness are effectively demonstrated at the expense of battle scenes.",
         "And war was fought in the rain and the mud and the cold....In today's wars fought on film there is very rarely a look at the true living conditions that existed. This movie does not clean up the actors (as most films do). You see here all of the gritty, day-to-day, living during the war. These guys did not clean up every day. This is a good story about WW2. Be sure to see it. 8/10"
      ],
      "genres": [
         "Biography",
         "Drama",
         "War"
      ],
      "productionCompanies": ["Lester Cowan Productions"],
      "summaries": ["War correspondent Ernie Pyle joins Company C, 18th Infantry as this American army unit fights its way across North Africa in World War II. He comes to know the soldiers and finds much human interest material for his readers back in the States. Later, he catches up with the unit in Italy and accompanies it through the battles of San Vittorio and Cassino. He learns from its commanding officer, Lt. (later Capt.) Bill Walker of the loneliness of command, and from the individual G.I.'s of the human capacity to survive drudgery, discomfort, and the terror of combat."],
      "budget": 0
   },
   "movielensId": 3670,
   "movielens": {
      "languages": [
         "Italiano",
         "English"
      ],
      "releaseDate": "1945-07-13",
      "dvdReleaseDate": "2000-05-23",
      "directors": ["William A. Wellman"],
      "runtime": 108,
      "movieId": 3670,
      "title": "The Story of G.I. Joe",
      "mpaa": "",
      "actors": [
         "Burgess Meredith",
         "Robert Mitchum",
         "Freddie Steele",
         "Wally Cassell",
         "Jimmy Lloyd",
         "John R. Reilly",
         "Dorothy Coonan Wellman"
      ],
      "imdbMovieId": "0038120",
      "originalTitle": "Ernie Pyle's Story of G.I. Joe",
      "genres": [
         "Drama",
         "War"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "War correspondent Ernie Pyle joins Company C, 18th Infantry as this American army unit fights its way across North Africa in World War II. He comes to know the soldiers and finds much human interest material for his readers back in the States.",
      "tmdbMovieId": 46614,
      "avgRating": 3.41176,
      "releaseYear": "1945",
      "numRatings": 102,
      "posterPath": "/lU6tzA1XOsO1YUh15PAllxRBM70.jpg"
   }
}