{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "hostage",
            "id": 1562
         },
         {
            "name": "affection",
            "id": 5608
         },
         {
            "name": "rescue",
            "id": 10084
         },
         {
            "name": "dog",
            "id": 15162
         },
         {
            "name": "animal actor",
            "id": 157987
         },
         {
            "name": "benji",
            "id": 191591
         }
      ],
      "imdb_id": "tt0071206",
      "video": false,
      "title": "Benji",
      "recommendations": [
         38802,
         44415,
         21299,
         20639,
         38554,
         239899,
         129745,
         21352,
         80346,
         124042,
         49345,
         15943,
         22792,
         30500,
         19809,
         140054,
         299583,
         53882,
         73336,
         144060
      ],
      "backdrop_path": "/tWRquOHOmZqp0SOkUUVzVgVbhFn.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Mary",
               "gender": 1,
               "credit_id": "52fe445cc3a368484e01eb8b",
               "name": "Patsy Garrett",
               "profile_path": null,
               "id": 186336,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Paul",
               "gender": 0,
               "credit_id": "52fe445cc3a368484e01eb8f",
               "name": "Allen Fiuzat",
               "profile_path": null,
               "id": 1152492,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Cindy",
               "gender": 1,
               "credit_id": "52fe445cc3a368484e01eb93",
               "name": "Cynthia Smith",
               "profile_path": null,
               "id": 1172555,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Dr. Chapman",
               "gender": 2,
               "credit_id": "52fe445cc3a368484e01eb97",
               "name": "Peter Breck",
               "profile_path": "/zmj9yWWcKQj79aZQmurdC0npb3g.jpg",
               "id": 35189,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Lady with the Cat",
               "gender": 1,
               "credit_id": "52fe445cc3a368484e01eb9b",
               "name": "Frances Bavier",
               "profile_path": "/8oKsw1dSx7GZ4Ngqhtiq2HGwqHG.jpg",
               "id": 12283,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Officer Tuttle",
               "gender": 2,
               "credit_id": "52fe445cc3a368484e01eb9f",
               "name": "Terry Carter",
               "profile_path": "/degCgXlxSSmZ1uLmXz6RCvpyAvi.jpg",
               "id": 94128,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Bill",
               "gender": 2,
               "credit_id": "52fe445cc3a368484e01eba3",
               "name": "Edgar Buchanan",
               "profile_path": "/iz7cTUzvJZ0C0ZmzvB4CnmhiiQX.jpg",
               "id": 30512,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Riley",
               "gender": 2,
               "credit_id": "52fe445dc3a368484e01eba7",
               "name": "Tom Lester",
               "profile_path": "/th07njtfltVgmI3FTVTlTb57vgx.jpg",
               "id": 198415,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Henry",
               "gender": 0,
               "credit_id": "52fe445dc3a368484e01ebab",
               "name": "Christopher Connelly",
               "profile_path": "/3kN6SQXpnZhP3U0NiYTyv4RAtxd.jpg",
               "id": 234297,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Linda",
               "gender": 1,
               "credit_id": "52fe445dc3a368484e01ebaf",
               "name": "Deborah Walley",
               "profile_path": "/2xEZzOY9W4WkzEl7CKX0w6oxj7O.jpg",
               "id": 148603,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Mitch",
               "gender": 2,
               "credit_id": "5aac6c550e0a267827007918",
               "name": "Mark Slade",
               "profile_path": "/c11BgFhgbWdbD9N5GgOARwTDpUO.jpg",
               "id": 153427,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Lt. Samuels",
               "gender": 2,
               "credit_id": "5aac6c7392514116c0007417",
               "name": "Herb Vigran",
               "profile_path": "/wArAG67tnl4ph5HyHDnaNmL56Cr.jpg",
               "id": 134614,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Benji",
               "gender": 2,
               "credit_id": "5a26bc6f0e0a264cc40e9648",
               "name": "Higgins",
               "profile_path": null,
               "id": 1935573,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "545d997c0e0a261fb3005954",
               "name": "Joe Camp",
               "profile_path": "/uSNPVWav5HxwxD2CxYL0t74RBHm.jpg",
               "id": 94787,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5aac6d31c3a36846bd00709e",
               "name": "Don Reddy",
               "profile_path": null,
               "id": 1377230,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5aac6d62c3a36846ea007b28",
               "name": "Ed Vanston",
               "profile_path": null,
               "id": 1844921,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "5aac6d7d0e0a26782a00858c",
               "name": "Joe Camp",
               "profile_path": "/uSNPVWav5HxwxD2CxYL0t74RBHm.jpg",
               "id": 94787,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5aac6d9392514116b1007253",
               "name": "Joe Camp",
               "profile_path": "/uSNPVWav5HxwxD2CxYL0t74RBHm.jpg",
               "id": 94787,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 3.788946,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 23069,
      "vote_count": 44,
      "budget": 0,
      "overview": "Benji is a stray who has nonetheless worked his way into the hearts of a number of the townspeople, who give him food and attention whenever he stops by. His particular favorites are a pair of children who feed and play with him against the wishes of their parents. When the children are kidnapped, however, the parents and the police are at a loss to find them. Only Benji can track them down, but will he be in time? If he can save the day, he may just find the permanent home he's been longing for.",
      "similar": [
         9598,
         8681,
         562,
         1571,
         264644,
         2320,
         1103,
         49021,
         11319,
         82703,
         9447,
         14043,
         9662,
         10345,
         272878,
         33660,
         279641,
         13377,
         8067,
         77946
      ],
      "original_title": "Benji",
      "runtime": 86,
      "poster_path": "/79yeY2waBOZW8K5N5aIVSw94lEJ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Mulberry Square Productions",
         "id": 14538,
         "origin_country": ""
      }],
      "release_date": "1974-10-17",
      "vote_average": 6,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "The Benji Collection",
         "id": 424830,
         "poster_path": null
      },
      "tagline": "",
      "adult": false,
      "homepage": "http://www.benji.com/MeetBenji.htm",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Joe Camp"],
      "runtime": 86,
      "synopsis": null,
      "writers": ["Joe Camp"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0071206/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAwODM2OTM3M15BMl5BanBnXkFtZTcwNDA1NTYyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Peter Breck, Deborah Walley, Patsy Garrett | See full cast and crew »"],
      "reviews": [
         "I first saw \"Benji\" when I was eight years old; during its original release, and after nearly 25 years it is still one of the finest, independently-produced family films ever made. Told entirely from the eyes of a dog, it mixes humor, suspense, and heart-tugging emotion. The dog, Benji, is still one of the finest animal actors ever to appear on screen. He conveys emotion, like no other animal on film ever had before, or has since. Although this is mainly a film for families to enjoy, it would surprise me if any adult couldn't be moved by its sentiment.",
         "Joe Camp probably had no idea this family film about an independent mutt turning neighborhood hero was going to touch off such a reaction at the box-office. \"Benji\" doesn't have the earmarks of an ambitious movie, nor did its initial publicity suggest it was going to be anything more than a matinée flash-in-the-pan, but positive word-of-mouth amongst kids was incredibly high, and \"Benji\" became the fifth highest grossing film of 1974 (no small feat; it's just behind \"The Godfather Part II\"). Although the slim plot pilfers heavily from Disney's \"That Darn Cat!\", the canine star Higgins (from TV's \"Petticoat Junction\") is an amazing find: his expressions and reactions are priceless, and the film's narrative--Benji's escapades, his human friends, his romance with a little white pooch--proved to be immediate and bracing with the target audience. Charlie Rich's song \"I Feel Love\" (Oscar-nominated!) underlines the doggy romance with just enough sentiment to make the low-budget film a real crowd-pleaser. Followed in 1977 by \"For the Love of Benji\", but with a different, look-alike dog and a hoked-up story, the sequel didn't crossover to older children. **1/2 from ****",
         "Full marks to Joe Camp for making such a beautiful film!.... Its all too easy for the dog lovers to absolutely fall in love with the movie, and Benji.....but this movie will always have the ability to change people from dog haters to dog lovers .... Benji is absolutely fabulous in this rendition of a street dog who has a certain way of living with with the people in the city. What changes things is the kidnapping of Benji's human friends. But what is beautiful about the movie is that without using the crutches of special effects (read - talking animals), the expressiveness of Benji in various stages of the movie with just the barking to help is fabulous..... he falls in love (with another beauty of a pooch)...questions using his eyes, flaps his ear to express doubt, rolls on the grass to impress Tiffany (the pooch!)... the works!!! ... Benji impresses!... and how...!... It doesn't take too much to know that the acting abilities of the humans in the movie aren't too much to talk about. But maybe that just enhances Benji's talent.... You would fall in love with BEnji and have tears flowing down your cheeks when they do the close-up on his sad eyes.... Yes, I am a dog lover.... but Benji .. he is the love of my life!",
         "I saw this movie for the first time when I was about six years old. I loved it the first time I saw it and I still love it today. My three kids received it for Christmas and they love it as well (they're 7, 4 and 3). It's a movie about two kids, brother and sister, who feed and play with Benji. His origins are unknown and he has no permanent home. He has several friends whom he visits daily and as such has a routine with which he see's them. Bill, the man who owns the café, pays Benji with a dog bone everyday he comes by because when he comes by that let's Bill know that it's time to get the café ready for the lunch rush. The kids want to keep Benji (and his new found girlfriend, Tiffany) but their father won't hear of it. Then the kids get kidnapped and it's up to Benji to help save them. I won't say anymore as I don't want to ruin it for anyone who hasn't seen it. I give this movie a 10 out of 10. I could watch it over and over again and never get tired of it.",
         "In looking over previously posted reviews, it is obvious to me that people either love this film or hate it. I happen to love it. I consider it to be not only the best dog movie ever made, but also among my 10 most favourite movies of all time (yes, including Casablanca, The Thin Man, Gun Crazy, Chinatown, etc.). What makes this movie so wonderful is Higgins, the dog (under the direction of his trainer, Frank Inn). Higgins was so far beyond other dog actors that it is impossible to explain to folks who don't own dogs or train dogs. Not only is he cute and photogenic, expressive and believable, he did all his own stunts -- and he was 14 years old when he made this film!!! Folks who review this movie tend to mention the kid actors, or the creaky kidnapping plot -- but, you know, that's not the point. If you wanted to look at it that way, you could also mention the wonderful interactions between Higgins and Edgar Buchanan, an actor he had worked with for many years on the TV series \"Petticoat Junction.\" Those scenes have a delightful sense of improvisation and charm that easily offset the whiny kid scenes. But the movie is not really about those kidnapped kids at all. It is about a small dog, his daily routines, and how, when those routines are broken, he must rise above his simple life and accomplish a great deed. In a way, the film that \"Benji\" most closely resembles is Buster Keaton's magnificent silent classic, \"The General.\" The slow, repetitious set-up of Keaton with his train and Higgins with his rounds about town, the focused realism, the slightly down-at-the-heels outsiderness of the hero, the hint of love about to blossom if only the hero can provide for his beloved, the insistently lengthy attention paid to the immediacy of ultra-mundane cause and effect -- these are the same in both films. The openings have a documentary quality to them -- until, without warning, all hell breaks loose and the plot comes crashing in. Keaton's train is stolen! Kidnappers come to Benji's home! Then, in both films, we see an under-dog, so to speak, rise to the challenge of events and, working with only the slenderest of means and very little advance planning, counter one villainous turn after another, all the while attempting to right the wrongs that have been committed. The manner in which the heroes devise solutions to the problems they face, both in \"The General\" and in \"Benji,\" flow logically from the daily routines we saw them perform in the documentary-like first halves of the films, so they seem believable. We gain confidence alongside the heroes, see the sense in what they are doing, cheer for them to triumph, watch them rise to the verge of success -- and then a huge blow falls, a colossal set-back occurs, and we feel despair -- they'll never make it now, too much time and too much ground have been lost! But again, they apply themselves to the task, and now we hope against hope that they will be able to pull it off in time ... except that most people watching The General experience jaw-dropping amazement at the stunts and most people watching Benji really have no idea how great Higgins' stunt-work really is, and spend the last third of the movie in tears because Benji is such a small dog, and he's so dang CUTE, and ... awwww. I've watched \"The General\" at least 10 times and never cried once. I've watched \"Benji\" 10 times and cried every time. I cried just know, merely writing about it. But \"Benji\" is not just a cute dog movie, any more than \"The General\" is just a Buster Keaton comedy. Like the best of Keaton's work, it is a heroic movie, and a love story, and a story of physical action and bravery. I just love this movie, that's all.",
         "They certainly don't make 'em anymore like BENJI. This sweet little film certainly deserves to be remembered for several reasons, not the least of which is Benji himself, one of the most talented animal actors ever to romp across the screen. Benji, a stray, delights in his freedom and loves to roam the town every day, chasing the cat of an elderly lady(Frances Bavier), visiting with an elderly shopkeeper(the actor that played Uncle Joe on GREEN ACRES), and visiting the home of two children who, with the help of their housekeeper(Patsy Garrett), feed him every day. Benji even finds love in Tiffany, a tiny white female terrier. Things take a serious turn when some dishonest crooks take the children hostage for a ransom and hid out in Benji's house! The sequence in which Benji frantically tries to get help for his friends is harrowing, especially when he bravely enters the children's house and is throw out by the housekeeper. But Benji saves the day. Unlike some recent so-called children's films that offer mixed messages or questionable content, BENJI tows the line. There's a positive vibe in this movie, one that is almost extinct in current movies. And another note: several familiar faces from classic TV are here: Aunt Bea from THE ANDY GRIFFITH SHOW, Uncle Joe from PETTICOAT JUNCTION, and Zeke from GREEN ACRES as one of the kidnappers! Definitely worth adding to your home library, especially if you have kids.",
         "I remember when I was a kid, I used to watch this movie over and over. It was probably my favorite movie. I stopped watching it for quite a while and not too long ago I decided to rent it again just to see if it was as good as I remembered. It was! The acting was pretty bad, but Benji's acting seemed even better. He has got to be the most talented dog ever to hit the screen. I think Joe Camp did a fantastic job. His directing with Benji makes it seem as if you can feel exactly what Benji is feeling. I think it is a fantastic film and that all children should watch it. How could you resist that dog's adorable face.",
         "Those eyes, that face! Benji does seem almost human in his first motion picture. This film isn't in the same league as National Velvet or Lassie Come Home but it is a refreshing warm-hearted little movie that's filled with several funny and moving moments. What's best is that you can watch it with your kids without being bored or having to monitor every scene. The lovable star of this movie has a face that could melt a heart of stone. That helps to compensate for the somewhat predictable plot.",
         "Not a bad flick...I regret that I saw sequels before having seen the original. Benji is a lovable character who hustles everyone in the neighborhood with charm and charisma. Two kids , children of a doctor, want to give him a home there with them, but the doctor has all kinds of phobias against canines and will not hear of it. Benji finds a girlfriend ( no kidding) and shares food and his secret hide-away--a deserted house--with his new acquaintance...until fate steps in and dictates the direction of the action. The kids are victims of a plot and Benji--and his girlfriend--come to the rescue using what measures they can muster. It's really cute, though it gets a little ugly when the bad guys appear...and there seems to be an un-explained flashback of sorts that Benji has regarding an incident with firearms. This, to my thinking, should have been developed a little better to convey to the audience that this was a motivating factor for Benji's actions...and why. But, one can suspend sensibilities if a dog is intelligent enough to convince you that he knows what is going on and has the best interest of people at heart , and that applies in this instance. Besides, since he was a homeless dog, there may have been myriad instances that were unpleasant remembrances...still it is nice when the writers and the directors let us in on what happening by way of full disclosure. But, it's a nice flick, the kids will love it, and adults will too. It's early seventies so that pacing of the film is not quite as frantic as it would become some seven or eight years down the road. See the movie.",
         "Every decade, or so it seems, Hollywood likes to build films around a cute dog. The early seventies was the era for \"Benji\", whose real name was Higgins, an attractive and photogenic dog that had already had a recurring role in \"Petticoat Junction\", the successful sitcom of the sixties. Edgar Buchanan, one of the stars from that show is on hand to act with an old pal again. Joe Camp, the director and screen writer, targeted this film toward a young audience of children under ten. Higgins and his trainer, Frank Inn, do wonders for the film. \"Benji\" shows a dog that has a natural intelligence and responds well to whatever it was asked to do. The film will delight young children. Some other faces in the movie are Frances Bavier, Deborah Walley, Patsy Garrett and others. Although the movie is predictable, let's not forget it was targeted for a young audience that will probably appreciate it more than the grown ups."
      ],
      "genres": [
         "Adventure",
         "Family",
         "Romance"
      ],
      "productionCompanies": ["Mulberry Square Productions"],
      "summaries": [
         "The first movie about the famous golden mutt. Benji is a stray who has nonetheless worked his way into the hearts of a number of the townspeople, who give him food and attention whenever he stops by. His particular favorites are a pair of children who feed and play with him against the wishes of their parents. When the children are kidnapped, however, the parents and the police are at a loss to find them. Only Benji can track them down, but will he be in time? If he can save the day, he may just find the permanent home he's been longing for.",
         "A stray dog saves two kidnapped children."
      ],
      "budget": 500000
   },
   "movielensId": 3672,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1974-10-17",
      "dvdReleaseDate": "2004-08-17",
      "directors": ["Joe Camp"],
      "runtime": 86,
      "movieId": 3672,
      "title": "Benji",
      "mpaa": "G",
      "actors": [
         "Patsy Garrett",
         "Allen Fiuzat",
         "Cynthia Smith",
         "Peter Breck",
         "Frances Bavier",
         "Terry Carter",
         "Edgar Buchanan",
         "Tom Lester",
         "Christopher Connelly",
         "Deborah Walley",
         "Higgins"
      ],
      "imdbMovieId": "0071206",
      "originalTitle": "Benji",
      "genres": [
         "Adventure",
         "Family",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Benji is a stray who has nonetheless worked his way into the hearts of a number of the townspeople, who give him food and attention whenever he stops by. His particular favorites are a pair of children who feed and play with him against the wishes of their parents. When the children are kidnapped, however, the parents and the police are at a loss to find them. Only Benji can track them down, but will he be in time? If he can save the day, he may just find the permanent home he's been longing for.",
      "tmdbMovieId": 23069,
      "avgRating": 2.8677,
      "releaseYear": "1974",
      "numRatings": 907,
      "posterPath": "/79yeY2waBOZW8K5N5aIVSw94lEJ.jpg"
   }
}