{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "hunter",
            "id": 414
         },
         {
            "name": "wilderness",
            "id": 3593
         },
         {
            "name": "cougar",
            "id": 13032
         },
         {
            "name": "lost at sea",
            "id": 179578
         },
         {
            "name": "benji",
            "id": 191591
         }
      ],
      "imdb_id": "tt0092638",
      "video": false,
      "title": "Benji the Hunted",
      "recommendations": [
         249391,
         38802,
         23069,
         144060,
         73336,
         206729,
         53882,
         42580,
         44381,
         45715,
         16513,
         47778,
         20473,
         47118,
         25665,
         121763,
         47097,
         276623,
         166721,
         47110
      ],
      "backdrop_path": "/f33FOhenVKNleZxhdSnUtQzhijt.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Hunter",
               "gender": 2,
               "credit_id": "52fe4414c3a368484e00e30b",
               "name": "Red Steagall",
               "profile_path": null,
               "id": 240602,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4414c3a368484e00e313",
               "name": "Frank Inn",
               "profile_path": null,
               "id": 240603,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Mary Beth McLaulin",
               "gender": 1,
               "credit_id": "52fe4414c3a368484e00e317",
               "name": "Nancy Francis",
               "profile_path": null,
               "id": 240604,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "Benji",
               "gender": 1,
               "credit_id": "5aadb0d80e0a26783301c951",
               "name": "Benjean",
               "profile_path": null,
               "id": 1726956,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4414c3a368484e00e301",
               "name": "Joe Camp",
               "profile_path": "/uSNPVWav5HxwxD2CxYL0t74RBHm.jpg",
               "id": 94787,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4414c3a368484e00e307",
               "name": "Joe Camp",
               "profile_path": "/uSNPVWav5HxwxD2CxYL0t74RBHm.jpg",
               "id": 94787,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "595c59b792514121f0049eb9",
               "name": "Betty E. Box",
               "profile_path": "/r6QytrjPQtccJbt6EeA2DkaTsAK.jpg",
               "id": 21601,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "595c59bf9251412251048ef0",
               "name": "Euel Box",
               "profile_path": null,
               "id": 1726957,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "595c59c792514121f0049ed1",
               "name": "Ben Vaughn",
               "profile_path": null,
               "id": 1844920,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "595c59d59251415a4003581f",
               "name": "Ed Vanston",
               "profile_path": null,
               "id": 1844921,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "595c59de9251415a4003582a",
               "name": "Erwin Hearne",
               "profile_path": null,
               "id": 1844922,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "595c59e9c3a368253c05bce4",
               "name": "Carolyn H. Camp",
               "profile_path": null,
               "id": 1844923,
               "department": "Production",
               "job": "Supervising Producer"
            },
            {
               "gender": 0,
               "credit_id": "595c59f0c3a3680d5903822d",
               "name": "Don Reddy",
               "profile_path": null,
               "id": 1377230,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "595c59f99251410c56061847",
               "name": "Karen Thorndike",
               "profile_path": null,
               "id": 1844924,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "595c5a039251415a40035860",
               "name": "Carolyn H. Camp",
               "profile_path": null,
               "id": 1844923,
               "department": "Production",
               "job": "Production Manager"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 3.218784,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 21299,
      "vote_count": 30,
      "budget": 0,
      "overview": "Benji has become stranded on a remote island after a boating accident. He finds himself struggling to survive in the wilderness, avoiding close encounters with a wolf, a bear, and a territorial female cougar with her cub.",
      "similar": [
         281957,
         244316,
         75174,
         9433,
         7484,
         205775,
         7518,
         290512,
         390062,
         70954,
         10010,
         36040,
         34851,
         1579,
         3170,
         1369,
         2787,
         9693,
         44943,
         49049
      ],
      "original_title": "Benji the Hunted",
      "runtime": 88,
      "poster_path": "/1n9BSkRe6j57oXkC1Kl64ki3As2.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Embark Production",
            "id": 50505,
            "origin_country": ""
         },
         {
            "logo_path": "/4MbjW4f9bu6LvlDmyIvfyuT3boj.png",
            "name": "Walt Disney Pictures",
            "id": 2,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Mulberry Square Productions",
            "id": 14538,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Silver Screen Partners III",
            "id": 554,
            "origin_country": ""
         }
      ],
      "release_date": "1987-06-17",
      "vote_average": 6.5,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "The Benji Collection",
         "id": 424830,
         "poster_path": null
      },
      "tagline": "Benji's Back! In the most exciting adventure of his life!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Joe Camp"],
      "runtime": 88,
      "synopsis": null,
      "writers": ["Joe Camp"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0092638/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI0MDU1MTY5Nl5BMl5BanBnXkFtZTcwNTkxODMzMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Red Steagall, Frank Inn, Benjean | See full cast and crew »"],
      "reviews": [
         "It's been years and years since I've seen this one but I remember it very fondly. Perhaps one of neatest things about the movie is that there is little to no dialog so we don't have to worry about horrible actors. Benji is great. He is extremely convincing when he stops to ponder various situations like when he knows his owner is nearby but he decides against going home right away. I just happened across the page for Benji but now that I have, I think I need to get to Blockbuster to pick this one up. I highly recommend.",
         "This is a film appreciated most by those who enjoy nature and animals. There is little speaking in the film as the star of the film is Benji, and he is lost in the wild and away from humans. (There is maybe a minute or two of dialogue at most in the entire film.) This film entirely focuses on Benji and some wild kittens that he takes care of in the wild and tries to keep from danger. It's a cute film, but it also shows us the not-so-cute side of nature when some of the kittens end up in fatal situations. A touching film, Benji the Hunted will be enjoyed by children and it sends a good and honest message to us about nature and survival.",
         "Truly truly remarkable filming ....would love to know how they got a male dog to cart around wild baby cougar kittens...totally fascinating! To see how they made this film would be awe inspiring! Many direct tv stations are now showing this film...its about time...the music alone is fantastic and right in rhythm with the events in the film. Benji is trained superbly!!...need more films like this....",
         "I remember seeing the first two Benji movies as a kid, but when this came out, I was in high school and didn't have an interest in seeing it during that time in my life. Just now watched this on DVD, twenty years later after it was released in theaters, and I can honestly say that my girlfriend and I truly enjoyed this movie. Some of the peril might be a little upsetting for small children or sensitive viewers, but it simulated drama that was more compelling than the first two Benji movies. The first movie will always be a classic, but this movie seemed to be more effective, probably due to the setting and the plot. Having less cheesy human dialog like the first two movies had was refreshing as well. Just letting the animals \"act\" made for an enjoyable movie watching experience. Anyone who is an animal lover will really love this movie! I highly recommend it!",
         "Our great K-9 Friend and Rescue Helper Benji is on his way to the forest to help bring a mountain lion's cubs back together again. But on the way, Benji faces the lion, birds and a killer wolf on his persuit. This disney movie is great for the family and not to be missed and a great award to Director Joe Camp and Benji himself. Astonising Forest Photography!",
         "A simple comment: This is the earliest film I remember crying to. And being young at the time, along with owning my dear old dog Candy, it truly plucked some heart-strings. I should've taped it 'cause I long to watch it again. I might get another dog and name him Benji in tribute to his huggable hound.",
         "I'm 20 and this film just came on the day after Boxing Day, it looked like a cute easy-going Incredible Journey sort of thing so me and my Mum settled down to watch it and we were just blown away. I'd never heard of Benji so there weren't any expectations although it made it harder to understand the beginning. But I wish I'd seen something like that when I was a kid, and I don't care how different films are in the future - when I have children I will DEFINITELY sit them down to watch Benji the Hunted! The acting was frankly astonishing for a dog, and I laughed out loud when the little dark kitten went up to the bear and tried to growl. How they got a small male dog to run up and down and even climb cliffs with cougar cubs in his mouth I will never know. In short, a 20 year old and a 49 year old give this movie 4 big thumbs up and even Dad watched it all the way through, although he'd never admit to liking it",
         "a number of times. Just happened to come upon again this past weekend and I was really not in the mood for a tear jerker, but I sat back and watched it again. What a wonderful film. The dedication that went into the training of these animals and the time it must of took. This film tells a wonderful story of a mutt with love in his heart and the courage to take over a situation that would be very hard for the rest of us to do. Some of us can't take care of and protect our own children sometimes, imagine getting four more kids added onto your waist belt and then having to protect them from predators that walk on four legs with giant fangs or slide upon the ground in quiet with poison in their mouths. Never mind the two legged predators you would have to deal with. Then there is Mother Nature and the other elements of the forest to worry about. Then food - oh my goodness. This little dogs heart is the size of the Earth. Thank you Benji. Thank you for teaching me a little something for when I have kids.",
         "Benji the Hunted is a movie that will surely bring a warm joy to animal lovers. The biggest strength of the movie is the detailed portrayal of emotions by the animal star-cast. It is nearly impossible to miss the perfection with which director Joe Camp captures even tiny details like the trembling legs of cougar kittens that followed Benji, the innocence of their faces, or even their spontaneous playful nature. The movie is not about Benji performing breath-taking complicated maneuvers to save the day, rather how Benji faces the day-to-day challenges of living in the wild with the added responsibility of four orphaned cougar kittens. The challenges of the wild are plentiful, enough to keep your eyes hooked to the screen. Yet it's not a fast-paced thriller which would have cost the movie its credibility as a realistic one. The human actors in the movie have very limited role, and the director wastes no time in bundling them out of limelight. Benji again emerges as a hero, showing a big \"human\" heart, and the message of peace and non-violence is very effectively communicated in the movie. The background score is average, yet does its job efficiently by not distracting the audience from the movie. It is a family movie suitable for all age groups, and a recommended watch for all animal lovers.",
         "As with the first two adventures the performance of Benji in this movie is amazing. What's more the makers have a bigger budget so the set pieces involving wild animals and the photography throughout is really sensational. Again this film got largely ignored - which is truly a shame."
      ],
      "genres": [
         "Adventure",
         "Family"
      ],
      "productionCompanies": [
         "Embark Production",
         "Millenium Productions",
         "Mulberry Square Productions"
      ],
      "summaries": [
         "In this children film Benji the Hunted, the show dog Benji is lost at sea and winds up in the wilderness of Oregon to fend for himself. Benji's one and only plan is to get back into his master's arms as soon as possible, until he finds four orphaned cougar kittens whose mother was shot by a hunter. Now his ultimate task is to get the four orphaned kittens into the care of another mother cougar with her single child while avoiding the threatening animals of the wild.",
         "Benji is left in the wilderness after an accident - can he survive ?"
      ],
      "budget": 0
   },
   "movielensId": 3673,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1987-06-17",
      "dvdReleaseDate": "2006-01-17",
      "directors": ["Joe Camp"],
      "runtime": 88,
      "movieId": 3673,
      "title": "Benji the Hunted",
      "mpaa": "G",
      "actors": [
         "Red Steagall",
         "Frank Inn",
         "Nancy Francis"
      ],
      "imdbMovieId": "0092638",
      "originalTitle": "Benji the Hunted",
      "genres": [
         "Action",
         "Adventure",
         "Family"
      ],
      "youtubeTrailerIds": ["A2stGtYoHBM"],
      "plotSummary": "Benji has become stranded on a remote island after a boating accident. He finds himself struggling to survive in the wilderness, avoiding close encounters with a wolf, a bear, and a territorial female cougar with her cub.",
      "tmdbMovieId": 21299,
      "avgRating": 2.35135,
      "releaseYear": "1987",
      "numRatings": 259,
      "posterPath": "/1n9BSkRe6j57oXkC1Kl64ki3As2.jpg"
   }
}