{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0076044",
      "video": false,
      "title": "For the Love of Benji",
      "recommendations": [
         36790,
         23069,
         19667,
         44415,
         72185,
         21299,
         41017,
         120811,
         19962,
         16355
      ],
      "backdrop_path": "/tWRquOHOmZqp0SOkUUVzVgVbhFn.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Benji",
               "gender": 1,
               "credit_id": "5aad384792514116ba0125ec",
               "name": "Benjean",
               "profile_path": null,
               "id": 1726956,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Mary",
               "gender": 1,
               "credit_id": "52fe46e29251416c91062e17",
               "name": "Patsy Garrett",
               "profile_path": null,
               "id": 186336,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Cindy",
               "gender": 1,
               "credit_id": "5aad39040e0a2678270138c7",
               "name": "Cynthia Smith",
               "profile_path": null,
               "id": 1172555,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Paul",
               "gender": 0,
               "credit_id": "52fe46e29251416c91062e1f",
               "name": "Allen Fiuzat",
               "profile_path": null,
               "id": 1152492,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Chandler Dietrich",
               "gender": 2,
               "credit_id": "5aad392e92514116c00131b5",
               "name": "Ed Nelson",
               "profile_path": "/RxxXeybdcHGQ6iZRrsXeqVapr7.jpg",
               "id": 89040,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Stelios",
               "gender": 0,
               "credit_id": "52fe46e29251416c91062e1b",
               "name": "Art Vasil",
               "profile_path": null,
               "id": 1152490,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Ronald",
               "gender": 2,
               "credit_id": "5aad396092514116b4012f43",
               "name": "Peter Bowles",
               "profile_path": "/hNwYfBMeGG1bYnuWOODogRnw7Ax.jpg",
               "id": 15202,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Elizabeth",
               "gender": 1,
               "credit_id": "5aad39710e0a2678210131a3",
               "name": "Bridget Armstrong",
               "profile_path": null,
               "id": 1357270,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Man in Baggage Room",
               "gender": 2,
               "credit_id": "5aad39db92514116ba0127a6",
               "name": "Mihalis Lambrinos",
               "profile_path": null,
               "id": 2000358,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46e29251416c91062e09",
               "name": "Joe Camp",
               "profile_path": "/uSNPVWav5HxwxD2CxYL0t74RBHm.jpg",
               "id": 94787,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46e29251416c91062e0f",
               "name": "Joe Camp",
               "profile_path": "/uSNPVWav5HxwxD2CxYL0t74RBHm.jpg",
               "id": 94787,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5aad3bd7c3a36846d5012a48",
               "name": "Don Reddy",
               "profile_path": null,
               "id": 1377230,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5aad3d0d92514116b1012f0f",
               "name": "Joe Camp",
               "profile_path": "/uSNPVWav5HxwxD2CxYL0t74RBHm.jpg",
               "id": 94787,
               "department": "Writing",
               "job": "Original Story"
            },
            {
               "gender": 0,
               "credit_id": "5aad3d2f92514116c0013615",
               "name": "Ben Vaughn",
               "profile_path": null,
               "id": 1844920,
               "department": "Writing",
               "job": "Original Story"
            },
            {
               "gender": 0,
               "credit_id": "5aad3d6392514116ba012b61",
               "name": "Ben Vaughn",
               "profile_path": null,
               "id": 1844920,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Family",
         "id": 10751
      }],
      "popularity": 0.707167,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 38802,
      "vote_count": 10,
      "budget": 0,
      "overview": "Benji is lost and becomes a stray animal in Athens, Greece, trying to reunite with his family while secret agents pursue him, trying to get a formula which was glued to his paw in order to get it past customs.",
      "similar": [],
      "original_title": "For the Love of Benji",
      "runtime": 85,
      "poster_path": "/na5DeUyQ1IijbFYsJCpF3HODRSV.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "ελληνικά",
            "iso_639_1": "el"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Mulberry Square Productions",
         "id": 14538,
         "origin_country": ""
      }],
      "release_date": "1977-06-10",
      "vote_average": 5.4,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "The Benji Collection",
         "id": 424830,
         "poster_path": null
      },
      "tagline": "The world's most huggable hero.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Joe Camp"],
      "runtime": 85,
      "synopsis": "While en route to a vacation in Greece with his family, a passenger \"borrows\" Benji for just long enough to tattoo a mysterious message on his paw. Separated from family in Athens, Benji finds himself on the run from an assortment of international spies searching for the message in another exciting Benji adventure.",
      "writers": [
         "Joe Camp",
         "Joe Camp"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0076044/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ0NTEzNzQxOV5BMl5BanBnXkFtZTcwMTg0NTYyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Patsy Garrett, Benji, Art Vasil | See full cast and crew »"],
      "reviews": [
         "I enjoyed For the Love of Benji. It was a cute, fun movie. A Good, Clean Family Film by Joe Camp. I actually liked this, the second Benji film, better than the first one. The plot here was pretty much laughable, but Benji movies aren't about that, they're about letting Benji charm. And that he does. A very good performance here by Benji. You'll laugh, but the dog's work is literally better than a Steven Segal performance I had the misfortune of seeing recently. Also, the film has nice music and lots of pretty Greece scenery. It may help to have seen the first Benji to familiarize yourself with some of the characters. Check it out and Have a Doggone Good Time! (Sorry :)",
         "This is the ultimate family movie!! Benji, Super Dog extraordinaire, makes a howling appearance in this Ameri/Greek movie. The family goes to vacation with their two dogs in Greece. Along the way, Benji gets implanted with a secret code by the evil Chandler Dietrich. Chandler befriends the family knowing that, without their trust and friendship, he won't be able to smuggle Benji away from them at the right time. What Chandler doesn't plan on is Benji getting lost en-route to Crete!! Anyway, the film goes on sharing the antics of this tiny little dog-without-a-breed and casts him as a hero. To find out what happens to Benji and his adorable family, you'll just have to watch! Benji movies are so much fun for children. If you have a pet in the family, whether a dog, cat, bird or hamster, your children are guaranteed to appreciate them more after seeing this film. There is no nudity, no hard-core language (in fact no swearing at all that I can remember), no violence, and no yucky stuff. It is a class A children's movie. Enjoy it with some popcorn and with Fido sitting close at hand!!",
         "What a great movie. No action, no swearing, no gore, just a wonderful family movie with that lovable dog, Benji. The story seems unlikely and impossible, but who cares? I don't. It makes you appreciate whatever pet you have. Wheter it be a dog, a cat, a bird, a fish, etc. Like other Benji movies, his one is fun to watch and should be seen with the family, including the family pet. Thumbs up!",
         "Benji, that adorable dog, is supposed to be in a happier situation after the first film. He is a beloved family member and a pampered pooch. When some family members decide to go to Greece, Benji gets to go along. However, there are doggynappers lurking nearby and Benji is almost seized upon. But, being the brilliant dog that he is, Benji manages to escape their clutches and begin exploring a lovely city in Greece and its surroundings. He helps himself to a bit a Greek pasta at a restaurant and has a close call with a Doberman, among other things. Will he be able to find his way back to his family? If you love dogs and family films, this is a good choice. It is mostly Benji on the loose in Greece, where the scenery is a knockout, and where Benji gets in and out of one scrape after another. There are a few iffy passages, where guns are flashed and Benji is subjected to chloroform. However, this is mostly a little dog on the run in a charming movie. Families everywhere, for the love of Mike and Benji, please locate this one for an entertaining evening of fun for your loved ones.",
         "This second film consists mostly of scenes of Benji running. That doesn't have to be a bad thing. The first Benji film consisted mostly of scenes of Benji running, too, but it was quite good. This follow-up isn't as good, but for other reasons. On the positive side, returning writer/director Joe Camp stuck with something unusual that he did in the first film--he did the film from a dog's point of view. That doesn't mean that the film is in first person from Benji's perspective. Imagine more a dog directing. The content, kinds of shots and kinds of angles are mostly what a dog might do. It made the first film, with its very unusual structure, a success, and it more or less makes this one, which also has an unusual structure, well, not exactly a success, but it makes it \"kinda work\". A couple factors bring the success rate down a bit. The story takes place in Greece this time--in a move that seems like maybe the crew and cast wanted a paid vacation in Greece--and a lot of dialogue is in Greek, without subtitles. Although interesting for adults, that's a particularly odd move for a family film, and the goal here is definitely to make a family film--Camp even announces this at the very beginning on screen. Also odd for a family picture, most of the human-sourced interaction in the film features people attacking or chasing Benji--with chloroform, with meat cleavers, with fruit, with a big mean Doberman, and with guns. Not that it's graphic in any way, but the concept is there, and Benji's running is mostly precipitated by unfriendly people chasing him. There is a complex plot involving scientific research, where they want to use Benji for nefarious goals, and where Benji seems to be world-famous, all of which is never explained very well. Heck, most of the dialogue about this is in Greek, although the science-oriented stuff is very sketchily explained in English at the end. Benji being so well-known is never explained. And a final problem--even though the first film was also as if directed by a dog, there were important human characters who had some depth to them. That's not the case here. Benji's owners are hardly in the film and the villains are almost completely non-developed the short amount of time that they're in the film. So we're left primarily with Benji running and running through Greece. Through airports. Through the city streets. Just outside of the city near some ancient ruins. The scenery is nice and nicely shot, Benji does some neat trained actions, and insofar as Camp explores everyday dog stuff, the film is rewarding. Heck, the chased-by-villains scenes are pretty rewarding, too, even if plotwise, you don't know exactly what's going on or why it's going on. This may be the worst Benji film (and I don't know yet, since I'm just rewatching them now after not seeing them for many years), and it may not be a great film for kids for a couple reasons, but it is still very mildly recommendable, especially for fans of Benji films and animal films in general, or for anyone who wants a glimpse of what Greece was like in 1977. It's also amusing to note how much Benji looks like Ron Wood.",
         "This movie is amazing, I really love it. But I have to admit the first Benji is the best because it was so original and sad and has such a great story line to it, but the second one is not far behind it's first. This is the kind of movie, just like the first Benji, that makes you think of things, it makes you stop and forget about all your worries and cares, it lets you just watch the dog and live his life in the movie. I had a tear run down my face when the part came on, when Benji saves Cindy, and those flashbacks he's had. This dog had a real talent in the movies, the way he showed his emotions and just the way he is. This movie leaves a big impacted on you once you see it, it's called the spirit on Benji.",
         "I have given this film a 7. My Dad would take me to the video shop once a week and I would, without fail, come home with 'For the love of Benji' I loved this film and have fond memories of it. It is clever as it was one of the first films made from a dogs point of view. It showed how intelligent and perceptive dogs are - they know good people from bad people almost instantly. It also shows how sly, cunning and resourceful they can be when made to fend for themselves. It did have a few heartstring pulling moments, when Benji is generous with today's spoil.. being separated from loved ones and reunited again. I think children today would still enjoy this film.. regardless of the amount of running Benji does.",
         "This movie uses the same plot devices and cinematography as the first one, but it has a lot of long, pointless sequences that make it drag on. The first one had a lot of action/reaction on the part of the dog, in part because the dog was more aware of what was going on. In this one, Benji is part of an intricate plot that not even the audience understands until the end. Obviously Benji acts in ways natural to a dog in a strange place, but he doesn't get much chance for heroics until the very end. All in all, I still like this film, but I just don't like it as much as the original.",
         "As many of these other reviews have stated that a lot of the footage of this film is Benji running, it's true and it is really boring. Who wants to watch a mutt run through the streets of Greece for an hour? My family watched this movie together and my brother, who is 8 and loves animals dearly, even admitted that the movie was terrible! I do not see how these other people would want to watch this movie. Kids will not like this movie because nothing happens! But at least it is not Borat or whatever . . . Other people have said that this movie is kid friendly, wrong! At the end of this movie people are held at point blank range with all sorts of guns by mafia like hit-men. This Movie is really bad!",
         "Gore Vidal's \"For The Love Of Benji\" takes us on what should have been an energetic romp through the eyes of a lovable cocker spaniel with the heart of a freeze-dried artichoke. Instead, what we get is a thinly-disguised rant on the oppression visited upon our four-legged friends by corrupt politicians, corporate CEOs, and alien sex predators. PETA take note! Not since \"Myra Breckenridge\" has Raquel Welch been so radiant and yet so absent from the screen. Interestingly enough, Tom Cruise does NOT appear in this film either. The film score, however, is reminiscent of \"Ears Wide Shut\", the film Kubrick would have made if cameras had been unavailable."
      ],
      "genres": [
         "Adventure",
         "Comedy",
         "Drama",
         "Family"
      ],
      "productionCompanies": ["Mulberry Square Productions"],
      "summaries": ["Benji sniffs out a bogus CIA agent in Athens, Greece."],
      "budget": 0
   },
   "movielensId": 3674,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1977-06-10",
      "dvdReleaseDate": "2004-08-17",
      "directors": ["Joe Camp"],
      "runtime": 85,
      "movieId": 3674,
      "title": "For the Love of Benji",
      "mpaa": "G",
      "actors": [
         "Patsy Garrett",
         "Art Vasil",
         "Allen Fiuzat"
      ],
      "imdbMovieId": "0076044",
      "originalTitle": "For the Love of Benji",
      "genres": ["Family"],
      "youtubeTrailerIds": [],
      "plotSummary": "Benji is lost and becomes a stray animal in Athens, Greece, trying to reunite with his family while secret agents pursue him, trying to get a formula which was glued to his paw in order to get it past customs.",
      "tmdbMovieId": 38802,
      "avgRating": 2.56798,
      "releaseYear": "1977",
      "numRatings": 228,
      "posterPath": "/na5DeUyQ1IijbFYsJCpF3HODRSV.jpg"
   }
}