{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "indigenous",
            "id": 1551
         },
         {
            "name": "time",
            "id": 3667
         },
         {
            "name": "community",
            "id": 5890
         },
         {
            "name": "prayer",
            "id": 6157
         },
         {
            "name": "spirituality",
            "id": 10706
         },
         {
            "name": "pagan",
            "id": 155071
         }
      ],
      "imdb_id": "tt0103767",
      "video": false,
      "title": "Baraka",
      "recommendations": [
         89708,
         11314,
         18493,
         20110,
         24348,
         216,
         3782,
         20108,
         11698,
         5991,
         16642,
         14537,
         5801,
         21925,
         934,
         37452,
         11712,
         631,
         12172,
         54146
      ],
      "backdrop_path": "/gwFQYtCNNU7ZjSfICTIoJxabKc9.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45c19251416c7506167b",
               "name": "Ron Fricke",
               "profile_path": "/8oQUhdKZV7uT53s0XRTCraFgntv.jpg",
               "id": 68994,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c19251416c75061681",
               "name": "Ron Fricke",
               "profile_path": "/8oQUhdKZV7uT53s0XRTCraFgntv.jpg",
               "id": 68994,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c19251416c75061687",
               "name": "Constantine Nicholas",
               "profile_path": null,
               "id": 83901,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c19251416c7506168d",
               "name": "Genevieve Nicholas",
               "profile_path": null,
               "id": 108787,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c19251416c75061693",
               "name": "Mark Magidson",
               "profile_path": null,
               "id": 937749,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c19251416c75061699",
               "name": "Alton Walpole",
               "profile_path": null,
               "id": 1018091,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c19251416c7506169f",
               "name": "Michael Stearns",
               "profile_path": null,
               "id": 48069,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c19251416c750616a5",
               "name": "Ron Fricke",
               "profile_path": "/8oQUhdKZV7uT53s0XRTCraFgntv.jpg",
               "id": 68994,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c19251416c750616ab",
               "name": "Mark Magidson",
               "profile_path": null,
               "id": 937749,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c19251416c750616b1",
               "name": "David Aubrey",
               "profile_path": null,
               "id": 1021139,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c19251416c750616b7",
               "name": "Ron Fricke",
               "profile_path": "/8oQUhdKZV7uT53s0XRTCraFgntv.jpg",
               "id": 68994,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c19251416c750616bd",
               "name": "Mark Magidson",
               "profile_path": null,
               "id": 937749,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 5.700375,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 14002,
      "vote_count": 188,
      "budget": 4000000,
      "overview": "This is a paralyzingly beautiful documentary with a global vision: an odyssey through landscape and time, that is an attempt to capture the essence of life.",
      "similar": [
         5876,
         310,
         145,
         13107,
         30998,
         32600,
         15691,
         4887,
         463814,
         211086,
         505227,
         138357,
         51270,
         169237,
         279741,
         149229,
         222385,
         135317,
         460692,
         262897
      ],
      "original_title": "Baraka",
      "runtime": 96,
      "poster_path": "/5ZNf6N5rtLYotZKi03QXqJ3FuvD.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Magidson Films",
         "id": 10986,
         "origin_country": ""
      }],
      "release_date": "1992-09-15",
      "vote_average": 8.1,
      "belongs_to_collection": null,
      "tagline": "A world beyond words.",
      "adult": false,
      "homepage": "http://en.wikipedia.org/wiki/Baraka_(film)",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Ron Fricke"],
      "runtime": 96,
      "synopsis": null,
      "writers": [
         "Ron Fricke",
         "Mark Magidson"
      ],
      "originalLanguage": null,
      "imdbLink": "http://www.imdb.com/title/tt0103767/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI1NzUyNzU0NV5BMl5BanBnXkFtZTcwMzAxNTEzMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": [],
      "reviews": [
         "It is perplexing to read a few comments below that rubbish this film. To me, and to so many others, it is unequaled in it's beauty, sensitivity and deep spiritual perception into this amazing world that we inhabit. Really, I think if anyone watches this film and cannot feel uplifted to the heavens, then they must be spiritually deadened by cynicism and negativity. Even without DVD and the big screen, we have enjoyed repeated viewing of this EXCEPTIONAL film. I first saw it in Sydney, in Panavision's huge screen, and was totally blown away by the cinematography as well as the profoundly moving music. But even on VHS here at home, it touches me ever so deeply. 10 out of 10. An incredible experience!!",
         "Baraka is an ancient Sufi word, translated as a blessing or as the essence of life from which the evolutionary process unfolds. With the theme of man's diversity and his impact upon the environment, Baraka is a documentary photographed on six continents in 24 countries including Tanzania, China, Brazil, Japan, Nepal, the U.S. and Europe. It has no story and no dialogue, yet transcends geography and language to provide a sensual and spiritual experience that enables the viewer to look at the world in a totally different way. When the film opens, a lone snow monkey sits in the middle of a hot spring, biding its time. The expression on its face is one of deep reflection and weariness. When it looks up at the stars, then closes its eyes, shutting itself off from its surroundings, I sensed my own inner longing for the infinite. As the film progresses, we see the edge of a volcano in Hawaii, the Church of the Holy Sepulcher in Jerusalem, the Ryoan-Ji temple in Kyoto, Lake Natron in Tanzania, and the fire plains of Kuwait, their oil fires burning after the 1991 Gulf War. Through Fricke's camera, we glimpse various forms of religious expression from the chanting of monks to tribal celebrations in Africa and Brazil. Baraka is almost like an updated version of Godfrey Reggio's 1983 film, Koyaanisqatsi. Using speeded-up images of hectic big city life with its homelessness and deprivation, interspersed with mountain vistas and forests, it depicts the mechanical nature of modern life as contrasted with the beauty of the natural world. This film allowed me to see things I never knew existed, and to glimpse patterns of interconnectedness and a sense of balance and proportion in the world I was barely aware of. I was moved to simply look into people's faces and have them look back at me, allowing me to connect with the universality of the human spirit. Fricke has said that Baraka was intended to be \"a journey of rediscovery that plunges into nature, into history, into the human spirit and finally into the realm of the infinite.\" Unique in its beauty, sensitivity, and perception, Baraka succeeded, in the course of 90 minutes, in moving me from the humdrum of everyday reality to a calmer and more spiritual space",
         "When I first experienced (that's the most striking word for it) this movie at the Gothenburg Film Festival 1994, I was truly amazed. Never before - or since - have I had such an over all explain-it-all feeling after a show. Ron Fricke has made a documentary about the World today for a day: starting at dawn with monkeys in hot springs in Japan, and the morning rituals of various religions. This is followed by the awakening of the human race, both in the big cities and on the country side. Brilliantly edited together follows every aspect of human daily life combined with the general changes of the planet itself and all the ecological systems upon it. The over all glue of the story are the various religious rituals. Maybe this is my personal interpretation, being a teacher of Religion, but the only time giver, except for the turning of the sun, are the praying times and times of worship peoples practice around the globe. My comparison of the film to the GAIA idea (that the Earth as a whole being a unit, a living organism) is detectable both in the way every different cultures shown are found to be very similar to one another, as well as the speeded up people at side walks and zebra crossings look very much like the stream of blood in the veins of an organism. All in all this is a marvellous movie pointing out both the uniqueness of the individual and the unity with all people. Go see it - now!",
         "To do describe this work of art simply as a \"movie\" would be inaccurate and unjustified. More akin to a tone poem Baraka is. Is this what the world would look like to a god, a being who experiences time differently than we do? While Koyaanisqatsi effectively drilled its message, \"Humans are destroying the planet!\", into our hypnotized minds, Baraka lets you ponder and meditate its multiple meanings. Are humans just another part of the ecosystem, behaving as any other organism would with our capabilities? Or are we different, even alien, to this world? 10 out of 10.",
         "'Baraka' is a work of art which rates amongst the greatest achievements in the field. As with any masterwork, it is something one will have to pursue. For those that seek it out at the proper time, 'Baraka' can act as a milestone of revelation. What the viewer takes from this film will solely be determined by the life experience they bring to it. 'Baraka' is unique in that it actually requires a commitment of time and concentration. This is a film that communicates its message without utilizing standard film language. Those that try to make the images conform to the conventional notions of Hollywood story telling are likely to give up in frustration. For a film with no plot,characters or dialog, it communicates an astonishing number of profound themes. Those who are familiar with National Geographic or the works of David Attenbourough will have little trouble in identifying the fascinating locals and tribes, but be forewarned: there are reasons that there are no subtitles or text on screen. Personal discovery is at the heart of the filmmaker's intentions. The ambient soundtrack by Michael Sterns weaves the images together on a separate plain, producing a hypnotic pathway for the images to flow. Once you allow yourself to be pulled along by this current of sound the images will link themselves together and the true revelations hidden within 'Baraka' will make themselves apparent. You may find as I did that your subconscious will be at work on 'Baraka' for many weeks after the experience, unlocking doors to a greater understanding.",
         "Very few movies can actually be truly inspirational. A lot of movies make you feel good while watching it. This is different. This movie can breathe life back into your soul. It will brighten your outlook. It will make you think and keep you thinking long after the movie has ended. And even the most bitter of cynics (like me) cannot deny it's beauty. It will always remain one of my favorites. I cannot make it my favorite movie since it is so powerful and different I don't consider it a movie but an experience. It requires just a smidge of patience to suck you into it. But once it does you cannot avert your eyes. The most spectacular images ever. Not an ounce of pretention to it. No hollwood bull. Brilliant. Moving music. Do not miss this!!!! If you have a DVD buy this one. Watching it on a small screen will severely cut it's impact.",
         "This for me is the film for a desert Island...you know?...If you could only take, one book, one wine, one loaf of bread, one piece of music? One Lover, Well, this would be my one movie....This film in my opinion is so extraordinary that it needs as special 11 or 12 category, just as J.S. Bach, and Dickens, and Shakespeare would need such a category. This film is spellbinding and can be viewed and understood on many levels. I do not personally see or feel the \"Environmental\" message from this film that many do....or at least to me it is only one of many sub- texts....I do see an oil painting placed directly on my soul, or rather etched there by the sinews of this film, as a comment on man, all of his glory and wisdom, and all of his failings as well....that and so much more. For me this is the greatest film of all times. Nothing else even comes close...I could go on but I won't....to what end....if you have seen it and you wish to discuss it. write to me, I would be happy to hear from you on this wonderful film..",
         "During the 96 minutes, I feel like a bird crossing time and space. I was amazed by the images and the camera technique. For just a few second images, the filmmaker have to overcome how many difficulties! What a spectacular job! Moreover, the questions it brings to me strike me, and it makes me rethink about the human life. The contrast between the worlds and the cultures punch me so hard. This movie is absolutely in my collection.",
         "Simply one of the most beautiful films you will ever see. If it's near you on the big screen, you must not miss it. Otherwise, pour a glass of wine, sit closer to the TV than your Mom would prefer, and drop in. Welcome to the world as it is in real, bigger-than-life images of humanity, and all the colors of the spectrum. It moves a bit slowly, but you'll want for more.",
         "I think this is one of the finest movies that I've ever seen. There are times that I don't exactly understand the movie, but that's OK. I saw this movie on the big screen for the first time (and this is a movie where it truly makes a difference to see it on the big screen). My friend and I got out of the movie and said, \"Can you believe what we just saw?\" I think it is one of the most beautiful movies that I've ever seen. One can argue whether the point that the director was trying to make was made or even needs to be made. I don't know. I just know that at the end of the movie, I was overwhelmed."
      ],
      "genres": [
         "Documentary",
         "War"
      ],
      "productionCompanies": ["Magidson Films"],
      "summaries": [
         "Without words, cameras show us the world, with an emphasis not on \"where,\" but on \"what's there.\" It begins with morning, natural landscapes and people at prayer: volcanoes, water falls, veldts, and forests; several hundred monks do a monkey chant. Indigenous peoples apply body paint; whole villages dance. The film moves to destruction of nature via logging, blasting, and strip mining. Images of poverty, rapid urban life, and factories give way to war, concentration camps, and mass graves. Ancient ruins come into view, and then a sacred river where pilgrims bathe and funeral pyres burn. Prayer and nature return. A monk rings a huge bell; stars wheel across the sky.",
         "A collection of expertly photographed scenes of human life and religion."
      ],
      "budget": 2000000
   },
   "movielensId": 3677,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1992-09-15",
      "dvdReleaseDate": "2000-01-25",
      "directors": ["Ron Fricke"],
      "runtime": 96,
      "movieId": 3677,
      "title": "Baraka",
      "mpaa": "G",
      "actors": [""],
      "imdbMovieId": "0103767",
      "originalTitle": "Baraka",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [
         "QcVmt5je88M",
         "XEb1iZ2JYHI",
         "ZSfFHxyYJJA"
      ],
      "plotSummary": "This is a paralyzingly beautiful documentary with a global vision: an odyssey through landscape and time, that is an attempt to capture the essence of life.",
      "tmdbMovieId": 14002,
      "avgRating": 4.07184,
      "releaseYear": "1992",
      "numRatings": 1900,
      "posterPath": "/5ZNf6N5rtLYotZKi03QXqJ3FuvD.jpg"
   }
}