{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "punk",
            "id": 4470
         },
         {
            "name": "midnight movie",
            "id": 11487
         },
         {
            "name": "subculture",
            "id": 155418
         },
         {
            "name": "punk band",
            "id": 173919
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0082252",
      "video": false,
      "title": "The Decline of Western Civilization",
      "recommendations": [
         36724,
         44848,
         16149,
         42082,
         16301,
         36746,
         41426,
         46697,
         332806,
         34787,
         328246,
         14108,
         18984,
         280640,
         20511,
         16018,
         13125,
         18181,
         13124,
         25795
      ],
      "backdrop_path": "/hQzBPpjFz46AkaKK6Kshd04dPHg.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "talisencrw",
         "id": "5699762d92514119390003a4",
         "content": "Though I both am neither a punk aficionado (I have seen X live in Detroit in 2008) nor an expert on Spheeris' films (I have seen and enjoyed both 'Wayne's World' and 'Little Rascals'), this was very satisfying. The energy and spirit of these rebellious youths really comes across well, and the clever assertion from one of the interviewees that punk is simply another form of folk and protest music, albeit with different instruments and at a faster speed, rings true. Though I'm not privy to the Los Angeles scene (I'm from Windsor, Ontario, for crying out loud), it appears to be quite an accurate depiction, although it doesn't seem to grab hold, perhaps, of the underground movement. Seeing this, I look forward to the latter two parts of the trilogy, and only wish over the years that Spheeris had expanded her sights, and made documentaries of other, vital, forms of music in L.A., such as folk, hip-hop, rap, jazz, classical, experimental, even soundtrack work for films, since Hollywood is right nearby, and as someone already part of the filmmaking scene, she would have had access to some of the greats of our time.",
         "url": "https://www.themoviedb.org/review/5699762d92514119390003a4"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "",
               "gender": 0,
               "credit_id": "5606a6d0c3a3681205001d2d",
               "name": "Alice Bag",
               "profile_path": null,
               "id": 1515136,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 2,
               "credit_id": "5606a6d89251413055001d2a",
               "name": "Claude Bessy",
               "profile_path": null,
               "id": 1515139,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 0,
               "credit_id": "5606a6e3925141305e001c56",
               "name": "Black Flag",
               "profile_path": null,
               "id": 1515140,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 2,
               "credit_id": "5606a6eb9251413050001bee",
               "name": "Don Bolles",
               "profile_path": null,
               "id": 1112126,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 1,
               "credit_id": "5606a6f39251413052001c85",
               "name": "Dinah Cancer",
               "profile_path": null,
               "id": 1515141,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 1,
               "credit_id": "5606a6fc9251413050001bf0",
               "name": "Exene Cervenka",
               "profile_path": "/rbJ35lboWdbN23uglG28nTdy3I2.jpg",
               "id": 939873,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "",
               "gender": 0,
               "credit_id": "5606a708c3a368120d001d3f",
               "name": "Circle Jerks",
               "profile_path": null,
               "id": 1515142,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "",
               "gender": 0,
               "credit_id": "5606a7129251413052001c8d",
               "name": "Philo Cramer",
               "profile_path": null,
               "id": 1515143,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 2,
               "credit_id": "5606a71c9251413064001c4d",
               "name": "Darby Crash",
               "profile_path": "/iM4l1HaAz1WkQTosDPW82PBdWbf.jpg",
               "id": 1112128,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "",
               "gender": 0,
               "credit_id": "5606a72f9251413050001bf3",
               "name": "John Doe",
               "profile_path": "/yqhUUEK3PUikmAKnhgzwxT80nU3.jpg",
               "id": 545113,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "",
               "gender": 0,
               "credit_id": "5606a737c3a3681218001c38",
               "name": "Lorna Doom",
               "profile_path": null,
               "id": 1112129,
               "order": 12
            },
            {
               "cast_id": 14,
               "character": "",
               "gender": 0,
               "credit_id": "5606a7419251413050001bf8",
               "name": "Frank Gargani",
               "profile_path": null,
               "id": 1515144,
               "order": 13
            },
            {
               "cast_id": 15,
               "character": "",
               "gender": 0,
               "credit_id": "5606a752c3a368121b001b34",
               "name": "Fear",
               "profile_path": null,
               "id": 1515146,
               "order": 14
            },
            {
               "cast_id": 16,
               "character": "",
               "gender": 0,
               "credit_id": "5606a7a9925141305e001c71",
               "name": "Bill Gazzarri",
               "profile_path": null,
               "id": 1515147,
               "order": 15
            },
            {
               "cast_id": 17,
               "character": "himself",
               "gender": 2,
               "credit_id": "577c9e71c3a36840250030e1",
               "name": "Lee Ving",
               "profile_path": "/tG4MKdOp1viff4rrCbH8WQEhIE3.jpg",
               "id": 80745,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe440cc3a368484e00c79b",
               "name": "Penelope Spheeris",
               "profile_path": "/6MiXfO2EdA0keiJf0RmGNfLTvAc.jpg",
               "id": 58448,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "57a20febc3a3682eca0005a7",
               "name": "Penelope Spheeris",
               "profile_path": "/6MiXfO2EdA0keiJf0RmGNfLTvAc.jpg",
               "id": 58448,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "57a20ffc9251417873002b29",
               "name": "Jeff Prettyman",
               "profile_path": null,
               "id": 99500,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "57a21008c3a3682eca0005b7",
               "name": "Penelope Spheeris",
               "profile_path": "/6MiXfO2EdA0keiJf0RmGNfLTvAc.jpg",
               "id": 58448,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "57a210139251415ba90005b7",
               "name": "Steve Conant",
               "profile_path": null,
               "id": 1660857,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "57a2101fc3a3682e76000549",
               "name": "Charlie Mullins",
               "profile_path": null,
               "id": 1587392,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Documentary",
            "id": 99
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 2.660639,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 21137,
      "vote_count": 29,
      "budget": 100000,
      "overview": "The Los Angeles punk music scene circa 1980 is the focus of this film. With Alice Bag Band, Black Flag, Catholic Discipline, Circle Jerks, Fear, Germs, and X.",
      "similar": [
         858,
         112160,
         141,
         634,
         297762,
         437557,
         242224,
         27586,
         9762,
         118,
         254470,
         460793,
         243683,
         277216,
         43923,
         2011,
         8967,
         8810,
         6637,
         2288
      ],
      "original_title": "The Decline of Western Civilization",
      "runtime": 100,
      "poster_path": "/g4uQ5U8QDXtBM0hOn1URKE70NXd.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Spheeris Films Inc.",
         "id": 64233,
         "origin_country": ""
      }],
      "release_date": "1981-07-01",
      "vote_average": 7.5,
      "belongs_to_collection": {
         "backdrop_path": "/nK0xizt2zXIRjNmqko1JtpkDe43.jpg",
         "name": "The Decline of Western Civilization Collection",
         "id": 157671,
         "poster_path": "/Acr92rR6u9GnLMqN98BJYwcleLB.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Penelope Spheeris"],
      "runtime": 100,
      "synopsis": null,
      "writers": ["Penelope Spheeris"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0082252/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkzOTg3MzUxMl5BMl5BanBnXkFtZTcwMDg1OTM2MQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Alice Bag Band, Alice Bag, Claude Bessey | See full cast and crew »"],
      "reviews": [
         "When it comes to films on the L.A. hardcore scene of the late 70s/early 80s this is as good as it gets! It's very rare that cameras are around during the genesis of a music movement, and I will be forever grateful that Ms Sheeris was there to capture the beginnings of the LA hardcore scene that was growing out of the ideals and influences of the dying New York & London punk scenes. I was living on the East Coast at the time this film came out, and back then the only way to see some of these bands, without going to L.A., was to see this film. It was a rare event when one of these bands would pile into a van and head east on a tour, so to fulfill our love for the L.A. hardcore scene my friends and I would go see this film every few weeks. This is a great document of that time in music history. For people who liked this era of punk/hardcore music, here's a few other very similar documentary films you might want to check out... THE BLANK GENERATION - (70s New York punk - Johnny Thunders, Richard Hell, Ramones, Television, Patti Smith, etc...) THE PUNK ROCK MOVIE - (70s British punk - Sex Pistols, The Clash, X-Ray Spex, Eater, etc...) PUNK IN LONDON - (70s British punk - The Clash, The Adverts, The Lurkers, Subway Sect, etc...) D.O.A. - (70s American & British punk - Dead Boys, Generation X, Sham 69, Iggy Pop, etc... *contains a priceless interview with Sid & Nancy*) UK/DK - (80s British hardcore - The Addicts, The Exploited, The Business, UK Subs, etc...)",
         "One of the major successes to The Decline of Western Civilization, filmmaker Penelope Spheeris' indie breakthrough, is that it can perhaps appeal to non-punk fans as to the hardcore ones. More importantly, it captures a moment in history before the movement became completely \"market-worthy\", when bands would play (or, at the least, try to play in some cases) in dank, dirty clubs to an audience that had as much self-respect as they had respect for the bands. For the fan, such as myself, there are precious interviews with some of the quasi-legends of LA's punk-scum, some dead, some still living and still hard-working in the scene. Performances and interviews include the likes of The Circle Jerks, X, Black Flag (in the pre-Henry Rollins days), Catholic Discipline, Fear, the Alice Bag Band, and most memorable (in my opinion) being the Germs. While I knew of a few of the bands and performers in the film (The Jerks and Black Flag mostly), I had only heard rumors about lead singer (the late) Darby Crash, and from the footage in the film he seems to be one of the, if not the, epitomes of the punk movement. He doesn't take himself too seriously, he loves to drink, sometimes when he speaks it's complete gibberish, and the attitude he brings on stage is both funny and in a free-form way exhilarating. A performer like that would probably scare Steve Miller and Jackson Browne out of their skins. Decline of Western Civilization may not turn on every non-punk fan that seeks this film out (it's hard to find on video), but it shouldn't necessarily turn them off either. Like a kind of anthropologist that's sneaked into the party, Spheeris gets the behavior of these people down pat, their motives, their likes and hatreds, and the power that was their on and off-screen personas. A few of them almost come off as normal, some don't, but they're only offensive to those who aren't too open to things. On top of that, the film is a must-see to the kinds of kids that think they're punk fans just because they listen to Good Charlotte and Blink-182: if you want to get the real scoop on the movement and genre of rock you profess to love, give the pioneers a chance. A",
         "Here is a great movie. Now, first of all, I would like to say that I was born in the early 1980s. I really never knew, up-close and personal, what true punk rock was. Watching this film was like a history lesson of sorts. The music was great, good vintage rock n' roll from bands like Black Flag, Circle Jerks, X, etc. It seemed to me that with this film, Penelope Spheeris was trying to show people that these weren't all just stupid kids who were out to do drugs and kill people. Some of these punks really had some philosophies that they were working at behind their music. This seems most evident in the interview with Black Flag. I understand myself how a lot of people might view these bands' philosophies as under-developed and simple, but one must take into account that these were some pretty young people. Nowadays, as young as I still am, I find it refreshing to run into someone my age who understands in any way philosophical thinking. In this movie, the young people may seem a little half-baked in their philosophies, but you might keep in mind that most kids don't even get that far. I've met many full-grown adults who have not progressed as far with deep thought contexts as some of the punk musicians in \"Decline\". Another thing I loved about this movie was how funny it got at times. Some of these kids were total idiots, while the story about the dead painter was devilishly humorous. Fear's performance at the end topped it all. Even if punk is dead, it was once very alive. All flaws aside, \"The Decline of Western Civilization\" was made for people who can tell the difference between some suburban wimp with a mohawk and the truly intelligent individuals who were genuinely upset and picked up music instruments as weapons against the forces of the corporate.",
         "Everyone who's seen \"Decline\" knows how great it is. My favorite segments are those featuring Black Flag and Fear, because they're the funniest and the most visceral. Still, all the bands that actually STARTED the Los Angeles punk scene, apart from the Germs, are missing from this film. Where are the Weirdos, the Screamers, the Dils, and the Zeros? The Alice Bag Band is here, but they were better when they were simply the Bags. The Germs' segment is depressing. The very brief glimpses of Catholic Discipline were fascinating and made me wish that this band had at least recorded some demos. As a documentary, \"Decline\" is flawed...but it's indispensable, too. To find out about the bands this film didn't cover, read \"We Got the Neutron Bomb\" by Marc Spitz and Brendan Mullen. And to see what was going on in San Francisco right around the same time, get the much shorter (but equally brilliant) documentary \"Louder Faster Shorter\", directed by Mindaugis Bagdon. This twenty-minute burst of pure punk actually *does* feature the Dils--along with UXA, the Avengers, the Sleepers, and the Mutants.",
         "Kind of a guilty indulgence nowadays, this used to be required watching when i was in high school. It really is a great illumination of the burgeoning punk scene in LA in 1980. As the bands play, Spheeris prints the lyrics in subtitles, which is of course necessary if one really wants to know what the guy is screaming into the microphone. But also it turns the camera's POV into that of tourist, passing through this alien world. The band interviews reveal an honest approach to the music that really doesn't exist anymore. Then again, it's not as easy to come by $16/month former-church closets like Chavez of Black Flag does. How many unheard of bands do you know that aren't trying like the dickens to get a record deal? These guys just didn't care. And who can't love the commentary of the little French dude who used to be the \"singer\" for Catholic Discipline (of which Phranc was a member). His gritty voice delivers one of the best soliloquies ever captured on film: \"I have excellent news for the world ... there's no such thing as New Wave.\" Whew! What a relief!",
         "Spheeris debut must be one of the best music documentaries of all time. And as far as I know it's also the only one that focuses on the L.A. Punk Explosion of the early eighties. It's all there: not just great, great bands like Black Flag, Fear, X, the Germs, whose names may not mean much to you today, but whose influence on today's alternative rock music can not be over-estimated, but also the promoters, the media and first of all the audiences - the punks - all portrayed in a manner that makes you laugh, shudder and gasp with astonishment about the energy, the anger and the fury these youths put into their music. Where is that today? The eighties may have sucked big time when it cames to mainstream music, but the underground was rocking. If you need a proof for that, watch Fear's performance in Decline. Unmatched. Great film! How come this is not available on vid, LD or DVD? P.S. The follow-up Decline Pt. II is hilarious, too",
         "Before she made Wayne's World, Ms Spheeris documented the LA Punk scene with the kind of dead pan perspective that makes this the all time classic commercial punk rock documentary. Of course Target Video's concert footage of the Dead Kennedys or the Mutants live at a home for the insane are much better, but unless you live near Leather Tongue Video in San Francisco, you probably won't find those, so this one will have to do. Best Irony: Members of a famous X-Punk band tattooing each other on a dirty couch while apparently under the influence of some processed opiate are talking about how pot makes hippies so pathetically passive that someone would come in and kick the shit out of them and all they'd say is \"Bummer maaan.\" And then going on to a completely deadpan unemotional account of finding a dead guy in the back yard. Definitely the best insight into the whole era. Sure The Great Rock and Roll Swindle is fun, but this one shows the whole scene unflinchingly from a neutral angle. The camera is on and everyone becomes an actor on their own stage.",
         "Let start off by first saying that I have been a punk fan most of my life. I always kind of had a lack of respect for the LA scene of the early 80's, which The Decline of Western Civilization documents, with the exception of X and Black Flag, being more of New York and English punk guy. After I saw this movie that completely changed. The people shown may look like a bunch of idiotic, strung out kids who think they might accomplish something beyond street-Cree through their lifestyles, but it is a great display of hedonism at it's best, coupled with some fun, loud rock n roll. One of the best scenes, and actually most insightful, is the interview with Claude Bessy of Catholic Discipline, or 'Kick-Boy' as he was known to Slash magazine readers. Originally from France, he rants about punk like a dirty old Frenchman and clues in viewers to many aspects of the punk, or DIY, attitude to music, politics, and life in general. Darby Crash of the Germs comes off as a complete idiot most of the time, but the Germs' performance of Manimal is pretty decent, complete with a young Pat Smear. Black Flag's performance with Chavo Pederast on vocals (it was filmed a couple of years before Henry Rollins joined the band) is decent, and X and FEAR give the best performances in the movie. Look out for the interviews with the young punk kids. You'll hear some of the funniest things you have ever heard in a documentary. Highly recommended.",
         "If I assume that you know what this film is about, I am also forced to assume that you've come to this review knowing that you will probably watch it regardless of what I say. If all this rings true - read on - you are likely to find some consonance with at least part of this review. If you're undecided, or not really entirely certain what happened in the late '70s and early '80s in the urban and suburban youth music culture, you should probably read one of the reviews which pretends to be objective instead. Although I didn't grow up in California, the American punk scene was the first music scene I ever truly lived in. At the height of the hardcore I was immersed in from about 1979-1981 everybody had a band and the only common denominators between bands and indeed members of their audiences were: * the rejection of conformity * tolerance and enjoyment of difference * a desire to have fun - hard and fast Hairstyles, politics, dislike of authority figures, and violent slam-dancing were not integral to what I experienced, though there were certainly cliques or factions who tended to be intolerant of those who did not dress, speak or act \"punk\" enough. And there was often a certain amount of unearned credit extended from some of these cliques to those who tried really hard to live down to the fascistic paradigm of anarchic, self mutilating, angry young cop-haters. Although the interviews with audience punks in Penelope Spheeris' excellent Cal-Punk documentary \"Decline of Western Civilization\" present a very narrow view of the subculture some of us enjoyed, the interviews with the bands, club owners, promoters and even the security people are much more representative of at least my own perspective and memories of 'the scene'. nevertheless, it is possible for those who approach this with prejudices about what punk is to experience this film without having their preconceptions challenged. Unfortunate as this is, the blame for it rests solely with those who promote, believe in or feel comfortable with stereotypes - Not the film-makers. Don't blame the messenger. The music presented here is not going to be for everybody - nor even most. It's not the most crude stuff out there, but it's loud, obnoxious, fast, and less concerned with technique than with raw energy. For me, seeing early Black Flag with Ron Reyes singing, X, Fear and the Circle Jerks was worth far more than the cost of this hard to obtain film. As much as I like The Germs, seeing Darby Crash for the mess - and the nice guy - that he was left me a bit cold. Nevertheless, the scenes of Darby playing with his pet tarantula while \"Shut Down\" droned on and on in the background were precious. The X interview is also great. Spheeris' straightforward documentary style is supplemented by wild pans and zooms during the musical segments. During the interviews, framing is used very nicely to provide context for whatever is being said. Considering her experience and the budget, Spheeris did as well as anybody could have with this film. Recommended for those who appreciate what this film is actually about, and for those who have forgotten those few years of fun, honest, direction-less rebellion before Amaerican punk was co-opted into yet another flow within the musical mainstream and the stereotypes became more important than the basic philosophy.",
         "Decline is an excellent movie, but we must keep in mind that it only showcases one of the many sub-cultures of punk rock in LA at the time. the Germs and Fear etc are all great bands and the shots of them don't do them justice. but the shots of the fans cast an almost negative light on punk rockers. this movie was made at a time when angry youth from orange county found their way into the LA punk scene. they made it violent, (it always sort of was, but it was never meant to take away from the music) they are shown moshing for the sake of hurting each other not for celebrating the music; like the punkers before them. Decline is an excellent glimpse into the punk scene of the 70s and 80s, but be wary when showing it to someone who only has this to base their opinions of Punk rock on."
      ],
      "genres": [
         "Documentary",
         "History",
         "Music"
      ],
      "productionCompanies": ["Spheeris Films Inc."],
      "summaries": ["The Los Angeles punk music scene circa 1980 is the focus of this film. With Alice Bag Band, Black Flag, Catholic Discipline, Circle Jerks, Fear, Germs, and X."],
      "budget": 100000
   },
   "movielensId": 3679,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1981-07-01",
      "dvdReleaseDate": null,
      "directors": ["Penelope Spheeris"],
      "runtime": 100,
      "movieId": 3679,
      "title": "The Decline of Western Civilization",
      "mpaa": "",
      "actors": [
         "Alice Bag",
         "Claude Bessy",
         "Black Flag",
         "Don Bolles",
         "Dinah Cancer",
         "Exene Cervenka",
         "Circle Jerks",
         "Philo Cramer",
         "Darby Crash",
         "John Doe",
         "Lorna Doom",
         "Frank Gargani",
         "Fear",
         "Bill Gazzarri",
         "Lee Ving"
      ],
      "imdbMovieId": "0082252",
      "originalTitle": "The Decline of Western Civilization",
      "genres": [
         "Documentary",
         "Music"
      ],
      "youtubeTrailerIds": ["aiCTq_AHcqw"],
      "plotSummary": "The Los Angeles punk music scene circa 1980 is the focus of this film. With Alice Bag Band, Black Flag, Catholic Discipline, Circle Jerks, Fear, Germs, and X.",
      "tmdbMovieId": 21137,
      "avgRating": 3.91361,
      "releaseYear": "1981",
      "numRatings": 463,
      "posterPath": "/g4uQ5U8QDXtBM0hOn1URKE70NXd.jpg"
   }
}