{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "heavy metal",
            "id": 5540
         },
         {
            "name": "anarchist",
            "id": 5879
         },
         {
            "name": "anti social",
            "id": 10445
         },
         {
            "name": "thrash metal",
            "id": 10874
         },
         {
            "name": "metal",
            "id": 10875
         },
         {
            "name": "anthropology",
            "id": 10983
         },
         {
            "name": "punk rock",
            "id": 11053
         },
         {
            "name": "social commentary",
            "id": 11479
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0094980",
      "video": false,
      "title": "The Decline of Western Civilization Part II: The Metal Years",
      "recommendations": [
         21137,
         36746,
         16301,
         23192,
         31802,
         34380,
         18181,
         37621,
         65572,
         29124,
         41923,
         44848,
         19319,
         16018,
         109581,
         134413,
         39908,
         90937,
         92968,
         63443
      ],
      "backdrop_path": "/1WHLbDkCpsH38f5zcyiS5I5WR08.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe46059251416c91046575",
               "name": "Dave Mustaine",
               "profile_path": "/eckZS3SqYsSt0CHWXc8VxwqszFF.jpg",
               "id": 69236,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe46059251416c91046579",
               "name": "Ozzy Osbourne",
               "profile_path": "/9EkHsyIW3xjch0MJ6LtrvMmGhdL.jpg",
               "id": 12208,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe46059251416c9104657d",
               "name": "Chris Holmes",
               "profile_path": null,
               "id": 1262417,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Himself",
               "gender": 2,
               "credit_id": "546d7e3fc3a3685aa500100b",
               "name": "Lemmy",
               "profile_path": "/6tlgWCyGvIbZy1fvWOupaK4Bu85.jpg",
               "id": 98316,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Himself",
               "gender": 2,
               "credit_id": "577de2759251415d9e00528a",
               "name": "Paul Stanley",
               "profile_path": "/5lAqU8Xn00CV8q9VBrESiNH7S00.jpg",
               "id": 123255,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Himself",
               "gender": 2,
               "credit_id": "577de282c3a36817e3005619",
               "name": "Gene Simmons",
               "profile_path": "/otJ1GRErxC0mZsLRB1ZS41dMeq9.jpg",
               "id": 57756,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Himself",
               "gender": 2,
               "credit_id": "577de29a9251415d98004e7c",
               "name": "Steven Tyler",
               "profile_path": "/tey8qIx6CmLm1AnCu4DBNUrPb9j.jpg",
               "id": 37935,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Himself",
               "gender": 2,
               "credit_id": "577de2b0c3a36817e600521a",
               "name": "Joe Perry",
               "profile_path": "/7SnIgQppUV8TRKFLg8q8WA8Mut.jpg",
               "id": 235984,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Himself",
               "gender": 2,
               "credit_id": "577de2cbc3a36817fb004dfb",
               "name": "Alice Cooper",
               "profile_path": "/nyJVaHPZSPMvJyS5aSal7a793qJ.jpg",
               "id": 35824,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Himself",
               "gender": 0,
               "credit_id": "577de32cc3a36817e10052bc",
               "name": "C.C. DeVille",
               "profile_path": null,
               "id": 1221231,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Himself",
               "gender": 0,
               "credit_id": "577de3759251414a8b00090b",
               "name": "Bill Gazzarri",
               "profile_path": null,
               "id": 1515147,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Himself",
               "gender": 2,
               "credit_id": "5a7fc92e0e0a262aa90182ac",
               "name": "Bret Michaels",
               "profile_path": "/qcS2LWtZbZdKKqayFXd67mCwD8J.jpg",
               "id": 18694,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Himself",
               "gender": 0,
               "credit_id": "5a7fc94cc3a368189501707b",
               "name": "Riki Rachtman",
               "profile_path": null,
               "id": 1042656,
               "order": 14
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe46059251416c9104656d",
            "name": "Penelope Spheeris",
            "profile_path": "/6MiXfO2EdA0keiJf0RmGNfLTvAc.jpg",
            "id": 58448,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Documentary",
            "id": 99
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 1.687606,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 36724,
      "vote_count": 23,
      "budget": 0,
      "overview": "An exploration of the heavy metal scene in Los Angeles, with particular emphasis on glam metal. It features concert footage and interviews of legendary heavy metal and hard rock bands and artists such as Aerosmith, Alice Cooper, Kiss, Megadeth, Motörhead, Ozzy Osbourne and W.A.S.P..",
      "similar": [
         27586,
         254470,
         5123,
         43923,
         8872,
         624,
         2771,
         3134,
         11236,
         20604,
         4688,
         1649,
         1648,
         1919,
         248774,
         6557,
         1600,
         11779,
         16018,
         26890
      ],
      "original_title": "The Decline of Western Civilization Part II: The Metal Years",
      "runtime": 93,
      "poster_path": "/sDZ0bgMfoJbbhbiLj1nooDBWn1k.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1988-06-17",
      "vote_average": 6.8,
      "belongs_to_collection": {
         "backdrop_path": "/nK0xizt2zXIRjNmqko1JtpkDe43.jpg",
         "name": "The Decline of Western Civilization Collection",
         "id": 157671,
         "poster_path": "/Acr92rR6u9GnLMqN98BJYwcleLB.jpg"
      },
      "tagline": "It's more than music...it's a way of life.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Penelope Spheeris"],
      "runtime": 93,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0094980/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk2MDMxNjM5MV5BMl5BanBnXkFtZTcwNjI2NDAxMw@@._V1_SY317_CR148,0,214,317_AL_.jpg",
      "actors": ["Stars: Joe Perry, Steven Tyler, Gene Simmons | See full cast and crew »"],
      "reviews": [
         "As a former metal groupie (the horror!), when I saw this depiction of the lonely lives and substance-riddled minds of my heroes, it actually inspired me to go to college! It is a poignant, wistful, sad, and insightful look at a genre of music that instilled fear in the hearts of parents(well, at least in mine), and a venue for teens to unleash their anger toward a misunderstanding world. The best kind of musical documentary is always done best through the eyes of a true fan, and Penelope Spheeris is no exception. While to the casual viewer the film may seem shallow and all fluff (which is how the LA metal was widely portrayed), if one looks past the hair, excess, bravado, t & a, and flowing alcohol,it is easy to uncover the painfully lonely, opportunistic, naiveté' of the struggling bands, and even some of those who \"made it.\" The scene with Chris Holmes guzzling vodka in his pool was simply heartbreaking...and the expressions on his mother's face were fully able to convey her harsh reality. Some of the \"classic\" performers... Aerosmith, Ozzy, and Lemmy were able to reflect on the business with some learned wisdom, while Paul Stanley and Gene Simmons attempted to convey a fantasy life that appeared way too scripted and laughable (I'm still a huge KISS fan, though). One interesting element in viewing the film almost 20 years later, is how some of the bands downplayed or sidestepped the issue of drug use (note the expressions on their faces when substances are discussed), then appear on \"Behind the Music\" years later to reveal their debilitating addictions. Having been involved peripherally in the scene for a few years, I can say that Spheeris' portrayal was 100% accurate based on what I witnessed. I would've liked to have seen the inclusion of other important bands of the LA scene (Motley Crue, Skid Row, etc), and a separate documentary highlighting British metal (Sabbath, Iron Maiden, Judas Priest)would've been fantastic. It was a fun, irreverent, and exciting time! I can look back at it and laugh since I emerged relatively unscathed... although I am somewhat embarrassed by the extraordinary heights of my hair and the plunging depths of my blouses in \"86.",
         "This is possibly the most entertaining sequel in film history. The first \"Decline\" film presented the punk rock scene of the late seventies/early eighties and captured the rebellion and dissatisfaction found in that movement. This film focuses on the much more entertaining glam-metal scene of the late eighties. We witness such awesome sights as W.A.S.P.'s Chris Holmes getting loaded in his pool while his mom sits pool-side contemplating a very late abortion. Our old pal Ozzy's juice-pouring methods are something to behold and my new favorite band Odin sits in a hot tub with a bunch of metal-sluts and tells us how they want to be bigger than Zepplin and the Stones. This is intercut with their live performance where the lead singer expresses less range than Mark Slaughter and has no ass in his pants! We hear about struggling metal-heads who use women for their money and their food (they of course plan to pay them back with furs and cars when they get big.) And the always entertaining Poison treats us to a healthy dose of rock n' roll stupidity. This film contains some of the stupidest people I have ever witnessed. Why it won no Oscars is beyond me. I think it is one of the truly great films of the decade.",
         "I have read the comment of my fellow viewer and apparent Heavy Metal Connisseur, who says this film falls short of completely covering the Heavy Metal scene at the time. But I really don't think that that's what Spheeris was trying to do. This film is so much more. Like any truly great documentary, it somehow manages to capture life, raw and unfiltered. The characters are funny, loveable, sad, pitiful, admirable, inspiring, bewildering, all at the same time. A very odd, strangely fascinating and mystifying mix of moods and emotions and realness that is stranger than fiction. Like Paul Thomas Anderson and other great filmmakers, Spheeris has this talent of having compassion for her subjects, rather than judging them in some way. It is what it is. She gets out of the way and lets an utterly fascinating and at times \"un-real\" segment of life tell its own story. A timeless piece of rock documentary.",
         "A rock documentary ranging from interviews with seen-it-all veterans such as Ozzy Osbourne, Gene Simmons, Steven Tyler, to the up-and-comers of the era such as Faster Pussycat, Poison, and London. A revealing and fascinating chronicle on the 1980s scene of excess. In retrospect, the film is actually funny in spots. Newbies such as London, Odin, and Seduce were quoted as saying \"I will make it as a rock star\" when asked what will happen if they don't make it. \"We WILL make it.\" Amusing that they disappeared forever just months after this movie (and those statements) was made. *** out of ****. Out of print and tough to find, but well worth the effort. MPAA: Rated R for graphic, pervasive language and brief nudity.",
         "Obviously with a screen name like \"MetalGeek,\" I was bound to get around to reviewing this movie sooner or later. :)THE DECLINE OF WESTERN CIVILIZATION II: THE METAL YEARS (1988) is an fascinating, occasionally hilarious study of the \"Glam Metal\" scene that was raging in Los Angeles during the late 1980s. If you lived through this period (like I did) and loved the music, then you will find much to enjoy here, from the live performances by L.A. staples Lizzy Borden and young (at the time) hopefuls Odin and Seduce, to the words of wisdom from hard rock royalty like Gene (Kiss) Simmons, Lemmy of Motorhead, and Ozzy Osbourne. The scenes of bikini contests at L.A.'s infamous Gazzari's night club will also provide necessary eye candy. :) The reason I call this an \"incomplete\" documentary is that for the most part it mainly focuses on the \"hair metal\" scene and many of the participants are unknown rockers who (righfully) remained unknown after this movie was released. There is no exploration of the history of the genre, nor is there any talk about some of the other trends in metal (thrash, crossover, death metal) that were also making noise in the scene around this same period of time. In addition, many of the younger band members interviewed here come off as delusional, chortling, sex-crazed dorks who are sure that HUGE success is right around the corner for them. Looking at this movie nearly 20 years later you wonder how many of them wound up asking \"Would you like fries with that, sir?\" when the grunge movement came along in the early '90s and wiped hair metal off of the musical map. In addition to the unintentionally hilarious interviews with the many band members and assorted hangers-on, the film is worth seeing for two things: the absolutely harrowing scene featuring Chris Holmes of W.A.S.P., who floats in his swimming pool, drunk as a skunk, telling the world \"I drink because I'm not happy,\" and the scenes featuring Megadeth in the studio working on the song \"In My Darkest Hour.\" In their interview scenes, Megadeth seem to be the most \"together\" and lucid band in the entire film, which is kind of ironic now because that short-lived Megadeth lineup eventually dissolved due to massive drug use. In short, headbangers and hair metallers will love the trip down memory lane that this movie provides, but those looking for a documentary about metal that looks beyond the hairspray may be disappointed. I don't believe the film has been released on DVD (probably too many hassles with music publishing rights) but if you can find it on VHS in an out of the way video store it's well worth your while.",
         "I LOVE THIS MOVIE SOOO MUCH IT HURTS It's brilliant the best bits are chris holmes from W.A.S.P. drinking himself to an early grave in a swimming pool while his mother watches and frowns every time he says the \"F\" word, Odin being laughably awful and claiming they'll be bigger than the Stones and Zeppelin (\"What if you don't make it?\" \"Oh but we will!\" \"Yeah but what if you don't?\" \"Oh, but we will though, see!?!\") ha ha It has interviews with Aerosmith, Poison, Lemmy, Ozzy Osbourne (before he went all new-metal and put together the Ozzfest (grrr), Faster Pussycat, Riki Rachtman, Janet Gardner (before Vixen got big) & Megadeth and Live stuff from FASTER PUSSYCAT !!! this film is totally amazing It's just a shame it's really hard to find in the UK! 100000000000000000000r out of 10",
         "These comments are appropriate as a straight reading of the film, but I don't think Spheeris meant to create a more comprehensive view of heavy metal, and I don't think she was naive about the breadth of heavy metal. I think the title says it all if read as an ironic commentary on the original \"Punk Years\" film. The first film is such a brilliant snapshot of a certain time, and the social problems, great music, politics, and lifestyles on display are directly and deliberately contrasted with the dummies (NOT talking about Lemmy, Mustaine, and Aero here) in the \"Metal Years\" film. It's as if Spheeris, after capturing such a visceral authenticity--something so intense--in the \"Punk Years\" film, asked What the hell happened? seven years later in the \"Metal Years\" film. The \"Punk Years\" isn't a \"decline\" at all, but the \"Metal Years\" certainly represents one in so many ways if viewed through the lens of 1981.",
         "I'll admit right off the bat that I didn't respond as strongly to the Decline of Western Civilization 2: the Metal Years as I did to Penelope Spheeris's first film and documentary, even as I know I did like this film. The former was a kind of fly-on-the-wall (as I recall, not as many direct interviews, more concert footage) look at this way of rock and roll life- of LA punks- that Spheeris knew intrinsically. In the Metal Years, she here isn't as much a fly on the wall in the sense of just getting the pure feeling of these people as she is getting answers to questions by a mix of highly popular and working-the-bottom bunch of Metal rockers. It of course can't cover everything in such an amount of time, and one might be slightly disappointed to see Britain's metal scene is sort of overlooked in the course of the film (not that it isn't represented in interviews with Ozzy and Lemmy, but Maiden and Priest fans, among others, may wonder wtf). But if there is any single strength to this seemingly longer-than-90 minute film, with the interviews strung together in a interesting fashion alongside the concert footage, it's that this particular scene of American metal- particularly LA metal's scene- is captured very well. And in this capturing of this time and place and the people all abound in it, it's of course of note to mention that everything the musicians say is not 100% reliable, and here and there it definitely has the feeling of bulls***ing with Spheeris's questions (however clever and funny). But there are enough true moments to really get the sense of these people at the time, that there is maybe at least some depth to the members of Poison (with really one good song in my opinion), or that Ozzy does have a very clear and honest view of what's gone on with him and the scene, or what rock means or drugs mean or sex. If there isn't always a focus in the line of questioning, or if there doesn't seem to be much of a structure to the film, maybe it's part of the point. Here we have a mix of rockers either trying to make it (Odin, who I think made it bigger since, are featured prominently, as well as London), or have made it (Aerosmith, Kiss, Megadeth and Alice Cooper among a couple others), and be it that a scene or two is staged or set up at a location for a desired effect, there aren't many punches pulled with the answers to the fairly straightforward questions. And some of them, when not all about \"rock and roll is my life\" does show the dark side quite accurately, especially considering the time period. One interview with the drunk in the pool gives the most to try and shake off, even as the manipulation of the filmmaker kind of kicks in with having his mother right there watching him in his over-drunk state. But, it is at the end of the day an entertaining documentary, if only as being a fan of the sub-fold of music myself. Some of the concert footage is less than great, even as London and of course Megadeth give quality performances. There was, like with other good documentaries, enough talk coming out of people to really chew on, and it shows Spheeris in a sort of different direction than in the other look at life in underground rock and roll. It's not great, but for the fans of the bands &/or those interviewed, it is near essential viewing, and also with an anthropological side to it through the stories and Q&A's that work for those not as into the music.",
         "During the opening credits, there is a great pan shot across a line of fans waiting for a rock show. It sets the stage, so to speak, for a very entertaining--and informative--look at the heavy metal scene in the late 1980's. The movie concentrates on Hollywood, which was aruguably the epicenter of hard rock throughout that decade. The decadence, flamboyance and unabashed immaturity in some the movie's scenes appears cheesy and fake when compared to other music eras...particularly the proceeding grunge period in Seattle. That said, it contains fantastic interviews and footage of some of the 80's biggest rock stars--and rock locations. Every period and genre in music should have its story documented. And this movie is like a time capsule of hard rock in the 80's.",
         "Great documentary of the heavy metal scene of the late 1980s. Unlike the first \"Decline...\" this movie concentrates more on interviews than concert footage. There are just fascinating talks with old time performers (Alice Cooper, Aerosmith, Ozzy Osbourne) and newcomers (Odin, WASP, Poison). The contrasts and their views on music, drugs and sex are very interesting and illuminating. The movie makes no judgments on the performers or their music...they leave that up to the audience. The whole feeling of the film is actually uplifting and very funny. The bands come across as very upbeat and accessible. The interviews with fans of the music are just as fun. Interesting to see Ozzy Osbourne years before that reality show he did for MTV. The only depressing footage is an interview with Chris Holmes of WASP. He's drunk out of his mind and makes it quite clear that he hates life, is an alcoholic, had a heavily dysfunctional childhood and will be dead soon. Very scary to watch and sad. That aside, this is a great, accurate documentary of heavy metal. A must-see."
      ],
      "genres": [
         "Documentary",
         "Music"
      ],
      "productionCompanies": [],
      "summaries": [],
      "budget": 500000
   },
   "movielensId": 3680,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1988-06-17",
      "dvdReleaseDate": null,
      "directors": ["Penelope Spheeris"],
      "runtime": 93,
      "movieId": 3680,
      "title": "The Decline of Western Civilization Part II: The Metal Years",
      "mpaa": "R",
      "actors": [
         "Dave Mustaine",
         "Ozzy Osbourne",
         "Chris Holmes",
         "Lemmy",
         "Paul Stanley",
         "Gene Simmons",
         "Steven Tyler",
         "Joe Perry",
         "Alice Cooper",
         "C.C. DeVille",
         "Bill Gazzarri",
         "Bret Michaels",
         "Riki Rachtman"
      ],
      "imdbMovieId": "0094980",
      "originalTitle": "The Decline of Western Civilization Part II: The Metal Years",
      "genres": [
         "Documentary",
         "Music"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "An exploration of the heavy metal scene in Los Angeles, with particular emphasis on glam metal. It features concert footage and interviews of legendary heavy metal and hard rock bands and artists such as Aerosmith, Alice Cooper, Kiss, Megadeth, Motörhead, Ozzy Osbourne and W.A.S.P..",
      "tmdbMovieId": 36724,
      "avgRating": 3.76347,
      "releaseYear": "1988",
      "numRatings": 334,
      "posterPath": "/sDZ0bgMfoJbbhbiLj1nooDBWn1k.jpg"
   }
}