{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "jazz",
            "id": 1416
         },
         {
            "name": "liquor",
            "id": 3423
         },
         {
            "name": "success",
            "id": 3836
         }
      ],
      "imdb_id": "tt0097322",
      "video": false,
      "title": "The Fabulous Baker Boys",
      "recommendations": [
         13665,
         5968,
         9941,
         11591,
         2075,
         12518,
         11307,
         10337,
         2321,
         1058,
         19382,
         10631,
         9051,
         10013,
         8130,
         2107,
         10859,
         9440,
         2039,
         1552
      ],
      "backdrop_path": "/qM18gaxmKsWlYVOa377ZCpFQQB1.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jack Baker",
               "gender": 2,
               "credit_id": "52fe43c89251416c7501defb",
               "name": "Jeff Bridges",
               "profile_path": "/xms1RAY6q7Lzp7wNeRCB0kzhucn.jpg",
               "id": 1229,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Susie Diamond",
               "gender": 1,
               "credit_id": "52fe43c89251416c7501deff",
               "name": "Michelle Pfeiffer",
               "profile_path": "/vyoJV5QYwIGZohrPpKFdKc7EpSP.jpg",
               "id": 1160,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Frank Baker",
               "gender": 2,
               "credit_id": "52fe43c89251416c7501df03",
               "name": "Beau Bridges",
               "profile_path": "/xv6sDCHxHvBgCK4y96H32kxgcdr.jpg",
               "id": 2222,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Nina",
               "gender": 1,
               "credit_id": "52fe43c89251416c7501df07",
               "name": "Ellie Raab",
               "profile_path": null,
               "id": 67377,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Lloyd",
               "gender": 2,
               "credit_id": "52fe43c89251416c7501df35",
               "name": "Xander Berkeley",
               "profile_path": "/vlZ9FDMk2Xd1WHixPKxnheZoXgR.jpg",
               "id": 3982,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Blanche",
               "gender": 1,
               "credit_id": "5533ccdac3a368222600590d",
               "name": "Jennifer Tilly",
               "profile_path": "/bNB0BTnPAdAAHuCQSprMk4smBMD.jpg",
               "id": 7906,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Charlie",
               "gender": 2,
               "credit_id": "587ce103c3a36847e801ba69",
               "name": "Dakin Matthews",
               "profile_path": "/tP63g4n8HPOUubsqUN8xZfXantn.jpg",
               "id": 43364,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Ray",
               "gender": 2,
               "credit_id": "587ce1129251413f3301a77f",
               "name": "Ken Lerner",
               "profile_path": "/dMkxevvUxdyV3ZL7XidnuM21wUI.jpg",
               "id": 51662,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Henry",
               "gender": 2,
               "credit_id": "587ce13ec3a3684a9e018f7d",
               "name": "Albert Hall",
               "profile_path": "/yHGN2pIdBcBk19sAu0EchOxfYMY.jpg",
               "id": 8354,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Girl in Bed",
               "gender": 1,
               "credit_id": "587ce1a2925141414300e3f3",
               "name": "Terri Treas",
               "profile_path": "/4wIZe29qcOruk0sktvvGIhL56LX.jpg",
               "id": 103582,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Vince Nancy",
               "gender": 2,
               "credit_id": "587ce1b8925141414300e405",
               "name": "Gregory Itzin",
               "profile_path": "/fncVVUcVFR9QgW1XOCbbp4eUJEU.jpg",
               "id": 21142,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Earl",
               "gender": 2,
               "credit_id": "587ce1cc9251413eec019741",
               "name": "Bradford English",
               "profile_path": "/gyPUlOvV3hTlnCKnbuLDML8XtYX.jpg",
               "id": 1234009,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "Kid at Vet",
               "gender": 2,
               "credit_id": "587ce2149251413e9201a06a",
               "name": "David Coburn",
               "profile_path": null,
               "id": 1192987,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43c89251416c7501df0d",
               "name": "Steve Kloves",
               "profile_path": "/nhHzMwSiVse15WF1Qi7xfVBoo7A.jpg",
               "id": 10967,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43c89251416c7501df13",
               "name": "Steve Kloves",
               "profile_path": "/nhHzMwSiVse15WF1Qi7xfVBoo7A.jpg",
               "id": 10967,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43c89251416c7501df19",
               "name": "Mark Rosenberg",
               "profile_path": null,
               "id": 50855,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43c89251416c7501df1f",
               "name": "Dave Grusin",
               "profile_path": "/h6EgxJIsRpObohHdvlUGEAu6EqK.jpg",
               "id": 10771,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 1,
               "credit_id": "52fe43c89251416c7501df25",
               "name": "Paula Weinstein",
               "profile_path": null,
               "id": 16731,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43c89251416c7501df2b",
               "name": "Michael Ballhaus",
               "profile_path": "/pMto0iHZb67YaSP9cTgKbAPcaYU.jpg",
               "id": 3769,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43c89251416c7501df31",
               "name": "William Steinkamp",
               "profile_path": null,
               "id": 2241,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 4.795254,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10875,
      "vote_count": 99,
      "budget": 13000000,
      "overview": "Frank and Jack Baker are professional musicians who play small clubs. They play smaltzy music and have never needed a day job...",
      "similar": [
         873,
         244786,
         594,
         70,
         313369,
         3902,
         525,
         17578,
         4942,
         2148,
         5511,
         31900,
         638,
         331781,
         10033,
         2266,
         11468,
         93,
         367412,
         10708
      ],
      "original_title": "The Fabulous Baker Boys",
      "runtime": 114,
      "poster_path": "/6VHmsgpQNOjkC7p40HOjsFnAW0v.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Tobis",
            "id": 480,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Gladden Entertainment",
            "id": 1648,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Mirage",
            "id": 19534,
            "origin_country": ""
         }
      ],
      "release_date": "1989-10-13",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "For 31 years it's been just the Fabulous Baker Boys... but times change.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Steve Kloves"],
      "runtime": 114,
      "synopsis": "The film opens with Jack Baker getting dressed while a brunette, who was a one night stand, lies in bed. He is dressing in a tuxedo. She asks, \"Will I see you again?\" When he answers \"No,\" she doesn't seem particularly moved one way or the other. As he leaves, she says, \"You got great hands.\" Then, as Jack walks through the streets of Seattle, the opening credits scroll across the screen. He arrives at work with two minutes to spare. Frank, Jack's brother, is in a restroom where Jack sprays his hair with Crowning Glory's Miracle Hair to conceal his age. The brothers are a duo piano team who are currently performing at the Starfire Lounge. They have been professional performers for the past fifteen years. The first number they perform is \"People.\" After their performance, Frank collects their pay from the hotel's young and very condescending, assistant manager, Lloyd. Jack doesn't trust Lloyd, so he tells Frank to count the money. When Jack returns to his apartment, Nina, a young girl from upstairs whose mother is always out with some guy, is attempting to play \"Jingle Bells\" on his piano. At the brothers' next engagement at the Capri Hotel Luau Lounge, wearing Hawaiian shirts, they play the bossa nova classic, \"The Girl from Ipanema.\" After their performance, the club's manager, Charlie, suggests they break up. He can't use them again, he says, because they have class and most people don't want class. He needs something that will draw customers, something more up-to-date. Those comments, or criticisms, cause the brothers to consider adding a female singer to their act. At auditions to find the right singer, Monica Moran sings \"Candy Man.\" She is clearly not what they are looking for, nor are several other auditionees who sing excerpts of \"My Way,\" \"Up, Up and Away,\" \"Tiny Bubbles,\" \"I Go to Rio,\" and \"I'm So Excited.\" After auditioning thirty-seven girls, they are packing up when Susie Diamond stumbles in an hour and a half late. At first Frank has no intention of auditioning her, but he finally gives her a chance. She sings a soulful performance of \"More Than You Know,\" which Jack accompanies with lush harmonies on the piano. Afterwards, she asks, \"So?\" (Neither Jack or Susie seem to recognize each other or remember they have slept together.) The brothers obviously were impressed because she is hired. The next scene shows Frank nervously pacing because Susie is late for their first performance together. When she arrives, Frank doesn't like the way she is dressed, so he and Jack quickly buy her a dress and shoes that they deem more appropriate. They rush back to the Hilton Hotel Ambassador Lounge, where Susie, after some microphone problems and the brothers getting her started by singing the verse, sings \"Ten Cents a Dance,\" which is a very appropriate song for Susie considering some of her former jobs. Next a montage shows Susie and the boys performing \"Can't Take My Eyes Off of You\" in one lounge after another. The crowds are more enthusiastic at each venue. By the end of the montage, we see a new cardboard stand-up with Susie's name and picture added to that of the brothers. When Jack goes to a club alone to get away from his brother, he hears a jazz trio play \"Lullaby Of Birdland.\" By Christmas, when Jack asks to walk Susie home, she tells him a relationship would not work with them having to work together every night. The trio gets a booking at a swanky resort hotel. The first night, Frank is awakened at 2 a.m. by the blare of big band music coming from Susie's side of the suite (\"Perdido\"). At their first performance at the hotel, Susie sings \"The Look of Love\" for dancing. Later that evening, the three performers celebrate their success on the terrace of their suite. Frank, who is getting drunk, hears a recording of \"Moonglow,\" which causes him to reminisce about Jack teaching him to dance. As a result of Jack's dance lessons, he got a wife and children. When Frank finally goes to bed, Jack and Susie dance to the song. Soon friction arises. Frank complains about Jack's incessant smoking, but he is really upset because of his brother's growing relationship with Susie. Frank warns him to leave her alone. Later, they argue about what music to play. Frank gets a call from his wife that Little Frank is ill and he is needed at home. Before he leaves, he gives explicit instructions about what Jack and Susie are to perform while he is away. Once he leaves, while Jack is on the balcony smoking, we hear a recording of the Duke Ellington Orchestra playing \"Do Nothin' Till You Hear From Me.\" During this time, Susie is seen smelling his aftershave lotion in his bathroom. Then a little later, she sees him checking out her perfume (there is also a bubble bath scene where Jack catches Susie when she slips on the sudsy floor, but that was omitted from the version viewed). Their next performance is New Year's Eve. Susie and Jack perform \"Makin' Whoopee\" (Eddie Cantor's original version was much more sarcastic than Miss Pfeiffer's). She sings the song, which warns about the dangers of married life, from on top of Jack's grand piano and sings part of the lyric directly to Jack. She ends the number by sitting on the piano bench beside him. After the countdown to midnight, she kisses him. Later that evening (or early morning), Susie and Jack are the only ones left in the room. As she talks about her former job as an escort, he begins to massage her shoulders, then, unzips her dress and rubs her back. After a passionate kiss, he lays her on a table (sexual activity is certainly implied, but not seen). Back home from their engagement at the resort, Frank, Jack and Susie meet at a diner to discuss future bookings. While Susie and Frank argue about potential places to play and song selections, Jack sits silently. When Susie walks out, Jack suggests that Frank loosen her leash. Later, Susie finds Jack playing jazz in a dingy night club. He never notices her; he is lost in the music and is playing much more expressively. When he returns to his apartment, Susie is sitting on the steps waiting for him. Early the next morning, Susie is dressing to sneak out, but Nina comes through the window to take Jack's dog out for his morning walk. Susie finds an old photograph of Jack and Frank. The photo was taken when they were much younger and they are holding a bottle of liquor towards the camera. By this time Jack is awake and tells her the photo was taken at their first professional gig. She says she came by to tell him she has been thinking about leaving the act. Some guy wants her to sing commercial jingles. Showing no feelings at all, Jack encourages her to take the job. He says they can always find another girl. At their next performance at the Hilton Old America Lounge, they perform \"Feelings.\" Susie quits in the middle of the song; she says she just can't sing it anymore. Later, when she tells Jack she quit, just like before, he seems unfazed. She accuses him of being cold and uncaring about anything. She also tells him she saw him playing jazz at the dingy night club; \"dusting off his dreams,\" she called it. As she turns to walk away, she calls him a coward. Frank booked the piano duo for a telethon because, he said, it would be good publicity. However, the telethon is on a small station and they are performing at 3 a.m. Just as they start to play, the telethon M.C. interrupts to announce an updated total. Jack explodes, charges the M.C. and walks out of the studio. Frank accuses him of being unprofessional and lauds himself as being the responsible one. They also argue about Susie, especially that Jack and she slept together (more explicit language was used). Their argument escalates into a fight where Jack almost breaks Frank's finger. Then before Frank can protest, Jack turns away and disappears into the night. On the way back to his apartment, Jack stops in a diner. The waitress is Monica, who sings a bit of \"Candy Man\" to remind Jack of who she is. Jack almost propositions her, but a Susie thought makes him change his mind. Once Jack gets home, he is in such a foul mood that he takes it out on Nina. She runs out of his apartment up to the roof, where Jack finds her. He apologizes and also offers to teach her something else to play besides \"Jingle Bells.\" After a few days, Jack goes to see Frank at his home to tell him he isn't coming back to the duo. He says he can't play the same songs the same way every night anymore. They open the bottle of booze they had received at the first professional engagement and drink. Then at the two pianos they started on many years before, for old times sake, they play and sing \"You're Sixteen.\" The film's final scene shows Jack waiting outside Susie's apartment. She's progressed from cat food jingles to vegetables. They both apologize for the way they acted when she left the act. She asks if they found a new girl singer. He says they didn't look for one. As she leaves to record a new jingle, he asks, \"Am I going to see you again?\" Not giving in easily, she asks, \"What do you think?\" He answers, \"Yeah, I think Im gonna see you again.\" Then, after a pause, he says, \"Intuition.\" As she walks away down the street \"My Funny Valentine\" is sung by Susie (or Michelle Pfeiffer) over the final credits.",
      "writers": ["Steve Kloves"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0097322/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI5NzI5NjM0MF5BMl5BanBnXkFtZTcwMDE3MzE0MQ@@._V1_SY317_CR8,0,214,317_AL_.jpg",
      "actors": ["Stars: Jeff Bridges, Michelle Pfeiffer, Beau Bridges | See full cast and crew »"],
      "reviews": [
         "Written and directed by Steve Kloves, `The Fabulous Baker Boys' is a tale of music and brotherly love set in Seattle. The Baker boys are Jack and Frank (real life brothers Jeff and Beau Bridges), who eke out a living playing piano together at various venues throughout the Emerald City, a basic lounge act they've been doing for fifteen years. Frank is the responsible one, because he has to be; he has a wife, kids and a home in the suburbs. He manages their business, secures the bookings and is content to stick with a formula that works. For him, it's not about the music, it's about keeping food on the table for those who depend on him. Jack, on the other hand, is unattached and could care less about the business end of the partnership. As long as it affords him a modicum of security as well as dignity, he is more than willing to just go along for the ride. For Jack, though, underneath it all, it is about the music; it's about jazz. On off nights he will steal away alone to some small club to play, and deep down inside he knows that this is not only what he really wants, but needs. And he knows he could be great, if only he'd let himself go. The trouble is, he's been with Frank his whole life, and as long as the act is working he just can't make the break. Unless something happens, his dreams are destined to remain suppressed and unrealized. It is only when one of their regular clubs balks at rescheduling them that the brothers begin to realize that perhaps their act is getting a bit stale. So they decide to try adding a singer to the act. After a memorable scene in which a number of young hopefuls are auditioned, Suzie Diamond (Michelle Pfeiffer) enters their life. She joins the act on a trial basis, and after an amusing and somewhat tentative beginning, infuses it with new life, though Frank continues to adamantly resist too much of a departure from their original show. (`Does anyone really want to hear \u0091Feelings' again?' she asks him at one point). Ultimately, however, Suzie becomes the impetus for change that Jack has needed all along, and the stage is set for the decisive moment, which comes when the dignity of the brothers is compromised due to an incident on Frank's part of uncharacteristic carelessness. When Jack tells Frank, `We've never been clowns before\u0096' you know exactly how deep it has cut. Kloves has fashioned an entertaining study of relationships, change, and the effects of complacent loyalty and self-denial; and the importance of following your own heart. When Jack sits down alone at the piano in that smoke-filled club, we know that this is where he is meant to be. Filmed on location in and around Seattle, with a terrific score by Dave Grusin,a supporting cast that includes Jennifer Tilly (Monica) and Ellie Raab (Nina), and a classic scene in which Suzie Diamond croons `Makin' Whoopee' atop a piano, `The Fabulous Baker Boys' is an absolute gem you do not want to miss. I rate this one 10/10.",
         "Jeff and Beau Bridges - brothers in real life - are here united to play brothers on the screen. It's not the first time real-life brothers have played fictitious brothers in a movie (in fact, in The Long Riders several famous siblings paired up to similar effect). However, The Fabulous Baker Boys really benefits from the pairing. The sibling rivalry that runs through this film feels very credible and very convincing, possibly because Jeff and Beau aren't really acting but are simply using their real-life love/hate brotherly attitudes to fuel their performances in front of the cameras. It's a fairly thin story, but well told. Jack Baker (Jeff B.) and Frank Baker (Beau B.) have spent years working together as stage pianists in various bars, hotels and night-clubs around Seattle. Their long-running act begins to run out of steam and they find themselves playing to empty rooms.... even their more established employers begin to express doubts about their ability to pull in the big crowds. They decide to hire a female vocalist to spice up the appeal of their show and, after over thirty awful applicants, they finally unearth a winner in the shape of Suzy Diamond (Michelle Pfeiffer). Initially, Suzy provides them with a turn in their fortunes, but the future of the trio becomes cloudy when she and Jack develop sexual yearnings for each other. The problems don't stop there, with Frank and Jack slowly becoming more and more distant with each other as their views on how best to market their musical talents are revealed to be very different. The Fabulous Baker Boys is extremely well-acted throughout, with Pfeiffer in particular giving an outstanding performance (she even sang most of her own songs). The main themes of sibling rivalry and unfulfilled talent are generally engrossing, and help to paper over the thinness of the story. Jeff acts rather moodily for much of the time and is very believable as a man working in the lower ranks of his trade when he could've reached the top. Beau is also in fine form as a performer who does what he does simply because it puts money in the family kitty. It's a hard film to describe, because it's not really about very much, but if you can adjust to the relaxed pace and just enjoy the leisurely development of the three main characters then you will come away from the film feeling thoroughly satisfied.",
         "I consider Baker Boys the best film on music because it is one of the finest noir stories ever written on the subject. It is an important film because of the subject matter: an expose of musical art married to entertainment. It is a subject rarely revealed in American media. Most people think of \"musical art\" as something found at the classical music concert or the college music department. The other stuff we hear is entertainment, right? Well, sometimes it just isn't that simple. Baker Boys is a story based on those cases of mixed marriage when the talented artist finds himself locked into an employment situation that hampers his artistic ability. It may come as a surprise to Jazz and commercial music lovers that such music artists really do exist beneath the glamorous facade of their favorite music acts (not to mention films). The story of Jack Baker means to reveal this dark underbelly of the entertainment business. It is well for the public to understand how and why such musicians exist. The distribution of a film such as Baker Boys is but one step toward this end. While most people saw the film as a romance involving the swing music genre, what they didn't seem to recognize is the more important underlying contextual theme. This issue - of undiscovered musical talent - is not popular. Unfortunately the average layperson is not familiar enough with music to understand or care about why a musician would be unhappy with his job. It is easy to see why most people avoided this, the main theme of the film - it's too dark - and instead focused on the romance and the style. In the end, Baker Boys is a story of one Jack Baker, an entertainer who was finally bold enough to make the transition to Jazz artist. It is a story of passive resistance to what Blake Edwards immortalized as that \"other\" part of the entertainment industry known behind the scenes as S.O.B. (Standard Operating Bullshit). It is but one fictional story that represents many, many similar true-life cases of successful failure.",
         "After seeing the rating for this movie, I'm convinced about one thing: the average viewer doesn't want good movies, all they are interested in is some cheap entertainment with big explosions, a lot of violence and shooting and if possible even more car chases. How else could you explain the fact that movies like \"Batman Begins\" or \"Spiderman\" and yes even the \"The Lord of the Rings\"-trilogy make it to the top 250, but a movie like this one doesn't even get a 7/10 (The actual rating is 6.6/10 after 4,563 votes). Am I saying that this movie belongs in that list too? No, I'm not, because it is a very good movie, but there are plenty of better ones. It's just the fact that I don't understand why people no longer seem to appreciate some very good acting and a fine story anymore. \"The Fabulous Baker Boys\" tells the story about two professional musicians, Frank Baker and his younger, less committed, but more talented brother Jack, who have been playing as a piano duo in bars and hotel lounges for many years, but who seem to have lost much of their appeal to the audience. They aren't asked for new performances and they realize that something has to be done. They decide to hire a new female singer. During the auditions there isn't one who can sing or keep tone and they are convinced that they will never find one either. But then Suzie Diamond comes stepping in. She's 1.5 hours late, has a big mouth and hasn't got the right 'entertainment' experience (she has worked as an escort girl). But they give her a chance and they are astonished by her qualities. Together they make the act successful again, but when the relation between Suzie and Jack briefly becomes more than professional, tension between all three builds up and forces the band to break up... Although I didn't know the name of the director, Steven Kloves, I was convinced that this could be a very good movie. The reason for that was because I knew that Sydney Pollack was one of the producers. That's no guarantee for success of course, but it sure helped me to get some confidence in this movie. And it has to be said. Kloves has done a fine job in writing and directing this movie. I'm sure that it will not appeal to a large audience because it isn't very spectacular, but what he has done with it certainly proves that the man has talent. He has written a solid, effective, but simple story without too many extra's and I really appreciate that. Also in his direction he has kept everything quite sober. This is 'just' a love story involving a small band, but it works and that's all that matters. Of course he has been helped by his excellent cast. Jeff Bridges and Beau Bridges are really very good in playing the two pianists, but it was Michelle Pfeiffer who had me completely in her power. Not only does she look and act very sensual in this movie, she sings like an angel. I knew that she was a very talented actor, but that she could sing that well, really was a big surprise to me. Overall this movie deserves to be seen by a bigger audience, although I'm convinced that it will never happen. It lacks everything to draw in a big crowd and even when they give it a try, they will probably not like it because it's nothing special in their opinions. Personally I liked it a lot. A good story, some very fine acting, very good directing,... make me believe that this movie doesn't deserve a rating lower than a 7.5/10.",
         "Oh, this movie is the best. An absolute must-see. It's dreamy and romantic, yet cynical, so it's like having your cake and eating it, too. The Brothers Bridges are excellent (I wonder how much of their real-life relationship crept into their on-screen relationship) and Michelle Pfeiffer is absolutely perfect as Suzie Diamond. This is the movie in which Ms. Pfeiffer transcends, completely and irrevocably, the realm of mere mortals and achieves goddess status. She's smart, tough, funny, and sexy--all at the same time! When she stretches out on a piano to sing \"Makin' Whoopee\", she is radiant and reminds one of the greatness and the glamour of old Hollywood. RENT THIS MOVIE TONIGHT!!!!",
         "Possibly the best ensemble acting since the Hawks, Bogart and Bacall version of \"The Big Sleep\". There aren't many films of the eighties that match the sheer class of the best studio pictures of the thirties, forties and fifties. This one does. Watch the scene where Jeff Bridges lights Pfeiffer's cigarette for a few seconds' vignette of perfectly restrained and utterly revealing acting. But then, almost every scene in this movie is at or near this standard. It's a film in a thousand, if that, that makes you believe you are seeing a glimpse into real life at a particular place and time. The Fabulous Baker Boys is three people's intersecting lives in Seattle in the late eighties. As real as if you had been there? No. As right as if you had been there? Yes.",
         "This movie is one of my favourites, probably because I'm a true Jeff Bridges-fan. I think most people are familiar with the story. It's about 2 brothers playing piano in hotel lounges and bars etc. Beside the Bridges-brothers, Michelle Pfeiffer is also in this movie. She is the star of the show and gives one hell of a performance too. The story isn't unique. There are probably more movies made like this, trying to tell the same thing, but for me it really worked. I love every scene of this movie. I love piano's, beautiful women, Jeff Bridges' acting and great performances in general. \"The Fabulous Baker Boys\" has it all. It think it truly deserves a better rating. 6.6 is way too low. I should at least reach the level of 7/10. I personally would give this movie an 8 or 8,5, but to compensate the underrating a little I will give it a 9. I can't think of any reason not the see this movie. It isn't a psychological drama. It's a drama with a fine story, great performances and a wonderful cast. Michelle Pfeiffer deserved the awards she won for her performance. To me, it became kind of a classic. See this movie! I hope you enjoy it as much as I did. 9/10",
         "TFBB is such a terrific movie, you feel like a child in a toy store wanting to tell it all. Everything in this story falls into place, the pace is great, the acting is brilliant and yet it's in the details that one discovers the masterpiece. There's the audition scene, the little story about the sick dog and the girl from next door to show you Jeff Bridges does care, the introductions by Beau as they perform in their special place, The Starfire Lounge and then repeats the same line in another cocktail bar, the bathroom scenes in the hotel they do their Festive season gig (quite different what you might have expected from a bathroom scene between Michelle Pfeiffer and Jeff Bridges !), the dog leaving the elevator in the hotel on his own to join his boss who is playing alone, his kind of music. This movie gets better with repeated viewings, so buy it instead of renting it.It's a mystery to me why Steve Kloves did not make more films and instead waited to become a scriptwriter for the Harry Potter films more than 10 years later.",
         "There is no way I could possibly give Baker Boys anything less then a 10, even though as far as personal enjoyment goes, I had some problems with it. Yet, without a doubt the fact remains that this movie, on many levels is extraordinary.(not OK or good-extraordinary.) I Personally am very surprised there aren't a lot more comments on here about Baker Boys. Obviously, Michelle as well as the Bridges brothers were fantastic. But most have said that so I won't get into that to much. I was very impressed(and a bit awed) by this screenplay and how incredible, not just the dialogue was, but the mannerisms, the little \"back and Fourths\" and quirks of each person-the writing was way above merely being good. Beyond admiration, however, I was touched by the writer's ability to capture the world of entertainment and music so perfectly. This is a movie where, (after Suzy, frank and Jack), the music and world these people live in, becomes the fourth main character of the movie. And anyone who has lived in a similar reality at anytime in their life, will feel like their seeing old friends.... My viewing experience was not perhaps the most fun I've ever had, for two simple reasons. One, because I, like many others, will concede this movie moves extremely slowly and unfortunately slow movingness in a movie is one thing that's always been a problem for me. Second, this movie is draped in nostalgia and made me feel more sad then anything else when it was over. The gloom I felt however, was also coupled with knowing I just watched a really well done movie-so it was gloom mixed with admiration, sort of like listening to Pink Floyd. It takes time to get into Baker Boys, it's a slow burn not an immediate rush. It is one of the most nostalgic pictures I've ever Seen. People have mentioned 70's, 80's I'd say those periods and even earlier. There's an old style glamor coupled with a bittersweet sleepy nostalgia-and anyone who has experienced the stuff of nighttime, and neon lights, will be back in that place again whether they want to be there or not. That's entertainment.",
         "After playing small club gigs for over 15 years, the \"Baker Boys\" finally come to grips with some realities. \"Susie\" comes into their act and lives. She's a former \"escort\" and blues singer, whom they hire to rejuvenate their somewhat tired act. This she does, in more ways than one. \"The Fabulous Baker Boys\" is an accurate and frank depiction of musicians' lives-on-the-road. It reveals what happens after the audience goes home and the musicians retire to their nice hotel rooms. But after years, one nice hotel room is the same as another. Likewise, their music routines can become as stale as leftover tobacco smoke in their vacated clubs. Jeff and Beau Bridges execute some the finest work of their careers in this film. Likewise, Michelle Pfeiffer equally supports them, as well as does her own singing. Dave Grusin and John Hammond's soundtrack piano renditions are excellent, as is Peggy Holmes' choreography for Ms. Pfeiffer. Sydney Pollack was wise to financially support this production as executive producer. Writer director Steven Kloves came up with a winner here, marred only by some general slow pacing and an ambiguous though appropriate ending. \"The Fabulous Baker Boys'\" reputation continues to grow and be appreciated by more audiences, through cable and DVD distributions. It signifies a rare glimpse at backstage life-on-the-road of musicians who so enrich our lives, yet are all too often taken for granted."
      ],
      "genres": [
         "Drama",
         "Music",
         "Romance"
      ],
      "productionCompanies": [
         "Gladden Entertainment",
         "Mirage",
         "Tobis"
      ],
      "summaries": [
         "Frank and Jack Baker are professional musicians who play small clubs. They play schmaltzy music and have never needed a day job. Times are changing and dates are becoming more difficult to get so they interview female singers. They finally decide on Susie Diamond, a former 'escort' who needs some refinement, but the act begins to take off again. While the act is now successful, both Frank and Jack have problems with their life on the road. Susie becomes the agent that makes them re-evaluate where they are going, and how honest they have been with each other.",
         "Brothers Jack and Frank Baker have been playing lounges as a piano duo for many years but decide they now need a female vocalist to keep the act going. They are lucky to come across Susie Diamond, who can really put a song over, and the act takes off. But when the relation between Susie and Jack - younger, less committed, but more talented than Frank - briefly becomes more than professional, tensions surface between all three.",
         "Frank and Jack Baker are two piano players and brothers. Moreover, they play together in small pubs and clubs all over the country for 15 years. But when their business is not doing so well, they decide to join a woman to their shows. After the auditions, the best candidate they could find was Susie Diamond, and from now on their shows become very successful. But when Jack and Susie are having an affair, the fabulous Baker brothers are not getting along anymore, and the little band is about to break down."
      ],
      "budget": 13000000
   },
   "movielensId": 3684,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1989-10-13",
      "dvdReleaseDate": "1998-04-14",
      "directors": ["Steve Kloves"],
      "runtime": 114,
      "movieId": 3684,
      "title": "The Fabulous Baker Boys",
      "mpaa": "R",
      "actors": [
         "Jeff Bridges",
         "Michelle Pfeiffer",
         "Beau Bridges",
         "Ellie Raab",
         "Xander Berkeley",
         "Jennifer Tilly",
         "Dakin Matthews",
         "Ken Lerner",
         "Albert Hall",
         "Terri Treas",
         "Gregory Itzin",
         "Bradford English",
         "David Coburn"
      ],
      "imdbMovieId": "0097322",
      "originalTitle": "The Fabulous Baker Boys",
      "genres": [
         "Music",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["ZVMwawC-Ito"],
      "plotSummary": "Frank and Jack Baker are professional musicians who play small clubs. They play smaltzy music and have never needed a day job...",
      "tmdbMovieId": 10875,
      "avgRating": 3.32051,
      "releaseYear": "1989",
      "numRatings": 1950,
      "posterPath": "/6VHmsgpQNOjkC7p40HOjsFnAW0v.jpg"
   }
}