{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "hitman",
            "id": 2708
         },
         {
            "name": "gangster",
            "id": 3149
         },
         {
            "name": "lovers",
            "id": 4663
         },
         {
            "name": "killer",
            "id": 15127
         }
      ],
      "imdb_id": "tt0089841",
      "video": false,
      "title": "Prizzi's Honor",
      "recommendations": [
         2321,
         31052,
         11541,
         10002,
         18254,
         10875,
         23954,
         2039,
         22414,
         12537,
         18129,
         12626,
         10083,
         10403,
         11062,
         11027,
         26617,
         11307,
         9452,
         28145
      ],
      "backdrop_path": "/2VeIxTJbmPXUqKLFnB8JFXNNY7b.jpg",
      "revenue": 26657534,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Charley Partanna",
               "gender": 2,
               "credit_id": "52fe4332c3a36847f8041baf",
               "name": "Jack Nicholson",
               "profile_path": "/z5kVLyn3sxj0wNRlFgVgT6deeRO.jpg",
               "id": 514,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Irene Walker",
               "gender": 1,
               "credit_id": "52fe4332c3a36847f8041bb3",
               "name": "Kathleen Turner",
               "profile_path": "/jM1gpAt7vsn81NsvWqJGVLhD8As.jpg",
               "id": 3391,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Eduardo Prizzi",
               "gender": 2,
               "credit_id": "52fe4332c3a36847f8041bb7",
               "name": "Robert Loggia",
               "profile_path": "/7xtU12KT12xjy4UY1O6VKpw7FLx.jpg",
               "id": 1162,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Don Corrado Prizzi",
               "gender": 2,
               "credit_id": "52fe4332c3a36847f8041bbb",
               "name": "William Hickey",
               "profile_path": "/zr7UJxP5MdEksn6ZaxeHbwr6o5Z.jpg",
               "id": 21282,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Maerose Prizzi",
               "gender": 1,
               "credit_id": "52fe4332c3a36847f8041bc7",
               "name": "Anjelica Huston",
               "profile_path": "/Aiyv68gYWcEe9OYhyCkOa09kjmy.jpg",
               "id": 5657,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Dominic Prizzi",
               "gender": 2,
               "credit_id": "52fe4332c3a36847f8041bbf",
               "name": "Lee Richardson",
               "profile_path": "/yqJMNzrKEwLIGnHky1DZZ9Gj4jw.jpg",
               "id": 21283,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Rosario Filargi \" Finlay \"",
               "gender": 2,
               "credit_id": "52fe4332c3a36847f8041bc3",
               "name": "Michael Lombard",
               "profile_path": "/p1F2ZLOxeRHx6JJYYAfrpbwfFx6.jpg",
               "id": 13938,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Amalia Prizzi",
               "gender": 0,
               "credit_id": "52fe4332c3a36847f8041bcb",
               "name": "Ann Selepegno",
               "profile_path": null,
               "id": 21284,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Phil Vittimizzare",
               "gender": 2,
               "credit_id": "572779cfc3a3682dee000a23",
               "name": "Vic Polizos",
               "profile_path": "/wDbsIdvxzEwenr0Z0AmstJyR5zl.jpg",
               "id": 149214,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Alvin Gomsky",
               "gender": 2,
               "credit_id": "59401d6dc3a368517f0059a9",
               "name": "Seth Allen",
               "profile_path": "/7OeuEUlIIH0D19GlRtwMyCXsxOh.jpg",
               "id": 81549,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "Angelo 'Pop' Partanna",
               "gender": 2,
               "credit_id": "5ac445509251416015080aee",
               "name": "John Randolph",
               "profile_path": "/r3HirIBplq3hjYYvO7JtyGP4SrF.jpg",
               "id": 18649,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "Lt. Hanley",
               "gender": 2,
               "credit_id": "5ac445730e0a260c390475ac",
               "name": "Lawrence Tierney",
               "profile_path": "/iFPg06kGUTdgRUkrYir3xt1Dt7c.jpg",
               "id": 6937,
               "order": 11
            },
            {
               "cast_id": 23,
               "character": "Soldier",
               "gender": 2,
               "credit_id": "5ac4458e0e0a264a4e08b846",
               "name": "Stanley Tucci",
               "profile_path": "/omGlTJF2IW5r3L3c5y0qkCt3hFr.jpg",
               "id": 2283,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4332c3a36847f8041b87",
               "name": "John Huston",
               "profile_path": "/1YV2m0943zGmgQaHHgtFuQhOEKl.jpg",
               "id": 6593,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4332c3a36847f8041b8d",
               "name": "Richard Condon",
               "profile_path": "/nXWFWgrs0kdDK9sqJhihDVegumR.jpg",
               "id": 14724,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 1,
               "credit_id": "52fe4332c3a36847f8041b93",
               "name": "Janet Roach",
               "profile_path": null,
               "id": 21279,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4332c3a36847f8041b99",
               "name": "Alex North",
               "profile_path": null,
               "id": 10536,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4332c3a36847f8041b9f",
               "name": "Andrzej Bartkowiak",
               "profile_path": "/K2pgHC907AUCim8WOkHOJpqERC.jpg",
               "id": 10765,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4332c3a36847f8041ba5",
               "name": "Kaja Fehr",
               "profile_path": null,
               "id": 21281,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4332c3a36847f8041bab",
               "name": "Rudi Fehr",
               "profile_path": null,
               "id": 7126,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4332c3a36847f8041bd1",
               "name": "John Foreman",
               "profile_path": null,
               "id": 9578,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5ab6e5af0e0a261feb012a7a",
               "name": "Gregg Rudloff",
               "profile_path": null,
               "id": 1341858,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 10.04105,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 2075,
      "vote_count": 106,
      "budget": 0,
      "overview": "A professional hit man and hit woman fall in love, only to discover that they have each been hired to kill the other.",
      "similar": [
         15542,
         186,
         8012,
         769,
         101,
         241554,
         245891,
         9005,
         1620,
         400,
         2069,
         11423,
         2252,
         2501,
         390043,
         156022,
         249070,
         13184,
         10651,
         483
      ],
      "original_title": "Prizzi's Honor",
      "runtime": 124,
      "poster_path": "/knlkgnYAhehN3RZjBVpMdDaGaU2.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "ABC Pictures",
         "id": 634,
         "origin_country": ""
      }],
      "release_date": "1985-06-14",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Huston"],
      "runtime": 130,
      "synopsis": null,
      "writers": [
         "Richard Condon",
         "Richard Condon"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0089841/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIwNzg2OTMxNF5BMl5BanBnXkFtZTcwMzM4MTAwMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Jack Nicholson, Kathleen Turner, Robert Loggia | See full cast and crew »"],
      "reviews": [
         "I loved this film when I saw it in 1985. To see it again after seeing film and series like the Godfather, The Soprans etc is a treat. It is a lovely film, elegant,well-played with a with lots of humor. Jack Nicholson pays the not very intelligent Charley Partanna with flair and a lot of humour. Kathleen Turner is beautiful as ever. The rest of cast is also very good. John Rudolph playing his charing but very dangerous father, Angelica Huston is magnificent as the deserted MaeRose who wants to revenge Cahrly but still loves him. The music is very much a part of this intelligent film. It is a joy to listen to how it comments or highlights what happens in the film. It is a loving parody of the mafia genre. A must-see for any one who likes this genre and for film lovers everywhere.",
         "This movie is often good and funny, but sometimes 's not focused enough. The story tries to cover a lot of themes, genres, and plot implications which doesn't always work. The best parts are the ones which deal with Charlie/Irene complicated relationship, in which you never know for sure if she's manipulating him from the beginning or not. One funny thing was the homage to Mafia movies, such as The Godfather. Some lines really hit their targets, too (Well, it's not many if you consider the size of the population, comes to mind). The acting is very good, and the best thing of the movie. Jack Nicholson plays an incredibly dumb character, that gets wonderfully developed by the end. He has a great comic timing. Kathleen Turner is very good, she has a great chemistry with Jack, and can look innocent and the moment after a total bitch. Besides, she ha a great, calm, sure delivery. Anjelica Huston is very funny playing mean / jealous / spoiled / manipulative/sweet, though lack of screen time hurts. The supporting are all great, and the one who plays the Don is hilarious, with his sadistic way of saying his lines. The direction is simple, but has some original shots, it works with this material. It's mostly steady camera. The music creates a contrast; it's quite cheery and happy, and that makes the movie funnier. It's a very dark comedy in my opinion, and sometimes a romance drama. It's worth watching, and original, but not a masterpiece. 7.5/10",
         "In New York, the hit-man Charley Partanna (Jack Nicholson) is like a son for his godfather Don Corrado Prizzi (William Hickey), who is a powerful mobster. In a wedding of a member of their family, Charley meets Irene Walker (Kathleen Turner) and he falls in love with her. Irene introduces herself as a tax consultant, but indeed she is a killer hired by the Prizzis for a \"contract\" in New York. They get married, and later Chaley realizes that she betrayed the Prizzis and had stolen their money in a casino. Charley has to face and decide between his code of honor with the Prizzi's family and his love for Irene. \"Prizzi's Honor\" is a masterpiece and certainly one of the best movies of the 80's. The story is engaging, having a very dark black humor and many plot points. Jack Nicholson, Angelica Huston in a Machiavelian role, Kathleen Turner (gorgeous, sexy and elegant) and William Hickey are amazing. The performance of the magnificent cast and the outstanding direction of John Huston are marvelous. I have seen this movie at least six times, and I do not get tired of watching it. Unfortunately \"Prizzi's Honor\" has not been released on DVD in Brazil. My vote is ten. Title (Brazil): \"A Honra do Poderoso Prizzi\" (\"The Honor of the Powerful Prizzi\")",
         "The mafia-comedy hardly seems like a new idea in 2009, we've seen it done well (\"The Sopranos\"), done alright (\"Married to the Mob\" or \"Analyze This\") and done badly (any number of films, \"The Godson\" for example) and it practically seems quite an established film subject, even a cliché one at this point. However, to fully understand \"Prizzi's Honor\" if you've seen some of the latter day mafia-comedies that followed it, you have to understand that at one point it was a novel idea to make a movie where mafia dons and hit men were comedic fodder. If you approach \"Prizzi's Honor\" expecting it to pick up where its successors left off, you're bound to be disappointed and will likely find it slow and its jokes stale. It's important to remember that this was the first major production to take the subject matter of \"The Godfather\" (high-level mafia families) and satirize it. It therefore must have seemed quite clever and groundbreaking in 1985 to lampoon the bizarre behaviors and concepts of honor that \"The Godfather\" and all its imitators had presented to us as reality. You really can't hold \"Prizzi's Honor\" accountable because so many others realized there was a satirical goldmine here and exploited it until the mafia-comedy film was as cliché as the mafia film, so when approaching this movie, I tried to remember nothing like this had really been done before. Prizzi's Honor opens with a wedding scene, which is probably a nod to \"The Godfather\", but it is a very weak and plodding scene by any definition and especially in comparison to the masterpiece it emulates. From there it's mostly uphill though, as Nicholson's tremendous acting is just enough to suspend disbelief as his character, the son of a high ranking mafioso, has a wacky whirlwind romance with a dashing woman he meets at the wedding, only to discover she is mixed up in scamming his own mafia family and she's actually a hired killer just as he is, but that his love for her is so strong that her background doesn't matter. Dating the enemy becomes more and more of a tightrope walk and increasingly their genuine wedded bliss seems to be interrupted by their real world jobs, which would suggest they should see each other as a threat, and both of them typically deal with threats by homicide, leading to a quite funny problem that recurs throughout the film. The film is very quirky, since it's basically making up a new style of film there's a lot of imagination and the plot itself doesn't fall into any clichés. However, it does exploit a basketful of mafia movie clichés, from the over-the-top Brooklyn drawl that Nicholson somehow pulls off to the corpse-like appearance of the decrepit yet ruthlessly brilliant Don Corrado Prizzi. As most of its successors have just combined mafia clichés with a basic plot, \"Prizzi's Honor\" seems quite fresh with its complex plot and wonderfully offbeat characters. \"Prizzi's Honor\" seems to have fallen by the cinematic wayside, at least, it's not on too many short lists of great films, and its lackluster IMDb rating (6.8) rates it below or alongside many works it actually paved the way for. To some extent I think it suffers from the notion that very few good \"serious\" films emerged from America in the 80s aside from the stuff Woody Allen was doing. While to some extent this movie does seem to reflect some of the mid-80s film-making malaise, there is a lot of very clever work being done here, and this really is a movie worth remembering.",
         "When a whole lot of his contemporaries were dead or in retirement, John Huston was still making some very good movies and even winning Oscars for family members. Prizzi's Honor was kind of a coda to his career having directing his father Walter for Best Supporting Actor for The Treasure Of The Sierra Madre in 1948, in 1945 daughter Anjelica Huston wins for Best Supporting Actress in Prizzi's Honor. That's a feat that will really be hard for any director to duplicate. The Prizzis are your Eighties version of the Corleones, a Mafia family headquartered in Brooklyn with far reaching interests including Las Vegas like the Corleones. Jack Nicholson is Charlie Partanna, not the most polished knife in the drawer, but one of the sharpest. Mafia families inbreed more than royalty or hillbillies and Charlie's expected to marry Maerose Prizzi who is played by Anjelica Huston, the ultimate Mafia princess. He's practically been raised to be her prince consort. But one look at the beautiful and sophisticated Kathleen Turner and Nicholson's hormones are at light-speed overdrive. But Kathleen's got a secret or two as well. She was in on a scam that took $720.000.00 from the Prizzis in Las Vegas. And in a real bow to women's liberation, something indeed from a tradition bound organization like the Mafia, she's also a hit woman with a contract on Nicholson. Some 20 years before those marrieds Brad Pitt and Angelina Jolie were trying to bed and kill each other simultaneously in Mr.&Mrs. Smith, Nicholson and Turner were going at it, tongue and gun. John Huston after 30 years finally repeated a black comedy, a much better black comedy than Beat The Devil. Besides Anjelica's win, Prizzi's Honor was up for several more Oscars in 1985 including Best Picture, Best Actor for Jack Nicholson, Best Supporting Actor for William Hickey, Best Director for John Huston and others. Prizzi's Honor is the kind of film where the jokes sneak up on you, don't expect belly laughs, but minutes after something is said, the line will kick in. And Prizzi's Honor was a great film to have to your credit in the twilight of your career for John Huston.",
         "\"Prizzi's Honor\" is one of those strange charmers that thrives on dark comedy and whacked situations. Mafia hit-man Jack Nicholson (Oscar-nominated) meets the super-erotic Kathleen Turner at a wedding and of course ends up dumping girlfriend Anjelica Huston (in a well-deserved Oscar-winning turn). The fact that Huston is the daughter of one of Nicholson's associates only makes the plot thicken. What Nicholson does not know is that Turner is really an assassin herself. Will he find out that his lover by night is really a hit-woman by day? And will he learn in time that the two have actually been hired to kill each other? Also along for the ride are scene-stealers Robert Loggia and William Hickey (who received an Oscar nod as the family's don). \"Prizzi's Honor\" was the final venture for legendary director John Huston (who was near death when he was Oscar-nominated for this). That little tidbit does not change the fact that \"Prizzi's Honor\" is really a strange experience that does not completely succeed. It is a movie that serves its purpose, but the ending does not justify the means used to get there. The Oscar-nominated screenplay makes itself out to be much more intelligent than it really is and ultimately Nicholson and Turner have to carry the production. Still a good movie, but over-rated and even a bit disappointing when all is said and done. 4 stars out of 5.",
         "I personally love Prizzi's Honor, it is one of my favourites. John Huston does a very good job directing, and while black comedy is not what I call his comfort zone, he does show talent for it. The film looks stylish with the cinematography and scenery great. The script is great fun with some delightful black comedy elements, and while the story has its bizarre moments it is compelling all the same. The film doesn't feel boring or dull either, and I always have fun watching it. The cast are wonderful, Jack Nicholson and Kathaleen Turner are very believable and Robert Loggia is great too but it is Anjelica Huston who steals the movie. Overall, I love Prizzi's Honor. 10/10 Bethany Cox",
         "Without a doubt in my opinion one of the best and most underrated films of all time has to be 1985's \"Prizzi's Honor\". The film to some may seem like a black hearted comedy and somewhat of a \"Godfather\" ripoff, yet for me I found enough drama, intrigue, and chemistry between the characters to go along with a well written script that made it an instant classic. The performance from Jack Nicholson is great and along with the veteran cast the support is the backbone of the film. Directed by legendary John Huston in one of his last works, \"Prizzi's Honor\" is a wickedly sly and well crafted mob tale of romance, family conflict and defending pride and honor that comes with family. Set in Brooklyn, New York the Prizzi family the oldest and richest well known crime family starts off with the wedding of head Don Prizzi(William Hickey's) granddaughters wedding. As the relaxing theme and face shots of the characters gets the viewer attached early to the drama from start to finish. Enter Charley Partanna(played to perfection by Jack) the head hit-man of the Prizzi family who's tough and gritty and direct and to the point with a high temper. Yet upon Charley's meeting of an elegant and attractive sexy blond an out of town lady named Irene(Kathleen Turner)and after Charley visits Irene on the west coast at her California home, it doesn't take long before the two develop a hot and steamy passionate romance affair based on sex which both mistake it for blind love. As the film develops the viewer quickly sees that the Irene Walker character has a dark and hidden past with a closet full of secrets, yet Charley soon accepts her hand in marriage once some things are ironed out. Now family conflict and displeasure arrives when the Prizzi's tell about the real identity of Irene and her real job and mission shocks Charley. This also hurts an ex flame of Charley's that being Prizzi granddaughter Maerose(Anjelica Huston)and Anjelica was wickedly fantastic in her performance her character is so intelligently cunning with advice. The drama heightens as with all mob dramas when watching you have to figure out what's next and think about who's gonna double cross who next and the plot has many subplots that you must pay attention to. As one can see that both Irene and the Prizzi's are sly and greedy as they will look out for their own self interest and wealth. The support of the family members of the Prizzi's like Eduardo(Robert Loggia)Angelo Pop Partanna(John Randolph)Dominic(Lee Richardson)and last but not least legendary Don Corrado(William Hickey) finally wear on Charley making him choose between family and love, proving that blood is thicker than water and that honor and being loyal is most important with family. As in the films ending as the viewer can see the final scene between Charley and Irene proves that love hurts and it cuts like a knife! It may be amoral yet some relationships weren't meant to last. Overall \"Prizzi's Honor\" is a classy film that's one of my best to watch numerous times the performances and story just works so well with the characters chemistry. As the supporting performances from Loggia, Randolph, and Richardson are good backbone, and William Hickey's performance is old and crafty yet beautifully stunning and at ease. As for the females Anjelica was marvelous and sly and cunning, yet you feel sorry for her depressed Maerose character, and Kathleen Turner is fabulously sexy and super erotic as the sneaky and deceptive and stunning Irene Walker. Last but not least the legend and all time greatest actor Jack Nicholson puts the icing on the cake with one of his better and more underrated performances as tough and gritty mob hit-man Charley Partanna who's walk, talk, and dress along with actions made him seem so real and believable. John Huston really had a winner here proving that the most important thing is family honor them and respect them and that's all that matters. Remember family is the most important thing and it should be special.",
         "Many people refuse to believe that this is a comedy. They are wrong. Just watch Angelica Huston's screamingly funny moment as she brings in her father's dinner. She is walking towards him behind his back... calm, cool, suave - and suddenly transforms herself into the pitiful, broken, submissive daughter that her father is expecting her to be. She has the hunched martyr's pose down pat - and it is brilliantly funny. That said, the problem with Prizzi's Honor - which I enjoyed immensely by the way - is that too many things just don't gel. For one thing, Nicholson kills someone in California, and we discover (at the same time as Nicholson) that his (Nicholson's) major love interest, Kathleen Turner, is in fact married to the man he has just killed. And they continue their lives as if nothing has really happened. They continue their love affair and the body in the garage is completely forgotten. But wouldn't the police or someone have found out that he is dead? Wouldn't the police have wanted to speak to interrogate his wife? None of this happens. .. which, is, of course, nonsense. Many people have complained that they can't believe in the characters - and I agree with them. But I am not complaining - just agreeing with their statement. I don't know if the director, John Huston, was totally up to making this film, as he was deathly sick and probably knew that it would be his last one. But I suspect that Huston decided to make Prizzi's Honor and go out in style - for that is really what this film is about - an exercise in style. Nicholson is the arch stereotype of the dumb hoodlum; Turner is the vamp of all time; the Godfather of the entire Prizzi clan couldn't be more brutal or ghoulish, especially when he is smiling - all done with a certain camp flair. And Huston's daughter Angelica plays the long-suffering \"wronged woman\" with proud, wicked vengefulness. These are all well-known types, yet here they come across as hysterically exaggerated stylized versions of what we have seen in other movies. Huston is too good a director to have done this by accident. He wanted to go out in style - and with Prizzi's Honor - he did so, most honorably.",
         "So many films glorify the mafia, even those like 'Goodfellas' which pull no punches still allow a residue of glamour to stick to their portrayal of the wise-guy life. So 'Prizzi's Honor', which ridicules its protagonists and shows them to be anything but wise, is a welcome sort of mafia film. Unfortunately, although it's reasonably entertaining, the film ultimately doesn't wholly succeed in any respect; too daft to work as black comedy, too slow to work as riotous farce, to humorously conceived to work as tragic drama. Jack Nicholson is good as the dumb hit man Charley, but the plot leaves us unsure whether we should laugh at him or cry with him, and in the end I felt inclined to do neither. Personally, I prefer Jim Jarmusch's 'Ghost Dog', another offbeat look at organised crime."
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["ABC Motion Pictures"],
      "summaries": [
         "Charley Partanna is a hit-man who works for the Prizzis, one of the richest crime syndicate families in the country. Unbeknownst to Charley,the Prizzis just hired Irene Walker, a free-lance killer, to eliminate someone who double-crossed them. When Irene and Charley fall in love their jobs become complicated. Their jobs become impossible when each is given a contract that neither can go through with.",
         "In New York, the hit-man Charley Partanna is like a son for his godfather Don Corrado Prizzi, who is a powerful mobster. In a wedding of a member of their family, Charley meets Irene Walker and he falls in love with her. Irene introduces herself as a tax consultant, but indeed she is a killer hired by the Prizzis for a \"contract\" in New York. They get married, and later Chaley realizes that she betrayed the Prizzis and had stolen their money in a casino. Charley has to face and decide between his code of honor with the Prizzi's family and his love for Irene.",
         "A professional hit man and hit woman fall in love."
      ],
      "budget": 0
   },
   "movielensId": 3685,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1985-06-14",
      "dvdReleaseDate": "2003-09-16",
      "directors": ["John Huston"],
      "runtime": 124,
      "movieId": 3685,
      "title": "Prizzi's Honor",
      "mpaa": "R",
      "actors": [
         "Jack Nicholson",
         "Kathleen Turner",
         "Robert Loggia",
         "William Hickey",
         "Anjelica Huston",
         "Lee Richardson",
         "Michael Lombard",
         "Ann Selepegno",
         "Vic Polizos",
         "Seth Allen"
      ],
      "imdbMovieId": "0089841",
      "originalTitle": "Prizzi's Honor",
      "genres": [
         "Romance",
         "Comedy",
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": ["L6W3S9IrINw"],
      "plotSummary": "A professional hit man and hit woman fall in love, only to discover that they have each been hired to kill the other.",
      "tmdbMovieId": 2075,
      "avgRating": 3.57775,
      "releaseYear": "1985",
      "numRatings": 2386,
      "posterPath": "/knlkgnYAhehN3RZjBVpMdDaGaU2.jpg"
   }
}