{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "utopia",
            "id": 3469
         },
         {
            "name": "invasion",
            "id": 4278
         },
         {
            "name": "surrealism",
            "id": 9887
         },
         {
            "name": "robot",
            "id": 14544
         }
      ],
      "imdb_id": "tt0095525",
      "video": false,
      "title": "Gandahar",
      "recommendations": [
         22501,
         258945,
         65455,
         73127,
         338942,
         54407,
         45987,
         18242,
         124091,
         35922,
         62843,
         32728,
         55584,
         54195,
         301767,
         27510,
         77955,
         26118,
         30593,
         35453
      ],
      "backdrop_path": "/vFkGRuHP6IB711PZepZiByENbEL.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Sylvin (voice)",
               "gender": 2,
               "credit_id": "52fe4443c3a368484e01913d",
               "name": "Pierre-Marie Escourrou",
               "profile_path": "/sMnBjRyPFTg4BxLQ6NCQcdKEtBc.jpg",
               "id": 32688,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Airelle (voice)",
               "gender": 1,
               "credit_id": "52fe4443c3a368484e019141",
               "name": "Catherine Chevallier",
               "profile_path": "/A5EyHRqZV5I7w1oMTjIYt1pUVXc.jpg",
               "id": 53769,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Métamorphe (voice)",
               "gender": 2,
               "credit_id": "52fe4443c3a368484e019145",
               "name": "Georges Wilson",
               "profile_path": "/t6CVZbtyzdoZOAy2SGQtBrCKUew.jpg",
               "id": 7277,
               "order": 2
            },
            {
               "cast_id": 15,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4443c3a368484e01916d",
               "name": "Anny Duperey",
               "profile_path": "/qu7goZBv9ETl8BbIagaCPzNwQ0O.jpg",
               "id": 24475,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4443c3a368484e019171",
               "name": "Jean-Pierre Ducos",
               "profile_path": null,
               "id": 3595,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4443c3a368484e019175",
               "name": "Christine Paris",
               "profile_path": null,
               "id": 1198129,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4443c3a368484e019133",
               "name": "René Laloux",
               "profile_path": "/aaQ1lye1Rj3xz9jV6hlbbvHTIxQ.jpg",
               "id": 80260,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4443c3a368484e019139",
               "name": "Jean-Pierre Andrevon",
               "profile_path": null,
               "id": 227639,
               "department": "Writing",
               "job": "Scenario Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4443c3a368484e01914b",
               "name": "Gabriel Yared",
               "profile_path": "/2qihER03E1ISTUYqHgUKBA9ow93.jpg",
               "id": 5488,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4443c3a368484e019151",
               "name": "Philippe Caza",
               "profile_path": null,
               "id": 1063342,
               "department": "Visual Effects",
               "job": "Animation Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4443c3a368484e019157",
               "name": "Raphael Cluzel",
               "profile_path": null,
               "id": 1197605,
               "department": "Writing",
               "job": "Dialogue"
            },
            {
               "gender": 0,
               "credit_id": "52fe4443c3a368484e01915d",
               "name": "Henri Rollin",
               "profile_path": null,
               "id": 1197606,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4443c3a368484e019163",
               "name": "Jean-Claude Delayre",
               "profile_path": null,
               "id": 1197607,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4443c3a368484e019169",
               "name": "Leon Zuratas",
               "profile_path": null,
               "id": 1197608,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Adventure",
            "id": 12
         }
      ],
      "popularity": 3.641052,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 22500,
      "vote_count": 30,
      "budget": 0,
      "overview": "René Laloux, created Gandahar, his final animated feature film. Based on Jean-Pierre Andrevon’s novel Les Hommes-machines contre Gandahar (The Machine-Men versus Gandahar) This fascinating adult animation combines Laloux’s famous imagination with that of animation designer Philippe Caza. “My quest began with a riddle. ‘In a thousand years, Gandahar was destroyed, and and all its people massacred.  A thousand years ago, Gandahar will be saved, and what can’t be avoided will be.” -Sylvain. This film is set on the planet Gandahar where peace reigns and poverty is unknown. The utopian lifestyle is upset by reports of people at the outlying frontiers being turned to stone. Sent to investigate, Prince Sylvain (John Shea) crashes and is rescued by the Deformed, hideous genetic experiments gone wrong and left to fend for themselves. With their help, Sylvain discovers that the Metamorphosis, a gigantic brain also created in an experiment, is trying to destroy Gandahar.",
      "similar": [
         605,
         157336,
         87101,
         19959,
         19,
         2048,
         262543,
         39254,
         604,
         644,
         76341,
         157350,
         101299,
         91314,
         333339,
         339964,
         309809,
         9693,
         2666,
         218
      ],
      "original_title": "Gandahar",
      "runtime": 83,
      "poster_path": "/rDNdFGR4M3558JHncWTG42YQCGD.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Films A2",
         "id": 875,
         "origin_country": ""
      }],
      "release_date": "1987-12-11",
      "vote_average": 7.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.eurekavideo.co.uk/moc/catalogue/gandahar",
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["René Laloux"],
      "runtime": 78,
      "synopsis": null,
      "writers": [
         "René Laloux",
         "Jean-Pierre Andrevon"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0095525/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc3NzgwMTAwMF5BMl5BanBnXkFtZTYwMjQ4NTg5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Glenn Close, Christopher Plummer, Pierre-Marie Escourrou | See full cast and crew »"],
      "reviews": [
         "'Light Years' is a work of sci-fi animation that really stands apart from the pack. In order to enjoy this film, one must have an appreciation of science fiction altogether. For those individuals such as Leonard Maltin, whom dismissed this movie as a pretentious 'talky' cartoon, you must understand that 'Light Years' tells a very human story about irresponsible inventions and ignorance in a completely ALIEN setting; this is the true magic of the film! I thought the dialogue was creative and the story was fascinating. The creatures and characters are beyond description, and the ending will blow you away. True sci-fi fans I think should dismiss Leonard Maltin's review and rent this one!",
         "It truly is a shame that no one's ever heard of this breathtakingly beautiful piece of animation. It's also a shame that animation is not usually employed in America as an adult art form. Animation shows us lifeforms and landscapes the likes of which cannot be seen on this Earth. Anyway, this is an amazing film that should be checked out by all anime fans as well as fans of films like Heavy Metal, or master animator Ralph Bakshi's works. Light Years is one of the most enlightening animated works on this planet.",
         "French animator Rene Laloux of \"Fantastic Planet\" renown, attempted to make another surreal sci-fi adventure with the 80's \"Ghandar\" or as Isac Asimov and Harvey Wienstien decided to call it for those of us in the states \"Light Years\", which since no... space travel takes place, and since the movie is about a fictional country called \"Gandahar\" is probably a bad title. \"Light Years\" I guess sounds more sci-fi-ish, and if this film was to succeed in the states(it didn't) it was gonna need every bit of conventionality it could muster. The story is a complex one involving the standard sci-fi tropes of eugenics, time travel, death, and utopia, and though it's certainly more involved than most animated sci-fi (a good deal of the time were watching the characters talk), it's really the visualization of the world and it's inhabitants which makes this movie worth seeing. Like \"Fantastic Planet\" before it, Laloux's environments are some of the most alien that have ever been imagined. The landscape is often undulating Daliesuqe deserts, which strange trees which resemble simultaneously bodily organs and geysers, a young girl offering her breast to a new born who looks like a tapir, born out of a grown embryonic plant, a city of underground mutants who resemble Blemmyes, ancient African monsters with heads beneath their shoulders, an army hollow soldiers who turn people into statues, video camera like birds who can lift entire buildings in swarms, and of course a colossal mile wide sentient brain in the middle of the ocean. Laloux uses sci-fi story structures to create, very evocative images that do not look like anyone else's, ever, something few filmmakers in any medium or genre, can claim with straight face. That being said the English voice acting is just decent, not great but decent, it keeps the story moving, but doesn't draw you into any of the characters. \"Light Years\" like \"Fantastic Planet\" or the animated films of Svankmajer are more concerned with form than content, but not oblivious of the latter. So if you like heady sci-fi, visually stunning design, and unique animation, this is not to be passed up. If not it's probably not bad to see once anyway, just for the visual treat of it all, and the more I mull over the story, not the plot, I'm more impressed with how well and vividly it told me a story I've heard a hundred times before.",
         "It's not an outstanding movie by any means, but it gets the job done and entertains. One has to remember that when viewing sci-fi often the plot takes precedence over character. Most plot driven films and stories are like that: We're given the bare bones of our protagonist, and watch him or her weave their way through a story. Such it is with \"Light Years.\" The animation is certainly above the quality of your typical commercial studio, but is not as dazzling as say a Japanese Anime space opera, nor a Disney Production feature; but it does have a certain quality unto itself. Even so the movie could've used more shots (cutaways and general coverage) to help move the story and highlight the characters more. As it stands more the shots are rather static, and the animation in them shifts gears a little too often. In some scene the animation is very smooth, where other times is seems very long and drawn out, or just not well staged. The film itself has action, but some of the it is stilted and painfully slow, where other times it moves quite well. The dubbing is adequate, though, like all dubbed films, one gets the sense that it doesn't quite catch the tones and inflections of the voices from the original French cast. Technology and regimented existence are pitted against the organic and under-dogs of Ghandahar in a typical sci-fi theme. The film's worth a night's rental, and if you like collecting rare sci-fi this might be one to add to your collection. Otherwise it may only be worth a single viewing. *EDIT* French Region 2 DVD review, Jan 3, 2010 Well, I finally saw the original French film in all its entirety. As an American I have to say that I appreciate the additional footage, and can nod at the more subtle pacing, but I do have to say that I think the Americanized version has some pluses going for, namely in the music. The original French score underlines the basic theme of what is being presented. There are no heroics on the battlefield nor purely desperate moments as would be conveyed by the American musical score. The other subtleties are apparent, and I think I better understand why the American producers did what they did by sexing up what they could. The French film is more prosaic and \"European\" (for lack of a better term) in its presentation of a world in crisis. There's an emotional malaise characteristic of European cinema as a whole that comes across in the original French version. There's a subtle (and not so subtle) nihilistic quality here. Perhaps there's a bit of Nazi occupation still resonating within this film. All I can really say is that it's a different film from the American version. I'm not sure I prefer one too much over the other. There's a lack of celebration in the French film. There's a kind of fatalistic quality to that is twisted but still present in the American version. Whereas the French version of this film emphasizes weathering the storm and completing the objective, the American version emphasizes confronting the challenge in a way that we Americans have always done. There's a lack of ambient depression that seems to hang and mildly envelope European art, film included. A kind of ethereal drawn out emotionalism that you'd never see in an American film, but is fairly strong in Russian and Swedish cinema, and hits French and Italian films in a less powerful vein. I would be interested in seeing a DVD of the American version to make a more thought out and proper comparison. But I guess that'll have to wait.",
         "Well, I have to admit that I hunted this particular movie for 10 years. I've seen it for the first time when I was in my early teens (12 or 13, not sure), and I was really impressed by the animation and the plot. Besides, I didn't have a chance to see a lot of sci-fi movies (let alone animated movies) back then. Now, that I've been able to see it again, I find it really outdated (or \"old-skul\") - pretty much, it felt like Kubrick's \"Space Odissey\" animated, only that \"Gandahar\" came out in late 80es, when \"Akira\" set a new industry standard. The plot is more or less predictable, the sci-fi backgrounds looked like something from mid-70es, and the battle scenes are even worse than those of cheap Japanimation TV series. Despite all the bad things above, this movie got a touch of a master. First, I have to admit that movement animation feels highly original (I can't think of anything similar) and is done with a lot of skill. Second, the voices (in French) are much better than anything I've heard. Finally, I find character design very good. To sum up, I don't think that this is quite the right movie to see \"just for fun\", but for those who are interested in animation it is definitely a must.",
         "about time and utopic realities. The animation is wonderful and detailed. Everything serves perfectly the telling of the story. And the hand of Asimov is not only in the novel, but also in the adaptation to the screen, so that is faithful to his representation of life. Worth watching a few times.",
         "This film was one of the first science fiction cartoons I had seen. Perhaps that is the reason for my high praise of the film. I was engrossed from the very beginning. The dialouge was masterful. What the animation lacked, the combination of the writing and my imagination more than made up for. This film has a PG rating for brief nudity, but I think that children ages 10 on will be very pleased. It treats the audience not as a child or an adult. If you are a fan of hardcore science fiction then this film is for you. If you have never seen a single sci-fi film before, then this is the perfect blend of action and thought provoking images to introduce you to the genre. I will not get into details about the story. You can read the synopsis. In short, I highly recommend this film.",
         "The Harvey Weinstein-edited, American version of Rene Laloux's ambitious 1988 feature \"Gandahar\" is a lavish, mostly satisfying animated spectacle. It suspends Isaac Asimov's sci/fi philosophy, Cold-War politics and psychedelic, Daliesque imagery with conventional plotting that keeps the story clicking along briskly with an accessible, user-friendly approach. Having not seen the pre-Weistein version, it is frustrating to wonder how much of Laloux's original intent was lost in Weistein's decidedly Americanized cut, but what remains is an intelligent, fresh and well-layered fantasy romp. Weinstein seemed to hold \"Star Wars\" as a reference point, as he wielded the classical, Campbellian hero structure to ground its complex visual designs in familiar storytelling. These designs immediately plunge the viewer into the peaceful alien civilization of Gandahar, a beautiful blue world inhabited by intelligent creatures who enjoy a blissful political harmony. Gandahar is so peaceful, in fact, that its leaders completely neglect technological advancement due to a universal contentedness in the progress of the civilization. Inevitably, the peace is threatened when mysterious, unidentified rays are reported in nearby areas, causing Gandahar's leaders to send their young, precocious prince Sylvain to investigate the possible alien threat. After coming into contact with the grotesquely deformed remaining members of a previous civilization, Sylvain learns of an army of metallic soldiers who are operated by an enormous brain called the Metamorphosis. They pull their resources together and fight the army using their wits, giving way to a third act that puts its building ideas into a fine focus while also delivering the expectedly rousing action goods. \"Gandahar\" grounds its thesis in the fact that a civilization's strength lies in a fully integrated sense of past, present and future. The historical connections are obvious, as the film cleverly points out the inherent weakness of domineering political powers that combine brute force and radicalism in order to eradicate truths demonstrated by history and tradition. As a political statement, the film works incredibly well, as its blend of sci/fi philosophy and politics fit together naturally - reminding one that great mythology is traditionally political. As an auteur piece, however, it's hard to ignore an overall lack of sheer, artistic wonder. Weinstein's (or whoever's) familiar structuring balances the film's many layers elegantly, but there is a definite artistic compromise present that will likely be disappointing to fans of Laloux's \"Fantastic Planet.\" Much of the movie has a Disney-like simplification of its world and logic that prevents it from fully captivating the viewer with its whimsical absurdities. \"Fantastic Planet\" is spellbinding because it treats its viewer like a visiting alien, never over-explaining or belaboring its genuinely bizarre imagery and focusing mainly on an amazingly distanced, otherworldly mood \u0096 one which would have been suffocated by a driving, centralized plot. In this way, \"Gandahar\" disappoints in its overall familiarity, favoring traditional story tropes over bold originality. To a viewer looking for a multifaceted, accessible science fiction fantasy, however, the film is a treat. With so many balls in the air, it understandably picked a straightforward approach and is able to satisfy a wide variety of viewers. It's just unfortunate that such an approach is what separated a good film from a potentially great film.",
         "It is a very good anticipation movie. the part describing the lovely and environmental gandahar is wonderful. While renewing a 70's vision of sex, nature and happiness, the colors, sounds and pictures (a young girl offering her breast to a new born invented animal who looks like a tapir, born out of a grown plant). the story: mixing future and past, threatening the present by having itself created in the past, the elements that will be dangerous in the future. It is also a huge criticism of the liability of the human being regarding its evil habit to master the nature, th human body and science. In the end, scientific rubbish save the human beings from a great scientific discovery they made years ago. Happiness is conditioned by assuming one's mistakes. A great philosophical tale. The blue skinned woman with head-wings is very impressive, as well as the very beautiful nude females.",
         "I noticed this movie at a local rental place the other week and thought, 'What on Earth is THIS?' My dad has a book with 17,000 movie reviews--just reviews ranging from a sentence to a couple of paragraphs--and they gave it 2 1/2 stars--3 being good--so it was almost good (to them). They chastised the almost non-existent characterizations, which I agree; we're given a character, we're given about half a minute background on them, and then this is what the character has to do. I was surprised that they didn't mention the almost non-existent voice \"acting\" (note the quotes), as everyone just pretty much mumbled their lines...even such a big talent as Glenn Close (playing the queen) didn't help. However, please note these are VERY minor gripes. I would've given the movie three stars myself. It's not the typical sci-fi, with the stupidity of childhood geniuses and robots with feelings abound (and I don't think the stereotypes of \"oh no, it's sci-fi AND a cartoon!\" help either). It's very imaginative, but pretty dark and apocalyptic; probably not for kids under the age of 6, if not 8. And on a side note, there was some pretty good music in it, too, and a lot of it."
      ],
      "genres": [
         "Adventure",
         "Sci-Fi",
         "Animation",
         "Fantasy"
      ],
      "productionCompanies": [
         "Col.Ima.Son",
         "Films A2",
         "Revcom Télévision"
      ],
      "summaries": [
         "Gandahar is a utopian world of rare beauty and tranquility, the result of extensive mutation and genetic experimentation. But the perfect peace is shattered when a mysterious evil force invades this idyllic serenity, turning people into stone with petrifying rays. The Council of Women hold court and decide to send Sylvain, son of Queen Ambisextra, on a mission to destroy the enemy. Together with the beautiful and adventurous Arielle, the enemy that Sylvain eventually discovers very far from his home is the ultimate failure of Gandaharian scientific experimentation. It is a giant brain known as the Metamorphis, which has created an indestructible army of metal men to destroy Gandahar. Sylvain must battle the Metamorphis, but not until 1000 years in the future.",
         "Ganhadar is an idyllic paradise where it's people have mastered both themselves and their environment. Everything exists in perfect harmony with the world, providing enlightenment for both the body and soul. Paradise is lost when a malevolent force begins to attack the outlying regions of the planet, attacking small villages and turning their people into stone. Sylvain is dispatched by the Council of Women to find out what is menacing the peaceful world. He is later attacked by strange bird-like creatures, rendering him unconscious when it falls on him. He wakes up in the presence of deformed figures, who are not the enemy, but instead mutated products of ancient scientists, perhaps during the search to perfect everything. He escapes and watches metallic drones, who are the attackers, passing through a metal doorway of some sort. From here he discovers the Metamorphisis, a gargantuan brain mass. He returns to the capital with Arielle, but not too soon to find it being attacked by the Men of Metal. The Metamorphisis and the Men of Metal are from a thousand years in the future. Sylvain is placed in suspended animation for a millenium, while the Metamorphisis destroys the world. When he wakes up, the Metamorphisis has become a sick, evil thing. It's cells have degraded and the stone people are brought into the future, re-animated, and then killed off to be used in the brain tissue. Sylvain must destroy the brain in order to change history, but is it possible?",
         "An evil force from a 1000 years in the future begins to destroy an idyllic paradise, where the citizens are in perfect harmony with nature."
      ],
      "budget": 0
   },
   "movielensId": 3687,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1987-12-11",
      "dvdReleaseDate": null,
      "directors": ["René Laloux"],
      "runtime": 83,
      "movieId": 3687,
      "title": "Gandahar",
      "mpaa": "",
      "actors": [
         "Pierre-Marie Escourrou",
         "Catherine Chevallier",
         "Georges Wilson",
         "Anny Duperey",
         "Jean-Pierre Ducos",
         "Christine Paris"
      ],
      "imdbMovieId": "0095525",
      "originalTitle": "Gandahar",
      "genres": [
         "Animation",
         "Science Fiction",
         "Fantasy",
         "Adventure"
      ],
      "youtubeTrailerIds": ["My7yQaP5FlM"],
      "plotSummary": "René Laloux, created Gandahar, his final animated feature film. Based on Jean-Pierre Andrevon’s novel Les Hommes-machines contre Gandahar (The Machine-Men versus Gandahar) This fascinating adult animation combines Laloux’s famous imagination with that of animation designer Philippe Caza. “My quest began with a riddle. ‘In a thousand years, Gandahar was destroyed, and and all its people massacred.  A thousand years ago, Gandahar will be saved, and what can’t be avoided will be.” -Sylvain. This film is set on the planet Gandahar where peace reigns and poverty is unknown. The utopian lifestyle is upset by reports of people at the outlying frontiers being turned to stone. Sent to investigate, Prince Sylvain (John Shea) crashes and is rescued by the Deformed, hideous genetic experiments gone wrong and left to fend for themselves. With their help, Sylvain discovers that the Metamorphosis, a gigantic brain also created in an experiment, is trying to destroy Gandahar.",
      "tmdbMovieId": 22500,
      "avgRating": 3.31395,
      "releaseYear": "1987",
      "numRatings": 86,
      "posterPath": "/rDNdFGR4M3558JHncWTG42YQCGD.jpg"
   }
}