{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "ku klux klan",
            "id": 529
         },
         {
            "name": "teenager",
            "id": 13130
         },
         {
            "name": "lust",
            "id": 14794
         },
         {
            "name": "mischief",
            "id": 15075
         },
         {
            "name": "religious fanatic",
            "id": 161264
         },
         {
            "name": "teaching",
            "id": 161266
         },
         {
            "name": "misadventure",
            "id": 161267
         },
         {
            "name": "duringcreditsstinger",
            "id": 179431
         }
      ],
      "imdb_id": "tt0086129",
      "video": false,
      "title": "Porky's II: The Next Day",
      "recommendations": [
         23919,
         10246,
         12695,
         27590,
         21989,
         25164,
         9409,
         10306,
         19287,
         15413,
         28605,
         12309,
         11896,
         12525,
         87704,
         25133,
         34086,
         28692,
         11064,
         10780
      ],
      "backdrop_path": "/xM9ZDrfMQZlz9PLnfipA96xXsMx.jpg",
      "revenue": 33759266,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Pee Wee",
               "gender": 0,
               "credit_id": "52fe47eb9251416c750a9cf3",
               "name": "Dan Monahan",
               "profile_path": "/1dyNIvDWNmqYydrlstwT9tozc3a.jpg",
               "id": 64221,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Tommy",
               "gender": 2,
               "credit_id": "52fe47eb9251416c750a9cf7",
               "name": "Wyatt Knight",
               "profile_path": "/dLr3dKF2RvMX9RaxcrPHYyOaqKZ.jpg",
               "id": 64223,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Billy",
               "gender": 2,
               "credit_id": "52fe47eb9251416c750a9cfb",
               "name": "Mark Herrier",
               "profile_path": "/hZ1o465FgKXTp6OPgZVrt5ygVWx.jpg",
               "id": 64222,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Mickey",
               "gender": 2,
               "credit_id": "52fe47eb9251416c750a9cff",
               "name": "Roger Wilson",
               "profile_path": null,
               "id": 174653,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "TIm",
               "gender": 0,
               "credit_id": "52fe47eb9251416c750a9d03",
               "name": "Cyril O'Reilly",
               "profile_path": "/e9c8qaVnuckiZfc8xSkjFifVaGt.jpg",
               "id": 64224,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Meat",
               "gender": 2,
               "credit_id": "52fe47eb9251416c750a9d07",
               "name": "Tony Ganios",
               "profile_path": "/zTpWUjo86uwTevyOblEozt3ae7I.jpg",
               "id": 3010,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Wendy",
               "gender": 1,
               "credit_id": "52fe47eb9251416c750a9d0b",
               "name": "Kaki Hunter",
               "profile_path": "/cTth4MZVSHE53k3gLIlaTbkvK30.jpg",
               "id": 86994,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Brian",
               "gender": 2,
               "credit_id": "52fe47eb9251416c750a9d0f",
               "name": "Scott Colomby",
               "profile_path": "/c0MjR5up8PL9QQeV7kiCCsgql8v.jpg",
               "id": 167367,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Balbricker",
               "gender": 1,
               "credit_id": "52fe47eb9251416c750a9d13",
               "name": "Nancy Parsons",
               "profile_path": "/pQUaImbKVF3TicftBdCpMSP29FM.jpg",
               "id": 91842,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "John Henry (as Joseph Runningfox)",
               "gender": 0,
               "credit_id": "52fe47eb9251416c750a9d17",
               "name": "Joseph Runningfox",
               "profile_path": "/op6toTlGvwPyGAmUBXxr4n1RMyu.jpg",
               "id": 97058,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Carter",
               "gender": 2,
               "credit_id": "52fe47eb9251416c750a9d1b",
               "name": "Eric Christmas",
               "profile_path": "/dCs1h8vhRjNNfmJeHuVgcVE6ZwI.jpg",
               "id": 4976,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Reverend Flavel",
               "gender": 2,
               "credit_id": "52fe47eb9251416c750a9d1f",
               "name": "Bill Wiley",
               "profile_path": null,
               "id": 154584,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Gebhardt",
               "gender": 2,
               "credit_id": "52fe47eb9251416c750a9d23",
               "name": "Edward Winter",
               "profile_path": null,
               "id": 157661,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Sandy Le Toi",
               "gender": 1,
               "credit_id": "52fe47eb9251416c750a9d27",
               "name": "Cisse Cameron",
               "profile_path": "/qOJ9sKjVdmCUlk2rUOZpo8VftrH.jpg",
               "id": 108155,
               "order": 13
            },
            {
               "cast_id": 19,
               "character": "Mrs. Morris",
               "gender": 0,
               "credit_id": "58f28202c3a368085a002f1f",
               "name": "Ilse Earl",
               "profile_path": null,
               "id": 1476391,
               "order": 14
            },
            {
               "cast_id": 20,
               "character": "Ted Jarvis",
               "gender": 2,
               "credit_id": "58f2820ec3a368084500332c",
               "name": "Art Hindle",
               "profile_path": "/cyse2WKDJ5GXCGWGtw4CHsamv8i.jpg",
               "id": 41256,
               "order": 15
            },
            {
               "cast_id": 24,
               "character": "Bill Jumper (as Anthony Penya)",
               "gender": 0,
               "credit_id": "58f28295c3a36807df002f82",
               "name": "Anthony Pena",
               "profile_path": null,
               "id": 103572,
               "order": 16
            },
            {
               "cast_id": 23,
               "character": "Steve",
               "gender": 0,
               "credit_id": "58f2827cc3a368081e003348",
               "name": "Rod Ball",
               "profile_path": "/fdy5Y42o5S34gUtJCJJz6Yuwoqp.jpg",
               "id": 1750452,
               "order": 17
            },
            {
               "cast_id": 21,
               "character": "Commissioner Couch",
               "gender": 2,
               "credit_id": "58f282369251413d7600303a",
               "name": "Richard Liberty",
               "profile_path": null,
               "id": 54858,
               "order": 18
            },
            {
               "cast_id": 22,
               "character": "Boa Man (as Rooney Kerwin)",
               "gender": 2,
               "credit_id": "58f28255c3a368081e00331e",
               "name": "William Kerwin",
               "profile_path": null,
               "id": 99947,
               "order": 19
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47eb9251416c750a9cef",
               "name": "Bob Clark",
               "profile_path": "/yQgRWKPFH2uFWIJiWr5EyWLRbvD.jpg",
               "id": 12698,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe47eb9251416c750a9d2d",
               "name": "Roger Swaybill",
               "profile_path": null,
               "id": 1039384,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47eb9251416c750a9d33",
               "name": "Alan Ormsby",
               "profile_path": null,
               "id": 48805,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47eb9251416c750a9d39",
               "name": "Bob Clark",
               "profile_path": "/yQgRWKPFH2uFWIJiWr5EyWLRbvD.jpg",
               "id": 12698,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 8.403357,
      "production_countries": [
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 19698,
      "vote_count": 82,
      "budget": 6500000,
      "overview": "When the students of Angel Beach High decide to stage \"An Evening With Shakespeare,\" their efforts are threatened by Miss Balbricker, who views the works of Shakespeare as obscene. She enlists the help of Reverend Bubba Flavel, a religious fanatic who brings along his flock of followers to pressure the school into shutting down the production.",
      "similar": [
         449176,
         272693,
         9880,
         43923,
         308369,
         10246,
         57214,
         4951,
         9377,
         37735,
         2108,
         8193,
         315635,
         277217,
         8363,
         10625,
         26123,
         286565,
         325189,
         14671
      ],
      "original_title": "Porky's II: The Next Day",
      "runtime": 98,
      "poster_path": "/6oyLjjDSdLWWxaKpOujf7JbG12j.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Simon Reeves Landsburg Productions",
            "id": 4281,
            "origin_country": ""
         },
         {
            "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
            "name": "20th Century Fox",
            "id": 25,
            "origin_country": "US"
         }
      ],
      "release_date": "1983-06-24",
      "vote_average": 5.1,
      "belongs_to_collection": {
         "backdrop_path": "/1Ra6Un73JwIjGHfEU0lM3397Q8z.jpg",
         "name": "Porky's Collection",
         "id": 109592,
         "poster_path": "/fGnfEA244AKrKgcN6uyvEFCgaR6.jpg"
      },
      "tagline": "If you thought the night before was funny, wait till you see the next day.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Bob Clark"],
      "runtime": 98,
      "synopsis": "Images from the first part of Porky. Edward \"Pee Wee\" Morris (Dan Monahan) wakes up shouting \"I've been laid!\" with joy. It's the following morning, after all the events in the first part. He increases the line in his maturity chart - the one he keeps under his mattress. His penis doesn't look as responsive as always, but he thinks it may be a resting time after the novelty of sex with a woman. His mother (Ilse Erl) enters his bedroom while he's got a boner - after watching toples women at The National Geographic magazine. Mrs Morris is dumbfolded when she looks at Pee Wee's chart. Back at Angel High School, Pee Wee brags about having Wendy Williams (Kaki Hunter) snatched from everybody else. His friends tease Pee Wee, saying that Wendy didn't think it was such a big thing. Wendy wants a better man - Wendy admits that it was all a prank planned by his friends: she really ended up satisfied. The Drama Club is producing a Shakespeare-based play for a theatre festival. All the boys in the festival are participating. Pee Wee interrupts a natural sciences lesson - the vivisected frogs are disgusting. Pee Wee is blamed for a joke which was not even his, but the science teacher (Howard Neu) tells him off. Pee Wee is jealous of Wendy, who is talked about a lot. She says that she's faithful, that people will talk about her without really knowing her, and that boys will always brag about things they haven't really done. Pee Wee tries to trust her, and says that he'll kick the ass of any boy who badmouths her from that moment on. Tommy Turner (Wyatt Knight), Tim Cavanaugh (Cyril O'Reilly), Billy McCarthy (Mark Herrier) and Anthony \"Meat\" Tuperello (Tony Ganios) are part of Pee Wee's gang. They are on friendly terms with new student Johnny Henry (Joseph Runningfox), who says hello to them. He'll participate in Shakespeare's play as well, alongside with Pee Wee and Tommy. Anthony has to dress up as a god fairy, which creates plenty of mockery around, especially with Pee Wee. Later, they disguise themselves to go to a carnival to see a well-endowed girl to dance something similar to the dance of the seven veils. The boys visit Gloria , and her MC (Peter Conrad). Pee Wee wants to get out on stage with his costume. He looks like a green Puck. Ms Beulah Balbricker (Nancy Parsons) and Reverend Bubba Flavel (Bill Wiley). Mrs Morris, Pee Wee's mother was the person responsible for the play. Mr. Floyd J. Carter (Eric Christmas) cannot stand up to Flavel's shouts and screams. They allege that Shakespeare is filth. Carter dismisses them after reading romantic passages from the Bible. Pee Wee finds another girl, and he takes her to the cemetery. He runs away. It's a prank - as Pee Wee shows himself stark naked. Laura gets undressed and wraps herself around Pee Wee. It looks like Laura is choking to death. Steve and Tommy say that Pee Wee is to blame for Laura's death. They can't call Ted (Art Hindle). Steve frightens Pee Wee, dressed as a zombie. So now, they accuse Pee Wee of killing two people; he runs butt naked. Ted and another cop see Pee Wee naked running on the road, but they don't stop to pick him up. They are dumb folded by Steve's disguise, but not afraid. He passes out. Somebody (Will Knickerbocker) has thrust a dummy against Johnny Henry, a Native American, kissing a white girl. The commissioners arrive; they are Hurley (Fred Buch), Couch (Richard Liberty) and Gebhardt (Edward Winter) will support the play, in spite of the racist comments. Balbricker sings and dances Black Magic while on the toilet, but the gang plays a prank on her. They open up the pipe and push a snake up. Balbricker runs in panic with her pants and panties down to the gym of the high school. All the school hears her screams and sees her. Later on, everybody panics, especially two cheerleaders (Francine Joyce and Wendy Becker) when they see the snake. Tommy says he's picked the snake and the coaches congratulate him for that. Carter interrupts rehearsals, when Johnny Henry was taking his role too realistically. Officially, the Shakespeare production is called off, but the classroom can rehearse as a private project classroom. One of them mentions that one of the commisoners exposed himself. Seward County Commissioner Gebhardt initially gestures Steve, Pee Wee, Wendy and the rest of the gang that Flavel's demands are ludicrous and unreasonable. The commissioners seem to think well of the production; Gebhardt praises them to fight for their ideals and for what they want. He tells them that he'll do a favour, in return of which he'll be offered another favour, and that's how things work, so they have nothing to worry about. John is beaten. The KKK opposes a Seminole character - his role is Romeo - to kiss a white girl - Wendy's role which is Juliet. A cross is burning next to him. 5,000 signatures are given to Geghardt against the play. Johnny's sword breaks and he has to pretend to keep on fighting with a broken sword in an absurd way. They give him the leg of a female mannequin. Flavel insists in shutting the production down. Anthony shows him his balls. Mrs Morris tells him that the gesture wasn't helpful. Gebhardt gestures for the gang to keep calm, but he finally betrays them. Gebhardt is a pervert who will go out with Wendy, who is 17 and therefore still a minor. Wendy wants revenge. At Seward court, in the basement, commissioners love silent black-and-white porn flicks. They make derogatory terms. Wendy prepares a punch which looks like vomit. She goes to La fontana di voglio, a fancy restaurant. He is friends with the maitre d' (Robin Paradise and Ted Richert) The KKK is led to talk to John. The gym is packed with Seminole Indians, and they want to shave the KKKmembers' heads. Wendy enters dressed and talking like a prostitute, shouting and making a big scandal out of it so that everybody looks at her - which everybody does. She jumps on top of him and tries to shag him there. She puts her boa on a gentleman (William Kerwin)'s head, and she sings that she's going on 17 that day, and that she was 14 when she first met him. Wendy will cry rape if he goes away: she says that she's pregnant of him. During Flavel's speech, he sees he KKK members stark naked. Then, the recording with the commisioners badmouthing Flavel and talking about the porn flick is played for everybody to hear. The public gets restless and Flavel loses it, swearing like a maniac to the press. Wendy gets drunk and drinks the gentleman's cup, and she repeats her date's name and position. Wendy vomits in a pool, and all the restaurant-goers leave. The gentleman even saw Wendy take out the vomit from one of her fake breasts. Pee Wee takes a picture of Gernhardt in the pool. They leave to the sound of We're going to see the Wizard, the wonderful Wizard of Oz, because because because.... The news jumps to the newspapers and Gernhardt quits his post. The Shakesperean Festival is on again, announced on the first page. Johnny is a hero. Wendy and Pee Wee are together again. The KKK members try to discreetly leave. One of them is kicked in the head by sweet ladies with umbrellas. The restaurant will be no more. Flavel tries to strangle one of his old accomplices.",
      "writers": [
         "Roger Swaybill",
         "Alan Ormsby"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0086129/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI4MDgyNTIyMF5BMl5BanBnXkFtZTcwMzg1MjAyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Dan Monahan, Wyatt Knight, Mark Herrier | See full cast and crew »"],
      "reviews": [
         "If you liked the original (which I did) and expect the same level of \"sophistication\" here, don't. This is not the sequel you've been waiting for. \"Porky's II: The Next Day\" offers up some laughs but the rest is filled in with sub-plots about the KKK, political campaigning, American Indians and right-wing religion. THIS in a movie with a character named Pee-Wee? Maybe Bob Clark felt he needed to do some social atonement for the non-PC stuff he committed in the original. But just because it's PC doesn't mean it's funny. No Porky, no locker room humor, no Miss Honeywell, no shower scenes... but at least Miss Balbricker (Parsons) gets her comeuppance thanks to a snake in a most unexpected place. And as far as verbal intelligence goes, its highlight comes when the principal (Christmas) tell Reverend Flavel (Wiley) what to do with his flock. And if that isn't the level of sophistication you were hoping for, consider yourself warned. Four stars. Boogedy, boogedy, boogedy!",
         "Porky's II: The next Day is even funnier than the forst Porky's, but should be seen together. Watch Porky's (1981) first, then Porky's II: The Next Day (1983). By now you may notice the cast has developed a repertoire and delivery similar to the Dead End Kids/ East Side Kids/ Bowery Boys of 1937-1958, comedic-wise that is. This film is NOT for children to see. As usual, there is plenty of male nudity, several full frontal, and female nudity as well. I will not spoil the surprises of storyline. But Jewish people might get a good chuckle this time around and those who are Native American Indian might be offended or laugh as well. I doubt that male indians would partake in such an auditorium gathering but keeping in mind, this is only a comedy movie. However, I am glad the bris scene did not go any further. Kaki Hunter is a hoot in her star-bangled character. I was rolling on the floor with laughter. The dirty words in Shakespeare Vs. dirty words in the Holy Bible two-man duet is a riot, too. Continue watching this film during the end credits for more adult scenes. The next film is Porky's Revenge (1985).",
         "Bob Clark's untimely death in a car crash a few days ago brings to mind his career, including \"Porky's II: The Next Day\". This one hilariously continues the get-laid-at-any-cost adventures of the teenage boys portrayed in the original movie. The actual plot has their school putting on a production of Shakespeare plays and getting threatened by the Ku Klux Klan, an angry clergyman, and hypocritical politicians. Of course, it's all an excuse for any crazy idea that they can dream up. I nearly laughed myself hoarse during the restaurant scene, not only at what was happening but also trying to imagine how much fun they must have had filming it! Anyway, it's just a pleasure to watch, particularly with what happens in the cemetery, and the whole end sequence. This was a sequel that equaled its original. And if you remember the \"electric sex\" from \"A Christmas Story\", check out the Shakespeare performance here! Just hilarious. To play off of what another Porky famously said: th-th-th-that'll never be all, folks! In conclusion: Bob Clark, wherever you are, we'll always remember you, if only for the \"Porky's\" movies. Bob Clark directed flicks as different as the \"Porky's\" movies, \"Children Shouldn't Play with Dead Things\" and \"A Christmas Story\". The things that we see in life...",
         "As often happens, this sequel to PORKY'S (1982) is inferior to the original - but, then, neither is it as bad as Leonard Maltin claims in his esteemed Film Guide! It does cheat by forsaking the titular establishment entirely, though the formula is pretty much the same as before - except that here some of the characters from the original disappear and are replaced by new ones, while the girl who was involved with the protagonist in the first film gets a bigger part this time around. Again, the film pits a certain minority - in this case, American Indians - against a bigoted community. While the film's major asset has to be the over-the-top characterization of the hypocritical Reverend, there are almost as many belly laughs here as in the original. Scenes that particularly stand out are the 'Shakespeare v. Bible' quoting duel (even if it's kind of silly and out-of-character to have the boys involved in putting on a show of the Bard's work in the first place) and the individual come-uppance of the gang's various antagonists - the KKK (in the school gymnasium), the duplicitous board member (humiliated in a restaurant prior to re-election) and the aforementioned evangelist and his flock (at their own rally). P.S. Interestingly, co-writer Alan Ormsby had previously collaborated with Clark on his first two horror outings - CHILDREN SHOULDN'T PLAY WITH DEAD THINGS (1972; which I've never watched) and DEATHDREAM (1972)!",
         "I thought that this was the best movie of the Porky's trilogy. The best scene in all the movies is the graveyard scene and this movie has it. If you're looking for some deep intellectual stuff, stay away from this movie and the other two. But, if you're in the mood for good (unclean) fun try this movie. It's hilarious. And all those people out there who say women don't like this movie are wrong! I'm a young women and I loved this film when I was a teenager, plus I used to watch it with my brother and (get this) my mom. If you're offended by: foul language, nudity and sexual humor don't watch this movie! If you ignore this warning and watch it anyway don't complain that the characters said the \"f word\" too much or that everyone was obsessed with sex, 'cuz that's what it's about folks!",
         "what the hell did i just see? i had never taken the time to watch porky's 2 until tonight (on comedy central). i found nothing funny about it, and i am a big comedy fan and can usually find some good in everything. i can't believe this came from the same director that did A CHRISTMAS STORY, one of my all time favorites.",
         "Porky's 2 was saddled with the unenviable task of following up The Most Successful Film In Canadain History(TM). It had the majority of the original cast and the same writer/director - what could possibly go wrong? Well, just about everything ... The original Porky's helped to create the genre of the American high school sex-comedy - still a hugely popular and bankable theme today. Whilst the original creamed $111 million at the US box office, the sequel only scored a limp $33 million. The problem with Porky's II is that it is supposed to be a sex-comedy, yet it has no sex and very little comedy. Whilst the original film had a pretty flimsy plot, at least it had one. The characters had clear motives, be it getting laid or taking revenge on Porky's. In the sequel the main motivation of the characters is to get a series of Shakespeare plays performed by their school drama group. Yes, that's right - they are no longer seeking out the pleasures of strip bars, peeping on the girls showers or trying to bed nubile cheerleaders - they want to perform a midsummer night's dream. It's hard to come up with a more poorly conceived plot device for the Porky's series. It takes some suspension of disbelief to think that the likes of Pee Wee and Meat are going to do battle with folk of angel beach so they put on the works of the great bard. The villains of this piece are also poorly realised. There is an extremely annoying hypocritical Reverend and a slimy politician. The role of Miss Balbricker is downplayed and Porky (the title character!) doesn't even appear in the film. The \"jokes\" here are laboured, far outstaying their welcome. The best (worst?) example of this is the final scene in the restaurant where Wendy exacts revenge on the duplicitous politician. It is a scene so overdone, so overacted that it is painful to watch. To be this bad takes sausAGES. Fans of the Porky film are not hard to please. Take some low brow comedy, add in copious amounts of gratuitous nudity and start counting in the cash. Remove these elements and you are left with a 90 minute waste of celluloid.",
         "Our gang of \"teenagers\"(using teenagers loosely) at Angel Beach High School are now butting heads with a fundamental minister with a flock of locals supporting him, the city commission, and the klu klux klan. It's all over, believe it or not, a Shakespearean festival considered \"obscene.\" The Klan have a problem with a Native American tribe in the area with one of their own, a student, in the Shakespeare play taking place in the school auditorium. Sufficed to say, the teens get their revenge when the festival is temporarily halted by the power of the city commission who fear for their political careers thanks in part to the reverend's clout with the community at large. Filthy language and sex-on-the-brain dialogue as in the first film, but less nudity. Worth seeing if just for Meat in drag and Pee Wee dressed as a green fairy. Porky's absence kind of takes away from this sequel, but Balbricker as a devoted \"member of the flock\" is kind of funny. Probably the most laugh-out-loud moment for me is when the boys play a trick on poor Pee Wee in the graveyard which results in him streaking down a country road afraid he had killed a woman via heart attack! Balbricker's snake incident in a bathroom thanks to the boys in an act of revenge because of her participation against their Shakespeare festival is another highlight.",
         "Director/co-screenwriter Bob Clark follows up his surprise hit original with this solid and often sidesplitting sequel. This time those rowdy lads at Angel Beach High are pitted against a bunch of uptight killjoy religious fanatics led by the smarmy Reverand Flaval (a perfectly slimy Bill Wiley) who object to a Shakespeare festival on the grounds that the Bard's work is obscene. Moreover, the local Klu Klux Klan aren't happy that Native American John Henry (likable James Runningfox) is playing the lead in the production of \"Romeo and Juliet.\" Clark not only incorporates the expected wild'n'raunchy anything-goes humor that was a key pleasing ingredient of the first film, but also takes wickedly nasty satiric potshots at such deserving targets as racial prejudice, religious hypocrisy and political corruption. Once again the cast really sink their teeth into their parts with unbridled gusto. Special kudos are in order for Dan Monahan as the impish Pee Wee, Kaki Hunter as the cheerfully bawdy Wendy, Nancy Parsons as stern gym teacher Ms. Balbricker, and Eric Christmas as the timid Principal Carter. Comic highlights include a nice tongue-in-cheek homage to Clark's earlier fright feature \"Children Shouldn't Play With Dead Things,\" Ms. Balbricker singing on the toilet, and Wendy acting like a loud obnoxious ill-mannered immature brat at a posh French restaurant. Cisse Cameron has a memorably sexy bit as a luscious stripper who disrobes in a cemetery. Reginald H. Morris' slick cinematography, Carl Zittrer's lively, rousing score, and the catchy golden oldies soundtrack are all likewise up to par. There's even a surprising amount of sweet sensitivity to be found amid all the wacky tomfoolery. Granted, this film doesn't totally match the gut-busting hilarity of the incredible original, but it's still plenty of good, naughty fun all the same.",
         "With most of the original characters, this should have been pretty good, unfortunately it isn't. I Think the problem is, the first movie had a story and plenty to drive it forward, this one doesn't really have a plot, and although it tries hard to be funny, it never re-captures the humour of the first film (The Graveyard scene is pretty funny though - Especially the zombie) Even if you have seen and enjoyed the first, avoid this and go straight for something else, try Porky's Revenge (III) it,s better than this rubbish. 3/10 (only because of the graveyard scene)"
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Simon / Reeves / Landsburg Productions",
         "Astral Bellevue Pathé"
      ],
      "summaries": [
         "When the students of Angel Beach High decide to stage \"An Evening With Shakespeare,\" their efforts are threatened by Miss Balbricker, who views the works of Shakespeare as obscene. She enlists the help of Reverend Bubba Flavel, a religious fanatic who brings along his flock of followers to pressure the school into shutting down the production. When they succeed with the help of corrupt city officials seeking re-election, the gang don't get mad... they get even!",
         "A day after the Angel Beach gang got revenge on Porky, the gain's Drama class experiences some troubles. Ms. Balbricker, Reverend Bubba Flavel, and politcal groups earning to get themselves re-elected. They all pressure the school to ban the new Shakespeare play for being obscene. The play hasd also got the attention of the KKK because the role of Romero went to a Seminole Indian. With threats against the school and the Native himself, the boys team together again for another scheme to get back at anyone trying to mess with Angel Beach.",
         "The naughty high schoolers of Angel Beach High now seek revenge on a group of KKK religious fanatics and corrupt politicians who want to shut down their Shakespeare production after they cast a Seminole transfer student in the lead."
      ],
      "budget": 6500000
   },
   "movielensId": 3689,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1983-06-24",
      "dvdReleaseDate": "2001-02-13",
      "directors": ["Bob Clark"],
      "runtime": 98,
      "movieId": 3689,
      "title": "Porky's II: The Next Day",
      "mpaa": "R",
      "actors": [
         "Dan Monahan",
         "Wyatt Knight",
         "Mark Herrier",
         "Roger Wilson",
         "Cyril O'Reilly",
         "Tony Ganios",
         "Kaki Hunter",
         "Scott Colomby",
         "Nancy Parsons",
         "Joseph Runningfox",
         "Eric Christmas",
         "Bill Wiley",
         "Edward Winter",
         "Cisse Cameron",
         "Ilse Earl",
         "Art Hindle",
         "Anthony Pena",
         "Rod Ball",
         "Richard Liberty",
         "William Kerwin"
      ],
      "imdbMovieId": "0086129",
      "originalTitle": "Porky's II: The Next Day",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [
         "ajZTZ2agLi4",
         "jaeR_RtjwDY"
      ],
      "plotSummary": "When the students of Angel Beach High decide to stage \"An Evening With Shakespeare,\" their efforts are threatened by Miss Balbricker, who views the works of Shakespeare as obscene. She enlists the help of Reverend Bubba Flavel, a religious fanatic who brings along his flock of followers to pressure the school into shutting down the production.",
      "tmdbMovieId": 19698,
      "avgRating": 2.0602,
      "releaseYear": "1983",
      "numRatings": 1005,
      "posterPath": "/6oyLjjDSdLWWxaKpOujf7JbG12j.jpg"
   }
}