{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "cult",
            "id": 6158
         },
         {
            "name": "bikini",
            "id": 7984
         },
         {
            "name": "friends",
            "id": 9713
         },
         {
            "name": "school",
            "id": 10873
         },
         {
            "name": "teenager",
            "id": 13130
         },
         {
            "name": "drag",
            "id": 171636
         },
         {
            "name": "voyeur",
            "id": 180340
         }
      ],
      "imdb_id": "tt0086143",
      "video": false,
      "title": "Private School",
      "recommendations": [
         52736,
         60778,
         31016,
         211085,
         24742,
         90816,
         47701,
         46578,
         40506,
         77469,
         43334,
         109667,
         40562,
         26269,
         47892,
         24080,
         19142,
         34681,
         128546,
         80659
      ],
      "backdrop_path": "/AoYLFf1cMn4QixAKhK59MKC5hah.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Christine Ramsey",
               "gender": 1,
               "credit_id": "52fe479f9251416c750a0067",
               "name": "Phoebe Cates",
               "profile_path": "/zOUE6cOZjFGrIeqidjOfrONj98G.jpg",
               "id": 16171,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Jordan Leigh-Jenson",
               "gender": 1,
               "credit_id": "52fe479f9251416c750a006b",
               "name": "Betsy Russell",
               "profile_path": "/4uELRGwPn9bJ9H1BF5bZKlu32go.jpg",
               "id": 22434,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Jim Green",
               "gender": 2,
               "credit_id": "52fe479f9251416c750a006f",
               "name": "Matthew Modine",
               "profile_path": "/tEQG1Us5IuoKYtufZe6waWtxfeg.jpg",
               "id": 8654,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Bubba Beauregard",
               "gender": 2,
               "credit_id": "52fe479f9251416c750a0073",
               "name": "Michael Zorek",
               "profile_path": null,
               "id": 124133,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Miss Dutchbok",
               "gender": 1,
               "credit_id": "52fe479f9251416c750a007d",
               "name": "Fran Ryan",
               "profile_path": "/ht4E3qC3uO9CsldpoY2BeLaUbuX.jpg",
               "id": 152670,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Betsy",
               "gender": 1,
               "credit_id": "52fe479f9251416c750a0081",
               "name": "Kathleen Wilhoite",
               "profile_path": "/53qB97B6QJeMtqeENUH1TyiM9BW.jpg",
               "id": 42335,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Chauncey",
               "gender": 2,
               "credit_id": "52fe479f9251416c750a0085",
               "name": "Ray Walston",
               "profile_path": "/5N6AVWIJCBD71uZtxSTTE8ZNfkB.jpg",
               "id": 4093,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Ms. Regina Copoletta",
               "gender": 1,
               "credit_id": "52fe479f9251416c750a0089",
               "name": "Sylvia Kristel",
               "profile_path": "/9CoitH6zdr5FTBLh6FJZHnzkunc.jpg",
               "id": 35319,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Mr. Leigh-Jensen",
               "gender": 2,
               "credit_id": "52fe479f9251416c750a008d",
               "name": "Frank Aletter",
               "profile_path": "/wlUBPFVPbVyb7tMUN6DeLk1h6Wz.jpg",
               "id": 123380,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Roy",
               "gender": 2,
               "credit_id": "58d10a7e9251411a9f009ea7",
               "name": "Jonathan Prince",
               "profile_path": "/8NDkK1wIa9EY8JCflTKirRCWF6J.jpg",
               "id": 82346,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Mr. Flugel",
               "gender": 2,
               "credit_id": "58d10a929251411adc00a0ff",
               "name": "Richard Stahl",
               "profile_path": "/iX93hFXsRMOglVvjDI8Fve01TQX.jpg",
               "id": 95785,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Coach Whelan",
               "gender": 1,
               "credit_id": "58d10a9f9251411af4009efe",
               "name": "Julie Payne",
               "profile_path": null,
               "id": 78620,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Birdie Fallmouth",
               "gender": 0,
               "credit_id": "58d10aabc3a36838e9008e5e",
               "name": "Frances Bay",
               "profile_path": "/uaT5z1YQKZZ8WcYsnOnnI6DRWdW.jpg",
               "id": 11794,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Mr. Ramsay",
               "gender": 2,
               "credit_id": "58d10ab7c3a36838c9009a40",
               "name": "Burke Byrnes",
               "profile_path": "/3AmO5oHFApvCtrjMVvHCBtPnDM2.jpg",
               "id": 109761,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "Bellboy",
               "gender": 2,
               "credit_id": "58d10ac4c3a36838c9009a4a",
               "name": "Steve Levitt",
               "profile_path": null,
               "id": 78384,
               "order": 15
            },
            {
               "cast_id": 20,
               "character": "School Girl",
               "gender": 1,
               "credit_id": "58d10ad2c3a36838f1008d5b",
               "name": "Lynda Wiesmeier",
               "profile_path": "/6Gvuz4aZ1iuk0D4V2szPbE6LsA.jpg",
               "id": 100603,
               "order": 16
            },
            {
               "cast_id": 21,
               "character": "School Girl",
               "gender": 0,
               "credit_id": "58d10adc9251411af4009f1c",
               "name": "Nadine Van der Velde",
               "profile_path": null,
               "id": 35875,
               "order": 17
            },
            {
               "cast_id": 22,
               "character": "Cheerleader (uncredited)",
               "gender": 1,
               "credit_id": "58d10aef9251411a9f009eea",
               "name": "Paula Abdul",
               "profile_path": "/tlbYKCwuYdwIj3ceG3PhezJbD48.jpg",
               "id": 129193,
               "order": 18
            },
            {
               "cast_id": 23,
               "character": "Drug Store Clerk (uncredited)",
               "gender": 2,
               "credit_id": "58d10afc9251411af4009f35",
               "name": "Martin Mull",
               "profile_path": "/oMYciNILkZMhVyrMP9FtMepntiS.jpg",
               "id": 80742,
               "order": 19
            },
            {
               "cast_id": 24,
               "character": "School Girl (uncredited)",
               "gender": 1,
               "credit_id": "58d10b08c3a36838f1008d85",
               "name": "Brinke Stevens",
               "profile_path": "/zTbesUkb0CKBnT29xRegVRUq4dg.jpg",
               "id": 97621,
               "order": 20
            },
            {
               "cast_id": 25,
               "character": "Rita",
               "gender": 1,
               "credit_id": "5966b1b8c3a3680dec10e9b0",
               "name": "Kari Lizer",
               "profile_path": null,
               "id": 111705,
               "order": 21
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe479f9251416c750a0079",
               "name": "Noel Black",
               "profile_path": null,
               "id": 109876,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe479f9251416c750a0093",
               "name": "Dan Greenburg",
               "profile_path": null,
               "id": 1096990,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe479f9251416c750a0099",
               "name": "Suzanne O'Malley",
               "profile_path": null,
               "id": 171384,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 7.289695,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 18835,
      "vote_count": 36,
      "budget": 0,
      "overview": "Private-school student Christine loves Jim. But her classmate, Jordan, is also vying for Jim's attention and trying to end his relationship with Christine. Meanwhile, Jim's friend Bubba embarks on a series of sexual escapades, including dressing up as a woman to access the girls' locker room. Despite Jim and Christine's efforts to spend some time alone, various shenanigans and schemes interfere.",
      "similar": [
         8363,
         80752,
         308369,
         10246,
         13523,
         22705,
         3597,
         2108,
         37735,
         9352,
         10229,
         8193,
         112160,
         272693,
         315635,
         449176,
         10625,
         9880,
         37725,
         26123
      ],
      "original_title": "Private School",
      "runtime": 89,
      "poster_path": "/751YiDofTR5mon16NQXgyX9vxqb.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Unity Productions",
            "id": 2287,
            "origin_country": ""
         },
         {
            "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
            "name": "Universal Pictures",
            "id": 33,
            "origin_country": "US"
         }
      ],
      "release_date": "1983-07-29",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "You won't believe what goes on and what comes off in... Private School",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Noel Black"],
      "runtime": 89,
      "synopsis": null,
      "writers": [
         "Dan Greenburg",
         "Suzanne O'Malley"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0086143/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjU4MzIwNjAxN15BMl5BanBnXkFtZTcwMzA0MDcyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Phoebe Cates, Betsy Russell, Matthew Modine | See full cast and crew »"],
      "reviews": [
         "This is one of those horny teenager films that came out in the 1980's and it's easily just as dumb as most of them but looking at the young cast today this could be interpreted as a curio for this genre. Story is about horny teenagers from two prep schools where the boys and girls engage in raucous behavior from peering into windows to sneaking into showers. The girls side is Cherryvale and the boys Freemount and we see Jim Green (Matthew Modine) who dates Christine Ramsey (Phoebe Cates) and she has decided to give her virginity up and books a room in a cheap Mexican hotel. *****SPOILER ALERT***** Jim's friend Bubba (Michael Zorek) takes bets on the event but he also wants to try and score with the sexy Jordan (Betsy Russell) who is jealous of the fact that Christine and Jim have a solid relationship going on although he and Bubba dress up as woman and sneak into Cherryvale. The Dean is Miss Dutchbok (Fran Ryan) who tries to keep the shenanigans down to a limit but she gets caught in the back of a limo with a chauffeur (Ray Walston) with their lovemaking broadcast over an intercom system! This film is directed by Noel Black who in 1968 made the terrific \"Pretty Poison\" but since then he has worked primarily in television and his feature film efforts were regulated to low budget sex romps like this. It would be easy to just unload one bad remark after another for a film like this but that would be too easy and instead I look back at this as something that was a trend and if you compare them with the few horny teen films that are made today you'll see how different they are. The abundance of nudity was actually the norm during this period and actress Betsy Russell has three nude scenes in the first 30 minutes and the scene of her riding the horse topless has gone on to be infamous. The familiar cast is also another reason to check this out and along with Modine, Cates, and Russell is Kathleen Wilhoite, Sylvia Kristel and Brinke Stevens in the shower scene. For trivia there are two things to point out like the fact that Cates sings two songs on the soundtrack and is actually pretty good and the other is that Paula Abdul was the choreographer for the outdoor calisthenics/dance sequence. I'm not really recommending this to anyone because this is one of those films that audiences can make up their minds about on their own but maybe my comments point out a few things to help others decide if they want to venture out and view this.",
         "In a genre that gave us many enjoyable films, Private School may well be the best of the bunch. There is something truly irresistible about a film that sets out only to entertain its audience. There is no hidden agenda or deeper meaning or political motives here. The people who created this gem intended only to make us smile and show us some skin and make a little money in the process. Some days, isn't that all a guy really needs? It's about time this one came out on DVD! The film deals with the social interactions between girls from Cherryvale and the young men from the nearby Freemount Academy. Of course when I say \"social interaction\" I mean sex. Simply put, the guys are trying to either score with the ladies, or at least get a good Polaroid of them coming out of the shower. The film has a serious undercurrent in how it deals with the relationship between Christine Ramsey (Phoebe Cates) and Jim Green (Matthew Modine). They are trying to lose their virginity under the best possible circumstances, but there are of course complications and misunderstandings. Christine's next door neighbor, the lovely and talented Betsy Russell, is out to steal Jim for herself using methods that would certainly grab any young man's attention. The resulting action plays out in the most satisfactory of ways. Private School scores on many fronts. The cast which contains many recognizable faces puts as much into their roles as they've done in any other films. The soundtrack featuring Phoebe Cates singing on two different tracks is much better than you would expect, as well. There is tons of random nudity so you will get your money worth in that department. Curiously enough, there is no DVD commentary by any of the actors in this film. Wouldn't it be fun to hear what Matthew Modine would think today about this early role in his distinguished career? And Martin Mull may have been hiding behind a beard for his little three minute cameo, but the appearance was well-appreciated! He must have snuck this little bit part in between takes of Mr. Mom that year. For those who may question the logic of the Hound giving all ten stars to this film: Heck, that scene with Betsy Russell topless on the horse was worth eight stars by itself!!! 10 of 10 stars. The Hound.",
         "And I mean butts. Three of the best rears to grace the movies are shown in this one. Betsy Russell, Brinke Stevens, and Phoebe Cates (hers may have been a body double--but it looked like I had always imagined Phoebe's would look like) show us the goods, and they are good! There are also some funny gags that not only the boys play on the girls, but also the girls play on each other and on the school faculty. All the \"established\" actors are doing their best to drag this movie out of the muck and they just barely do it. (If you want to see how bad teen sex movies can get, just watch \"ScrewBalls\" and you will see that this movie is really a cut above) Overall a pretty good \"Animal House\" rip-off that works much better.",
         "The movie was funny.But let's face it.I,like how many other guys went to see this movie for Phoebe Cates,who is a definite 10 herself.But then we see this vision riding horseback! Betsy Russell is an 11 on a scale of one to ten.And how many of us knew who she was. Fond memories of my teenage years.I am sure for many other too.As bad as this may sound to some,Phoebe Cates is the girl you would marry,and Betsy Russell the mistress.Both incredible beauties.Betsy Russell exudes SEX APPEAL.Phoebe Cates the pretty,wholesome girl next door.As for the rest of the cast does anyone even care. Matthew Modine for instance,was and has always been the stereotypical Nerd that tried to pull off the cool jock type.What a lucky guy to have worked with two amazing beauties.The seen with Betsy getting massaged by Matthew was a classic,the way she giggled and gyrated was something to behold.I am not sure if I have seen anyone sexier.between that scene and the horse back riding.This lady shows her true talents.If any of you guys want to see true sex appeal at it's finest.This is the ticket!!!!!!!!!!!",
         "Rent this movie for the shower scene, you'll love it (though not as good as the one in \"Hellhole\"). Voyeurism is rampant in this flick... I loved Betsy Russell's character the most. A very funny movie and definitely worth spending $$ on.",
         "A very raunchy and crude high school romantic sex comedy starring two luscious hotties in the immensely sweet Phoebe Cates and the wickedly memorable Betsy Russell. After seeing it, how can you forget Russell's topless horse riding scene and the saucy seduction of Matthew Modine's character. Yes\u0085 tongues would be hanging! Wait on guys\u0085 also featuring is sexpot Sylvia Kristel (well known for the 'Emmanuelle' series) as, just wait\u0085 the sex education teacher. Immature minds maybe, but you should know the target audience it's aiming for. As for the cornball story, it's rather slight with characters coming and going doing their own things with running gags, cheesy set-ups, plenty of flowing nudity and episodic set-pieces. It's the same old high-jinx that remain amusing due to the cast committing themselves and Noel Black's direction being so spiritedly random. There are moments of awkwardness (with many daggy dialogues) and tackiness, but it was hard to keep a smile off my face. I really liked the classy Ray Walston (who a year earlier appeared in the classic teen comedy with Cates; 'Fast Times at Ridgemont High') short, but funny cameo. Matthew Modine was likable enough and Michael Zorek was humorous as a horn-dog. Kathleen Wilhoite (in her film debut) was a cheeky delight as Cates' room-mate/friend and Fran Ryan was terrific as the prudish headmistress. There's also fine additional support by Jonathan Prince, Julie Payne, Richard Stahl, Frank Aletter, Frances Bay and Karen Chase. Look out for a risible appearance by Martin Mull as drug store clerk. Now the soundtrack is a complete blast. Catchy, hip and upbeat bubblegum sound that's always (well nearly) playing in the background with many old tunes revamped. It's like a record, with someone taking the needle off for a short break to only rip back in to it again. You got the 'Stray Cats', 'Sam the Sham and the Pharaohs' (probably of the favourite of the lot), 'Harry Nilsson', 'Rick Springfield', 'Bow-Wow-Wow' and 'Vanity 6' to name a few. It's no classic, but a vibrantly charming 80s high school teen sex comedy outing that can't do no wrong.",
         "This movie was a great watch for me as a young girl. I have fond memories, the crude jokes, the gratuitous nudity and the humor and stereotypes that made the movie a classic in my books. At least it has a great storyline for a movie of this sort and makes for great viewing. Betsy Russell on nude horseback is memorable and unforgettable, the sheer brassiness of this lass and do-whatever-it-takes attitude to steal Matthew Modine from Phoebe Cates by being terribly unsubtle in her advances to him. And Bubba... Bubba the hot-blooded horny male that desperately wants to get into the pants of every female student with his salivating and dirty character. This is where I feel in love with Matthew Modine and also was my first naughty flick that I saw,nevertheless I think the casting was great and I don't think there has been any movie that has really outdone it in this genre. Great toilet humor. Good laugh and great hairstyles.A must see.",
         "Christine (the gorgeous Phoebe Cates) attends Cherryvale, a school for girls. She's dating Jim (Matthew Modine) from the local boy's school. Jim and his pals are always up to no good with many hare-brain schemes in their sexually deprived minds to infiltrate the school and see a bit of flesh. When Christine and Jim decide to go away for the weekend the real fun begins. 'Private School' is my favorite of all the teen comedies of the 80's. It's not rocket science but it's a lot of fun and worth a laugh or two. Acting: * * * (Very Good) Writing / Direction: * * (OK) Technical Design: * * (OK) Music: * * * * (Excellent) If you liked 'Fast Times at Ridgemont High' and 'Porky's' you may enjoy this one too.",
         "Private School (for Girls) is a teen sex-comedy that isn't particularly funny, and doesn't feature much sex. It is, however, an 80s teen sex-comedy and, furthermore, it is an 80s teen sex-comedy that stars the most gorgeous actress to have ever graced this earth, the delicious Phoebe Cates. For these reasons, I am willing to cut the movie a lot of slack. Christine (Phoebe Cates), a student at an all girls school, is in love with Jim (Matthew Modine), who is attending a nearby academy for boys. They are planning their first night of passion together but, when busty bitch Jordan (Betsy Russell) sets her sights on Christine's guy, they find that the course of true love n'er did run smooth (as some poet once wrote). Meanwhile, Jim's school buddies involve him in all sorts of crazy capers in a desperate attempt to see (and hopefully score with) as many naked babes as possible. Private School may not be the greatest example of its genre (I think that accolade goes to Fast Times at Ridgmont High, also starring Phoebe Cates), but it still has bags of 80s charm, a likable cast and, of course, loads of quality tits and ass on display! And although Ms. Cates keep herself mostly covered up in this movie, the vivacious Betsy Russell does her best to compensate by getting her ample charms out at the drop of a hat. Viewers are also treated to a great cheesy dance routine with the girls (clad in lycra leotards and leg-warmers) bending and stretching (to the song The American Girl by Rick Springfield), a real corker of a shower scene, the unforgettable sight of a topless Ms. Russell riding a horse in slow motion, and an appearance by Emmanuelle herself, Sylvia Kristel, who, unsurprisingly, plays the sex education teacher. Private School is enjoyably silly trash for those who love immature teen comedies with loads of nudity (ie., me!).",
         "This was one I enjoyed in High School (and College) to see some T&A. Phoebe Cates plays Christine Ramsey, Matthew Modine plays Jim. He loves Chris, and Chris loves him. Enter Jordan Lee Jensen, played by Betsy Russell. She has the hots for Jim so she tries to break them up. In the meantime, you have plenty of T&A as Bubba tries to score and ends up in the girls shower. Sure, the plot is thin, the humor is thin, but Betsy Russell is so HOT! Probably the best scene is Russell riding topless on a horse. Even clothed this woman begs the male eye to revel and take in every inch of her skin. It's not Fast Times at Ridgemont High (also starring Cates) or The Breakfast Club--but Private School for Girls got me through those years when I wanted to see a lot of T&A. It is finally on DVD (much to the chagrin of Phoebe Cates), fully restored and in letterbox format to make the shower scene all the more pleasurable. It was about time, considering that lame movies like Night Patrol, Night of the Living Dead II and the Party Animal being put on DVD. In any case, I am truly sorry, Phoebe. However, the fans demanded it and Universal finally responded."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Unity Productions",
         "Universal Pictures"
      ],
      "summaries": ["Christine (Phoebe Cates), a student at an exclusive all-girls private school, is in love with Jim, who attends an academy for boys nearby. Christine's arch rival Jordan also has her eye on Jim, and she is willing to do whatever she can to steal him away. Jim's uber-slob buddy Bubba is going with Betsy, Christine's cynical friend, though he would probably be unfaithful if any other woman were willing to get near him. Bubba and his pals sneak into the girls' school dressed in drag in hopes of reaching the Promised Land (better known as the women's shower room), while Christine and Jim run away together for the weekend, though their escapade isn't as romantic as they had hoped."],
      "budget": 0
   },
   "movielensId": 3691,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1983-07-29",
      "dvdReleaseDate": "2007-03-06",
      "directors": ["Noel Black"],
      "runtime": 89,
      "movieId": 3691,
      "title": "Private School",
      "mpaa": "R",
      "actors": [
         "Phoebe Cates",
         "Betsy Russell",
         "Matthew Modine",
         "Michael Zorek",
         "Fran Ryan",
         "Kathleen Wilhoite",
         "Ray Walston",
         "Sylvia Kristel",
         "Frank Aletter",
         "Jonathan Prince",
         "Richard Stahl",
         "Julie Payne",
         "Frances Bay",
         "Burke Byrnes",
         "Steve Levitt",
         "Lynda Wiesmeier",
         "Nadine Van der Velde",
         "Paula Abdul",
         "Martin Mull",
         "Brinke Stevens",
         "Kari Lizer"
      ],
      "imdbMovieId": "0086143",
      "originalTitle": "Private School",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["bMCG-tdTXVU"],
      "plotSummary": "Private-school student Christine loves Jim. But her classmate, Jordan, is also vying for Jim's attention and trying to end his relationship with Christine. Meanwhile, Jim's friend Bubba embarks on a series of sexual escapades, including dressing up as a woman to access the girls' locker room. Despite Jim and Christine's efforts to spend some time alone, various shenanigans and schemes interfere.",
      "tmdbMovieId": 18835,
      "avgRating": 2.53304,
      "releaseYear": "1983",
      "numRatings": 227,
      "posterPath": "/vibX53BS2wgHVjhz3MmPpNDYjG0.jpg"
   }
}