{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0090849",
      "video": false,
      "title": "Class of Nuke 'Em High",
      "recommendations": [
         136585,
         16233,
         15239,
         27813,
         28173,
         22172,
         85160,
         47886,
         28941,
         44247,
         28165,
         36837,
         57901,
         24919,
         27274,
         27420,
         27916,
         33721,
         3043,
         15991
      ],
      "backdrop_path": "/1T6JHNcGyjeOBejmQdWYRXKTAHL.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Chrissy",
               "gender": 1,
               "credit_id": "52fe450ac3a368484e044fad",
               "name": "Janelle Brady",
               "profile_path": "/2y8JoUpikyp4XyqQPZ9bGXpbDbs.jpg",
               "id": 586460,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Warren",
               "gender": 0,
               "credit_id": "52fe450ac3a368484e044fb1",
               "name": "Gil Brenton",
               "profile_path": null,
               "id": 225260,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Spike",
               "gender": 2,
               "credit_id": "52fe450ac3a368484e044fb5",
               "name": "Robert Prichard",
               "profile_path": "/vWmFzUuNZctMD5n5pxLhDHfRWfw.jpg",
               "id": 555068,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Mr. Finley (as R.L. Ryan)",
               "gender": 2,
               "credit_id": "52fe450ac3a368484e044fb9",
               "name": "Pat Ryan",
               "profile_path": "/2GNcgJkJG6oaJ8ptUhcYtLEqi7n.jpg",
               "id": 555069,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Eddie",
               "gender": 2,
               "credit_id": "52fe450ac3a368484e044fbd",
               "name": "James Nugent Vernon",
               "profile_path": null,
               "id": 586461,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Gonzo",
               "gender": 2,
               "credit_id": "52fe450ac3a368484e044fc1",
               "name": "Brad Dunker",
               "profile_path": null,
               "id": 586462,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Pete",
               "gender": 2,
               "credit_id": "52fe450ac3a368484e044fc5",
               "name": "Gary Schneider",
               "profile_path": "/1815xju1TfIMzcY8VLT1tMnowDN.jpg",
               "id": 104593,
               "order": 6
            },
            {
               "cast_id": 26,
               "character": "Muffey (as Theo Cohan)",
               "gender": 1,
               "credit_id": "58eac6d6925141351f040616",
               "name": "Theo Kogan",
               "profile_path": "/siwcE5mZSZ23I5W5N0Qjl3LEeJz.jpg",
               "id": 1232610,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Greg",
               "gender": 2,
               "credit_id": "52fe450ac3a368484e044fcd",
               "name": "Gary Rosenblatt",
               "profile_path": null,
               "id": 586464,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Judy",
               "gender": 1,
               "credit_id": "52fe450ac3a368484e044fd1",
               "name": "Mary Taylor",
               "profile_path": null,
               "id": 586465,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Spud",
               "gender": 2,
               "credit_id": "52fe450ac3a368484e044fd5",
               "name": "Rick Howard",
               "profile_path": null,
               "id": 586466,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Taru",
               "gender": 0,
               "credit_id": "52fe450ac3a368484e044fd9",
               "name": "Lauren Heather McMahon",
               "profile_path": null,
               "id": 586467,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Joe",
               "gender": 0,
               "credit_id": "52fe450ac3a368484e044fdd",
               "name": "Chris McNamee",
               "profile_path": null,
               "id": 586468,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "George",
               "gender": 2,
               "credit_id": "52fe450ac3a368484e044fe1",
               "name": "Anthony Ventola",
               "profile_path": null,
               "id": 209460,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Dewy",
               "gender": 2,
               "credit_id": "52fe450ac3a368484e044fe5",
               "name": "Arthur Lorenz",
               "profile_path": null,
               "id": 586469,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "Miss Stein (as Diana DeVries)",
               "gender": 0,
               "credit_id": "58ea8c9f925141281007c353",
               "name": "Jennifer Prichard",
               "profile_path": "/8SLKKz3YmxOlRhABEGi5oDlQ3Az.jpg",
               "id": 555066,
               "order": 15
            },
            {
               "cast_id": 20,
               "character": "Denise",
               "gender": 0,
               "credit_id": "58ea8cb4925141281907a75e",
               "name": "Dianna Flaherty",
               "profile_path": null,
               "id": 1792871,
               "order": 16
            },
            {
               "cast_id": 21,
               "character": "Nuclear Worker",
               "gender": 0,
               "credit_id": "58ea8cc8c3a36873260773dd",
               "name": "Don Costello",
               "profile_path": null,
               "id": 1209294,
               "order": 17
            },
            {
               "cast_id": 22,
               "character": "Ron Simms",
               "gender": 0,
               "credit_id": "58ea8cd7c3a368731a07ec64",
               "name": "Rick Collins",
               "profile_path": "/tvLDhVaTq87TLeFyXL3phYFjNIr.jpg",
               "id": 98330,
               "order": 18
            },
            {
               "cast_id": 23,
               "character": "Dr. Howard",
               "gender": 0,
               "credit_id": "58ea8ce4925141281907a788",
               "name": "Richard W. Haines",
               "profile_path": null,
               "id": 107482,
               "order": 19
            },
            {
               "cast_id": 24,
               "character": "Bake Sale Person",
               "gender": 1,
               "credit_id": "58ea8cee9251414b28037f71",
               "name": "Elizabeth Lambert",
               "profile_path": "/uMWP7gHLUeE06ylaCfDO6h8CrXX.jpg",
               "id": 944283,
               "order": 20
            },
            {
               "cast_id": 25,
               "character": "Teacher (uncredited)",
               "gender": 2,
               "credit_id": "58ea8d06c3a3684a7906c3ed",
               "name": "Michael Herz",
               "profile_path": null,
               "id": 78023,
               "order": 21
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe450ac3a368484e044f9d",
               "name": "Richard W. Haines",
               "profile_path": null,
               "id": 107482,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe450ac3a368484e044fa3",
               "name": "Lloyd Kaufman",
               "profile_path": "/zTylEHdJL422WZ1vjEmEkDoWkk7.jpg",
               "id": 78021,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe450ac3a368484e044fa9",
               "name": "Richard W. Haines",
               "profile_path": null,
               "id": 107482,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 4.651442,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 26554,
      "vote_count": 53,
      "budget": 2000000,
      "overview": "The pupils at a high school next to a nuclear power plant start acting and looking strange after buying contaminated drugs from a plant worker.",
      "similar": [],
      "original_title": "Class of Nuke 'Em High",
      "runtime": 85,
      "poster_path": "/mSwophQFXDaCjxRWhyZaP79Si4M.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Troma Entertainment",
         "id": 3052,
         "origin_country": ""
      }],
      "release_date": "1986-12-12",
      "vote_average": 5.6,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Nuke 'Em High Collection",
         "id": 263866,
         "poster_path": "/eI4x4Sv2C4Et7Be2RCZY7EpNk0H.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": [
         "Richard W. Haines",
         "Lloyd Kaufman"
      ],
      "runtime": 85,
      "synopsis": null,
      "writers": [
         "Richard W. Haines",
         "Mark Rudnitsky"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0090849/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc5OTY5NTYzOF5BMl5BanBnXkFtZTcwNjk2MDQyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Janelle Brady, Gil Brenton, Robert Prichard | See full cast and crew »"],
      "reviews": [
         "Class of Nuke 'Em High is one of Troma's best loved and most seen films. This film helped to define the Troma formula that crap addicts the world over would grow to love - gory violence, gratuitous nudity and black humour, all mixed with a large dose of irony and an incredible lack of taste. Class of Nuke 'Em High was released just after \"The Toxic Avenger\" and it shares a similar nuclear theme. In this case, a nuclear waste facility is leaking toxic goo into the local high school with some rather unfortunate consequences for the student body. Unlike the poor nerd in the film's brilliant opening sequence, our heroes are not directly exposed to the toxic waste. Rather, Warren and Chrissy smoke marijuana grown on the grounds of the nuclear power plant. This ultra-potent pot not only makes Chrissy incredibly horny, but mutates her unborn child and imbues Warren with super-human strength. The film then focuses on Warren's rivalry with the Cretins (former honours students who have turned into freaks after smoking one too many toxic joints) and Chrissy's rampaging miscarried foetus (which lives in the toilet and hides out in a vat of toxic waste). These situations provide the filmmakers with plenty of opportunities for hilarious sight gags, gory violence and camp action - and they deliver. As with much of Troma's early output, this film has been crafted with considerable care and attention to detail, despite budgetary restrictions. The plot has its own ludicrous sense of logic and the direction is captivating - Kaufman, Herz and Richard W. Haines all share a directorial credit but the action sequences reek of Kaufman's mercurial style. I love the scene where Warren literally punches one of the cretins through the mouth, down into his chest. The special effects also deserve a mention. The creature effects used for Chrissy's mutant foetus are hilarious. The Class of Nuke 'Em High does not quite match \"The Toxic Avenger\" for originality or style, but it is a great example of what Troma does better than any other studio and why they are still around 20 years later.",
         "When it comes to stupid trash films, Troma have no equal; and while the vast majority of their output is absolute rubbish, now and again you'll find a few gems in the rough; and unlikely as it may seem, Class of Nuke 'Em High is one such gem. The film presents a post-apocalyptic style similar to that seen in films such as The Warriors and Escape From New York, and blends it with the idea of a school being run by several students; which is reminiscent of the hit thriller Class of 1984. This is all then mixed in with stoner culture; as its toxic weed that causes all the problems, and you have a recipe for a successful trash flick. The film opens with a 'routine nuclear evacuation drill' at Tromaville High; a school situated next to a nuclear power plant. One kid goes mental, and it's not long before we see that a local gang are buying weed from a nuclear plant worker and selling it to the kids at school. The weed grows faster than normal; and there's a reason for that, as toxic waste has contaminated it and pretty soon the kids of Tromaville High start acting rather strangely... If this film was made by any other production company; I'd probably say it has a point to make about the advent of nuclear power, but since this is Troma it's clear that they've simply lifted a common fear and turned it into a schlock film. There's absolutely no point to it; but seeing all the general carnage is a lot of fun, and director Richard W. Haines isn't afraid to go completely over the top, despite the obvious limitations of his special effects budget. The film plays out something like a zombie movie; although there are influences from other sources, and not all the afflicted characters turn into mindless beings. The gang at the centre of the film is an interesting troupe, and their style fits the jokey tone of the film very well. It's good to see a film like this that has a sense of humour, and absolutely nothing in the film is to be taken seriously; shown best by the fact that the central location is 'Tromaville', and is the 'toxic chemical capital of the world'! The special effects towards the end get a little silly, but it's all in good fun; and while this movie won't be to everyone's tastes, if you enjoy schlock horror - you'll love this!",
         "I'm glad I was part (I was very young but still) of the Troma boom. Troma is a production company well known for crappy and sometimes cheesy movies. This isn't the exception! Oh no, \"Class of Nuke 'Em High\" has the winning formula that has given Troma a name in the business. We have cheap but likable f/x, glorious and gratuitous nudity, kick-ass action, cheap music , and campy acting. This is my kind of entertainment. Thank you USA's \"Up All Night\" for educating me on crap cinema. I got majors thanks for it. This movie has plenty of good black humor and intense action a la Troma. So you get a sui generis cheap action flick with the occasional mix of blood and boobs. No, don't expect a typical high school although in my teenager years I expected my school to look like this! A classic in Troma. If you want to get in the ideology of this noble production company, watch \"Class of 'Nuke Em High\". Jeez, even the title fits with everything.",
         "If only my highschool was like this...eerily predicting a violent chaotic state of highschools in the future loaded with biker gangs and mutants. I first saw this movie on USA's \"Up All Night\" back in the early 90's when I was about 8 years old and it became one of my favorite late night viewings especially since I was very heavy into the Toxic Crusaders. Movies like this and the Toxic Avenger played a big part in my childhood and thanks to Lloyd Kaufman's influence I am the sick demented horror fan I am today...as if it's a bad thing. 10/10",
         "You know you're in Troma (a very low budget film company) territory right from the outset, when a poor student accidentally drinks nuclear waste, melts, and jumps out of a window. Welcome to the seriously twisted universe of Tromaville, where a nearby nuclear power plant is leaking radiation into a nearby school. Cue lots of dismemberment, green ooze and horrifically bad acting. Taken with a lot of salt and good humour, this is just the kind of film you can enjoy with your friends those Saturdays when you have nothing better to do. The fact that it's all to cheesy merely adds to the low budget charm. It's nice to see one company which, amidst the rampart glossy and self concious products of Hollywood, has the guts to produce films that don't take themselves so seriously. RATING: **1/2 (out of four)",
         "This movie opens with a shot of Manhattan Island and then never features New York for the rest of the running time. Much like this paragraph. Nuke 'em High is a Tromaville hellhole populated by a diverse range of characters, some annoying, some funny. The Cretins (a punk gang in the vein of Griff Tannen's gang from BTTF Part II) have a deal with the neighboring nuclear power plant to deal toxic weed grown on the grounds. The sludge from the plant has already infected the school's water supply and is having a terrifying effect on the students. But the toxic weed causes horny feelings, speedy demon pregnancy, and sporadic superhuman powers (other students being completely unaffected by it is one of an infinity of logic errors). Wholesome couple Chrissy and Warren, affected by the contamination and toxic weed, battle with the Cretins in a stupendously disjointed and senseless plot, but that's missing the point. Anyone watching a Troma film for serious art will no doubt be disappointed and confused. These movies barely hang together and were made by amateurs that make Ed Wood look like Orson Welles. The cinematography is wobbly and uncertain, the acting just about passable, the sound is barely audible, and for some reason generic 80s rock music plays in the distance during every single scene. But it entertains. Class of Nuke 'em High may be trash of the lowest order, but it has a lot of energy, a lot of ideas (no matter how underdeveloped or misunderstood), crazy and interesting characters, is frequently intentionally funny, has mediocre-to-decent gore effects, has a gorgeous female lead in Janelle Brady (a sort of 80s Katherine Heigl, who has sadly massively deteriorated since then - missing and presumed dead in Las Vegas), and is never once boring. If that is all the movie sets out to do then does that make it a huge success? It led to a sequel and a spin-off - so yes?",
         "People seem to unfairly dismiss most of Troma's output. True, on the surface there is enough melting mutants, gore and exposed female flesh to appeal to the lowest common denominator, however, most Troma movies (like most good movies) make a comment on the world we live in and following the tradition of 50's radioactive monster movies, CONH explores the fears society has towards expanding and growing youth cultures who reject the ideas of the generation before them, just like the fear Rock and Roll created in the 50's that has never fully subsided and our fears about the saftey of radiation, the media and our education system. Viewed as a piece of paranoid social commentry, Class of Nukem High is a classic.",
         "Funny: The comedy is wittier than you'd expect. Along with the obvious gross gags, there are some deadpan character reactions that made me laugh, like when some of the men checking the plant for radioactivity were dropping like flies and their colleagues, who were standing right beside them, didn't seem to notice or care. Also, you learn a useful lesson here: when you find a barrel full of green slime that smells bad and makes weird noises, DON'T stick your hand into it! Sexy: The heroine is cute, but the two (or were there three?) bad girls are from another planet! Gory: Considering the budget they probably had to work with, the gore effects are ingenious. The mutations, mutilations and monsters all look good. I've not seen enough Troma films to compare this with, but it's fun for at least one viewing. (**1/2)",
         "The setup: The pupils at a high school next to a nuclear power plant start acting and looking strange after buying contaminated drugs from a plant worker. The verdict: The first half is actually quite good, as it occasionally borders on being a clever satire. The big weak spot of this film is low budget, but try not to pay attention and enjoy the film. It is a pretty unnecessary film. This story is dumb and average. Was anybody serious about this film? There's really no way to classify or categorize this film. I don't know why I watch the movies I do, because I always waste at least three hours a week watching crappy movies.",
         "If you loved The Toxic Avenger then you'll like Class of Nukem High. Brief scenes of nudity, nothing too salacious. I really like the bad guys in this flick and the motorcycles they ride. As a stoner I really liked the marijuana references! The special affects were pretty good considering how low budget this movie was. I still watch this movie just for it's campy corn-ball appeal. I especially love to show it to people who've never seen it, it's always worth a laugh. This great flick is available to watch right now on Netflix streaming. Not a ton of gratuitous T&A but really captures the gritty nature that is Troma and all of Troma's films."
      ],
      "genres": [
         "Comedy",
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": ["Troma Entertainment"],
      "summaries": [
         "When Warren and Chrissy notice some strange things happening around their high school, they begin to suspect that something is going on at the nuclear plant next door. Though the plant officials deny that there are any problems, Crissy gives birth to a bloodthirsty mutant who immediately begins eating everyone in the school. Will Warren and Chrissy be able to stop their killer kid?",
         "The pupils at a high school next to a nuclear power plant start acting and looking strange after buying contaminated drugs from a plant worker."
      ],
      "budget": 2000000
   },
   "movielensId": 3692,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1986-12-12",
      "dvdReleaseDate": "1997-12-16",
      "directors": [
         "Richard W. Haines",
         "Lloyd Kaufman"
      ],
      "runtime": 85,
      "movieId": 3692,
      "title": "Class of Nuke 'Em High",
      "mpaa": "R",
      "actors": [
         "Janelle Brady",
         "Gil Brenton",
         "Robert Prichard",
         "Pat Ryan",
         "James Nugent Vernon",
         "Brad Dunker",
         "Gary Schneider",
         "Theo Kogan",
         "Gary Rosenblatt",
         "Mary Taylor",
         "Rick Howard",
         "Lauren Heather McMahon",
         "Chris McNamee",
         "Anthony Ventola",
         "Arthur Lorenz",
         "Jennifer Prichard",
         "Dianna Flaherty",
         "Don Costello",
         "Rick Collins",
         "Richard W. Haines",
         "Elizabeth Lambert",
         "Michael Herz"
      ],
      "imdbMovieId": "0090849",
      "originalTitle": "Class of Nuke 'Em High",
      "genres": [
         "Horror",
         "Comedy",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["dMGCPRJNKUg"],
      "plotSummary": "The pupils at a high school next to a nuclear power plant start acting and looking strange after buying contaminated drugs from a plant worker.",
      "tmdbMovieId": 26554,
      "avgRating": 2.42598,
      "releaseYear": "1986",
      "numRatings": 358,
      "posterPath": "/mSwophQFXDaCjxRWhyZaP79Si4M.jpg"
   }
}