{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0112286",
      "video": false,
      "title": "Across the Sea of Time",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 12,
               "character": "Tomas Minton",
               "gender": 0,
               "credit_id": "5554bace9251416dd6002a69",
               "name": "Peter Reznick",
               "profile_path": null,
               "id": 1467084,
               "order": 1
            },
            {
               "cast_id": 13,
               "character": "Freighter Chief",
               "gender": 0,
               "credit_id": "5554bb1bc3a368208c002c84",
               "name": "John McDonough",
               "profile_path": null,
               "id": 1467085,
               "order": 2
            },
            {
               "cast_id": 14,
               "character": "Seaman",
               "gender": 0,
               "credit_id": "5554bb5dc3a368207d002a1c",
               "name": "Avi Hoffman",
               "profile_path": null,
               "id": 1467086,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Wall Street Businessman",
               "gender": 2,
               "credit_id": "5554bbcfc3a3682080002d9d",
               "name": "Matt Malloy",
               "profile_path": "/ian5yLWKo8Ttz8kEZIv9GLNCz2c.jpg",
               "id": 19208,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Julia Minton",
               "gender": 0,
               "credit_id": "5554bbed9251413931001058",
               "name": "Abby Lewis",
               "profile_path": null,
               "id": 1218074,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4c62c3a368484e1b5ae3",
               "name": "Stephen Low",
               "profile_path": null,
               "id": 77867,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5554b9779251416dd9002c8f",
               "name": "Andrew Gellis",
               "profile_path": null,
               "id": 1439903,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5554b9a99251416dd6002a32",
               "name": "Stephen Low",
               "profile_path": null,
               "id": 77867,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5554b9f19251416dd9002ca0",
               "name": "John Barry",
               "profile_path": "/9NyieJO78xbwKIBZ1589WfdRPV8.jpg",
               "id": 2289,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "5554ba049251416dd9002ca7",
               "name": "Andrew Kitzanuk",
               "profile_path": null,
               "id": 1439907,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5554ba1bc3a3682083002ca1",
               "name": "James Lahti",
               "profile_path": null,
               "id": 1173111,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "5554ba2c9251416ddf002acb",
               "name": "Avy Kaufman",
               "profile_path": "/yQPGktsmkKkhkOQAUlmYlxHJOiJ.jpg",
               "id": 2952,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "5554ba43c3a3682080002d55",
               "name": "Charley Beal",
               "profile_path": null,
               "id": 56697,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "5554ba589251416dd6002a54",
               "name": "Kate Yatsko",
               "profile_path": null,
               "id": 1467083,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "5554ba6ec3a368207b002cf1",
               "name": "Cynthia Flynt",
               "profile_path": null,
               "id": 91050,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "5554ba9fc3a36820860030e4",
               "name": "Joe Gonzalez",
               "profile_path": null,
               "id": 1395701,
               "department": "Directing",
               "job": "Script Supervisor"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "History",
            "id": 36
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 0.136358,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 139405,
      "vote_count": 3,
      "budget": 0,
      "overview": "A young Russian boy, Thomas Minton, travels to New York as a passenger on a Russian freighter. Close to Ellis Island he gets off and thus starts his journey to America the same way as all immigrants in former times. Thomas is searching for the family of one of his ancestors, who had emigrated decades ago, but once sent a letter home together with a sample of his new profession: 3D-Photography. The boy follows his relative's traces by counter-checking the old 3D-Photographs of New York (using an antique viewer) with the same places and how they look today. This way, the audience gets to see the Big Apple in former times as well as today.",
      "similar": [],
      "original_title": "Across the Sea of Time",
      "runtime": 51,
      "poster_path": "/lKOAyy098yjoot8cutYsStVO1WS.jpg",
      "spoken_languages": [
         {
            "name": "Pусский",
            "iso_639_1": "ru"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [],
      "release_date": "1995-10-20",
      "vote_average": 4.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Stephen Low"],
      "runtime": 51,
      "synopsis": null,
      "writers": ["Andrew Gellis"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0112286/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BOTIwMzk1MDc1MF5BMl5BanBnXkFtZTcwMTEzNDkyMQ@@._V1_SY300_CR43,0,214,300_AL_.jpg",
      "actors": ["Stars: Peter Reznick, John McDonough, Avi Hoffman | See full cast and crew »"],
      "reviews": [
         "It was one boring Sunday afternoon...I had nothing to do so I decided to check out the new IMAX theatre. They played this movie and I almost never recovered after it. Never would I imagine that I would be so moved by a film. I would say this is the perfect movie, both visually and storytelling. I is done with so much emotion. I cried and was completely taken by this experience. It really shows New York in a beautiful way. You can almost smell the city watching this. Beautiful film with mindblowing music by Bond composer John Barry. I immediately bought the soundtrack after I left the theatre. Just incredible! For those people (I can imagine a lot of them) who have not seen this...GO SEE IT! It is most likely very difficult to find nowdays though which is a big shame.",
         "I went along to this one in the now defunct Adelaide cinema just to try out the IMAX experience and was blown away by the brilliance of this piece. Not only was it my first visit to this particular theater, but also my first experience at 3-D IMAX. What a breathtaking introduction. The New York images were stunning, and beautifully presented around the story of the Russian boy's adventure. In particular, the historical shots of daring construction workers, dangling hundreds of feet in the air to put together New York's skyscrapers were gut wrenching. It's historical value, presenting the beginnings of one of the most exciting cities in the world, is immeasurable. A genuine, chance-viewing - I'm grateful for my good fortune at discovering it. I only wish I could get a copy for my collection.",
         "This is undoubtedly the single greatest IMAX film I have ever seen. Its visual effects may seem a little outdated - although this certainly adds to the charm - but it conveys its sweet little plot with a sense of grandeur. Whereas most IMAX films try to make you feel like you're in a theme park, watching some special effects extravaganza, \"Across The Sea Of Time\" could stand independently as an example of exceptional storytelling, and a great FILM. I'm shocked and disappointed that it clearly wasn't popular enough to sustain an audience, as it is now virtually impossible to find a cinema anywhere that is showing it. So sad. If IMAX want to save themselves, they need to commit to getting great filmmakers and allowing them to tell their stories on the big screen, as was clearly their policy when they created this. Do NOT, under any circumstances, miss this film.",
         "A grand scale IMAX 3D mini-epic blending state of the art monochrome 3D still photography from 1916, with stunning full-colour 3D motion and surround sound from 1995. The story is obviously contrived to make optimum use of the archival material: a young Russian boy, Tomas Minton, travels \"blind\" (i.e. in a room with no view) by ship to New York, and jumps ship to search for a relative who emigrated early in the century. That man had found paid work as a specialist 3D photographer and had sent home a viewer and a set of his slides which showed many aspects of 1916 New York life. Tomas routinely refers to this collection of pictures as he wanders the city trying to find recognisable landmarks in the modern skyline. (N.B. The World Trade Centre doesn't get any special attention, if it appears at all.) The 1916 images are extraordinarily detailed, fully justifying the IMAX big screen and we see a lot more than just the facade of skyscrapers, or the tinsel of Broadway. I am never likely to see New York in person, so I was impressed by all of the visuals. Director Stephen Low takes advantage of opportunities to push people's 3D response buttons, but it's not done excessively. The overall impact is of a very big city, with a personal history of endurance in the face of hardship, and with many elements of true beauty in its landscape and architecture. There's a rather natty but very unlikely happy ending, instead of the most likely event of Tomas being grabbed by Immigration and thrown on the first plane back to Russia (proving that this really is a work of fiction). Brisbane's IMAX theatre closes down this month, after consistently losing money since it opened. I feel especially privileged to have been able to experience this film in the world's biggest and best of movie theatre environments.",
         "This is a beautiful film, enhanced by John Barry's fabulous score (although some parts were written for a previous movie.) I have seen this film 3 times. Sydney Imax, Adelaide Imax and Melbourne Imax. At Melbourne, the right eye image was OUT OF FOCUS!! No, it was not me having had a few too many, and it was not the glasses. Changing them made no difference. I wrote a letter of complaint to Melbourne Imax but guess what? They didn't reply. All too hard I suppose. Considering the technology of the move projection (IE only one projector not two) it is hard to understand how one image was out of focus and not both. Someone else can explain this to me. Apart from all that, the 3D in this movie, the stereo cards, and the music - everything is just wonderful.Yes, the story too! Being a collector of stereo cards (and also having been to NYC) this movie has special significance for me. I took a friend who is also a stereo photography guru and he was totally overcome by the total experience. Now....... I made a very big mistake of buying the VHS video tape last week. One word or advice - DON'T - unless you only have one eye and/or never have and never will see the 3D version!! Such a let-down and so disappointing. If you like the music you can get the CD. Question: When will Sony Picture bring it back? It is timeless - way beyond the bounds of fashion or modernity. At least they should release it on a 3D DVD!! (Polarised glasses too...?) Maybe the technology is already here, but I haven't heard about it. Tomas Minton well done! PS. I had already posted this then I read John Frame's comments: \"Blending the best 3D imagery from 1916 and 1995, 4 January 2003\" John, just to add to your nice review, the WTC towers DO feature quite prominently in at least two scenes in the movie. A jolt to bring us back to modern times hey!",
         "Isn't it crazy? While a Sony official declares 3D nearly dead, Sony Pictures seems to refuse bringing Across the Sea of Time on the market in 3D Blu-ray. Indeed, eventually general public will loose interest in 3D TV, but only because of the lack of good movies like this one. Finally there is a good system which can bring us quality 3D, but from our wish lists we can buy only a handful. Also the continuous flow of 3D rubbish will make it hard to find the really good stuff. When you have bad luck and have bought a few bad 2D to 3D conversions and have seen buildings with an interesting interior, but only taken from the outside with a cheap camcorder thru the window while driving... Yes, I can imagine this will make a person think twice about buying another expensive 3D Blu-ray. I sure hope this situation changes in time and people will see that 3D at home can be great when 4k and OLED are combined in passive 3D. I think this is the way to go.",
         "I was curious how that format - so impressive at th IMAX theaters - would translate to the regular television screen, so I rented the VHS of this. My answer: it doesn't. One needs a big screen, I guess.....a very big screen, especially when the visuals aren't that good to start with as was the case here. This is simply a little documentary about New York City, comparing how some intersections and buildings looked back in he early part of the 20th century as compared to when this movie was made in 1996. Interwoven in the presentation is a little Russian immigrant kids story. It's quite boring for the most part. If you grew up in NYC, especially in spots where this was filmed, this would be a lot more interesting.",
         "I was left on the cutting room floor when they edited this film. In October, 1995, I brought my parents and aunt to visit New York City for a week. Either Wednesday or Thursday of that week, we went to the Natural History Museum on the Upper West Side. Mid-afternoon, we finished up there and walked down to see Lincoln Center. When we got there, they were filming a sequence where the Minton character was to walk along the retaining wall of the fountain. While they were setting up the shot, someone came up to my father and asked if I would like to be an extra. I said yes and was brought over and placed with a group of three other men. Our duty as extras was to walk around behind the fountain while Minton walked on the wall that faced Broadway. It took four or five takes before we were done. During the set up for one of the takes, the group of us were standing next the young actor playing Minton. One of the group asked him where he was born and he answered \"St. Petersburg.\" The person asking responded \"Oh, in Florida?\" and the little guy barked back \"No, Russia!\" I eventually rented the movie and that entire sequence had been abandoned."
      ],
      "genres": [
         "Adventure",
         "Drama",
         "Family",
         "History"
      ],
      "productionCompanies": ["Sony New Technologies"],
      "summaries": ["A young Russian boy, Thomas Minton, travels to New York as a passenger on a Russian freighter. Close to Ellis Island he gets off and thus starts his journey to America the same way as all immigrants in former times. Thomas is searching for the family of one of his ancestors, who had emigrated decades ago, but once sent a letter home together with a sample of his new profession: 3D-Photography. The boy follows his relative's traces by counter-checking the old 3D-Photographs of New York (using an antique viewer) with the same places and how they look today. This way, the audience gets to see the Big Apple in former times as well as today."],
      "budget": 0
   },
   "movielensId": 37,
   "movielens": {
      "languages": [
         "Pусский",
         "English"
      ],
      "releaseDate": "1995-10-20",
      "dvdReleaseDate": null,
      "directors": ["Stephen Low"],
      "runtime": 51,
      "movieId": 37,
      "title": "Across the Sea of Time",
      "mpaa": "",
      "actors": [
         "Peter Reznick",
         "John McDonough",
         "Avi Hoffman",
         "Matt Malloy",
         "Abby Lewis"
      ],
      "imdbMovieId": "0112286",
      "originalTitle": "Across the Sea of Time",
      "genres": [
         "Adventure",
         "History",
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A young Russian boy, Thomas Minton, travels to New York as a passenger on a Russian freighter. Close to Ellis Island he gets off and thus starts his journey to America the same way as all immigrants in former times. Thomas is searching for the family of one of his ancestors, who had emigrated decades ago, but once sent a letter home together with a sample of his new profession: 3D-Photography. The boy follows his relative's traces by counter-checking the old 3D-Photographs of New York (using an antique viewer) with the same places and how they look today. This way, the audience gets to see the Big Apple in former times as well as today.",
      "tmdbMovieId": 139405,
      "avgRating": 2.96629,
      "releaseYear": "1995",
      "numRatings": 89,
      "posterPath": "/lKOAyy098yjoot8cutYsStVO1WS.jpg"
   }
}