{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0105316",
      "video": false,
      "title": "Sarafina!",
      "recommendations": [47906],
      "backdrop_path": "/5EVXbZyLSyb7Hxbgmy2jreOOat6.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Sarafina",
               "gender": 0,
               "credit_id": "52fe45c19251416c9103d48f",
               "name": "Leleti Khumalo",
               "profile_path": "/zhjjTDyKYuERo3e49JaKRJ26C3i.jpg",
               "id": 2609,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Mary Masembuko",
               "gender": 1,
               "credit_id": "52fe45c19251416c9103d493",
               "name": "Whoopi Goldberg",
               "profile_path": "/n3lF8w4X4rDa4J2LMDIxMEcuUeH.jpg",
               "id": 2395,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "School Principal",
               "gender": 2,
               "credit_id": "52fe45c19251416c9103d497",
               "name": "John Kani",
               "profile_path": "/iOKWcdeCNbEREAWMWIZBy6p805j.jpg",
               "id": 51878,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Angelina",
               "gender": 1,
               "credit_id": "52fe45c19251416c9103d49b",
               "name": "Miriam Makeba",
               "profile_path": "/b60qlVK0YIWQGkXX7g6GFxTplca.jpg",
               "id": 89299,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Sarafina's Grandmother",
               "gender": 1,
               "credit_id": "59613e8792514122510a4106",
               "name": "Mary Twala",
               "profile_path": "/rE6SVkkrkmGUr6yVmBNg7ZOGP6a.jpg",
               "id": 587563,
               "order": 4
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe45c19251416c9103d48b",
            "name": "Darrell James Roodt",
            "profile_path": null,
            "id": 16730,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 2.583555,
      "production_countries": [
         {
            "iso_3166_1": "ZA",
            "name": "South Africa"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 35936,
      "vote_count": 10,
      "budget": 0,
      "overview": "The plot centers on students involved in the Soweto Riots, in opposition to the implementation of Afrikaans as the language of instruction in schools. The stage version presents a school uprising similar to the Soweto uprising on June 16, 1976. A narrator introduces several characters among them the school girl activist Sarafina. Things get out of control when a policeman shoots several pupils in a classroom. Nevertheless, the musical ends with a cheerful farewell show of pupils leaving school, which takes most of act two. In the movie version Sarafina feels shame at her mother's (played by Miriam Makeba in the film) acceptance of her role as domestic servant in a white household in apartheid South Africa, and inspires her peers to rise up in protest, especially after her inspirational teacher, Mary Masombuka (played by Whoopi Goldberg in the film version) is imprisoned.",
      "similar": [],
      "original_title": "Sarafina!",
      "runtime": 117,
      "poster_path": "/rXIU0ko8JmP5u6GBHDm82PQ8nP6.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "isiZulu",
            "iso_639_1": "zu"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/16fY7pucCzn7WSOYxOGRHlAayL3.png",
            "name": "British Broadcasting Corporation (BBC)",
            "id": 3324,
            "origin_country": "GB"
         },
         {
            "logo_path": "/sNhxHhbyJ0xo52nr9xI2cJKkWFO.png",
            "name": "Miramax Films",
            "id": 14,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Distant Horizons",
            "id": 1066,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Vanguard Films",
            "id": 614,
            "origin_country": ""
         },
         {
            "logo_path": "/xXojkyRWFZ0JTJyjiu13ThKeFbz.png",
            "name": "Hollywood Pictures",
            "id": 915,
            "origin_country": ""
         }
      ],
      "release_date": "1992-09-18",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "She was their teacher. They were her hope.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "South Africa",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Darrell Roodt"],
      "runtime": 117,
      "synopsis": null,
      "writers": [
         "Mbongeni Ngema",
         "Mbongeni Ngema"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0105316/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU5ODI3MzM3NF5BMl5BanBnXkFtZTcwOTcwNDcxMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Whoopi Goldberg, Leleti Khumalo, Miriam Makeba | See full cast and crew »"],
      "reviews": [
         "A DAMN GOOD MOVIE! One that is seriously underrated. The songs that the children sing in the movie gave me a sense of their pain, but also their hope for the future. Whoopi Goldberg puts in a good performance here, but the best performance throughout the whole movie is that of the actress who plays the title character. I wish she was in more movies. This movie should have a higher rating. I give it a 10/10.",
         "I saw Sarafina as a stage show/musical when I was only a teenager and it drove home for me the hardships of young people in Africa. I saw this movie AFTER Nelson Mandela was released and yet it still is an overwhelmingly powerful movie. I enjoyed it and personally don't think that the musical aspects spoil the message and it does the original cast proud!!! Bravo! Whoopi Goldberg lends her brilliant compassion to the role and helps to endear the school teacher who supports the kids to the audience. Unlike the traditional song and dance musicals which were all sweetness and light this movie manages to tackle hard and unpleasant issues whilst still being uplifting at times and glorious musically!",
         "I saw this movie, and the play, and I have to add that this was the most touching story that I had ever seen. Until I saw this movie I was unaware of how awful life was and probably still is for the South African children and adults that were and are living in that era. It brought tears to my eyes and much sadness to my heart that any human being should have to struggle like that just to stay alive, And to bring the children right out of that area and teach them to act and preform and turn them loose to tell their own story is simply amazing. This simply surpass a five star, I rate it a ten. Thank You Mr. Mbongeni Ngema for such a astonishing story. Although it has been 12 years since this story has been told, it is still one that lays heavy in my heart.If there is a VHS, or DVD out there on the play, Please notify me ASAP.Thank You. PS There was nothing wrong with the kids wanting to bring awareness of their problems and conditions to the attention of other countries in hopes that some one would have a heart and offer assistance.",
         "I believe Sarafina is a tremendous effort of Whoopi Goldberg. Besides her, there are no other stars in the film and her role is smaller than the title character, Sarafina. Since I work in a high school with urban children, I think this is an important film to show South African history of apartheid. Sarafina is a movie about education and a teacher's relationship with her student, Sarafina. I bought the video for practically nothing at a videostore. I watched it and fast forwarded through the musical numbers. But I strongly recommend this film to educators and their students to understand. Now while I don't know the other actors and actresses in the film, I assume that they are very popular in South Africa and I am glad that they filmed with a South African cast and crew with the exception of Goldberg in a small role but if it gets people to see this movie, than Whoopi reaches worldwide appeal.",
         "Sarafina! is all about strength, about people lacking it and people overflowing with it. Sarafina herself is a Soweto girl with great hopes for the future, despite her family's poverty and her mother's (Miriam Makeba) work away from home, forcing Sarafina to take care of her younger siblings. This is South Africa, Johannesburg, during the Apartheid regime, Mandela is in prison and the black children are forbidden to speak their own language, Xosa (you know, the click language... :)). Yet, Sarafina dreams. Her world brightens up when her class get a new teacher (Whoopi Goldberg), who teaches them about their worth and to be proud of their heritage. I fully recommend this movie, the actors, young and practically unheard of, are fantastic, the script is sharp, and the music! See this movie for the music alone. No Makeba, but lots of powerful political Soweto tunes. Go Sarafina!",
         "I bought this cheap from the rental remnant at our local store. It was in almost mint condition, and I'd never heard of it before. Clearly nobody else had either. I can't believe my luck. You go through the whole realm of emotions and it attempts to get over a complex message - the very moral and non-triumphalist stance of the Mandela Party, undoubtedly. Despite its enormous length (I had to watch it in two sittings) - it was like a book one couldn't put down. Perhaps the songs are not all that memorable, but the spirit of the thing glows on forever. I cannot understand comments that a musical (clearly designed for stage) is not realistic! I've seen \"South Pacific\" and read the book too, and can guarantee that musical is not realistic compared to the book. I'll treasure this little find until it wears out. One day they'll make this again on a better budget.",
         "Any fans of \"The Lion King\" (film -or- musical) and \"The Power of One\" will enjoy this film beyond belief. Based on the broadway musical \"Sarafina!\", this film (distributed by Buena Vista [Walt Disney Studios]) definetely meets my expectations. It isn't about the acting. I personally think that the cast was amazing, but for those select few who think Whoopi Goldberg did a so-called \"mediocre\" acting job, this film is about a story, a very strong story. Who cares about the acting? I mean, look at \"Gone With The Wind\". The acting sucks and look how popular it is! So anyway, the story is very dramatic and sort of violent, but is very emotional and touching. The music is fantastic, \"Freedom is Coming Tomorrow\" being one of the highlights of the film. If you haven't seen this movie, go see it now, regardless of what people say. It is an amazing film.",
         "I've always love this movie from when I was a kid. I saw this movie when video cassette was still the main thing to watch a movies. Just recently, I bought Sarafina DVD on Amazon but some of the music in the video aren't in the DVD version. There is a song, # 9 on the music track that isn't in the DVD version, when Sarafina's mother sang, it was more a whole clip of her singing and that isn't in there either. Can someone explain to me as to why that is the case? Or tell me where I can purchase the whole movie DVD. Track #9 was one of my favorite song which is why I noticed it wasn't in the movie when I re-watched it...",
         "An apartheid musical, adapted from a minor Broadway hit from 1988, and ostensibly directed at families (with Whoopi Goldberg's casting a commercial hook). South African students, led by headstrong teenager Sarafina, protest and riot when their beloved teacher, Goldberg's politically-wise Mary Masombuka, is taken to prison over arguments implementing the West Germanic Afrikaans as the school's language. Would-be inspirational effort, a pet project for Whoopi, was shot on-location in Soweto and Johannesburg, and does a fairly interesting job mixing the harsh realities of this strife-ridden city with unabashed singing and dancing (mainly used as fantasy subtext). However, the political points are made early on in Mbongeni Ngema's and William Nicholson's screenplay, so there's really no place surprising the picture can go. The impetus of the material is to teach us something through the students' passionate fervor, but director Darrell Roodt can only work up a mild head of steam, while his film quickly falls back on that old stand-by: sermonizing. Goldberg, in sedate mode, smiles serenely at the kids, nodding quietly in agreement with their protestations (she has the patience of 100 saints). Her first involvement in an early number, a musical prayer set on the school grounds, is ridiculously clumsy. The teenagers, energetic to a fault, fare somewhat better. *1/2 from ****",
         "I have to look up my original review for Sarafina! that I wrote back in 1992. I wrote it for the college newspaper and, of course, I kept all my articles I wrote that were published. I have some fond and funny memories of this movie review from over 20 years ago. #1: I called it the very best movie of 1992. Hands down, no question. And the year was just barely half over. #2: My editor/teacher edited my article and the line: \"\u0085and it's the best movie of 1992\" to \"\u0085and it's the best movie of 1992, in my opinion.\" I thought that was the funniest and saddest thing I ever seen her write. OBVIOUSLY it's my opinion, or I wouldn't have accomplished the goal of writing a movie review, or: opinion piece. (We published it WITHOUT her input/edit.) Wow. Well, in my defense, I saw it at a screener and I must've been in an excellent mood that day. Because there are things wrong above and it ain't my mentor's editing. (She is still wrong.) One should never conclude the year in September and state this or that's the best or worst of the year. *Especially* with award season coming up. Also, I was definitely wrong: This is the same year that released Aladdin, Unforgiven, Scent of a Woman, Basic Instinct, A Few Good Men\u0085just to name a handful and all of my favorite movies. And some of those came out earlier than this one. So, I truly don't know what I was on. At any rate, fast forward to 2013. I found this movie on DVD for a very small amount on Amazon.com. Thinking that I absolutely loved it in 1992, and that it'll probably never appear on BluRay, I purchased it. Somehow it sat shelved until recently and I rewatched it, only for the 2nd\u0085.and last time. Yeah, it didn't hold up. I even felt I was over-generous for giving it 3/5 (or in IMDb-land 5/10.) Sure the story was there and the heart was in the actors, but the songs were really mediocre at best and the feeling was only mild this time. The oddest and most coincidental thing about this viewing was that I decided, after almost a year of owning it without revisiting it, I would watch it finally and it was just past the passing of Nelson Mandela. This movie's core is about him and why they fight and move forward. I hadn't remembered that from my original viewing over two decades past. I guess I would recommend this movie, but, regrettably, not as much as I did long ago. It's a movie about war, peace, hope and prevailing. It's uplifting, fun and funny at spots while also being deep and depressing. It's not a great musical, but it's one we can stand behind. * * * Final thoughts: Wait until you get to 12/31 before you choose what's the best of the year. Take my amateur word for it."
      ],
      "genres": [
         "Drama",
         "Musical"
      ],
      "productionCompanies": [
         "British Broadcasting Corporation (BBC)",
         "Distant Horizons",
         "Hollywood Pictures"
      ],
      "summaries": ["South African teenagers fight against apartheid in the Soweto Uprising."],
      "budget": 0
   },
   "movielensId": 3711,
   "movielens": {
      "languages": [
         "English",
         "isiZulu"
      ],
      "releaseDate": "1992-09-18",
      "dvdReleaseDate": "2002-06-04",
      "directors": ["Darrell James Roodt"],
      "runtime": 117,
      "movieId": 3711,
      "title": "Sarafina!",
      "mpaa": "PG-13",
      "actors": [
         "Leleti Khumalo",
         "Whoopi Goldberg",
         "John Kani",
         "Miriam Makeba",
         "Mary Twala"
      ],
      "imdbMovieId": "0105316",
      "originalTitle": "Sarafina!",
      "genres": [
         "Music",
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The plot centers on students involved in the Soweto Riots, in opposition to the implementation of Afrikaans as the language of instruction in schools. The stage version presents a school uprising similar to the Soweto uprising on June 16, 1976. A narrator introduces several characters among them the school girl activist Sarafina. Things get out of control when a policeman shoots several pupils in a classroom. Nevertheless, the musical ends with a cheerful farewell show of pupils leaving school, which takes most of act two. In the movie version Sarafina feels shame at her mother's (played by Miriam Makeba in the film) acceptance of her role as domestic servant in a white household in apartheid South Africa, and inspires her peers to rise up in protest, especially after her inspirational teacher, Mary Masombuka (played by Whoopi Goldberg in the film version) is imprisoned.",
      "tmdbMovieId": 35936,
      "avgRating": 3.15723,
      "releaseYear": "1992",
      "numRatings": 159,
      "posterPath": "/rXIU0ko8JmP5u6GBHDm82PQ8nP6.jpg"
   }
}