{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "drama",
            "id": 8029
         },
         {
            "name": "racism",
            "id": 12425
         }
      ],
      "imdb_id": "tt0094882",
      "video": false,
      "title": "Clara's Heart",
      "recommendations": [
         31564,
         279756,
         99754,
         444839,
         39062,
         49345,
         59585,
         117553,
         34053,
         369450,
         30231,
         201724,
         117904,
         57012,
         41589,
         20310,
         124096,
         77822,
         58093,
         28368
      ],
      "backdrop_path": "/3CcpdRm4sOuzb1wSABnRQYdYNXI.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Clara Mayfield",
               "gender": 1,
               "credit_id": "52fe488bc3a368484e0fe331",
               "name": "Whoopi Goldberg",
               "profile_path": "/n3lF8w4X4rDa4J2LMDIxMEcuUeH.jpg",
               "id": 2395,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Peter Epstein",
               "gender": 2,
               "credit_id": "52fe488bc3a368484e0fe335",
               "name": "Michael Ontkean",
               "profile_path": "/6IEe5QuVb1FKjPZahGtSDD3TcLQ.jpg",
               "id": 6678,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Leona Hart",
               "gender": 1,
               "credit_id": "52fe488bc3a368484e0fe339",
               "name": "Kathleen Quinlan",
               "profile_path": "/qxEXUFX8LP7jAgLvB51S1lWB2zn.jpg",
               "id": 8183,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "David Hart",
               "gender": 2,
               "credit_id": "52fe488bc3a368484e0fe33d",
               "name": "Neil Patrick Harris",
               "profile_path": "/3GJBcsLf6Kfy0x5DeSXKsIqcctP.jpg",
               "id": 41686,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Peter Epstein",
               "gender": 2,
               "credit_id": "52fe488bc3a368484e0fe341",
               "name": "Spalding Gray",
               "profile_path": "/xXUGK1bQRi6vBT8Xu0NsShIEKRe.jpg",
               "id": 8978,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Alan Lipsky",
               "gender": 2,
               "credit_id": "52fe488bc3a368484e0fe345",
               "name": "Jason Downs",
               "profile_path": null,
               "id": 86805,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Blanche Loudon",
               "gender": 0,
               "credit_id": "52fe488bc3a368484e0fe349",
               "name": "Hattie Winston",
               "profile_path": "/dwiglObCKhTDJsp6Rn8KsHfFWmz.jpg",
               "id": 1212688,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe488bc3a368484e0fe321",
               "name": "Robert Mulligan",
               "profile_path": "/uqh0IKRmazRkxi9F2g7fnpJhZBa.jpg",
               "id": 8482,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe488bc3a368484e0fe327",
               "name": "Joseph Olshan",
               "profile_path": null,
               "id": 568002,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe488bc3a368484e0fe32d",
               "name": "Mark Medoff",
               "profile_path": null,
               "id": 19799,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 2.168489,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 73079,
      "vote_count": 14,
      "budget": 0,
      "overview": "David is a teenager whose parents are in a deteriorating marriage after their infant daughter dies. Clara is a chambermaid at a Jamaican resort who's hired to be a housekeeper. She and David develop a close bond, opening his eyes and heart to new experiences, and eventually leading to a disturbing secret in Clara's past.",
      "similar": [
         381284,
         50014,
         435126,
         62206,
         10637,
         37247,
         1538,
         4982,
         9798,
         68718,
         50620,
         210577,
         1640,
         2118,
         10530,
         67308,
         75780,
         147441,
         346364,
         329865
      ],
      "original_title": "Clara's Heart",
      "runtime": 108,
      "poster_path": "/fSQx702vmmUq9lIOMDPzpk8bFRR.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "MTM Enterprises",
            "id": 15847,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1988-10-07",
      "vote_average": 4.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Robert Mulligan"],
      "runtime": 108,
      "synopsis": null,
      "writers": [
         "Joseph Olshan",
         "Mark Medoff"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0094882/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg5NTI1MjIwMl5BMl5BanBnXkFtZTYwMTY5MTk5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Whoopi Goldberg, Michael Ontkean, Kathleen Quinlan | See full cast and crew »"],
      "reviews": [
         "besides the fact that Whoopi Goldberg and Spalding Gray are in this film, this is a very nice set-piece for families in America, who \"have it all\" yet something is missing. Whoopi Goldberg and Spalding Gray (recently deceased) are the bookends of a tragic story of yet another family that does not work out. Katherine Quinlan, Neil Patrick Harris, and Michael Ontkean are the family, who cannot hold it together after a baby dies. The shores of Baltimore are well-filmed and beautiful, as well as the scenes in Jamaica, where Quinlan befriends Goldberg, and learns about the complexities of life. This is a film worth watching because there are no pat answers. The audience sees a story true to life, and empathizes with the actors. The cinematography is also noteworthy, and anyone who has experienced loss will not regret watching this film. 9/10.",
         "I recently saw this movie for the second time. The first time I was 13 years old, and while I really enjoyed it then, it was certainly worth a second viewing as an adult. This movie has so many layers... Whoopi Goldberg is brilliant in her role as a Jamaican housekeeper, and both she and Neil Patrick Harris are quite witty... at times I found myself laughing out loud at their sarcastic banter. Besides making me laugh and cry, this movie also makes me angry... David's parents seem so self-absorbed and unconcerned about their son's welfare. I really felt sorry for him, and glad he had Clara. The ending is refreshing in that it is not a sappy \"happily ever after\", but also not horrible... it's nice to see something realistic for a change.",
         "Loved it when I first saw it and will always love it. It's one of those 80's movies that tears at your heart strings without being to sappy. It makes the viewer aware that this kind of things are happening in other households and that it's actually something that's real and not made up. If you watch it as a kid and then watch it as an adult you may learn more about it. This is one movie I want on DVD, because it shows that like others have mentioned, it's not a happy ever ending, but a realistic ending. David learns some valuable lessons as he is trying to deal with his guilt of his baby sister's death. Remember when he wanted to save a toy of hers and Clara tells him no. (I haven't watched it in a long time so I don't know exactly what she say, but it's something to think about.) I love this movie and always will. I think everyone should see this movie.",
         "I recently caught this on TV, and gave it a chance based on the strength of Whoopi Goldberg. In his first acting role Neil Patrick Harris is David a teenager whose parents are in a crumbling marriage after their infant daughter dies. Clara (Whoopi Goldberg) is a chambermaid at a Jamaican resort who's hired to be a housekeeper. After a rocky start she and David develop a close bond. As much as I enjoy Goldberg's comedy roles like \"Sister Act\" I love it when she does serious work like this. She is an excellent dramatic actress, that should have had more top roles. Patrick Harris is simply superb, and was nominated for a Golden Globe for his work here. David's parents seem so self-absorbed and unconcerned about their son's welfare. I really felt sorry for him. The ending is not a \"happily ever after\" one, but also not horrible either.... it's nice to see something realistic for a change. It reminded me of the ending to Mrs Doubtfire.",
         "I only caught \"the rest of the movie\" But seeing W Goldberg I decided to watch it and loved it. Young white American boy find out his parents will not stay together and has to deal with it. House Keeper W G is supposed to be Jamaican and it seems has \"raised\" this child along his parents and somehow has become part of the family all hierarchy still in vigor but not really imposed as it seems this family has much relied on her. Young David is also faced with a mystery with his allied house keeper and his growing up is doubly challenged by his own situation but also with his parent's substitute unclear past. I do have a lot of time for W G and enjoyed her performance never giving into over emotional yet displaying a genuine caring attitude. Some may find the final finding a little over the top, but I know sometimes reality can be larger than fiction so personality I go with the flow. I wonder why there are so few reviews...to each its own",
         "Well I must say this is nothing new to us what concerns the plot.But I loved it unconditioned for what it is expected.Perhaps my rating(***/1/2)is not really to agree. But I I had nice feelings on the movie.It was really likely.Just from the beginning you could expect how it was going on.The acting of whoopie is not that we are known about but not bad.The little boy is interesting along the film. He gives that little way of speeding Clara that gives you the taste to watch it.It was nice to me (even it's not my favorite genre).It's hard to make eleven lines if you have to say less about it.I can't sing glory till the end. But you won't disagree totally to this film."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "MTM Enterprises",
         "Warner Bros."
      ],
      "summaries": ["David is a teenager whose parents are in a deteriorating marriage after their infant daughter dies. Clara is a chambermaid at a Jamaican resort who's hired to be a housekeeper. She and David develop a close bond, opening his eyes and heart to new experiences, and eventually leading to a disturbing secret in Clara's past."],
      "budget": 0
   },
   "movielensId": 3714,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1988-10-07",
      "dvdReleaseDate": null,
      "directors": ["Robert Mulligan"],
      "runtime": 108,
      "movieId": 3714,
      "title": "Clara's Heart",
      "mpaa": "",
      "actors": [
         "Whoopi Goldberg",
         "Michael Ontkean",
         "Kathleen Quinlan",
         "Neil Patrick Harris",
         "Spalding Gray",
         "Jason Downs",
         "Hattie Winston"
      ],
      "imdbMovieId": "0094882",
      "originalTitle": "Clara's Heart",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["4fYg2S6c84s"],
      "plotSummary": "David is a teenager whose parents are in a deteriorating marriage after their infant daughter dies. Clara is a chambermaid at a Jamaican resort who's hired to be a housekeeper. She and David develop a close bond, opening his eyes and heart to new experiences, and eventually leading to a disturbing secret in Clara's past.",
      "tmdbMovieId": 73079,
      "avgRating": 3.07895,
      "releaseYear": "1988",
      "numRatings": 228,
      "posterPath": "/fSQx702vmmUq9lIOMDPzpk8bFRR.jpg"
   }
}