{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "police",
            "id": 6149
         },
         {
            "name": "drugs",
            "id": 14964
         }
      ],
      "imdb_id": "tt0093011",
      "video": false,
      "title": "Fatal Beauty",
      "recommendations": [
         220674,
         60631,
         59487,
         12719,
         14441,
         85509,
         4988,
         42514,
         38921,
         53426,
         67307,
         19143,
         31701,
         20328,
         287915,
         33055,
         62676,
         35068,
         25720,
         87235
      ],
      "backdrop_path": "/4NOPXl6BiUWVfRPVyZmJZbwMGHE.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Rita Rizzoli",
               "gender": 1,
               "credit_id": "52fe45a69251416c91039a7d",
               "name": "Whoopi Goldberg",
               "profile_path": "/n3lF8w4X4rDa4J2LMDIxMEcuUeH.jpg",
               "id": 2395,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Mike Marshak",
               "gender": 2,
               "credit_id": "52fe45a69251416c91039a81",
               "name": "Sam Elliott",
               "profile_path": "/f2AxZZ6d0Cit0tmf6wYTHcGfwT9.jpg",
               "id": 16431,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Carl Jimenez",
               "gender": 2,
               "credit_id": "52fe45a69251416c91039a85",
               "name": "Rubén Blades",
               "profile_path": "/5J86KHFqEEFgMAdWfUqdpAD3sjV.jpg",
               "id": 2049,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Conrad Kroll",
               "gender": 2,
               "credit_id": "52fe45a69251416c91039a89",
               "name": "Harris Yulin",
               "profile_path": "/MCW4IR3mEB6oeRbX9bfeHkZ3qm.jpg",
               "id": 1166,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Lt. Kellerman",
               "gender": 2,
               "credit_id": "52fe45a69251416c91039a8d",
               "name": "John P. Ryan",
               "profile_path": "/lMdObPGv8eNscCpC0ICYSc01t75.jpg",
               "id": 15213,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Cecile Jaeger",
               "gender": 1,
               "credit_id": "52fe45a69251416c91039a91",
               "name": "Jennifer Warren",
               "profile_path": "/uX51ZwPiHVIc0nZfAwEfZIwVknf.jpg",
               "id": 70241,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Leo Nova",
               "gender": 2,
               "credit_id": "52fe45a69251416c91039a95",
               "name": "Brad Dourif",
               "profile_path": "/6pqeGxtWEdDjYsnQfUkmzXLlDvs.jpg",
               "id": 1370,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Earl Skinner",
               "gender": 2,
               "credit_id": "52fe45a69251416c91039a99",
               "name": "Mike Jolly",
               "profile_path": null,
               "id": 114326,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Deputy Getz",
               "gender": 2,
               "credit_id": "52fe45a69251416c91039a9d",
               "name": "Charles Hallahan",
               "profile_path": "/bXRE5dfHZZhovEbXgQCXDTw9ZHY.jpg",
               "id": 15414,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Raphael",
               "gender": 0,
               "credit_id": "52fe45a69251416c91039aa1",
               "name": "David Ryan Harris",
               "profile_path": "/1QBoLZPa01wuK26Yt1hXtHoO1q8.jpg",
               "id": 90390,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "5411ef0ec3a368021500148d",
               "name": "Tom Holland",
               "profile_path": "/yYNJTyRwKoUT27Dp9fIO9rWwO3s.jpg",
               "id": 64796,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5411ef3cc3a368020400185e",
               "name": "Hilary Henkin",
               "profile_path": null,
               "id": 8251,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5411ef4bc3a3680207001645",
               "name": "Dean Riesner",
               "profile_path": null,
               "id": 14776,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 3.250299,
      "production_countries": [
         {
            "iso_3166_1": "JP",
            "name": "Japan"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 35463,
      "vote_count": 18,
      "budget": 0,
      "overview": "Rita Rizzoli is a narcotics cop with a plethora of disguises. When a drug shipment is hijacked, the thieves don't know that the drug is unusually pure and packs of 'Fatal Beauty' begin turning up next to too many dead bodies. Mike works for the original owner of the drugs and tries to tell himself that since he does not handle the drugs, he is 'clean'. Mike becomes Rita's constant companion.",
      "similar": [
         9104,
         1266,
         429733,
         4771,
         479,
         141733,
         20676,
         96,
         507,
         979,
         627,
         193893,
         984,
         26196,
         9873,
         2142,
         10651,
         9631,
         8012,
         1586
      ],
      "original_title": "Fatal Beauty",
      "runtime": 104,
      "poster_path": "/bobwwl5NB10N5qfPOwOHb3DyJcT.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "CST Telecommunications",
            "id": 32793,
            "origin_country": ""
         },
         {
            "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
            "name": "Metro-Goldwyn-Mayer",
            "id": 21,
            "origin_country": "US"
         }
      ],
      "release_date": "1987-10-30",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "An earthquake is about to hit L.A. It's called Detective Rita Rizoli.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Tom Holland"],
      "runtime": 104,
      "synopsis": null,
      "writers": [
         "Bill Svanoe",
         "Hilary Henkin"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0093011/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTA0NTYyNzkwMDBeQTJeQWpwZ15BbWU3MDQwNzQzMjE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Whoopi Goldberg, Sam Elliott, Rubén Blades | See full cast and crew »"],
      "reviews": [
         "This film is fantastic, containing action, comedy and drama. Typical 80's style (i.e: Beverley Hill Cop style). Its good to see a comedian based actress playing parts both funny and serious. If you are a Whoopi Goldberg fan, you will not be disappointed. Alongside Whoopi, Sam Elliott (Mask, Road House) plays a good guy on the wrong side and the chemistry between him and Whoopi shows very well. What makes a good film is when two different style actors/actresses bounce off each other in a positive way. Also includes the brilliant actor Brad Dourif (Child's Play). Never fails to play an excellent bad guy. Not going to give much away in this review as you can tell, because the movie speaks for itself... However, if you enjoy a good action film with a side of humour, without all the 'star wars' special effects... Fatal Beauty should be on your list!",
         "Rita Rizzoli (Whoopi Goldberg) is going to put the drug king out of business who is producing a deadly drug that's killing people off at an alarming rate. The drug king's top security man, Mike Marshak (Sam Elliott), takes a shine to Rita, although we aren't sure why. I spent the entire film thinking he might be an undercover cop -not so. Had it been any other actor besides Elliott I think this flaw might have prevented the film from being believable. But Elliott, and his cool, understated style just swept me away with his obvious attraction to Rita. There are some very moving moments, some frighteningly real back alley scenes of drug dealings and shootout after shootout. I didn't know what to expect with this film, and was hoping Whoopi would sail with it. She did!",
         "Fatal Beauty has the advantage of allowing Whoopie Goldberg to bounce her keen and cutting wit off Sam Elliott's straight and penetrating gaze. The action is bone-crunching gang-banging blended with South of the Border stylized gun battles, Corporate money, and big drugs. I particularly like this one for Sam Elliott's prominence. He portrays hired muscle for a corporate big wig, who has no idea what his boss is up to. He also has a hint of a love interest with the star, and I found that delightful. His down to earth personality is perfectly cast, and wittingly executed. This one always surprises me. It rates a 7.8/10 on the Buddy Cop Scale from... the Fiend :.",
         "Whoopi Goldberg succeeds in adding spunk, wit, and a little heart in what could have been a boring pro forma shoot-em-up. Tired cop movie clichés suddenly seem fresh with a woman, especially one as charismatic as Whoopi in the lead role. She and Sam Elliot have an undeniable chemistry that's evident from the moment they appear on screen together for the first time. Go figure! The film is pretty climatic; shoot outs where the bad guys miss and the good guys don't, and some moments where the hero's in a jam but their partner appears out of nowhere to save the day, etc. But the film is full of solid, engrossing performances, particularly Goldberg, Elliot, and Dourif, and an engaging, albeit derivative plot. Overall not a bad way to kill an hour and some change. 6.5 stars.",
         "Enjoyable movie, albeit a bit violent for my liking. Whoopi shows sentiment and goofiness at the same time. She and Sam Elliot are an odd combination tho, but it seems to work. Whoopi plays a drug cop who made some poor choices as a young mother. She is attempting to pay back society for her mistakes by being a caring cop. She tends to be the butt of the department, but her devotion to her job is endearing. Sam Elliot is self-righteous and not entirely believable, I mean, who would be a body guard for a drug baron and then for a drug cop? Just a bit of a stretch. Still, the movie is better than middle. Bottom line - I wouldn't rush out and buy the DVD, but I do enjoy watching it when it comes on TV.",
         "Director Tom Holland attempts to bring the \"Whoopi Goldberg caper comedy\" into a new era by adding more serious, dramatic content, drugs and violence. The picture ends up being a murky hybrid of different styles, with Goldberg cast as a cop in Los Angeles tracking down a narcotics ring dealing in killer drugs (isn't that redundant?). Sub-plot romance between Whoopi and fellow cop Sam Elliott never gets off the ground (mainly because Holland keeps most of this story-thread off the screen), while Goldberg tosses in a few sassy asides to reassure us she hasn't become Dirty Harriet. The end result shows definite signs of post-production tinkering, and very little of it is successful. *1/2 from ****",
         "Whoopi has been in plenty of good films and a very little bad films. Fatal Beauty is not a bad film but it's not the best Whoopi can give you. I loved Jumpin Jack Flash but this movie doesn't have the appeal that Jumpin Jack Flash did. Fatal Beauty is still worth a look despite its flaws. Plot: Fatal Beauty is in reference to a drug that kills its users within a few hours of its use. Whoopi Goldberg plays Rita Rizzoli, a cop who constantly goes undercover to find crooks and bust them. She stumbles unto the lethal drug called \"Fatal Beauty\" one night during a bust and is bent on finding out who is supplying it. She has to put up with a corrupted millionaire who she believes is in on the whole operation and his bodyguard Mike Marshak(Sam Elliot) who is attracted to her. Opinion: Fatal Beauty has its share of positives as well as negatives. Positives: Its funny(even though the laughs are sometimes sporadic), there are serious moments in the movie that sometimes work(like Rita revealing why she does what she does), the action scenes are decent, and the movie as a whole is a decent watch. Negatives: The laughs are sporadic, there is no chemistry between Whoopi's character and Sam Elliot's character(hell, there is more chemistry between Boris and Natasha of Rocky and Bullwinkle than these two), Sometimes there are more unintentional laughs then genuine laughs, sometimes the movie feels like a Beverly Hills Cop knockoff(Rita gets so deep into a case that it costs her her job just like Axel Foley). Other than that this movie is still worth watching. Its far from the best movie that Whoopi has been in but its also far from the worst(Theodore Rex and Burglar). Its still worth being in your Whoopi Goldberg collection.",
         "Cher was supposed to play this part and left to be replaced with Whoopi that is probably why this is an odd film. She(Cher ) and Sam Elliott became friendly doing the film \"Mask\" and wanted to work again. For some unknown reason Cher left at the last minute. Whoopi was \"hot\" at the time(box office wise) and was offered the part. She should have turned it down. Although she is a good actor,to use her for a part that was tailored for Cher is a bit silly. Proof,once again, that Hollywood producers can make some strange decisions. These events become legendary.Marlon Brando for the \"Sundance kid\". Thank God cooler heads prevailed.Or,Robert Evans fighting for Alan Delone for the part of Michael in the \"Godfather\"",
         "Rita Rizzoli is an undercover cop working in the narcotics section. When a job goes sour she loses her lead on a high ranking middleman she suspects deals for `legitimate' businessman Conrad Kroll. When the same guy turns up dead later that night in what looks like a large raid on a drug deal she realises that Kroll may have other players involved. When the same drug starts turning up cut into a lethal mix Rizzoli confronts him but finds that another group may be responsible. Rizzoli continues her investigation but has the help of Kroll's chief of security who has been assigned to keep an eye on Rita. Clearly designed as a vehicle to do for Goldberg what the Beverly Hills Cop movies did for Eddie Murphy, this sees the traditional mix of wise cracking cop and action mixed up in a plot that scores as few points for logic as it does for originality of genre. The plot seems to barely keep moving forward and feels like it was added to on a scene by scene basis rather than developed as a story \u0096 hence whole scenes just lead to other scenes in a very disjointed way. Also it asks us to accept a lot of big plot holes as well as some things that are just plain silly (businessman Kroll coming into a gunfight and pulling out on Rizzoli even though she has nothing on him!). The film has dated badly and feels very 80's. The original Beverly Hills Cop may be 80's as well but it is good and hasn't dated so badly \u0096 this film is very much of it's time and is full of clichés that typify the period. The action is very basic and there is no real tension at any point, this was a surprise considering there is a 15 minute shoot out at the end which surely could have been done with much more suspense rather than just shooting up lots of extras. Aside from this the film adds an almost unnecessary string to it's bow by including the romantic subplot with Mike. Now the fact that he doesn't suspect his boss does anything wrong, the fact she lets him get close and the way he always seems to turn up in the nick of time, suggested that the film could really have done without him. He isn't around long enough for the romance to really develop and I just assumed it was a way to bring the film into the `mismatched bickering partner' stable that was very popular at the time. That said, Elliott does do quite well in the role \u0096 he has an easy charm and the two stars do have some chemistry going on. Goldberg works hard with the wisecracks but really the material isn't there for her to do anything with. Her style of exaggerated clowning doesn't really fit with the hard edge either turning this into more of a standard thriller than an action comedy. Brad Dourif is on form as the bug eyed drug dealer, he has little screen time but makes a good impression. Yulin is a by-the-numbers bad guy that the film doesn't even know what to do with once it creates him (hence the lazy dispatch he receives). Blades is comical but underused. Overall this has dated quite badly and is probably only of interest to real fans of Whoopi Goldberg. Compared to the film that that this is clearly trying to emulate, Fatal Beauty is low in excitement, low on laughs, low on plot logic and sadly lacks it's own style. A fatal combination that almost kills off the film.",
         "Goldberg-movies in generally are not so good and I have accept that but this is too much. This movie is in my short list of terrible movies. I just can`t understand why they do so stupid movies like this. Whoopi is not funny, period. 2/10"
      ],
      "genres": [
         "Action",
         "Comedy",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Metro-Goldwyn-Mayer (MGM)",
         "CST Telecommunications"
      ],
      "summaries": ["Rita Rizzoli is a narcotics police officer with a plethora of disguises. When a drug shipment is hijacked, the thieves don't know that the drug is unusually pure and packs of \"Fatal Beauty\" begin turning up next to too many dead bodies. Mike Marshak works for the original owner of the drugs and tries to tell himself that since he does not handle the drugs, he is \"clean\". Mike becomes Rita's constant companion as the drug hijackers (who are nearly psychotic and very well armed) are hunted, while more and more bodies continue to turn up."],
      "budget": 0
   },
   "movielensId": 3716,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1987-10-30",
      "dvdReleaseDate": "2001-02-06",
      "directors": ["Tom Holland"],
      "runtime": 104,
      "movieId": 3716,
      "title": "Fatal Beauty",
      "mpaa": "R",
      "actors": [
         "Whoopi Goldberg",
         "Sam Elliott",
         "Rubén Blades",
         "Harris Yulin",
         "John P. Ryan",
         "Jennifer Warren",
         "Brad Dourif",
         "Mike Jolly",
         "Charles Hallahan",
         "David Ryan Harris"
      ],
      "imdbMovieId": "0093011",
      "originalTitle": "Fatal Beauty",
      "genres": [
         "Adventure",
         "Action",
         "Comedy",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "cnXBw1C1VmA",
         "HoSCE2kdTak"
      ],
      "plotSummary": "Rita Rizzoli is a narcotics cop with a plethora of disguises. When a drug shipment is hijacked, the thieves don't know that the drug is unusually pure and packs of 'Fatal Beauty' begin turning up next to too many dead bodies. Mike works for the original owner of the drugs and tries to tell himself that since he does not handle the drugs, he is 'clean'. Mike becomes Rita's constant companion.",
      "tmdbMovieId": 35463,
      "avgRating": 2.32906,
      "releaseYear": "1987",
      "numRatings": 234,
      "posterPath": "/bobwwl5NB10N5qfPOwOHb3DyJcT.jpg"
   }
}