{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0182295",
      "video": false,
      "title": "Love's Labour's Lost",
      "recommendations": [
         121822,
         57738,
         46797,
         143547,
         53905,
         44705,
         30500,
         27444,
         18451,
         42453,
         22976,
         31923,
         76297,
         61418,
         48249,
         39477,
         143928,
         63063,
         19378,
         13588
      ],
      "backdrop_path": "/jalcbliVgYuLC642q4Es1EGbgE6.jpg",
      "revenue": 299792,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "The King (Ferdinand)",
               "gender": 2,
               "credit_id": "52fe47eec3a36847f814fd6d",
               "name": "Alessandro Nivola",
               "profile_path": "/lLlaotVNM6dhjXj7GWVLSedugct.jpg",
               "id": 4941,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "The Princess",
               "gender": 0,
               "credit_id": "52fe47eec3a36847f814fd71",
               "name": "Alicia Silverstone",
               "profile_path": "/12OZNUQRfloOCJ7Q4JQneojSyQ4.jpg",
               "id": 5588,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Rosaline",
               "gender": 1,
               "credit_id": "52fe47eec3a36847f814fd75",
               "name": "Natascha McElhone",
               "profile_path": "/vLiVvD6uRPaunzJEpfA0aPjtD1P.jpg",
               "id": 11317,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Berowne",
               "gender": 2,
               "credit_id": "52fe47eec3a36847f814fd79",
               "name": "Kenneth Branagh",
               "profile_path": "/bmpGjbqvAVNOK3ggiuET2Jl96tZ.jpg",
               "id": 11181,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Sir Nathaniel",
               "gender": 2,
               "credit_id": "52fe47eec3a36847f814fd7d",
               "name": "Richard Briers",
               "profile_path": "/cdOxeResI28YXe912GbQKKvbKv8.jpg",
               "id": 29859,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Armado",
               "gender": 2,
               "credit_id": "52fe47eec3a36847f814fd81",
               "name": "Timothy Spall",
               "profile_path": "/yMClxMrLdOXk37RGvrqJEWjg9ko.jpg",
               "id": 9191,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Maria",
               "gender": 1,
               "credit_id": "53af4b7e0e0a26597d00521a",
               "name": "Carmen Ejogo",
               "profile_path": "/yAiQAfxCAFw2SNIVpAePKXBvT58.jpg",
               "id": 37158,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Dumaine",
               "gender": 2,
               "credit_id": "53af4b9d0e0a265989005223",
               "name": "Adrian Lester",
               "profile_path": "/oeTSuzejXQ6vpzKdLRFO2SHiLXp.jpg",
               "id": 76215,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Longaville",
               "gender": 2,
               "credit_id": "5545f86092514158650064e9",
               "name": "Matthew Lillard",
               "profile_path": "/gJsQkX20g0ABquHqVpBJzMXR2JF.jpg",
               "id": 26457,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Holofernia",
               "gender": 1,
               "credit_id": "5545f89392514119e0003791",
               "name": "Geraldine McEwan",
               "profile_path": "/tKcjt4kzcy5OYMtTzb0RHsAzuvz.jpg",
               "id": 8326,
               "order": 10
            },
            {
               "cast_id": 23,
               "character": "Jacquanetta",
               "gender": 1,
               "credit_id": "5545f8b992514158650064f2",
               "name": "Stefania Rocca",
               "profile_path": "/3d1eM7BfixNOXLD4vLexip9yNeH.jpg",
               "id": 15917,
               "order": 11
            },
            {
               "cast_id": 24,
               "character": "Constable Dull",
               "gender": 2,
               "credit_id": "562ea213c3a3681b5400bb99",
               "name": "Jimmy Yuill",
               "profile_path": "/zeuinVj4XOYzWSty96mM3SaD1mB.jpg",
               "id": 151797,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47eec3a36847f814fd69",
               "name": "Kenneth Branagh",
               "profile_path": "/bmpGjbqvAVNOK3ggiuET2Jl96tZ.jpg",
               "id": 11181,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5545f70ac3a3680ce6006694",
               "name": "Kenneth Branagh",
               "profile_path": "/bmpGjbqvAVNOK3ggiuET2Jl96tZ.jpg",
               "id": 11181,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5545f71d925141499f002800",
               "name": "William Shakespeare",
               "profile_path": "/2z4njqosEQM4g26ttb9grG9rJUg.jpg",
               "id": 6210,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 2,
               "credit_id": "5545f7389251414c37003a9d",
               "name": "Kenneth Branagh",
               "profile_path": "/bmpGjbqvAVNOK3ggiuET2Jl96tZ.jpg",
               "id": 11181,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5545f751925141586d0061df",
               "name": "David Barron",
               "profile_path": null,
               "id": 65614,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5545f783925141586d0061e6",
               "name": "Patrick Doyle",
               "profile_path": "/mo87kZiHO5gsoax80Us0S2CPmS.jpg",
               "id": 9152,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "5545f797c3a3680ce8006360",
               "name": "Alex Thomson",
               "profile_path": null,
               "id": 21516,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5545f7a7c3a3680ce60066a4",
               "name": "Dan Farrell",
               "profile_path": null,
               "id": 1462343,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5545f7ba925141499f002830",
               "name": "Neil Farrell",
               "profile_path": null,
               "id": 41376,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "5545f7c9c3a3680cd50066f1",
               "name": "Nina Gold",
               "profile_path": "/kljYhRvTAqQfX198mjz0ITP0hFM.jpg",
               "id": 16363,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "5545f7dcc3a3680cd50066f3",
               "name": "Randi Hiller",
               "profile_path": null,
               "id": 20540,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "5a884c179251410a89050223",
               "name": "Harvey Weinstein",
               "profile_path": "/jonLOgQIZPBn650kLcsKOPois7U.jpg",
               "id": 59839,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.701368,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 51333,
      "vote_count": 16,
      "budget": 13000000,
      "overview": "An update of the classic Shakespeare story, director Kenneth Branagh shot this movie like a classic 30s musical. Love's Labour's Lost tells the story of four best friends who swear off love. The King of Navarre and his three companions swear a very public oath to study together and to renounce women for three years. Their honour is immediately put to the test by the arrival of the Princess of France and her three lovely companions. It's love at first sight for all concerned followed by the men's highly entertaining but hopeless efforts to disguise their feelings.",
      "similar": [],
      "original_title": "Love's Labour's Lost",
      "runtime": 93,
      "poster_path": "/1VHCfHJ4PpGbmPQWJHF1YoBXRHG.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Shakespeare Film Company",
            "id": 3804,
            "origin_country": ""
         },
         {
            "logo_path": "/6T3SAuukIHvGrImCJ4zgYvOTn4F.png",
            "name": "Pathé Pictures International",
            "id": 1178,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Intermedia Films",
            "id": 763,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Arts Council of England",
            "id": 718,
            "origin_country": ""
         },
         {
            "logo_path": "/8T8OOQe3Xei2mW0DQepwQG1IMT0.png",
            "name": "StudioCanal",
            "id": 694,
            "origin_country": "FR"
         },
         {
            "logo_path": "/sNhxHhbyJ0xo52nr9xI2cJKkWFO.png",
            "name": "Miramax Films",
            "id": 14,
            "origin_country": ""
         }
      ],
      "release_date": "2000-03-31",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "A new spin on the old song and dance",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Kenneth Branagh"],
      "runtime": 93,
      "synopsis": null,
      "writers": [
         "William Shakespeare",
         "Kenneth Branagh"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0182295/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYxMjYzMDY4N15BMl5BanBnXkFtZTcwODU5ODEyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Alessandro Nivola, Alicia Silverstone, Natascha McElhone | See full cast and crew »"],
      "reviews": [
         "Thanks heaven for Kenneth Branagh; without him, cinema would be far less interesting and rewarding. His adaptations of Shakespeare will undoubtedly be his lasting contribution to the history of film, and this is no exception. Having never read the play, I was quite pleased that Love's Labour's Lost was as easy to follow as it was. This has a fair amount in common with Branagh's earlier Much Ado About Nothing; mainly the highs, lows and plain ridiculousness of love. That film also featured Hollywood star casting (Keanu Reeves among others), but like that film, does not suffer from it. Indeed, it only seems to boost the feel-good nature of this film, as the actors joyfully get their collective teeth stuck into some of Shakespeare's wonderful dialogue. What really makes this a must-see though is how the text is broken up into easily digestible chunks, interspersed with classic musical numbers from the 1930s. I wasn't prepared for how much of a joy it was to see some wonderfully romantic songs (sung pretty well actually) being put to some great dance numbers - Adrian Lester in particular was good. If, like me, you're too young to feel particularly nostalgic towards a time and genre of film that has long since gone, then I urge you to watch this and learn. And if you are old enough to yearn for those days, then do yourself a favour and go see!",
         "Interesting reading the reviews herein. The reviewers either loved or hated it. Some witty shots taken at Branagh's effort to make one of The Bard's weakest comedies into something enjoyable. I mean, c'mon. The play is a story of young men swearing off of love and being made to eat their vows by clever women through little games and switched clues. Hardly a deep plot with potentially tragic twists like Much Ado About Nothing, or confusion reigning during a lover in love with love as in Twelfth Night, or a knee slapper like Midsummer's Night Dream. So, Branagh, ever the innovator and risk-taker, makes it into a gishy late 30s musical with all the trappings (make that 'tappings') from lead into song and dance routines to coordinated smiling shapely swimmers peeling off like a deck of cards into a swimming pool. Busby Berkeley would have loved it, as would those guys like Cole Porter, Irving Berlin and Vincent Youmans who wrote those songs back in the 30s. OK, so the ending sucks but how else can you wind up this comedy? It's not Branagh's fault this play is Much Ado About Nothing; blame it on the Bard. He wrote it.",
         "Something about Love's Labour's Lost is causing critics to sniff and huff and puff like never before. The dance numbers aren't perfectly in sync and the music isn't perfectly performed, they sneer. Shakespeare and Gershwin don't mix. It's sheer fluff. It's bizarre. Thus saith the critics. The forest that they're missing with their shrubs of discontentment is the overwhelming charm and infectuous fun of this silly little film. Yes, when Branagh and his cronies do a dance number it isn't lock-step choreography (one arm a little high, perhaps, one foot off the beat a bit). When Alicia Silverstone and her ladies-in-waiting cavort and giggle in a pool, they're not quite Esther Williams and company. Instead of picture-perfect Fred & Ginger, they look like real people dancing and singing because dancing and singing are fun. And unless you're Ebenezer Scrooge, The Grinch, or a movie critic, you'll have fun, too. That's not to say the movie is just sloppy silliness. Branagh stages some gorgeous set pieces, including gondolas lit by Japanese lanterns, a prop-plane goodbye straight out of Casablanca, and a production number in which the film's silliest character kicks the moon like a big silver soccer ball. It's about a third Shakespeare, a third 30's musical, and a third Looney Tunes. What's odd is that the styles mix so well under Branagh's direction. If you want a picture-perfect musical, rent \"The Unsinkable Molly Brown\" or some other dull thing. If you want perfect Shakespeare, rent Branagh's \"Hamlet.\" If, however, you want a movie to make you believe in movies again -- if you want to kick up your heels, laugh out loud, and float out of a movie theater humming Cole Porter -- see this movie.",
         "Beautiful words, delightful music, great acting! What could ruin such a mix. The answer, the ego of Kenneth Branagh. He is much too old for the part of a young student. His direction is absurdly literal. For example: probably the best use of the song \"Heaven, I'm in heaven...\" is sung by Angel Islington in Neil Gaiman's Neverwhere. Here the song is ruined by literally yanking the singers up on wires to a ceiling painted to resemble heaven. If a song mentions a hat, the director shows us a hat, and so on. The camera is always doing things that are distracting and annoying. The choreography is nothing but a string of literal quotes, from Busby Berkley to Fred Astaire to Gene Kelly to Bob Fosse. It never flows, just jerks from quote to quote. And while the older actors are superb, there does not seem to be an actor under 25 who can do Shakespeare...they all sound as if they are mouthing words that are not a part of their vocabulary. And the slapstick -- 'taint funny Magee. After all this, I still recommend watching the film. It is much kinder to the clowns than most productions of LLL. Branagh's great speech in praise of love is worth the price of admission. He acts sincerity so well it is almost enough to make us forget what he did to Emma Thompson. And the music is ... heaven.",
         "Love's Labour's Lost is a delightful song and dance compendium of classic song and dance blended with classic literature. The drama and acting are way over the top. But the broad stroke of the actors art is required as an important element of the Shakespearean craft. There is a delightful energy to the show and an alluring innocence as one might expect from a forties musical. It is classically campy with delightful bits of direction augmented by stunning costume and decoration. But mostly, it is just fun. Let the show flow without study or analysis and have some fun with the words, dance and songs. I would recommend this show for those who are inexperienced with Shakespeare work as an introduction to the art. It is also for those who do not take the works of Shakespeare as gospel not to be trifled.",
         "So it is, right at the first frame next to the title, \"a romantic musical comedy\" is the tagline -- up front with no misconception whatsoever for everyone to see. The entrance is grand in Patrick Doyle's scoring style, along with the credit treatment on red satin and all. What an invitation! 'Like it already. Shakespeare would approve and applaud. It's truly \"there's no business like show business like no business I know.\" Here Shakespeare and his comedy of errors, a-mixing and a-matching love signals at play again. This common \"love bug\" (literally so) theme is ever present: in \"A Midsummer Night's Dream\", in \"Much Ado About Nothing\", it's all love wires a-blindly and mistaken assumptions a-crisscrossing. 'Tis all seeds of \"Love's Labour's Lost.\" The outstanding ensemble cast, the charming pairings of the lovers, the song and dance numbers (including a sizzling \"Let's face the music and dance\"), the costumes and sets, Branagh's script and the \"Cinetone News\" segments, his impeccable direction, and Patrick Doyle, a vital collaborator who provided the attractive score -- collectively made this romantic musical comedy most entertaining. Branagh's passion in showing off Shakespeare in film media for all to enjoy is beyond evident. It all seem so facile, yet obviously there's plenty of love in nourishing this dream, lots of labour unrelenting from all involved in this production, and the lost would be Branagh's total steadfast lost in realizing this project -- love, labour, 'lost' shiningly shows. He's out done himself! If you like musicals, romantic comedies, light-hearted Shakespeare -- go for it. The only special effect here is Branagh's magic.",
         "Boy, Kenneth Branagh will try anything, won't he? Even infusing Shakespeare's comedy with a string of Gershwin-era songs and dances. But while his Much Ado About Nothing was a frothy, wonderful gem, Love's Labour's Lost . . . just didn't quite work. It's a noble try, though. Whether the concept itself is flawed is up for debate. (Surely some Shakespeare purists were up in arms when this came out!) What cannot be argued, however, is that Branagh's cast is unable to pull this off. They simply are trying to hard at what should come naturally, and the audience can't help but notice. His direction also sinks the film at various points, and as a result, the film jerks from scene to scene, from song to song, ultimately culminating in a collection of bits that never gel into a unified whole. That's not to say that the movie doesn't have its strengths. There is a sense of fun that pervades the film which is quite pleasant. The costumes and art direction are appropriately light and beautiful, and some of the comedy moments are quite fun. Each actor also has his or her strength. Alessandro Nivola (Laurel Canyon, Mansfield Park) is the best singer, Adrian Lester (Primary Colors) the best dancer, Branagh the best actor, and Matthew Lillard (Scooby-Doo) . . . sure is tall. The supporting cast (Nathan Lane, Alicia Silverstone, Emily Mortimer, et. al.) each do their best to rise above the film's shortcomings, as well. Ultimately, the audience ends up really trying to like this movie, but the flaws are too great to dismiss. 6/10 stars.",
         "All of you who are expecting this to be the greatest thing Branagh has ever created may just be in for a shock. I start with this simply because I don't want anyone going in with their expectations too high because that almost ALWAYS ruins a movie. My advice: Just go in with the anticipation that this will be a delightful experience and a real treat. Love's Labour's Lost is definitely the most refreshing movie that has been made in ages. It just soothes with charm and brings out the child in you. It has scenes that \"normal\" adults would almost be embarrassed to enjoy which forces out one's inner child to make you truly relax, be yourself and have fun. I refer mostly to the dancing and singing but also some tremendously hilarious scenes with the Spaniard Don Armando. Another highlight was Geraldine McEwan who played her small role as Holofernia perfectly! She was such a delight it was almost disappointing that she didn't have a bigger role. Everyone was perfectly cast from the Princess down to Dull the bobby (okay, I had my second thoughts about the Princess played by Alicia Silverstone, but I got over it and think she pulled the role of quite marvelously). As everyone knows by now it was shot in the style of the classic musicals of the '30s and '40s. Even the opening credits are done EXACTLY like a film from that time (with a silky background and headshots of all the actors with their roles, much like Wizard of Oz - it even goes through the ENTIRE credits in the beginning - something unheard of in today's society). It's Much Ado About Nothing meets Singin' in the Rain (Really!). The songs all fit in so well it almost looks like they were written for this film. When the first number started there was this big build-up (with the music) and then suddenly the four buddies stopped everything and switched into their dancing mode. It was so funny! I was impressed that they all could do the choreography (dance steps) so well! There were several moments where the music sort of built up to a musical number (or so it sounded) and then there didn't come one, so it was quite exciting trying to predict when they actually were going to perform something and when it was just a cleaver trick. ;o) I really could go on and on about this film because I truly loved it but I want to leave a few surprises in there for those who haven't yet seen it. One final word of caution: The story is a bit shallow and would definitely not have stood it's own ground had it not been for Branagh's cleaver twist (the dancing and singing, etc.) to liven things up. Don't get me wrong the four buddies wishing to devote themselves solely to their studies and taking a vow was cleaver enough, but the \"romance\" side of it was shallow and the ending was a bit abrupt (IMHO). If you like Shakespeare, musicals, romance, comedy and/or classic films this is definitely something for you. Take my word for it you will be thoroughly entertained!",
         "I love the film. It is so pleasant! I've never saw anything particular interesting in the play, and the film has surprised me. A modernizing of some story is not always a good idea, but it works excellently in this case. Setting the story against the war makes it more touching and convincing to us. And at the same time the movie is a light dynamic musical. Tunes, that were used, are unfamiliar to me, and I don't have the feel of nostalgia, described by some other reviewers here. Nevertheless, the music is good, I like singing and dancing in the film. Branagh does his best as Berowne, and so do others. I like the way they speak their text, so easy and natural. The movie is really enjoyable, it's entertaining and moving and funny. Kenneth Branagh has a rare talent for adapting Shakespeare, and I think his comedies are the best (Much Ado About Nothing is brilliant as well). I admire him both as the actor and the director. Wonder, what interesting thing he will produce next? Meanwhile, Love Labour's Lost is well worth seeing, and more then once.",
         "And it's a musical, with songs/tunes by Cole Porter, George Gershwin, Jerome Kern, Irving Berlin, with film score, once again, by Patrick Doyle, the wonderful original music composer for the 1993 \"Much Ado About Nothing\" (which was infectious, easy to comprehend, and sweeps you away by the sheer joyful production and performances led by director Kenneth Branagh, who adapted Shakespeare's poetry for all long before \"Shakespeare in Love\" became an instant popular success.) I don't often do this: buying a film's soundtrack before I see the film. The trailers, the Charlie Rose interview with Kenneth Branagh, Alicia Silverstone and Nathan Lane, simply propelled me to pick up a CD copy of the truly infectious music. The excitement of first seeing the poster outside the cinema -- WOW! a musical's coming! The fascination of first seeing the film being introduced among the trailers with intro words: \"Stanley Donen and Martin Scorsese present\" on screen -- that's already a definite influence on me. I have not seen Donen's name for quite a while, and his name certainly associates with quality musical and wonderful movie experience guaranteed; the same with Scorsese's name -- sounds like a MUST for sure. The music and dance presented in the trailer is exhilarating! The soundtrack is truly no disappointment: it's irresistible! It brings back memories of the wonderful MGM musicals and the grandness of it all. It's too marvelous for words! Branagh's effort of having the cast singing and dancing along with him reminds me of a similar effort of Woody Allen's 1997 \"Everyone Says I Love You\", when everyone in the cast danced, and sang (except one) -- here in Love's Labour's Lost, everyone sounded well in tune and professional. It's rare we get to have a musical these days, let alone a superb one. If you like musical, and a bonus if you appreciate Branagh and Doyle's collaborations, get the soundtrack of Love's Labour's Lost and immerse in the melodies and magic of it all. Bewitched you shall: \"'heaven. I'm in heaven\u0085\" you'll be singing along. Definitely go enjoy Branagh's \"Love's Labour's Lost\"!"
      ],
      "genres": [
         "Romance",
         "Comedy",
         "Musical"
      ],
      "productionCompanies": [
         "Pathé Pictures International",
         "Intermedia Films",
         "Arts Council of England"
      ],
      "summaries": [
         "The King of Navarre and his three companions swear a very public oath to study together and to renounce women for three years. Their honour is immediately put to the test by the arrival of the Princess of France and her three lovely companions. It's love at first sight for all concerned followed by the men's highly entertaining but hopeless efforts to disguise their feelings.",
         "An update of the classic Shakespeare story, director Kenneth Branagh shot this movie like a classic 30s musical. Love's Labour's Lost tells the story of four best friends who swear off love."
      ],
      "budget": 13000000
   },
   "movielensId": 3719,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-03-31",
      "dvdReleaseDate": "2000-12-19",
      "directors": ["Kenneth Branagh"],
      "runtime": 93,
      "movieId": 3719,
      "title": "Love's Labour's Lost",
      "mpaa": null,
      "actors": [
         "Alessandro Nivola",
         "Alicia Silverstone",
         "Natascha McElhone",
         "Kenneth Branagh",
         "Richard Briers",
         "Timothy Spall",
         "Carmen Ejogo",
         "Adrian Lester",
         "Matthew Lillard",
         "Geraldine McEwan",
         "Stefania Rocca",
         "Jimmy Yuill"
      ],
      "imdbMovieId": "0182295",
      "originalTitle": "Love's Labour's Lost",
      "genres": [
         "Comedy",
         "Music",
         "Romance"
      ],
      "youtubeTrailerIds": ["ba-RKUsqRRo"],
      "plotSummary": "An update of the classic Shakespeare story, director Kenneth Branagh shot this movie like a classic 30s musical. Love's Labour's Lost tells the story of four best friends who swear off love. The King of Navarre and his three companions swear a very public oath to study together and to renounce women for three years. Their honour is immediately put to the test by the arrival of the Princess of France and her three lovely companions. It's love at first sight for all concerned followed by the men's highly entertaining but hopeless efforts to disguise their feelings.",
      "tmdbMovieId": 51333,
      "avgRating": 2.99401,
      "releaseYear": "2000",
      "numRatings": 334,
      "posterPath": "/1VHCfHJ4PpGbmPQWJHF1YoBXRHG.jpg"
   }
}