{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0162711",
      "video": false,
      "title": "Trixie",
      "recommendations": [],
      "backdrop_path": "/3HcetfkmLFSQulnUyCwbRYrWrHy.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Trixie Zurbo",
               "gender": 0,
               "credit_id": "52fe448f9251416c91014f45",
               "name": "Emily Watson",
               "profile_path": "/jyIC8axLoCrbQoKGGjGFRU7hfNI.jpg",
               "id": 1639,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Senator Drummond Avery",
               "gender": 2,
               "credit_id": "52fe448f9251416c91014f49",
               "name": "Nick Nolte",
               "profile_path": "/o6O7WP3vokKstxJFMiiyRMNyPsH.jpg",
               "id": 1733,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Dex Lang",
               "gender": 2,
               "credit_id": "52fe448f9251416c91014f4d",
               "name": "Dermot Mulroney",
               "profile_path": "/uqDPswlyj7hUVrmTn5mbDiWiTQi.jpg",
               "id": 20212,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Kirk Stans",
               "gender": 2,
               "credit_id": "52fe448f9251416c91014f51",
               "name": "Nathan Lane",
               "profile_path": "/2eB01W4VURqihttVdewfhfhhCwW.jpg",
               "id": 78729,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Ruby Pearli",
               "gender": 1,
               "credit_id": "52fe448f9251416c91014f55",
               "name": "Brittany Murphy",
               "profile_path": "/jktbTmFE3TVaKUqPDWw8VZ5rXqc.jpg",
               "id": 328,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Dawn Sloane",
               "gender": 1,
               "credit_id": "52fe448f9251416c91014f59",
               "name": "Lesley Ann Warren",
               "profile_path": "/4I5VPyumsxYGKST9b0FL2harYRK.jpg",
               "id": 21818,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "W. 'Red' Rafferty",
               "gender": 2,
               "credit_id": "52fe448f9251416c91014f5d",
               "name": "Will Patton",
               "profile_path": "/qpycaaWP1oUx1Wd2lMBfQtR7qDO.jpg",
               "id": 883,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Jacob Slotnick",
               "gender": 2,
               "credit_id": "52fe448f9251416c91014f61",
               "name": "Stephen Lang",
               "profile_path": "/tqF6ibURpLvRPlgvLRvjCQqWaa2.jpg",
               "id": 32747,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe448f9251416c91014f67",
               "name": "Alan Rudolph",
               "profile_path": "/At4tWcBv2zElH82zrFFLkEdm4KA.jpg",
               "id": 72427,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe448f9251416c91014f6d",
               "name": "Alan Rudolph",
               "profile_path": "/At4tWcBv2zElH82zrFFLkEdm4KA.jpg",
               "id": 72427,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "564d21909251414dd1008971",
               "name": "J.J. Makaro",
               "profile_path": null,
               "id": 1007395,
               "department": "Crew",
               "job": "Stunt Coordinator"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 0.680327,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 31610,
      "vote_count": 2,
      "budget": 0,
      "overview": "Emily Watson stars as Trixie, an eccentric woman who aspires to quit her job as a security guard and become a private detective. However, comedy intervenes and the mess begins...",
      "similar": [],
      "original_title": "Trixie",
      "runtime": 116,
      "poster_path": "/j2zwDIRIh4AkLg5qkoriicKtedt.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/voYCwlBHJQANtjvm5MNIkCF1dDH.png",
         "name": "Sony Pictures Classics",
         "id": 58,
         "origin_country": "US"
      }],
      "release_date": "2000-06-28",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Alan Rudolph"],
      "runtime": 116,
      "synopsis": null,
      "writers": [
         "Alan Rudolph",
         "John Binder"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0162711/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg2MTk4OTQzNF5BMl5BanBnXkFtZTcwMDIwODIyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Emily Watson, Dermot Mulroney, Nick Nolte | See full cast and crew »"],
      "reviews": [
         "I had heard that the malapropism of Emily Watson's character would begin to wear after a while. Not for me, it was like watching a seriously deadpan Gracie Allen at work. The key to the film (which covers some of the same territory as \"Fargo\" and contains a few references to the movie) is the realization that it is not only Watson's character whose utterances are ridiculous, but those of the major characters, but Red's description of his relationship to the dead woman and Senator Avery's comments to the reporters show a similar dislocation with reality and sense. We start by realizing that her comments are off the wall, but they turn out to be nothing compared to the double-speak that we have become accustomed to coming out of the mouths of politicians and developers. The ending is a bit harum-scarum but overall a very enjoyable movie. The plot twists at the end weakened it, although they were very much in keeping with the noir genre.",
         "Emily Watson is a charmer: she's completely naive and innocent, but then again she's not so naive, and maybe not so innocent. She seems to understand nothing, but then she's the only one who understands it all. Watson's tour-de-force is in playing Trixie completely straight, malapropisms and all. Yeah, the twisted idioms get tired after a while, at least until a funnier one shows up. Definitely for art house movie lovers and not the megaplex.",
         "While the movie was flawed in some ways (never quite believed the connection between Trixie & Dex, for example), I found it engaging in many ways. Ms. Watson is certainly a versatile actress, and her Trixie is a marked departure from her other movie portrayals--especially her most recent in \"Angela's Ashes\". One can't help but admire a performer who takes such risks. I don't think I've sat with such wrapt attention to the next utterance of a character since Groucho did \"Day at the Races\"! Not only does Trixie raise malapropism to a new art form (\"We'll all go to Hell in a handbag\"; and as she grabs the bottle away from Leslie Ann Warren, she admonishes her with, \"I'm not going to let you drink yourself into Bolivia!\"), Ms. Watson rattles off these lines without a trace of affectation or laugh calculation, which makes them work so beautifully. The aforementioned Ms. Warren turns in her usual strong performance. Nick Nolte's surly senator was rather over the top, but it did make him a likely suspect which added more interest to the plot. And Nathan Lane, while probably overqualified for his role, is always worth seeing (his NBC sitcom notwithstanding). I'm not sure Mr. Abramsen and I saw the same movie, although it's clear only one of us saw the WHOLE movie! Sometimes I believe people walk out of plays or films just to brag to their friends that they've done it. This movie, I believe is worth an entire look; even a second one to recall all of Trixie's fractured English!",
         "There seem to be two major demographics that film audiences fall into. The commercially reliable, and the more risky arthouse, or as Trixie would say, \"but I see it the other way\". \"Trixie\" falls into the arthouse, with its star, Emily Watson, fitting in perfectly to its offbeat nature. Watson has proven in her career, from \"Breaking the Waves\" to \"Hilary and Jackie\" that she is one of the most underrated and capable actresses in modern film. Following a \"noir\" mystery tale of murder, and political corruption, \"Trixie\" takes the cliches of a thriller and combines them skillfully with the creative tongue of the English-slaughtering lead character. For people who enjoy daring, open-minded pictures, \"Trixie\" is a fun way to spend an evening. For people who enjoy loud, explosion-packed films, go see them.",
         "Ok - I have to admit....this movie was painful. Just painful to sit there and take all those mixed metaphors like punches to the head. BUT...I stumbled across this movie on a Sunday afternoon. Never heard of it..no expectations, etc. And actually had a good time watching it. My wife hated it (so she says) but we both laughed and kept rolling our eyes at each other throughout the movie. It was like reading a trashy novel...the characters were total stereotypes (the young, good looking womanizer (trying to have a heart of gold), the drunk, corrupt senator (always grabbing ass, etc) and of course the favorite - the bumbling, almost moronic detective making it all happen -kind of like a female Inspector Clouseau only with less physical humor and more verbal humor. Some of the words that came out of her mouth were really funny - like \"I woke up unconscious\" and my personal favorite, \"Do you think I have a ace up my hole?\" I wouldn't go out of your way to see this movie but if you come across it one afternoon....see how long you can stand it :)",
         "And, no, he would NOT have liked this movie. Most people obviously didn't. My sides ached. I know most people didn't \"get\" it. Look at the mess of categories it is in. You cannot pigeonhole this movie. It is an original. I do understand. I have seen Altman movies that I didn't think were funny, either. But this one hit a home run right up my alley. Not funny? Well, at least it's not a tired, old cliché. I had to get the tissues out because I was laughing so hard I was crying. See? We mix metaphors all the time. But these clichés have never been mixed so well. How did Nick Nolte, Lesley Ann Warren and Brittany Murphy and the rest of the cast keep straight faces? A whole movie FULL of straight men. The only one who knew he was funny was Nathan Lane ... and he was playing a comedian ... that most people didn't think was funny! How ironic is that? I just want to say to everyone involved in making this movie: Thank you! I laughed so hard I ruptured my catachresis.",
         "Brilliant mixed metaphors, fabulous dialogue. I can see how someone may not like it if they don't get or don't like word play, but if you like a good turn of phrase I highly recommend it! Huzzah for John Binder, whoever he is, not much on his resume, I can't wait for the next script!",
         "This movie has grown on me immensely. The first time I saw it, it struck me poorly. I didn't like the plot or characters. I've seen it twice since then. I was surprised to find how funny it was a second time. Truth be told, Trixie is the sweetest detective ever written. She's obsessed with the truth and lives by no other code, solving the case almost by accident. There is a sexy all star cast to back her up and they all play magnificently. The real joke of the movie is Trixie's ability to get well known sayings wrong, which is explained by her injury as a child from a bowling ball on the head (mentioned very quickly in a hospital scene). She says things like, \"Stop right there where you are in your tracks!\" Her timing is perfect and Ms. Watson's performance is endearing. Good show, all around.",
         "The Trixie character is very original and inviting. Her story is amazing and touching. The verbal battle between Trixie and the Senator is complex beauty. Every performance is great by the the well casted. I found Trixie to be a warm and very interesting movie.",
         "One needs a certain warped sense of humor to enjoy this film. Trixie (Emily Watson) is a self proclaimed `Private Defective' whose butchery of English is nothing short of cleavacle. Her command of idioms is not as bad as it is worse. She is Norm Crosby taken to the tenth powder. She mixes semaphores with a high-speed blender. Her malapropriations are so funny they border on historical. The writing of Trixie's dialogue by Alan Rudolph is extremely clever, but the story that surrounds it is very quirky, meandering off point constantly. I'm not a big fan of Rudolph's wry style of directing, but this film actually has its moments. Some of the things that pop out of Trixie's mouth are priceless. I found myself tolerating the boring story to hear what she would say next. Emily Watson's performance is excellent. She gives Trixie a naïve charm and gritty determination that is fun to watch. It is hard to fathom how she is able to say her lines with a straight face. Her Chicago accent is horrendous though. Nathan Lane also gives a tragically droll performance and Nick Nolte is absurdly humorous in his caricature of the corrupt state senator. This film was pounded by almost everyone, but I like this kind of word gymnastics, so I enjoyed it despite itself. I rated it a 6/10. If you can appreciate a punny character without much of a story, it might be worth a try."
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Mystery",
         "Romance"
      ],
      "productionCompanies": [
         "Pandora Cinema",
         "Sandcastle 5 Productions",
         "Sony Pictures Classics"
      ],
      "summaries": [
         "Emily Watson stars as Trixie, an eccentric woman who aspires to quit her job as a security guard and become a private detective. However, comedy intervenes and the mess begins...",
         "An eccentric, unconventional woman whose naive aspirations to rise from her job as a security guard to full-fledged private eye lead her into a tangled PL: mess."
      ],
      "budget": 0
   },
   "movielensId": 3721,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-06-28",
      "dvdReleaseDate": "2000-12-05",
      "directors": ["Alan Rudolph"],
      "runtime": 116,
      "movieId": 3721,
      "title": "Trixie",
      "mpaa": "R",
      "actors": [
         "Emily Watson",
         "Nick Nolte",
         "Dermot Mulroney",
         "Nathan Lane",
         "Brittany Murphy",
         "Lesley Ann Warren",
         "Will Patton",
         "Stephen Lang"
      ],
      "imdbMovieId": "0162711",
      "originalTitle": "Trixie",
      "genres": [
         "Action",
         "Comedy",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Emily Watson stars as Trixie, an eccentric woman who aspires to quit her job as a security guard and become a private detective. However, comedy intervenes and the mess begins...",
      "tmdbMovieId": 31610,
      "avgRating": 2.59322,
      "releaseYear": "2000",
      "numRatings": 118,
      "posterPath": "/j2zwDIRIh4AkLg5qkoriicKtedt.jpg"
   }
}