{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "pop",
            "id": 637
         },
         {
            "name": "jazz",
            "id": 1416
         },
         {
            "name": "tzar",
            "id": 3462
         },
         {
            "name": "music",
            "id": 6027
         },
         {
            "name": "mafia boss",
            "id": 6220
         },
         {
            "name": "folk music",
            "id": 6382
         },
         {
            "name": "music business",
            "id": 10572
         },
         {
            "name": "songwriter",
            "id": 33475
         },
         {
            "name": "stock footage",
            "id": 158744
         },
         {
            "name": "adult animation",
            "id": 161919
         },
         {
            "name": "music hall",
            "id": 173687
         },
         {
            "name": "jazz band",
            "id": 176095
         },
         {
            "name": "generational",
            "id": 176096
         },
         {
            "name": "jewish mafia",
            "id": 176098
         },
         {
            "name": "heroin addiction",
            "id": 176104
         }
      ],
      "imdb_id": "tt0082009",
      "video": false,
      "title": "American Pop",
      "recommendations": [
         27716,
         105800,
         30593,
         34449,
         279992,
         36616
      ],
      "backdrop_path": "/8X113tcqYBoW9pzAIELFEsGM0wi.jpg",
      "revenue": 6000000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Tony Belinksy / Pete Belinksy (voice)",
               "gender": 2,
               "credit_id": "52fe45d0c3a368484e07036f",
               "name": "Ron Thompson",
               "profile_path": null,
               "id": 161383,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Bella (voice)",
               "gender": 1,
               "credit_id": "52fe45d0c3a368484e070373",
               "name": "Lisa Jane Persky",
               "profile_path": "/9H3tSghbilxzikD3Ob59zt15Vp.jpg",
               "id": 9259,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Zalmie Belinksy (voice)",
               "gender": 2,
               "credit_id": "52fe45d0c3a368484e070377",
               "name": "Jeffrey Lippa",
               "profile_path": null,
               "id": 583796,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Crisco (voice)",
               "gender": 2,
               "credit_id": "52fe45d0c3a368484e07037b",
               "name": "Frank De Kova",
               "profile_path": "/4aXrw9N1VBv3XHSxFRcnhH1lW9T.jpg",
               "id": 50574,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Eva Tanguay (voice)",
               "gender": 1,
               "credit_id": "52fe45d0c3a368484e07037f",
               "name": "Roz Kelly",
               "profile_path": null,
               "id": 165381,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Frankie (as Marya Small)",
               "gender": 1,
               "credit_id": "58d1dc4fc3a36838df0126d3",
               "name": "Mews Small",
               "profile_path": null,
               "id": 133774,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Hannele (voice)",
               "gender": 1,
               "credit_id": "58d1dc74c3a3683908011d9f",
               "name": "Elsa Raven",
               "profile_path": "/4pxbeI6yZyAMmeikbM7DzPex4z4.jpg",
               "id": 172280,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Theatre Owner (voice)",
               "gender": 2,
               "credit_id": "58d1dc8fc3a36838f10122bd",
               "name": "Vincent Schiavelli",
               "profile_path": "/q2fEosVlli2T8k5db7c7xueNTtc.jpg",
               "id": 3418,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Beat Poet (voice)",
               "gender": 2,
               "credit_id": "58d1dc9c9251411ad8013528",
               "name": "Richard Moll",
               "profile_path": "/4MKwdfdu4JxmJ58Mz0Jg66LQFXc.jpg",
               "id": 13591,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "The Blonde (voice)",
               "gender": 1,
               "credit_id": "58d1dca7c3a36838df012732",
               "name": "Lynda Wiesmeier",
               "profile_path": "/6Gvuz4aZ1iuk0D4V2szPbE6LsA.jpg",
               "id": 100603,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Punk Rocker (voice)",
               "gender": 2,
               "credit_id": "58d1dcbec3a36838f10122f4",
               "name": "Lee Ving",
               "profile_path": "/tG4MKdOp1viff4rrCbH8WQEhIE3.jpg",
               "id": 80745,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45cfc3a368484e070365",
               "name": "Ralph Bakshi",
               "profile_path": "/lxFqcUY1bfYr2AXYiMhRxpmxBLt.jpg",
               "id": 16384,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45d0c3a368484e07036b",
               "name": "Ronni Kern",
               "profile_path": null,
               "id": 88923,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "55614b04c3a36868e5007a30",
               "name": "Barry E. Jackson",
               "profile_path": null,
               "id": 60250,
               "department": "Directing",
               "job": "Layout"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 3.28412,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 29204,
      "vote_count": 27,
      "budget": 0,
      "overview": "American Pop is an American animated film that tells the story of four generations of a Russian Jewish immigrant family of musicians whose careers parallel the history of American popular music.",
      "similar": [
         6477,
         786,
         525,
         6575,
         11827,
         3902,
         5723,
         12104,
         31900,
         10186,
         8873,
         13576,
         1791,
         20575,
         450794,
         28026,
         5817,
         7944,
         19366,
         221554
      ],
      "original_title": "American Pop",
      "runtime": 96,
      "poster_path": "/zEKCAiyDGqarS5PIMs3ivHVz27M.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "עִבְרִית",
            "iso_639_1": "he"
         },
         {
            "name": "Pусский",
            "iso_639_1": "ru"
         },
         {
            "name": "",
            "iso_639_1": "yi"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Bakshi Productions",
            "id": 4921,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Aspen Productions",
            "id": 4922,
            "origin_country": ""
         },
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         }
      ],
      "release_date": "1981-02-13",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "All those years, all those dreams, all those sons... one of them is going to be a star.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ralph Bakshi"],
      "runtime": 96,
      "synopsis": null,
      "writers": ["Ronni Kern"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0082009/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA2NzE1OTY3M15BMl5BanBnXkFtZTcwMjg0MzgxMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Mews Small, Ron Thompson, Jerry Holland | See full cast and crew »"],
      "reviews": [
         "I love the animation style used in this movie. The interlacing of real footage and photos from earlier times brings a level of realism not seen in many animated films. The characters move realistically as well; minute body language is portrayed well. Voice overs are great. Of course it's not \"Disney quality\", but it's got a grittiness to it that truly makes it original. Now I can see how one could criticize this movie. Basically, it all depends on how you watch it. If you watch it as a drama, you'll be disappointed. The plot is very centered around the one tragic late hippieish character, and is pretty simple and predictable. But there's a certain amount of charm within the overall story, kind of a sad, but beautiful shine. If you watch it more as a musical, the movie works fine. The songs chosen are fantastic, and they totally underline the feel of the scenes in which they are used. In one of the first scenes, taking place in Czar-era Russia, there is no dialogue, only subtitles (giving it a great historical feel). The soundtrack is a sad and stirring Russian song sung acappella. You really get a sense of what the characters were going through. This style continues throughout the movie. One of the most emotional scenes, for me, takes place in a cornfield, with the character torn apart with what he's done with his life. Janis Joplin's version of \"Summertime\" (an interesting choice, perhaps a hint of a throwback to earlier eras, as it is a Gershwin tune) as haunting as ever plays as the character cries. Messed up. But well done. Jimi Hendrix has a cameo. A pseudo-Joplin/Slick character has a major role. A Sex Pistols parody jams it out. Late 70s corporate goons are running the studio. Great fun. And that's how you have to enjoy the movie; and that's probably why music geeks will love it more than anyone else.",
         "I thought this film was one of the finest animation films I have ever seen. The film continually keeps building and building until it peaks at the end when the last guy becomes a star. It almost has the feel of a documentry on life in a America by the way it continually keeps pounding the nail on the head in terms of the storyline and the action scenes cut to music were absolutely brilliant. Considering this film was ahead of anything even close to this (even ahead of MTV for gods sake) it's far and away one of the finest animation films ever made. I think anyone grading this film before a eight just isn't looking at this film as a film and instead putting it against a Disney film or something that's pretty but has no point. For my money I'd easily stack this film against any other animation ever made. Also I saw some people nay saying this film because of the soundtrack, but it's all a natural progression man and in this film it shows the progression of life and music and in 1981 that's what was popular and I thought it was a great choice since it's still listen-to-able today. Extremely great film, if you haven't yet... Go see it now!",
         "This film was one that I was reluctant to see at first when it came out on video in the mid 90's. I eventually saw it and it interested me in many ways. The concept of a newly American family transcending through the century by ways of musical pop culture is an innovative idea. The main fault in the film resides on the fact that the filmmaker had somewhat misguided judgements on what exactly pop music and history was in the era that he was depicting. Apart from that I found the dialogue not condescending and the actor's voiceovers quite convincing. The verbal exchange between the character of Tony and the blonde was one of the most authentically written love scenes I have ever encountered in a movie. It was interesting to see the tortured characters succumb to weaknesses and eventually prevail at the end, however unrealistic it may have been represented. Some viewers of this film complain of the chopping rotoscoping used in it, but I found it refreshing seeing through the film to it's eventual endeavor by use of the actor's faces along with their voices. The grittiness of the film was more enjoyable to me. It showcased a lot of underrated talents of actors whose careers never took off such as Jeffrey Lippa and Lisa Jane Persky, among many others. It is often sad how talented represented actors get pushed aside the a world of notoriety. The most identifiable to me was Ron Thompson in the voice of Tony and Pete. I wish that I had seen him in so many other films. His verbal performance was enough to convince me that he was accomplished otherwise as an actor. I think that this film could have been a bit better if it were less presumptuous of the musical mainstream that carried the story through, but eventually it was entertaining. Though this film was not well known and a bit misguided I recommend viewing it at least once.",
         "If nothing else, Ralph Bakshi is an innovator. He has been ever since he did the first X-rated cartoon, FRITZ THE CAT. He's also been uneven in his work. He either does great things, like FRITZ, or he produces forgettable, total bombs like COOL WORLD. Just the same tho, I've very much enjoyed his stuff over the years. My personal favorites are HEY GOOD LOOKIN' and AMERICAN POP. AMERICAN POP is a daring concept; a feature length, multigenerational saga that tells the story of an immigrant family's American adventure. When it works (and that's MOST of the time), it works WELL. Bakshi did his historical homework on this one, as well as the musical homework required in telling the story of a family of entertainers. His characters achieve the goal that EVERY cartoonist tries for; on some level, we find ourselves identifying with those characters, and CARING about them... ALL of them, from the turn of the century song plugger on the streets of New York City, to the Heavy Metal rocker who finally achieves the American Dream. In some places tho, Bakshi's attempts at innovation have a rather bizzare effect, and sometimes just plain DON'T WORK with his audiences, even for those who LOVE his work. I'm thinking specifically of the somewhat startling attempt to use cartoon characters in a sexual situation. Somehow, the sight of a cartoon character opening his pants to expose jockey shorts prior to making love with ANOTHER cartoon character is jarring and unsettling in the extreme. It's not a matter of prudishness... it's just that the idea of realistically drawn cartoon characters having sex is a bit of a leap of imagination that many can't easily negotiate. Another place that it doesn't quite work is during the sequence during the Vietnam years. We've ALL seen the horrible news film clip of the police chief of Saigon personally executing a prisoner, shooting him in the head with his snub nosed revolver. Bakshi produced a very short cartoon version of that clip for the film. It's intention in the montage is clear and powerful, but somehow the idea of cartooning this horrendous act is even more deeply disturbing to the viewer than the ORIGINAL film was. It might have been MORE acceptable if Bakshi had used a Rotoscoped version of it that was LESS cartoonlike, as he did with other file footage used in the movie. Just the same... overall, Bakshi's bold experimental film WORKS, and works well. AMERICAN POP, despite it's faults, is a breakthru for the art of animation. It's a successfully mounted drama, done in animation. Disney came close sometimes, but Bakshi boldly went where Disney didn't dare to. For anyone who loves animation, and anyone who loves music... AMERICAN POP gets MY vote.",
         "Modern animated features pale in comparison. All we get today is the crum they produce over at Disney (excepting the few very cinematic scenes we get in Dinosaur) and a few decent Dreamworks films that hardly qualify as animation anymore. This film takes the animation format and explores what it can really do with character and theme. It takes American history and turns it into a chronicle of musical development that satisfies the music-lover as no other film does. Don't judge Bakshi by LOTR, see this one and Wizards and you'll have a new respect for animation. The only animated film even approaching this one since it was made is the Rats of Nihm, and it's a distant second. Even Nihm seems like Casablanca compared with modern crud like The Emporer's New Groove, or whatever hollow junk Disney is releasing next summer. See this film and remember (or learn for the first time) what truly good animation can be!",
         "I must admit that I never was a big fan of the works of Ralph Bakshi. While I do admire the efforts he made in order to show that the animated medium wasn't something exclusively for kids, the truth is that I found most of his movies to be pretty weak and dated (Specially, his movie version of \"The Lord of the Rings\", which I consider to be terrible) However, I found \"American Pop\" to be a pretty solid animated film, being at the same time the most ambitious and the most mature work from Ralph Bakshi. Not only the animation ís incredibly well done (With superb designs, beautiful sceneries, and an exquisite use of colors) but also the plot is way more complex than in the other movies directed by Ralph Bakshi, with a high level of realism and vivid moments of nostalgia and melancholy. The music and the voice acting from this film were excellent, giving it the perfect atmosphere for each era where the different parts of the story of this film took place. The result is something impressive, fascinating and unique. This is possibly one of the most ambitious and daring animated films ever made, and even when this film isn't entirely perfect, the overall result is still impressive, even by the moderns standards of animation. \"American Pop\" is the strongest film directed by Ralph Bakshi, being the one that stand the test of time. I highly recommend this movie to anyone.",
         "What a genuinely interesting and touching film. The rotoscoped animation may not be everyone's cup of tea but it works just fine here. I honestly think it's use was a big plus as it gives this human story a human, life like quality. If this was done today it would be slopping over with re-do tunes by current pop nobodies to jam onto a \"music from and inspired by\" CD not to mention it would be poorly cast with Hollywood no talents. The casting here doesn't leave you straining to identify celebs, it just has good actors portraying good characters. You focus on the story of the family, which after all is the point. Underrated and very much worth your time.",
         "American Pop is very well one of the finest animated features I have ever seen. The story surrounds four generations of father and sons, the events in their lives painted across the backdrop of the evolution of music. The movie begins with a young boy and his mother fleeing the chaos in turn-of-the-century Russia, where they migrate to the states. The young boy sets things off with the clamor of jazz bands in a burlesque parlor, and the movie ends in the late 70s, with a drug dealing man desperate for a start in the music business. So, the story traces some sixty years of music, offering a highly extensive soundtrack and featuring all sorts of musical genres as a way of teaching histories and cultures. The first thing that truly caught my attention with this movie was not the story (because the story itself is pretty unusual when you're not used to this style to begin with), but the incredible animation. Long before computer graphics and surpassing any animation styles of earlier Bakshi films, the characters of American Pop are so life-like even down to the smallest details of hair texture or breathing. I was just aghast to watch it purely for the artistic effort of the film, as it simply one of Bakshi's best (rid yourself of those preconceived notions based on earlier Bakshi films you may've seen like 'Heavy Traffic'), and certainly one of the best animated films I'd ever seen. There are many Bakshi trademarks going on here. Some of the animated scenes get pretty wild and often mix life action backgrounds with animated foreground characters, especially during the hallucination scenes that take place during the mock Jefferson Airplane scenes. It's quiet a scene, man. American Pop is definitely a rich education in music as it touches on everything from radio jazz, swing, classical, rock n' roll, psychadellia, and hell, even punk. In fact, the general elements of American Pop are often more interesting than the characters and situations. I highly recommend watching it.",
         "I haven't seen this movie since it came out nearly two decades ago and yet I remember it like it was yesterday. Perhaps being a member of the clan that the movie depicts gives it special meaning for me. The strand connecting the chants of the ghetto synagogue, through early jazz, sixties ballads and finally hard rock rang true to this unsophisticated viewer. Perhaps the characters where often cliches and the symbolism hackneyed- but so what. This is the shorthand of our culture and these iconic elements were used with wit, charm and taste. Animation in this film is truly an artistic medium. The memory of the final scene, where generations of suffering are vindicated in the roar of acclaim for the rock singer descendent, still brings a chill to my spine.",
         "I saw American Pop in a suburban Chicago theater when it was first released. I was impressed with the film and have always enjoyed it as a musical rather than a drama. At the time the surround sound was striking as was the alternate form of animation(rotoscope)and use of color. Being able to see American Pop in 35mm on a large screen was an experience, as I believe many of the film's critics have only seen inferior video versions. With musical selections dating from the 1920s through 1980 this film is a fantastic visualization of the spirit and essence of American music. The dance sequences from the Big Band era are especially effective. I have shown it in my high school music appreciation class a few times with very negative reactions from the students. I dig American Pop, however, and I know others of my generation will enjoy it. Ralph Bakshi, a true artist."
      ],
      "genres": [
         "Animation",
         "Drama",
         "Music"
      ],
      "productionCompanies": [
         "Bakshi Productions",
         "Aspen Productions (I)",
         "Columbia Pictures Corporation"
      ],
      "summaries": [
         "\"American Pop\" is the animated story of a very talented and troubled family starting with 19th century Russia and moving through several generations of musicians. The film covers American popular music from the pre-jazz age through rhythm and blues, 1950s rock 'n' roll, drug-laden psychedelia, and punk rock, finally ending with the onset of New Wave in the early 1980s.",
         "The story of four generations of a Russian Jewish immigrant family of musicians whose careers parallel the history of American popular music in the 20th century."
      ],
      "budget": 0
   },
   "movielensId": 3725,
   "movielens": {
      "languages": [
         "English",
         "עִבְרִית",
         "Pусский",
         ""
      ],
      "releaseDate": "1981-02-13",
      "dvdReleaseDate": "1998-06-17",
      "directors": ["Ralph Bakshi"],
      "runtime": 96,
      "movieId": 3725,
      "title": "American Pop",
      "mpaa": "R",
      "actors": [
         "Ron Thompson",
         "Lisa Jane Persky",
         "Jeffrey Lippa",
         "Frank De Kova",
         "Roz Kelly",
         "Mews Small",
         "Elsa Raven",
         "Vincent Schiavelli",
         "Richard Moll",
         "Lynda Wiesmeier",
         "Lee Ving"
      ],
      "imdbMovieId": "0082009",
      "originalTitle": "American Pop",
      "genres": [
         "Animation",
         "Music"
      ],
      "youtubeTrailerIds": [
         "2U7sY6fgrXs",
         "VBwz9Pijr1E"
      ],
      "plotSummary": "American Pop is an American animated film that tells the story of four generations of a Russian Jewish immigrant family of musicians whose careers parallel the history of American popular music.",
      "tmdbMovieId": 29204,
      "avgRating": 3.10646,
      "releaseYear": "1981",
      "numRatings": 418,
      "posterPath": "/zEKCAiyDGqarS5PIMs3ivHVz27M.jpg"
   }
}