{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "california",
            "id": 387
         },
         {
            "name": "prostitute",
            "id": 549
         },
         {
            "name": "alcohol",
            "id": 567
         },
         {
            "name": "vietnam",
            "id": 2956
         },
         {
            "name": "witness",
            "id": 3581
         },
         {
            "name": "party",
            "id": 8508
         },
         {
            "name": "revenge",
            "id": 9748
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "conspiracy",
            "id": 10410
         },
         {
            "name": "arson",
            "id": 11363
         },
         {
            "name": "crime",
            "id": 14536
         },
         {
            "name": "veteran",
            "id": 159909
         },
         {
            "name": "expose",
            "id": 162340
         },
         {
            "name": "neo-noir",
            "id": 207268
         }
      ],
      "imdb_id": "tt0082220",
      "video": false,
      "title": "Cutter's Way",
      "recommendations": [
         48155,
         32558,
         36786,
         36141,
         90949,
         42176,
         46460,
         24003,
         34053,
         64624,
         32044,
         17365,
         21335,
         42597,
         39342,
         46498,
         29882,
         60938,
         43232,
         88075
      ],
      "backdrop_path": "/oWtUK3xqaUEXbduVu0Q6CkVIWZp.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Richard Bone",
               "gender": 2,
               "credit_id": "52fe448c9251416c91014977",
               "name": "Jeff Bridges",
               "profile_path": "/xms1RAY6q7Lzp7wNeRCB0kzhucn.jpg",
               "id": 1229,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Alex Cutter",
               "gender": 2,
               "credit_id": "52fe448c9251416c9101497b",
               "name": "John Heard",
               "profile_path": "/rz9E9VyZXeyspfCshXFKHIy5rP0.jpg",
               "id": 11512,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Maureen Cutter, 'Mo'",
               "gender": 1,
               "credit_id": "52fe448c9251416c9101497f",
               "name": "Lisa Eichhorn",
               "profile_path": "/1yvBmX8G8AX6pVIJvvzhfnqtwcm.jpg",
               "id": 28950,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Valerie Duran",
               "gender": 1,
               "credit_id": "52fe448c9251416c91014983",
               "name": "Ann Dusenberry",
               "profile_path": "/koNcdFcYoIpVT8zXlX1oHamlywF.jpg",
               "id": 16197,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "J. J. Cord",
               "gender": 2,
               "credit_id": "52fe448c9251416c91014987",
               "name": "Stephen Elliott",
               "profile_path": "/uOZD5RzLjLtDSotOqKB3FPeznBx.jpg",
               "id": 786,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "George Swanson",
               "gender": 2,
               "credit_id": "52fe448c9251416c910149b5",
               "name": "Arthur Rosenberg",
               "profile_path": null,
               "id": 129220,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Woman in the Hotel",
               "gender": 1,
               "credit_id": "52fe448c9251416c910149b9",
               "name": "Nina van Pallandt",
               "profile_path": "/j0fCWlNvY6z9HBApgRkeZBohCEV.jpg",
               "id": 41732,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Mrs. Cord",
               "gender": 0,
               "credit_id": "52fe448c9251416c910149bd",
               "name": "Patricia Donahue",
               "profile_path": "/wDPO8DyBN6eoVAUcwNZDC6Fk5v3.jpg",
               "id": 129221,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Susie Swanson",
               "gender": 0,
               "credit_id": "52fe448c9251416c910149c1",
               "name": "Geraldine Baron",
               "profile_path": null,
               "id": 129222,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Toyota Woman",
               "gender": 0,
               "credit_id": "52fe448c9251416c910149c5",
               "name": "Katherine Pass",
               "profile_path": null,
               "id": 129223,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Toyota Man",
               "gender": 2,
               "credit_id": "52fe448c9251416c910149c9",
               "name": "Francis X. McCarthy",
               "profile_path": "/kJe5FQXtccOzAzhO9RZaPKhWht2.jpg",
               "id": 100650,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Toyota Cop",
               "gender": 0,
               "credit_id": "52fe448c9251416c910149cd",
               "name": "George Planco",
               "profile_path": null,
               "id": 129224,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe448c9251416c9101498d",
               "name": "Ivan Passer",
               "profile_path": "/tcLsYMdE0asiEy738nWoLuEizG2.jpg",
               "id": 84736,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe448c9251416c91014993",
               "name": "Jeffrey Alan Fiskin",
               "profile_path": null,
               "id": 126390,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe448c9251416c91014999",
               "name": "Newton Thornburg",
               "profile_path": null,
               "id": 126391,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe448c9251416c9101499f",
               "name": "Paul R. Gurian",
               "profile_path": null,
               "id": 62017,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe448c9251416c910149a5",
               "name": "Jack Nitzsche",
               "profile_path": null,
               "id": 7066,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe448c9251416c910149ab",
               "name": "Jordan Cronenweth",
               "profile_path": null,
               "id": 594,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe448c9251416c910149b1",
               "name": "Caroline Biggerstaff",
               "profile_path": null,
               "id": 62825,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 2.513982,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 31593,
      "vote_count": 37,
      "budget": 3000000,
      "overview": "Richard spots a man dumping a body, and decides to expose the man he thinks is the culprit with his friend Alex Cutter.",
      "similar": [
         4771,
         3134,
         26390,
         101,
         339692,
         281957,
         281,
         979,
         261023,
         445954,
         26789,
         1266,
         9507,
         11033,
         10651,
         8012,
         9654,
         59967,
         8456,
         238636
      ],
      "original_title": "Cutter's Way",
      "runtime": 105,
      "poster_path": "/nNtW7xwpP3fwGWqgBYCm564S7zq.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "United Artists",
            "id": 60,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Gurian Entertainment",
            "id": 14574,
            "origin_country": ""
         }
      ],
      "release_date": "1981-03-19",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "Cutter does everything his way. Fighting. Loving. Working. Tracking down a killer.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Ivan Passer"],
      "runtime": 109,
      "synopsis": "Cutter's way is hard to put in a category. It's a delicate blend of thriller, comedy, drama, conspiracy, buddy movie (I hate that term, too), incredibly moving acting, incredible noir-ish (not noir) cinematography and one of the most haunting scores in cinema. Richard Bone (Jeff Bridges) is the aimless playboy yin to Alex Cutter's hardcore Vietnam veteran yang and Moe (Lisa Eichorn) is Alex's cynical wife. All three drink and exist in a modest house in a Santa Barbara neighborhood in the 70's. Until one rainy night in an alley, where Bone steers his foreign convertible when the engine dies, and half-sees a man depositing a woman's body in a trash can. Alex takes Bone and Moe to a parade hours after Bone is grilled by detectives. \"That's him,\" a weary Bone tells Cutter, when oil magnate JJ Cord rides by on a white horse.... ...and this is where it takes off. Cutter enlists the victim's sister and goes on a single-minded plan to extract vengeance. How this is accomplished is the wildest and poignant tale you're ever going to see and the atmosphere is Lynchian, but pre-Lynchian. The plot is not conventionally excuted and this a treat for the willing. Again, a career best for John Heard as the intense Cutter, Jeff Bridges is simply incredible, and the gifted Lisa Eichorn evokes the gamut of raw emotions. Not a noir film, but a cult film in every sense of the word. Well worth renting or owning. Perhaps director Ivan Passer's finest.",
      "writers": [
         "Newton Thornburg",
         "Jeffrey Alan Fiskin"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0082220/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc1NDE5OTE1MV5BMl5BanBnXkFtZTcwMzQwMTYyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jeff Bridges, John Heard, Lisa Eichhorn | See full cast and crew »"],
      "reviews": [
         "I stumbled upon this movie at the Nickelodeon on Cape Cod the year of its release...at a time when VCR's and DVD's weren't a part of our culture...when you had to travel to obscure and far-out theaters to see obscure and far-out films during the fading window of opportunity offered as its limited run at the movie house. What a gem. I was instantly riveted by the story and the classic performances that brought it to life. The pathetic human condition personified in Cutter, Bone, and Mo is so exquisitely rendered as to be tragic...only salvaged by the clear-eyed wit and insight of John Heard's Cutter and the tempered and logical cynicism and indifference offered up by Bone(Jeff Bridges)as the balance that only these begrudging friends could provide each other. Lisa Eichorn's character(Mo) exhibits equal measures of the qualities both her male couterparts have and her subtle performance points up the conflict she feels in simultaneously rejecting and craving their opposing energies. The scene where she chews them both out for their selfish and naive plot and their spirited responses seems to spill from their beings as genuine emotion...not written dialogue...and it still sends chills through me...very powerful...and the scene where she is made painfully aware of Bone's incurable drive to bed women as she falls prey to his momentary sympathies ..when coupled with her husband's(Cutter) inability to give a soft refuge to her is so tragically realistic...tears flow. Everyone's shortcoming's cross-up everyone else's and as the surrealistic climax develops its symbolism and power are Shakespearian. This movie works as a crime thriller, a portrait of the underbelly of American culture most evidenced in its loss of confidence and embrace of cynicism that came to the surface post-Vietnam...but most successfully as a great character-driven love story and tragedy.",
         "`Cutter's Way' Ups the Bar on Mysteries- Harrowing, Moving It is one of the more bitter ironies in the \"business\" of movies that a motion picture this good can remain such a secret; all but buried under the gloss and glitz of the 80's and 90's hyper-insensitive cinema. Since it was released in the beginning of the Reagan era, circa 1981, the only film to equal it in its mystery genre is \"The Usual Suspects\", but even that film, with all of its intricacies of plot; fiendishly delightful manipulations; twists; turns; and eccentricities of character, remains a \"conventional\" who-done-it, when compared to the import, and mystery, of \"Cutter's Way\". Told within the context of dazed and confused post Vietnam era America, it features a breathtaking performance from the brilliant, and never since better, John Heard as Alex Cutter. A hard drinking Veteran who was crippled by a land mine during the war while walking point, (`Only place to be!'), Alex is the biting conscience of an era trying to numb itself with booze and sex to it's recent past. While his cynical ravings about America and Americans appear to be the drunken ravings of a lunatic when he pronounces them, his alcoholic fugue really just dulls the jagged edge of the brutal truths he speaks enough so they fall just short of a lethal weapon. `Playing' at being a cripple, Alex remains insulated from the threat of getting his head pounded in, and he takes full advantage of his disability, managing to at least appear to hold the higher moral ground during even his more assaultive tirades. He remains clear, truthful, and precise while denouncing the sinister intrigues he observes swirling about him in the mundane world he inhabits, (`The routine grind drives me to drink. Tragedy I take straight'), so when his best friend Richard Bone, played by Jeff Bridges, inadvertently stumbles onto a real life crime of the most lurid kind, one that `may' link the most powerful elder in the community of Santa Barbara to the sex attack and murder of a teenaged girl, Alex takes to his trail like a dog to a bone. This is not the kind of Vietnam Vet it is fashionable to play anymore, nor is it considered politically correct to even acknowledge once existed as our primary mythological figure that had returned from the jungles of that strange war. But, this film was released at the beginning of the Regan era folks, before the more cynical memories of the Vietnam era were more or less painted over by that `new feeling in the land' that was gaining momentum back then. But, there is still Alex Cutter, a biting testament to the time, in one of the best performances from an actor you will ever committed to film. Mr. Heard displays the astonishing breadth of character very much evident in the range of work offered by the Jack Nicholson, or the great Gary Oldman, (who has played everything from Dracula to Lee Harvey Oswald), and he fuels Alex's emotional life with the range of King Lear. This guy rocks! He simply chews through the scenery, yet, while going way over the top in his focused and insightful ravings, he always manages to remain within the realm of believability. And, while Jeff Bridges gives us still another chance to see first hand why he is considered one of the great American actors of his generation, it is the beautiful actress Lisa Eichhorn as the doomed, suffering wife of Alex, who is a true revelation here. Her unforgettable portrait of Mo, (Maureen), alcoholic, lonesome, and lost, gives us the quintessential bruised angel for the era. A tragic figure, Mo is the `hippie chick' that met a one-night stand at a sixties party, and got her skirt caught in the door when she tried to get out. She is loyal to Alex, because she truly loves him, but we always know that somewhere down the line she took a wrong turn, and this is not the street she should be living on. Ms. Eichhorns heartbreaking performance has haunted me since 1981 when I first saw this film at the Cannery Cinema in San Francisco, and I have been in love with Mo since that day. If there is anything about the web that I can say `I love', it's that I can encourage other folks out there to finally give this film and this wonderful actress the attention she and it so richly deserve. I still mist over slightly when I think of Mo quietly weeping as Jeff Bridges holds her in his arms and whispers tender secrets, and soft encouragements to her during their love scene. It's one of the most heartrending, moving, and beautiful moments I've ever seen on film. Ms. Eichhorn shows us vividly how much it \"means\" for Mo to be held and to be loved, and how desperate her need for kindness is. I ache for that character and her predicament even today when I think about her. This is when acting is a true art form. I haven't seen this film in a long, long time, but this moment is as clear to me now as if I had seen it yesterday. Ms. Eichhorn paints such a moving and humane portrait of Mo's lost yet loving soul in the precious moments when she is on the screen, that it is very clear she would have become a major international film star, as she was once expected to be, had only things happened a little differently for her. And, while it's true that I gave up taking the Oscar race real seriously a long time ago, having decided when John Wayne beat Dustin Hoffman for Best Actor that there was no justice in it, I watch them just to savor the moments when they do get it right, and it is still amazing to me that none of the principles involved in the creation of this great film, neither it's writer; director; composer; nor any of it's magnificent stars, were recognized in any way by the Academy of Motion Picture Arts and Sciences for their work. Not one nomination went to `Cutter's Way' for anything. This film disappeared from theaters almost as soon as it arrived. Oh, to further peak your interest, I should tell you that there is a dark secret of epic proportions brewing beneath the surface of this story, one that is never openly discussed nor revealed, not even at the end of the film. Yet, we're always strangely aware of something within the narrative teasing us along, well hidden within the action; illuminated only in the subtext of dialogue; and story; keeping us deceptively riveted on the murder mystery, while imperceptively tugging on the coattails of our subconscious, drawing us further down a rabbit hole to peek behind the mask of a killer in that marvelous way only a master director, (Ivan Passer), can. Oh, you have a good old-fashioned who-done-it here too folks, and I can pretty well promise you fans of that genre that they won't be disappointed even if that's all your looking for. It's just that, well, like `Blow Up' and more recently `Eyes Wide Shut', \"Cutter's Way\" is, at its core so much more than just a `murder mystery'. Critics naive enough to have dismissed this \"storytelling\" as too \"simple\" have missed the secret of this film by a wide five miles, as well as cheated themselves out of the sheer fun of watching it and trying to figure it out. Hey Guys, you seriously need to give this one another chance. `Cutters Way' is a classic, one of a kind murder mystery. (Indeed, it was recently released on DVD as part of the MGM `Classics Series'.) I doubt anyone who sees it will ever forget it. It's darker secret will more than likely elude you as it has so many others on the first viewing, but not to worry. Like all the great films that remind us why we go to movies in the first place, you'll be drawn to watching `Cutters Way' again. Be forewarned though, this film keeps a secret even after the shattering, final blast echoes into the darkness of its last frame; one that will resonate with you for many years to come.",
         "Here is a film that sneaks up on you. It starts out by introducing you two three off-kilter characters--Jeff Bridges as the drifting playboy Bone; John Heard as the crippled Cutter, a man of uncompromising rage and a razor-sharp tongue; and Lisa Eichorn as the Cutter's terminally depressed wife Mo. Within the first half-hour of meeting these pathetic folk, the narrative drops in a murder mystery: a girl's body is found in a garbage can and Bone is the chief suspect. When Bone has a momentary revelation and thinks that he saw local millionaire JJ Cord disposing of the body, Cutter becomes obsessed with proving Cord's guilt. They have no evidence, you see, but as Cutter is a Vietnam vet scarred from the war and Cord represents all the \"fat cats\" that sent young men to 'Nam to die, Cutter thinks a little payback is in order (\"He's not just anybody,\" Cutter growls. \"He's responsible!\"). After this bizarre set-up, the film takes an unusual turn. It stops being about the mystery and more about Cutter's efforts to push Bone into taking some kind of action--any action--to give his life value. In fact, the question of Cord's guilt is left hanging, and we are treated instead to a powerful climax that leaves us breathless as the screen goes black. Clearly one of my favorite films, the performance of John Heard alone is worth the price of admission. The mutilated Cutter is missing a leg, an arm and an eye, and he hobbles about swearing and growling like a drunken pirate. Some critics find Cutter offensive; I totally identified with his anger, although I felt that he took it too far at times. Nevertheless, Heard has given us one of the screen's truly memorable characters. You won't forget this film soon.",
         "Cutter's Way cannot be overpraised. This movie is a masterpiece of the first order. Ivan Passer, a compatriot of Milos Forman, came to the USA as an experienced Czech movie director. Not unlike Alfred Hitchcock or some German directors 30 years before him, he seems to have made a thorough analysis of the American social conditions and general manners. He then transformed his findings into movies. Two of them I know deal with New York. They are appropriately gritty. The setting of Cutter's way is a Californian beach community for the rich and beautiful \u0096 and the movie is appropriately glossy. The whole story takes place in those paradisiac locales. They are presented like an enchanted kingdom, a country of its own. Under the glossy surface, there is a darker side to the place. There is prostitution, drug abuse and murder. Cutter, living on the fringes of the enchanted kingdom, sees that more clearly than everyone else. He has his own code of chivalry by which he wants to live. He develops conspirational theories and strains to convert them into hard facts. The world around him, populated by indifferent, amoral rich and beautiful people, does not understand him, does not even want to listen, laughs at him. So Cutter mounts a white stallion and rides a charge. Repeatedly the film slips into surrealistic situations, in which the impression made on the viewers is more relevant than the storyline. This technique was well known in the forties (e.g. in film noir), present day audience are less used to it. In the earlier days of film making, surrealism was created on a soundstage, and the change between reality and \"dream\" became immediately clear. Passer uses real locations for situations removed from reality \u0096 a daring experiment that rewards the viewers with hauntingly beautiful pictures but might also confuse many. The director took this risk and we are rewarded with a magnificent picture about a distinguished slice of America. I predict: Cutter\u0091s way will one day become an honored classic.",
         "A friend of mine gave me the novel Cutter and Bone (AKA Cutter's Way) was based on, so that immediately creates a problem, comparing two different art forms. Forget the novel (by the obscure Newton Thornburg) for this purpose only. The movie is a moving meditation on power, desperation, and paranoia. It is also a great love story. I always end up writing \"...you've read the other comments so you know what this is about\" but Cutter and Bone is so many things, it cannot be pinned down easily. As noted in the favorable reviews here, this is chock full of great film acting that moves the story along as well as making come alive. Who was the clueless shmoe who said \"nothing happens\"? What movie was he watching? Adrift in post-Vietnam America, Cutter finally finds something in life that has meaning; the murder of a young hitchhiker. But any meaning is too much for the damaged Cutter who becomes relentless in the pursuit of a possible killer who also is of the wealthy, powerful elite that sent OPS (other people's sons) to Vietnam. Cutter finally has a genuine target (\"he's not anyone Rich, he's RESPONSIBLE\" says Cutter to Richard Bone in a great line delivery by John Heard) for his unfocused righteous anger. Bone tries to sabotage the investigation but ends up buying in at the very end. Why? He has the rage also, as did many Americans who weren't politically active, did not serve in Vietnam. It's a rage that infected a nation with guilt, self-doubt, and eventually, a new hubris, a kind of \"never again\" attitude toward \"less developed\" nations that has us yet again on the brink of yet another war in a series of wars that seem to never end and we hardly even notice anymore (remember Grenada? Bombing Tripoli and Benghazi? proxy armies in Nicaragua and El Salvador, etc.?) The other part of Cutter and Bone is a love triangle and a very well explicated one at that. Cutter and Bone both love Mo who can't love herself. Bone is not as shallow as he appears and it scares him. Cutter is too damaged and angry to love her enough until she is gone. I've known these people in one way or another, and that is why this movie has always meant so much to me. It is also about a great country I used to live in that began to disappear about the time this movie is set, and has since metamorphosed into a large wounded, angry monster, bereft of the tears for near-paradise lost that this excellent movie depicts.",
         "Ostensibly this film appears to be a buddy movie from the 1980s, but it is actually something much more interesting. Employing standard Hollywood clinches with its thriller/ investigation narrative and many of of its \"stock\" characters and situations, the little guys - Heard and Bridges - take on Mr Fat Cat Capitalist who rules the peacetime world like an untouchable and corrupt monarch. The film, though well-executed and enjoyable, at first seems no more than a well-scripted, well-acted (Heard is particularly good as the embittered, crippled Vietnam Veteran) genre piece. However, what emerges by the end is something far more exciting and radical - an indictment of US politics and power relations, and a genuinely bleak reflection on the impossibility and rarity of real justice both at the micro and macro levels. Vietnam and its true significance is used to great effect in the film, as is the interplay between the two buddies. Whilst Bridges won't accept that he has witnessed the ultimate, bleak truth of US power relations until the film's abrupt, punchy end, Heard knows the truth intuitively and automatically because he understands and hates the world from the the start. He has given up on notions such as forgiveness and even the need for legal process, and seeks only revenge on the rich and the powerful. He understands, correctly, that is the only way a kind of momentary justice is possible, since everything else is either controlled by the elites or made to protect them. Without wishing to spoil the film's brilliant final moments, it is here that the whodunnit story is stripped away and the guilt they have been seeking to prove, as Richard Bone realises, becomes entirely political or metaphysical, and the the crime itself becomes irrelevant.",
         "This is an excellent movie and one of the most consistently underrated. John Heard has never been better, and he is (alongside the late J.T. Walsh) amongst the most under-appreciated actors ever (one of the few mistakes in 'The Sopranos' was to let him go). However, Jeff Bridges yet again proves his credentials by turning in a beautifully nuanced performance as an unattractive, self-absorbed failed playboy in counterpoint to Heard's righteous crippled Vietnam veteran. This is a companion piece to 'Chinatown' in its study of corrupt power structures, but is more intimate and believable (and 'Chinatown' is superb). We still wait for its recent equal in the noir stakes.",
         "How many movies can you name where a very grizzly Ahabian figure, peg leg eye patch and all, prowls the seemy backalleys and streets of Los Angeles trying to pin a gruesome murder to a powerful oil baron? The movie starts with very direct Moby-Dick references, Cutter, the one-legged veteran back from Vietnam with scars to last him a lifetime, refers to Bone as Ishmael and the small bar they meet is called The Encantado, before it segues into a pattern of various 70's crime/noirish diversions to very basic human questions, life and death, pain and loss. Cutter is convinced the oil baron is the man they're looking for, the wealthy upper-class who is above justice and above reproach, yet the movie proves mercifully ambiguous, wonderfully 70's in that aspect. Cutter and Bone never know for sure and neither do we, but at some point it stops to really matter. The movie is not really a whodunit not because we never discover who done it but because we don't care, the movie doesn't care, because at some point Cutter and Bone, lower-class thirtysomethings with broken lives, nowhere to go, and their friendship permanently shattered by something that involved Bone and Cutter's wife, barge into JJ Cord's mansion uninvited, and somehow, in a strange quiet almost surreal way, one-legged Cutter is suddenly riding a white horse through the gardens in a frenzy, stomping party guests and upturning tables in his furious path, like he's back in the Vietnam jungle and running not away from something like enemy soldiers will run from enemy fire but towards it in a final mad dash, and out of the bushes and trees of JJ Cord's mansion emerges Cutter's Way, the movie now pure sublime and primeval, going out in a final upflare of stubborn and dying revenge. Cutter confronts JJ Cord and when he puts on his mirror shades, we understand that we're looking at the personification of Uncle Sam, so that he may not be guilty for that one girl's murder but he's guilty for something, and more, that Cutter is there to strike not at the mysterious old man, but through him, to strike \"...all that most maddens and torments; all that stirs up the lees of things; all truth with malice in it; all that cracks the sinews and cakes the brain; all the subtle demonisms of life and thought; all evil, to crazy Ahab, were visibly personified, and made practically assailable in Moby-Dick [...] and be the white whale agent, or be the white whale principal, I will wreak that hate upon him\". Perfect. Even Apocalypse Now didn't transfigure the enigma that lies in the heart of its literary source in a way quite as faithful simple and effective. The powerful thematic content and the subtle-but-not-so-subtle way Ivan Passer handles it is one thing Cutter's Way does right. The movie is fierce gritty and stubborn, like its halfmad protagonist striking in fits of rage the air with his cane and shooting holes in the sea, but it's also quiet bittersweet and tender and takes its time to get where it needs to. I like how the crime mystery slowly fades and dissolves in the haze of the hot summer Los Angeles afternoon before it's allowed to become tedious or an end in itself and instead we get to spend time out in the pier or inside cramped living rooms with the heavy curtains pulled, there are empty whiskey bottles on the floor and a soft jazz tune is playing on the pickup. It's like the movie is whispering to itself \"there's still time\" or maybe \"we still have one last night left\", because we're looking at people broken who can never be made right again, the pieces were cracked long ago or in faraway places and they can't be found again, so there is this one last night left for everyone. When Bone makes love to Cutter's wife, the one woman he could never conquer, she breaks down and cries. There's not much joy here, but sadness and regret is mixed with a feverish desire for doing things now, even when it's too late.",
         "Cutter's Way is one of my most favorite films. The characterization is excellent, the plot is both persuasive and surprising, and the acting is flawless--Lisa Eichhorn, whom I'd never heard of before, in particular. It's a travesty that virtually no one has heard of this film; all I can say is that it is well worth watching, if you can find it at your video store or watch it on late-night TV....",
         "\"What is exaggeration to one class of minds, is plain truth to another.\" - Dickens Perhaps the last of its kind, Ivan Passer's \"Cutter's Way\" is a richly allegorical post-Watergate, post-Vietnam noir. Operating as a kind of sequel to Pakula's \"Parallax View\", the film stars John Heard as Alex Cutter, an angry Vietnam veteran who's returned from what he now regards as a meaningless war minus an arm, an eye and a leg. The casting of Heard is significant. The actor made a trio of films, now largely forgotten, in which he played disaffected twenty-something American's, all suffering from a 1960's hangover (\"Between the Lines\", \"Head Over Heels\" etc). In \"Cutter's Way\" Heard pushes these characters to their extreme. He paints Cutter as a perpetual drunk, a messy tangle of counter-culture eccentricities, post Vietnam angst, bitterness and barely contained rage. He's emblematic of America's Lost Generation, high on drugs, booze and paranoid blues. The film opens on a L.A. street parade. It's an ominous black-and-white image, into which patriotic reds, whites and blues slowly seep. We then begin to coalesce on a blonde girl dancing in a white dress. She vanishes, foreshadowing a girl's murder later in the film. The figure of a man riding upon a white horse is hidden, almost imperceptibly, in the centre of this introductory image. His significance becomes apparent later on. Passer's introduction conjures up every offbeat noir from \"Out of the Past\" to \"Blow Up\" to \"Parallax View\". But what's intriguing about \"Way\" is how much it actively tries NOT to be a noir. In this regard much of the film centres on Richard Bone (Jeff Bridges, always cool), a Santa Barbara gigolo, yachtsman, beach-bum and slacker (the genesis of Jeffery Lebowski?) who we first see trimming his whiskers and flexing his brawny body over the bed of a female conquest. Passer paints Bone as Cutter's opposite: self absorbed, non committed, forever without attachments and riding through life on a wave of perpetual youth. Significantly, Bone's nickname is \"Rich\" and he's periodically tantalised with the prospects of an \"esteemed\" job; the tanks of Reaganism are on the lawn, and Bone's soul is ripe for picking. \"Sooner or later you're going to have to make a decision about something,\" characters say, but his ears remain deaf. This is the film's underlying preoccupation: making decisions, taking a stand on something. The film's noir plot begins late. Bone witnesses a man discarding a dead girl's body. He tentatively identifies this man as J.J Cord, a powerful oil tycoon, but isn't sure. Indeed, for the purposes of the film, Cord mightn't even exist. He's a spectral figure, part archetypal noir \"puppet master\", part scapegoat, part State power personified. Bone wants to leave Cord alone, but Cutter latches on to the murder mystery with the ferocious tenacity of a pit-bull. These two opposite motions \u0096 yin and yang \u0096 influence Passer's aesthetic. On one hand his film's oddly relaxed, non-committed, skirting around its red herring narrative and refusing to engage its own plot, let alone acknowledge the girl's murder. On the other hand, it's at this very apathy, this \"narrative slackness\", which Cutter chips away (Bone plays with toy guns while the impatient Cutter blasts away with the real thing). In his quixotic quest for justice Cutter's then transformed into a one legged Ahab obsessively in pursuit of his own Moby Dick (the white whale echoing Cord's saintly white horse). But whose side do we take? Cutter shows flashes of genius, mentioning Hamlet, Moby Dick, LA history and Marx, but he's a hothead, embittered and drunk, and his judgement may be clouded. Though it is suggested that Cord murders Cutter's wife, Passer is careful to leave every act of violence ambiguous. Cord's wife, Mo, may have killed herself, their home may have been burnt by a disgruntled neighbour and not Cord, and the film's climax never resolves whether or not Cord is guilty. Are Cutter's actions radically, politically and righteously motivated, or is he deranged? In \"Neon Noir\" author Woody Haut argued that Vietnam not only damaged the body politic, but blurred the line between the perpetrators of crimes and those who investigated them. In \"Cutter's Way\", social justice has been left up to rejects, outsiders and the dregs of society. Cutter himself is plainly a visual emblem of cultural trauma (see Ashby's \"Coming Home\"). Interestingly, while Passer emphasises Bone's masculinity, his chiselled body, his physical perfection, it is the cripple Cutter who emerges as the film's masculine ideal. \"It must be tough playing second fiddle to a one eyed cripple,\" Mo tells Bone. Meanwhile, Cutter attempts to force his friend out of passivity and into emotional and ideological commitment. The film then ends with Cutter and Bone holding the gun that kills (we assume) Cord, at last joined in previously denied phallic power. Hence the film's title: doing things Alex Cutter's way is doing things right, pursing a moral conviction all the way (see Altman's \"The Long Goodbye\"). End result: while the film registers a certain masochistic pleasure in the loss of centrality, of white privilege, its ultimate message is fairly subversive for a Hollywood noir. Wealth/power may exist beyond the reach of the ordinary, Passer says, but more importantly, change is bulldozed by escapism, non-commitment and vacillation. \"I don't feel anything,\" Cutter's wife repeatedly states, as she drowns herself in alcohol. Her husband may have zombie limbs, but she's the zombie. By the film's end you're left with two poles: Richard \"walking away is what you do best\" Bone, seemingly on the fast track to a white collar wonderland, and Cutter, whose existence suggests that agency now lies only in a radical form of madness. Beyond all this, the films works equally well as a detective movie, romance and a drama about the camaraderie between a gang of castaways and would-be gumshoes. 8.9/10 \u0096 Worth two viewings."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": ["Gurian Entertainment"],
      "summaries": [
         "John Heard came back from the war minus an eye, a leg and an arm. He drinks a lot and abuses his wife, who also drinks a lot. Jeff Bridges is a friend who witnesses a murder. From this point John is \"after\" the killer, along side the diseased sister, while Jeff doesn't really want to get involved in it.",
         "Alex Cutter (Heard) came back from war minus an eye, a leg, and an arm and mad as hell. He lacks direction, drinks too much, and abuses his wife (Eichhorn). One night his friend Richard Bone (Bridges) witnesses someone dumping something in an alley; it turns out to be the body of a young girl. When Cutter hears about it, he embarks on a crusade to expose the killer, enlisting the help of the murdered girl's sister. Bone reluctantly joins them. Are they right or are they in search of their white whale?",
         "Richard spots a man dumping a body, and decides to expose the man he thinks is the culprit with his friend Alex Cutter."
      ],
      "budget": 3000000
   },
   "movielensId": 3731,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1981-03-19",
      "dvdReleaseDate": "2001-07-10",
      "directors": ["Ivan Passer"],
      "runtime": 105,
      "movieId": 3731,
      "title": "Cutter's Way",
      "mpaa": "R",
      "actors": [
         "Jeff Bridges",
         "John Heard",
         "Lisa Eichhorn",
         "Ann Dusenberry",
         "Stephen Elliott",
         "Arthur Rosenberg",
         "Nina van Pallandt",
         "Patricia Donahue",
         "Geraldine Baron",
         "Katherine Pass",
         "Francis X. McCarthy",
         "George Planco"
      ],
      "imdbMovieId": "0082220",
      "originalTitle": "Cutter's Way",
      "genres": [
         "Drama",
         "Mystery",
         "Thriller",
         "Crime"
      ],
      "youtubeTrailerIds": [
         "bBhprZR8IRQ",
         "4rEFlucmMMo"
      ],
      "plotSummary": "Richard spots a man dumping a body, and decides to expose the man he thinks is the culprit with his friend Alex Cutter.",
      "tmdbMovieId": 31593,
      "avgRating": 3.49184,
      "releaseYear": "1981",
      "numRatings": 245,
      "posterPath": "/nNtW7xwpP3fwGWqgBYCm564S7zq.jpg"
   }
}