{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "family",
            "id": 18035
         },
         {
            "name": "life raft",
            "id": 175668
         },
         {
            "name": "private airplane",
            "id": 175670
         },
         {
            "name": "toothbrush",
            "id": 175676
         },
         {
            "name": "gluttony",
            "id": 175681
         },
         {
            "name": "magnifying glass",
            "id": 175683
         },
         {
            "name": "rubber boat",
            "id": 175685
         }
      ],
      "imdb_id": "tt0110989",
      "video": false,
      "title": "Ri¢hie Ri¢h",
      "recommendations": [
         12139,
         888,
         11806,
         9327,
         3050,
         8839,
         9279,
         12107,
         9714,
         10808,
         11158,
         9494,
         11212,
         10603,
         9598,
         10708,
         9032,
         6280,
         10137,
         11077
      ],
      "backdrop_path": "/3VK2JEWBN4ZJNKtIkr7QadI8pV4.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Richie Rich",
               "gender": 2,
               "credit_id": "52fe43e29251416c75021e35",
               "name": "Macaulay Culkin",
               "profile_path": "/eMApQSnjNI9wSzGv1MYbj0D011j.jpg",
               "id": 11510,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Lawrence Van Dough",
               "gender": 2,
               "credit_id": "52fe43e29251416c75021e39",
               "name": "John Larroquette",
               "profile_path": "/2JCgM1nqdxZUQv1qsE3BJu4fnRr.jpg",
               "id": 14101,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Richard Rich",
               "gender": 2,
               "credit_id": "52fe43e29251416c75021e3d",
               "name": "Edward Herrmann",
               "profile_path": "/3AGRAverIuT6kgSfGQPiY55QZzG.jpg",
               "id": 52995,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Regina Rich",
               "gender": 1,
               "credit_id": "52fe43e29251416c75021e41",
               "name": "Christine Ebersole",
               "profile_path": "/dl8uNpIyYeGpjA90C0W1SGSsfla.jpg",
               "id": 4003,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Tony",
               "gender": 2,
               "credit_id": "52fe43e29251416c75021e45",
               "name": "Michael Maccarone",
               "profile_path": null,
               "id": 952664,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Omar",
               "gender": 2,
               "credit_id": "52fe43e29251416c75021e49",
               "name": "Joel Robinson",
               "profile_path": null,
               "id": 218589,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Pee Wee",
               "gender": 2,
               "credit_id": "52fe43e29251416c75021e4d",
               "name": "Jonathan Hilario",
               "profile_path": null,
               "id": 974420,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Young Richie",
               "gender": 2,
               "credit_id": "52fe43e29251416c75021e51",
               "name": "Rory Culkin",
               "profile_path": "/gGPDJpN3l6mbW5E4pZ8VQJU9Sue.jpg",
               "id": 28042,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Herbert Cadbury",
               "gender": 2,
               "credit_id": "52fe43e29251416c75021e55",
               "name": "Jonathan Hyde",
               "profile_path": "/7il5D76vx6QVRVlpVvBPEC40MBi.jpg",
               "id": 8537,
               "order": 8
            },
            {
               "cast_id": 22,
               "character": "Gloria Pazinski",
               "gender": 1,
               "credit_id": "5861447192514115cf02fa35",
               "name": "Stephi Lineburg",
               "profile_path": "/dXy8cshoHrpzd9V3f8CQpeaNk9a.jpg",
               "id": 2266,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43e29251416c75021e07",
               "name": "Donald Petrie",
               "profile_path": "/skokYnTDYIKogfeH7DU49dfhRsj.jpg",
               "id": 18281,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43e29251416c75021e0d",
               "name": "Tom S. Parker",
               "profile_path": null,
               "id": 13582,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43e29251416c75021e13",
               "name": "Jim Jennewein",
               "profile_path": null,
               "id": 13583,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43e29251416c75021e19",
               "name": "John Davis",
               "profile_path": null,
               "id": 2043,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43e29251416c75021e1f",
               "name": "Joel Silver",
               "profile_path": "/9BUSlPpIAEQYtRdzVrSXaivld04.jpg",
               "id": 1091,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43e29251416c75021e25",
               "name": "Alan Silvestri",
               "profile_path": "/chEsfnDEtRmv1bfOaNAoVEzhCc6.jpg",
               "id": 37,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43e29251416c75021e2b",
               "name": "Don Burgess",
               "profile_path": "/fcgMxamFShyrfmzLZSg8gOjL1ij.jpg",
               "id": 36,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43e29251416c75021e31",
               "name": "Malcolm Campbell",
               "profile_path": null,
               "id": 14457,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "558dc6589251415ce00006fc",
               "name": "Margery Simkin",
               "profile_path": "/dCyAWZGEaW1OlGgh5ALiqGfsbpb.jpg",
               "id": 6347,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "558dc673925141302d000252",
               "name": "James H. Spencer",
               "profile_path": null,
               "id": 10064,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "558dc692925141302d000255",
               "name": "Lisa Jensen",
               "profile_path": null,
               "id": 51693,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "558dc6b1c3a3685daf0003d1",
               "name": "Mary J. Carlson",
               "profile_path": null,
               "id": 1481828,
               "department": "Directing",
               "job": "Script Supervisor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 10.17432,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11011,
      "vote_count": 607,
      "budget": 40000000,
      "overview": "Billionaire heir Richie Rich has it all, including Reggie Jackson as a batting coach and Claudia Schiffer as a personal trainer -- but no playmates. What's more, scoundrel Laurence Van Dough is scheming to take over the family empire. Uh-oh! Enter faithful butler Cadbury to save the day.",
      "similar": [
         49519,
         693,
         225886,
         93456,
         274167,
         195589,
         376659,
         433,
         325133,
         2698,
         158907,
         7345,
         8967,
         73,
         587,
         5176,
         244772,
         277216,
         10054,
         7972
      ],
      "original_title": "Ri¢hie Ri¢h",
      "runtime": 95,
      "poster_path": "/hbNmaqJcjg4ChZ5vvfQpNzizoiR.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Latin",
            "iso_639_1": "la"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/oyzh3Ax1DLJ5gbNRgD6JgMz9Uvd.png",
            "name": "Davis Entertainment",
            "id": 1302,
            "origin_country": ""
         },
         {
            "logo_path": "/gMQ3oAjFyLIToDgrMKZgSCta3gT.png",
            "name": "Silver Pictures",
            "id": 1885,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1994-12-19",
      "vote_average": 5.4,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Richie Rich Collection",
         "id": 167985,
         "poster_path": null
      },
      "tagline": "An adventure so big... even the world's richest kid can't afford to miss it!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Donald Petrie"],
      "runtime": 95,
      "synopsis": "Richie Rich is the son of Richard and Regina Rich, two of the wealthiest people in the world. Richie lives a life of luxury in the Rich Mansion, of which he is helped and waited upon by a manservant named Cadbury, who acts as Richie's guardian when his parents are unable to. Also in the employ of the family is Professor Keenbeen, a man who comes up with rather amusing gadgets and gizmos for the Rich family. One day, Richie attends the reopening of a factory called United Tool, which is father has saved from bankruptcy. While acting in his father's place, Richie soon becomes more interested in some kids playing a game of baseball nearby than the event. However, when he tries to join in the game, he is ushered away by Cadbury. On the trip back to the Rich Mansion, Cadbury notices a strange look of melancholy on Richie's face. When Richie attends school the next day, he tries to get some of the other wealthy classmates to 'hang out' with him, but none of them are willing to or know what this meaning is. On the way home, Richie has Cadbury take him back to the neighborhood where United Tool is. Finding the kids playing baseball again, Richie tries to join their game, only to have the kids feel that Richie is too rich to know how to play sports. He proves them wrong by hitting a homerun. Richie's thoughts that this will impress them, only seems to repulse them. Richie is then scheduled to accompany his parents on a visit to see the Queen of England. However, Cadbury insists that Richie stay home, and Regina and Richard give in to his request. Later on in the day, Cadbury surprises Richie by showing that he has invited the kids from the baseball game to stop by. They are soon enormously impressed by the Rich Mansion, and soon end up playing all sorts of games with Richie. Richie eagerly invites them back for another time to play, but this is soon tempered when a report comes that his parent's airplane has gone down in the Atlantic Ocean. Even though it seems hopeless, Richie and Cadbury believe that Richie's parents are still alive. Unknown to them, the plane crash was orchestrated by Lawrence Van Dough, a ruthless member of the Rich Industries Board who intends to take over the company. As the second-in-command behind Richard, Lawrence begins to make changes in the company's policies, starting with the closing of United Tool. When Richie is informed of this by Gloria, he decides to take action. As heir to the Rich Family Fortune, Richie owns a large portion of company stock, but is unable to take control of the company. However, since Cadbury was placed as Richie's guardian in the case of anything happening to his parents, Richie can operate through Cadbury. This move irritates Van Dough, who soon finds himself in a tug-of-war with the Rich Empire's board of directors.",
      "writers": [
         "Neil Tolkin",
         "Tom S. Parker"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0110989/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkzMzAzOTgwMV5BMl5BanBnXkFtZTYwMzQ0MDA5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Macaulay Culkin, Edward Herrmann, John Larroquette | See full cast and crew »"],
      "reviews": [
         "I gave this movie a 7 on a scale of 1-10 because I took into consideration it is a kids movie and should be judged as such. When this movie came out I was 13 and of course I enjoyed it much more then as opposed to now but having watched it as a child and as an adult I do remember how much I enjoyed the film as a kid. From the harsh grade of a 4.4 average I assume people where comparing this to complex movies with great plots. Kids should not be subjected to nothing but adult theme. So when you grade the movie remember what audience it was desighned for.As a child I would have gave this movie a 7. Would you drive a metro and act as if it should perform like a porsche?",
         "This is definitely teen fare, but it's very entertaining which means adults would get a lot of laughs out of it. As with any comedy, some of the stuff is really stupid and some of it is really funny. Along the way, you get some of modern Hollywood's secular plugs and a few swear words that you wouldn't want your little ones to hear, but overall, I have little to criticize with this one. There were a number of sight gags, things that made me laugh out loud, such as dollar signs instead of spots on the dog, the dress-ware of the little rich kid (Macauley Culkin), the eccentric characters - good and bad guys - are all fun to watch. I thought Jonathan Hyde, as the butler, stole the show.",
         "Sometimes, when I come home tired from work and have a brewski and want to zone out, I feel like a total fluff movie. Richi Rich fills the bill. It moves along, something most movies don't. It's harmless and doesn't require any involvement on my part. The jokes are silly. I can miss some of it on a fridge run, come back to it, and still follow it. In fact, if I don't finish the movie, it doesn't seem to matter. However, it is charming, so I usually do. The movie pokes fun at the super rich on a superficial level, but that's all right. I'll save the harshly critical movies for a different mood. There's some lovely views of the Biltmore estate. There's light ribbing of the corporate world. Oh dear, I'm falling asleep. I'll miss the end of the movie. Too many brewskies.",
         "This movie - Macaulay Culkin's Last movie as a child is not his best but not his worst - that goes to the unfunny Ted Danson Action 'comedy' Getting even with dad which came out the same year- But it's pretty sickly sweet and you can see why it bombed at the Box Office. The plot concerns the richest boy in the world 'Richie Rich' Played by Culkin, But by this time he was at 14 looking too old to play the title role. He's the boy who has everything, wealthy parents lives in a big mansion has a butler (wonderfully played by Johnathan Hyde) - But he's very lonely, he has no friends. So one day he tries to join a group of inner city kids playing baseball but they don't want to know him. one of Richie's father's associates Lawrence van dough (John Larroquette) wants to get his hands on the company and the family's fortune, so he tries to kill mum and dad -Ritchie needs the other kids's help to save the company, his parents and his fortune aided by The butler. Not a bad movie it has a very good moral story (all the money in the world can't make you happy)- But strictlty for KIDS or easily amused adults Rating 7/10",
         "This was Macaulay Culkin's first major flop, when he was finally un-cute enough that viewers noticed he couldn't act. Other than that, compared with other mindless, shallow, hopelessly far-fetched pseudo-adventures designed for either very small or very uncritical children, it's really not worse than one would expect. Well, the comic book on which it's based is not exactly Stan Lee either\u0085 From a pedagogical point of view, one must say that Richie takes control of his situation in the absence of his parents, makes decisions that are largely sensible and practical, and carries them out mostly without adult help. He combines emotional and rational qualities without violating his basic identity as a kid. To me, that's all good, and redeems the entertainment value of this movie for a young audience.",
         "In 1994, Macaulay Culkin stared in 3 films: 'Richie Rich', 'The Pagemaster' and 'Getting even with dad', none of them particularly interesting. The movies themselves did poorly at cinemas and in critical terms. In 1994, Macaulay Culkin was 13/14 years old. He was in his early adolescence, so he was growing. A difficult phase for him. Ridiculously, people began to ignore him because of that - either that or they simply thought his cuteness was disappearing and gave him little value for that. But he always proved to be a terrific actor. True, there were many, many great child actors but he was one of them for sure. Sure, his cuteness took him far, but it was his talent that made him a legend. After playing a completely different role in the 1993 film 'The Good Son' (where he played a psychopath that could very well disguise that nature thanks to his angelical looks, a wolf in sheep's clothe), he returned to the roles of 'good guys' in all of his 1994 films. 'Richie Rich' is not much of a film, but perhaps it's a little more interesting than 'The Pagemaster'. It's not a bad movie, but it's a somewhat complex film for me to give a fair rating. It has good moments but also very stupid moments, particularly from the 2nd half on (in my opinion, where the movie is at its weakest). Macaulay Culkin plays the title character. Richie Rich is rich (like his name suggests), lives in a fancy mansion surrounded by comfort and luxury and can even count with a chauffeur that takes him in his majestic and elegant Rolls-Royce Silver Cloud whenever it's necessary. But Richie realizes that there is one thing that money can't buy: happiness. He feels the lack of friends and possibly bored with his tedious life. He just wants to be like the other kids. About the things I found funny in this film, a good example of that is the line «Oh my God, I look like Michael Jackson!» by Richie's mother. Come to think of it... that's not untrue - lol. I'm surprised they put this line in the film because Macaulay Culkin stars in it and considering the friendship he had with the eccentric singer... Other funny details are, for example, the cute dog that has dollar signs instead of spots and appropriately named Dollar, and the scene when Richie doesn't wanna wake up but stares at his personal trainer when he realizes what a beauty she is (she is portrayed by the supermodel Claudia Schiffer). Macaulay Culkin had everything to be a great name of the cinema. And he was, for a few years, mostly thanks to the success of the first two 'Home Alone' films. He was talented, charismatic and good-looking. Too bad he trashed his life later, but I believe he turned out to be like this because of his personal problems.",
         "Macaulay Culkins's sweet, childish cuteness is at it's climax here, cause he was 14 when it was was released, so he was 13 1/2 when they were filming it. He seemed about as close to growing from boy to man as you can get, while still being a boy. His voice was deeper than in any of his movies back then, and on the verge of growing. The Rich's own $70,000,000,000, and Richie has his own Mcdonald's, extreme roller coaster, a diversion I forget what you call that launches you up in the air and lands you on a mattress, and four wheelers to name a few! Reggie Jackson is his baseball coach and Arnold is his fitness trainer! he has Herbert Cadberry, as his very likable and proper butler. Richie Miraculously possesses all this, while still being likable and not a brat. Mac may seem like a spoiled brat in real life, but I know he's a likable person, his parents just gave him it. he's not like Brad Renfro. Richie has class with a hilarious teacher played once again by Ben Stein, in the same way he plays the economics teacher that gave him his name, only funnier here. The only thing he doesn't have is friends. He meets some sandlot kids, which makes him yearn deeply for friends, so he becomes aqquainted with them. The kids include, the Mr. COOL kid, the overweight kid that eats a lot, the jock, and one that seems stuck-up and bossy until a little later. the villain is the industries top executive, Laurence Van Dough (John Larroquette) who arranges for Richie and his parents to be killed in a plane by a bomb, but Richie wasn't even in it, and his parents survive by floating on the inflatable boat. The action is great and goes on for a long time with violence and weapons, and Cadberry dresses up like a gangster, high tech spying, fatal suspense in the science lab, and a great climax on Mt. Richmore. Profanity, one damn, and one \"s\" word.",
         "The comic is older then I am, but it still stands the test of time. The richest boy in the world facing off against villainous foes that would take that wealth away is a good one. The cartoon from my childhood still ranks one of my favorites. This live action adaptation is pretty good, but far from perfect. There is still about three complaints I have. One, Mike McShane as Keenbean, Mike is a great actor and a very funny improver. But he's not right for Keenbean. He's too large. Two, Dollar is a rare species of dog, one of a kind as far as I know, the Dollarmation. As in Dalmatian with dollar shaped spots. The dog they got was too small and didn't do all those crazy things to become a hero like in the cartoon. Lastly, no Irona the robot maid. She may be just a robot maid, but she is just as important to the cast as Richie and Keenbean. Macaulay Culkin does a great job as Richie, even though I would have liked to seen his famous sweater with the R on it. But that's minor, I give it 8 STARS.",
         "I didn't absolutely hate Richie Rich, but for me it wasn't that great either. As usual, there were some good things, but some not so good things as well. THE GOOD THINGS: 1) Macaulay Culkin, personally I think he is better an actor than people give him credit for. He is one of the main reasons why I love the first two Home Alone movies so much. Here, he gives a very spirited lead performance, admittedly not as cute as he was when he was starring in underrated gems like Uncle Buck, but he shows once again what a talented actor he was. 2) Jonathan Hyde as the butler comes very close to stealing the show, a very funny and sly performance. Also Edward Hermann and Christine Ebersole give humorous performances, while John Larroquette plays the villain of the piece more than adequately. 3) The scenery is quite impressive, captured well by the breezy cinematography. The Biltmore estate was gorgeous. 4) The soundtrack was decent, nice background music especially. 5) I liked the moral the film taught; All the money in the world can't make you happy, thinking about it that is true. THE NOT SO GOOD THINGS: 1) While I liked the moral of the film, the story itself is predictable and somewhat contrived. it probably doesn't help you have seen it all before. 2) The script is quite weak in general. Don't get me wrong there were some good spots like \"Oh my god I look like Michael Jackson!\" but the jokes are admittedly very silly and juvenile, and the scripting does fall in the danger of becoming clichéd. 3) The pacing. Now I don't mind films that move fast. I do have more of a problem if the pacing is TOO fast, despite the feel good nature of the film, and its valiant attempt to rise above superficial material, the film feels a little too rushed, the ending particularly felt skimmed over. 4) The characters feel rather stereotypical. Maybe that is an unfair complaint as it probably couldn't be avoided, but I couldn't help thinking yeah I recognise that type of character. Overall, definitely not a bad film, worth watching at least once, but I personally didn't find it that great. 5/10 Bethany Cox",
         "Richie Rich is a trite wooden family comedy based on the old cartoon series about the richest boy in the world. With a role virtually crafted for him, this movie seems like it was made for the sole purpose of capitalising on the waning youth of the growing star Macaulay Culkin, star of box office smashes like Home Alone 1 and 2 (now those were funny). Richard 'Richie' Rich is the richest boy in the world, and sole heir to the bazillions of dollars owned by his fathers company / huge-amalgated-yet-somehow-wholesome-corporation. It follows a pivotal period in the young gazillionare's life, as he attempts to make friends while at the same time defend his fathers company from an evil and ambitious...guy, high ranking employee Lawrence Van Dough (an excellent villain performance from John Larroquette..whoever the hell that is), who attempts to kill Richie's parents while they're flying through the Bermuda Triangle. Richie struggles to maintain a sickeningly wholesome stranglehold over his company, while Van Dough attempts to remove all obstacles. I'll try not to spoil too much.. Relatively humourous gags like the whoopass butler Herbert, and some nice juxtaposition with scenes like the kids rollerblading through a hall filled with men in suits. The movie also raises some fundamental questions about material wealth and...friend wealth (you know what I mean), which doesn't answer the questions so much as cover them up with roller coasters, a personal McDonalds and the 'Kidapult'. Culkin manages to look like Draco Malfoy or a cousin of the Addams Family throughout the film, which would help to explain his initial difficulty in making/obtaining friends. Speaking of which, his friends are practically dirty urchin robots, who's job of delivering cliched one-liners (generic fat boy: hey, these gumballs are free!) would've been performed just as easily by cardboard cut-outs. Professor Keenbean and the Rich parents give some humorous performances, like the use of Keenbean's sticky black adhesive, and the smell detector which reveals the dynamite hidden in the Rich's plane. The closing scene to the movie shows Richie playing baseball with his new pals, bonded, or rather, scripted, together by the conflict and all those persuasive material possessions of Richie's that we have unfortunately just born witness to, in what could be the most stunningly mediocre 95 minutes of our life. Everybody is happy: Richie has 'pals', his parents are alive, and even the butler gets some nookie, but then again, the sculptor is distraught at having her giant masterpiece Mt Richmore torn apart by a huge laser, Professor Keenbean is still stuck to the floor of his lab (as far as we know), Van Dough is gardening, fortunately just as unquestionably evil as ever, and Macaulay Culkin has just starred in his last major role before enduring the painfully ...'textured' years of puberty. SO LONG BABY FACE! \"You know what Regina, now I think our son really is the richest boy in the world..\" \"He has friends\" ...please excuse my sardonic grin."
      ],
      "genres": [
         "Comedy",
         "Family"
      ],
      "productionCompanies": [
         "Warner Bros.",
         "Silver Pictures",
         "Davis Entertainment"
      ],
      "summaries": [
         "The richest kid in the world, Richie Rich, has everything he wants, except companionship. While representing his father at a factory opening, he sees some kids playing baseball across the street. Richie wants to join in, but they don't want him around. When a plot to kill the Rich family is devised by Rich Industries' top executive, Laurence Van Dough, Richie must take over control of the company while searching for his lost parents with the help of some new friends.",
         "A rich young boy finds his family targeted in an inside job and must use his cunning to save them."
      ],
      "budget": 40000000
   },
   "movielensId": 374,
   "movielens": {
      "languages": [
         "English",
         "Latin"
      ],
      "releaseDate": "1994-12-19",
      "dvdReleaseDate": "2005-02-15",
      "directors": ["Donald Petrie"],
      "runtime": 95,
      "movieId": 374,
      "title": "Ri¢hie Ri¢h",
      "mpaa": "PG",
      "actors": [
         "Macaulay Culkin",
         "John Larroquette",
         "Edward Herrmann",
         "Christine Ebersole",
         "Michael Maccarone",
         "Joel Robinson",
         "Jonathan Hilario",
         "Rory Culkin",
         "Jonathan Hyde",
         "Stephi Lineburg"
      ],
      "imdbMovieId": "0110989",
      "originalTitle": "Ri¢hie Ri¢h",
      "genres": [
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": [
         "fJJQ44fdDws",
         "G-bUj_-k57E"
      ],
      "plotSummary": "Billionaire heir Richie Rich has it all, including Reggie Jackson as a batting coach and Claudia Schiffer as a personal trainer -- but no playmates. What's more, scoundrel Laurence Van Dough is scheming to take over the family empire. Uh-oh! Enter faithful butler Cadbury to save the day.",
      "tmdbMovieId": 11011,
      "avgRating": 2.44329,
      "releaseYear": "1994",
      "numRatings": 6040,
      "posterPath": "/hbNmaqJcjg4ChZ5vvfQpNzizoiR.jpg"
   }
}