{
   "tmdb": {
      "original_language": "es",
      "keywords": [
         {
            "name": "fascism",
            "id": 1755
         },
         {
            "name": "communist",
            "id": 2109
         },
         {
            "name": "latin",
            "id": 3569
         },
         {
            "name": "spanish civil war",
            "id": 5509
         },
         {
            "name": "friendship",
            "id": 6054
         },
         {
            "name": "atheist",
            "id": 8778
         },
         {
            "name": "teacher",
            "id": 10508
         },
         {
            "name": "coming of age",
            "id": 10683
         },
         {
            "name": "butterfly",
            "id": 156096
         }
      ],
      "imdb_id": "tt0188030",
      "video": false,
      "title": "Butterfly",
      "recommendations": [
         56810,
         41806,
         89308,
         117897,
         368432,
         116314,
         75877,
         172265,
         60985,
         107673,
         132994,
         143529,
         115360,
         103130,
         79359,
         116696,
         97318,
         168502,
         163422,
         118898
      ],
      "backdrop_path": "/6u1HviB1UgtdqEqSkFZ66PvbPS5.jpg",
      "revenue": 6000000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Don Gregorio",
               "gender": 2,
               "credit_id": "52fe44569251416c9100d3bb",
               "name": "Fernando Fernán Gómez",
               "profile_path": "/imdGxyxOGfbVPCQsutPI5StAncv.jpg",
               "id": 965,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Moncho",
               "gender": 2,
               "credit_id": "52fe44569251416c9100d3bf",
               "name": "Manuel Lozano",
               "profile_path": "/uI5QfuqFNas8e9vxsAk9t1Ib7DT.jpg",
               "id": 115106,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Rosa",
               "gender": 1,
               "credit_id": "52fe44569251416c9100d3c3",
               "name": "Uxía Blanco",
               "profile_path": "/nslO6XjhCvAt9p094bT71XgMTYR.jpg",
               "id": 116068,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Ramón",
               "gender": 2,
               "credit_id": "52fe44569251416c9100d3c7",
               "name": "Gonzalo Uriarte",
               "profile_path": "/jiWr6FdoAq1cUUujSUQzoK4LpDi.jpg",
               "id": 116071,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Andrés",
               "gender": 2,
               "credit_id": "52fe44579251416c9100d3cb",
               "name": "Alexis de los Santos",
               "profile_path": null,
               "id": 116070,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Don Avelino",
               "gender": 2,
               "credit_id": "52fe44579251416c9100d3cf",
               "name": "Jesús Castejón",
               "profile_path": "/9TfeyEfYdeEY2QSr86RwBISCZnM.jpg",
               "id": 116072,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "O'lis",
               "gender": 2,
               "credit_id": "52fe44579251416c9100d3d3",
               "name": "Guillermo Toledo",
               "profile_path": "/f8VUV8GkS0q3c4zv3HsnbKWeyF2.jpg",
               "id": 27460,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Carmiña",
               "gender": 1,
               "credit_id": "52fe44579251416c9100d3d7",
               "name": "Elena Bagutta",
               "profile_path": "/27TZ7qBozTBfX9neyn96OUDvzRz.jpg",
               "id": 116073,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Roque",
               "gender": 2,
               "credit_id": "52fe44579251416c9100d3db",
               "name": "Tamar Novas",
               "profile_path": "/tht5l5lcKkWuyXGYRRugmRio22s.jpg",
               "id": 33411,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Aurora",
               "gender": 0,
               "credit_id": "52fe44579251416c9100d3df",
               "name": "Lara López",
               "profile_path": null,
               "id": 116074,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Roque Padre",
               "gender": 0,
               "credit_id": "57b22afe9251414e4d000a3d",
               "name": "Tatán",
               "profile_path": null,
               "id": 1074538,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Boal",
               "gender": 0,
               "credit_id": "57b22b129251414e7a0009c1",
               "name": "Roberto Vidal Bolaño",
               "profile_path": null,
               "id": 585853,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Macias",
               "gender": 0,
               "credit_id": "57b22b23c3a36869e50019ef",
               "name": "Celso Parada",
               "profile_path": null,
               "id": 1666723,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "Cura",
               "gender": 2,
               "credit_id": "57b22b31c3a36869e50019f7",
               "name": "Celso Bugallo",
               "profile_path": "/6X8FE3CMUVABbbbEjpYCfq5AZyI.jpg",
               "id": 16870,
               "order": 13
            },
            {
               "cast_id": 20,
               "character": "Alcalde",
               "gender": 0,
               "credit_id": "57b22b41c3a3686a21001788",
               "name": "Antonio Lagares",
               "profile_path": null,
               "id": 1666724,
               "order": 14
            },
            {
               "cast_id": 21,
               "character": "Jose Maria",
               "gender": 0,
               "credit_id": "57b22b9ac3a3686a210017a0",
               "name": "Alberto Castro",
               "profile_path": null,
               "id": 1303543,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44569251416c9100d39f",
               "name": "José Luis Cuerda",
               "profile_path": "/8bkFGYH7XcHT8UZyM6QCzSB8Och.jpg",
               "id": 19842,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44569251416c9100d3a5",
               "name": "Rafael Azcona",
               "profile_path": "/gYOUk2TKJxe48oaoToiLiN24x9V.jpg",
               "id": 37590,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44569251416c9100d3ab",
               "name": "José Luis Cuerda",
               "profile_path": "/8bkFGYH7XcHT8UZyM6QCzSB8Och.jpg",
               "id": 19842,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44569251416c9100d3b1",
               "name": "Manuel Rivas",
               "profile_path": "/s6pdgxNYgSAhDn1FFE0yN2BQtzL.jpg",
               "id": 116067,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe44569251416c9100d3b7",
               "name": "Alejandro Amenábar",
               "profile_path": "/oNOZAy7tzekG0fL6fHniHvwHPAg.jpg",
               "id": 19840,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 2.221516,
      "production_countries": [{
         "iso_3166_1": "ES",
         "name": "Spain"
      }],
      "id": 31023,
      "vote_count": 60,
      "budget": 3000000,
      "overview": "The film centres on Moncho and his coming-of-age experience in Galicia in 1936. Moncho develops a close relationship with his teacher Don Gregorio who introduces the boy to different things in the world. While the story centres on Moncho's ordinary coming-of-age experiences, tensions related to the looming Spanish Civil War periodically interrupt Moncho's personal growth and daily life.",
      "similar": [
         376660,
         378064,
         8363,
         207,
         235,
         10229,
         73,
         76726,
         376867,
         85350,
         449176,
         13342,
         308369,
         1265,
         286565,
         37735,
         52449,
         272693,
         437670,
         233063
      ],
      "original_title": "La lengua de las mariposas",
      "runtime": 96,
      "poster_path": "/yEgUOehlMtK9LfZjvYr0bQn9d2.jpg",
      "spoken_languages": [
         {
            "name": "Català",
            "iso_639_1": "ca"
         },
         {
            "name": "Latin",
            "iso_639_1": "la"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Televisión de Galicia (TVG) S.A.",
            "id": 10050,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Canal+ España",
            "id": 9335,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Las Producciones del Escorpión S.L.",
            "id": 18332,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Sociedad General de Televisión (Sogetel)",
            "id": 20295,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Televisión Española (TVE)",
            "id": 6639,
            "origin_country": ""
         }
      ],
      "release_date": "1999-09-24",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "Stop and taste the world.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Spain",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["José Luis Cuerda"],
      "runtime": 96,
      "synopsis": null,
      "writers": [
         "Rafael Azcona",
         "José Luis Cuerda"
      ],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt0188030/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BOTMwNDYyMDgzMl5BMl5BanBnXkFtZTcwNjMwMzEyMQ@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Manuel Lozano, Fernando Fernán Gómez, Uxía Blanco | See full cast and crew »"],
      "reviews": [
         "I've been watching a lot of films in Spanish lately, trying to prepare for a course I will be teaching on Love in Hispanic Cinema. I'm searching for the film I can show that will exemplify love of country... and while I don't think this is the one I'm looking for, it may work insofar as the \"love of Spain\" expressed resonates with the same propagandistic tones similar expressions of \"patriotism\" so often do. I won't bore you with the basics of plot nor repeat what everyone else has already said as you can read the intro and a hand-full of other posts and know enough. I will tell you that this is a subtle film. We in the US are so used to being hit over the head by our movies that watching this film is like feeling a soft breeze. It's oh so quietly disquieting. I have found interesting the posts reviewing this film that criticize the \"meanderings\" of the plot --how far the dispersed elements take us away from the core message. But I ask, what is not childhood but a collection of fascinating and disconnected pieces of a puzzle that we can't put together quite yet. Music, love, family, sex, food, school, friends, women and girls, books, nature, teachers and grown men -all equally interesting and engaging to a young boy. But when he's all of maybe seven, what does he know about how they all relate to each other? What do any of us really know about how all the pieces of our lives fit together, or what they mean? I especially enjoyed the sad quality of all the varied losses interwoven in the greater story; they tempered the otherwise hopeful mood of the film. The overall effect on me was that I understood that loss is comprised not only of one deep cut but of a thousand little ones too. It wasn't only the dream of a Republican and free Spain that was lost; it was much more that was lost as well. The film-making here is exquisite too, like a butterfly, so beautiful visually; \"La lengua de las mariposas\" is so well executed that it truly feels real. There were no moments when I said to myself \"oh, come on,\" as I do when I feel I've been taken for too stupid to figure things out for myself, when everything has been made too obvious, predigested for me by the movie makers. Amazingly the child actor is believable at all times -never too precocious, never too coy. An excellent performance from a child actor is always a delight. See the Argentine film \"Valentin\" (2002) for another. Others write that the ending is shocking, too abrupt and that the audience is neither prepared for it nor guided towards it. For me that is the perfect ending because it replicates the shock of the civil war to the Spaniards, and the shock adult violence inflicts upon childhood. For me, the abrupt ending was the radical interruption traditional Spain forced upon everyone's future. Never mind, as one post suggested that in Republican Spain the communists had taken over and democracy was no longer in effect. Democracy here is the exotic Chinese beauty Andrés falls in love with, a fantasy out of reach, silenced and taken hostage by a brute. See this film and decide for yourself.",
         "It's a beautiful (and too rare) thing to witness a child actor who can avoid the saccharine cutesiness so common to mainstream American child actors. In this film full of children there are, happily, no cloying, exaggerated \"cute kid\" moments. The real beauty of La lengua de las mariposas is what's unspoken -- the truths that remain between the lines. The film's political theme is never heavy-handed, and its vivid and fascinating depiction of a turbulent moment in Spanish history has inspired in me a desire to learn more. Without spoiling the ending (which I read as fairly subversive, at least to an American audience), I must say I wasn't entirely surprised at what happened. It brought a tear to my eye and it's still making me think, three days later. Those who liked this film should also see La Vita e Bella (Life Is Beautiful) and La notte di San Lorenzo (Night Of Shooting Stars), which are similar and may appeal equally, if not more.",
         "This is one of those occasional intimate eye-openers which peacefully stir our self consciousness and that you are not likely to find in your local blockbusters. In my opinion, the greatest sin of commonplace movies -and any work of art for that matter- is pretentiousness. This movie quietly moves toward simplicity easily making its way to the contradictory twist in the final scene. The title might be a kind of pun on the words 'language' and 'tongue' that in Spanish are homonyms. We should ask Jose Luis Cuerda (director) or Rafael Azcona (script), because the pun, if there's one, is not obvious. On July 18th, 1936, General Franco's military forces rebelled against the elected Republican government. The film opens a year earlier, in a small town in the region of Galicia, where Moncho, the 7-year-old son of a republican tailor, doesn't want to go to the school where Don Gregorio teaches kids the wonders of nature, the funny spiral tongue of butterflies. In his conversations with Moncho, Don Gregorio also teaches him the principles of liberty and the notions of existence: 'That hell beyond this world does not exist. Hhatred, cruelty, that's hell. Sometimes, hell is ourselves'. I like the scene in which Andrés, Moncho teenage brother plays the saxo in the local fair while his love looks at him. The poignant 'pasodoble' 'En Er mundo' has been used to the same effect in other Spanish Civil War films, notably in Victor Erice's 'El Sur' Loyalty, cowardice and the fight for moral versus physical survival come into play in the final scene when Moncho denies his teacher. In the commentary on that scene, Cuerda remembers the tension that surrounded the place, rural Galicia being one of the most conservative regions in Spain. He mentions that he had learned later that the truck they used in the film had actually been used to 'pasear' (walk) republicans, one of many groups that were shot in the first days of the Civil War. My numbers: 9 out of 10",
         "This one was one of the excellent movies I have seen for the last couple of years. It takes you back to 1936, Spanish War in Galicia. Telling the truth I did not know well what happened there exactly . But this movie showed how the war influenced those people who lived in a small town to live their small lives. By the time they showed the ending scene my heart ached. I truly wished that someone could have been here with me to enjoy the afterglow this time. It has not happened to me lately. Plus their way to take this film was exquisite. Every single scene was beautiful and sentimental as if you turn around the post cards stand at the souvenir shop.",
         "This was a film that really tugged at the heart strings. I really enjoyed the building of characters and the way the lives of the village were portrayed. It was a difficult time politically, yet the simplicity of daily life and family in Galicia was the over-riding story here. The acting is second to none and Manuel Lozano was unbelievably fantastic! I mean these ridiculous \"affected\" children they get for American movies (i.e. the \"Pepsi\" girl) are so unbelievable and fake. Manuel is so realistic as Moncho. So are the other actors. I don't necessarily agree with the way that Cuerda rushed the ending, but I certainly wouldn't want to take away any time in portraying the lives of everyone involved. Maybe he should have made it a little longer as not to rush the ending. Although I will say that one of my favorite things about foreign films is that they are so NOT \"Hollywood\" that you never really know what to expect. Unlike the trite, unbelievable, over-acted, high budget American films and their overpaid actors which usually just leave a bad taste when I exit from the theatre. This is an historical piece that absolutely shames \"the Patriot\". It's so nice to see that a movie doesn't have to change history to show us the past and entertain us at the same time!",
         "What a great film! It puts the Spanish Civil War in perspective and shows how awful living under \"el franquismo\" was going to be. You can feel the exhilaration of living under the Republic and the darkness the country begins to slide into. Spanish film, overshadowed by Pedro Almodovar's quirky film, is really coming into its own and, unfortunately, is often overlooked and undervalued. The settings are true to the era, capturing the feel of Spain in the 1930s. The acting is superb, and the script is great. Plus, there is no overdone drama. The child actor is adorable without being made the object of cuteness, and Fernando Fernan Gomez is lovable without being sappy or sentimental. All I can say is \"Wow!\"",
         "Interesting and thought-provoking drama set during Spanish Civil War and filmed on wonderful landscapes from Galicia . For a kid named Moncho (Manuel Lozano) starts a new life , he begins school , there he has a sensible and aging teacher named Don Gregorio (Fernando Fernan Gomez) , a Republican veteran like his daddy . He makes a friend in the little village called Roque , Moncho starts to figure out some mysteries about life , and , with his older brother, a budding saxophone player, he makes a voyage with the band called ¨The Blue Orchestra¨ from their village around in Galicia . He soon journeys into adulthood through a friendship with his teacher , forming bonds with new friends and walking on the idyllic fields . Armed with a rebellious nature, opposes life lessons from his father and his love for a little girl will open doors to a world of sensitive feelings that will make her trip turns into a tender , vital and unforgettable experience but also tragic . The screen livens up as love blossoms between Moncho and his little girlfriend and as a love for a teacher becomes evident and finally risked . But it's also the year that the Spanish Republic comes under fire from Franco revolt and country growing apart. As sides are drawn and power falls clearly to one side , the forces of fright , rebellion and treason alter profoundly what should be the pleasure of growing-up . Drama with historical and romantic elements ; including enjoyable performances and adequate set design . ¨Tongue of Butterflies¨¨ results to be other of the innumerable stories to deal with dramatic deeds regarding the Civil War background . A familiar theme about the global horrors of a fratricide war , impossible to forget to our cinema . An agreeable coming-of-age story plenty of enjoyable moments , moving feelings and tragic finale . Director Jose Luis Cuerda , also writes the interesting script along with prestigious screenwriter Rafael Azcona , Luis Garcia Berlanga's usual . Filmed in his usual formal and stylistic scholarship , without leaving a trace the thought-provoking issues , in terms of dramatic and narrative excitement . The flick can be defined as a realistic tragedy-drama , a romantic history , a historic fresco and a socio-political fable . The main problem has to face , beyond not being able to avoid falling into the politic pamphlet is precisely derived from the coldness of its staging , some slow-moving scenes and including some surprisingly and inadequate sexual scenes . Because the story needs a vibration more real than the one offered in this sometimes joyful as well as sad flick , though also contains humorous and enjoyable moments as when the children are gathered and play and enjoy themselves , the unforgettable scenes when the oldest brother plays saxophone in the presence of a Chinese girl and of course the stirring and moving ending . Anyway, it's is compensated with the great performances from Fernando Fernan Gomez and and the boy Manuel Lozano , interpreters who provided a considerable boost to the result . Jose Luis Cuerda is a great director of actors and the main players are complemented by a good cast of secondaries as Uxia Blanco , Gonzalo Uriarte , Elena Fernandez Guillermo , ¨Willy¨, Toledo, among others ; all of them forming a powerful human group of support cast and giving excellent interpretations . Special mention to magnificent musical score by Alejandro Amenabar who composes an evocative as well as sensitive musical score . Including a spotless pictorial cinematography by Javier Salmones and a willingness , almost perfect of the elements of each shot , every sequence , every space . Shot on north of Spain, where have been filmed the gorgeous landscapes , marvelously reflected on location in Ourense , Galicia . The film won several Goya Awards -Spanish Oscar- such as : Goya Best Screenplay - Adapted to Rafael Azcona , José Luis Cuerda and Manuel Rivas , Nominated Goya Best Actor Fernando Fernán Gómez , Best Cinematography to Javier Salmones and Best Costume Design to Sonia Grande , Best Editing to Ignacio Cayetano and Best Director to José Luis Cuerda and Best Film . This Fernando Bovaira production was professionally written/produced by Jose Luis Cuerda who also efficiently directed and resulted to get an acceptable success at Spanish Box office . Cuerda is a veteran professional , being his film debut ¨Pares and Nones¨ a typical Madrid comedy . He subsequently directed ¨El Bosque Animado¨ also with script by notorious Rafael Azcona and based on Wenceslao Fernandez Florez's novel . His most personal movies were two comedies with a peculiar and surrealist sense of humor titled ¨Amanece Que no Es Poco¨ and ¨Asi en el Cielo Como en Tierra¨. He followed directing failures as a drama titled ¨Viuda de Capitan Contreras¨ and more comedies as ¨La Marrana¨ and ¨Tocando Fondo¨ . His greatest success corresponds as producer , as he produced hits for Alejandro Amenabar as ¨Tesis¨ and ¨Abre Los Ojos¨, among others . This highly-acclaimed and successful movie titled ¨Lengua De Mariposas¨ has a rating as ¨better than average¨ , it's a beautiful and powerful film . Two thumbs up .",
         "I give this movie 10 points and even Woody Allen said he liked it. It's a very touching story about a child and his teacher in the period previous to the Spanish civil war. The movie is based on a novel , the screenplay is almost perfect .The performances , specially but one of the best Spanish actors ever Fernando Fernan Gomez as the teacher is amazing and one you will remember for a long long time and the child Manuel Lozano is at the same quality level of performance . I have seen this movie only once and I still remembered it now. José Luis Cuerda , the director , do a very good job and Alejandro Amenabar wrote the soundtrack.The characters are so well constructed you will identify with them. I recommend this movie . Don't miss it .",
         "A European import teaches us how simple and beautiful film can be. `Butterfly' or `Butterfly Tongues' (in some US markets) tells the delightful story of Moncho, a young boy's coming of age as his world opens up through the eyes of his beloved teacher, Don Gregorio. As the teacher brings the boy into the fascinating world of butterflies, the boy begins to emerge from his cocoon. But looming on the horizon is the surgence of a fascist regime that threatens to unravel their innocent world. In the summer of 1936, which is when the films takes place, the whole of Spain was intertwined in the struggle between the Mussolini inspired Nationalist Party and the Republicans. But as the rest of Europe was being over run by a couple different fascist regimes, Spain was trying desperately to prevent that outcome. The film `Butterfly' brings in these elements and lets these two main characters deal with the impending doom and the heart-breaking aftermath. The film also beautifully depicts these simple folks who are desperately trying to find their way in the world. From one side you have the teacher who is just trying to bring peace to his students and their world. And on the other a young boy trying to understand the gigantic world around him. The teachings of the butterflies are a metaphor for the change coming in Spain and in both of their lives. This metaphor rings cleverly through each character in the film which does beg the question did the teacher know about the coming conflict and was trying to say something subtly. After watching this film, I learned the character of Don Gregorio was played by a legendary Spanish actor named Fernando Fernan Gomez. I could see even before I knew who he was that this man is amazing. I haven't seen this kind of subtle grace since Sir John Gielgud. I wish I had a teacher like him in my life. (4 of 5) So Says the Soothsayer. (Now Playing)",
         "Spoilers may be here. If you have been spending so much time in movie theaters that the sensation of being human and relating to other people has become only a musty, slightly irritating memory-- a peskily entreating pebble in the shoe of your desire to be at the center of the universe-- this film will refresh you. It will also change your irritation to tears, which may hurt a bit, but you were due for some sort of change anyway, yes? The ending is a stunning Citizen Kane-caliber twist. At fade-to-black, I think a lot of the people around me --and me too -- just sat and blinked up our tears as best we could, snuffling as quietly as possible before the house lights came up. It ends as a very weepy, cleansing film, really, and that is how I usually recommend it to friends. The politics and the rest are all very nice, and may make you feel smarter-- for knowing something about Spain's political history and being able to nod knowingly all through the film, or on the other hand, for simply sitting through a film that pays lip service to some sort of politics(this sort of posturing still gets the chicks on some campuses, or so they tell me). But the emotions at the core of this film are where it comes from and what it is about, make no mistake. More power to it for that, for having the nerve to possess more heart than a diatribe."
      ],
      "genres": [
         "Drama",
         "Music",
         "War"
      ],
      "productionCompanies": [
         "Canal+ España",
         "Las Producciones del Escorpión",
         "Sociedad General de Televisión (Sogetel)"
      ],
      "summaries": ["For Moncho, it's an idyllic year: he starts school, he has a wonderful teacher, he makes a friend in Roque, he begins to figure out some of the mysteries of Eros, and, with his older brother, a budding saxophone player, he makes a trip with the band from their town in Galicia. But it's also the year that the Spanish Republic comes under fire from Fascist rebels. Moncho's father is a Republican as is the aging teacher, Don Gregorio. As sides are drawn and power falls clearly to one side, the forces of fear, violence, and betrayal alter profoundly what should be the pleasure of coming of age."],
      "budget": 0
   },
   "movielensId": 3746,
   "movielens": {
      "languages": [
         "Català",
         "Latin",
         "Español"
      ],
      "releaseDate": "1999-09-24",
      "dvdReleaseDate": "2001-02-20",
      "directors": ["José Luis Cuerda"],
      "runtime": 96,
      "movieId": 3746,
      "title": "Butterfly",
      "mpaa": "R",
      "actors": [
         "Fernando Fernán Gómez",
         "Manuel Lozano",
         "Uxía Blanco",
         "Gonzalo Uriarte",
         "Alexis de los Santos",
         "Jesús Castejón",
         "Guillermo Toledo",
         "Elena Bagutta",
         "Tamar Novas",
         "Lara López",
         "Tatán",
         "Roberto Vidal Bolaño",
         "Celso Parada",
         "Celso Bugallo",
         "Antonio Lagares",
         "Alberto Castro"
      ],
      "imdbMovieId": "0188030",
      "originalTitle": "La lengua de las mariposas",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["JSgUBrnRpAk"],
      "plotSummary": "The film centres on Moncho and his coming-of-age experience in Galicia in 1936. Moncho develops a close relationship with his teacher Don Gregorio who introduces the boy to different things in the world. While the story centres on Moncho's ordinary coming-of-age experiences, tensions related to the looming Spanish Civil War periodically interrupt Moncho's personal growth and daily life.",
      "tmdbMovieId": 31023,
      "avgRating": 3.77057,
      "releaseYear": "1999",
      "numRatings": 401,
      "posterPath": "/yEgUOehlMtK9LfZjvYr0bQn9d2.jpg"
   }
}