{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "sport",
         "id": 6075
      }],
      "imdb_id": "tt0165384",
      "video": false,
      "title": "The Match",
      "recommendations": [
         19059,
         26116
      ],
      "backdrop_path": "/f3A1eHQbNJdQgwRwSzFlPC94zrk.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "Wullie Smith",
               "gender": 0,
               "credit_id": "591f33bb92514149f3035fe6",
               "name": "Max Beesley",
               "profile_path": "/cLs83XVtABy16ZcWerOg9qjLy96.jpg",
               "id": 66587,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Sheila Bailey",
               "gender": 1,
               "credit_id": "52fe45b8c3a36847f80d6bd1",
               "name": "Isla Blair",
               "profile_path": "/aqHLIxtiB7TfFVp68vcQLVEdRNu.jpg",
               "id": 749,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Billy Bailey",
               "gender": 2,
               "credit_id": "52fe45b8c3a36847f80d6bd5",
               "name": "James Cosmo",
               "profile_path": "/523gSqAG9eSSNmKexFFZYh38SxL.jpg",
               "id": 2467,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Gorgeous Gus",
               "gender": 2,
               "credit_id": "52fe45b8c3a36847f80d6bcd",
               "name": "Richard E. Grant",
               "profile_path": "/jMnSjjPQwCOAJ1kPRXLbh0WnsPa.jpg",
               "id": 20766,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Rosemary Bailey",
               "gender": 1,
               "credit_id": "52fe45b8c3a36847f80d6bd9",
               "name": "Laura Fraser",
               "profile_path": "/umgqZQNAqE78jFfg1H1nPtaO41Y.jpg",
               "id": 42279,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Big Tam",
               "gender": 2,
               "credit_id": "591f33fa925141482f03606b",
               "name": "Ian Holm",
               "profile_path": "/27SAk1v043GdOeAxT5pPoMUYhGg.jpg",
               "id": 65,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Scrapper",
               "gender": 2,
               "credit_id": "52fe45b8c3a36847f80d6bdd",
               "name": "David Hayman",
               "profile_path": "/tXhC9zlniU4SYpjOcMKxDIHdQBB.jpg",
               "id": 54014,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Buffalo",
               "gender": 2,
               "credit_id": "591f3439c3a368723d03835c",
               "name": "Tom Sizemore",
               "profile_path": "/soINOuacuiThRb2LyPD4tTWve7C.jpg",
               "id": 3197,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Piss Off",
               "gender": 2,
               "credit_id": "591f33d9c3a368723d038322",
               "name": "Neil Morrissey",
               "profile_path": "/m4JIPGagmc0c6Psk2a2TdRHdskX.jpg",
               "id": 26862,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Mechanic",
               "gender": 2,
               "credit_id": "591f33e89251414ab1034f15",
               "name": "David O'Hara",
               "profile_path": "/zPWpTV19nPLawd1E9A1jUDdcT2H.jpg",
               "id": 2482,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Danny Van Boy",
               "gender": 2,
               "credit_id": "591f342e9251414add0354a9",
               "name": "Iain Robertson",
               "profile_path": "/yRpfwDD2RNJhFjS7RXKXYlJIPDb.jpg",
               "id": 30437,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Dingus",
               "gender": 2,
               "credit_id": "591f344e9251414a57034914",
               "name": "Michael Nardone",
               "profile_path": "/vmKEoxWWKqTQvPX4joR3m0FKeHY.jpg",
               "id": 175154,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Tommy",
               "gender": 2,
               "credit_id": "591f34119251414add03548b",
               "name": "Bill Paterson",
               "profile_path": "/lLIPguoZJZeZ04niI4PaG1cv3Xf.jpg",
               "id": 104795,
               "order": 12
            },
            {
               "cast_id": 21,
               "character": "Dead Eye",
               "gender": 2,
               "credit_id": "591f34a0c3a3687a64036798",
               "name": "Gary Lewis",
               "profile_path": "/3pfclDPaKmgSpmxIo8bMXNAgLdE.jpg",
               "id": 480,
               "order": 13
            },
            {
               "cast_id": 22,
               "character": "Happy Feet",
               "gender": 2,
               "credit_id": "591f34c892514149900366c9",
               "name": "Ron Donachie",
               "profile_path": "/ujpKDxhCquDw1BzqxUxBT1aWJbD.jpg",
               "id": 63141,
               "order": 14
            },
            {
               "cast_id": 8,
               "character": "John MacGhee",
               "gender": 2,
               "credit_id": "52fe45b8c3a36847f80d6be1",
               "name": "Pierce Brosnan",
               "profile_path": "/1JXL0zrA26JjdoX8sqf57fJRDVM.jpg",
               "id": 517,
               "order": 15
            },
            {
               "cast_id": 9,
               "character": "Patsy Kennedy",
               "gender": 1,
               "credit_id": "570ae039c3a3684f41000c4d",
               "name": "Samantha Fox",
               "profile_path": "/cyeSasluoBDqVTvKSYxmXXqjyBh.jpg",
               "id": 218015,
               "order": 16
            },
            {
               "cast_id": 18,
               "character": "Carol McGhee",
               "gender": 0,
               "credit_id": "591f345f925141482f0360a9",
               "name": "Sally Howitt",
               "profile_path": null,
               "id": 1626719,
               "order": 17
            },
            {
               "cast_id": 19,
               "character": "Charlie",
               "gender": 0,
               "credit_id": "591f3476c3a3687a8e034ea3",
               "name": "Jonathan Watson",
               "profile_path": null,
               "id": 1243493,
               "order": 18
            },
            {
               "cast_id": 20,
               "character": "Arrow",
               "gender": 0,
               "credit_id": "591f3492925141485e038e28",
               "name": "Andy Gray",
               "profile_path": null,
               "id": 1736676,
               "order": 19
            },
            {
               "cast_id": 23,
               "character": "Lefty",
               "gender": 0,
               "credit_id": "591f34e4c3a3687a8e034ef5",
               "name": "Paul Doonan",
               "profile_path": null,
               "id": 1231415,
               "order": 20
            },
            {
               "cast_id": 24,
               "character": "Righty",
               "gender": 0,
               "credit_id": "591f34f9c3a36879120326bb",
               "name": "Mark O'Hare",
               "profile_path": null,
               "id": 1218549,
               "order": 21
            },
            {
               "cast_id": 25,
               "character": "Growler",
               "gender": 2,
               "credit_id": "591f3516925141485e038ea1",
               "name": "Gary McCormack",
               "profile_path": null,
               "id": 16632,
               "order": 22
            },
            {
               "cast_id": 26,
               "character": "Anna Smith",
               "gender": 1,
               "credit_id": "591f35289251414990036717",
               "name": "Hope Ross",
               "profile_path": null,
               "id": 1698438,
               "order": 23
            },
            {
               "cast_id": 27,
               "character": "Nancy No Pants",
               "gender": 0,
               "credit_id": "591f353dc3a368774e0389c0",
               "name": "Russell Barr",
               "profile_path": null,
               "id": 3303,
               "order": 24
            },
            {
               "cast_id": 28,
               "character": "English Harry",
               "gender": 0,
               "credit_id": "591f355392514149f3036109",
               "name": "Chris Symes",
               "profile_path": null,
               "id": 25456,
               "order": 25
            },
            {
               "cast_id": 29,
               "character": "Pasty Face",
               "gender": 0,
               "credit_id": "591f35699251414add035588",
               "name": "Edward McQuillan",
               "profile_path": null,
               "id": 1819847,
               "order": 26
            },
            {
               "cast_id": 31,
               "character": "Himself",
               "gender": 0,
               "credit_id": "591f35b29251414add0355b5",
               "name": "Alan Shearer",
               "profile_path": "/azYQCsixe8XucyMgpD1AGEOd3ey.jpg",
               "id": 1225217,
               "order": 27
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45b8c3a36847f80d6bc3",
               "name": "Mick Davis",
               "profile_path": "/brlM60xbZ5BenwznK2IHY90z1Bk.jpg",
               "id": 59248,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45b8c3a36847f80d6bc9",
               "name": "Mick Davis",
               "profile_path": "/brlM60xbZ5BenwznK2IHY90z1Bk.jpg",
               "id": 59248,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.338436,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 41160,
      "vote_count": 6,
      "budget": 0,
      "overview": "The Match is a romantic comedy set against the story of a grudge football match between two pubs. The prize for the winner of the centenary match is the the closure of their opponent's bar. The Match was mainly filmed around Straiton in Ayrshire.",
      "similar": [
         10393,
         9655,
         9291,
         2300,
         4942,
         11287,
         22881,
         8923,
         10637,
         13416,
         323677,
         86130,
         37136,
         9614,
         9390,
         920,
         42888,
         9472,
         12163,
         11770
      ],
      "original_title": "The Match",
      "runtime": 95,
      "poster_path": "/o6Yr8Uquruxz5tBrSJGbtBN28Eo.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1999-08-13",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "It's a game of two pubs!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mick Davis"],
      "runtime": 95,
      "synopsis": null,
      "writers": ["Mick Davis"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0165384/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNDg5ODAxMzcxOF5BMl5BanBnXkFtZTcwMjg4ODgxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Max Beesley, Isla Blair, James Cosmo | See full cast and crew »"],
      "reviews": [
         "Now this one is a remarkable little gem. The plot is very sympathetic, it has no great ambitions to prove it's a box-office topper, it has a kindness and warmth many a film lack these days, or even, I dare say, these decades. This film is proof that we still need a British film industry, for it has a very strong cast, a very well-written script, and very human elements to deal with. The film really aims at your heart and hits. It's funny, it's real, it is alive. The British these days are really very good at making films that are about all things human but which are not boring; this one is a very good example of it along with Notting Hill, Lock, Stock and Two Smoking Barrels, and The Full Monty (yes, NH is actually US-backed, but it is typically English). When Americans try to be this life-like, the result is as boring as Dancer, Texas, pop. 81. I had just picked this one up for it starred Max Beesley that I had liked at the TV series Tom Jones and the ever-charming Richard E. Grant. I am very pleased that I made a very right decision not only for the two were great to watch -especially Beesley proves he is a very good and versatile actor and he manages a near-perfect West of Scotland accent unlike Richard E. Grant- but for it is a very good film as well. The acting's brilliant, the main event so small and unimportant that it proves life is not actually about saving the world from great enemies of humanity but is a structure made out of small, delightful and not-so-delightful elements; and that love, friendship, competition, are all nice, human desires and are there to be shared. This is one hell of a feel-good film and I hope anyone seeing this review will watch it. It'll make you feel good and human, too. This is the very film if you're feeling bored of all the Cruises, Damons, Willises of Hollywood, for it proves how you can be a very good actor and still not play-act as well. I definitely recommend this to anyone who still thinks cinema is about things human and not necessarily expensive and superhuman/surreal/ridiculous.",
         "THE MATCH is in the same category of \"little UK films\" as CALENDAR GIRLS, THE ENGLISHMAN WHO..., LOCAL HERO, etc. which depend on a likable and quirky set of characters to drive a plot that you KNOW will \"all turn out right\" from the first frame. As many have pointed out, there's not much you couldn't guess about the plot as it proceeds, but I enjoyed being along for the ride. Watching Bill Paterson, Ian Holm, Richard E. Grant and the others obviously enjoying their roles was a pleasure. The slightly odd Celtic soundtrack by Harry Gregson-Williams, plus the interesting choices of source music, added an extra layer of enjoyment. Just ignore the plot holes (would there really have been a bar called L'BISTRO in 1899?) and have yourself a jolly good evening of light fun.",
         "Wullie Smith (Max Beesley) is a handicapped young man with a serious trauma: his brother Johnny died when they were young while climbing a mountain because of his fault. He works as a milkman in a tiny city in Scotland and has a crush on Rosemary Bailey (Laura Fraser). However, he is too shy to declare his love to her. Every night, Wullie meets his friends in a pub called `Bennys'. This place is the fruit of a bet made one hundred years ago, against another pub, `Le Bistro'. In that time, their owners firmed a stake: Bennys would never win Le Bistro in one hundred soccer games along one hundred years. The winner of the bet would take possession of both pubs. In the present, Bennys has lost the previous ninety-nine games, and needs desperately to win the last game. I bought this DVD maybe two years ago in a sale offer, and I have not paid attention to it until today. I have just seen it, and it is a delightful and exciting movie. The story is indeed a comedy, but has also drama and romance. The cast has a great performance and makes the viewer cheers in many situations. I am Brazilian, land of the soccer (The British invented this game, and we improved it), and five times world champion, and I love soccer. This movie has absurd, such as the couch, who is handicap, decides the game shooting a penalty in the end of the match, but who is caring to that? The important thing is `the good guys' win `the bad guys', and this is achieved. It is a very funny situation, because in Brazil, we soccer fans have a saying, which is: `Penalty is so important that the president of the club should be responsible for shooting it'. Therefore, for us Brazilians, it is very funny the foregoing mentioned situation. Pierce Brosnan has a surprisingly participation in the end of the story. This film is highly recommended for fans of soccer. My vote is eight. Title (Brazil): `A Aposta' (`The Bet')",
         "I enjoyed this movie thoroughly. The only reason I gave it an 8 is because of the \"love\" interests they try and through it. If they would have just kept the movie about football between the two pubs, then it would have made a 10 easy. Funny and entertaining, just can't get better than that. In all honesty, the football scene is way too short for the build up. I will admit, the ending is predictable. It starts off OK, builds, plateaus, then ends predictably. I recommend this to anyone who loves football. However it does not portray small town Scottish life very well. Rent it or buy it, you'll love it. I give it 3 thumbs up.",
         "It's undeniable that this kind of plot was worked and reworked in many movies but \"The Match\" has a wonderful locale and a decent cast (also starring the American Tom Sizemore). The team of misfits subject is here handled focusing on quirky characters and on a romantic basis (Willie is still in love with his childhood friend Rosemary). This small-town comedy - with a little Pierce Brosnan cameo - dealing with the underdog theme and the football/soccer popularity, could somehow remind other working class stories but it's completely different from Ken Loach pictures because is less centered on social problems and more on a melhancoly atmosphere. However it works",
         "Although this is clearly low budget, and full of sports clichés (also a goofy plot idea), the music is wonderful, and I thoroughly enjoyed the show. The opening scene to \"Hot Love\" by T Rex hooked me, and the scene of the underdog team taking the field is also a delight. \"FBI\" by The Shadows is a musical treasure! I rarely notice music in movies, but this show had me checking all the musical credits at the end. The love story is more than a bit juvenile, but again it is well-intended, and it did not detract from the story. Sometimes coarse language will put off some viewers, but this is still a good-hearted movie. \"Fever Pitch\" is of course a better soccer show, and this will never be remade as a baseball show, but you do not need to be a soccer fan to enjoy it.",
         "The Match is a light, airy, slice of life movie that's capped off by one of those clichéd \"final game\" type sports movie scenes. First, the good stuff. The Match generally has excellent cinematography, as Mick Davis takes full advantage of the endless rolling highlands that make up Scotland. There is always a feeling of freedom in shots of Inverdoune's people and buildings as the director gives his characters space to move through out the shot. Wullie floats through the countryside on his bike, children run free through the street, sunlight streams across wide lakes. There is nary a crowd to be seen outside. Benny's bar is also an excellent set piece. I don't even drink and I would love to hang out at Benny's. The director uses the lighting to create a great deal of warmth in the well-aged wooden walls and tables. There are also lot of quirky details in the movie that get a chuckle. The man and his son having to brake their bread van by jumping out and pushing against it. The \"gets me hard\" mechanic mentioning why he chose the violin. Buffalo attempting to ride a bike drunk. One detail in particular though, struck me as really above and beyond the usual attention to detail. One character in the film (I don't know his name) always wears an eye patch and in the Hawaiian party at the bar he replaces it with some combination of grapes and leaves on a strap. Absolutely hilarious and I commend Davis for going the extra mile there. Now for the bad stuff. Wullie and friends are a lovable bunch of losers. I never actually caught everyone's name other then Wullie, Buffalo, Rosemary, and Gorgeous George but the movie never forced me to learn about them as very little time is spent developing anyone outside of Wullie, and even he is still very much a piece of cardboard as a character. Wullie's mother is probably depressed but we're never really told anything else beyond that. Rosemary is going off to college or a new job but she mainly exists as a symbol of progress for Wullie, the only reason he'd have to leave his village. Gorgeous George is a generic rich scumbag complete with the usual villain clichés of misplaced vanity, snarling voice, and evil henchman in the form of Le Bistro's soccer team. The last act of the film is easily the worst part of the movie. Wullie's mother suddenly reveals he is the great grandson of Benny himself (eh?!) and he discovers Benny's long lost uniform upstairs in the attic. Fast Forward, time for the match. Wullie's team manages to arrive just before they would of had to forfeit, all in matching Benny's uniforms (where the heck did the other ones come from?!). The game starts. The Bistro team is obviously better prepared having witnessed them practicing through out the entire film and they jump out to an early 2-0 lead. No surprise there, we've only seen the Benny's team practice twice and they still look horrible. But UH OH, here comes an avalanche of sports movie clichés. Wullie's mother gets off her duff and arrives with words of encouragement (Unexpected-Love-From-A-Formerly-Cold-Parent). Wullie shouts really loudly and gives THE SPEECH (+100-To-Sports-Talent-Pep-Talk). The formerly indifferent former soccer pro joins Wullie's Team (Reluctant-Ringer-Finally-Decides-To-Join). Wullie's team scores two quick goals and miraculously outplays Bistro. The Bistro captain takes out former soccer pro's knee (Dirty-Move-Takes-Out-The-Star) and it's up to Wullie to take the penalty kick with 15 seconds left (A-Chance-For-Redemption). Wullie draws upon the nearly random memory of his brother falling to his death while they were kids, and manages to score. Yay. Ironically the underdog sports team in this movie has more to play for then nearly any sports team I've seen. If they lose, their bar gets shut down and demolished by Gorgeous George. As it's set up in the film, that would largely mean the end of any kind of life for the pup-goers and I truly believed that. These people NEED that bar. It's too bad they had to cheapen the game so much by drowning it in clichés and squeezing it into the last 10 minutes of the movie. Overall, a feel-good type movie that had potential to be a lot more.",
         "This is a fantastic film set in a fictional location in the Scottish Highlands. Basically it is about two pub teams and a historic rivalry based on a game of football. Benny's bar are really the \"good guys\", but are crap at football. L'Bistro is the posh upper class pub, but they are the \"bad guys\". The teams have played 99 games in a row, and if they loose the 100th game, they also loose the pub, and their livelihood. This film does have a lot of bad write ups, but I think it is a brilliant film. Simple, yes. Predictable, yes. But still a great film. The only drawback is few of the cast are actually Scottish, and we have to listen to their painfully poor Scottish accents.",
         "Scottish milkman Wuille's life is in a bit of turmoil. His sweetheart has returned to the village and his local pub is at risk from being shut down as a result of a century old bet with another pub to win a football match. With his pub's group of thugs seemingly having no chance Wuille decides to move his life on by making his feelings clear to Shelia and coaching his team to victory. With the success of The Full Monty, everyone wanted to make a British comedy that would cost little but hit big. The Match is one of those attempted clones but it doesn't quite work as well as it could do. The plot is promising but little of it carries through. The subplots and history behind the main characters isn't really followed \u0096 for example the loss of Wuille's brother or the relationship with Shelia, neither are fully explored. The comedy is of the amusing but not hilarious type with some good characters but nothing to write home about. There are no jokes that really stand out and rather the film has a general air of being bemused rather than funny. It all makes for a watchable film that will quickly fade from your memory. The use of music makes it feel like every other Brit comedy of recent memory, the tunes of nice but it just sticking to the formula and shows no real evidence of invention. The cast are OK but don't really stand out, they are all pretty average. Beesley is an average lead but love interest Blair does little but look pretty (although she does do it well!). Grant is camp and OTT but is good value. The cast of the two pubs are easily drawn comedy characters but none of the cameos really work. Sam Fox is nice to look at but does nothing, Shearer is simply pointless, Ian Holm is miscast but Brosnan is reasonable as he appears to be mocking his involvement a little! It doesn't really work but the gentle air of predictable amusement is just enough to make this light enough to pass 90 minutes. Just don't expect anything more than that \u0096 there is a reason why this was not a global sleeper hit.",
         "The Match is a comedy in the same vein as The Full Monty. It falls short of the latter in terms of sustained laugh-aloud comedy but has a naive sweetness and a fairly exciting footballing climax. The calibre of the cast is excellent - perhaps to the film's ultimate detriment - and the plot both light and fantastic. The comedy remains constant but never belly-wrenching; the romance sweet but never Romeo & Juliet-threatening; and the football match climax enjoyable but never over-whelming. Having said all that, the film feels like it might have worked more successfully as an out and out kids' movie. The comedy is fairly accessible (if a little UK-specific) and the sporting battle widely appealing to children. Add to this cameos from England's most famous footballer and one of the world's biggest stars (I'm not spoiling the surprise) and there is much to be said in favour of this small, enjoyable film."
      ],
      "genres": [
         "Comedy",
         "Romance",
         "Sport"
      ],
      "productionCompanies": [
         "Allan Scott Productions",
         "Irish DreamTime",
         "Propaganda Films"
      ],
      "summaries": [
         "The Match is a contemporary romantic comedy, set in the idyllic Highland village of Inverdoune. Wullie Smith, still carrying the physical and emotional scars of the childhood death of his younger brother, is the village milkman. A young man whose potential is concealed his gently diffident exterior, Wullie is locally known for his remarkable T.F.R. (Total Football Recall) and for his not-very-secret love for Rosemary Bailey, the breathtaking daughter of Bill Bailey, a local farmer with a curious affection for his cows. Rosemary has returned briefly to her home with a college degree before she leaves again to pursue a career in the big city. The single-street village has only two pubs - the ramshackle delights of Benny's Bar, spiritual home of its charmingly eccentric clientele and the sterile modernity of Le Bistro, owned by former professional footballer and preening narcissist, George Gus. But Benny's Bar may soon be lost forever. A bet made to settle a feud between the original owners of Benny's Bar and Le Bistro was made long before anyone living in the village today can remember. The ancestral feud is to be finally resolved by the result of the annual football (soccer) contest between the two bars in this hundredth year of the contest. Past form indicates poor prospects for the Benny's Bar team which has lost for 99 years in a row. But it is only the result of this, the hundredth game, which will determine which bar is to be closed forever by the winning side.",
         "Two Scottish pub soccer teams play each other in order to resolve a century-old grudge. Whoever wins the game gets to keep the other team's pub."
      ],
      "budget": 0
   },
   "movielensId": 3748,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-08-13",
      "dvdReleaseDate": null,
      "directors": ["Mick Davis"],
      "runtime": 95,
      "movieId": 3748,
      "title": "The Match",
      "mpaa": null,
      "actors": [
         "Max Beesley",
         "Isla Blair",
         "James Cosmo",
         "Richard E. Grant",
         "Laura Fraser",
         "Ian Holm",
         "David Hayman",
         "Tom Sizemore",
         "Neil Morrissey",
         "David O'Hara",
         "Iain Robertson",
         "Michael Nardone",
         "Bill Paterson",
         "Gary Lewis",
         "Ron Donachie",
         "Pierce Brosnan",
         "Samantha Fox",
         "Sally Howitt",
         "Jonathan Watson",
         "Andy Gray",
         "Paul Doonan",
         "Mark O'Hare",
         "Gary McCormack",
         "Hope Ross",
         "Russell Barr",
         "Chris Symes",
         "Edward McQuillan",
         "Alan Shearer"
      ],
      "imdbMovieId": "0165384",
      "originalTitle": "The Match",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["5NdX5Mn0V7U"],
      "plotSummary": "The Match is a romantic comedy set against the story of a grudge football match between two pubs. The prize for the winner of the centenary match is the the closure of their opponent's bar. The Match was mainly filmed around Straiton in Ayrshire.",
      "tmdbMovieId": 41160,
      "avgRating": 3.5,
      "releaseYear": "1999",
      "numRatings": 34,
      "posterPath": "/o6Yr8Uquruxz5tBrSJGbtBN28Eo.jpg"
   }
}