{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "baron",
            "id": 9552
         },
         {
            "name": "childhood",
            "id": 157955
         }
      ],
      "imdb_id": "tt0189142",
      "video": false,
      "title": "Time Regained",
      "recommendations": [
         104239,
         88034,
         64441,
         78117,
         85904,
         42631,
         42029,
         92663,
         42131,
         104338,
         45000,
         36236,
         4195,
         19120,
         54563,
         113458,
         156231,
         46799,
         68757,
         90908
      ],
      "backdrop_path": "/A1UTbhAncaTXqZIHTFn8IWRE32Z.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Odette de Crecy",
               "gender": 1,
               "credit_id": "52fe4733c3a36847f8128b0f",
               "name": "Catherine Deneuve",
               "profile_path": "/6w0mcMkjLPSIj9iXMKNinxIHRyH.jpg",
               "id": 50,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Gilberte",
               "gender": 0,
               "credit_id": "52fe4733c3a36847f8128b13",
               "name": "Emmanuelle Béart",
               "profile_path": "/dICNGDe2Sgz73Febl0TJZpEKO9f.jpg",
               "id": 4885,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Morel",
               "gender": 2,
               "credit_id": "52fe4733c3a36847f8128b17",
               "name": "Vincent Pérez",
               "profile_path": "/elPFKCVOZyMni2hx7mLlaYkyifD.jpg",
               "id": 20239,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Le Baron de Charlus",
               "gender": 2,
               "credit_id": "52fe4733c3a36847f8128b1b",
               "name": "John Malkovich",
               "profile_path": "/tCtiWZbKKRgHhLxFCIPfveYAsdc.jpg",
               "id": 6949,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Saint-Loup",
               "gender": 2,
               "credit_id": "52fe4733c3a36847f8128b1f",
               "name": "Pascal Greggory",
               "profile_path": "/1J3QISHIZg6C1xkhvshtX2lEiDG.jpg",
               "id": 16923,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Marcel Proust",
               "gender": 2,
               "credit_id": "52fe4733c3a36847f8128b23",
               "name": "Marcello Mazzarella",
               "profile_path": "/dfWKDbbhhAeocP6Es2mKEKYHjF4.jpg",
               "id": 107624,
               "order": 5
            },
            {
               "cast_id": 20,
               "character": "Madame Verdurin",
               "gender": 1,
               "credit_id": "584c116292514133a800aae7",
               "name": "Marie-France Pisier",
               "profile_path": "/ev1Z86iGonOJ8v3yGR7alaak0gg.jpg",
               "id": 3536,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Albertine",
               "gender": 1,
               "credit_id": "584b536692514133b10046f8",
               "name": "Chiara Mastroianni",
               "profile_path": "/mBrsvkCKYEM2RAyDpLxx3Tdge1F.jpg",
               "id": 20710,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Madame de Farcy",
               "gender": 1,
               "credit_id": "584b5376c3a368397a00491f",
               "name": "Arielle Dombasle",
               "profile_path": "/yl6RniErLOkQKxUJjn791WBJB5O.jpg",
               "id": 28626,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Oriane de Guermantes",
               "gender": 1,
               "credit_id": "584c114292514133bd00afcf",
               "name": "Edith Scob",
               "profile_path": "/DbTl7eoRq2rFmRbXuIi9i2lJjz.jpg",
               "id": 27980,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Rachel",
               "gender": 1,
               "credit_id": "584b538ec3a36839870045b2",
               "name": "Elsa Zylberstein",
               "profile_path": "/bw1bIuyfyOyxRlx2qIKk4AwQLTU.jpg",
               "id": 39195,
               "order": 10
            },
            {
               "cast_id": 23,
               "character": "Bloch",
               "gender": 0,
               "credit_id": "59eed5e1c3a3680ae9021965",
               "name": "Christian Vadim",
               "profile_path": "/cmMGUMb59bk678rlSGGNbE2Nngs.jpg",
               "id": 96968,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Le Prince de Foix",
               "gender": 2,
               "credit_id": "584c112e92514133ab00b242",
               "name": "Melvil Poupaud",
               "profile_path": "/moYCrYGhIP4QTDmkED2lMGxMuOW.jpg",
               "id": 26100,
               "order": 12
            },
            {
               "cast_id": 21,
               "character": "Goncourt",
               "gender": 0,
               "credit_id": "584c1196c3a3682c3a001477",
               "name": "Alain Robbe-Grillet",
               "profile_path": "/1lLE5z8NbKpvs7qgdxVVf8KbMaR.jpg",
               "id": 34590,
               "order": 13
            },
            {
               "cast_id": 22,
               "character": "Café de la Paix's head waiter",
               "gender": 0,
               "credit_id": "584ce1ba9251411e2f006a1d",
               "name": "Jean-François Lapalus",
               "profile_path": null,
               "id": 579265,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4733c3a36847f8128ae1",
               "name": "Raúl Ruiz",
               "profile_path": "/5vwVDnEIhCEs6sg51JFoArAXqLS.jpg",
               "id": 121585,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4733c3a36847f8128ae7",
               "name": "Marcel Proust",
               "profile_path": null,
               "id": 1110542,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe4733c3a36847f8128aed",
               "name": "Gilles Taurand",
               "profile_path": null,
               "id": 50538,
               "department": "Writing",
               "job": "Scenario Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4733c3a36847f8128af3",
               "name": "Raúl Ruiz",
               "profile_path": "/5vwVDnEIhCEs6sg51JFoArAXqLS.jpg",
               "id": 121585,
               "department": "Writing",
               "job": "Scenario Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4733c3a36847f8128af9",
               "name": "Ricardo Aronovich",
               "profile_path": null,
               "id": 22456,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4733c3a36847f8128aff",
               "name": "Jorge Arriagada",
               "profile_path": null,
               "id": 134463,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4733c3a36847f8128b05",
               "name": "Denise de Casabianca",
               "profile_path": null,
               "id": 23730,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4733c3a36847f8128b0b",
               "name": "Paulo Branco",
               "profile_path": "/8kbzoASh1fsk47JOHxSfcZssAyD.jpg",
               "id": 5268,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 2.164797,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         },
         {
            "iso_3166_1": "PT",
            "name": "Portugal"
         }
      ],
      "id": 47439,
      "vote_count": 13,
      "budget": 0,
      "overview": "Marcel Proust (1871-1922) is on his deathbed. Looking at photographs brings memories of his childhood, his youth, his lovers, and the way the Great War put an end to a stratum of society. His memories are in no particular order, they move back and forth in time. Marcel at various ages interacts with Odette, with the beautiful Gilberte and her doomed husband, with the pleasure-seeking Baron de Charlus, with Marcel's lover Albertine, and with others; present also in memory are Marcel's beloved mother and grandmother. It seems as if to live is to remember and to capture memories is to create a work of great art. The memories parallel the final volume of Proust's novel.",
      "similar": [
         8967,
         6171,
         14748,
         332872,
         7508,
         11313,
         27769,
         33680,
         8194,
         13384,
         157375,
         177945,
         438634,
         902,
         14506,
         56321,
         16248,
         28436,
         1660,
         33091
      ],
      "original_title": "Le temps retrouvé",
      "runtime": 169,
      "poster_path": "/ylTWJkN5GkwxOCsJPaDmeOv87Ep.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Gemini Films",
            "id": 6584,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "France 2 Cinéma",
            "id": 83,
            "origin_country": "FR"
         },
         {
            "logo_path": null,
            "name": "Les Films du Lendemain",
            "id": 1249,
            "origin_country": ""
         }
      ],
      "release_date": "1999-05-19",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": "FFR ",
      "directors": ["Raoul Ruiz"],
      "runtime": 169,
      "synopsis": null,
      "writers": [
         "Marcel Proust",
         "Gilles Taurand"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0189142/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzE0MDgwNjY4OF5BMl5BanBnXkFtZTcwNDMxMzQyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Catherine Deneuve, Emmanuelle Béart, Vincent Perez | See full cast and crew »"],
      "reviews": [
         "Spoilers herein. This is one of the most ambitious film projects I have seen, risky and successful. It is not successful Proust in my opinion, something different but similar. Proust used the magic of words to weave a life out of remembered fragments. That magic depends on the ability of the written word to generate images in our minds -- Proust found the ability to create these in such a way that they converge with recalled images (of ours, though the focus is purportedly his). This is a particular kind of selfgenerating self-referential art. No life should be without it. No literary life can. Film differs from literature of course, but most profoundly in this context. Film is already an image. Film images can converge with ones in our memories, but they are more anchored. And since they are generated for us, we have to follow rather than lead. Ruiz comes to this from a fabulist perspective, meaning he can make cinematic images less specific, more vague. The solution works: we are presented with a blizzard of characters, scant narrative footing and lots of folding: time folding, image folding, observer overlap. This way, the images we are given are softer and more pliable than usual and allow for something like the consciousness-skipping of Proust. But it is not the same: we watch someone creating a remembered life, but don't really participate in the intimate and shared way of the books. And instead of a book about a life, we have a film about a book about a life. That difference is significant in some ways: when we have Gilberte, we just can't help but fall in love with her a little ourselves. When the concert is fully underway, we see Marcel seeing something. The room shifts, and we know some manifold epiphany is underway, but don't `see' it ourselves. We participate in a cinematic experience, not a life. That life partially unfolds for us in images later, but we don't relive it. All of this is cast in a visual meditation. `In the Mood for Love' works some of this territory, as does `The Thin Red Line.' This differs in the inherent voyeurism and the magical reality created by one of the on-screen characters, and the striking music generated by another. Opening shots are promises. The titles are accompanied by a familiar vision of water over rocks. But it shifts downstream and cants before we know it, and then moves back upstream, telling us the whole idea right there. Then we have a remarkable bedroom scene that by itself is one of the strongest moments in film -- the dictation comes close to the genuine Proust effect, and the surreal movement of furniture against the camera are truly hypnotizing. There's one device that is used subtly, one that you would expect is pretentiously inflated. But it isn't. This is the `camera' that Ruiz gives Marcel: as a boy a lantern that freezes, himself frozen twice, certain ads, certain photos... several other images. Completely understated, and thus more powerful. Ted's Evaluation -- 4 of 4: Every visually literate person should experience this.",
         "At long, long last. In a year of false hopes and broken promises, here is the real thing, a genuine cinematic masterpiece that after one viewing you've only read the introduction. It's everything that art-house cinema is accused of - elitist, over-intellectual, precious, elliptical, methodically paced, privileging mise-en-scene over virtues like plot or motivated characterisation. It is also a model of literary adaptation that will hopefully, once and for all, put certain practitioners out of business; the most visually astonishing (not in the sense of merely beautiful, but achieving effects you didn't think possible), funny and emotional film in years, and the first new film I've wanted to squeeze to my heart since CHUNGKING EXPRESS. In one way at least, it's even an improvement on Proust's sublime novel, which frequently breaks off to offer remarkable guides on how to write and to live life. These are indispensable to anyone who wants to exist to the full as a human being, but, uncorrected when Proust died, they are often wearingly repetitive and confused. Ruiz finds economical, jaw-dropping, incisive ways to show what Proust wanted to say. Because this isn't anything so common as a film of the book - it is an interpretation, a deconstruction, a reimagining. Proust, like Nabokov, sets traps for the unwary reader, and because the narrator seems so convincingly Proustian in the detail, it's easy to confuse him with Proust in the spirit. But M. is a deeply flawed, unreliable narrator who does not always see what's in front of him, who, riven by jealousy, prejudice, snobbery, malady and self-laceration, is not always the most objective observer. Ruiz emphasises this by foregrounding the seeming differences between himself and Proust as artists: Proust advocates an active, conscious reclamation of ourselves and our pasts; Ruiz, a Surrealist, explores the Unconscious. Proust was the most notorious rewriter in the history of literature, every sentence subjected to the most rigourous scrutiny, yet he died without fully revising Le Temps Retrouve. This leaves the text filled with gaps, omissions, contradictions, 'mistakes', slips, an ultimate loss of control - the perfect ground for a Surrealist excavation. Ruiz reveals M.'s essential powerlessness, his yielding to the power of the Unconscious; M. thinks he makes a decision to discover the past; Ruiz shows from the very beginning of the film, how he has no choice. What Surrealism does best is to show the terrifying instability of the seemingly stable, everyday, domestic, fixed. This fits in with Proust's project, because his stepping outside of Time shows how amorphous Time is. A centuries-old society, with huge mansions and manors, inhabited by fixed personnages with fixed names and personalities, in a significant period (the Belle Epoque giving onto World War One) is actually shown to be deeply unstable, perceived as it is though the mind of M., who is constantly changing - his social status his body (through sickness), his self-perception and view of the world and of literature etc. The opening sequence is masterly illustrative. The real Proust lies in the near-dark in bed, wheezingly ill, reciting his work to his faithful servant, Celeste. Here is an image of wholeness, fact, legend - a great writer writes his great book. But the scene is riven with instability: Proust lies immobile in his bed, while his objects and ornaments move freely around the room. This is a motif that reverberates throughout the film, the elegant freedom of the dominating, crowding bibelots, and the rigid, sterile, geometrical movements of the people who are supposed to own them. But it also shows a heartening split between mind and body: while the latter lies inert and dying, the former remains vibrant and transformative. Where to begin with Ruiz's awe-inspiring masterwork? The sublime play with mirrors and cameras, revealing great truths about perception, deception, mediation, objectivity, subjectivity, revelation and concealment? The play of different selves throughout the film, where the monstrously aged, through memory, can return to their former beautiful selves, culminating in an astonishing climactic sequence where M. in his three guises (protagonist/narrator of the film (even this is split, narrated in voiceover by a different person), the author of the book-film, and himself as a young man that allows the other two to exist) as he wanders, Alice-like (a haunting, Surrealist presence thoughout the film) through the classical ruins of time, linked to the impossibility of one, fixed work of art? The complex analysis of role-play, on the one hand liberating one from a fixed self, on the other repressing one (in terms of social positoin, reputation etc.)? The role of of reenactment in the recovery of the past, and its transmutation through subjective perception? The subtle changes and omissions that Ruiz deliberately employs to interrogate the emphasis of Proust's work? The connection between voyeurism (existing in a society like being imprisoned in a panopoticon), and the necessary observation of the artist to reveal truth? Ruiz's canny casting, emphasising allusive qualities, e.g. mother and daughter Deneuve, and a hero played by a man with a similar name to their lover/husband? Alain Robbe-Grillet, doyen of formal games in country houses? Edith Scob, Franju muse of broken, fragile beauty, playing dessicated Oriane? the link between the narrator, director Patrice Chereau, and two of the film's stars who have also appeared in one of his films? The profusion of different artforms which combine to create a moment of such great emotion that I, with M. cried? The teasing play between the protagonist, his creator and this film's creator? The amusing variations on the theme of prostitution? The film's action actually only consists of three elaborate episodes, but the plot floods with the past and the future, the real and imagined, the fictional and historical (or, more correctly, meta-fictional), theory and practice. It should not be forgotten that there are other, simpler pleasures beloved of historical-film fans - the country-houses with their astonishing avenues; the town mansions with their vast halls; the choreography of the party scenes; the sublime costumes; the elaborate recreation of a time and place. The film is very funny as well as deeply emotional, and though pawns in a Surrealist game, the wonderful actors reveal great depth, although Marcello Mazzerella stands out as a hero more sympathetic than Proust's. But it is Ruiz who is the real star, locating the hidden meaning of the book with startling, disturbing, enigmatic, elegantly polished images, as well as a rare ravishing feel for both nature and artifice.",
         "Fans of 8-1/2 and Juliet of the Spirits (Fellini's two most Proustian films by way of Jung) take note: Here's another worthy contender to those two masterpieces. It damn near reaches their level and it sure looks expensive and ultra-authentic, and only time will tell if it holds up as well. If you've read some Proust (I've only read around a 1000 pages of 'The Guermantes Way' myself and it was at turns the toughest, the most excruciatingly boring and most deeply rewarding reading I've ever inflicted on myself), you will know exactly where this movie is coming from; if you haven't, make plans to read some later, but watch this movie with the knowledge that there is NO STORY IN THE CONVENTIONAL SENSE; it is about how a person's memory works and how and what it chooses to remember and forget and how all these different things effect each other, blah, blah. It aims for the spirit of the books and a taste of what their atmosphere is like, and knows that to even approach this humble end it must, at the very least, begin by pushing the means of the cinema to their limit. It is not stupid enough to think it can equal the intellectual effect of Proustian prose. That would be absurd and impossible. So how does Ruiz's film fare? Suffice it to say that it does not take long to realize that this not a pretentious film but a deeply thought out, planned, and fully realized one. If it manages to capture the spirit of Proustian investigation, it did not do this easily and don't expect to digest it in one or two viewings. You will certainly be immediately impressed though, I'll tell you that much. Be prepared to ACTIVELY participate rather than be DONE TO. There are constant shifts of time period between the different stages of Proust's life and the fully mobile camera never stands still for your convenience. The acting is top notch and multi-faceted all the way and the production design is magnificent. Although it certainly looks very expensive, I can't imagine anyone doing a better job with less, except maybe Truffaut (Jules and Jim) or Renoir (French CanCan). There are plenty of distractions along the way, especially the butt-gorgeous Emmanuel Beart for us helpless men of hetero persuasion, not to mention the jaw-dropping, classical beauty of Chiara Mastroianni in her one scene, which she steals. On second viewing, after having just watched the Coen brothers' ultra-subtle and hilariously clever 'Blood Simple,' I did vaguely detect some weaknesses that someone like Eric Rohmer or Rossellini and Scorsese in their prime would have been careful to authenticate to 3 dimensions; but they weren't noticeable enough to put your finger on right away. I have never seen another Ruiz film before, but I think that the greatest thing he did here was to let Proust's general sense of things, his ultra-cultured neurotic sensibility, become his co-director on the film. I'm sure, at the very least, he made all his actors read the book he was adapting and discussed it with them thoroughly. Just the experience of doing that will enrich the aspirations and imagination of any actor, because Proust's writing is all about going into long analyses of things that may seem trivial at first glance. All I can say is Ruiz really blew me away on this film and I can't wait to see what else he had up his sleeve all these years that I've been missing his movies.",
         "Le Temps Retrouve or Time Regained (1999): Starring Marcello Mazarella, Vincent Perez, Catherine Deneuve, Emmanuelle Beart, John Malkovitch, Pascal Gregory, Marie-France Pisier, Chiara Mastriani, Arielle Dombasle, Edith Scob, Elsa Zyberstein, Christian Vadim, Dominique Labourier, Phillip Genoud, Melvil Poupad, Mathilde Seigner, Jacques Pieler, Hele Surgere, Andre Engel, Georges Du Fresne, Lucien Pascal, Jerome Prieur, Bernard Paitrat, Jean Claude Jay, Director Raoul Ruiz \"In this book is written your life and the life of all men\" said the Angel of Death, \" to review it would take an eternity\"........... Based on Marcel Proust's \"Au Recherche Du Temps Perdu \" or \"Remembrance Of Things Past\", largely considered not only a classic of French literature but possibly the world's longest literary work, this is director Raoul Ruiz' stunning film adaptation, released in 1999. This film received numerous awards, and the Cannes Film Festival ate it up, much like one long French banquet, complete with French wine. True to the novels (Swann's Way, Guermantez, Swann In Love), we follow the life of Marcel Proust, beginning with the end, that is, his death. Wracked with consumption, he is on his deathbed and his mind drifts from memory to memory, reliving his life and encountering all the people in it. Veteran French actress Catherine Deneuve stars as the brazen courtesan Odette. While perhaps Deneuve is too old for the part of a lively woman of leisure and lady of the night, she manages to capture the spirit of the character without a single flaw, being the terrific actress she is. John Malkovich turns his back on America momentarily to become French in the role of the Baron Du Charlus, who talks a big deal but is essentially a licentious and unsympathetic character. Vincent Perez is Morel, who engages in one affair after another (unlike Proust who appears to love only Odette and Gilberte (the beautiful and talented Emmanuelle Beart), his childhood sweetheart. Child actor Georges Du Fresne gets a lot of screen time as Marcel when he was a young boy. The most attractive aspects of the film, as everyone generally concurs, is the cinematography and art direction, which, while admittedly dreamy and glamorous, is quite frankly, Proustian. The camera moves freely, floating ghost-like between characters, giving us access to their conversations and private moments. There's a mix of intense natural sunlight and \"evening\" blue colors in the nightlife scenes. I can't describe how magical the movie's look truly is. The costumes are authentic to the Edwardian Era and World War I period (1900-1918). Though this film doesn't cover the historic aspects in too much detail (the various aristocratic characters i.e. the Guermantes, princes, dukes and princesses- speak of World War I, the German enemy and the aftermath of the Great War including the Spanish Flu Epidemic), the film manages to believably encompass a time and place, though perhaps the film \"1900\" does a better job of this. Fans of Marcel Proust will delighted, even if some portions are omitted but truthfully a film adaptation of the Proust \"Time\" cycle would take over 6 hours. Some people seem to miss some of the more shocking portions of the film. Proust was a bisexual writer who attempted to document the Belle Epoque as he lived it. In this film, we are presented with gay and lesbian characters - Albert and Albertine. There are two scenes which, subtle as they were, were quite powerful such as the scene in which Proust peeks in to Albert's bedroom door and discovers he has a sadomasichistic/erotic relationship with a male lover. Also, even while Proust is dying, he pays Odette money to perform oral sex on him. These little things are overlooked in the course of a long and beautiful film, with actors who truly live their role and give them nuance and color. One character in particular, Morel's American girlfriend, interjects the English words \"It's absolutely disgusting!\" during gossip of the Duchess and the Duke. This film is an enjoyable historic film, with a late 90's European film gloss and a feeling of respect and reverence for Marcel Proust. Wonderful and haunting, full of poignant moments and mesmerizing, at times magic realist moments. This film is sure to delight all Francophiles everywhere. Enjoy!",
         "I have read very little of Proust's great work. I found TIME REGAINED to be a marvelous film, one which further encourages me to read REMEMBRANCE OF THINGS PAST in the future. The movie seems to me to be divided, unintentionally, into three parts. In the first, the photography is exceptional, the use of a moving camera among the best I have seen. This part deserves comparison with the Fellini films mentioned in another comment. However, the second section, which deals mostly with homosexual relationships, sees the imaginative direction almost grind to a halt. In the final section, some wonderful direction takes place again. I think it would have been helpful if the characters had worn name tags (just kidding). The acting was very good, and John Malkovich was outstanding. I saw a video of SWANN IN LOVE (the first volume of the work), and TIME REGAINED was infinitely superior as a filmgoing experience.",
         "Well, I had only ever heard of Proust before this film from a Monty Python sketch of the \"Summarise Proust competition\" (contestants had to summarise In Search of Lost Time once in evening wear and once in bathing suit). I was worried I might hate this film, not knowing anything about Proust other than he wrote a multi-volumed masterwork about time and memory. Then I saw it...wow! I cannot praise Mr Ruiz enough for what he has achieved. The camera work, sets, and lighting are stunning. As Marcel's memory takes him back and forth through his life, the sets and furniture often move around whilst the scene is played out - all emphasising the fragility and hallucinatory qualities of his memory. And there is the music...wow again. It is never intrusive but always creates the perfect background to what is happening on screen. It is not overly sentimental and never tries to force you into feeling emotion (unlike someone like John Williams/S. Spielberg who tries to ram it down your throat). As for plot, many characters and relationships are never fully explained or revealed. Many reviewers seem offended that a film expects them to display attention and interest, but I feel that they're missing the point. Plot is often not the point of the film, instead it is a film about time and memory (hence the title!). Plot is not allowed to dominate the narrative structure, it is the emotions and memory of Marcel. The most offensive thing that some other reviewers seem to find about this film is that it is novel and original - what a crime!! I had never read Proust before I saw this film, but I have a long enough attention span and an open enough mind to appreciate the sheer beauty of its images and the wonderful originality of its style. I urge anyone remotely appreciative of excellent filmmaking to see this film. It might even, as it has with me, motivate you to read the book. I am now three and a third volumes in and it is the greatest and most beautifully written novel I have ever read in my life. Thank you Mr Ruiz and thank you Marcel! SEE THIS FILM NOW!!!",
         "If you're looking for a movie that faithfully reduces In Search of Lost Time to 2 hours or so, this isn't it. But then, that's impossible, so you will be frustrated in your search. What this is is a problematic movie. If you don't know Proust's 4000 page novel, In Search of Lost Time, I suspect a lot of this movie won't make sense to you. If you do know it, on the other hand, you might be upset that X does not look like Proust's character A, that Y scene was left out, etc. So, the best way to enjoy this movie - and there is a lot in it to enjoy - is to know Proust's novel well enough so that you can make sense of the movie, but then to forget about it and treat this as a movie that is not trying to film Proust's novel. I could go on about the way the film jumps from scene to scene based on recollections of the narrator. One might say that that's Proustian, but Proust does not in fact jump from one short scene to the next. So I'll leave that aside. What this is, for me - and I have seen the movie several times - is a remarkable collection of performances by some of France's greatest actors and actresses - and John Malkovich. The performances by Catherine Deneuve (as Odette; no, she does not look at all like I had imagined Odette from the novel, but she is radiant in this movie), Emmanuelle Béart (as Gilberte Swann; ditto), John Malkovich (Charlus; ditto in spades; he does not look at all like Proust describes Charlus, but he creates a remarkably moving and coherent character), Vincent Perez (Morel; he may look like Proust's Morel, but he gives him more depth), and Marie-France Pisier (Mme Verdurin) are all absolutely first rate, beautiful to watch. They make the film for me. Other characters important in Proust are either reduced to very small roles (the Duke and Duchess de Guermantes, the Prince and Princess de G) or vanish altogether (Swann, Marcel's father). But watching the above great actors and actresses give great performances is, for me, the great value of this movie. If you want Proust, you'll just have to read it. But if you want to see some of France's greatest actors and actresses at their best, you could do a lot worse than this movie.",
         "My wife who read Proust's works in French liked this movie. I haven't read any Proust so I was completely lost and gave up after the first hour watching the DVD. I got tired of bothering her to ask who was who and what was happening but I kept wandering back to the TV to catch parts of it. I don't recommend this film to anyone unfamiliar with the novels. Characters and events move back & forth in time and if that's not confusing enough, sometimes they appear in the past and present at the same time. She later admitted she lost interest at times and fought off dozing due to the slow pageant-like pacing. This is a demanding film that requires your absolute attention, preferably when you're not tired. I firmly believe the French make the best costume films and this film is a perfect example. Although the handsome period sets and costumes are finely detailed, they are marred by the too dark photography during the indoor scenes. To make matters worse, the white subtitles are hard to read at times because the letters lack black borders making them impossible to read against white or light backgrounds. The actors seemed good matches for their characters but listening to John Malkovich speak drawling phonetic French is bizarre if not funny. Film adapted from novels should stand on their own without the viewer having to read the novel beforehand in order to follow it. 'Time Regained' is probably the best example of not being able to follow a film based on a novel, or to make it worse, several novels. For Proust fans ONLY and those fluent in French due to the bad subtitling.",
         "Chilean screenwriter, producer, teacher and director Raúl Ruiz' 51st feature film which he co-wrote with French screenwriter Gilles Taurand is an adaptation of the seventh and final volume of the novel \"Remembrance of Things Past\" by French author, essayist and critic Marcel Proust (1871-1922), which was published between 1913 and 1927. It premiered In competition at the 52nd Cannes Film Festival in 1999, was shot on location in Paris, France and is a France-Italy-Portugal co-production which was produced by Portuguese producer Paulo Branco. It tells the story about an anonymous man whom whilst on his deathbed in the home of his friend Gilberte, begins to think about the time when he had just been released from a sanatorium and was a young aspiring writer during the First World War in Paris, France. Distinctly and precisely directed by filmmaker Raúl Ruiz (1941-2011), this quiet and somewhat surreal period piece which is narrated by French producer, actor and filmmaker Patrice Chéreau and from multiple viewpoints, draws a reflective and incisive portrayal of an early 20th century writer's internal odyssey through his memories during the last hours before his death. While notable for its colorful milieu depictions, the exquisite production design by production designer Bruno Beaugé, cinematography by Argentine cinematographer Ricardo Aranovich, costume design by French costume designer Caroline de Vivaise and Italian costume designer Gabriella Pescucci and the fine film editing by French film editor Denise de Casabianca, this dialog-driven and at times humorous story, depicts an insightful study of character and contains a great and timely score by composer Jorge Arrigada. This poignantly atmospheric and finely paced drama about an introspective man's relationship to the world that surrounds him, the women he as befriended or had relations with, his memories and time in itself, contains an efficient score by Chilean composer Jorge Arrigada, an array of variegated characters and is impelled and reinforced by its fragmented narrative structure and the reverent acting performances by Italian actor Marcello Mazzarella, American producer, actor and director John Malkovich, French actress Emmanuelle Béart, French actor Pascal Greggory, French screenwriter, actress and director Marie-France Pisier (1944-2011), Swiss actor Vincent Perez and French actress and singer Chiara Mastroianni. A romantic, detailed and picturesque independent film which gained the award for Best Cinematography Ricardo Aranovich at the Ourense International Independent Film Festival in Spain, 1999.",
         "Ruiz was quite something back in the 80's, one of the most promising filmmakers I have recently discovered. He made films that throbbed with magic volition, with steps travelling inwards to the place where images are born. It was a dangerous cinema, sultry with the impossible. Then came the second phase, the period of maturity as it were. More prestigious films starting in the mid-90's, starring actors of standing (Mastroyanni, Huppert, here Deneuve and Malkovich) and with some clout of respectability. Watching these makes me cherish so much more the spontaneous upheaval of Three Crowns or City of Pirates. So, this is the landmark film of that second phase, a bulky, sprawling film about French writer Marcel Proust and his work. About sprawling deathbed recollections of a life lived, arranged into a story about stories in an attempt to reveal something of their machinations (and ours in weaving them in the mind, before or after the event). It is a noble effort, with multiple points of interest. Oh the sets are sumptuous, roomfuls of an impeccably dressed society at the doorstep of disaster\u0097WWI is booming away in close proximity\u0097who mingle in coquetry at the clinking sounds of fine glassware. Vice as the last means of sating a self that can never seem to please itself. Bunuel stuff. Charmingly amusing tidbits abound, sure\u0097a scene at the funeral, for example, of a decorated general, whose wife takes solace in a stash of letters she discovered written by the deceased brave. We know, of course, that the love pouring out of them was no doubt intended for his secret homosexual lover. Now all of this as memory, with the narrator present and included in the scene of it. And then a camera\u0097the internal narrator of memory\u0097that introduces the distorted distance of time, this is quite marvelous, as actually reordering reality\u0097furniture move around on whims, our narrator. Fine stuff so far. But, this really falls with Proust's ideas on the role of fiction, the thinking man so hopelessly removed from the actual, tangible things of life, that he can only find solace in turning them to their spiritual equivalents. Who instead of loving, can only write about love; who wastes the manifold possibilities of 'now!' in tinkering with dead time. Earlier filmmakers astutely exposed this destructive facet for what it is; a chimera of the mind that traps the soul in old films of memory. Resnais in his fascinating overall project about memory, Antonioni in Blowup, earlier yet it was film noir. Beckett has captured the dissication better than anyone, pungent stuff his. Ruiz by contrast romances the idea as though it was a pleasant stroll. He romances it so earnestly that it drains his entire film. It is all so fine\u0097like the glassware\u0097so refined and pliable with some grace of apparent form. But a form refined to the point of ornament and sofness, mere trinket that is hollow and devoid of life. No other filmmaker once promising I can think of, matured into so much indifference."
      ],
      "genres": [
         "Drama",
         "Romance",
         "War"
      ],
      "productionCompanies": [
         "Gemini Films",
         "France 2 Cinéma",
         "Les Films du Lendemain"
      ],
      "summaries": ["Marcel Proust (1871-1922) is on his deathbed. Looking at photographs brings memories of his childhood, his youth, his lovers, and the way the Great War put an end to a stratum of society. His memories are in no particular order, they move back and forth in time. Marcel at various ages interacts with Odette, with the beautiful Gilberte and her doomed husband, with the pleasure-seeking Baron de Charlus, with Marcel's lover Albertine, and with others; present also in memory are Marcel's beloved mother and grandmother. It seems as if to live is to remember and to capture memories is to create a work of great art. The memories parallel the final volume of Proust's novel."],
      "budget": 65000000
   },
   "movielensId": 3749,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1999-05-19",
      "dvdReleaseDate": "2001-03-27",
      "directors": ["Raúl Ruiz"],
      "runtime": 169,
      "movieId": 3749,
      "title": "Time Regained",
      "mpaa": "",
      "actors": [
         "Catherine Deneuve",
         "Emmanuelle Béart",
         "Vincent Pérez",
         "John Malkovich",
         "Pascal Greggory",
         "Marcello Mazzarella",
         "Marie-France Pisier",
         "Chiara Mastroianni",
         "Arielle Dombasle",
         "Edith Scob",
         "Elsa Zylberstein",
         "Christian Vadim",
         "Melvil Poupaud",
         "Alain Robbe-Grillet",
         "Jean-François Lapalus"
      ],
      "imdbMovieId": "0189142",
      "originalTitle": "Le temps retrouvé",
      "genres": [
         "Drama",
         "Foreign"
      ],
      "youtubeTrailerIds": ["bGpcZJ8obEI"],
      "plotSummary": "Marcel Proust (1871-1922) is on his deathbed. Looking at photographs brings memories of his childhood, his youth, his lovers, and the way the Great War put an end to a stratum of society. His memories are in no particular order, they move back and forth in time. Marcel at various ages interacts with Odette, with the beautiful Gilberte and her doomed husband, with the pleasure-seeking Baron de Charlus, with Marcel's lover Albertine, and with others; present also in memory are Marcel's beloved mother and grandmother. It seems as if to live is to remember and to capture memories is to create a work of great art. The memories parallel the final volume of Proust's novel.",
      "tmdbMovieId": 47439,
      "avgRating": 3.28102,
      "releaseYear": "1999",
      "numRatings": 137,
      "posterPath": "/ylTWJkN5GkwxOCsJPaDmeOv87Ep.jpg"
   }
}