{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0217287",
      "video": false,
      "title": "Boricua's Bond",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe4d3bc3a368484e1ddf09",
            "name": "Val Lik",
            "profile_path": null,
            "id": 1190670,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [],
      "popularity": 0.069178,
      "production_countries": [],
      "id": 207731,
      "vote_count": 1,
      "budget": 0,
      "overview": "Tommy, a talented Puerto Rican painter living in the South Bronx, befriends Allen, a white kid who's faced constant harassment since moving to the neighborhood with his single mother, Susan.",
      "similar": [],
      "original_title": "Boricua's Bond",
      "runtime": 105,
      "poster_path": null,
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "",
      "vote_average": 2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Val Lik"],
      "runtime": 105,
      "synopsis": null,
      "writers": ["Val Lik"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0217287/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA5MDA4NTQyNF5BMl5BanBnXkFtZTYwNDk0Mjk5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Frankie Negron, Val Lik, Ramses Ignacio | See full cast and crew »"],
      "reviews": [
         "I absolutely hated this movie. First there were hardly any Boricua's in the film. The story was, wait, what story? It was worst than a student film. I think the director got into some money, got some singers and rappers to be in the film and then shot random scenes, not necessarily caring whether the end result would make sense or not. Don't get fooled by Big Pun appearing on the movie poster. He is in the movie a total of about five minutes and that's only because the brilliant (can you sense my sarcasm) director used the same part of Big Pun in the beginning and then again in the end. Director,(hmmm. does he even deserve that title? uhhh, NO) at any rate, Val Lik went on to create a film where every negative stereotype about latinos were blatantly perpetuated. The movie absolutely disgusts me and it will go down as the worst movie I have seen to date.",
         "First off, I am an aspiring independent film director myself. When I had talked to consultants about my project, they told me never to write something that I didn't know anything about. Case and point, a Russian named Val Lik has decided to write and direct a film about Puerto Ricans, like myself, and failed miserably, because it's obvious he doesn't know what he's talking about. This movie had little plot and I couldn't tell who the lead was from time to time. When reading the TV Guide review, it stated that a white kid was trying to survive in a Puerto Rican neighborhood. When I read the online review, it stated that a painter looked to do something better with his life besides crime and drugs and prostitution. So, what character are we supposed to follow? Not even Val Lik, who plays the white kid, knows who we are supposed to follow. It's completely fake. Not to mention, Axel, an overweight Boricua, taking off his clothes any chance he gets to do so. If I had to see this kid's ass one more time, I was going to shoot myself. His little hijinx distract from the message that Val was attempting to convey. Why add a scene where Axel hitches a ride from the police? What good is that to the overall story? Considering how weak his story was, he enlisted the help of hip-hoppers Big Pun, DMX, Method Man, Redman, and a few others, to try and earn him some credibility. It doesn't. Not to take anything away from any of these artists, but this outsider's look on Puerto Ricans in the inner city gives him no credibility and no chance of redemption in my eyes, regardless of who he casts in the film.",
         "How do I start? I decided to give this movie a chance expecting to see a movie depicting the positive and negative aspects of the South Bronx, but all I saw was the negatives all the way. Almost every single character in this film is a lowlife, with the exception of Tommy, Allen and Rose. Tommy was supposed to be everyone's role model in the film, yet, most of the time he stood around and did nothing when his posse of low lives he so called \"friends\" did stupid and highly embarrassing things to other people. The heavy set guy taking off his clothes through half of the movie was supposed to be the comic relief, but I just found him obnoxious and not at all funny. Another major flaw of this film is its lack of story line. There is none, whatsoever. All we see for an hour and 35 minutes is the director showing almost every Puerto Rican and black in the film act like savages with absolutely no class or manners. If this film was trying to be anything like past classics such as Boyz 'n the Hood, Do The Right Thing or Menace 2 Society, it failed miserably. At least those other films showed many other positive aspects of African-Americans and those films actually had a storyline and plot. In the end, when this movie was over, I felt sick to my stomach of watching every single negative stereotype of Puerto Ricans in a single film. I don't even think the title is fitting. What is this bond that Boricuas share according to Val Lik anyway? A lifetime of violent behavior, promiscuous sex, irresponsibility, drugs? is that the bond? Where is the positive message? Please, do yourself a favor, especially if you're Puerto Rican. Stay away from this film, you will thank me later.",
         "I saw this movie one late night, and could only WISH I could get my time back. It's a hispanic version of Boyz n' The Hood, but they took out a few things like good acting, good dialogue, a plot... I understand that the actors (and I use the word loosely) are not pros, but once you see the movie, you'll understand why. Character development is nil, camerawork is atrocious. This film perpetrates everybody in this neighborhood as a thug, a whore or something of the type. Not ONE person in the movie shows any redeeming value, except the white boy, the reason for the 'plot' of this movie. Once you see this movie, and I'm sorry for you if you do, you'll understand my One Line Summary.",
         "The catfight was the best, but more on that later. The movie as a whole is an inferior version of all those \"in the hood\" films made. There is no character development in the movie, no likeable person with the exception of the token white guy in the movie (and what does that say about a film concerning Puerto Ricans?) and virtually no plot. Some Rican's father gets shot by his brother and he goes on bitching about how he has no father. For guys like myself who have had their fathers abandon them, we elicit no pity for this character who cries for pity because his father was killed, yet the movie tells us we must pity him because of this and understand why he does crummy things because of this. The film also portrays Puerto Ricans in a bad light. I am a hispanic but not a Rican so this doesn't necessarily upset me, but having experienced what I have experienced, I can never feel any sympathy at all for these characters the film tries to heroize. They are dispicable, lude, and comfortable in their mediocrity. Not all Ricans are the way the film portrays them to be but all we see are the poor excerisizes of latinos the film says we must relate to. The film tries to be objective but there are moments that bog the story down. There are much better films about inner city hispanics that try to make a point and use objective storytelling. What is the point of this film? That lack of education is the root of all violence? BOYZ n THE HOOD, STAND AND DELIVER, and LEAN ON ME dealt with this better. This film was an excuse for one fat Puerto Rican to show his rear end and his full frontal alot in the film. I guess the director was trying to reach out to an potential homosexual audience. As for the catfight, yes, there is a catfight at the end of the movie, one of the better catfights in American films. This is no chopsocky poor excuse for martial arts by women pretending to be civil rights fighters. These are just two women who hate each other, and throughout the film they have been teasing a fight between them. Well, the film doesn't disappoint on that and these two go at it, pulling hair, rolling on the concrete streets in hatred of each other. Women fighting the way they do in real life, not that Charlie's Angel's bull. I wanted to give this film a chance but it ended up leaving a bad taste in my mouth.",
         "It really looks like people are focusing WAY too much on race when watching this movie. Quite frankly it is just annoying and blatantly stupid. I watched this movie and I liked it. It is very heavy and dark, a messed up movie. But it feels like an important movie in the sense that it shows the audience the messed up reality in some places. Movies like this are important because they work as a reflection of the real world in some of it's darkest aspects. The people who are giving this movie negative feedback, as you can tell on the reviews, are people who are upset with how their \"race\" was reflected on camera. Well, that is just absolutely ridiculous. When I watched this movie I didn't think the least bit about race, all I saw was a bunch of _people_ in a miserable surrounding with circumstances that are not easy to get out of. Yes, a good bit of people in this movie are idiots - but are you really such a huge racist that you can't acknowledge when someone acts poorly, regardless of race? This movie didn't change my view on people, it made me think that Im happy who doesn't have to live in an area like that. Don't be so full of prejudice and give this movie a watch. It is definitely underrated, I was surprised by the low rating.",
         "this movie was so terrible words can't even describe how stupid I felt after watching it. First off the acting was terrible, the story was so fumbled and drawn out, one after the other cliches. I guess we haven't seen enough movies about the inner city youth that is a bad seed but has good in him and a talent(painting) but the 'hood keeps pulling him under so that talent and good can never shine until his friend shoots a cop in a holding cell. I'd rather eat glass than watch this movie again.",
         "This film seems like it was inspired by a bunch of guys that sat around in the Bronx drinkin' and smokin' and laughin' at each others jokes and putdowns, then figured, \"we ought to make a movie about this\". Although there were moments that worked (many of the amateurs gave relatively inspired performances), the movie basically send a negative message: that Blacks and Puerto Ricans are enemies (ignoring the fact that Puerto Ricans are a mulatto race). It also perpetuates the idea that Boricuas dream and aspire to be white. Simple minds are easily influenced by this kind of tripe. For example, joanna 9 writes in her review on this website that she's from P.R. and never lived in NY, but then goes on to say that blacks mistreat Puerto Ricans. What a genius. Finally, most of the blame for the negative portrayal of Blacks in this (and any other) film rests squarely on the shoulders of the Black \"actors\". There are no whites in blackface to blame anymore.",
         "I watched this movie at 2:30 in the morning one night. I have to say, I was never one who really liked independent features, but I have to say as an American with Puerto Rican blood in him, I learned a lot of stories about how tough it is in the Bronx. Seeing this film gave me a chance to visualize what life can be like in the Bronx. I'm sure it's not all that bad, but even still, I felt director Val Lik did a pretty good job with his film debut and even playing the young Caucasian who is befriended by the PR crew. Although the only that made me feel uneasy was Axel constantly undressing. He's got issues. That, plus Frankie Negron portraying Tommy really well and Erika Torres looking good, I have to say, pretty good movie.",
         "I saw this movie one late night, and could only WISH I could get my time back. It's a hispanic version of Boyz n' The Hood, but they took out a few things like good acting, good dialogue, a plot... I understand that the actors (and I use the word loosely) are not pros, but once you see the movie, you'll understand why. Character development is nil, camerawork is atrocious. This film perpetrates everybody in this neighborhood as a thug, a whore or something of the type. Not ONE person in the movie shows any redeeming value, except the white boy, the reason for the 'plot' of this movie. Once you see this movie, and I'm sorry for you if you do, you'll understand my One Line Summary."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Big Ones Entertainment",
         "MIA",
         "Mindz in Action"
      ],
      "summaries": ["Can a young person in the South Bronx pursue a dream that isn't tied to crime, gang-banging, prostitution, violence, and racism? Tommy is a natural leader and a gifted artist. When Allen, a white kid, moves into the neighborhood with his single mom, he's a victim of constant harassment until Tommy offers friendship. Meanwhile, a corrupt cop hits on Allen's mother and, when she rebuffs him, vows revenge. Forces beyond Tommy and Allen's control put them in the hands of the criminal justice system. A local murder, a rivalry between two young women, and the hot temper of Tommy's older brother make things even more difficult for the friendship and dreams of the young men."],
      "budget": 0
   },
   "movielensId": 3750,
   "movielens": {
      "languages": [""],
      "releaseDate": null,
      "dvdReleaseDate": null,
      "directors": ["Val Lik"],
      "runtime": 105,
      "movieId": 3750,
      "title": "Boricua's Bond",
      "mpaa": null,
      "actors": [""],
      "imdbMovieId": "0217287",
      "originalTitle": "Boricua's Bond",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "Tommy, a talented Puerto Rican painter living in the South Bronx, befriends Allen, a white kid who's faced constant harassment since moving to the neighborhood with his single mother, Susan.",
      "tmdbMovieId": 207731,
      "avgRating": 2.4,
      "releaseYear": "",
      "numRatings": 5,
      "posterPath": null
   }
}