{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0200669",
      "video": false,
      "title": "The Golden Bowl",
      "recommendations": [
         45609,
         25520,
         18596,
         86955,
         23333,
         38509,
         38244,
         32687,
         42707,
         51145,
         52780,
         20471,
         46280,
         5622,
         47302,
         55700,
         53156,
         49633,
         41348,
         41951
      ],
      "backdrop_path": "/7x1K1cutOLyQ8aOzEFXSF7JGTAp.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Maggie Verver",
               "gender": 1,
               "credit_id": "52fe4605c3a368484e07c6df",
               "name": "Kate Beckinsale",
               "profile_path": "/jlleQafwnW1j0mvxJLiqnNL2mYh.jpg",
               "id": 3967,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Colonel Bob Assingham",
               "gender": 2,
               "credit_id": "52fe4605c3a368484e07c6e3",
               "name": "James Fox",
               "profile_path": "/27vddrOyr0jnT2pi17cFoKPro4A.jpg",
               "id": 1292,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Fanny Assingham",
               "gender": 1,
               "credit_id": "52fe4605c3a368484e07c6e7",
               "name": "Anjelica Huston",
               "profile_path": "/Aiyv68gYWcEe9OYhyCkOa09kjmy.jpg",
               "id": 5657,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Adam Verver",
               "gender": 2,
               "credit_id": "52fe4605c3a368484e07c6eb",
               "name": "Nick Nolte",
               "profile_path": "/o6O7WP3vokKstxJFMiiyRMNyPsH.jpg",
               "id": 1733,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Prince Amerigo",
               "gender": 2,
               "credit_id": "52fe4605c3a368484e07c6ef",
               "name": "Jeremy Northam",
               "profile_path": "/8NkPuXeJ8nXXIhgrmS8g7kcaTOS.jpg",
               "id": 18325,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Lady Castledean",
               "gender": 1,
               "credit_id": "52fe4605c3a368484e07c6f3",
               "name": "Madeleine Potter",
               "profile_path": "/41ye7eJWeWBGVjKlW5HVIh6pjsz.jpg",
               "id": 83665,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Charlotte Stant",
               "gender": 1,
               "credit_id": "52fe4605c3a368484e07c6f7",
               "name": "Uma Thurman",
               "profile_path": "/6SuOc2R7kXjq3Em24KTNDW9qblJ.jpg",
               "id": 139,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Lord Castledean",
               "gender": 2,
               "credit_id": "52fe4605c3a368484e07c6fb",
               "name": "Nicholas Day",
               "profile_path": "/bJXBWPKEPpa7oXBHpkWGjsWhl2H.jpg",
               "id": 108294,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "A.R. Jarvis, Shopkeeper",
               "gender": 2,
               "credit_id": "52fe4605c3a368484e07c6ff",
               "name": "Peter Eyre",
               "profile_path": "/zOhIE7ociMKRow7wT9LZfBrmSa4.jpg",
               "id": 12691,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4605c3a368484e07c705",
               "name": "James Ivory",
               "profile_path": "/vj4PY2KciRCZWzT4eCdOoQfzoJs.jpg",
               "id": 54441,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4605c3a368484e07c70b",
               "name": "Henry James",
               "profile_path": "/xR2YUBp0saT4Ss4uRHNWtpBfNnG.jpg",
               "id": 39013,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 1,
               "credit_id": "540f3f62c3a3686e4c00017a",
               "name": "Ruth Prawer Jhabvala",
               "profile_path": null,
               "id": 54443,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "540f3f76c3a3686e49000160",
               "name": "Henry James",
               "profile_path": "/xR2YUBp0saT4Ss4uRHNWtpBfNnG.jpg",
               "id": 39013,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 2.882864,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 29946,
      "vote_count": 25,
      "budget": 15000000,
      "overview": "An intricately plotted tale of thwarted love and betrayal, \"The Golden Bowl\" tells the story of an extravagantly rich American widower and his sheltered daughter, both of whom marry only to discover that their respective mates, a beautiful American expatriate and an impoverished Italian aristocrat, are entangled with one another in a romantic intrigue of seduction and deceit.",
      "similar": [],
      "original_title": "The Golden Bowl",
      "runtime": 130,
      "poster_path": "/uDWTRCTvA1gyBi1QSNU2giIndch.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "TF1 International",
            "id": 7799,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Merchant Ivory Productions",
            "id": 2370,
            "origin_country": ""
         }
      ],
      "release_date": "2000-05-14",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["James Ivory"],
      "runtime": 130,
      "synopsis": null,
      "writers": [
         "Henry James",
         "Ruth Prawer Jhabvala"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0200669/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQyNTI0OTY3M15BMl5BanBnXkFtZTcwMDI1MTQyMQ@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Uma Thurman, Jeremy Northam, Kate Beckinsale | See full cast and crew »"],
      "reviews": [
         "I'm a sucker for anything set in Edwardian England, good or bad. This is neither. The plot is clever but a little wooly. It takes a while to figure out just who is doing what to whom and why. A father and his daughter each married to the partners in a torrid affair. Rather gives a new meaning to \"menage a trois.\" (Or is it \"menage a quatre\"?)I don't think even Y&R has tackled this one yet! However the performances are flawless, the settings lush and the cinematography superb. The use in a couple of places of old newsreel footage is especially innovative and interesting but doesn't seem to serve much dramatic purpose. And the symbolism of the golden bowl is a little too obvious and overworked. Nevertheless I liked this movie a lot!",
         "The best Merchant Ivory so far, and ideal film material. The story is engrossing and perceptive, dealing with human relationships in all their forms. It takes a hard and frank look at the motivation behind several different relationships, which varies from selfishness, loneliness and boredom to love of the deepest kind. The film makes you wonder how and why we choose our friends. Personally, I found the acting and direction superb, apart from a couple of flat speeches by Kate Beckinsale (whose accent also varied quite a bit). Unfortunately one of these comes in the scene where her character is introduced, which may have put some people off this film at an early stage (there are a lot of negative comments on here!). The rest of the cast are superb, especially Uma Thurman who is mastering the art of conveying a lot of meaning with just a single look. Tension builds up throughout and is skillfully maintained right until the end. It is, of course, a film that you need to see on a big screen as part of the point of a Merchant Ivory production is the exquisite detail that goes into getting the costumes and locations just right. Even more so than in their past productions, a huge amount of effort has been spent here. One thing I found is that the characters felt fairly isolated: most of the time, you just saw the leading characters in a scene on their own and, apart from a couple of party scenes, there was not much attempt to show the society in which they lived; also there were few exterior shots in the cities. It may be that that was quite deliberate, to show that these incredibly wealthy people lived very insular lives.",
         "Ruth Prawer Jhabvala has made \"The Golden Bowl\" come to life. Henry James's last novel, a rather difficult read, has been told very simply without missing the point of the novel. I have read a lot of criticisms of this movie and cannot understand why a lot of the critics say that it was a difficult movie to understand. The constumes, sets etc. recreated the time most wonderfully. The splendor of the great homes, the decay of the Italian Castle, the history of Amerigo's family, the under currents of feelings between the characters all seemed so right. For some, the movie might feel a little long, but Henry James is a most difficult author to translate into film. I liked the use of old black and white movies for the scenes in New York, it added to the stmosphere.",
         "Prince Amerigo (Jeremy Northam) has a castle on the verge of ruin and empty pockets. Although he lusts after a poor but beautiful lady named Charlotte, he decides to marry her very rich friend instead. His new wife, Maggie, is a lovely, innocent human being, totally unspoiled by wealth. Maggie hopes to see her widowed father happily remarried and encourages his interest in Charlotte. It happens. Charlotte agrees to marry America's first billionaire, what a tough gig. But, why? Does she have any affection for Maggie's father? Or does she want to stay in close contact with Amerigo? It seems the latter, for Charlotte and the Prince go everywhere together, now that it is acceptable for two \"relatives\" to gad about. What is happening here? The book was written over 100 years ago but this story of human nature shows that very little changes under the sun. Northam and Thurman excel as the egocentric and evil humans who are so very lovely to look upon, it hurts. Beckinsale and Nolte likewise give nice turns as the folks who still have hearts beating in their breasts, despite their riches. As period pieces go, the costuming, the scenery, the staging, and the cinematography here are sumptuous. True, the pace is somewhat slow and the tale is intricate and subtle, requiring a repeat viewing, perhaps. However, Merchant and Ivory fans and non-fans will be rewarded by sitting through this timeless and tantalizing tale. If anyone wants to arrange for friends to share a movie evening together, the Bowl will have everyone talking.",
         "\"The Golden Bowl\", a period piece circa 1900's, turns a microscope on the innerworkings of the relationships of four people, two men and two women, bound by blood, marriage, love, duty, etc. and scrutinizes them to the exclusion of all else. Sadly, the people aren't sufficiently interesting or charismatic to support such scrutiny for 2.2 hours. Amidst the sumptuous splendor of grand costuming, locations, props, makeup, etc. with some heavyweights behind the film, \"TGB\" is an earnest effort which comes off as much ado about nothing with the one steamy and passionate relationship underdone while the emphasis lingers on the minutia. Somewhat awkward and staged at times, the film doesn't rise to the level of it better period predecessors but will still be a worthwhile watch for those into films about wealth and aristocracy.",
         "OK, so we need Henry James for character exposition. That complements beautifully the wonderful cinematography of all these great castles in England and Italy. Of course, the source of all these riches is alluded to with the real grainy film of the coal miners in AmericanCity. I haven't found yet the line in the novel by Thurman: \"But the miners would prefer the train to a museum\" when Nolte describes to her how he will buy both sides of the street and the train tracks between in order to build his museum. The reason the language sounds stilted is that much of the dialogue was lifted verbatim from the novel.....what little dialogue there is. And of course, the fascinating 'beasts unleashed' flavor of the sexual intercourse scene is NEVER to be found even alluded to in the novel. By the way, Edward II is buried in Gloucester Cathedral. That question comes up, but is NEVER answered in the movie, and you THINK it is going to be the little point that breaks up their alibi: \"We went to Gloucester Abbey, where there is some king buried, Edward II or Richard II.\" The acting is superb, the scenery gorgeous and the psychological incest between Nolte and his daughter is discreetly and appropriately exemplified. As HJ says, talking together in the castle gardens, they did indeed resemble husband and wife. The adultery of the other two was almost foreordained. The social habits of this age when women had no independent means of making a living is underlined. See this in conjunction with \"House of Mirth\" and you'll thank your lucky stars you live in 2001. As much sexism as still exists in the workplace, we have indeed come a LONG way, Baby!!!! Thurman's sense of imprisonment is palpable, and I wonder how many women went stark raving mad over their dependency, a form of slavery all the more odious for it not being recognized. I wonder if ALice James had any part in the writing of this novel. After reading this, she must have felt much better about her 'plight'. Although I wish for the maiden ladies of that day, that they might have been able to adopt or have babies without the social stigmas of the time......a great joy in life that shouldn't be linked with the social tyranny of 'catching a man'. Return to a time when people used their minds for things other than writing better software, as their country and Constitution are taken over by greedy ignorant barbarians intent on destroying the planet. It's a great movie.!!!",
         "For those people who loved \"A Room With a View\" and \"Howards End\" but hated \"Surviving Picasso\" and \"A Soldier's Daughter Never Cries,\" all is well in the universe. \"The Golden Bowl\" is excellent in every way. The film is exquisitely balanced. Nick Nolte, Kate Beckinsale, Angelica Houston and Uma Thurman are all amazing. Jeremy Northam is even better. The cinematography, the writing, the costumes; everything fits together. This is not a sleepy and slow costume drama, it is an exhilarating masterpiece. I do not know how loyal the screenplay is to James' novel, but the story is very moving and even though it is a \"period piece,\" the issues that the characters face somehow seem contemporary. Uma Thurman's character Charlotte is one of the most heart-wrenching on-screen women I've seen recently. I hope the film can keep up a presence until the next Oscar race begins. This is one of the best films I have seen so far this year.",
         "I agree with Timer, and, frankly am tickled that someone else noticed the resemblance of the antique dealer Jarvis to Henry James himself. I have seen too many of James Ivory's films to feel that this was accidental. But I didn't really see the resemblance until Jarvis came to deliver the bowl. (His shop was rather dark, and he may not have been wearing his cut-away coat at work.) I also thought it interesting how at least twice Jarvis put his hands out to catch the bowl should someone drop it, thus calling our attention to its fragility. (This was crystal, not glass, and who knows whether it will break when dropped?) The movie was over-long, of course. But it was a feast! There were many scenes that could have been edited down or eliminated, but the luxury of seeing the extra footage was wonderful. It reminded me of another favorite, wonderful(and long) movie, Mike Leigh's *Topsy-Turvey* (about the partnership of Gilbert and Sullivan). And interestingly, there's the same continuity/accent problem in both. In *The Golden Bowl* Angelica Houston plays some scenes with a distinct American Southern accent and some without. In *Topsy Turvy*, Sullivan's lover is quite British in one scene, chatting on about young Winston, yet at a piano recital she speaks in an American Southern accent. Wouldn't you think someone would have noticed in both instances and just re-looped the audio? Finally, the only reason I knew that Jarvis resembled Henry James is a book that my wife and I wrote for Harcourt. It's called *About the Author* and contains \"juicy-bits profiles\" of 125 favorite (living, dead, male, female, etc.) novelists. To put it another way, we assume that the reader has access to most of the boilerplate info on each author (Web searches, encyclopedia articles, textbooks, etc.). So we focus on the stuff you won't find in most of those sources. As part of our research, we learned that James's novels were often inspired by conversations and stories he heard at the many dinner parties he attended in London. (Between 1878 and 1879, he dined out 140 times.) Shades of Truman Capote? Although born in New York City in 1843, he became a British citizen in 1915. Henry James also attended Harvard Law School between 1862 and 1863. His father was a friend of Thoreau, Emerson, and Hawthorne. He himself, at age 26, arrived in London and soon met Darwin, George Eliot, Ruskin, Rossetti, William Morris, and others. He felt that criticism was intellectually superior to creative writing and considered himself primarily a critic. At the time of his death in 1916 at age 72, his novels were all but unread. Only after the observance of his 100th birthday in 1943, when World War II had focused America's attention on Europe, did critics realize that he was one of the greatest novelists of the 19th century.",
         "Despite the fact that I'm normally not a fan of period movies, I've seen two in a row now. The first one was \"The Remains of the Day\", the second one this \"The Golden Bowl. Much to my surprise I must say that I liked both, although there was a big difference in the two. While the first one was very compelling and sometimes close to perfection, I didn't always have that feeling with this movie. In the early 1900's Adam Verver, an American billionaire, lives with his daughter in London. When she is introduced to the Italian Prince Amerigo, it doesn't take long before they get married. But the prince has a secret. He has a relationship with Charlotte Stant, Maggie Verver's best friend. Because Maggie doesn't know that Amerigo and Charlotte know each other, she sees no harm in introducing her to her widowed father and therefor allowing her to become a member of the family once she marries him. Charlotte is very happy with this match of course, because all she wants is to be close to Prince Amerigo. All this leads to one big masquerade full of deception, lies and unhappiness which can't be revealed... Despite the fact that I'm normally not a fan of this kind of movies, I must say that this one was OK. Especially the acting made it all worth watching. Thanks to the famous, but also well-acting cast which includes people like Kate Beckinsale, Anjelica Huston, Nick Nolte and Uma Thurman, I was able to enjoy this movie. Does that mean that it is a perfect movie? No, not exactly. The story for instances sometimes lacks a bit in power, making it not always very interesting to keep watching this movie for more than two hours. But on the other hand I must also say that it all could have been a lot worse. The story was perhaps not exceptional, but it sure was decent enough. In the end I don't think this is a movie that will appeal to the average fan of period movies. First of all is the time period not exactly correct. I believe that those movies situated in the early 19th century are a lot more popular than one which is situated in the early 1900's. But since I'm not such an average fan and because I've always been interested in the time period 1900 - 1950, this was quite interesting for me. It's only too bad that the story wasn't a bit more exceptional. Now I give this movie a rating in between 7/10 and 7.5/10, mostly because of the fine performances.",
         "Charlotte Slant, an penniless American socialite, left her country to settle in Europe. This way, perhaps, her reduced means would go further in the Europe of the last part of the XIX century. In Florence, she meets, and falls in love, with an impoverished Italian prince. They become lovers, but neither one has the money to live well in the society both loved. When Charlotte goes to London, her good friend Fanny Assingham, an American with a lot of social connections, has a plan to marry her to Adam Verver, the first American billionaire, whose own daughter, Maggie, happened to be Charlotte's friend. Amerigo had followed Charlotte to England, but he was seeing Maggie, a possible meal ticket, a way out for his money problems. One day, Charlotte and Amerigo visited an antique shop where they found a gorgeous vase decorated with gold. The owner tells them it is a perfect piece. The price though, kept it out of her budget, besides, she was not completely sure Maggie would like it. Amerigo's marriage to Maggie is a match made in heaven for Adam, who now can add a noble title to his future grandchildren. Maggie and Amerigo divided their time between the house in London and her father's splendid palace he rents in Leicestershire. Charlotte, now married to the older Adam, had not stopped loving Amerigo. Their passion is stronger, if anything. One week-end Charlotte and Amerigo go to a country estate where a celebration is happening. When they are to return to London, they decide to stay overnight at Gloucester, where they spend the night at an out of the way inn. Maggie is worried, but when they reappear, Amerigo explains how they wanted to see the magnificent cathedral. In doing so, he mentions something he has not the correct answer. Who is buried at the cathedral? Was it Richard II, or Edward II? Maggie, who obviously knows the answer is upset. Maggie, shopping at the antique shop is offered the golden bowl. The owner explains she can have it for less since he discovered a flaw in the crystal. When the merchant goes to deliver the piece, he notices the picture of Amerigo and Charlotte on a table. He mentions to Maggie this was the couple interested in buying the precious vase a few years ago. Maggie realizes the deception. Adam, noticing his daughter's distress, decides it is time for him to go back to America where he is building a museum to house all his European treasures. Charlotte, reluctantly, is made to go. In spite of her distaste for her native country, Charlotte will become a bigger socialite because of Adam's money, but in the process, she loses Amerigo. If there was anyone meant to bring Henry James' novel to the screen, it was James Ivory, a man that had made excellent adaptations of mostly English classic authors. The adaptation was entrusted to Ruth Prawer Jhabvala, an usual collaborator, who had done well transferring the original works into cinematic terms. Unfortunately, this venture did not pay off the same way that most of the other efforts did. Part of the blame must go into the casting of the four principal roles, and the almost static staging of the novel. Henry James' work presents some difficulty for the transfer to the screen. Uma Thurman is a ravishing creature. Her Charlotte is not exactly what one would have thought it could be. Complicating matters, there is no chemistry between her and Amerigo. Jeremy Northam's accent is not convincing for a noble Italian prince. Nick Nolte, who had worked with Mr. Ivory before, has a minor role. Kate Beckingsale, as Maggie is also not at her best. The only one that seems at ease is Anjelica Huston, whose Fanny is the best thing in the picture, but she is only a minor character. The film is gorgeously photographed in authentic settings. Tony Pierce-Roberts' camera captures those great places in all its splendor. The musical score is by Richard Robbins."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Merchant Ivory Productions",
         "TF1 International"
      ],
      "summaries": [
         "Adam Verver, a US billionaire in London, dotes on daughter Maggie, an innocent abroad. An impecunious Italian, Prince Amerigo, marries her even though her best friend, Charlotte Stant, an alabaster beauty with brains, no money, and a practical and romantic nature, is his lover. She and Amerigo keep it secret from Maggie that they know each other, so Maggie interests her widowed father in Charlotte, who is happy with the match because she wants to be close to Amerigo. Charlotte desires him, the lovers risk discovery, Amerigo longs for Italy, Maggie wants to spare her father pain, and Adam wants to return to America to build a museum. Amidst lies and artifice, what fate awaits adulterers?",
         "A man marries an heiress for her money even though he is actually in love with her friend."
      ],
      "budget": 15000000
   },
   "movielensId": 3756,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-05-14",
      "dvdReleaseDate": "2001-11-06",
      "directors": ["James Ivory"],
      "runtime": 130,
      "movieId": 3756,
      "title": "The Golden Bowl",
      "mpaa": "R",
      "actors": [
         "Kate Beckinsale",
         "James Fox",
         "Anjelica Huston",
         "Nick Nolte",
         "Jeremy Northam",
         "Madeleine Potter",
         "Uma Thurman",
         "Nicholas Day",
         "Peter Eyre"
      ],
      "imdbMovieId": "0200669",
      "originalTitle": "The Golden Bowl",
      "genres": [
         "Romance",
         "Drama"
      ],
      "youtubeTrailerIds": ["1xoaQs0ojZo"],
      "plotSummary": "An intricately plotted tale of thwarted love and betrayal, \"The Golden Bowl\" tells the story of an extravagantly rich American widower and his sheltered daughter, both of whom marry only to discover that their respective mates, a beautiful American expatriate and an impoverished Italian aristocrat, are entangled with one another in a romantic intrigue of seduction and deceit.",
      "tmdbMovieId": 29946,
      "avgRating": 3.11466,
      "releaseYear": "2000",
      "numRatings": 266,
      "posterPath": "/uDWTRCTvA1gyBi1QSNU2giIndch.jpg"
   }
}