{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "jekyll and hyde",
         "id": 156033
      }],
      "imdb_id": "tt0050292",
      "video": false,
      "title": "Daughter of Dr. Jekyll",
      "recommendations": [
         98092,
         35919,
         91733,
         59657,
         33388,
         26924,
         61702,
         31240,
         109109,
         59703,
         36456,
         59701,
         59581,
         80720,
         86772,
         59589,
         3210,
         28425,
         23125,
         35911
      ],
      "backdrop_path": "/fSLyiNgrBmsPtk6VFdHYSITsJIN.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "George Hastings",
               "gender": 2,
               "credit_id": "52fe4ba8c3a36847f820e1bb",
               "name": "John Agar",
               "profile_path": "/9fKJvICRu2KS6Q70R7plPUkCkTY.jpg",
               "id": 103071,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Janet Smith",
               "gender": 1,
               "credit_id": "52fe4ba8c3a36847f820e1bf",
               "name": "Gloria Talbott",
               "profile_path": "/bgnb3Uq38mVGeGvRkopHLJhIye2.jpg",
               "id": 47080,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Dr. Lomas",
               "gender": 2,
               "credit_id": "52fe4ba8c3a36847f820e1c3",
               "name": "Arthur Shields",
               "profile_path": "/mpdhGz7aExU8HP3WkiEr51PU195.jpg",
               "id": 22603,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Jacob",
               "gender": 2,
               "credit_id": "52fe4ba8c3a36847f820e1c7",
               "name": "John Dierkes",
               "profile_path": "/enFa8jeKSkySro8wto7PPcJ3bZ4.jpg",
               "id": 29645,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Maid Maggie (as Mollie McCard)",
               "gender": 1,
               "credit_id": "52fe4ba8c3a36847f820e1cb",
               "name": "Molly McCarthy",
               "profile_path": null,
               "id": 108729,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4ba8c3a36847f820e1b1",
               "name": "Jack Pollexfen",
               "profile_path": null,
               "id": 41704,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4ba8c3a36847f820e1b7",
               "name": "Edgar G. Ulmer",
               "profile_path": "/PU5rCuIxOPcffvceRU4K2Y9smj.jpg",
               "id": 5030,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Horror",
            "id": 27
         }
      ],
      "popularity": 0.85455,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 117026,
      "vote_count": 4,
      "budget": 0,
      "overview": "A young woman discovers she is the daughter of the infamous Dr. Jekyll, and begins to believe that she may also have a split personality, one of whom is a ruthless killer.",
      "similar": [
         3019,
         3023,
         3025,
         3022,
         6114,
         1562,
         364,
         268,
         118,
         415,
         170,
         259693,
         433,
         44683,
         267935,
         13188,
         3016,
         65086,
         1581,
         2252
      ],
      "original_title": "Daughter of Dr. Jekyll",
      "runtime": 71,
      "poster_path": "/cqtPspZOmH24FpViW4NsJjcEgnu.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Film Venturers",
            "id": 13739,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Allied Artists Pictures",
            "id": 4928,
            "origin_country": ""
         }
      ],
      "release_date": "1957-06-28",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "Blood-hungry spawn of the world's most bestial fiend!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Edgar G. Ulmer"],
      "runtime": 71,
      "synopsis": "The movie opens with a swirling mist and narration about the story of Dr. Jekyll and Mr. Hyde (a novella by Robert Louis Stevenson, published in 1886 and titled: \"Strange Case of Dr. Jekyll and Mr. Hyde\"). There follows a close up of a man, Dr. Lomas (Arthur Shields), mid-transformation into a Mr. Hyde like character. Title and credits roll over a long shot of a mansion. It is the early-1900s, we are somewhere in England, and an old car pulls up to the mansion. George Hastings (John Agar) helps Janet Smith (Gloria Talbott) out of the car. He moves the luggage up to the house and rings the doorbell. Jacob (John Dierkes) answers the door but has no reaction to Janet. He stands there mute staring at her. Mrs. Merchant (Martha Wentworth) pushes him aside and welcomes Janet and George. Janet goes upstairs to her room where she meets her maid, Maggie (Molly McCart). She freshens up and changes for dinner. Maggie is in a hurry to walk home to the village. She refuses to sleep in the house, but won't give Janet an explanation. Maggie leaves the house, but the moon has already risen. Janet asks Mrs. Merchant about Maggie's superstition. Dr. Lomas, Janet's Guardian, arrives home and greets Janet and George. Janet explains George came along to celebrate her twenty-first birthday. She also explains that she and George are to be married. Dr. Lomas expresses his surprise. He tells her he should have been consulted before such an announcement. She is seeking an independent life, free of any financial entanglements with Dr. Lomas. While she is grateful for seeing to her needs as a child, she and her new husband want independence. Lomas tells her she was never living on his money, but her own money. She is an heiress to an estate and considerable fortune. The house and surrounding land is vast, and all hers. He has one final item on his list, but he begs off telling her. He says it can wait until morning. The next morning George and Janet join at breakfast. They explore the house. Janet tells George she's already counted thirty-six rooms. George notices that the room they are in is missing some space. There must be a secret room nearby. As this is an old house, hidden rooms in large houses were common. Janet opens the visor on a suit of armor and the bookcase swings open revealing the hidden room. It is a well-equipped chemical laboratory, but the dust suggests it hasn't been used for quite a while. Dr. Lomas enters and tells Janet the room was originally used to hide Jesuits at the time of Henry VIII, but her father used it as a lab. He tells George he must speak to Janet alone. Despite Janet's protests that George remain, Lomas is adamant. George leaves the room and Lomas and Janet talk. Jacob is out gathering wood. One of his jobs on the estate is to stoke the cooking stove and fireplaces. Janet comes down to see George in the dining room. She tells George, \"I can't marry you. You must go and forget me.\" George demands an explanation, but Janet refuses to discuss the matter. Lomas asks Janet if he may tell George the story. She nods yes. The three leave the house and walk to the family crypt. Lomas unlocks the door and they enter. Jacob lets himself into the crypt with his own key to eavesdrop. Janet sees the tomb of Dr. Henry Jekyll, her father. Lomas explains Jekyll's theory and drugs--a recounting of the Stevenson story. Lomas tells the pair he saw Mr. Hyde only once before the mob killed him. Janet is concerned the madness may be hereditary. They leave the crypt and return to the house. Dr. Lomas suggests Janet get a good night's rest. He tries to hypnotize her. Maggie enters with Janet's warm milk to help her sleep. Lomas leaves and Maggie helps Janet get ready for bed. Maggie leaves for the village after telling Janet that during the full moon the monster Jekyll rises from his tomb. Janet dreams she is transformed and chases and kills Maggie. Her screams bring George, Lomas and Mrs. Merchant into her bedroom. Lomas gives her something to help her sleep. A short time later, Janet gets out of bed and notices blood on her hands and nightgown. The next morning George tells Lomas he wants Janet to leave today. Lomas advises against it for vague medical reasons. Janet, for her part, can't make a decision. Mrs. Merchant tells all assembled for breakfast that Jacob didn't show up and that Maggie is late. Jacob enters the house carrying the dead body of Maggie. She has a huge bruise on her neck. He puts her body on the couch for Lomas to examine. Jacob blames it on a werewolf, \"We've seen it before.\" He directs his comments towards Janet. He addresses her as Ms. Jekyll. Janet sobs. Jacob arrives two hours late with groceries for the house. He was down at the local pub and has been drinking. Mrs. Merchant is mad, and they talk. She tries to set him straight, but is unsuccessful. Dr. Lomas puts Janet to bed, gives her a sedative and locks her in her room. That evening Jacob prowls around by the family crypt. Janet sleeps fitfully. She dreams she is outside wandering around the countryside. She encounters a young man (Marel Page) and woman (Rita Greene). She attacks and kills the woman in the woods. Janet wakes and again finds blood on her hands and nightdress. George and Lomas respond to her screams. Jacob enters the bedroom and informs Lomas they found Lucy, the young woman killed. Jacob blames Janet and he is fired on the spot. He tells them, \"Let me tell you something. It won't be long till the daughter of Dr. Jekyll joins her father in the vault with a stake in her heart. We know how to deal with werewolves.\" Mrs. Merchant quits and leaves the house. Lomas goes to find another housekeeper. After he leaves, George retrieves a book from the library entitled, \"Witch, Warlock and Werewolves.\" He begins to read a passage on werewolves. Janet, now dressed, comes downstairs and looking over George's shoulder reads the rest of the passage. Janet becomes hysterical. George takes her back to her room and gives her the pills Dr. Lomas left for her. Lomas returns home and tells George that he talked the constable out of swearing out a warrant for Janet, but there will be a coroner's inquest and Janet will be summoned as a witness. So now Janet has no decision to make about leaving, she cannot leave town until this matter is resolved. George goes up to see Janet but returns almost immediately and informs Lomas that Janet is missing. They search the house without success, so they search the grounds. They find her just outside the family crypt. George takes her back to the house. Lomas finds Jacob by the crypt sharpening a stake and orders him off the grounds. Back in Janet's bedroom, George nails the windows shut. Janet takes the sedative Lomas provides. Lomas volunteers to spend the night in her room guarding her. He wants to catch up on his reading of medical journals. With a candle, Lomas hypnotizes Janet and leads her out of her room. George gets out of bed. He is already dressed, and follows the pair. He suspects something. Lomas and Janet enter the hidden lab. They walk to the crypt. Lomas tells Janet she will dream again, she will attack and kill a woman, cut herself and cover her face and hands with blood, and then commit suicide by hanging herself. George follows Lomas upstairs in the crypt and is surprised to see him transform into a werewolf. George now sees for himself that is was Lomas who has been killing and blaming it all on Janet. He got Janet to believe she committed the horrible acts via hypnosis. Lomas attacks George and knocks him out. Lomas enters the village and spies on a woman getting dressed (Marjorie Stapp). She gets a phone call warning of the danger in the village. She is attacked by Lomas and killed while a phonograph plays in the background. Lomas runs off chased by two villagers armed with rifles. More men join the posse. As George comes to he sees Janet stringing the rope to hang herself. She starts to scream and George has to slap her into consciousness. He explains that Dr. Lomas is mad and committed the murders. He tells her Lomas hypnotized her. He wants control of the estate. They try to exit the crypt, but the door is locked. The mob is getting closer to Lomas. One shoots the doctor. He stumbles to the crypt. George tells Janet to lie down on her father's tomb and pretend she is still in a trance. The mob has now grown to a few dozen men and they are getting closer to their target. Lomas enters the crypt and smears blood on Janet. George attacks Lomas with a club, they struggle, but Lomas is too strong. George knocks Lomas down and Jacob, who entered the crypt with part of the mob, spears him in the heart with a stake. Lomas transforms from a Mr. Hyde character back to Dr. Lomas and dies. Jacob announces, \"He will never prowl the night again.\" We cut to the same opening scene of Lomas in mist and are asked, \"Are you sure?\" This is followed by a demonic laugh. The movie closes with a long shot of the house and more demonic laughing.",
      "writers": ["Jack Pollexfen"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0050292/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg0ODcyMDY0MF5BMl5BanBnXkFtZTgwODQ3Nzk1MDE@._V1_.jpg",
      "actors": ["Stars: John Agar, Gloria Talbott, Arthur Shields | See full cast and crew »"],
      "reviews": [
         "I read some of the other comments regarding this movie, and I have to disagree with them...I found this obscure movie starring Gloria Talbott and John Agar to be entertaining. Granted, this a low budget movie so I didn't have a lot of expectations. But I found the atmosphere to be appropriately spooky and I thought it was an interesting twist on the Jekkyl and Hyde story. The plot line is rather predictable, and the special effects are not great, but if you are a fan of low budget 1950's horror flicks, or love John Agar and Gloria Talbott, you should enjoy this movie. I am a fan of low budget horror movies so this probably made a difference in the way I viewed this movie. Gloria Talbott was very pretty and capable in her role, although John Agar looked like he wanted to be anywhere than in this movie. (What was with the striped jacket he had to wear throughout the whole movie?!!) I found this movie to be fun. Just don't expect too much and you will enjoy this.",
         "I haven't seen this movie since I was ten years old, but it scared the hell out of me then. That was over forty years ago. Seeing Gloria Talbot standing in front of that mirror and see herself seemingly transform into a werewolf gave me the creeps, and then the cut to the full moon rolling through the clouds. Mighty scary stuff. It was made even more scary by that eerie music that played into the background. I thought this movie would never end. I wish I could remember more of it, but it's been so long since I've seen it. I would love to see this on DVD, it's been so long since I've seen it. It's probably tame by today's standards, but if you're a ten year old kid looking for something to give you a good scare, then this movie will do it. It did for me.",
         "Most of the time this movie is creepy and decently shot reminding me at best of \"Night of the Hunter\" and at worst of atmospheric fog machine filled horror. I thought of \"Night of the Hunter\" during the scene where the Daughter waits outside her father's tomb while in the same shot we see the big village man carving a stake. Very ominous. That said, the stake death is the worst I've seen. The technique of superimposing one shot over another for action/dream sequences worked well in my opinion, but others may find it unoriginal. Monster make-up and blood effects were pretty good. Over all the movie is serious with a comic moment I liked with the Monster showing obvious joy as he views a women in her night clothes through an open window. The narration at the beginning and the Monster's ridiculous line don't fit the mood of the picture.",
         "Not an easy film to get to see in the UK. I had read many reviews giving this film the thumbs down; when I finally saw it I thought it was an excellent example of a 1950's horror/sci-fi movie attempting to cash in on the current trend which was tending towards the sci-fi element.This film hedges its bets by having both elements i.e Dr Jeykyll's potions for sci-fi and the \"werewolf\" for the supernatural horror. It also has the element of the \"mystery\" created by Arthur Shields'(Barry Fitzgerald's brother) attempts to explain everything away. All no doubt intended to mystify the teenagers who were the film's target audience. However,in spite of all this there is a nice creepy atmosphere to the film and it kept me interested for the 75 minutes or so running time.(Apparently for US TV airings,the \"monster chase \" scene from \"Frankenstein 1970\"was added in an attempt to boost the length.) Now for the question-is the film's \"success\" due to Edgar Ulmer's presence? Personally I think so but I am apparently in the minority",
         "Not to be confused with \"Dr. Jekyll and Sister Hyde\" (1972) or \"Dr. Jekyll and Ms. Hyde\" (1995), \"Daughter of Dr. Jekyll (1957) is a moderately interesting quickie from legendary Poverty Row director Edgar G. Ulmer. In this one, Gloria Talbott--who would find the role for which she is perhaps most fondly remembered in the following year's \"I Married a Monster From Outer Space\"--learns, on her 21st birthday, that she is the eponymous daughter of the infamous scientist. This causes her and her fiancé, 1950s sci-fi stalwart John Agar, some understandable angst, especially when a series of murders commences in the nearby village... To be painfully honest, there really is nothing much to this movie, but Ulmer directs with so much panache, and Talbott, as usual, is so pretty and appealing, that these two elements put the film over. Especially effective are two surrealistic nightmare episodes suffered by Talbott, as well as Ulmer's use of fog and swirling mist; his cloud-covered moon shots are a real thing of beauty, too. On the down side, we have a surprise ending that is not much of a surprise, and a plot that would have us believe that Jekyll's alter ego Hyde was really a bloodsucking werewolf! This film is certainly not the horror masterpiece that Ulmer's \"The Black Cat\" (1934) turned out to be. Still, it IS fun, and this DVD is as crisp and clean looking as can be. Modern-day interviews with Agar and with Ulmer's daughter make for nice extras, too.",
         "Not one of Edgar G. Ulmer's best, but I'm glad they saw fit to release this one on DVD. However, if you're looking for another little Ulmer classic like BLUEBEARD (1944) or DETOUR (1945), you'd better look somewhere else 'cause this ain't it. Gloria Talbott, the daughter of the late Dr. Jekyll, is slowly being hypnotized and pumped full of drugs into believing that she is the killer of a couple of women who were found near her late father's estate. She is slowly being driven mad by the real killer who wants her to take the blame for it. Of course she isn't the one because she's the heroine and we can't have the heroine turn out to be a bad guy. This is the 50s, after all. We also have John Agar as the Talbott's fiancée and Arthur Shields as the weirdo who is the executor of the late Dr. Jekyll's estate. They don't really add much of anything to all this beyond chewing up some film time. That is, until the very last 5 minutes of the film. But what's really a bummer is that the killer is revealed in the very first flashback of the film, so why Ulmer threw away the element of surprise is a real mystery. I guess you'll just have to see it for yourself. And considering the fact that Allied Artists didn't always use the best of film stock, the digital remastering looks as good as can be expected for a low budget film like this. No more excessively grainy prints to look at. I'll give it a 4 out of 10 for at least being worth a look, especially if you're into Ulmer's films like I sometimes am.",
         "This is a low-grade horror film which has been culted into a reputation beyond its worth because of its director's involvement. The plot is strikingly similar to that of another notorious potboiler - SHE-WOLF OF London (1946) - but, at least, here the monster is seen (albeit ineffectively made-up): despite the titular reference, the script pays little to no credit to previous cinematic incarnations of the R.L. Stevenson novella - opting, instead, to indiscriminately incorporate elements of lycanthropy and vampirism which make no sense at all...but which lend the film value as a unique curio and one which, in view of its sheer audacity, it is difficult to hate (indeed, the whole misguided enterprise reminded me of the contemporaneous FRANKENSTEIN 1970 [1958])! Despite the ultra-cheap production, the film makes the most of its foggy atmosphere and the hallucination sequences are effective in a naïve sort of way. Casting is below-par but, at least, Arthur Shields (who also appears in a silly book-end in full monster make-up - but, then, as Gloria Talbott's legal guardian spends the rest of the film trying to convince her that she is the werewolf!!) and John Dierkes (as a particularly vehement believer in the Jekyll 'legend' despite being in their employ - or, so it seems, since he's always hovering about the estate!) enter gleefully into the spirit of the thing. I had been toying with the idea of purchasing the All Day DVD of this one ever since it was released; I'm glad I managed to catch up with it eventually without having to purchase the disc - being shown on late-night Italian TV, as part of a Jekyll & Hyde marathon which included snippets from a variety of films based on the venerable tale (I was especially gratified by the inclusion of a couple of scenes from Jean Renoir's THE TESTAMENT OF DR. CORDELIER [1959], which I've been yearning to see forever, and also ABBOTT & COSTELLO MEET DR. JEKYLL & MR. HYDE [1953], which I haven't watched in ages - I really ought to get down to purchasing either the R1 or R2 DVD releases of the films featuring the comic duo!)...",
         "I saw this movie when it was originally released in 1957. I was eight years old and I think I was a little frighten when I saw \"Daughter Of Dr. Jekyll\" on the big screen. I rented the video recently and now I am fifty-eight years old in 2007 and I found the movie to still give me a little bit of chills. I think I understand other reviewers did not like the movie,yet it was a low budget film and I think the performers did it good job. Actress Gloria Talbott did it good job in her role as the daughter of Dr. Jekyll; actor John Agar may have not liked playing his role in the film, but he did not do a bad job. Actress Gloria Talbott plays Janet Smith who discovers she has inherited her late father's estate. She discovers her late father was the infamous Dr. Henry Jekyll;I like the dream sequence where she looks like a vampire on a rampage in the village woods. There is a comical sequence when Dr. Lomas transforms into a werewolf and runs through the village woods and peers in a neighbor's open window and sees a woman in her undergarments putting on her nylon stockings. finally, the hero and heroine help the villagers stop the murderous Dr. Lomas and put a stake in his heart to stop his full moon werewolfism.",
         "On her 21st birthday, Janet Smith (Gloria Talbott) discovers she has inherited an estate and a large sum of money. She's suddenly a wealthy woman about to be wed to the man of her dreams, George Hastings (John Agar). But she learns something else. She learns her father's secret. She discovers she is the daughter of the infamous Dr. Jekyll. And she begins having vivid nightmares of killing people in the most horrible of ways. She wakes to find herself covered in blood, her clothes torn, and her shoes muddy. Has she somehow inherited a dark, split-personality from her father that turns her into a snarling maniac? For anyone who has seen both Daughter of Dr. Jekyll and Universal's She-Wolf of London, am I alone in comparing the two? I hate to give too much away about either movie, but there's no denying the similarities \u0096 two women about to be married, both under the impression that they turn into killers when the moon is full, slowly being driven mad, yet neither is responsible for the acts they are accused. It's too much of a coincidence to be just dumb luck. Oddly enough, though, I prefer Daughter of Dr. Jekyll to She-Wolf of London. It's not a great movie by any stretch of the imagination, but it is slightly more enjoyable to me than the earlier movie. Chief among the reasons that I prefer this movie is the female lead. June Lockhart is one of my biggest complaints with She-Wolf of London. Gloria Talbott is far more believable in the similar role. My biggest complaint with Daughter of Dr. Jekyll is the changes it makes to the Jekyll/Hyde storyline. Hyde is now referred to as a werewolf that had to be staked through the heart to kill him. Huh? So now he's some sort of werewolf/vampire creature? News to me! And I never quite understood how his daughter was supposed to have inherited his \"curse\". Wasn't Dr. Jekyll's \"curse\" self-induced? It doesn't seem that something that could be passed from one generation to the next.",
         "\"The Daughter of Dr. Jekyll\" is a confused jumble of horror film clichés in which the savage Mr. Hyde is repeatedly referred to as a \"human werewolf\" (!) who could only be killed when a stake was driven through his heart (!!). There are lots of things wrong with that premise, but the one unforgivable sin committed here is the infliction of dullness upon the viewer: \"Daughter\" is truly one of the most toothless, uninteresting horror movies I've ever seen. Pretty Gloria Talbott (the titular daughter) and dignified, reserved Arthur Shields (the seemingly kindly Jekyll family retainer whose true intentions are anything but wholesome) can't save it. As Talbott's husband-to-be, John Agar is strictly phoning it in; by all accounts he hated doing this film and I don't blame him one bit. Everything about \"Daughter\" is utterly pedestrian. Director Edgar G. Ulmer (beware, Ulmer fans: this is a far cry from \"The Black Cat\" or even \"Bluebeard\") and his cast made no serious attempt to rise above the mediocrity of Jack Pollexfen's script. They just shot the picture, called it a day, and went home. Naturally, no one expects these little genre films to be masterpieces, but you do expect them to hold your attention. With a lack of scares and atmosphere, and laughably unrealistic action scenes to boot, \"The Daughter of Dr. Jekyll\" is an all-around stinker. (I've seen worse movies, but rarely have I seen a more boring one!)"
      ],
      "genres": [
         "Fantasy",
         "Horror"
      ],
      "productionCompanies": ["Film Venturers"],
      "summaries": ["A young woman discovers she is the daughter of the infamous Dr. Jekyll, and begins to believe that she may also have a split personality, one of whom is a ruthless killer."],
      "budget": 0
   },
   "movielensId": 3762,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "1957-06-28",
      "dvdReleaseDate": "2000-06-13",
      "directors": ["Edgar G. Ulmer"],
      "runtime": 71,
      "movieId": 3762,
      "title": "Daughter of Dr. Jekyll",
      "mpaa": "",
      "actors": [
         "John Agar",
         "Gloria Talbott",
         "Arthur Shields",
         "John Dierkes",
         "Molly McCarthy"
      ],
      "imdbMovieId": "0050292",
      "originalTitle": "Daughter of Dr. Jekyll",
      "genres": [
         "Fantasy",
         "Horror"
      ],
      "youtubeTrailerIds": [
         "hiAxVO9_8OM",
         "C4RVwKNmaX0"
      ],
      "plotSummary": "A young woman discovers she is the daughter of the infamous Dr. Jekyll, and begins to believe that she may also have a split personality, one of whom is a ruthless killer.",
      "tmdbMovieId": 117026,
      "avgRating": 2.23333,
      "releaseYear": "1957",
      "numRatings": 15,
      "posterPath": "/cqtPspZOmH24FpViW4NsJjcEgnu.jpg"
   }
}