{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "tattoo",
            "id": 331
         },
         {
            "name": "sinbad",
            "id": 10107
         }
      ],
      "imdb_id": "tt0071569",
      "video": false,
      "title": "The Golden Voyage of Sinbad",
      "recommendations": [
         11940,
         15515,
         26398,
         34276,
         18993,
         10553,
         55871,
         25473,
         29778,
         40804,
         26643,
         44126,
         21296,
         848,
         29748,
         58902,
         19143,
         49299,
         27726,
         21454
      ],
      "backdrop_path": "/49RxhKZUgOUbUkiK5t6QfZni26x.jpg",
      "revenue": 11000000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Captian SInbad",
               "gender": 2,
               "credit_id": "52fe47509251416c75094eb3",
               "name": "John Phillip Law",
               "profile_path": "/rlcXnlH9FnIh7IREesu9wy6atFr.jpg",
               "id": 29426,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Margiana",
               "gender": 1,
               "credit_id": "52fe47509251416c75094eb7",
               "name": "Caroline Munro",
               "profile_path": "/wAZYXnDfMas4j8SpbQfpSOJWlAA.jpg",
               "id": 10461,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Prince Koura",
               "gender": 2,
               "credit_id": "52fe47509251416c75094ebb",
               "name": "Tom Baker",
               "profile_path": "/5YVqQyW8jiAPHnRsPEbR08fiOAQ.jpg",
               "id": 44865,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Vizier",
               "gender": 2,
               "credit_id": "52fe47509251416c75094ebf",
               "name": "Douglas Wilmer",
               "profile_path": "/3aUnwOD2fBGMBcaE9Hj4EqtxKWO.jpg",
               "id": 89065,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Rachid",
               "gender": 2,
               "credit_id": "52fe47509251416c75094ec3",
               "name": "Martin Shaw",
               "profile_path": "/b8LhpaQmnaPLaFyK5iHSaK76wBb.jpg",
               "id": 68985,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Hakim",
               "gender": 2,
               "credit_id": "52fe47509251416c75094ec7",
               "name": "Grégoire Aslan",
               "profile_path": "/1KymTHXP2weyuSYNJeXzrNmGCPM.jpg",
               "id": 53819,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Haroun",
               "gender": 2,
               "credit_id": "52fe47509251416c75094ecb",
               "name": "Kurt Christian",
               "profile_path": null,
               "id": 114644,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Achmed",
               "gender": 2,
               "credit_id": "52fe47509251416c75094ecf",
               "name": "Takis Emmanuel",
               "profile_path": null,
               "id": 65896,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Abdul",
               "gender": 2,
               "credit_id": "52fe47509251416c75094ed3",
               "name": "David Garfield",
               "profile_path": null,
               "id": 31463,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Kali stand-in",
               "gender": 2,
               "credit_id": "52fe47509251416c75094ed7",
               "name": "Ferdinando Poggi",
               "profile_path": null,
               "id": 114645,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Omar",
               "gender": 2,
               "credit_id": "52fe47509251416c75094edb",
               "name": "Aldo Sambrell",
               "profile_path": "/doSGQEp3BDSCDmbX8hlaTOoqXST.jpg",
               "id": 49895,
               "order": 10
            },
            {
               "cast_id": 26,
               "character": "The Oracle of all knowledge",
               "gender": 2,
               "credit_id": "5a2a9bda9251410324123bf2",
               "name": "Robert Shaw",
               "profile_path": "/jJpquJQB2XGqZ1Mrc35VmgT2UcR.jpg",
               "id": 8606,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47509251416c75094eaf",
               "name": "Gordon Hessler",
               "profile_path": "/wy86My4mKQPPGhjZ7JD7456Wvam.jpg",
               "id": 82505,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47509251416c75094ee1",
               "name": "Brian Clemens",
               "profile_path": "/zQ1UMywNs3h1G2o68XuLKIpO9si.jpg",
               "id": 26128,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe47509251416c75094ee7",
               "name": "Brian Clemens",
               "profile_path": "/zQ1UMywNs3h1G2o68XuLKIpO9si.jpg",
               "id": 26128,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe47509251416c75094eed",
               "name": "Ray Harryhausen",
               "profile_path": "/nxsvHuPnWQBFuGOq6Gs100kh74R.jpg",
               "id": 66758,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe47509251416c75094ef3",
               "name": "Ray Harryhausen",
               "profile_path": "/nxsvHuPnWQBFuGOq6Gs100kh74R.jpg",
               "id": 66758,
               "department": "Visual Effects",
               "job": "Visual Effects"
            },
            {
               "gender": 2,
               "credit_id": "52fe47509251416c75094ef9",
               "name": "Ray Harryhausen",
               "profile_path": "/nxsvHuPnWQBFuGOq6Gs100kh74R.jpg",
               "id": 66758,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47509251416c75094eff",
               "name": "Charles H. Schneer",
               "profile_path": "/2HUfWC6uXFy7ed3eciHwORt6aVm.jpg",
               "id": 66759,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47509251416c75094f05",
               "name": "Miklós Rózsa",
               "profile_path": "/1eAU1ckh7SUNMP9IZeii9qX5xa.jpg",
               "id": 7647,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47509251416c75094f0b",
               "name": "Ted Moore",
               "profile_path": null,
               "id": 9867,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe47509251416c75094f11",
               "name": "Roy Watts",
               "profile_path": null,
               "id": 19171,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe47509251416c75094f17",
               "name": "Maude Spector",
               "profile_path": null,
               "id": 10340,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "52fe47509251416c75094f1d",
               "name": "John Stoll",
               "profile_path": null,
               "id": 6793,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "578b53549251417b68006ab2",
               "name": "Fernando González",
               "profile_path": null,
               "id": 1652086,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 7.344236,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 17897,
      "vote_count": 69,
      "budget": 0,
      "overview": "Sinbad and his crew intercept a homunculus carrying a golden tablet. Koura, the creator of the homunculus and practitioner of evil magic, wants the tablet back and pursues Sinbad. Meanwhile Sinbad meets the Vizier who has another part of the interlocking golden map, and they mount a quest across the seas to solve the riddle of the map.",
      "similar": [
         27578,
         47971,
         9804,
         22803,
         77,
         339692,
         10546,
         15515,
         308369,
         45284,
         527,
         13012,
         50217,
         9660,
         14070,
         58699,
         19761,
         9519,
         12778,
         46063
      ],
      "original_title": "The Golden Voyage of Sinbad",
      "runtime": 105,
      "poster_path": "/xdoFnJQ9MmHbY6VrVC7LMpiwmWB.jpg",
      "spoken_languages": [
         {
            "name": "العربية",
            "iso_639_1": "ar"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [{
         "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
         "name": "Columbia Pictures",
         "id": 5,
         "origin_country": "US"
      }],
      "release_date": "1973-12-20",
      "vote_average": 6.5,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "The Sinbad Collection",
         "id": 321063,
         "poster_path": "/t1vJrS8oSN9JpiLdVRhadMXy52X.jpg"
      },
      "tagline": "Dynarama Means Supreme Adventure!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Gordon Hessler"],
      "runtime": 105,
      "synopsis": "While sailing, Sinbad comes across a golden tablet dropped by a mysterious flying creature. He wears the tablet as an amulet around his neck. That night, Sinbad has a strange dream in which he sees a man dressed in black, repeatedly calling Sinbad's name, and also about a mysterious girl with an eye tattooed on her right palm. During his sleep, a mysterious storm throws his ship off course, and the next day Sinbad and his men find themselves near a coastal town in the country of Marabia. Swimming to the beach, Sinbad is met by a dark-cloaked man, who demands his amulet. Sinbad narrowly escapes into the city, where the city guard forces the hostile stranger to flee. Soon, Sinbad encounters the Grand Vizier of Marabia (Douglas Wilmer). The Vizier, who wears a golden mask to hide his disfigured face, says that Sinbad's amulet is actually one piece of a puzzle; the Vizier has another. The Vizier relates to Sinbad a legend that the three pieces, when joined together, will reveal a map showing the way to the Fountain of Destiny, hidden somewhere on the lost continent of Lemuria. The legend tells that he who bears the three pieces of the puzzle to the fountain will receive \"youth, a shield of darkness, and a crown of untold riches.\" Sinbad agrees to help the Vizier find the fountain. They join forces against Prince Koura (Tom Baker), the black-cloaked man who is an evil magician bent on conquering Marabia. Koura had locked the Vizier in a room and set it on fire, horribly burning his face. The creature that dropped the gold tablet was one of Koura's minions, a homunculus created by his black magic. Using this creature he hears the conversation, and it turns to ash when it is found. Shortly afterward, Sinbad meets the girl he saw in his dream, Margiana (Caroline Munro), a slave-girl. Her master hires Sinbad to make a man of his lazy, no-good son Haroun (Kurt Christian), and Sinbad agrees on the condition that Margiana goes with him; so the two new passengers and the Vizier board Sinbad's ship. Koura hires a ship and crew of his own and follows Sinbad, using his magic several times to try to stop Sinbad. However, each attempt drains away part of his life force and he ages noticeably each time. Along his journey, Sinbad fights the wooden siren figurehead from his own ship which Koura has animated, which steals the map, enabling Koura to find the Island. However Sinbad has memorised the map. Koura gets to the Island and uses another homunculus to hear the Oracle of All Knowledge (an uncredited Robert Shaw) as it describes to Sinbad what he will face. Koura then seals the men inside the cave, however Sinbad is able to escape with a rope and get the others out. The Homunculus is killed with an arrow as it tries to stop Sinbad. Koura animates a six-armed Kali idol when he is captured by hostile natives, causing them to free him. However, Sinbad and his men arrive and fight and defeat Kali. The natives capture Sinbad and his crew and give Margiana to a one-eyed centaur, the fountain's guardian of evil. Sinbad and the others escape when the Vizier shows his burnt face, scaring the natives. The Centaur fights (and kills) the guardian of good, a griffin, with Koura's help, however Sinbad then stabs it dead. Once they reach the fountain, Koura obtains all the pieces, assembles the puzzle, and drops it in the fountain. His health is restored and he becomes invisible (the \"shield of darkness\"). However, he is slain in a sword duel by Sinbad, who then takes the \"crown of untold riches\" that rises out of the fountain and gives it to the Grand Vizier. Sinbad explains to Margiana that he values freedom more, and a king is never really free. The crown's magic powers causes the Vizer's mask to dissolve to reveal his healed face, and Sinbad journeys back to Marabia with Haroun, who has proven himself during the adventure, as a new crew member and Margiana by his side.",
      "writers": [
         "Brian Clemens",
         "Brian Clemens"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0071569/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg1NDczNTkxN15BMl5BanBnXkFtZTcwMDQzNjEyMQ@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: John Phillip Law, Caroline Munro, Tom Baker | See full cast and crew »"],
      "reviews": [
         "After Sinbad (Jon Phillip Law) happens upon a strange gold \"bauble\" while at sea, his ship ends up at a town where a similar gold piece is kept by a Vizier (Douglas Wilmer), whose city is threatened by the evil prince Koura (Tom Baker). Sinbad, his crew, the Vizier, and two other people from the town begin an adventure to solve the mystery of the \"baubles\". This is a fine fantasy/adventure film, and definitely one worth watching by any fans of the genre, as well as Ray Harryhausen fans. Mostly excellent, The Golden Voyage of Sinbad also has a couple of flaws that brought my score down to an 8 out of 10. The main problem is that the film tends to meander at times. There are also a few minor problems with direction or editing, such as the less-than-convincing sword fight in the cave near the end of the film. Also, the mostly episodic nature of the script lessens the overall impact. It often feels like a string of short stories arbitrarily strung together, although in the end, the overarching goal ties the film together well enough. But what \"short stories\" those are! The script, production/set design and costumes easily propel you into a captivating fantasy world, and Harryhausen's creatures, as always, are a delight to watch. No, they're not exactly realistic--no more realistic looking than cgi, in my opinion--but I'm not looking for realism when I watch a film like this. I'm looking for brilliant artistry, especially if it has a horror edge, and Harryhausen's stop-motion animated creatures fit the bill. Most of the scenarios in the film are cleverly conceived. They're constantly leading to intriguing puzzles that have to be solved by our heroes, somewhat similar to a fantasy role-playing computer game, which films like this surely influenced. This maintains a gradually heightening suspense throughout the length of the film, as each puzzle tends to be more difficult than the previous one, and most are accompanied by fascinating beasties of some kind. Although this genre is not usually noted for its fantastic performances, everyone in The Golden Voyage of Sinbad does a great job. Even as a Doctor Who fan who grew up watching the Tom Baker era of that show, it took me awhile to figure out who Baker was here. He is a joy to watch as a slightly campy villain. An even bigger joy to watch was Caroline Munro, who is breathtakingly beautiful. And Law, as Sinbad, is completely convincing and cool. As long as you don't expect a masterpiece, you should have a lot of fun watching this film.",
         "Ignore pointless comparisons about how it pales in comparison to Lord of the Rings. This isn't Lord of the Rings, nor is it Citizen Kane. Why some fools insist that every movie must be measured by the yardstick of their own personal favorite I will never understand. If you're so spoiled by state-of-the-art computer graphics where each creature has an entire team of people working on it, and can't appreciate the human creativity and craftsmanship of great stop-motion animation, don't waste your time on this movie, go watch the latest Pixar release. Harryhausen's work is remarkable not because it's the most realistic animation ever, but because he was able to achieve remarkable things with sculpture and movement on a budget comparable to today's 30 second ad spots. Tom Baker steals the movie. He's terrific as the evil sorcerer, villainous but with enough humanity to his character to make him at least somewhat sympathetic.",
         "'Golden Voyage' is much better than the later 'Sinbad and the Eye of the Tiger' and equal to the earlier 'Seventh Voyage of Sinbad'. The Harryhausen creatures are impressive. Stop motion animation does give solidity to the image, more so than the usual CGI effect. There are some fine ones here including a one eyed centaur, a homunculus, a griffin, a six armed statue, a ship's wooden figurehead. The story is standard but the effects, the locations and the plot weave together well. There is also a dry humour in the dialogue which is entertaining. Scenes like the sword fight with the six armed statute (with six swords!) or the final confrontation at the fountain of wisdom (or something like that) are exciting. The great Miklos Rosza's music adds considerably to the atmosphere. John Philip Law is OK as Sinbad and does attempt an Arabian accent unlike the usual English one, but the role isn't Shakespearean and he does well enough. Caroline Munro looks splendid in her costume, low cut almost everywhere. The rest of the cast support well. Tom Baker is excellent as the villain Koura. He makes him sympathetic; what drives him is common to all people. He just uses different means to gain his ends. He dominates the scenes he is in and it is a pity that more big screen roles never came his way. He was the best 'Doctor Who' in the BBC series, in my opinion of course. A good fantasy romp to appeal to the adventurer in all of us. Did I mention Caroline Munro's costume? Oh, I did.",
         "Made 14 years after The 7th Voyage Of Sinbad, this follow up is ,unsurprisingly, not as good, but that WAS a ground breaking classic. Perhaps sensing that they could not top the first film, the filmmakers give this movie a slightly different feel. If 7th Voyage was full of colour and size, Golden Voyage is somewhat darker and less spectacular. Most of the action occurs at night or in caves, while none of the creatures are especially large. This makes Golden Voyage slightly less of a delightful romp, but it's certainly not just a rehash. There is a strong sense of the uncanny to some scenes,such as the villain's resurrection of the tiny humunculus, or the coming to life of the ship's figurehead. The pace is possibly a little two leisurely, but the action is still terrific, the showstopper being Sinbad and his men battling the 6 armed statue of the Indian goddess Kali, a masterpiece of effects and editing. Tom Baker is the most sinister of all Harryhausen's villains, and Miklos Rozsa's wonderfully rich and grand score never fails to provide excellent backing. It's very different from Bernard Herrmann's classic Harryhausen scores, but as effective. Despite their flaws, there is a wonderful innocence to these Harryhausen films. A modern version would be filled to the brim with CGI, hyperactive editing, 'clever' laughs that show that no one is bothering to take any of this seriously ,etc....... Is that really an improvement?",
         "Ah, yes; Ray Harryhausen and Sinbad. This is my favorite of the Sinbad films. Yes John Phillip Law is not an a-list actor; but, for once, he's not bad. Tom Baker is outstanding as the evil wizard. Carolie Munro is the breast, er, best sight in the film. Harryhausen really captures the atmosphere of the Arabian Nights. There is adventure, mystery, terror, love, comedy, and some pretty good sword fights. I'll put the six-armed Kali up against the skeleton from the Seventh Voyage of Sinbad any day. And Tom Baker's wizard is far more evil. Look, forget about CGI and enter the world of Dynamation! You'll have a good time. Now, where's that scene where Caroline Munro.........",
         "How can you not love this film .. it's difficult to imagine that anyone could pan the astounding performance of John Phillip Law as Sinbad .. His turn as the beloved Arabic pirate is more adventureous than the boring and cardboard studio fave, Kerwin Matthews and far better than the bland and horrific Patrick Wayne .. The special FX of Ray Harryhausen are his best to date .. The plot is solid and the talent pull this tale off without a hitch or glint of camp which is generally the norm in a cult film such as this.. This is Saturday afternoon television at its best ... Onward and upward with John Phillip Law all the way ..",
         "Contrary to a previous viewer's opinion, The Golden Voyage of Sinbad is a wonderful, exciting film. The plot is a bit complex as a malevolent sorcerer races with Sinbad against time to secure a missing piece of an amulet that will insure the holder of powers beyond imagination. John Phillip Law is a pretty decent Sinbad, and the rest of the cast is quite adequate with Caroline Munro busting out of her outfit as both a figurative and literal standout and Tom Baker is very good as the evil magician. The real star once again, however, is Ray Harryhausen. His stop-motion creations are all very good. This time round we get a gargoyle-like homonculus, a wooden siren, a griffin, a centaur, and the image of six-armed Kali. The action sequences are riveting and the pace of the film is nice and brisk. Very entertaining!",
         "This film was a big hit in 1974 and many other Sinbad films have been made and there is no comparison to our new films today, it was a great success in the 70's and is enjoyable to view and enjoy the great acting of John Phillip Law (Sinbad) and his woman companion, Caroline Munro(Margiana) who battle all the evil spells and evil powers that Tom Baker,(Koura) tries to use against Sinbad. Every time Koura uses the Evil Powers, his face begins to look like an old man and he even gets weaker and weaker. There is clashing of swords and deep pits of hell Sinbad falls into and he still manages to fight the bitter struggles of Evil vs. Good. Caroline Munro gives a great supporting role and Tom Baker is completely in control of his role as a very EVIL Demon. Enjoy this Sinbad from the Past, it is worth watching.",
         "I've said it before and I'll say it again, \"Love that Ray Harryhausen\". As far as Harryhausen's effects go, this is a very adventurous effort for him. The animated ship figurehead,AWESOME!, the six arned statue, BRILLIANT!, and the epic monster summoning battle at the end is a dream come true. I can't believe the griffon got beat by that brain-dead centaur. And Tom Baker! Hell yes! He is my favorite actor. His portrayal of Doctor Who is the best. Someone made the comment that this came out the same year as the dungeon's and dragon's game and that it came out right before star wars and how it doesn't live up to expectations and blah blah etc... Well, feel free to rent the Dungeons and Dragon's movie that came a few years ago done with that oh so wonderful computer animation we have now. What a joke, other than the special fx from star wars, Rob Bottin(The Thing) and a select few others, Harryhausen's effects are the best! Buy this movie!",
         "Despite many outings, including the poorly-received animated opus of 2003, Scheherezade's most famous hero has never made much impact on the big screen, compared to less likely but more politically correct freebooters such as Robin Hood. It must be that there's no underlying message, such as Up-Yours to the Man, in these tales of Baghdad's intrepid sailor & explorer of mythical lands. One of the best efforts was this film made just before \"Star Wars\" compelled B-budget adventure movies to take to outer space & \"Raiders\" made stunning visual excess the duct tape of plot holes. A mysterious golden tablet leads Sinbad's ship into an alliance with the gold-masked vizier of Moravia (Wilmer) & a race against time against sorcerous Prince Koura (Baker) to find a power that will confer either the means to stop Koura or make Koura unstoppable. Law is game in the lead, deftly playing Sinbad between earnestness & camp, but still looks a bit like a fugitive from the Mod Squad. Actresses get short shrift in these films unless they get to be villainesses, but no such luck for the ladies here. The beautiful but unfashionably voluptuous Monroe, whose career hit its high point here, isn't more than the obligatory decoration & damsel in distress. Her scenes with Law are too awkward to be either romantic or campy. Harryhausen's Dynarama effects are the star, as usual, making all the films he treats a cut above average, at least. They are up to the task here, with the fight against the six-armed Kali not far short of the classic climax in \"Jason & the Argonauts,\" but are not quite his best. Supporting parts give the film unusual & pleasant depth, including Wilmer's pessimistic Vizier & especially Shaw as the cautious but valiant second-in-command, Rashid. It's Baker who makes the film as Koura, effectively depicting the torment he brings upon himself in his evil ambition. The film is generously endowed with sage, ostensibly Arab sayings from Sinbad & others, notably \"Trust in Allah, but tie up your camel.\" Koura gets the best ones, though, including \"He who searches for pearls should not sleep\" and my favorite, \"He who is patient, obtains.\" Darth Vader's \"I find your lack of faith disturbing\" was a better catchphrase for an America made, perhaps, less credulous by Vietnam & Watergate. The subsequent \"Eye of the Tiger,\" which featured the stunning young Jane Seymour in the stereotyped decorative role, wasn't up to the unpretentious old-fashioned fun of \"Golden Voyage.\" Sinbad remains in his hidden harbor, waiting for an effort like Boorman's \"Excalibur\" or Milius's \"Conan\"--and perhaps also an end to America's ugly image of the Persian Gulf--to make sail again."
      ],
      "genres": [
         "Family",
         "Adventure",
         "Fantasy",
         "Action"
      ],
      "productionCompanies": [
         "Columbia Pictures Corporation",
         "Ameran Films",
         "Morningside Productions"
      ],
      "summaries": ["Sinbad and his crew intercept a homunculus carrying a golden tablet. Koura, the creator of the homunculus and practitioner of evil magic, wants the tablet back and pursues Sinbad. Meanwhile Sinbad meets the Vizier who has another part of the interlocking golden map, and they mount a quest across the seas to solve the riddle of the map, accompanied by a slave girl with a mysterious tattoo of an eye on her palm. They encounter strange beasts, tempests, and the dark interference of Koura along the way."],
      "budget": 982351
   },
   "movielensId": 3771,
   "movielens": {
      "languages": [
         "العربية",
         "English"
      ],
      "releaseDate": "1973-12-20",
      "dvdReleaseDate": "2000-06-06",
      "directors": ["Gordon Hessler"],
      "runtime": 105,
      "movieId": 3771,
      "title": "The Golden Voyage of Sinbad",
      "mpaa": "G",
      "actors": [
         "John Phillip Law",
         "Caroline Munro",
         "Tom Baker",
         "Douglas Wilmer",
         "Martin Shaw",
         "Grégoire Aslan",
         "Kurt Christian",
         "Takis Emmanuel",
         "David Garfield",
         "Ferdinando Poggi",
         "Aldo Sambrell",
         "Robert Shaw"
      ],
      "imdbMovieId": "0071569",
      "originalTitle": "The Golden Voyage of Sinbad",
      "genres": [
         "Action",
         "Adventure",
         "Drama",
         "Fantasy"
      ],
      "youtubeTrailerIds": ["3qrRSQ7ZJE8"],
      "plotSummary": "Sinbad and his crew intercept a homunculus carrying a golden tablet. Koura, the creator of the homunculus and practitioner of evil magic, wants the tablet back and pursues Sinbad. Meanwhile Sinbad meets the Vizier who has another part of the interlocking golden map, and they mount a quest across the seas to solve the riddle of the map.",
      "tmdbMovieId": 17897,
      "avgRating": 3.43808,
      "releaseYear": "1973",
      "numRatings": 646,
      "posterPath": "/xdoFnJQ9MmHbY6VrVC7LMpiwmWB.jpg"
   }
}