{
   "tmdb": {
      "original_language": "it",
      "keywords": [
         {
            "name": "slasher",
            "id": 12339
         },
         {
            "name": "whodunit",
            "id": 12570
         },
         {
            "name": "wedding dress",
            "id": 155049
         }
      ],
      "imdb_id": "tt0064904",
      "video": false,
      "title": "Hatchet for the Honeymoon",
      "recommendations": [
         5483,
         28061,
         30903,
         27636,
         26504,
         39986,
         3699,
         39988,
         5486,
         17128,
         63025,
         5485,
         75905,
         74788,
         40345,
         65899,
         191531,
         5481,
         11226,
         27699
      ],
      "backdrop_path": "/mkTpjnOjypUsrSQTAHQgZKWsAmu.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "John Harrington",
               "gender": 0,
               "credit_id": "52fe4575c3a368484e05c65d",
               "name": "Stephen Forsyth",
               "profile_path": null,
               "id": 99475,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Helen Wood",
               "gender": 1,
               "credit_id": "52fe4575c3a368484e05c661",
               "name": "Dagmar Lassander",
               "profile_path": "/3FAkdrwEpPW0ypLQp37EF5WXooU.jpg",
               "id": 46636,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Mildred Harrington",
               "gender": 1,
               "credit_id": "52fe4575c3a368484e05c665",
               "name": "Laura Betti",
               "profile_path": "/z1gRI0KcshCyTGBm10Hgp5FUslO.jpg",
               "id": 7710,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Inspector Russell",
               "gender": 2,
               "credit_id": "52fe4575c3a368484e05c669",
               "name": "Jesús Puente",
               "profile_path": "/vOE0LvMsBsREZiTGMqE5m7humaq.jpg",
               "id": 31694,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Alice Norton",
               "gender": 1,
               "credit_id": "52fe4575c3a368484e05c66d",
               "name": "Femi Benussi",
               "profile_path": "/i8r9ePuoQX1KM3hs1WRHWhNwEZx.jpg",
               "id": 24493,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Louise",
               "gender": 0,
               "credit_id": "52fe4575c3a368484e05c671",
               "name": "Antonia Mas",
               "profile_path": null,
               "id": 99476,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Vences",
               "gender": 2,
               "credit_id": "52fe4575c3a368484e05c675",
               "name": "Luciano Pigozzi",
               "profile_path": "/iSitmgdtPylwSkX9efVaTJLVfSa.jpg",
               "id": 30900,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Dr. Kalleway",
               "gender": 2,
               "credit_id": "52fe4575c3a368484e05c679",
               "name": "Gérard Tichy",
               "profile_path": "/dKTu5eIRVjLeUwCRrri8puxnFz3.jpg",
               "id": 14014,
               "order": 7
            },
            {
               "cast_id": 26,
               "character": "Betsy Wooster",
               "gender": 1,
               "credit_id": "585a67d0925141724d04c2d0",
               "name": "Verónica Llimerá",
               "profile_path": "/5MhWGASjcAkt1YFf2GM8FcW8cRd.jpg",
               "id": 1689544,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4575c3a368484e05c641",
               "name": "Mario Bava",
               "profile_path": "/7IAC3ab2HeveW537a3bymiDrVce.jpg",
               "id": 25826,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4575c3a368484e05c64d",
               "name": "Mario Bava",
               "profile_path": "/7IAC3ab2HeveW537a3bymiDrVce.jpg",
               "id": 25826,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4575c3a368484e05c653",
               "name": "Manuel Caño",
               "profile_path": null,
               "id": 99474,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4575c3a368484e05c659",
               "name": "Mario Bava",
               "profile_path": "/7IAC3ab2HeveW537a3bymiDrVce.jpg",
               "id": 25826,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "546baa7fc3a368513a00058f",
               "name": "Soledad López",
               "profile_path": null,
               "id": 1386762,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "546baafac3a3685143000574",
               "name": "Hosé Maria Tresserra",
               "profile_path": null,
               "id": 1386766,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "546bab1bc3a368513a0005a6",
               "name": "Elisa Aspach",
               "profile_path": null,
               "id": 1386767,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "546bab2bc3a36851330005ff",
               "name": "Piero Mecacci",
               "profile_path": null,
               "id": 91797,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "54ba50bac3a368145e0038f8",
               "name": "Giulia Mafai",
               "profile_path": null,
               "id": 33814,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "54ba50db9251413635000f6a",
               "name": "Santiago Moncada",
               "profile_path": null,
               "id": 38757,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "54ba50e792514148f0003571",
               "name": "Sante Maria Romitelli",
               "profile_path": null,
               "id": 41149,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "580b319bc3a368249d000138",
               "name": "Jaime Deu Casas",
               "profile_path": null,
               "id": 571161,
               "department": "Camera",
               "job": "Camera Operator"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 2.811756,
      "production_countries": [
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         },
         {
            "iso_3166_1": "ES",
            "name": "Spain"
         }
      ],
      "id": 28050,
      "vote_count": 25,
      "budget": 0,
      "overview": "A madman haunted by the ghost of his ex-wife carves a corpse-laden trail.",
      "similar": [
         28264,
         39874,
         12521,
         948,
         27392,
         10092,
         10781,
         1696,
         24124,
         25155,
         31624,
         10285,
         10585,
         3597,
         3600,
         10824,
         371608,
         20345,
         4488,
         5486
      ],
      "original_title": "Il rosso segno della follia",
      "runtime": 83,
      "poster_path": "/gzwq1DAAuyQs3KXqD9JkbH5uzRj.jpg",
      "spoken_languages": [{
         "name": "Italiano",
         "iso_639_1": "it"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Pan Latina Films",
            "id": 38793,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Mercury Films",
            "id": 9261,
            "origin_country": ""
         }
      ],
      "release_date": "1970-06-02",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "When you chop - Aim well! Don't slip! And just make sure - She doesn't drip!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mario Bava"],
      "runtime": 88,
      "synopsis": "On board a moving express train, an unseen man sneaks into a compartment room where a newlywed couple are. The man kills both of them with a meat cleaver, and looks upon the dead bride, still dressed in her white, blood-splattered bridal dress. The man is a certain John Harrington (Stephen Forsyth), a handsome, 30-year-old who in a voice-over narration, claims to suffer from Oedipus complex. As if that's not bad enough, John is also impotent, and feels compelled to murder young women wearing bridal gowns to remember details of a traumatic event that twisted his mind as a child. Harrington lives in a spacious villa outside Paris, France where he's the manager of a bridal dress factory which is managed by his older wife Mildred (Laura Betti). Despite the image he puts upon himself, Harrington relies on Mildred for emotional and financial support. On one particular morning, the ill-matched couple engaged in a verbal sparring match at the breakfast table. Harrington brings up talk of divorce. But Mildred will hear none of that. She tells him that he has made a disappointment of her life, so she plans to reciprocate by keeping him under her thumb. After walking away from the argument, Harrington retreats into his office, where he meets Helen Wood (Dagmar Lassander), who has come to apply for the job \"vacated\" by one of the models who has mysteriously disappeared. Harrington is impressed by her intelligence and beauty, so he hires her on the spot. Later that night, Harrington lures Alice Norton (Femi Benussi), one of the models at the salon, to his office and takes her to a secret room where he stores wedding dresses. As Alice is planning to leave the salon to be married, he offers her a choice to any of the dresses. She selects one and changes into it as per John's request, after which he hacks her to death with a meat cleaver. Harrington's method for disposing of the dead bodies of women he kills at his office is ingenious: he burns the bodies in the furnace of his greenhouse, using the ashes as a special kind of fertilizer. The next morning, Inspector Russell (Jesus Puente) arrives to question Harrington about Alice's disappearance for her fiancée reported that she never came home last night. Harrington replies that she left at the end of the day, and has not seen her since. With six models having disappeared from his bridal salon, Harrington naturally has become the prime suspect by the police. But with a lack of hard evidence, Inspector Russell leaves without arresting him, so Harrington is able to continue his killing spree with little difficulty. Over the next few days, Harrington falls in love with Helen after taking her out to dinner and having casual conversations with her, which makes him very confused. Harrington clearly has no desire to kill Helen, but his contemptuous wife, Mildred, is a constant irritation to him. After Mildred confronts Harrington and accuses him of being unfaithful after seeing him with coming home from a dinner outing with Helen, Harrington decides to retaliate by killing her. Though he does not understand why, Harrington needs to have a wedding dress in his immediate vicinity when he kills. Rather than talk Mildred into putting on the dress, he dons the veil himself, completing the transsexual illusion by wearing bright red lipstick. Harrington coldly sets up his wife for the act by pretending to reconcile with her, and promising to consummate their relationship. Despite Mildred putting up a fight, she gets hit with the cleaver, and falls dead. The act accomplished, Harrington initially buries his wife in the grounds of the greenhouse. But in a surprising twist and much to Harrington's consternation, he begins to see his wife in public. Actually, its EVERYONE who sees Mildred in public, very much alive. But its only Harrington who cannot see or hear her. He only catches glimpses of her in mirrors. Thinking that she is still alive, Harrington checks the grave in his greenhouse. The body is still there, of course. So, Harrington burns Mildred's remains in the furnace. Harrington takes the ashes and keeps them in a handbag for himself to remember her by. Mildred's ghost continues to haunt her husband, appearing only to other people, and not to himself. At a local Parisian nightclub, Harrington goes there alone (with the handbag containing Mildred's ashes), in which everyone, except him, sees Mildred sitting by his side like an adoring wife. It's only when Harrington is around Helen, Mildred never appears before her. When Harrington attempts to murder another woman, he is foiled from doing so. Harrington finally decides to murder Helen as a substitute. He knows that he is only one more killing away from discovering the truth behind his murderous dependencies. Harrington lures Helen that night to the same concealed room where he murdered Alice and a few other models. After convincing Helen to change into a wedding dress, he sorrowfully tells Helen that he never wanted to hurt her, but he want's to \"fit this last piece into place.\" He then strikes at Helen with the meat cleaver, but she successfully avoids the blow. But the initial surge of dealing the blow finally gives Harrington the information he needs. In a flashback, Harrington, as a young boy, adorned his mother. When his father died, he became the man of the house and looked after her. However, when his mother remarried, he became miserable. Spying on his mother and stepfather having sex, he became enraged and killed them both with a hatchet (shades of young Norman Bates and his mother from 'Psycho'). The sight of his mother drenched in blood and asking why he did this to her haunted him for years. Young Harrington apparently tricked the police into thinking a homicidal maniac killed his mother and stepfather, in which he also had subconsciously pushed the entire event out of his mind. Now that it has all come back to haunt him, he is reduced to tears. In another ironic twist, Helen runs from the grieving Harrington and lets Inspector Russell and a team of policemen into the hidden room where they place him under arrest. It turns out that Helen is a uncover policewoman who was hired by Russell to keep an eye on Harrington. Helen is shaken by her brush with death, but recovers enough quickly to help the police get the maniac. After confessing everything to Russell, Harrington is loaded into a police van, with two detectives escorting him, which drives away. As Harrington settles back in the police van on its way to jail, he finally realizes that now he knows everything, he is finally free. But then Mildred's ghost appears beside him in the van. But this time, it is only Harrington who can see or hear her. She tells him that now they will be together forever, \"first in the insane asylum, and then in Hell for all eternity.\" Harrington goes berserk with terror, and has to be restrained by the two policemen with him. But Harrington calms down when he realizes that there is no way now for him to avoid his fate.",
      "writers": ["Santiago Moncada"],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0064904/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQzNDUzNjIzM15BMl5BanBnXkFtZTcwMTI2MTQyMQ@@._V1_SY317_CR10,0,214,317_AL_.jpg",
      "actors": ["Stars: Stephen Forsyth, Dagmar Lassander, Laura Betti | See full cast and crew »"],
      "reviews": [
         "Man, I love Mario Bava's work! Every film I've seen of his is a pure masterpiece in my eyes and a complete cinematic \u0091orgasm'! Hatchet for the Honeymoon is somewhat different compared to most of his other movies and perhaps even his most accessible film. Hatchet handles about a more common horror theme (namely a serial killer and his motivations) but in the very first place it is another Bava-omnibus of stylish direction, wonderful music, beautiful scenery and a unique, tense atmosphere. Bava never ceases to surprise me\u0085I find it truly remarkable how this director is able to portray such ugly things (murder, insanity, aggression\u0085) in an artistic way! Also, the film is far ahead of its time with the portrayal of a horrible murderer as a classy and intelligent businessman. Stephen Forsyth is brilliantly cast as John. He owns a fashion gallery in Paris, specialized in wedding dresses and there are a lot of models working for them. He urgently wants to divorce his wife because he despises her, but she won't let him. Like it's the most normal thing in the world, John confesses to the audience that he's a multiple murderer\u0085' A woman should only live till her wedding day', he says, `love once and then die'! Forsyth was a genius choice to play John; he's handsome and extremely charismatic but also very frightening and morbid-looking at the same time. John is aware that he's sick, yet he can't control the urge to kill again. The second half of the film is even more brilliant, with a perfect image of a man stuck in a downwards spiral of insanity. Actually, what Bava does here, is single-handedly changing the rules of the giallo! The identity of the killer is exposed right from the beginning, yet there are numerous other aspects to discover about his personality\u0085like what was the origin of his hunger for violence and misery? Hatchet for the Honeymoon isn't the director best film (that honor goes to Black Sunday, without a doubt) but it still is a perfect score of 10 out of 10 in my book. I can only bring forward one negative aspect and that is \u0096 like usual \u0096 the annoying dubbing. Definitely also worth a mention: the beautiful female leads (and side-characters) in Hatchet. Dagmar Lassander is the stunning beauty that also appeared in Fulci's House by the Cemetary. Femi Bunissi plays another one of John's victims. I didn't know her, but she certainly is a gifted and gorgeous lady. Enter the world of Mario Bava as soon as possible! You won't regret it!!",
         "Interesting, complex look at a man who must kill young brides in order to unlock the secret of who killed his own mother. With each hacked bride, the main character of Harrington sees more and more of his terrible childhood memory when he saw his own mother axed. The acting in this film is nothing terribly special, nor is the story, but Bava'a direction is a visual treasure to behold. As always, he makes the most he can with the camera lens. Some of the shots are inspiring as Bava directs our attention through small orifices sometimes like a small window. His use of a room with mannequins is very effective too. Bava even has fun with his little joke of having Harrington watching Bava's own Black Sabbath on television when having just killed his wife he is visited by the police. Style and visual artistry ripen all around only to be harvested by Bava's gluttonous camera lens. The plot, although missing huge pieces of coherence and logic, is fairly well-crafted. The acting is adequate. I particularly liked the actress that played Harrington's vitriolic wife and the character of the police inspector.The sense of the sixties and fanciful colours pervade almost every scene, and the soundtrack is very suitable to this material. For some horror fans, the film may seem somewhat slow, but it kept my interest throughout.",
         "In the late sixties Bava began reinventing the murder mystery formula he single-handedly created with films like THE GIRL WHO KNEW TOO MUCH and BLOOD AND BLACK LACE. In this film you know from the start who the killer is and so this film becomes a look into the crazed mind of a guy with childhood trauma who kills women. There's a great experimental score, cool fashions and a dance nightclub sequence for all you Sixties kitsch fans out there. Stephen Forsyth gives a great wide-eyed psycho performance and Bava forsakes his usual stylishly colored lighting for dreamy surreal imagery during the murder scenes. Bava even sticks in scenes from his earlier films on a TV as an in-joke for his fans.",
         "John Harrington (Stephen Forsyth) is a real sick-o who hacks up brides-to-be with a \"hatchet\" (actually what we here in the U.S. would call a meat cleaver). We hear John's thoughts (\"The fact is, I'm completely mad!\") and flashbacks reveal that John killed his own mother because his disapproved of her new lover. He lives in a mansion with his older, wealthy, bitter, controlling witch of a wife (Laura Betti), who is obsessed with the occult and returns as a nagging ghost after John offs her. The victims (models who work for John's wedding dress company) are lured to a secret room full of mannequins. Stylish, bizarre touches, some humor, a few effective shocks and Bava's always creative and colorful direction make this rewarding viewing for horror fans OR people just interested in learning how to enliven a stale plot through audacious presentation. However, since the killer's identity is evident from the beginning, there's little suspense and mystery to the story and the American release is, needless to say, poorly dubbed. Despite that, it's still a fun, entertaining film and I recommend it.",
         "Handsome bridal shop owner is troubled by mysteries from his childhood which seem to drive him to murder brides-to-be. However he may have other problems after the ghost of his vindictive wife starts to haunt him. Hatchet for the Honeymoon is one deliciously strange and darkly comical chiller from the great Mario Bava. As usual Bava's direction is excellent and inventive; particularly the dynamic camera-work and vivid imagery. The story is quite compelling as it goes against the norm and takes the killer's point of view and makes us surprisingly sympathetic toward him. The plot also takes some nicely off-beat twists as it brims with moments of macabre humor, sharp suspense, and some touches of dream-like surrealism. In addition the music score of Sante Maria Romitelli is jazzy and quite beautiful at times; a nice contribution to the colorful cinematography. The cast is fairly solid too. Star Stephen Forsyth does a wonderfully brooding performance and makes his psychotic character strangely likable (one wonders if Bret Easton Ellis saw this film before writing American Psycho). Forsyth is perfectly matched by co-star Laura Betti, who does a fiendish performance as Forsyth's domineering wife. Hatchet for the Honeymoon is a real treat for fans of Bava and the giallo genre, or those that just enjoy odd-ball horror films. It's one of Bava's most interesting works and remains perhaps the most overlooked of his films. *** 1/2 out of ****",
         "I say strange because I'm not quite sure what exactly \"Hatchet for the Honeymoon\" was supposed to be (but enjoyed it nonetheless). It features many of the traditional giallo elements - a black-clad killer, lots of beautiful young women who may as well have \"Murder Victim\" tattooed on their foreheads, incompetent detectives, childhood psychological trauma, spooky childhood toys... Yet it also diverges from the giallo blueprint in some ways by incorporating an odd, Twilight Zone-style supernatural element into the plot, and also a wry commentary on bourgeois married life. There are clear elements of both Psycho and Peeping Tom in the story, and it also predates both the 1980 slasher film He Knows You're Alone, and the Bret Easton Ellis book (and later film) American Psycho. As usual with Mario Bava, the cinematography, production design and lighting are all beautiful to look at, and there are two great suspense set-pieces: the scene where the killer waltzes with his next victim to the eerie tune of a music box in a shadowy, elegant store-room full of creepy plastic mannequins in wedding dresses; and the scene where he talks to the suspicious cop while his dead wife's arm is hanging from the staircase and dripping blood onto the carpet. It's also a surprisingly funny film in many ways. Special mention must go to Laura Betti's hilarious performance as Mildred, the evil wife from hell. All in all, \"Hatchet for the Honeymoon\" is an intriguing and often underrated addition to Mario Bava's formidable canon. Stylish, entertaining and darkly funny.",
         "A note: Was this movie ever called in English HATCHET FOR A HONEYMOON, rather than the awkward HATCHET FOR THE HONEYMOON? I seem to recall this from a Leonard Maltin book circa 1978. Or am I as cracked as Bava's protagonist? For my money, this is primo vintage Bava--which is to say Dario Argento in top hat and tails, Jess Franco with a finishing-school diploma, or, to look at the glass as half empty, Richard Lester after three hits of dirty windowpane acid. To top this voiceover narration, you'd have to go either to BARRY LYNDON or, on the other hand, MASSACRE MAFIA STYLE: \"My name is John Harrington. I'm thirty years old. I am a paranoiac. Paranoiac! What a marvellous world. So delicate. And full of possibilities. The fact is, I'm completely mad.\" And so is Bava's odyssey through the crazy-straw-shaped brain of J. Harrington, Esq., a hunky sociopath whose sexual fires are only stoked by burying a hatchet in the flesh of virginal-looking brides in their white-veiled drag--and, when they have the ill fortune to be there, their bridegrooms. The hyper-lusciosity of Bava's style suggests a Bertolucci blissfully unconcerned with agrarian collectivism. Mate that rococo with Nicolas Roeg's brand of kaleidoscopus maximus and you have an inkling of what Signior Mario is up to. Note to Greil Marcus: as a sequel to \"Lipstick Traces,\" how about a book tracing the parallel histories of canonical surrealism (Bunuel-Dali-Aragon-Bataille) and Italian horror of the seventies?",
         "Very stylish tale plotwise reminiscent of Hitchock's _Psycho_, albeit with some fantastic twists. The films edits and distortions are fascinating, as is the cheeky main them that is frequently repeated. There is also a disco source track and a waltz among the main musical motifs. John Harrington's relationship with his wife and mother is explored in bizarre supernatural ways that have never (to my knowledge) been imitated. Despite its superficial resemblance to _Psycho_, including Harrington's driving motivation, the film is astonishingly original, handled in a completely different manner, with a completely different mystery. While _Psycho_ was an attempt by Hitchcock to improve on Hammer horror, Bava takes a main idea from Hitchcock and twists it into something possibly even greater than its clear inspiration.",
         "Mario Bava was quite possible the best filmmaker for doing something quick and cheap. Sometimes to great effect(Kill Baby Kill, Rabid Dogs) & bad(Dr. Goldfoot & the Girl Bombs). Fotunately, there are a lot more good than bad. This one however, is probably his greatest achievement, maybe not his greatest movie though. It gets better each time you watch it. Where the 1st time was maybe a 6 now its a 9. There is just so much attention to detail in it. It Plays out more like a black comedy than an actual slasher film. The story is predictable, about a psychopath who must keep on killing brides to find out who killed his own mother, but the story is not really that important what is is Bava's use of a camera. Its all over the place here. Great stuff.",
         "It seems that the 70's is a rather under-appreciated decade for Mario Bava, as it is usually overshadowed by his 60's cannon, with films such as \"Black Sunday\" or \"Black Sabbath\". Still, his 1974 film \"Lisa and the Devil\" is what I consider his masterpiece; 1972's \"Baron Blood\" is a great old-fashioned Gothic classic; 1971's \"Twitch of the Death Nerve\" is mindless gory fun; \"Shock\" is a simple-yet-effective ghost story; and last but not least, there is \"Hatchet for a Hooneymoon\". Usually depicted as one of Bava's weaker efforts, \"Hatchet...\" is as influential as \"Kill Baby Kill\" or \"Twitch...\", as seen in such critically-acclaimed works as \"American Psycho\" or \"Santa Sangre\". Here, we have Bava's ever-present visual flair, combined with a fresh Scroogesque twist on the typical giallo formula. The script is intelligent and gripping, filled with some interesting Freudian motifs represented mostly through the protagonist's doppelganger, as well as including some well-developed and complex characters that you really care for. The charismatic Stephen Forsyth is perfectly cast as the protagonist, and is as seductively creepy as he needs to be. Laura Betti is also terrific as his cold, manipulative wife. Interestingly, Bava seems to play homage to the other great Italian director - Federico Fellini, as he does his own 'La Dolce Vita'-type satire of the plastic Italian high-society in this film. The film also has some of the most beautiful and lyrical scenes of Bava's entire career, both visually and in substance, such as John's 'danse macabre' in the room full of mannequins. These moments blend magnificently with Sante Maria Romitelli's bittersweet score, which captures the film's melancholic tone and perverse humor. The one thing that may put some viewers away is the lack of violence which doesn't really hurt the whole thing, but doesn't add anything to it either. Overall, a mesmerizing combination of ghost story with gialli, that is definitely not to be missed by any fans of the Maestro or Italian horror cinema in general."
      ],
      "genres": [
         "Horror",
         "Thriller"
      ],
      "productionCompanies": [
         "Pan Latina Films",
         "Mercury Films",
         "Películas Ibarra y Cía."
      ],
      "summaries": [
         "The owner of a design house busies himself murdering the new brides who have modelled his bridal fashions. When he decides to murder his wife, she becomes the ghost that wouldn't leave.",
         "Thirty year old John Harrington is a fashion designer at his own fashion house specializing in bridal attire, the business and the mansion in which it is located and in which he lives he inheriting from his now deceased mother. He is also self-professed as a madman - something that no one knows - as he is the murderer behind the recent killings of five brides, all his clients, each bludgeoned to death with a cleaver on their wedding night. He has disposed of many of the bodies in his greenhouse incinerator. John has no idea why he kills, but knows that it is a compulsion that he will continue unless he figures out the reason. All he knows is it has something to do with the footsteps he hears in his head. Rosie Miller, one of his models, has gone missing, but he doesn't remember killing her or she mentioning that she was getting married, which would be a reason to kill her. Regardless, he has to hire a new model to replace Rosie, that person ultimately being Helen Wood, who eventually gets a little too close for his comfort. Another issue for John is the investigation of Inspector Russell, who only has John as the common denominator between all the murders and missing women. Meanwhile, John is facing further torment in the mutually unsatisfying marriage to Mildred, that dissatisfaction on her side due to his inability to perform sexually. This torment may be eternal as she vows never to leave him.",
         "Every time John Harrington hacks up a bride on her wedding night with a meat cleaver, the face of his mother's killer (who died similarly) becomes a bit more clear. Compelled to discover the killer's identity, he kills again and again, even killing his own unloveable wife, who returns to haunt him as a ghost that everybody can see...but him!",
         "A bridal design shop owner kills various young brides-to-be in an attempt to unlock a repressed childhood trauma that's causing him to commit murder."
      ],
      "budget": 0
   },
   "movielensId": 3772,
   "movielens": {
      "languages": ["Italiano"],
      "releaseDate": "1970-06-02",
      "dvdReleaseDate": "2000-06-06",
      "directors": ["Mario Bava"],
      "runtime": 83,
      "movieId": 3772,
      "title": "Hatchet for the Honeymoon",
      "mpaa": "PG",
      "actors": [
         "Stephen Forsyth",
         "Dagmar Lassander",
         "Laura Betti",
         "Jesús Puente",
         "Femi Benussi",
         "Antonia Mas",
         "Luciano Pigozzi",
         "Gérard Tichy",
         "Verónica Llimerá"
      ],
      "imdbMovieId": "0064904",
      "originalTitle": "Il rosso segno della follia",
      "genres": ["Horror"],
      "youtubeTrailerIds": ["l81vtN94-yk"],
      "plotSummary": "A madman haunted by the ghost of his ex-wife carves a corpse-laden trail.",
      "tmdbMovieId": 28050,
      "avgRating": 2.56818,
      "releaseYear": "1970",
      "numRatings": 44,
      "posterPath": "/gzwq1DAAuyQs3KXqD9JkbH5uzRj.jpg"
   }
}