{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "musical",
         "id": 4344
      }],
      "imdb_id": "tt0038718",
      "video": false,
      "title": "Make Mine Music",
      "recommendations": [
         14906,
         13757,
         46929,
         15947,
         13465,
         42981,
         47813,
         25953,
         304878,
         186585,
         4542,
         73901,
         41394,
         22779,
         13850,
         22466,
         17971,
         71886,
         42518,
         19975
      ],
      "backdrop_path": "/iTwOiALjxkBjd7iKwMjQy9hMiMc.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Narrator / Characters (segment \"The Whale Who Wanted to Sing at the Met\") (voice)",
               "gender": 2,
               "credit_id": "52fe43e2c3a368484e003cc9",
               "name": "Nelson Eddy",
               "profile_path": "/aO3WMMqtgE7yDrFLSh6lc1ji1MN.jpg",
               "id": 78847,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Herself (voice)",
               "gender": 1,
               "credit_id": "52fe43e2c3a368484e003ccd",
               "name": "Dinah Shore",
               "profile_path": "/vdJKTzqUhoes4pgV5TpasRbMbXj.jpg",
               "id": 137829,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe43e2c3a368484e003cd1",
               "name": "Benny Goodman",
               "profile_path": "/pPf6ztCm0CuBdN1KyJiewwCtzUB.jpg",
               "id": 82408,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Narrator (segment \"Casey at the Bat\") (voice)",
               "gender": 0,
               "credit_id": "52fe43e2c3a368484e003cd9",
               "name": "Jerry Colonna",
               "profile_path": "/toNZjTxmuc6QczOUZKgWKRp8jUX.jpg",
               "id": 142527,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Himself (voice)",
               "gender": 2,
               "credit_id": "52fe43e2c3a368484e003cdd",
               "name": "Andy Russell",
               "profile_path": "/dCDzfN3k7IHA4iZpNSaPJhQGPZe.jpg",
               "id": 137908,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Narrator (segment \"Peter and the Wolf\") (voice)",
               "gender": 2,
               "credit_id": "52fe43e2c3a368484e003ce1",
               "name": "Sterling Holloway",
               "profile_path": "/njZObhSQmwSX2U7IrB6Gytuedm8.jpg",
               "id": 34759,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Herself (as Riabouchinska)",
               "gender": 0,
               "credit_id": "52fe43e2c3a368484e003ce5",
               "name": "Tania Riabouchinskaya",
               "profile_path": null,
               "id": 142528,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Himself (as Lichine)",
               "gender": 0,
               "credit_id": "52fe43e2c3a368484e003ce9",
               "name": "David Lichine",
               "profile_path": null,
               "id": 142529,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Themselves (voice) (as Pied Pipers)",
               "gender": 0,
               "credit_id": "52fe43e2c3a368484e003ced",
               "name": "The Pied Pipers",
               "profile_path": null,
               "id": 142530,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Themselves (voice) (as King's Men)",
               "gender": 0,
               "credit_id": "52fe43e2c3a368484e003cf1",
               "name": "The King's Men",
               "profile_path": "/207WFG9b9236ReM2SUy8gDu8tLs.jpg",
               "id": 142531,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Themselves (voice) (as Ken Darby Chorus)",
               "gender": 2,
               "credit_id": "52fe43e2c3a368484e003cf5",
               "name": "Ken Darby",
               "profile_path": "/g3ln3AUplMgjTrejESPosJH1pa2.jpg",
               "id": 20152,
               "order": 11
            },
            {
               "cast_id": 24,
               "character": "Herself (voice) (as Andrews Sisters)",
               "gender": 1,
               "credit_id": "5a9e1f2b925141102100a506",
               "name": "Patty Andrews",
               "profile_path": "/dnAUY3ZvvnJ3fua12husVQ4mDFE.jpg",
               "id": 1578527,
               "order": 12
            },
            {
               "cast_id": 25,
               "character": "Herself (voice) (as Andrews Sisters)",
               "gender": 1,
               "credit_id": "5a9e1f3b925141102100a512",
               "name": "Maxene Andrews",
               "profile_path": "/w7XK1KaAsiRZFxdn8J2oRpneq0u.jpg",
               "id": 1221905,
               "order": 13
            },
            {
               "cast_id": 26,
               "character": "Herself (voice) (as Andrews Sisters)",
               "gender": 1,
               "credit_id": "5a9e1f4c0e0a2671fe00b806",
               "name": "Laverne Andrews",
               "profile_path": "/ixnafSGHuisLKTPGV8HBZQYgiJP.jpg",
               "id": 1221906,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43e2c3a368484e003cb3",
               "name": "Robert Cormack",
               "profile_path": null,
               "id": 142526,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43e2c3a368484e003cb9",
               "name": "Clyde Geronimi",
               "profile_path": "/tirfI2HLxHZUpls0UpXuCoPrf63.jpg",
               "id": 64864,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe43e2c3a368484e003cbf",
               "name": "Homer Brightman",
               "profile_path": "/1q6WBrU4oNKmX3Zst7mmPdXosIL.jpg",
               "id": 68654,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe43e2c3a368484e003cc5",
               "name": "Dick Huemer",
               "profile_path": "/kmSjsZQvbCfz3skiZ1HODreEUPG.jpg",
               "id": 69134,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "564fc5bac3a368070d0055ea",
               "name": "Merle Cox",
               "profile_path": null,
               "id": 149217,
               "department": "Art",
               "job": "Background Designer"
            },
            {
               "gender": 2,
               "credit_id": "565a082ec3a3680abe000b5f",
               "name": "Les Clark",
               "profile_path": null,
               "id": 115754,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "565a21fac3a3680ac7000f77",
               "name": "Ollie Johnston",
               "profile_path": "/76RFwErmaMm7tx8OHFU0eYCvMMr.jpg",
               "id": 143786,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 2,
               "credit_id": "565a27a7c3a3680ac7001055",
               "name": "John Lounsbery",
               "profile_path": "/5iwFX8llmSfEudddEXO8BGczdTs.jpg",
               "id": 69003,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 2,
               "credit_id": "5823cc13c3a3684bf5000e6b",
               "name": "Jack Kinney",
               "profile_path": "/9KEkI1NTzsxU1jLEuBsF22F51cr.jpg",
               "id": 74565,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5823cc3b9251411a38000e90",
               "name": "Hamilton Luske",
               "profile_path": "/xeyWJsFlMtgjyfZnnElMnc6qFF6.jpg",
               "id": 11429,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5823cc639251411a3e000efc",
               "name": "Joshua Meador",
               "profile_path": "/r7VwcasPi9BxYziLPZlasLQ7CSZ.jpg",
               "id": 222238,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 4.833805,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 20343,
      "vote_count": 46,
      "budget": 68,
      "overview": "In the tradition of Fantasia, Make Mine Music is a glorious collection of nine musically charged animated shorts featuring such fun-filled favorites as \"Peter And The Wolf\", narrated by the beloved voice behind Winnie The Pooh. In addition, you'll enjoy such classic cartoon hits as \"Casey At The Bat,\" \"The Whale Who Wanted To Sing At The Met\" and \"Johnnie Fedora And Alice Bluebonnet.\"",
      "similar": [
         38757,
         872,
         812,
         11224,
         10530,
         224141,
         14128,
         16119,
         15121,
         11970,
         8587,
         9325,
         630,
         10020,
         9479,
         15969,
         3933,
         46195,
         196867,
         252
      ],
      "original_title": "Make Mine Music",
      "runtime": 75,
      "poster_path": "/20Hs0MNWxwIAhSC7gfIN2bISrZI.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/n53F7K9scQWFXYbrCablqLKqJdp.png",
            "name": "RKO Radio Pictures",
            "id": 6,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Walt Disney Productions",
            "id": 3166,
            "origin_country": ""
         }
      ],
      "release_date": "1946-04-26",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "Happy Comedy Musical",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Robert Cormack",
         "Clyde Geronimi"
      ],
      "runtime": 75,
      "synopsis": null,
      "writers": [
         "Homer Brightman",
         "Dick Huemer"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0038718/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI3NzMzNzQ1OV5BMl5BanBnXkFtZTcwMjM5NDYxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Nelson Eddy, Dinah Shore, Benny Goodman | See full cast and crew »"],
      "reviews": [
         "Make Mine Music finds Walt Disney in the midst of the transitional period between his first five animated features (Snow White and the Seven Dwarfs, Pinocchio, Fantasia, Dumbo, Bambi) and the post-war revival begun with Cinderella (1950). The idea of a casual variant of Fantasia featuring popular music was a good one. Even though the segments which comprise the film vary in quality, the film as a whole is a bright, colorful and amusing light entertainment which fit wartime needs ideally. Highlights include two spirited Benny Goodman swing numbers (\"All The Cats Join In\" and \"After You've Gone\") and the unforgettable finale, \"Willie the Operatic Whale\", narrated and sung by Nelson Eddy. The animation is generally first-rate and the Technicolor film will dazzle any viewer not expecting a genuine masterwork. Make Mine Music was successful enough to warrant a considerably better follow-up, Melody Time (1948). The undistinguished but harmless \"Martins and the Coys\" segment, concerning the gun-feuding backwoods families of American folklore, has idiotically been removed from current editions, evidently for PC reasons. It's scary that Disney may start altering their classics to meet artificial modern standards. (If they had cut anything from Make Mine Music, it should have been the tasteless \"Two Silhouettes\" ballet, all doilies and valentines and icky fake sentiment.)",
         "This is one of my Disney favorities, a collection of ten musical cartoons including such classics as \"Peter and the wolf\", \"Willie the operatic whale\" and \"Blue Bayou\"(this was at first planned for the music of Debussy's \"Clair de lune\" in Fantasia). And there also WAS the cartoon I prefer: \"The Martin and The Coys\", comical history of a war between two families in the old America. Now I've buyed the new video of this film and I've discovered that this beautiful episode has been completely cut out. Shame on you Disney! Classics must not be touched! It's very sad that,when we are under the continue pressure of Pokemons and other violence and sex from TV, Disney cuts his comic fairy tales because children could believe that the shooting fight between the Martins and the Coys is real (and repeat it,perhaps in schools?)SHAME ON YOU!!!!!!!!!!!",
         "\"Make Mine Music\" is a beautifully crafted binding of Disney shorts, and I think it is an improvement over \"Melody Time\". \"Melody Time\" did have some memorable parts especially \"Once Upon a Wintertime\", \"Bumble Boogie\" and \"Johnny Appleseed\", but what made \"Make Mine Music\" better was that it had a somewhat better variety of music and that it contains some of my all time favourite Disney moments. But like it is with \"Melody Time\" the success of the shorts is variable. \"The Martins and the Coys\"(10/10)-Man I loved this! Probably the most underrated of all the shorts featured in this film. It mayn't be to everyone's tastes now, and it does stereotype the Appalachians, but what makes it so enormously entertaining is the fluid and colourful quality of the animation, the rollicking soundtrack and the vocals. \"Blue Bayou\"(10/10)- I don't know where to begin praising \"Blue Bayou\". Whether it was the stunning animation, with the pristine and perfect blue backgrounds, the poetic lyrics and the lyrical, sensual melody of the song. And the music is sublimely sung. \"All the Cats Join In\"(10/10)-One cool and jazzy cartoon. I am not always that fond of jazz admittedly, but the music courtesy of Benny Goodman and his orchestra is wonderful. Topped with clever and sophisticated animation and the story, even for a combination cartoon, works effectively. \"Without You\"(9/10)- I liked this, the animation is gorgeous in this sequence and the song itself is sweet and memorable. Andy Russell does a good job with the singing. I will say though it doesn't rank as a favourite, and I can't put my finger on why, maybe it was to do with where it was placed in the film. \"Casey at the Bat\"(8/10)-The pace is rushed here, but this cartoon is entertaining. I for one liked Jerry Colonna's mini-commentary-like vocals here, and I liked the animation too. \"Casey at the Bat\" is also very funny, certainly makes a game of baseball entertaining. \"Two Silhouettes\"(8/10)-Don't get me wrong, I really liked this sequence. It is sentimental and sappy of course, but it looked beautiful, with graceful dancing, and the song was lovely, sensitively sung by Dinah Shore. \"Peter and the Wolf\"(9.5/10)-Easily one of the better shorts of the film. Not my personal favourite by all means, but definitely memorable. The animation is beautiful here, the music is outstanding and the story is effective. Not to mention the characters are very well done, in fact the Wolf when my sister and I were little was so scary for us, my sister still refuses to see this cartoon, as she got nightmares from the Wolf and the French horn motif played to signify his entrance. \"After You've Gone\"(8/10)- I do prefer \"All the Cats Join In\" but this is full of jazz and pizazz. It's running time though is disappointingly scant, and it is a tad rushed. The artwork is beautifully done though, and the music is wonderful. Another example of a combination cartoon, and works well at it. \"Johnnie Fedora and Alice Bluebonnet\"(10/10)- I love how beautiful, simple and poignant this is. Coupled with nice animation, lovely music and beautifully blended vocals from the Andrews Sisters, this is a definite must. \"Willie the Operatic Whale\"(or \"The Whale Who Wanted to Sing At the Met\")(10/10)-Save the best until last I'd say. Along with \"Peter and the Wolf\" this is the only other cartoon from the film I was familiar with before watching. This one is unforgettable, truly unforgettable with a truly special whale. The animation is gorgeous and charming, and the singing from undervalued Nelson Eddy is outstanding. What made this though was the opera music, it was wonderful to hear \"Largo Al Factotum\" from \"Barber of Seville\" and \"Sextet\" from \"Lucia Di Lammermoor\" to name a few. This was the cartoon that introduced me to the wonderful world of opera, that's why it is so special to be. Overall, while there are one or two sequences that aren't as good as others, \"Make Mine Music\" is beautifully crafted, and I would recommend it. 8/10 Bethany Cox",
         "I'm a UK viewer and I saw \"Make Mine Music\" in the late 1940's,when it was newly released . I had seen and been excited by \"Fantasia\" and the \"MMM\" numbers, as a late teenager, I found hugely enjoyable. I'm sad to learn that the \"Martins and the Coys\" number has been deleted - it was fun and the hill billy feuding' was something we'd found amusing and harmless. I disagree with some of the comments on the individual numbers, particularly \"Without You\" by Andy Russell and \"Two Silhouettes\" by Dinah Shore, both of which made an impression on me and I've been trying to obtain a record of the former for years, without success. I have fond memories of \"Johnny Fedora and Alic Blue Bonnet\" (absurdly sentimental though it was)and can sing the first lines to this day. The Benny Goodman numbers are superb - musically and animation-wise - but then I'm a B.G.fan and ever will be. \"Peter and the Wolf\" persuaded me to listen to the real classical version and, subsequently, to buy the sound track record. Perhaps I do agree with the viewer who found Jerry Colonna's rendering of \"Casey\" a lemon but then you either take Jerry's versions of things or you don't. Nelson (\"The singing capon\")Eddy's version of \"Willie\" was a delight, though in later years it may have made one more conscious of the bloody aspects of whale hunting. Anyway, it was good to hear Nelson without \"Heart of Steel\" Jeanette MacDonald. You see, without seeing the film again the memories come tumbling out and I've given it a 9 for more reasons than one. Please will somebody tell me where I can obtain a VHS copy ? David Miles",
         "An episodic musical tapestry a' la Fantasia, only this one utilizes the pop music of circa 1946. Some are worth viewing, and others are worth fast-forwarding through. My own personal favorites are the two Benny Goodman numbers, \"All the Cats Join In\" and \"After You've Gone\". I haven't seen the now-deleted \"The Martins and the Coys\" sequence, but I do oppose the tampering of classic films in the name of \"PC\". If I had known this was the case with \"Make Mine Music\", I would have never bought the VHS tape.",
         "One of Walt's early package films and not bad at that! Some segments are cloyingly hokey, of course, but most shorts are surprisingly playful and charming. The highlights: \"The Martins and the Coys\" is full of stereotyping and comic gunplay and simply fun to watch; \"Casey at the Bat\" is a whirlwind of poem recitation; the two Benny Goodman segments feature nice tunes and \"Peter and the Wolf\" and, particularly, \"The Whale Who Wanted To Sing At the Met\" are two of Disney's best cartoons. Just skip the padding and enjoy this compilation! 7 out of 10 triple-voiced Nelson Eddys",
         "Chocolate-box potpourri of Disney-animated shorts became Walt Disney's eighth animated theatrical feature, one that plays like a middling excuse to allow the studio's animators to blow off some creative steam. Divvied up into separate musical suites (utilizing pop, jazz, Big Band, and the Russian classical piece \"Peter and the Wolf\"), \"Make Mine Music\" is musically of its time, featuring the talents of Benny Goodman, Dinah Shore, Nelson Eddy, etc. In that regard, it dates far worse than \"Fantasia\", and comes to a virtual halt in the middle of an overstretched slapstick baseball satire, but there are incidental pleasures. The popular \"Peter and the Wolf\" segment, which was later serialized on Disney's TV program and found a large following, is the only segment that feels fully thought-out (and has involving animation), while \"The Whale Who Wanted To Sing At The Met\" is an interesting idea (with beautiful flourishes) in search of a narrative (the hero actually ends up in Heaven...complete with angel's wings!). Followed by \"Melody Time\", which featured more storytelling and less abstract whimsy. ** from ****",
         "Most Disney fans are not too familiar with some of the Disney Animated Classics such as this one. I am not one of those. \"Make Mine Music\" just shows us more of what the master himself, Walt Disney, has created. I have heard from a few people that the \"Martins and the Coys\" segment has been removed from the newly released DVD version. Why that segment was removed, I don't know (probably because of the amount of violence). Other than that, the other segments are very memorable. Segments like \"Peter and the Wolf\", \"Casey at the Bat\" and \"The Whale Who Wanted to Sing at the Met\" are amusing, catchy, and fun to watch. My favorite segment of the movie would have to be \"Johnny Fedora and Alice Blue Bonnet\", which I had completely forgotten was part of this movie. All segments of \"Make Mine Music\" have been shown on various Disney videos and Disney TV specials. This is just a great movie; it's just as good as all the other Disney Animated Classics. I'm sure that kids of all ages will enjoy it.",
         "\"Make Mine Music\" is another short story combination of short stories based around music numbers like \"The Three Caballeros\" and \"Melody Time\" but this whirly and witty collection is cool to bits and I actually fond it more fun and watchable than the big cheese before \"Fantasia\"! This programme gives open a fun and interesting taste of swing and popular music of the late 1940's and with good, amusing short stories that should everybody watching. The best ones in my opinion is \"Willie the Operatic Whale\" which is kinda sad but hilarious to find a whale singing in concert and \"All the Cats Join In\" which isn't actually about cats, it's about teenagers dancing to swing music. It made me surprised to find out that Americans in 1946 worn basic baseballs tops and polo shirts which proves that sixty years around, it wasn't that old fashioned! This is so much cooler inspiration of Walt's music festival which you shouldn't miss! 9/10",
         "Make Mine Music: What a great collection of stories! I watched it fairly recently with my Dad and some other family at his house in Pinon Hills. I still cry at the \"Johnny Fedora\" and \"Willie The Whale\" stories. I grew up watching these and so many Disney cartoons and movies on our old 16 millimeter projector. We still have it, but it needs a bulb. My nephew Kurt brought this cartoon up on DVD. It was great to see my Dad's \"name up in lights,\" so to speak, at least for animation credits. He loved seeing it again, altho' his eyes aren't so good now at age 92. But he is still hanging in there."
      ],
      "genres": [
         "Animation",
         "Family",
         "Music"
      ],
      "productionCompanies": ["Walt Disney Productions"],
      "summaries": [
         "Segments: \"A Rustic Ballad,\" a story of feuding hillbillys; \"A Tone Poem,\" a mood piece set on a blue bayou; \"A Jazz Interlude,\" a bobby-soxer goes jitterbugging with her date at the malt shop; \"A Ballad in Blue,\" dark room, rain and somber landscapes illustrate the loss of a lover; \"A Musical Recitation,\" the story of Casey at the Bat; \"Ballade Ballet,\" ballet dancers perform in silhouette; \"A Fairy Tale with Music,\" Peter and the Wolf; \"After You've Gone,\" four musical instruments chase through a surreal landscape; \"A Love Story,\" about the romance between a fedora and a bonnet; \"Opera Pathetique,\" the story of Willie, the Whale Who Wanted to Sing at the Met.",
         "Original segments: \"The Martins and the Coys\"- Ted Weems and band provide the music while the King's Men sing about feuding mountaineers; \"Blue Bayou\"- a tone poem, reflecting the mystery and brilliance of a bayou scene, sung by the Ken Darby chorus; \"All the Cats Join In\"- animated bobby-soxers cutting a rug to the music of Benny Goodman and his Orchestra; \"Without You\"- a blues number by Ray Gilbert with Andy Russell on the vocals; \"Casey at the Bat\"- riotous slapstick with Jerry Colonna reciting Ernest Lawrence Thayer's famous baseball poem; \"Two Silhouettes\"- music by Charles Walcott and Ray Gilbert, sung by Dinah Shore as Riabouchinska & Lichine dance amidst a lyrical background; \"Peter and the Wolf\"- Sterling Holloway narrates the orchestral fable by Prokofieff; \"After You're Gone\"- a musical interpretation by the Benny Goodman Quartete supported visually by animation; \"Johnny Fedora and Alice Bluegown\"- a musical fantasy, sung by the Andrews Sisters, by Ray Gilbert and Allie Wrubel about male and female hats (a fedora and a bonnet) that fall in love; \"The Whale Who Wanted To Sing at the Met\"- Nelson Eddy provides the singing. FYI to the source that seems to think this was released in the USA as Unrated. Wrong. Disney did not release Unrated films in the 1940's. Check out \"General Audience\" classification under PCA No. 10562.",
         "Animation done to contemporary popular music."
      ],
      "budget": 0
   },
   "movielensId": 3775,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1946-04-26",
      "dvdReleaseDate": "2000-06-06",
      "directors": [
         "Robert Cormack",
         "Clyde Geronimi",
         "Jack Kinney",
         "Hamilton Luske",
         "Joshua Meador"
      ],
      "runtime": 75,
      "movieId": 3775,
      "title": "Make Mine Music",
      "mpaa": "NR",
      "actors": [
         "Nelson Eddy",
         "Dinah Shore",
         "Benny Goodman",
         "Jerry Colonna",
         "Andy Russell",
         "Sterling Holloway",
         "Tania Riabouchinskaya",
         "David Lichine",
         "The Pied Pipers",
         "The King's Men",
         "Ken Darby"
      ],
      "imdbMovieId": "0038718",
      "originalTitle": "Make Mine Music",
      "genres": [
         "Animation",
         "Family",
         "Music"
      ],
      "youtubeTrailerIds": ["ElnqVbngjy0"],
      "plotSummary": "In the tradition of Fantasia, Make Mine Music is a glorious collection of nine musically charged animated shorts featuring such fun-filled favorites as \"Peter And The Wolf\", narrated by the beloved voice behind Winnie The Pooh. In addition, you'll enjoy such classic cartoon hits as \"Casey At The Bat,\" \"The Whale Who Wanted To Sing At The Met\" and \"Johnnie Fedora And Alice Bluebonnet.\"",
      "tmdbMovieId": 20343,
      "avgRating": 3.17537,
      "releaseYear": "1946",
      "numRatings": 134,
      "posterPath": "/20Hs0MNWxwIAhSC7gfIN2bISrZI.jpg"
   }
}