{
   "tmdb": {
      "original_language": "de",
      "keywords": [
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "menage a trois",
            "id": 3190
         },
         {
            "name": "necrophilia",
            "id": 5919
         },
         {
            "name": "relationship",
            "id": 14534
         }
      ],
      "imdb_id": "tt0093608",
      "video": false,
      "title": "Nekromantik",
      "recommendations": [
         48636,
         20850,
         29559,
         15736,
         39883,
         40364,
         27813,
         46767,
         47886,
         27495,
         36225,
         8691,
         27346,
         9680,
         9568,
         14029,
         31150,
         24194,
         5424,
         1483
      ],
      "backdrop_path": "/hRhzlvtJ1rZclNaLLhmaNsJXbWx.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Robert Schmadtke",
               "gender": 2,
               "credit_id": "52fe448c9251416c75038a3b",
               "name": "Daktari Lorenz",
               "profile_path": null,
               "id": 70599,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Betty",
               "gender": 1,
               "credit_id": "52fe448c9251416c75038a3f",
               "name": "Beatrice Manowski",
               "profile_path": "/8c9iKNNoWGzYenbwSmsrapTDCaR.jpg",
               "id": 2316,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Bruno",
               "gender": 0,
               "credit_id": "52fe448c9251416c75038a43",
               "name": "Harald Lundt",
               "profile_path": null,
               "id": 70600,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Joe",
               "gender": 0,
               "credit_id": "52fe448c9251416c75038a47",
               "name": "Colloseo Schulzendorf",
               "profile_path": null,
               "id": 70601,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe448c9251416c75038a4d",
               "name": "Jörg Buttgereit",
               "profile_path": "/bCduQUUgtES1Gv2dN6fKUDnwr2X.jpg",
               "id": 70602,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe448c9251416c75038a53",
               "name": "Franz Rodenkirchen",
               "profile_path": null,
               "id": 70604,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe448c9251416c75038a59",
               "name": "Manfred O. Jelinski",
               "profile_path": null,
               "id": 70605,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe448c9251416c75038a5f",
               "name": "Hermann Kopp",
               "profile_path": null,
               "id": 70606,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe448c9251416c75038a65",
               "name": "Daktari Lorenz",
               "profile_path": null,
               "id": 70599,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe448c9251416c75038a6b",
               "name": "John Boy Walton",
               "profile_path": null,
               "id": 70607,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe448c9251416c75038a71",
               "name": "Uwe Bohrer",
               "profile_path": null,
               "id": 70608,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe448c9251416c75038a77",
               "name": "Jörg Buttgereit",
               "profile_path": "/bCduQUUgtES1Gv2dN6fKUDnwr2X.jpg",
               "id": 70602,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe448c9251416c75038a7d",
               "name": "Manfred O. Jelinski",
               "profile_path": null,
               "id": 70605,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe448c9251416c75038a83",
               "name": "Jörg Buttgereit",
               "profile_path": "/bCduQUUgtES1Gv2dN6fKUDnwr2X.jpg",
               "id": 70602,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Horror",
            "id": 27
         }
      ],
      "popularity": 5.085478,
      "production_countries": [{
         "iso_3166_1": "DE",
         "name": "Germany"
      }],
      "id": 11822,
      "vote_count": 62,
      "budget": 0,
      "overview": "A street sweeper who cleans up after grisly accidents brings home a full corpse for him and his wife to enjoy sexually, but is dismayed to see that his wife prefers the corpse over him.",
      "similar": [
         22705,
         2149,
         1259,
         276,
         979,
         80752,
         36630,
         1643,
         245844,
         24420,
         1024,
         12531,
         12271,
         6075,
         38,
         28468,
         1903,
         4995,
         86331,
         627
      ],
      "original_title": "Nekromantik",
      "runtime": 75,
      "poster_path": "/xNKYPkV5965pKkiObDzp9pGKMj7.jpg",
      "spoken_languages": [{
         "name": "Deutsch",
         "iso_639_1": "de"
      }],
      "production_companies": [],
      "release_date": "1987-05-27",
      "vote_average": 5.3,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Nekromantik Collection",
         "id": 173628,
         "poster_path": "/70exz0UX6YFgAvtJTKIDyZ3ZttI.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "West Germany",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jörg Buttgereit"],
      "runtime": 75,
      "synopsis": "The film opens with a woman urinating into the grass in close-up. She is on the road together with her husband. They have a fatal car crash. Robert Schmadtke works at a street cleaning agency. Together with his co-workers he cleans up the mess the following day. In the toilet at work Robert's boss urinates into a urinal. He takes the penis out of his pants - holds the penis and waits for the urine to leave his bladder - a sniff - the urine uncontrollably shoots out of the penis' glans - urine running into the black nothing of the urinal - urine drops dripping from the uncircumcised foreskin, which hinders the urine from flowing in one perfect unity - the urine slowly comes to an halt until the spring is dried up - the man shakes it off a few times and brings the fella back home. Robert comes home to his wife/girlfriend Betty. While Betty takes a bath in a mix of blood and water Robert watches the interview of a man speaking about phobias. While looking at the TV he imagines the following: A bunny being slaughtered. - First a hit over the head while it is being held on its ears. Then a knife slits its throat. It slowly bleeds dry, jerks and quirks and obviously still is very much conscious. After this process the bunny's fur is being peeled off like banana peel, although you don't need a knife to peel a banana, of course. After that the bunny's eyes are cut off like buttons off of a shirt. Its belly gets opened up and the bowels are being taken out. The dead bunny, which hangs upside down during this whole process receives a cut to the crotch and the testicles are being removed. Somewhere else. Daytime in a garden. Apples are being taken off a tree. The man picking the apples accidentally gets shot into the neck by a man in the garden next to his. He dies at the scene. In an attempt to cover up the crime he disposes the body. Some time passes and the decayed body gets found. The street cleaning agency takes care of it. But instead of disposing the body properly Robert takes it home without anyone else noticing. The girl is visibly excited about her husband's gift and they go feel up the body real good. The body is so rotten it basically is a very wet and juicy skeleton covered with crap and stuff. As decayed as it may be, it still got a juicy eye in its skull. They saw off a chair's wooden leg and Betty rams it into the body's crotch. It gets her all hot and bothered. She rolls a condom over the chair leg/the body's newly gained huge and super hard erection. Betty drops her black saucy lingerie and sits on the erection. She kisses the corpse - her husband feels her up from behind - her breasts touch the corpse's chest - her tongue goes all over the dead man's face - then the man kisses its face and takes its eye into his mouth. They sit up Mr. Dead and the girl's penetration continues. The eye falls out of Mr. Dead's skull and Betty tries to catch it with her mouth. We get to see this sequence in slow motion so we don't run risk to miss it. Their intercourse almost looks like a dance but all this time Mr. Dead appears to be awfully stiff and apathetic. The next day Robert gets fired from his job for several reasons. He left his unwashed and stinking working clothes in his locker over the weekend and he arrives three minutes too late to work. Meanwhile Betty reads Mr. Dead a story. They are in bed. She's naked. Then Mr. Dead gives her oral pleasure. When Betty learns that Robert lost his job she gets pissed because she knows that now they have a serious corpse-supply problem. So she leaves him for good, but not without taking Mr. Dead with her, which doesn't please Robert at all. He burns a picture of her. Then he strokes his cat. He feeds her with some human bowels, possibly a liver. But the kitty doesn't want to eat, so he puts her into a plastic bag and bashes it against the wall. Blood stains on the wall. The man plays dead in the bathtub. The cat is close to him. She doesn't have to play dead. The kitty's blood runs into the tub and mixes with the water. Water turns red. Man rubs kitty's bowels on his naked body. He takes a bite. We see the moon. A white, shiny ball in a vast of black nothingness. The white, shiny ball turns into a white, shiny, grinning skull. Robert drinks some liquor and takes some pills. He falls asleep and dreams of being a corpse and coming to life in a plastic bag. A girl walks up to him and gives him a gift. It's a crummy, decapitated head. They throw it around and play with it like you would play with a ball. The head turns into a piece of meat. He jumps around in the grass with the piece of meat in his hands and is jolly. As he wakes up from the dream he gets a prostitute and they fornicate on a cemetery. The whore sits on a gravestone. He can't get it up because she is too much alive and moving and such. So he strangles the life out of her. Then the sex works for him real smooth. The next morning: A gravedigger finds him lying next to the body. At this moment Robert wakes up and shovels off the gravedigger's head (he is skull-free from his lower jaw upwards). The digger gargles in pain as his hand tries to find the rest of his skull. The attempt fails and he drops to the floor. He bleeds, twitches, jerks and gargles a lot. Fade-to-black. He probably died soon afterwards. Robert runs around in grass on some hills. He jumps around like crazy and yells in joy. Back home he nails a Jesus miniature onto a crucifix. He takes a knife and rams it into his own belly. He lays on the bed and takes the erect penis out of his pants. As he rams the knife deeper into his torso the spermatozoon shoots out of the penis. One huge white fountain after another. The scene is intercut with the rabbit footage played in reverse. The bunny jerks and quirks back to life. The man pokes around in his bowels like a kid would poke around in a plate of broccoli hoping somebody would finally say that it doesn't have to eat up. The white fountain turns red and shoots even higher. He doesn't survive it. A gravestone with his name written on it. We see a shovel being jabbed into the grave by a person wearing lady's slippers.",
      "writers": [
         "Jörg Buttgereit",
         "Franz Rodenkirchen"
      ],
      "originalLanguage": "German",
      "imdbLink": "http://www.imdb.com/title/tt0093608/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTcwNTM4MDI1Ml5BMl5BanBnXkFtZTgwMTIwNTI4MjE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Bernd Daktari Lorenz, Beatrice Manowski, Harald Lundt | See full cast and crew »"],
      "reviews": [
         "I have a penchant for applying my own little award system to genre pictures. \"Salo\" takes the most disturbing award; \"Dead Alive\" (aka Brain Dead) wins the goriest film award; \"Caligula\" runs away with the most over-sexed honor. Well, film lovers, here we have my vote for nastiest film ever. If you've seen it, you know why. The story concerns a young couple with a predilection for all things dead. This works out well for them, as the boyfriend works for a crime scene clean-up crew. As luck would have it, one day he comes across a rather well preserved corpse ('rather well' as in it's a rotted, blue hunk of tissue) while on duty. He manages to sneak the body home, much to the delight of his lady-friend, and they go about having their dirty little way with it. It soon becomes clear that the girl is enjoying the company of the corpse more than her still breathing boyfriend and runs off with it. Needless to say, this does nothing healthy for his already deranged mental state (being dumped for another guy is bad, being dumped for a dead one is even worse). Believe it or not, watching them have sex with the gooey body is NOT the nastiest thing you'll see here. All manners of assorted atrocities are committed for your viewing un-pleasure, most all of them rank in the 'so sick you can hardly watch' category. I will not spoil the best of them, just rest assured that gore-hounds will most certainly be pleased (if not disgusted). For better or worse, the film is not very competently made. The corpse and gore effects are very good, but the film stock and technique are both pretty sub-standard. And with the script being so barren and the acting merely passable, the shock moments are all that will keep hardened viewers watching 'till the gruesome conclusion. If you are looking for good story telling, look else where. If you're looking for a good sex flick, look else where. If you are looking for the ultimate stomach churner, you've found it. 6/10",
         "Obviously filmed on super8-format Jörg Buttgereit´s masterpiece \"Nekromantik\" looks much more professional and expensive than it´s actually is! Being banned in many countries the most people only see a depraved and disgusting horror movie in it, but to me it is a disturbing, but simultaneously beautiful film about a weird fetish! The whole film is surrounded by an almost apocalyptic poetry and the wonderful piano score emphazises the sinister death-is-everywhere atmosphere perfectly! Some may be offended by gross scenes like the suicide masturbation, the autopsy, the rabbit dissection, the beheading of an old cemetery gardener or the climax when Robert and Betty have sex with the corpse (A very esthetical scene by the way...), but exactly that´s the stuff which makes this movie so unique: the surreal combination of bizarre symbolic, gore and dream like mood! Watch it whenever wherever you can!",
         "I have to admit that I like this film. At the same time, I don't know whether or not I can sit through it again. Jorg Buttgeireit proves himself as quite a revolutionary director in this field of film-making, and since has gone on to make even better films. Nekromantik is actually not a very complicated story. Robert and Betty are in love. Robert and Betty have some sick fetish's. Robert works for a company that cleans up dead bodies, and one day Robert brings home a rather rotten cadaver pulled out from a swamp. When I say rotten, I mean disgustingly rotten. Well, after Robert and Betty have a rather disgusting threesome with there new found friend, Robert gets fired from his job. It is at this point that Betty leaves him and takes the rotten corpse with her. The rest of the movie is Robert trying to cope with his loss. This movie has to be seen to believe. I wouldn't recommend this to just the average horror fan. You have to be wanting to look for something new. In my case, I had seen everything. My collection of horror films is in the hundreds. But I hadn't seen this. The second film is rather good also, and I am having a hard time deciding which movie had the sickest ending. I hope this comment helps. 8/10",
         "Nekromantik is an authentic piece of horror. And that is what many people feel about this work. Some people wish had not cross paths with something so dark. That is true horror. Nekromantik is very hardcore and graphic. There are only a few movies that can be in the same league in its genre. The Texas Chainsaw Massacre (the first one and original) had demented characters that finally are not punished like they always are in moral guided horror films. Cannibal Holocaust has a graphic approach similar to this film. Some moments of the first Hellraiser (it included a romantic scene of a woman and a resurrected corpse) could be compared. But Nekromantik dares to go further than those movies (with less money), there's no moral view over the necrophilia... it is treated lightly, like ordinary everyday stuff. I don't want to spoil anything but I suggest you to pay attention to the last scene... if that's not completely disgusting I don't know where is the disgusting stuff in cinema. Buttgereit like many filmmakers used horrifying and gory elements in his first steps. In most cases when an amateur director does 'zombie movie', intentionally or unintentionally, the final result is a comedy. Even if they want to be taken seriously, in most cases people just laugh at what they see. This author made a comedy that most people feel it's not funny at all. Maybe it's because of the particular German sense of humor or something else. Buttgereit's cinema is shocking and bizarre. Those are two compliments that Buttgereit achieved with Blood (many blood and guts also), sweat and tears. But I don't want to be misunderstood; I challenge people to see this movie, because it's ground breaking (even today) not like the typical 'Scream-clones' out there.",
         "I look upon the incredibly gory and perverse NEKROMANTIK as a black comedy which it undoubtedly is.This is a movie where a wife leaves her husband and also leaves him a note telling him that she does want to waste the best years of her life with him;bearing in mind that she has just run away with a rotting corpse to take as a lover then this must rank as the ultimate putdown.The movie is not a masterpiece of production expertise but it does serve up gore by the bucketload,much of it exceeding anything that most of us have ever seen before.The end in particular is incredibly sick but also comedic at the same time.If you are not easily offended and are able to get in on the joke then NEKROMANTIK is worth 75 minutes of your time.",
         "I didn't stumble on this film by accident; in fact, I purposefully sought it out, and I'm glad I did - but only because now I'm not searching any more. I feel like a bit of a hypocrite for criticising this film for being sick, given that many of my favourite movies can be described with the same adjective; but Nekromantik crosses a line, and it doesn't even do it in a way that's interesting. The movie features quite a few brutal and sickening scenes, but most of them have no relevance to the plot; and even the ones that do don't serve the film in the way that they should. Nekromantik looks like a trashy piece of crap, and make no mistake; that's exactly what it is. As if the title doesn't give it away, the plot handles the theme of necrophilia. We follow a sewage worker who brings home body parts for his twisted girlfriend. One day, he manages to lay his hands on a full corpse; and unlike most women, she is delighted with this present. We then get 'treated' to seeing the three of them (...) in bed together, etc etc and it's all very difficult to enjoy. The film obviously wants to examine love; but it just continually fails. No points are made, even the fact that the girlfriend ends up choosing the corpse over her man isn't explored at all. It would seem that the sick pervert who wrote it had a great idea about making a film that handles two of life's most important elements; namely, love and death, but had no idea of exactly how he would go about doing it. The result is this film. Necrophilia is, undoubtedly, a perverse subject; but it's also one that automatically generates intrigue, yet this film also fails even in that respect. The whole plot line is just too silly to take seriously; and even if you look at the movie as a black comedy, it still fails because it's not funny. The necrophilia element isn't even the most shocking thing about this movie; the most shocking things are the animal violence (pointless), and the fact that some people actually like this film! If I really had to come up with positive things about Nekromantik, I would say that I liked the score; and the fact that it's not on for long is a very good thing. On the whole, this movie is a piece of garbage - don't waste your time! Wayward cinema has produced far more satisfying gore-porn flicks than this.",
         "Rob (Daktari Lorenz) works days cleaning dead bodies up from fatal car crashes on the Autobahn, develops a sick fascination with death and collects body parts and internal organs which he stores in mason jars back at his cramped apartment. In order to spice up a rocky relationship with his equally disturbed necro girlfriend (Beatrice M), he brings home a rotted corpse for a ménage-a-troix, which backfires when she decides she prefers the stiff to him! The grainy, low-budget feel adds extra oomph to the shock value, not to mention some gritty atmosphere, and there is certainly enough depraved sickness to go around, including one of the most twisted and memorable endings in horror history. In addition to all the simulated gore, a real rabbit is killed and skinned, there are some hilariously misplaced \"artistic\" touches and loads of full (often unappealing) nudity. Film Threat offers a subtitled and unrated (would be X) version, and its 1989 sequel, NEKROMANTIK 2: RETURN OF THE LOVING DEAD.",
         "For the uninitiated, Nekromantik is one of the most notorious horror movies ever made. It may actually be reviled more than it is admired, even in horror circles, but it's one of those few movies that's provocative, in the truest sense of the word. Nekromantik is the story of a nice young couple with unusual sexual proclivities. Specifically, in order to get off, they require congress with a human corpse -- or at least a nice selection of pickled organs. Fortunately for these two, the fella (Daktari Lorenz) has a good job on the clean-up crew that tidies up automobile accidents, and eventually winds up with a real find, a half-rotten carcass dragged out of a swamp. He brings it home, where he and Betty (Beatrice M.) give it a warm welcome in a distended love scene involving a striking optical-printing technique that leaves motion trails on the screen as someone (presumably Lorenz, who doubled as composer of the score) pounds out the lyrical love theme on a piano. It's not all hugs and corpses, however, and when Betty abandons Rob after a tiff, the corpse goes with her.",
         "Jorg Buttgereit's \"Nekromantik\" is one of the most taboo-breaking horror films ever made.Very few movies talk openly about necrophilia(\"Aftermath\",\"Kissed\",\"Buio Omega\",\"Lucker\",\"Love Me Deadly\",\"Nekro\",\"Mosquito the Rapist\"),however this subject is quite fascinating because it draws links between sex and death.Rob(Daktari Lorenz)cleans different places and removes the corpses whenever there was a murder,or an accident.One day,Rob's girlfriend(Beatrice M.)has an idea to steal a corpse and to play with it.The corpse is treated like the third person and all of them make a perverted threesome.But one day Rob is fired from his work and his girlfriend dumps him,and leaves with the dead lover.For Rob it's a beginning of complete madness... \"Nekromantik\" is pretty gross-there is plenty of yucky gore on display.The ending is truly sick and memorable.So if you like extreme cinema give this one a look.8 out of 10.",
         "This movie is the sickest movie that I have ever seen. One good thing about the movie is that it did have a decent plot during the movie enough for me to go by. I couldn't believe some of the scenes that I was watching and I had to even close my eyes during the scenes of animal mutilation. This one is a good one to churn your stomach a little, or a lot. I would definitely recommend this one to anyone into some real gross stuff, give this one a look."
      ],
      "genres": ["Horror"],
      "productionCompanies": [],
      "summaries": [
         "Graphic, low-budget gore-shocker about Rob and Betty, a couple of ordinary necrophiles who apparently don't mind if their dead sexual partners are not so fresh. Rob's job affords him the opportunity to bring home corpses and the odd body part; when he loses his job, he loses Betty, and Rob's life gets REALLY bizarre.",
         "A German freeway cleaner takes rotting bodies home to a lover who has a necrophelia fetish. Involves skinning of a rabbit, use of a metal pipe in conjunction with a condom, nudity, and graphic sexual scenes with dead bodies.",
         "Nekromantik is about a middelaged man called Robert Schmadtke who works at a Street Cleaning Agency, that is his job is to take care of the remains of dead bodies in accidents etc. He has a hobby of collecting body parts and conserving them in booze. One day he gets to take care of a rotting corpse. Instead getting the corpse buried, he takes it home to his girlfriend and the fun begins...",
         "Robert Schmadtke works at a streetcleaning agency. He has a strange kind of hobby; he collects body parts and conserves them on alcohol. His girlfriend adores him, mainly because of his job, and his sexually attraction to corpses. One day Robert brings home a complete corpse. Betty gets really exited .. until Robert looses his job. Without Robs job, whos gonna get new corpses ???",
         "A street sweeper who cleans up after grisly accidents brings home a full corpse for him and his wife to enjoy sexually, but is dismayed to see that his wife prefers the corpse over him."
      ],
      "budget": 0
   },
   "movielensId": 3777,
   "movielens": {
      "languages": ["Deutsch"],
      "releaseDate": "1987-05-27",
      "dvdReleaseDate": "2000-06-06",
      "directors": ["Jörg Buttgereit"],
      "runtime": 75,
      "movieId": 3777,
      "title": "Nekromantik",
      "mpaa": null,
      "actors": [
         "Daktari Lorenz",
         "Beatrice Manowski",
         "Harald Lundt",
         "Colloseo Schulzendorf"
      ],
      "imdbMovieId": "0093608",
      "originalTitle": "Nekromantik",
      "genres": [
         "Drama",
         "Horror"
      ],
      "youtubeTrailerIds": ["q8iyMxTeB2Y"],
      "plotSummary": "A street sweeper who cleans up after grisly accidents brings home a full corpse for him and his wife to enjoy sexually, but is dismayed to see that his wife prefers the corpse over him.",
      "tmdbMovieId": 11822,
      "avgRating": 2.83684,
      "releaseYear": "1987",
      "numRatings": 190,
      "posterPath": "/xNKYPkV5965pKkiObDzp9pGKMj7.jpg"
   }
}