{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "politics",
            "id": 6078
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "speech writer",
            "id": 208323
         }
      ],
      "imdb_id": "tt0111256",
      "video": false,
      "title": "Speechless",
      "recommendations": [
         16814,
         47070,
         24073,
         16790,
         8986,
         20551,
         35233,
         26603,
         20096,
         23303,
         36914,
         70172,
         34053,
         41971,
         45249,
         18188,
         83714,
         16297,
         14550,
         47939
      ],
      "backdrop_path": "/6WVdCWYl5qHBsfHCijeNNwG1n1X.jpg",
      "revenue": 20667959,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Kevin",
               "gender": 2,
               "credit_id": "52fe463c9251416c75071bd5",
               "name": "Michael Keaton",
               "profile_path": "/myVdrYNGTgqunLfUSaM8DuVD7DL.jpg",
               "id": 2232,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Julia",
               "gender": 1,
               "credit_id": "52fe463c9251416c75071bd9",
               "name": "Geena Davis",
               "profile_path": "/6b8cRJOItz7yNpYuLCPkl5kv4m2.jpg",
               "id": 16935,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Bob 'Bagdad' Freed",
               "gender": 2,
               "credit_id": "52fe463c9251416c75071be3",
               "name": "Christopher Reeve",
               "profile_path": "/9D4L3XeklsMc4r8FybZSTKON3HR.jpg",
               "id": 20006,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Annette",
               "gender": 1,
               "credit_id": "52fe463c9251416c75071be7",
               "name": "Bonnie Bedelia",
               "profile_path": "/10JhoIaKHQGG0DNbQECTI4gHNn9.jpg",
               "id": 7673,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Ventura",
               "gender": 2,
               "credit_id": "52fe463c9251416c75071beb",
               "name": "Ernie Hudson",
               "profile_path": "/h6hSUIuvJEjUih3wgMqYOZhNe57.jpg",
               "id": 8874,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Kratz",
               "gender": 2,
               "credit_id": "52fe463c9251416c75071bef",
               "name": "Charles Martin Smith",
               "profile_path": "/fahfWqqrdJwajrfEGmEOXQ1p9bm.jpg",
               "id": 1270,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Chuck",
               "gender": 2,
               "credit_id": "52fe463c9251416c75071bf3",
               "name": "Harry Shearer",
               "profile_path": "/qtGHYpWLbqQVY9ymVPtrJZV6MHg.jpg",
               "id": 6008,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Eddie",
               "gender": 2,
               "credit_id": "52fe463c9251416c75071bf7",
               "name": "Steven Wright",
               "profile_path": "/m9827iUNPGTbAsfjHD9tpMCXYbR.jpg",
               "id": 3214,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Dick",
               "gender": 2,
               "credit_id": "52fe463c9251416c75071bfb",
               "name": "Willie Garson",
               "profile_path": "/xZ09uKkIMIRWDNqmyhb1AeEOo71.jpg",
               "id": 1542,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "54591cb50e0a26116500217d",
               "name": "Robert King",
               "profile_path": "/fCeDPxdYWQDkbFKvDFQr8Csyi8T.jpg",
               "id": 1224549,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe463c9251416c75071bdf",
               "name": "Ron Underwood",
               "profile_path": "/6Que5sFtOzJ0q4D7vrFqG60sdzG.jpg",
               "id": 33485,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "562375adc3a3680e0e00e57e",
               "name": "Renny Harlin",
               "profile_path": "/lOCRZzC1UZfkObWpQtKxga5ZV8F.jpg",
               "id": 16938,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.697669,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 15128,
      "vote_count": 27,
      "budget": 0,
      "overview": "A romantic comedy. Michael Keaton and Geena Davis are speechwriters for competing political campaigns. Witty and amusing for the political junkies amongst us.",
      "similar": [
         24420,
         1259,
         276,
         1643,
         77953,
         17612,
         1024,
         9388,
         1903,
         13,
         38,
         46705,
         50546,
         225886,
         72105,
         86331,
         38050,
         272693,
         332872,
         9285
      ],
      "original_title": "Speechless",
      "runtime": 99,
      "poster_path": "/nN5BPaG720jhkNf29Pogm1O1mq4.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1994-12-16",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "There are two sides to every relationship... Don't trust either of them.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ron Underwood"],
      "runtime": 99,
      "synopsis": null,
      "writers": ["Robert King"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0111256/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA1NTIzMDY1Ml5BMl5BanBnXkFtZTcwMTUxOTQyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Michael Keaton, Geena Davis, Christopher Reeve | See full cast and crew »"],
      "reviews": [
         "In town for a political campaign, speechwriters for the opposing sides Kevin and Julia met and share a fun evening together unaware of who the other is. Later they meet sparking a conflict that spills from their romance into the battle between the two politicians. This is a very light romantic comedy. The story is promising - romance and political competition but the delivery lets it down. The plot drops into a very lightweight romance with a touch of screwball comedy, musical score doesn't help as it has a gentle tickling tune that plays for basically the whole thing. The script doesn't have any teeth either, it's not sharp like a film set around politics should be and it's not as funny as it thinks it is. Instead it has a screwball feel to it - although it can't hold a candle to the films of the 50's that it clearly aspires to be. It's a shame because for a light movie it has a very heavy cast of well-known faces. Keaton is as good as he always is, but him and Davis lack a great chemistry and their romance isn't convincing, neither is the conflict between them. The support cast is full of well known actors - Bonnie Bedelia, Ernie Hudson, Charles Martin Smith, Mitch Ryan and Christopher Reeve. Even Steven Wright and Harry Shearer pop up for a cameo as sitcom stars Chuck and Eddie. It's a shame that such a face-heavy cast don't have better material to work with. This is a very light romantic comedy. The romance doesn't work due to the lack of spark between the two likeable stars, and the comedy isn't that funny because it isn't sharp. The director and script-writers miss a fantastic opportunity with such a great cast and a good set-up (Ron Underwood! - were City Slickers and Tremors early flukes?). The film brings out some political claws towards the end but even then they're blunted by the need for a romantic conclusion. Nice romance with some funny moments - but could have been much funnier.",
         "I guess you could say this contains a partial spoiler. * * * * I'm a little perplexed at the low ratings most folks seem to give this movie. I think it's because people tend to look at movies as a total product. Me, I'm the kind of guy who can appreciate a classic car, and overlook the rust spots. That's kind of where we are on this movie -- a movie that hits on seven out of eight cylinders. The problem is that romantic comedy is the most difficult of genres, and for most folks, it has to hit on all eight to \"work.\" Viewers think about their feelings; they don't analyze a romantic movie in an intellectual way, and if something doesn't quite work, they leave the theater feeling dissatisfied without knowing exactly why. This movie has so much going for it -- a good premise, clever banter, believable characters, and a romance that doesn't seem forced. And for me, there's a double appeal -- I've worked in the press/political world, and all I can say is I can tell the writers must have been there, too. Was it miscast? Was it shallow? Was the dialog unrealistic? Was everyone too cute? Was the \"strange bedfellows\" premise beyond belief? Naah. None of that. The problem is the third act. I don't want to give away too much, but we have a scene in a bar in which Michael Keaton is given some interesting information, and he has a choice to make. Now, the movie might have spun in a half-dozen interesting directions from this point -- first time I saw it, I was half-sitting up in my chair, once I recognized where the whole thing was leading. I couldn't tell quite where it was going, but I knew it was going to be mighty interesting. There was plenty of dramatic potential, the sort you always need at the start of the third act in a comedy, to make the ending seem a happy relief. The way it spun out in my mind, I suppose the movie would have gone on for another five or six scenes. But here's the trouble -- the next scene is the big climax at the balloon fiesta, and the producers settled for an ending so simple, so dishonest, so downright cheap, that I'm sure it's the thing that left the bad taste in most moviegoers' mouths. Up to this point the movie was a clever comedy of words and ideas and romance; suddenly we got slapstick. How on earth could something like this have happened? How could writers who had done such a good job up to this point have failed so miserably at the climax? My guess is that they didn't -- my guess is that someone with a complete lack of understanding of the material took a movie with a complex, adult, and somewhat ambiguous ending, something in which there were no heroes and no villains, and decided to \"improve\" it. Or maybe a different ending was shot, and it didn't test well in Pomona, and the studio tried another approach. Or maybe the studio decided to save a little money by cutting 15 minutes out of the script. But I suspect some big-time tinkering here -- something that basically spoiled the movie for most viewers, and turned a potential classic into a bomb. Wouldn't it be cool if another ending was shot -- and if someday a \"director's cut\" might be made available? There was so much \"right\" about this movie, I hated to see it spoiled by a botched last couple of minutes. Erik Smith Olympia, Wash.",
         "Julia (Geena Davis) is a longtime speechwriter, currently working on a senatorial campaign in New Mexico. Kevin (Michael Keaton) has just been hired to be the speechwriter for the opposing candidate. Both are insomniacs. Late one night, they connect at the hotel shop counter where they are both reaching for a bottle of sleeping pills. Sparks fly furiously. Neither knows the other's occupation. But, how long will it be before this big secret is revealed? And, isn't Julia engaged to a hotshot international correspondent anyway? This is a cute movie in a cactus setting. Davis and Keaton are funny and believable as the ace writers. A scene where they speak/duel before a group of school children is priceless. The supporting cast is nice, the script is quite good, and the costumes and scenery more than adequate. And, yes, the movie has some good messages about politics, wolves in sheeps clothing, and true believers. Although it won't leave anyone speechless, this intelligent, humorous love story delights its target audience very well.",
         "Although it won't win any awards, it's a light, cute romantic comedy that should be taken as just that. There are no twists and surprises, and unless you have an extremely weak heart, you won't pass out from tension. Michael Keaten and Geena Davis, star as campaign speech writers who fall in love. The catch? They're speech writers for each other's opponents. Keaten for the Republican and Davis for the Democrat. You can basically sum up what the movie is about, and how it will end. There are no big surprises, and although these kinds of movies aren't normally my taste, I love this one. It has a certain quality that's hard to deny and the chemistry between the two actors is always there, and is very noticeable. I would recommend the film the anyone. It's light-hearted and sweet. A great watch.",
         "Easy on the mind, on the eyes, and on the ears. Geena Davis and Michael Keaton make the most of the best lines in the script, and support from Christopher Reeve is excellent. The film stutters on occasion and may be ten minutes or so too long, but it manages to keep you interested, just. Watch for the continuity errors when Geena manages to get herself engaged during one short bedtime phone call. The ring that didn't come from the phone!!! And what an appearance by the red Morgan convertible, put through its paces by Davis and Keaton in more than one way. Good for a night in with popcorn, chocs, and ice cream.",
         "You see it all coming a mile away. The plot twists, the romance. The break up, the making up. It's obviously supposed to be a pairing like Tracy and Hepburn in Adam's Rib or Pat and Mike and you know it from the opening credits. But the strange part is, it works! (Another strange part is that Chris Reeves looks downright haggard and much older than the other two in a real miscasting. There's a welcomeness for seeing him alive and well again but he looks so much older than Davis and is so miscast in this role it is downright uncomfortable all the way around. Except for two \"over the top\" spots in the script (besides the miscasting above, Davis dragging the sleeping Keaton around a room and the ending) which is why I gave it several demerits, it really works. There is real chemistry between Keaton and Davis. I'm a big fan of Keaton in his comedy roles anyway and Geena Davis is easy on the eyes but especially sexy in this role for some reason. And that chemistry, Keaton's delivery of some funny lines and getting us through a lot of unfunny ones and Davis being quirkily beautiful (again like Hepburn), as well as their rapport together, makes this an enjoyable investment of time. Especially if you're spending it with a sweetie of your own. A tasty treat in a portion just large enough for two.",
         "In a nutshell - insomniac political speech-writers Michael Keaton and Geena Davis meet and fall madly in love late one night, but their love is held up when they discover that they are in fact writing for the rival candidates of the latest election. Also complicating matters somewhat is that Davis's fiancé, the late Christopher Reeve playing yet another reporter, is trying to win her back. Not the greatest romantic comedy ever made but it has its moments, thanks to the likable back and forth between Keaton and Davis. Also of interest for the casting of Keaton and the late Reeve as the rivals for Davis's affections, in light of the fact that Reeve and Keaton played DC comics two most iconic characters, Superman and Batman. Bonnie Bedelia and Ernie Hudson also star.",
         "When now a days the only news one hears are tragic and when going to the movies is basically to see violence and sex, it is always refreshing to see a cute silly movie that allows you to smile and spend an hour and a half without suffering through its plot. This movie, in my opinion, carries a little bit of several styles of comedy: situations that make it funny and the use of lines where you have to interpret what they are saying in order for them to make sense and allow you to smile. This movie is very local, in the sense that you have to be a native English speaking person to really understand many of the intended meanings of the dialogues. Any way it is a well spent 90 minutes of your time to relax a little and follow it through with interest. For Spanish speaking viewers, the background song: NO SE TU makes it very worthwhile to watch/hear.",
         "Speechless is a sweet, polite, unboisterous romantic-comedy. Two talkative speechwriters working on opposing sides of the same campaign leave each other speechless, by end's time. Michael Keaton is like my favorite fellow, he's so lovably funny, and I greatly adore Geena Davis, she's so genuinely sweet. The two have good, appropriately awkward chemistry. Speechless misses the mark at being a slyly poignant romantic-comedy, with bad timing and underdeveloped story context. The writer's vision is lost through poor direction. Speechless has a pace too quickened. The movie speeds along too fast and it's hard to keep up with. The way Keaton and Davis fall for each other at the beginning is a bit unpassioned. Speechless has a nice, easygoing feel. It's a great date movie, for what it is, very nice and very enjoyable. Speechless assertively speaks the sweet language of love, and it's really good for it.",
         "Robert King's intelligent writing, Director Ron Underwood's eased direction & Likable Performances by Keaton & Davis make 'Speechless' a great one-time watch. 'Speechless' has a interesting plot of of two opposites attracting to each other. The protagonists face-off each other as Speech-writers. The political portions, the humorous scenes keep the proceedings alive. The climax has a good twist and penultimate scene does get a smile in your face. If there is something that goes wrong in here, that is clearly it's slow-pace. No it's not boring at all, but yet you feel some portions could've been easily edited, especially the character of the Late Christopher Reeve. But there's no denying that this underrated flick deserves a watch. No it doesn't leave you 'Speechles', but surely manages to entertain."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Forge",
         "Metro-Goldwyn-Mayer (MGM)"
      ],
      "summaries": ["Two political speechwriters fall in love before they find out they are working for candidates on opposite sides."],
      "budget": 0
   },
   "movielensId": 378,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-12-16",
      "dvdReleaseDate": "2001-12-26",
      "directors": ["Ron Underwood"],
      "runtime": 99,
      "movieId": 378,
      "title": "Speechless",
      "mpaa": "PG-13",
      "actors": [
         "Michael Keaton",
         "Geena Davis",
         "Christopher Reeve",
         "Bonnie Bedelia",
         "Ernie Hudson",
         "Charles Martin Smith",
         "Harry Shearer",
         "Steven Wright",
         "Willie Garson"
      ],
      "imdbMovieId": "0111256",
      "originalTitle": "Speechless",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["PxZo3oM5k2E"],
      "plotSummary": "A romantic comedy. Michael Keaton and Geena Davis are speechwriters for competing political campaigns. Witty and amusing for the political junkies amongst us.",
      "tmdbMovieId": 15128,
      "avgRating": 3.12578,
      "releaseYear": "1994",
      "numRatings": 2409,
      "posterPath": "/nN5BPaG720jhkNf29Pogm1O1mq4.jpg"
   }
}