{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "paris",
            "id": 90
         },
         {
            "name": "africa",
            "id": 409
         },
         {
            "name": "illegal immigration",
            "id": 2173
         },
         {
            "name": "ethiopia",
            "id": 5946
         },
         {
            "name": "human trafficking",
            "id": 6019
         },
         {
            "name": "language course",
            "id": 6277
         },
         {
            "name": "circumcision",
            "id": 7540
         },
         {
            "name": "blaxploitation",
            "id": 10601
         }
      ],
      "imdb_id": "tt0070679",
      "video": false,
      "title": "Shaft in Africa",
      "recommendations": [
         493,
         34768,
         90590,
         86343,
         21968,
         39889,
         40456
      ],
      "backdrop_path": "/nStzw5GihdhJgzGNaJzhw5ZCxrM.jpg",
      "revenue": 1458000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "John Shaft",
               "gender": 2,
               "credit_id": "52fe424ac3a36847f8012a6d",
               "name": "Richard Roundtree",
               "profile_path": "/3OyAx3Vrv1mQLOvl7YHaIaFwDuW.jpg",
               "id": 6487,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Vincent Amafi",
               "gender": 2,
               "credit_id": "52fe424ac3a36847f8012a71",
               "name": "Frank Finlay",
               "profile_path": "/rnWMfVFu1XQ5WS9hRr24jeZ9Ni1.jpg",
               "id": 6637,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Aleme",
               "gender": 1,
               "credit_id": "52fe424ac3a36847f8012a75",
               "name": "Vonetta McGee",
               "profile_path": "/uz9JHawFEhIRiyNVFmABQ5l1C8S.jpg",
               "id": 6780,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Jazar",
               "gender": 0,
               "credit_id": "52fe424ac3a36847f8012a79",
               "name": "Neda Arnerić",
               "profile_path": "/co7HNvtp8l0YN0pJ08OCaumTvnB.jpg",
               "id": 6781,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Wassa",
               "gender": 0,
               "credit_id": "52fe424ac3a36847f8012a7d",
               "name": "Debebe Eshetu",
               "profile_path": null,
               "id": 6782,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Marco Sassari",
               "gender": 0,
               "credit_id": "52fe424ac3a36847f8012a81",
               "name": "Spiros Focás",
               "profile_path": "/kadjsoJ5LhRtjH76w1ACuMLeUN6.jpg",
               "id": 6783,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Perreau",
               "gender": 2,
               "credit_id": "52fe424ac3a36847f8012a85",
               "name": "Jacques Herlin",
               "profile_path": "/ztGRlFmz3GEIWpNb9uIX7TtAiFF.jpg",
               "id": 6784,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Ziba",
               "gender": 0,
               "credit_id": "52fe424ac3a36847f8012a89",
               "name": "Jho Jhenkins",
               "profile_path": null,
               "id": 6785,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Oyo",
               "gender": 2,
               "credit_id": "52fe424ac3a36847f8012a8d",
               "name": "Willie Jonah",
               "profile_path": null,
               "id": 6786,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Pino",
               "gender": 2,
               "credit_id": "52fe424ac3a36847f8012a91",
               "name": "Adolfo Lastretti",
               "profile_path": "/wssCNcdZ7ziWSbNYpABhJ62eHAe.jpg",
               "id": 6787,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "Angelo",
               "gender": 2,
               "credit_id": "569f320b92514138490013b7",
               "name": "Aldo Sambrell",
               "profile_path": "/doSGQEp3BDSCDmbX8hlaTOoqXST.jpg",
               "id": 49895,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4249c3a36847f8012a5d",
               "name": "John Guillermin",
               "profile_path": "/mIfmS5Sq8djOdn2YfMeeEfL7YbU.jpg",
               "id": 6778,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe424ac3a36847f8012a63",
               "name": "Ernest Tidyman",
               "profile_path": null,
               "id": 6483,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe424ac3a36847f8012a69",
               "name": "Stirling Silliphant",
               "profile_path": "/rU0rdr05rqlBotVaSoYPUnDxAB.jpg",
               "id": 6779,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe424ac3a36847f8012a97",
               "name": "Roger Lewis",
               "profile_path": null,
               "id": 6776,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe424ac3a36847f8012a9d",
               "name": "Johnny Pate",
               "profile_path": null,
               "id": 6788,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe424ac3a36847f8012aa3",
               "name": "Marcel Grignon",
               "profile_path": null,
               "id": 6789,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe424ac3a36847f8012aa9",
               "name": "Max Benedict",
               "profile_path": null,
               "id": 6790,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe424ac3a36847f8012aaf",
               "name": "Irene Howard",
               "profile_path": null,
               "id": 6791,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "52fe424ac3a36847f8012ab5",
               "name": "Jose Villaverde",
               "profile_path": null,
               "id": 6792,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "52fe424ac3a36847f8012abb",
               "name": "John Stoll",
               "profile_path": null,
               "id": 6793,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 3.850098,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 494,
      "vote_count": 11,
      "budget": 2142000,
      "overview": "Detective John Shaft travels incognito to Ethiopia, then France, to bust a human trafficking ring.",
      "similar": [
         8681,
         9732,
         10527,
         11430,
         606,
         14211,
         7350,
         9904,
         10603,
         1672,
         28761,
         8841,
         10586,
         11385,
         161143,
         18994,
         57586,
         15587,
         1986,
         18513
      ],
      "original_title": "Shaft in Africa",
      "runtime": 112,
      "poster_path": "/fY5SLWGJTd50f2TsHokvXBOywQG.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Shaft Productions Ltd.",
            "id": 12145,
            "origin_country": ""
         },
         {
            "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
            "name": "Metro-Goldwyn-Mayer",
            "id": 21,
            "origin_country": "US"
         }
      ],
      "release_date": "1973-06-14",
      "vote_average": 5.6,
      "belongs_to_collection": {
         "backdrop_path": "/muZrPdBs937VAx03Giw66x1XGus.jpg",
         "name": "Shaft Collection",
         "id": 495,
         "poster_path": "/z6UFfaPSYIEMZGxiNGuy881hcsH.jpg"
      },
      "tagline": "Shaft is stickin' it...all the way.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Guillermin"],
      "runtime": 112,
      "synopsis": null,
      "writers": [
         "Ernest Tidyman",
         "Stirling Silliphant"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0070679/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA4ODAxOTcxN15BMl5BanBnXkFtZTcwNzY2MjIyMQ@@._V1_SY317_CR11,0,214,317_AL_.jpg",
      "actors": ["Stars: Richard Roundtree, Frank Finlay, Vonetta McGee | See full cast and crew »"],
      "reviews": [
         "As an urban white kid in the 1970s, I just sort of ignored the Shaft movies. Too ethnic, too threatening \u0096 the usual crap. Afterwards, they were just sort of forgotten. But the fictional character John Shaft, who was once a scary black icon for many white Americans, now seems to enjoy almost universal affection as an indelible part of American pop culture. After all these years, I finally got around to watching all three Shaft movies for the first time, all in one weekend, from the new and excellent DVD editions. On buying these DVDs I noticed the video store clerk smiling at them, which prompted me to suggest that John Shaft is a bad mother\u0085 He immediately answered with the expected response: `Shut yo mouth.' We had a laugh over that, and it occurred to me that you could probably say that line on the Great Wall of China and still get the expected response. These transfers look fresher and sharper than they probably ever looked on the big screen, even in the 1970s. A real treat! No extras aside from the trailers for all three films, which are certainly fun to watch, but the films themselves are so much fun, why complain? A lot has been said about the significance of the Shaft films, and their effect on the black and white communities and their perceptions of each other. I don't feel particularly qualified to address all that, but I will say that these are damn good thrillers by any standard. `Shaft' and `Shaft's Big Score' are gritty urban thrillers showcasing New York City circa 1970s, untamed and unapologetic. They involved dueling gangsters both black and white, hardass NYPD detectives, and of course super-cool, super-bad brother man Shaft caught in the middle, looking out for himself and his buddies. Watch them both back-to-back as I did, and you'll find yourself involuntarily speaking in 1970's slang by the time you're through. Yeah, it's a little cheesy, but so what? It's great fun too. `Shaft in Africa' is a radical departure, wherein Shaft becomes involved in cracking an international slave trading operation. This takes him from New York, to Africa, to Paris for a final confrontation with a James Bondian foreign villain played nicely by British actor Frank Finlay. The colorful locales (Ethiopia, Paris) and badass action make it a great finish to the Shaft trilogy, and needless to say, Richard Rountree brings it off to perfection. Anyone who enjoys the older James Bond films should enjoy Shaft in Africa, as they have a lot in common stylistically. One more point: these films were made in the early 70's, which means that when Shaft `gets it on' with a lady, as he inevitably does, we do not see ten minutes of graphic sex. The camera moves away tactfully and we move on to the next scene, much in the style of the old James Bond films of that era, but with a bit more skin visible. The sex scenes are tame by today's standards, but the films were R-rated in their time, and the old trailers for them warn the moviegoer that if you are underage and want to see the film, `you gotta ask yo mamma.'",
         "The second movie in the Shaft series ('Shaft's Big Score!') was a big disappointment being a tired retread of the dynamic first Shaft movie, a film which basically created the blaxploitation boom of the early 1970s. 'Shaft In Africa' sees director Gordon Parks and creator/writer Ernest Tidyman replaced by John Guillermin and Stirling Silliphant, a safer more Hollywood team which would hit pay dirt the following year with 'The Towering Inferno'. It doesn't have much of a blaxploitation feel to it, it's more of a James Bond thing with a black Bond, but that's okay, it's entertaining enough, and a definite improvement on the lacklustre 'Shaft's Big Score!' Richard Roundtree once again plays super cool private dick John Shaft. This time he is coerced into going undercover in Africa to try and break a slavery ring run by the evil Amafi (Frank Finlay). Roundtree is one cool mutha, and this movie features more sex and violence than the others, so it's easy to watch. Vonetta McGee ('Hammer', 'Blacula') plays Shaft's main love interest, but he also finds time to bed Amafi's sexy and amoral mistress Jazar (Neda Arneric) along the way. It's a pity that there weren't more Shaft movies after this as you could see the series having a lot of life left in it. Instead Richard Roundtree made a TV series which lasted a couple of years, and then his career started to slide into obscurity. By the 1980s he was mostly playing supporting cop roles in dumb action movies. Why this happened is anybody's guess as Roundtree was, along with Fred Williamson, the coolest and most charismatic of the 1970s blaxploitation stars. Both actors deserved a lot more mainstream success.",
         "Let's face it, none of the Shaft movies are exactly masterpieces but the character Shaft surely is a classic, who delivers some classic one-liners. In this Shaft 'adventure' the creators obviously wanted to manifest Shaft as the African-American answer to the successful James Bond franchise. For most parts they actually succeeded in this. Shaft is even more sexist than James Bond and he surely is more violent. The violence is not always tasteful at times however. The story is told messy at times. The action sequences seem to come out of nowhere and are simply just pointless at times. Also the weak editing doesn't help much. I however wouldn't had mind it having seen more Shaft movies being made. Unfortunately this was the last (unless you also count the 2000 \"Shaft\" version). The Shaft movies have a certain hip 70's atmosphere, which I like and the main character is reason enough to watch a Shaft movie. Great character, weak storytelling. 6/10 http://bobafett1138.blogspot.com/",
         "Perhaps the most entertaining of the three \"Shaft\" films, but be warned: it's incredibly violent! (Shaft snaps necks, elbows, runs over people with his car, you name it). It's also more sexually provocative than any other mainstream release of the 70s I can think of. In other words, this is the first and only \"Shaft\" movie that lives up to its reputation in terms of violence and nudity. Whether or not this is a recommendation is up to you to decide. (**1/2)",
         "Why do you ask? Its got more one-liners, better (as in more amusing) dialogue, better action. Shaft becomes the poor man's James Bond in this one, doing what amounts to international spying but without the hi-tech tricks of Bond. Great final \"Shaft enraged by the slow working justice system\" ending. Great title song by the 4 Tops (\"Are You Bad Enough\") doesn't measure up to the classic \"Shaft\" but still delivers.",
         "This is a film that EVERYONE should see. It all starts with the title, Shaft in Africa. The concept of Shaft going to Africa and the cover alone are reason enough to get it. Plus, it is inexpensive and can be found at most retail stores. Ok, lets break this film down shall we. First, while watching this movie I laughed harder than I ever have before. The second time the man with the staff broke down Shaft's door, I was in tears. The first time was hilarious, but again? Pure, unadulterated genius. Shaft is like James Bond minus all of the silly innuendo and sex jokes. Plus, you actually get to see NUDITY, albeit some is Richard Roundtree's bare rear end and a fat hooker, there is an extremly hot vixen NAKED. You can never tell what is going to happen next whether he be riding a camel or the whole, triangle shirt-waist factory inspired, building fire minus the locked doors and the slaves actually running UPSTAIRS. To sum it up, this movie has it all. Sex, Violence, Gore, Explosions, Stick fights, door breaking, but sadly, features a dog getting killed which NO ONE wants to see. I seriously think the only reason the dog was there was so that Shaft could utter the \"Only one man died today, and two dogs\" line, which wasn't that amusing. No one wants to see a dog getting killed. This movie rocks my socks off. Period.",
         "Shaft assumes more of the Bond mantle in this film by going undercover to find out who is running the slave trade out of Africa into Europe. However, it really is too much of a stereotype to Shaft and takes away some of what makes him special. Shaft, Richard Roundtree again, of course, belongs uptown across 110th street. That's his turf, and putting him in a robe with a stick is just too much. This film just went too far, past where the imagination can stretch, in letting Shaft win. Yes, it was letting Shaft win, as he couldn't possibly have dodged all the attempts made on his life and still have energy to magically bed Vonetta McGee, and Yugoslavian Neda Arneric. Having said that, there were some very good moments in the film, and it is still worth the time to see Roundtree in action.",
         "After the abysmal Shaft's Big Score, this second follow-up to the original 1971 legend is much finer stuff. John Guillermen takes over from blaxplotation maestro Gordon Parks as director and excellently brings freshness to the whole thing, with Richard Roundtree's supercool private eye being sent to Ethopia in order to infiltrate and bring down a ruthless slave-trading scam. This entry is wonderfully self-concious in the fact that it all smacks of the Bond saga - even Shaft says it when he finds himself handed a couple of gadgets for his mission. Therefore, there's a strong and largely satisfying formula behind the whole affair. The action is still a little clumsy and quite excessively violent, but in general this is bigger, brighter and funner than what came before it.",
         "This film has more holes in it than a chunk of swiss cheese and it still worked because it had the best theme music ever recorded and the dude playing Shaft is charismatic & good looking. The issue of female circumcision is mentioned by a black African woman who is westernized but wants to \"embrace the ways of her ancestors\" and enter into a 'relationship of honor where there would be no sex involved.' I find that a really unnecessary nod to ways that are best forgotten as they are essentially disgusting practices-that have been forced on young women in Africa who suffered because of it in the modern era. Shaft casually used the F bomb to talk about the sex act which is very tacky. Only sh*** use that kind of language in todays world-sh*** and hookers with really low IQ's. Towards the end of the film a guy with a submachine gun misses Shaft who is standing in the open not 30 feet away from him. Can you say there's no way that would happen in real life-yes-I knew you could. Plus some white guy has dark makeup all over his face to play the part of some white guy who has lived in Addis Ababa a long time-yet he also appears later in the film as a bad guy sans dark makeup. Kinda wonky. The issue that the film talk about via its plot is modern slavery-kudos for talking about some serious sh** no kudos for doing it such a f***** up way that it really does't mean a whole lot. It was made ages ago. So who cares. Maybe its still worth 'discussing' somewhere-like here. I think people liked it because it was Shaft but I also think it not a very good film.",
         "This violent Shaft(Roundtree) entry begins when he's obligated by threats to pull off a dangerous mission.He must to go undercover to Ethiopia.In Addis Ababa,Shaft assumes the identity a native,he's accompanied by a beautiful African young(Voneta McGee).His work is to break up a slave trade ring whose origin encounter in Paris and ruled by a tyrannical mobster(Frank Finlay)and hoodlums(Aldo Sambrell)who are exploiting the immigrants in chain-gang employments and minimum wage.The private-eye eliminates anyone who stands in his aim ,battling a variety of nasties and keeping things moving along until the final confrontation into the Château of Montfort. The picture packs noisy action,violent fights,brutal killings,nudism and is quite amusing.The movie is plenty of suspense,thriller,intrigue,adventures and kinky sex,as usual.Strong,raw screenplay by Stirling Shilliphant(habitual of Irwin Allen,Towering inferno,Poseidon,Swarm) and based on the characters by Ernest Tdyman(French Connection).Richard Roundtree is good as Shaft,his females are Voneta Mcgee with a wide career in blaxploitation and distinguished secondary,besides Neda Armeric, a Serbian actress,she was recently elected for Serbian Parliament but she withdrew politics after scandal when her vote were registered in Parliament while she was on summer holidays.The motion picture is professionally directed by John Guillermin,a future author of disaster movies(Towering inferno,Skyjacked,King Kong).The result is an entertaining entry for action enthusiastic and blaxploitation fans with lots of violence,adult issues and profanities.This third outing(the first titled ¨Shaft¨and the second¨Big score¨ by Gordon Parks)is followed by seven TV episodes(1973,1974) and 2000 version by John Singleton with Samuel L. Jackson."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Crime",
         "Drama"
      ],
      "productionCompanies": [
         "Metro-Goldwyn-Mayer (MGM)",
         "Shaft Productions Ltd."
      ],
      "summaries": [
         "John Shaft is persuaded by threats of physical force, the promise of money, and the lure of a pretty tutor, to assume the identity of a native-speaking itinerant worker in Africa. His job is to help break a racket that is smuggling immigrants into Europe then exploiting them. But the villains have heard that he is on his way.",
         "P.I. John Shaft is recruited to go undercover to break up a modern slavery ring where young Africans are lured to Paris to do chain-gang work."
      ],
      "budget": 0
   },
   "movielensId": 3781,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1973-06-14",
      "dvdReleaseDate": "2000-06-06",
      "directors": ["John Guillermin"],
      "runtime": 112,
      "movieId": 3781,
      "title": "Shaft in Africa",
      "mpaa": "",
      "actors": [
         "Richard Roundtree",
         "Frank Finlay",
         "Vonetta McGee",
         "Neda Arnerić",
         "Debebe Eshetu",
         "Spiros Focás",
         "Jacques Herlin",
         "Jho Jhenkins",
         "Willie Jonah",
         "Adolfo Lastretti",
         "Aldo Sambrell"
      ],
      "imdbMovieId": "0070679",
      "originalTitle": "Shaft in Africa",
      "genres": [
         "Adventure",
         "Action",
         "Thriller",
         "Crime",
         "Mystery"
      ],
      "youtubeTrailerIds": ["3GnDPnl2H-4"],
      "plotSummary": "Detective John Shaft travels incognito to Ethiopia, then France, to bust a human trafficking ring.",
      "tmdbMovieId": 494,
      "avgRating": 2.664,
      "releaseYear": "1973",
      "numRatings": 125,
      "posterPath": "/fY5SLWGJTd50f2TsHokvXBOywQG.jpg"
   }
}