{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "bomb",
            "id": 258
         },
         {
            "name": "gambling",
            "id": 395
         },
         {
            "name": "helicopter",
            "id": 720
         },
         {
            "name": "cemetery",
            "id": 1227
         },
         {
            "name": "coffin",
            "id": 1909
         },
         {
            "name": "attempted murder",
            "id": 2013
         },
         {
            "name": "investigation",
            "id": 5340
         },
         {
            "name": "observer",
            "id": 5446
         },
         {
            "name": "blaxploitation",
            "id": 10601
         },
         {
            "name": "grave digger",
            "id": 158741
         }
      ],
      "imdb_id": "tt0069257",
      "video": false,
      "title": "Shaft's Big Score!",
      "recommendations": [
         494,
         2139,
         86343,
         34768,
         47517,
         40456,
         29169,
         27706,
         27232,
         23587,
         27098
      ],
      "backdrop_path": "/zvRcONvzJZaC54PRijKvcrrOW9j.jpg",
      "revenue": 10000000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "John Shaft",
               "gender": 2,
               "credit_id": "52fe4249c3a36847f80129eb",
               "name": "Richard Roundtree",
               "profile_path": "/3OyAx3Vrv1mQLOvl7YHaIaFwDuW.jpg",
               "id": 6487,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Bumpy Jonas",
               "gender": 2,
               "credit_id": "52fe4249c3a36847f80129ef",
               "name": "Moses Gunn",
               "profile_path": "/lpFU9TYL9X2uz2RE9zKWL59CkNF.jpg",
               "id": 6561,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Willy",
               "gender": 0,
               "credit_id": "52fe4249c3a36847f80129f3",
               "name": "Drew Bundini Brown",
               "profile_path": null,
               "id": 6768,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Gus Mascola",
               "gender": 2,
               "credit_id": "52fe4249c3a36847f80129f7",
               "name": "Joseph Mascolo",
               "profile_path": "/b97KsvIgu2sXTfSO1556vfSGRKa.jpg",
               "id": 6769,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Rita",
               "gender": 1,
               "credit_id": "52fe4249c3a36847f80129fb",
               "name": "Kathy Imrie",
               "profile_path": null,
               "id": 6770,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Johnny Kelly",
               "gender": 2,
               "credit_id": "52fe4249c3a36847f80129ff",
               "name": "Wally Taylor",
               "profile_path": "/nqUN3VZYRiuLRFflvdl50z7Qbsc.jpg",
               "id": 6771,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Capt. Bollin",
               "gender": 2,
               "credit_id": "52fe4249c3a36847f8012a03",
               "name": "Julius Harris",
               "profile_path": "/vhyuxFmam4SQSjTOLPStOVYMgbb.jpg",
               "id": 6772,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Arna Asby",
               "gender": 0,
               "credit_id": "52fe4249c3a36847f8012a07",
               "name": "Rosalind Miles",
               "profile_path": null,
               "id": 6773,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Pascal",
               "gender": 2,
               "credit_id": "52fe4249c3a36847f8012a0b",
               "name": "Joe Santos",
               "profile_path": "/hPaeksIz6Fg7PtRMvcdCD76Z0Fy.jpg",
               "id": 6774,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Al",
               "gender": 0,
               "credit_id": "52fe4249c3a36847f8012a0f",
               "name": "Angelo Nazzo",
               "profile_path": null,
               "id": 6775,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4249c3a36847f80129e1",
               "name": "Gordon Parks",
               "profile_path": "/yldLBBMsqCZ7ha1XpUqV15qCxJx.jpg",
               "id": 6558,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4249c3a36847f80129e7",
               "name": "Ernest Tidyman",
               "profile_path": null,
               "id": 6483,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe4249c3a36847f8012a15",
               "name": "Roger Lewis",
               "profile_path": null,
               "id": 6776,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4249c3a36847f8012a1b",
               "name": "Ernest Tidyman",
               "profile_path": null,
               "id": 6483,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4249c3a36847f8012a21",
               "name": "Gordon Parks",
               "profile_path": "/yldLBBMsqCZ7ha1XpUqV15qCxJx.jpg",
               "id": 6558,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4249c3a36847f8012a27",
               "name": "Urs Furrer",
               "profile_path": null,
               "id": 6570,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe4249c3a36847f8012a2d",
               "name": "Judith Lamb",
               "profile_path": null,
               "id": 6572,
               "department": "Production",
               "job": "Casting"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 1.621765,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 493,
      "vote_count": 14,
      "budget": 1978000,
      "overview": "John Shaft is back as the lady-loved black detective cop on the search for the murderer of a client.",
      "similar": [
         1572,
         96,
         807,
         90,
         9604,
         1092,
         193893,
         75780,
         45612,
         984,
         25376,
         9739,
         6973,
         4349,
         21484,
         359412,
         846,
         357096,
         11423,
         303858
      ],
      "original_title": "Shaft's Big Score!",
      "runtime": 104,
      "poster_path": "/jioGhMgP8d7eu1G7YT7xeyLOJuc.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Shaft Productions Ltd.",
            "id": 12145,
            "origin_country": ""
         },
         {
            "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
            "name": "Metro-Goldwyn-Mayer",
            "id": 21,
            "origin_country": "US"
         }
      ],
      "release_date": "1972-06-08",
      "vote_average": 6,
      "belongs_to_collection": {
         "backdrop_path": "/muZrPdBs937VAx03Giw66x1XGus.jpg",
         "name": "Shaft Collection",
         "id": 495,
         "poster_path": "/z6UFfaPSYIEMZGxiNGuy881hcsH.jpg"
      },
      "tagline": "Last time he was nice. This time he's ice!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Gordon Parks"],
      "runtime": 104,
      "synopsis": null,
      "writers": ["Ernest Tidyman"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0069257/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI3NTIzNTc3NF5BMl5BanBnXkFtZTcwNjgxNDAyMQ@@._V1_SY317_CR8,0,214,317_AL_.jpg",
      "actors": ["Stars: Richard Roundtree, Moses Gunn, Drew Bundini Brown | See full cast and crew »"],
      "reviews": [
         "I'm not sure what went wrong with this sequel to 'Shaft'. Once again Gordon Parks directs, Ernest Tidyman writes and Richard Roundtree stars, but there's something missing. It isn't anywhere near as entertaining as the original and the story is very thin and padded out. The score isn't as good either. Isaac Hayes only contributes one number, Parks himself does the rest. Moses Gunn and Drew Bundini Brown reprise their roles as Bumpy and Willy and blaxploitation fave Julius W. Harris ('Superfly', 'Black Caesar') appears as a cop who forms an uneasy alliance of sorts with Shaft. Also check out future soap star Joseph Mascolo as a clarinet playing mobster called, er, Mascolo and Joe Santos later of 'The Rockford Files' as his right hand man. Richard Roundtree is still super cool as John Shaft and he helps make this movie to be fairly enjoyable. Personally I prefer the third in the series 'Shaft In Africa' to this, but if the truth be told neither sequel is a patch on the original which in an undisputed blaxploitation classic and essential viewing for any 70s buff.",
         "Shaft really was the African-American answer to the popular James Bond franchise. This movie shows this perhaps more than any of the other Shaft movies. Violence, girls, sex, chases, \"Shaft's Big Score!\" has it all! By no means any of the Shaft movies are among the greatest of all time. Nevertheless they are extremely memorable thanks to its main character, played by Richard Roundtree. He's hip, digs his women and isn't afraid to hold back when it comes to action. He's a classic and important iconic African-American character from the '70's. The movie its story and plot lines are a bit messy (in that way this movie also resembles James Bond movies), which also makes the movie unclear and not always totally interesting to follow. The movie also really lacks a good main ruthless villain. The villain in this movie is perhaps introduced a bit too late to really leave his mark on the movie. In that way \"Shaft's Big Score!\" is a really lacking movie, when it comes down to its story, storytelling and characters. Thankfully the movie isn't lacking in action and great dialog. Some of the dialog is just brilliant and suits the atmosphere of the movie- and its time period extremely well. Also of course the music adds to this atmosphere. But surprisingly good is also the action in the movie. The movie doesn't really feature that much action but the lack of it is made up during the great finale, that features a good old fashioned typical '70's car chase, boat chase and helicopter chase in one, James Bond style. It's really true that the ending makes up a lot. It makes you forget some of the weaker points of the movie, although in the end \"Shaft's Big Score!\" is still nothing more than an average action-flick with one great, cool main character. A good movie featuring the classic character Shaft and some really great action. 6/10 http://bobafett1138.blogspot.com/",
         "This is the proper sequel to Shaft and one that is worthy of his name. He is again the cool and calm brother that doesn't let anything bother him. He even gets worked over good by the baddies. Moses Gunn is back as Bumpy, a Blofeld character, and antagonist extraordinaire. And, of course, it's the old song about the Mafia horning in on Black turf that makes Shaft interesting - playing against both sides; black and white. Rosalind Miles is here to keep Shaft interested at home, but you know he will stray, so there is Kathy Imrie to bump into and bed. The ending with it's car chase and helicopter and machine guns is pure Bond, and Shaft outdoes Bond with a satchel full of loot to take home. Pure fun!",
         "The second outing concerns about Shaft , the African-American independent eye-private. This time confronts sinister mobsters, battling black(again Bumpy, Moses Gunn) and white(Mascolo, Joe Santos) gangs. Fiercy Shaft finds a dead friend , a brother his sweet-girl, he ran under legitimate business, a funeral home and all types of insurances, however he hid a stakes issues in Queens . Two-fisted Shaft in order to avenge the friend, vows revenge and investigates the deeds. Meanwhile a police captain(Julius Harris) suspects on Shaft. Extremely tough Shaft spontaneously encounters himself in the middle of a bands war and running afoul of the underworld. This one features thrills, hair-raising suspense,raw energy, nudism, adult subject matter and lots of violence. Plenty of intrigue, kinky sex and noisy action; Shaft keeps things moving along , until final fight in a pier with a breathtaking pursuit by a helicopter. Violent, tough screenplay by Stirling Shilliphant based on characters created by Ernest Tidyman. Great and enjoyable musical score by the same director Gordon Parks with an Isaac Hayes style, sadly recently deceased. Hayes's theme song stills resonates today. Followed by superior third part 'Shaft in Africa(John Guillermin)'with Vonetta McGee, besides contemporary and revisionist version by John Singleton(2000) with Samuel L. Jackson and as secondary Richard Roundtree as Shaft's uncle. Furthermore seven television episodes (1973, 74 years)starred by Roundtree .The Shaft series turn out to be one the best black films from the early 70s.",
         "Hmmm....a sequel to the extremely popular \"Shaft\", bigger-budgeted, made just one year later...do you smell \"cash in\" here? Unfortunately, this is nothing more than a run-of-the-mill crime drama, redeemed only by a few good (if overlong) action sequences. Richard Roundtree still is perfect as Shaft, though (his best scene: the look he gives to a white cop while ordering \"black coffee\"). (**)",
         "Private Investigator \"John Shaft\" (Richard Roundtree) is back and this time he is trying to find the murderer of his friend who was running a numbers game in Queens. As it so happens the victim's partner \"Johnny Kelly\" (Wally Taylor) had gambled away $250,000 and a mob boss by the name of \"Gus Mascola\" (Joseph Mascolo) wants it back\u0097along with a 50% share in Johnny Kelly's numbers racket. However, Johnny Kelly has other plans and decides to double cross Mascola by getting another mob boss from Harlem named \"Bumpy Jonas\" (Moses Gunn) involved in the same deal. Not only does he hope for a war between the two mob bosses but he also wants John Shaft killed in the process too. Now, rather than reveal any more of the movie I will just say that this was an adequate sequel to \"Shaft\". While it started off pretty well it got bogged down toward the end with an extremely long chase-and-gunfight scene which I thought actually detracted from the overall effect. In any case, although it wasn't bad necessarily it still wasn't nearly as good as the original. I rate it as average.",
         "(77%) Very likely to be the most backed blaxploitation movie of them all, as the original was such a big hit both critically and financially. Most of the blaxplotation boxes are ticked here, Shaft is super cool, the music is great, some of the lines are very funny, he gets the girls, the opening is great, the bad guys are mostly white gangsters with a lone black guy letting the side down, it's all there, but what this has that all others don't is the fantastic action-packed ending. As action sequences go this is one of the best I've ever seen, it just goes on and on and I loved every second of it and it looks as if the director Mr Parks was given free control to do what ever her wanted and he really went for it. This could very likely be may favourite of the breed as along with \"Black Caesar\", it's a fine example of what the series was capable of when everything slotted into place so well.",
         "Richard Roundtree carried on his character of John Shaft for a sequel to the original Shaft with Shaft's big score. This time he has no client, he's working on his own to solve the bombing murder of a friend, find $250,000.00 from the same friend that went missing at the same time and protect the sister of the deceased who may or may not have the money. Kathie Imrie is the sister and guarding her body is the best part of the deal as it is a lovely body. But his real problem is the partner of the dead friend Wally Taylor. Taylor and the deceased had many interests, a funeral parlor and an insurance agency. But they also had the numbers racket in Harlem and Taylor has a bad gambling habit. As in the first Shaft film, Italian gangsters led by Joseph Mascolo and Joe Santos are looking to move in on the numbers. That is if Harlem racketeer Moses Gunn from the first Shaft movie doesn't move it first. And the ever present police are also interfering and they are represented by Julius Harris. For some reason they dropped the Oscar winning theme from the first Shaft movie, though Isaac Hayes did write more music. Why drop a trademark? I'll bet a lot of fans were disappointed. Without even the Oscar winning song, Shaft's Big Score shapes up as another routine action/adventure film, fans of Roundtree will like it.",
         "Let's face it, the great thing about SHAFT was the fact that Richard Roundtree represented a new, ultra hip inner city private eye. With that novelty gone, this sequel turns out to be a fairly pedestrian crime thriller. Despite decent direction by Gordon Parks and a script by Ernest Tidyman, there's nothing new or particularly exciting here. Roundtree is fine and the supporting cast features a mixed bag of character actors: Drew Bundini Brown; Julius Harris; Joe Santos; Wally Taylor. Joseph Mascolo plays the villain, a pretentious fop who makes shrimp Newberg and plays the piccolo. There is an exciting, if protracted, chase sequence involving cars, a boat and a helicopter. The music, which is good, is mostly by Parks himself. Moses Gunn plays \"Bumpy.\"",
         "My Take: Fine Harlem-set thriller with a thrilling climax. Richard Roundtree returns as the black foul-mouthed private eye John Shaft, reprising the role he made famous in the previous film SHAFT. Made in 1972, SHAFT'S BIG SCORE clearly shows its age as an old star vehicle. Almost everything, from clothing, quips and concept, have been outdated by today's bigger standards. Still, there's much to enjoy in Roundtree's iconic portrayal as the private eye Shaft as he gets tangled up with the mob, led by gangster Gus Mascola (Joseph Mascolo). So much of the film is devoted to a lot of mob meetings and Shaft at his private eye work, and less comes the action. Up until the finale, a terrific long helicopter chase, the film is devoted to Ernest Tidyman's (THE FRENCH CONNECTION) well-written if often tedious screenplay. Long out-dated and outdone by better anti-Bond cop movies as DIRTY HARRY and THE FRENCH CONNECTION which still stood the test of time. Still, SHAFT'S BIG SCORE! is an enjoyable caper, Roundtree and the action finale delights. Rating: *** out of 5."
      ],
      "genres": [
         "Action",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Metro-Goldwyn-Mayer (MGM)",
         "Shaft Productions Ltd."
      ],
      "summaries": [
         "When Shaft finds out that a dead friend ran a numbers racket out of his legitimate business and left $200,000 unaccounted for, he knows why he has suddenly found himself in the middle of a war between rival thugs. These goons are all trying to take over the territory of the dead man as well as get their hands on the missing 200 grand. Shaft has all he can handle trying to track down the money and, at the same time, keep his friend's sister from the clutches of the hoods.",
         "Shaft is back to find the murderer of an old friend on the cold hard city streets with a little help from his new friends."
      ],
      "budget": 0
   },
   "movielensId": 3782,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1972-06-08",
      "dvdReleaseDate": "2000-06-06",
      "directors": ["Gordon Parks"],
      "runtime": 104,
      "movieId": 3782,
      "title": "Shaft's Big Score!",
      "mpaa": "",
      "actors": [
         "Richard Roundtree",
         "Moses Gunn",
         "Drew Bundini Brown",
         "Joseph Mascolo",
         "Kathy Imrie",
         "Wally Taylor",
         "Julius Harris",
         "Rosalind Miles",
         "Joe Santos",
         "Angelo Nazzo"
      ],
      "imdbMovieId": "0069257",
      "originalTitle": "Shaft's Big Score!",
      "genres": [
         "Action",
         "Adventure",
         "Crime",
         "Mystery"
      ],
      "youtubeTrailerIds": ["_C4qBx29RqM"],
      "plotSummary": "John Shaft is back as the lady-loved black detective cop on the search for the murderer of a client.",
      "tmdbMovieId": 493,
      "avgRating": 2.7,
      "releaseYear": "1972",
      "numRatings": 160,
      "posterPath": "/jioGhMgP8d7eu1G7YT7xeyLOJuc.jpg"
   }
}