{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "gambling",
            "id": 395
         },
         {
            "name": "casino",
            "id": 585
         },
         {
            "name": "writer's block",
            "id": 5914
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "crime",
            "id": 14536
         },
         {
            "name": "intrigue",
            "id": 34038
         },
         {
            "name": "cult film",
            "id": 34117
         },
         {
            "name": "croupier",
            "id": 193266
         },
         {
            "name": "neo-noir",
            "id": 207268
         }
      ],
      "imdb_id": "tt0159382",
      "video": false,
      "title": "Croupier",
      "recommendations": [
         3515,
         15598,
         24249,
         26761,
         63020,
         26748,
         12555,
         15394,
         12235,
         29193,
         7351,
         42449,
         52726,
         68099,
         62107,
         64832,
         31460,
         25501,
         32075,
         8272
      ],
      "backdrop_path": "/obZPzdJ3SmfGnoXtzMc58w5QjIx.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 15,
               "character": "Jack Manfred",
               "gender": 2,
               "credit_id": "52fe45179251416c7504b773",
               "name": "Clive Owen",
               "profile_path": "/jm2as6tLcvHCYQvmMYM4VK6JEnr.jpg",
               "id": 2296,
               "order": 0
            },
            {
               "cast_id": 14,
               "character": "Bella",
               "gender": 1,
               "credit_id": "52fe45179251416c7504b76f",
               "name": "Kate Hardie",
               "profile_path": "/lOMaGLnb6gx7VMzS7fkc0d99B03.jpg",
               "id": 20771,
               "order": 1
            },
            {
               "cast_id": 16,
               "character": "Jani De Villiers",
               "gender": 1,
               "credit_id": "52fe45179251416c7504b777",
               "name": "Alex Kingston",
               "profile_path": "/ILVF4kVf7asMOQ9J7mq50TbyPL.jpg",
               "id": 83701,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Marion Nell",
               "gender": 1,
               "credit_id": "52fe45179251416c7504b741",
               "name": "Gina McKee",
               "profile_path": "/pyPapwCdP9rL7PGnD1MRjHZg4Nd.jpg",
               "id": 18022,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "Jack Snr.",
               "gender": 2,
               "credit_id": "52fe45179251416c7504b735",
               "name": "Nicholas Ball",
               "profile_path": "/m1kCKVrJlCPcFo3GjODV0UDnNP0.jpg",
               "id": 26707,
               "order": 4
            },
            {
               "cast_id": 4,
               "character": "David Reynolds",
               "gender": 2,
               "credit_id": "52fe45179251416c7504b739",
               "name": "Alexander Morton",
               "profile_path": "/pg03CMhM5rc2louUy8sVFyztuqh.jpg",
               "id": 32808,
               "order": 5
            },
            {
               "cast_id": 20,
               "character": "Matt",
               "gender": 0,
               "credit_id": "57477f1692514135cf000022",
               "name": "Paul Reynolds",
               "profile_path": "/pmrLq1URcd1yjOH6Fv298YLyw88.jpg",
               "id": 83553,
               "order": 6
            },
            {
               "cast_id": 2,
               "character": "Giles Cremorne",
               "gender": 2,
               "credit_id": "52fe45179251416c7504b731",
               "name": "Nick Reding",
               "profile_path": null,
               "id": 73946,
               "order": 7
            },
            {
               "cast_id": 5,
               "character": "Car Dealer",
               "gender": 2,
               "credit_id": "52fe45179251416c7504b73d",
               "name": "Barnaby Kay",
               "profile_path": "/BE4GACeTlhtkDkEnSucBoHJyMY.jpg",
               "id": 73947,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Girl with Joint",
               "gender": 1,
               "credit_id": "57af2a5d92514172f4002892",
               "name": "Rhona Mitra",
               "profile_path": "/5iaixWY0qTK9ouHA1wmlXi3t0ie.jpg",
               "id": 25702,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe45179251416c7504b747",
               "name": "Mike Hodges",
               "profile_path": "/35mcdpwimATfaeEGpLhR0iVJ2Ep.jpg",
               "id": 17281,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45179251416c7504b74d",
               "name": "Paul Mayersberg",
               "profile_path": null,
               "id": 14894,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe45179251416c7504b753",
               "name": "Jonathan Cavendish",
               "profile_path": null,
               "id": 9157,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45179251416c7504b759",
               "name": "James Mitchell",
               "profile_path": null,
               "id": 72469,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45179251416c7504b75f",
               "name": "Simon Fisher-Turner",
               "profile_path": null,
               "id": 32804,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45179251416c7504b765",
               "name": "Michael Garfath",
               "profile_path": null,
               "id": 32805,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe45179251416c7504b76b",
               "name": "Les Healey",
               "profile_path": null,
               "id": 21272,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "5609ce3fc3a368682400085d",
               "name": "Caroline Harris",
               "profile_path": null,
               "id": 119117,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "5609ce51c3a368680b00086a",
               "name": "Jon Bunker",
               "profile_path": null,
               "id": 13469,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 5.26516,
      "production_countries": [
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "IE",
            "name": "Ireland"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         }
      ],
      "id": 12706,
      "vote_count": 93,
      "budget": 0,
      "overview": "Jack Manfred is an aspiring writer who to make ends meet, takes a job as a croupier. Jack remains an observer, knowing that everything in life is a gamble and that gamblers are born to lose. Inevitably, he gets sucked into the world of the casino which takes its toll on his relationships and the novel he is writing.",
      "similar": [
         3134,
         8012,
         101,
         948,
         949,
         8810,
         4771,
         59967,
         261023,
         298312,
         2142,
         1266,
         521,
         10651,
         11564,
         8065,
         141,
         185,
         431,
         77
      ],
      "original_title": "Croupier",
      "runtime": 94,
      "poster_path": "/s8wDHdBDGiBuVeQDP9mdm9u3b9U.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Arte",
            "id": 201,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Channel Four Films",
            "id": 181,
            "origin_country": "GB"
         },
         {
            "logo_path": null,
            "name": "La Sept-Arte",
            "id": 11332,
            "origin_country": ""
         }
      ],
      "release_date": "1998-06-25",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "Life's a Gamble",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mike Hodges"],
      "runtime": 94,
      "synopsis": null,
      "writers": ["Paul Mayersberg"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0159382/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk3MzAyOTUxNl5BMl5BanBnXkFtZTcwMDYxNTEzMQ@@._V1_SY317_CR7,0,214,317_AL_.jpg",
      "actors": ["Stars: Clive Owen, Nick Reding, Nicholas Ball | See full cast and crew »"],
      "reviews": [
         "I was a croupier myself for the best part of 15 years and I expected to see the usual depiction of a casino. You know the scene - think of any Bond movie - the Roulette wheel spins so fast that you can't see the numbers, the dealers all have sticks and speak in French accents, the bets are all placed before the ball is spun and all straight up on the number. Not so this movie. Anyone that has ever been inside a real casino would recognise this place. The urgency of every punter trying to get the last bet on before the ball drops, the cheats, the sad, sad losers that wait forever to place their last chips. This is the most realistic depiction of a casino I have ever seen. Clive Owen is perfect. He has obviously had a lot of training - only one criticism of his technique - he looks in the wheel as the ball is dropping - a good dealer looks at the layout and watches for late bets, he should be the last person to know which number has come up - he must have eyes in the back of his head to spot a cheat the way he deals! For realism, you can't fault this film - every character, even the peripheral extras are real and believable - it's a tour de force of perfect character sketches - the plot is almost irrelevant - in fact, it is not quite up to the incredible atmosphere created - but it's good enough, the film is well worth your time. Hell, it's worth watching 2 or 3 times just to catch all of the great little cameos that you might have missed the first time 9 out of 10",
         "\"Croupier\" is a British neo-noir. It has a detached character (or even better, two characters) who progressively get involved in a shadowy world from an apparently safe beginning, it has voice-overs, lots of artistic and original swearing, a depressing atmosphere and if you don't feel like lighting a cigarette with a Zippo after the movie is over, you're dead. Clive Owen gives an amazing performance as the croupier of the title, who is very conscious of his split personalities: Jack, a gambler, the writer who works in the casino to pay the bills, and Jake, a croupier, a man who enjoys watching his customers losing all his money and who makes sure he's always dealing the cards. In the end, Jack loses and Jake wins. The message is delivered in the least subtle way possible, Hell, the voice-over is practically an intellectual analysis on the movie's meaning, but it works because Jack/Jake is an amazingly engaging character and because the movie is so well directed. The crime plot, although not surprising in the least, develops itself smoothly and contains lots of unexpected sources of humor. \"Croupier\" is a very stylish and criminally underrated neo-noir that beats the living crap out of most of recent Hollywood releases centering about a big robbery or con. It might be heavy-handed, but it's conscious of where its strenghts lie, and Wilson is great. Why it's so criminally underrated... I don't have the faintest about.",
         "This film-noir crime drama gets my vote for sleeper of the year. It is an expertly written story that is subtly directed and superbly acted. It makes up for the dozens of dreadful independent films one has to mine to find such a gem. Jack Manfred (Clive Owen) is a struggling writer, who on the advice of his father takes a job as a croupier at a local casino, a job he previously held when he lived in South Africa. He takes the job to make some extra money, but soon he realizes that it would be an excellent setting for a novel. He becomes an impassive observer of the gambling culture on both sides of the table, taking mental notes that are later incorporated into his book. However, as time goes on he is seduced from observer to participant, gradually breaking all his own rules and justifying his decadence by convincing himself that he has become the character in his book. His feeling of control is delusional as he is being manipulated by unseen forces that are beyond his comprehension. There is a wonderful multi-layered texture to the story. It examines the psychological aspects of the gambling casino from the inside out, allowing us to look at the trade from the casino's perspective. It also weaves in love, sex, deceit and betrayal along with robbery and murder. A few plot gaps leave the viewer with some unanswered questions, but they are minor. The ingenious weave of plot elements culminating in a clever ending more than makes up for the flaws. Director Mike Hodges did an outstanding job of creating realistic casino environment without a lush budget. Hodges got the feeling just right as well, portraying various types of gamblers from the high rollers to the addicts. The acting was superlative. Clive Owen emerges from the shadow of his television resume to deliver a complex and brilliant performance as the cunning but stolid croupier. If anyone with clout ever sees this film, his agent will certainly be getting some calls. Alex Kingston also does a fine job as the enigmatic Jani, who lures him into a nefarious scheme that sends his life spinning dangerously out of control. This intelligent film keeps the viewer engrossed throughout. I rated it a 9/10. It presents a fine alternative to mindless big budget films that are more form than substance.",
         "Mike Hodges' film 'Croupier' tells the stark story of Jack Manfred, a writer who sells his soul to work in a casino. As might be expected from the director of 'Get Carter', the acting is deadpan throughout, and the plot is likewise understated: the point is less what happens than the fact that Jack can deal with it. Yet this (short) film is oddly compelling: although we actually get only a brief insight into the workings of the casino, there's something very addictive about the way it is presented, the film has the smack of authenticity and one watches transfixed, as if one was being shown it all for real. Also effectively communicated is the mixture of alienation and exhilaration that comes to possess and drive an increasingly dehumanised Jack. 'Croupier' is not the best film ever made, but it never oversells itself and holds one's attention throughout. A highly effective and distinctive thriller.",
         "A dense but rewarding film. It has a terrific performance from Owen, poised (in 1998) to become the international A-lister that he now is. He has to play three roles - two in shot, Jack and the emergent Jake, protagonist of the book Jack's writing - and a third, disembodied Jack in voice-over. The film follows his struggle with fatalism (or chance) and grand design. Whether as a writer, a croupier or an observer he likes to be in control, risk free. Making sure this isn't quite how it works is a pretty solid list of fine support actors. Alex Kingston turns up with an impressively rendered South African accent and more sex appeal than the distilled accumulation of all her work on ER. Potent stuff. Gina McKee plays a conventional love interest without simply being wallpaper; David Hamilton runs the Casino with an ambiguity that mirrors Jack's. Mike Hodges engineers tight, claustrophobic shots and choppy editing. Everything about the film is up close and suffocating: shots in cars; Jack's tiny flat; stairwells and copulating couples in toilet cubicles. Owen's Jack is neither repelled by nor engages with this proximity. It only affects him if it foists itself upon him violently or he chooses to deal with it. Whether or not he actually has a choice is the point of this entertaining film. 7/10",
         "Come on deal with it! Independent films have a way of creating complex story lines that keep a viewer intrigued, and they also include some obscure characters that we tend to admire. You could surely bet that `The Croupier' falls in that winning category. I will throw the deck of this one at you- a struggling writer who gets a job as a croupier to entice his stalled imaginative mind. On the second hand- it also includes a mysterious subplot involving a possessive girlfriend, a sexy socialite card player, a distraught female croupier, and a watchful father. Clive Owen as the `jack of all trades' croupier executes an ace performance. For sure, one of the best acting performances of the year- Really! I am not being a joker! His suave style is reminiscent of James Bond. Yes that Bond, James Bond! In fact, I will double down my bet and predict that Owen will be the next 007. Also, open up those snake eyes and ears and you will see and hear- an artistic screenplay, an intensive musical score, and exquisite cinematography. `The Croupier' does deserve a winning hand! ***** Excellent",
         "In the \"Croupier\", Mike Hodges takes us in a thrilling journey in the underworld of gambling. We are introduced to Jack (Owen), an average guy who tries (unsuccessfully) to make a living as a writer. He lives a with his girlfriend Marion (McKee), an ex-cop who is deeply in love with him (while he is quite more reserved in his feelings). However, after his father arranges for him a job offer as a croupier in a casino, his life gets completely transformed: His new world and the creatures that live in it begin to devour him, and his character gets gradually reshaped. He is faced with corruption, lust, and ultimately, crime, and Marion does not seem to have the ability to bring him back. Mike Hodges gives us an excellent account of Jack's world, with the characters being vividly and convincingly portrayed. A small plot twist in the end adds up to the overall excitement. Clive Owen is simply superb as the icy croupier, who although he tries to be detached, he simply cannot (and probably does not want to) escape from his downhill path. We also enjoy very good performances by all the other actors involved. 8/10.",
         "CROUPIER (2000) *** Clive Owen, Gina McKee, Alex Kingston, Kate Hardie, Nicholas Ball. British director Mike Hodges returns with his trademark hands-on film noir twisting with Owen \u0096 part Connery/part Gibson \u0096 as a contemptuous struggling novelist who takes a job as a casino croupier with much disdain for its clientele and the razor's edge trundling of enjoying the afterhours lifestyle while struggling to maintain his identity from his story's semi-autobiographical character. Smartly written by Paul Mayersberg with its pulp fiction heart and soul on display works well until its unfortunately false ending. Owen gives a silky smooth enhancing performance of a man at odds with his life and makes it all look effortless.",
         "Jack Manfield is a writer but an unpublished one thus far. With money running out he follows a connection from his father that earns him a job interview in a London casino. After a short time he finds he has rediscovered the croupier bug and is back in love with his new job. He also finds that his experiences useful in creating a new book, lead the lead character, Jake, as a croupier. As he drifts apart from his girlfriend he loses himself in the world and starts breaking the rules \u0096 ultimately getting involved with a patron, Jani, who asks him for help in organising a heist at the casino. Quite often it'll be the UK, European or underground markets that expose an American film as a good film after the US market has ignored it, but with Croupier it worked the other way round. Hardly making any impact at all upon release in the UK, it was apparently good reviews and good figures from the US that helped make it better known. As such I came to it with mixed expectations \u0096 I sort of half knew what to expect from it but I had also been led to believe that it would impress me a great deal. In some regards I enjoyed the film; it is intelligent, dark, thoughtful and has a reasonably enjoyable plot \u0096 even if the plot does have equal billing with the atmosphere. However don't expect a great plot that piles twist on twist, because this isn't what the film is about. Rather the film relies very heavily on the observations of the croupier himself (both as Jack and Jake) to drive the film forward. I can't think of another film that I've seen that uses voice-over to such a degree (and makes it work), usually heavy voice-over use implies that the script and characters were not strong enough to hold the film up by themselves. The clever twisting of Jack/Jake is subtle but done to good effect and was a big part of the reason that this film engaged me. Outside of this I found the plot to be rather hard work \u0096 there is no one real thrust to the film with only the main one involving Jani really coming out to the front in order to deliver an ending in the traditional manner. This is a weakness and it stops the film being as satisfying as it could have been, with Jack not being provided with enough of a plot to be set in. That said it still works due to his character and some great direction from Hodges who avoids being overly flashy as the gambling world setting often encourages directors to be. Owen is very good and convinces in his many scenes \u0096 he is the heart of the film and it is to his credit that he manages to do it. Even in voice-over he delivers good character and direction for the film. Kingston is not as good. Aside from doing her whole nudity thing yet again she also is lumbered with an accent that doesn't suit her and one that she doesn't sound comfortable with (even if it isn't that bad). McKee is OK, as are Ball, Morton and Parnell albeit in smaller roles. But in a film that is more about the croupier than anything else, the film is Owen's and he rises to it and does well with the lead role. Overall this is an OK film and one that deserves better than it received upon first release in the UK. However plot-wise it is not as satisfying as I would have liked it to be, instead it relies heavily on the character of Jack \u0096 an aspect that is both the film's making and it's weakness (in that the film doesn't give him a good enough plot to be developed against).",
         "I liked some things in this movie. One was that it was narrated in the 3rd person by the star (usually it's someone else who narrates in the third person), another is that I saw a world I didn't know about before. Sure, I know about casinos and bosses and workers, but I didn't know how it worked in Britain. In fact, I saw this as a British version of Casino (except without the mob and violence, though there is some violence). Also, Clive Owen makes a great lead as Jack, who goes through changes in his careers as a writer and a croupier. Possibly the best film to come from Britain this year (so far)."
      ],
      "genres": [
         "Crime",
         "Drama"
      ],
      "productionCompanies": [
         "Arte",
         "Channel Four Films",
         "La Sept-Arte"
      ],
      "summaries": [
         "Jack Manfred is an aspiring writer going nowhere fast. To make ends meet, and against his better judgement, he takes a job as a croupier. He finds himself drawn into the casino world and the job gradually takes over his life; his relationship with girlfriend Marion begins to deteriorate. One gambler in particular catches his attention: Jani, whom he starts to see outside of working hours - a serious violation of casino rules. Jani is down on her luck; under pressure from her creditors she approaches Jack, asking him to be the inside man for a planned heist at the casino. Jack carefully considers the odds; it all looks so simple, but even a professional like Jack can't predict the cards he will be dealt.",
         "A struggling author uses his father's connections to get a job running a roulette wheel at a casino. Soon he meets a woman who seduces him and then encourages him to join her associates in a robbery scheme. He joins, however, he uses his experiences for the plot of his book, \"I, Croupier\".",
         "Jack Manfred is a struggling novelist in London. To make ends meet, he sells his beloved car and, through connections through his South African father, gets a job as a croupier at the Golden Lion Casino, a second tier casino in London. Jack had previous training as such back in South Africa. He doesn't particularly like being a croupier, but he's good at it and finds a certain pleasure in watching gamblers, for who he has disdain, lose. His girlfriend, Marion, an ex-police officer, doesn't like his new job either despite the money it is bringing into the household. The casino has a strict set of employee policies, including no gambling ever, no relationships with other casino employees and no fraternizing at all with the gamblers - also known as the punters - outside of the casino. Although Jack cannot tolerate cheaters, he is not averse to bending these employee rules when it suits his fancy. As time goes on, he begins to observe casino life with a certain distance, through the eyes of \"Jake\", the main character in his novel and his alter ego. Jack allows Jake to do things he would never do himself just to see how the story plays out.",
         "An aspiring writer is hired as a croupier at a casino, where he realizes that his life as a croupier would make a great novel."
      ],
      "budget": 0
   },
   "movielensId": 3783,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-06-25",
      "dvdReleaseDate": "2004-03-09",
      "directors": ["Mike Hodges"],
      "runtime": 94,
      "movieId": 3783,
      "title": "Croupier",
      "mpaa": "NR",
      "actors": [
         "Clive Owen",
         "Kate Hardie",
         "Alex Kingston",
         "Gina McKee",
         "Nicholas Ball",
         "Alexander Morton",
         "Paul Reynolds",
         "Nick Reding",
         "Barnaby Kay",
         "Rhona Mitra"
      ],
      "imdbMovieId": "0159382",
      "originalTitle": "Croupier",
      "genres": [
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["P3LFLxIySX8"],
      "plotSummary": "Jack Manfred is an aspiring writer who to make ends meet, takes a job as a croupier. Jack remains an observer, knowing that everything in life is a gamble and that gamblers are born to lose. Inevitably, he gets sucked into the world of the casino which takes its toll on his relationships and the novel he is writing.",
      "tmdbMovieId": 12706,
      "avgRating": 3.80172,
      "releaseYear": "1998",
      "numRatings": 2214,
      "posterPath": "/s8wDHdBDGiBuVeQDP9mdm9u3b9U.jpg"
   }
}