{
   "tmdb": {
      "original_language": "zh",
      "keywords": [
         {
            "name": "mentally disabled",
            "id": 791
         },
         {
            "name": "tradition",
            "id": 941
         },
         {
            "name": "wife husband relationship",
            "id": 1157
         },
         {
            "name": "shower",
            "id": 1879
         },
         {
            "name": "modernity",
            "id": 2384
         },
         {
            "name": "modern society",
            "id": 3131
         },
         {
            "name": "wife",
            "id": 4183
         },
         {
            "name": "business man",
            "id": 4480
         },
         {
            "name": "bath house",
            "id": 4652
         },
         {
            "name": "marriage crisis",
            "id": 5809
         },
         {
            "name": "beijing",
            "id": 33683
         },
         {
            "name": "opera singer",
            "id": 164920
         }
      ],
      "imdb_id": "tt0215369",
      "video": false,
      "title": "Shower",
      "recommendations": [
         115867,
         106378,
         95503,
         138644,
         47102,
         47113,
         95508,
         53267,
         20525,
         192721,
         42139,
         108634,
         258023,
         115715,
         136986,
         71767,
         98964,
         130639,
         33341,
         54659
      ],
      "backdrop_path": "/ra6IUu6SoNOyQEkxG1tBlvt6Cjg.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 13,
               "character": "Meister Liu",
               "gender": 0,
               "credit_id": "52fe42e5c3a36847f802b31d",
               "name": "Zhu Xu",
               "profile_path": "/3SEkP8JS0icTxzy6JxRFflzOZUV.jpg",
               "id": 15168,
               "order": 0
            },
            {
               "cast_id": 14,
               "character": "Da Ming",
               "gender": 0,
               "credit_id": "52fe42e5c3a36847f802b321",
               "name": "Quanxin Pu",
               "profile_path": null,
               "id": 15169,
               "order": 1
            },
            {
               "cast_id": 15,
               "character": "Er Ming",
               "gender": 2,
               "credit_id": "52fe42e6c3a36847f802b325",
               "name": "Jiang Wu",
               "profile_path": "/ndQCjuXjwlJxq7PF7TNYYlGAXJX.jpg",
               "id": 15170,
               "order": 2
            },
            {
               "cast_id": 16,
               "character": "He Bing",
               "gender": 0,
               "credit_id": "52fe42e6c3a36847f802b329",
               "name": "He Zeng",
               "profile_path": null,
               "id": 15171,
               "order": 3
            },
            {
               "cast_id": 17,
               "character": "Hu Bei Bei",
               "gender": 0,
               "credit_id": "52fe42e6c3a36847f802b32d",
               "name": "Zhang Jin Hao",
               "profile_path": null,
               "id": 15172,
               "order": 4
            },
            {
               "cast_id": 18,
               "character": "Li Ding",
               "gender": 0,
               "credit_id": "52fe42e6c3a36847f802b331",
               "name": "Lao Lin",
               "profile_path": null,
               "id": 15173,
               "order": 5
            },
            {
               "cast_id": 19,
               "character": "Feng Shun",
               "gender": 0,
               "credit_id": "52fe42e6c3a36847f802b335",
               "name": "Lao Wu",
               "profile_path": null,
               "id": 15174,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe42e5c3a36847f802b2d7",
               "name": "Zhang Yang",
               "profile_path": "/keAHnRO4H89MHKPjGJI3LzJjzsR.jpg",
               "id": 15156,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe42e5c3a36847f802b2dd",
               "name": "Sam Duann",
               "profile_path": null,
               "id": 15157,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe42e5c3a36847f802b2e3",
               "name": "Peter Loehr",
               "profile_path": null,
               "id": 15158,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe42e5c3a36847f802b2e9",
               "name": "Fendou Liu",
               "profile_path": null,
               "id": 15159,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe42e5c3a36847f802b2ef",
               "name": "Lola Huo Xin",
               "profile_path": null,
               "id": 15160,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe42e5c3a36847f802b2f5",
               "name": "Cai Shangjun",
               "profile_path": "/pjzI9SnimZMUiSKD3OJC9pljri3.jpg",
               "id": 15162,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe42e5c3a36847f802b2fb",
               "name": "Xiaogang Ye",
               "profile_path": null,
               "id": 15163,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe42e5c3a36847f802b307",
               "name": "Meng Tian",
               "profile_path": null,
               "id": 15165,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "52fe42e5c3a36847f802b30d",
               "name": "Zhang Yang",
               "profile_path": "/keAHnRO4H89MHKPjGJI3LzJjzsR.jpg",
               "id": 15156,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe42e5c3a36847f802b319",
               "name": "Qizhen Lai",
               "profile_path": null,
               "id": 15167,
               "department": "Sound",
               "job": "Sound Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe42e6c3a36847f802b33b",
               "name": "Diao Yinan",
               "profile_path": "/tyr16CUOJTa1oq3vbgFnEHKZS7V.jpg",
               "id": 123552,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "53110e62925141104d00161f",
               "name": "Zhang Jian",
               "profile_path": null,
               "id": 15164,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "5892aae092514122d5002888",
               "name": "Hongyu Yang",
               "profile_path": null,
               "id": 74035,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 2.337196,
      "production_countries": [{
         "iso_3166_1": "CN",
         "name": "China"
      }],
      "id": 1050,
      "vote_count": 21,
      "budget": 0,
      "overview": "An aged father and his younger, mentally challenged son have been working hard every day to keep the bathhouse running for a motley group of regular customers. When his elder son, who left years ago to seek his fortune in the southern city of Shenzhen, abruptly returns one day, it once again puts under stress the long-broken father-son ties. Presented as a light-hearted comedy, Shower explores the value of family, friendship, and tradition.",
      "similar": [
         210577,
         1247,
         843,
         247,
         884,
         688,
         10998,
         10675,
         1049,
         8999,
         1088,
         11467,
         37265,
         7510,
         10540,
         10557,
         14073,
         552,
         3037,
         53357
      ],
      "original_title": "洗澡",
      "runtime": 92,
      "poster_path": "/9a9csHTZRIMMnqx2z0H2kNvf6wa.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "普通话",
            "iso_639_1": "zh"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Imar Film Co., Ltd.",
         "id": 645,
         "origin_country": ""
      }],
      "release_date": "1999-09-13",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "China",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Yang Zhang"],
      "runtime": 92,
      "synopsis": null,
      "writers": [
         "Shangjun Cai",
         "Yi'nan Diao"
      ],
      "originalLanguage": "Mandarin",
      "imdbLink": "http://www.imdb.com/title/tt0215369/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ2NzQ2Njg0NF5BMl5BanBnXkFtZTYwNTIwNTU5._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Jiayi Du, Bing He, Wu Jiang | See full cast and crew »"],
      "reviews": [
         "On the basis of the preview I'd seen, I went to \"Shower\" expecting a sweet little comedy; what I found was a profoundly touching drama of family life told in some of the most lush photographic images I've ever been privileged to see. In addition, later reflection made me appreciate the abrupt cuts to scenes from the past (in the arid countryside of Northern China, and in the high plain of Tibet): isn't this how memory often works? One moment I'm here, the next I'm in a landscape from the past, just like that.... I would not only strongly recommend this film, I would place it among the two or three finest films I've seen in my 60 years. By the way, a couple of years ago another Asian \"comedy\" was released in the United States as \"Shall We Dance?\" (Japanese). Just as with \"Shower,\" the preview gave not the slightest indication of the depth of that film, which turned out to be a subtle psychological study (albeit chock full of funny moments). Is there a fear, on the part of distributors, of making films appear too \"important\" or \"deep\" to appeal to U. S. viewers?",
         "\"Shower\" is an story about loyalty, about the unstoppable advance of modern world in the detriment of rather traditional and more human ways of life. A man forced to choose between his successful career in business, his big-city life, his wife, and his retarded young brother. The eternal doubt between what we WANT to do and what we SHOULD do. The modern China versus the ancient one. The public baths with its gatherings, its cricket fights versus the shopping centres and the skyscraper. Lots of old men and women that are no longer needed. China, one country, two systems, as Xiao Ping said ... though one of them is killing the other. Tender, moving, full of funny moments, and of bitter-sweet ones.The sensitive ones will cry and laugh equally. The actors are enormous, especially the one who performs the role of the retarded boy; and Yang Zhang makes a good job, easy, simple, letting the story just flow by itself. My rate: 8/10",
         "I just returned from seeing \"Xizhao\" and am still under its soulful spell. How rare to see a film of this calibre, unafraid of tenderness and caring, but at the same time not maudlin or overtly heavy-handed...and particularly rare when this feeling is among men...in this case, a father and his two grown sons, one retarded, the other estranged and ambitious. How these relationships, and others, unfold, how one son's willing sacrifice brings deep humanity into the limited life of the other is a joy to behold. In among all these machinations there is delightful humor in and around the bathhouse setting. I recommend this film unreservedly.",
         "This film is moving without being sentimental - meaningful without being pretentious. It tells a simple story of a family in danger of falling apart as the encroachments of technology and an advancing society make the family-run business increasingly untenable. The acting is wonderful - though none of us in the west are likely to have heard of these actors, we should have long ago - they play their characters with honesty and reverence - these are flawed characters, each with major weaknesses, but with such utter humanity and kindness that it's impossible not to become engaged in the story. We need more films like this - we need more western filmmakers creating films such as this.",
         "This beautiful story of an elder son coming home, and learning to love and be a part of all those things that he left home to get away from, is poignant and moving. It shows a society that is perhaps strange to us in the Western world, with a sense of family that we have lost. The story is beautiful, sad, and at times funny and comic. It has a feeling of realism that we don't seem to see any longer in our western movies. The acting is unusual, in that as the movie progresses, it almost gives the impression that it is not acting, but a documentary of ordinary people. This is brilliant directing and movie making. Would love to see more movies by this director.",
         "What a refreshing film. Da Ming, the eldest brother returns to his fathers bath-house business because he thinks his father is ill. When he finds out the contrary, he wants to go back to the big city, but soon realizes that his family is more important than making money. Millions of people are flocking to see \"Hannibal\" disembowel and eat people. How nice to see a film about people who love each other and are NICE to each other. A funny, touching, heartbreaking, wonderful movie that will make you feel better about the human race, rather than want to retch.",
         "How powerful and captivating simple quality filmmaking can be. This film tells it's tale with everyday scenes that manage to revel the poignancy hidden within. It's true as others have stated, how this film really makes it glaringly obvious how lost Hollywood is in it's special effects, overblown emotionalism and over the top climatic endings and have forgotten the essence of a meaningful story told with simple realism. So much of what these characters are going through is implied by the scene rather than spelled out in wordy dialogue. One aspect that I really enjoyed about the film was the contrast of the two brothers, one so very openly expressive in his childlike way and the other completely stoic but both able to evoke deep emotion. The older brother needed to say little, as he usually did, it was all there in that deadpan face of his! Beautiful cinematography, wonderful acting, great direction! Not to be missed!",
         "Shower keeps within itself in so many ways. Almost all of the movie takes place in an old- time bathhouse, with the denizens supplying the humor, pathos, and emotional touches. The love and friendship between the proprietor and his retarded son is deep and moving. The way the older brother is drawn into this tiny world seems unforced and persuasive. The plot is meandering, full of surprises and ironies, and touched overall by a sense of what I'd have to call neighborliness in the relations and conflicts of the performers. This is a film I pull out when I want to believe in the world again.",
         "This was a very enjoyable film. A humorous, but poignant look at family, and the obligations that come with it. The story of a man who comes home from his life in the city to his fathers bath house in a small Chinese village. There he learns to appreciate, even cherish the very things he left home to get away from. The film is as visually beautiful as it is emotionally beautiful.",
         "I LOVE this movie! Beautifully funny and utterly believable characters. Each scene richer and more wonderful than the last. Every aspect of this movie is filled with wit and humour and love and depth. A complex and engrossing story, too. This movie is filled with love, humour, and intelligence. Totally great!"
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Imar Film",
         "Xi'an Film Studio"
      ],
      "summaries": ["Shenzhen businessman, Da Ming, goes home to Beijing when he thinks his father has died. He finds his father hard at work at the family's bathhouse (the false message was a ruse of Da's mentally-handicapped, exuberant brother, Er Ming, to get Da home). Da stays a couple days, observing his father being social director, marriage counselor, and dispute mediator for his customers and a boon companion to Er. Da is caught between worlds: the decaying district of his childhood and the booming south where he now lives with a wife who's not met his family. When Da realizes his father's health is failing and the district is slated for razing, he must take stock of family and future."],
      "budget": 0
   },
   "movielensId": 3787,
   "movielens": {
      "languages": [
         "English",
         "普通话",
         "Español"
      ],
      "releaseDate": "1999-09-13",
      "dvdReleaseDate": "2000-12-12",
      "directors": ["Zhang Yang"],
      "runtime": 92,
      "movieId": 3787,
      "title": "Shower",
      "mpaa": "PG-13",
      "actors": [
         "Zhu Xu",
         "Quanxin Pu",
         "Jiang Wu",
         "He Zeng",
         "Zhang Jin Hao",
         "Lao Lin",
         "Lao Wu"
      ],
      "imdbMovieId": "0215369",
      "originalTitle": "Xizao",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "An aged father and his younger, mentally challenged son have been working hard every day to keep the bathhouse running for a motley group of regular customers. When his elder son, who left years ago to seek his fortune in the southern city of Shenzhen, abruptly returns one day, it once again puts under stress the long-broken father-son ties. Presented as a light-hearted comedy, Shower explores the value of family, friendship, and tradition.",
      "tmdbMovieId": 1050,
      "avgRating": 3.81402,
      "releaseYear": "1999",
      "numRatings": 535,
      "posterPath": "/9a9csHTZRIMMnqx2z0H2kNvf6wa.jpg"
   }
}