{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "independent film",
         "id": 10183
      }],
      "imdb_id": "tt0212974",
      "video": false,
      "title": "Groove",
      "recommendations": [15256],
      "backdrop_path": "/93eex2q4Ttg9IzGw8jQ4MeMoRJk.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 12,
               "character": "David Turner",
               "gender": 2,
               "credit_id": "57f4731ac3a3680559000f78",
               "name": "Hamish Linklater",
               "profile_path": "/l6nAyT4ZqNq7fOAfB0I9Qi4xpzH.jpg",
               "id": 184581,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Colin Turner",
               "gender": 0,
               "credit_id": "533451a09251414460002020",
               "name": "Denny Kirkwood",
               "profile_path": null,
               "id": 1224812,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Harmony Stitts",
               "gender": 1,
               "credit_id": "533451579251414460002018",
               "name": "Mackenzie Firgens",
               "profile_path": "/h8ZLtYCUYF92OzSjdR9caa3Jqfx.jpg",
               "id": 63155,
               "order": 2
            },
            {
               "cast_id": 14,
               "character": "Leyla Heydel",
               "gender": 1,
               "credit_id": "57f4733e9251411c6f000e9f",
               "name": "Lola Glaudini",
               "profile_path": "/xgp8VtX9rhsRot3fshmomStvg6b.jpg",
               "id": 34845,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Ernie Townsend",
               "gender": 2,
               "credit_id": "52fe4472c3a368484e023859",
               "name": "Steve Van Wormer",
               "profile_path": null,
               "id": 108438,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Beth Anderson",
               "gender": 1,
               "credit_id": "533451b29251414460002022",
               "name": "Rachel True",
               "profile_path": "/cVN934tgQcX5ZMHNBFLZpw2fNCH.jpg",
               "id": 19222,
               "order": 5
            },
            {
               "cast_id": 22,
               "character": "Anthony",
               "gender": 0,
               "credit_id": "57f473d5c3a3680549000e16",
               "name": "Vincent Riverside",
               "profile_path": null,
               "id": 1438692,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Guy Pritchkin",
               "gender": 0,
               "credit_id": "57f4736bc3a368055d000df9",
               "name": "Dmitri Ponce",
               "profile_path": null,
               "id": 1689294,
               "order": 7
            },
            {
               "cast_id": 7,
               "character": "Cliff Rafferty",
               "gender": 2,
               "credit_id": "533451739251414463001f8d",
               "name": "Ari Gold",
               "profile_path": "/xqkp6Bgc09PQJFhAAOLStYRKXUP.jpg",
               "id": 105581,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Joe Torres",
               "gender": 0,
               "credit_id": "57f4737dc3a3680559000f9d",
               "name": "Aaron Langridge",
               "profile_path": null,
               "id": 1689295,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Lisa Monroe",
               "gender": 0,
               "credit_id": "57f473879251411c81000fcb",
               "name": "Wendy Turner-Low",
               "profile_path": null,
               "id": 1689296,
               "order": 10
            },
            {
               "cast_id": 8,
               "character": "Aaron Lubiarz",
               "gender": 0,
               "credit_id": "53345195925141445d00208f",
               "name": "Bradley K. Ross",
               "profile_path": null,
               "id": 562679,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Todd",
               "gender": 2,
               "credit_id": "57f47326c3a368055d000dd9",
               "name": "Angelo Spizzirri",
               "profile_path": "/vQJvzOfciBSB9mJIF6N5khdew93.jpg",
               "id": 77119,
               "order": 12
            },
            {
               "cast_id": 2,
               "character": "Bill",
               "gender": 0,
               "credit_id": "52fe4472c3a368484e023851",
               "name": "Chris Ferreira",
               "profile_path": "/6goVk4jkG5PVyFGVoGtW7uo3WYi.jpg",
               "id": 108437,
               "order": 13
            },
            {
               "cast_id": 10,
               "character": "Neil",
               "gender": 2,
               "credit_id": "533451a9925141445a001fd2",
               "name": "Jeff Witzke",
               "profile_path": "/nvnFz8I3kTKahMGkNOpY2GxXqgv.jpg",
               "id": 144438,
               "order": 14
            },
            {
               "cast_id": 15,
               "character": "Monique",
               "gender": 0,
               "credit_id": "57f4734ec3a3680540000ea7",
               "name": "Jill Jose",
               "profile_path": null,
               "id": 1689293,
               "order": 15
            },
            {
               "cast_id": 19,
               "character": "Geo",
               "gender": 0,
               "credit_id": "57f473ac9251411c71000fb1",
               "name": "Chris Stone",
               "profile_path": null,
               "id": 1689297,
               "order": 16
            },
            {
               "cast_id": 20,
               "character": "Tobin",
               "gender": 0,
               "credit_id": "57f473b79251411c71000fbe",
               "name": "Lew Baldwin",
               "profile_path": null,
               "id": 17047,
               "order": 17
            },
            {
               "cast_id": 21,
               "character": "DJ Snaz",
               "gender": 0,
               "credit_id": "57f473c89251411c75000f9b",
               "name": "Bing Ching",
               "profile_path": null,
               "id": 1689298,
               "order": 18
            },
            {
               "cast_id": 23,
               "character": "Shep",
               "gender": 0,
               "credit_id": "57f473de9251411c7e000ffa",
               "name": "Karl Ackerman",
               "profile_path": null,
               "id": 1689299,
               "order": 19
            },
            {
               "cast_id": 24,
               "character": "Arty",
               "gender": 0,
               "credit_id": "57f473f0c3a3680549000e27",
               "name": "Christoph Klotz",
               "profile_path": null,
               "id": 1689300,
               "order": 20
            },
            {
               "cast_id": 3,
               "character": "Maggie McMullen",
               "gender": 1,
               "credit_id": "52fe4472c3a368484e023855",
               "name": "Elizabeth Sung",
               "profile_path": "/tXKGsjICPdgeQHp2MUzV2FQmvyw.jpg",
               "id": 19861,
               "order": 21
            },
            {
               "cast_id": 25,
               "character": "Sergeant Channahon",
               "gender": 2,
               "credit_id": "57f473ff9251411c71000fde",
               "name": "Nick Offerman",
               "profile_path": "/mycTNCHzvPY6Alpuw1jzeIjpEX3.jpg",
               "id": 17039,
               "order": 22
            },
            {
               "cast_id": 26,
               "character": "Map Point Betty",
               "gender": 1,
               "credit_id": "57f4741dc3a368053d000f76",
               "name": "Danielle Renfrew",
               "profile_path": "/82kw3t8LECxbZYjDMBABHt9hc9x.jpg",
               "id": 17045,
               "order": 23
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4472c3a368484e02384d",
               "name": "Greg Harrison",
               "profile_path": null,
               "id": 17042,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "533451439251414463001f8a",
               "name": "Greg Harrison",
               "profile_path": null,
               "id": 17042,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.637014,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 23655,
      "vote_count": 8,
      "budget": 0,
      "overview": "An inside look into one night in the San Francisco underground rave scene.",
      "similar": [
         3134,
         11564,
         281,
         133805,
         2142,
         22323,
         294963,
         8810,
         948,
         298312,
         14433,
         4771,
         12162,
         769,
         185,
         949,
         205,
         8923,
         241,
         793
      ],
      "original_title": "Groove",
      "runtime": 86,
      "poster_path": "/vtOkzpBtutlhGsfqR1WitDGkG8R.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2000-06-08",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "Are you feeling it?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Greg Harrison"],
      "runtime": 86,
      "synopsis": null,
      "writers": ["Greg Harrison"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0212974/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTczOTE4OTQ4OV5BMl5BanBnXkFtZTcwNTMzNDAyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Chris Ferreira, Mackenzie Firgens, Elizabeth Sun | See full cast and crew »"],
      "reviews": [
         "I watched this movie because of a trailer I watched on HBO. Never heard of it before, but it seemed interesting. Point is, I loved it to the point of even recording it and recommending it to my friends. I was in the rave scene during the mid 90's, when the likes of Scooter, Faithless, Robert Miles, Mark 'Oh and many others were at their peak. I truly enjoyed this movie and felt I was there the whole night. This movie is definitely not meant for anyone, much less for those who still don't understand what indie films are about. This was certainly not Arakki or Aranofsky, but I have to commend director Greg Harrison for this piece of work. This movie starts with the sound of a modem connecting to the internet... sooooo 1998! It was funny. Then you see all these fast stories about weirdos and their lives. The plot was definitely secondary in this movie. I could not care less about Leyla, or Colin, or whoever... But I guess that wasn't exactly the point. Although the party was somewhat different from what I used to go to, its structure was basically the same: Clandestine party, where you need maps and bribe a few guys to know exactly where you're going; the different levels of music throughout the night, from slow-beat clubhouse to orgasmic trance; the amount of drugs, the doped people, the escape from it all. There were pointless scenes, like those gay guys trying to get to the party (there was already a gay moment between Colin and that masseuse guy.. poor Harmony!). I recognized Rachel True, the gorgeous girl from \"The Craft\", I had no idea she was on this. I agree with the one who commented that John Digweed would never play in a party like this.. Actually I laughed when he made his cameo... So what was next? Tiesto? Johan Gielen? Paul Oakenfold? This movie was also a reflect of how these parties were about 5-10 years ago. Yes, the electronic scene has become much more commercial, specially in Holland and Belgium. I guess that it's not so special to me anymore, now that virtually everyone has discovered it. And yes, once the party got busted, there's no way they would have gotten away with starting it again! When the party is over, the movie is over, leaving the viewer with the SAME FEELING most ravers had when leaving... \"Now what?\" After an amazing night of \"everything\", you have to realize that it's all over and life must goes on... at least for most of us.",
         "Groove has often been compared with Human Traffic, but both are actually quite different. While Human Traffic was about a group of people who go to clubs and take drugs, Groove is about an actual rave. Director Greg Harrison is less interested about depicting the lives of the people who go to a rave than trying to cinematic ally get his audience to experience what a rave is like. On that level, Groove is a triumph. For those who used to rave, this film is the best flashback you'll ever get, the best way to relive the experience. For those who currently rave, it will make you want to go out and find a party NOW. For those who have never raved, the film brilliantly shows the sight and sounds of a rave while trying to be like a rave itself through careful pacing and use of music. The characters are thinly sketched in the early scenes but that's all we need, it's what they are and do at the rave that matters ,with the exception of the squabbling gay couple who may not make it to the party at all and are hilarious. The growing attraction between experienced 'partied out' girl and dorky novice is touching, and all the characters in the film have at least one stand out moment. Performances are generally strong, and some of the use of sound is superb, such as when the main protagonist is 'coming up'. The film has been criticized for being pro drugs, but it just shows the drug {especially E}experience in it's various forms. Some characters abstain, some overdo it and pay the price {though like Human Traffic there are refreshingly no deaths or serious fatalities}, most just enjoy themselves. The film is not saying drugs are good for you, it's just saying that drugs are something many people do, and maybe not because that are addicted, but because to them it's fun! The music is excellent, varied and well chosen. The appearance by a certain superstar DJ at this small rave of around 200 people has been rightly called unrealistic, and lets just say that acting is not his strong point! However comments that parties never start up again after they are shut down {as in this film}are untrue, I experienced it! In any case, it climaxes the film on a true 'high'. The many shots of people dancing may bore some, and there will be many for whom this film will have no interest at all. But ignore some of the hardcore purists, this is as close to a depiction, and more importantly the experience, of a rave as cinema can probably get.",
         "This film was verrrry well done. To those that say it wasn't...I guess you have never owned a club where raves took place. I did. I bought this movie in a stack of films and it only cost me 99 cents. Well shock the pants off me. What I thought would be a lame party and just a bunch of stoners walking around talking trash was certainly an enlightenment. GROOVE is EXACTLY what a rave is about...and how would I know? I know because I hosted them myself...packed to the hilt in Vancouver B.C. at PLANET X...and you could guess what the X stood for. Anywayz, this is very well done in terms of casting, lighting performance, music, tone and everything. The scene that struck me most is when Ernie says this...and this is classic to me. Guy: Why do you do this to yourself? Don't even get paid, risk getting arrested, for what? Ernie: You don't know? Guy: No. Ernie: The Nod. Guy: The Nod? Ernie: Happens to me at least once every party. Some guy comes up to me and says \"Thank you for making this happen... I needed this. This really meant something to me.\" And they nod... and I nod back. Guy: ... That's it? Ernie: That's it. That little piece of dialogue is everything...it's what made me want to run the rave at PLANET X, even thought I was't making big bucks...to me it was the NOD... So I know exactly where Ernie was coming from...and I felt the director Greg Harrison was getting to. Watch Groove and relive your youth before it slips away from you in your daily 9-5 and rush hour traffic. I only wish I was at the club...because it was so intense and so real...and made me so jealous that I was only watching it on my TV screen. With a $500000 budget, this is tops. Once again, everybody...extras and all cast included...an awesome job and one very satisfied viewer...certainly worth my time.",
         "This movie was entirely too much fun. In many ways, it reminded me of \"Dazed & Confused,\" or \"Go,\" but it was done so much better, both in characters, character development, and the best ending of all three films. The movie is about a Rave, pure and simple, in modern day San Francisco. The characters are real, the acting is really surprisingly good, and the cultural statements are just beautiful. I do believe this marks the first film appearance of Red Bull energy drink. The movie itself is like a rave. Loud, by in a flash, and you find yourself wishing you could just say good-night to all the characters one more time before the evening is over. But then it is, and you're left with just a really good vibe. This movie was just a really good vibe. See it with a bunch of friends, and get your groove on.",
         "Just seen 'Groove' for the first time on pay-per-view, after forgetting that it was even made... just remembered about it after seeing it in the cable guide tonight. Holy crap - they certainly did their homework. I have been in almost every one of the situations in the film at least once over the past 9 years (i've been doing this way too long). Trying to find parties @ 4am, inviting everyone in a club back to my folks house for breakfast, overdoing it too much and becoming comatose, thanking promoters for the \"best party ever\", sponging tunes of big name DJs, losing it on the dancefloor. Without a doubt the most accurate Rave film I've seen so far (not that there's many too choose from of course). Some observations - I am the male version of Leyla, too much Trance, US candy kids are hilarious, I recongised Brian B from Hyperreal spinning in the chill room and was like \"I'm sure I've seen that guy before\" then got it confirmed in the credits, the Asian DJ kid is hilarious at the end, Digweed can't act for toffee.",
         "I've never been to a rave before, so I can't say anything about how realistic this film is. I've also never used drugs before, but I really liked the way drug use was portrayed in the movie... One of the characters mentions that when it comes to drugs, it's best to be \"baked not fried,\" which I interpreted as \"using not abusing.\" The parallel threads we see evolve throughout the film observe people who don't use drugs at all, others who use them, and others who abuse them... All but the last case end up decidedly happy and content. But the film also remains very open minded and non-judgemental about the abusers; it refuses to condemn them, but rather it simply shows the results of what they do and allows the audience to form an opinion of these people on their own. Another interesting theme I noticed was the fact that although raves are a great experience, there might be more to life than having a good time... One of the ravers explains how she has spent her entire life going to raves and has enjoyed herself, but somehow feels unsatisfied about what she's doing with her life. The idea that people must face fear in their lives in order to be content is presented, but a conclusion is never made, once again allowing the audience to use the film as \"food for thought\" and figure it out on their own terms. The soundtrack to the film is great, as are the visuals... The movie has a very energetic feel to it that really made me want to be at a rave, even though I might not end up liking it. If you want an interesting slice of American filmmaking and generational portraits from the 1950's, 70's, and 90's, I suggest consecutively viewing American Graffiti, Dazed and Confused, and this film. All of these films are done in a fairly similar style (following multiple story threads at the same time, being non-judgemental about the characters) and have a very feel-good atmosphere about them while still portraying the atmosphere, lifestyle, and challenges of a generation in a very interesting and entertaining way.",
         "This is probably the closest you can come to experiencing a real rave without actually attending one. I can't understand user comments about poor acting, as I felt that everyone did a very good job here. The story centers around a group of people looking to have a harmless good time, with a number of side-characters. The rave organizer story is great, and the gay couple who can't find where the happening is is absolutely hilarious. The strongest part of the film is the magnificent soundtrack, and appearances by some of the best (and most underappreciated) DJ's around, John Digweed, Pollywog, etc. If you're at all into techno/rave music, just rent this for the great tunes. And you might find that you also enjoy the storyline.",
         "This movie was pretty good, but it had some parts that I did not like. For instance, another comment, below me, said that a rave is not a time to reflect, and I agree. While it is a time to turn lose, and be yourself, you do not go through a whole, \"as drunks call it, a moment of enlightenment\"-pulp fiction. When you are rolling, you feel more like touching and feeling, like Colin, rather than talking and expressing. However, a good aspect is that the drugs played a big part in reluctant first-time ravers. It allowed them to leave their inhabitions at the door. Also, if you want a deeper film about the rave scene, check out \"Be77er living through circuitry.\" It is a documentry with great music, visuals, and insight. For those who like fiction, and scripts, see this. 8/10",
         "The comment below me couldn't be more wrong about rolling and talking and expressing yourself. I have been rolling for 7 years now...and I have expressed myself very fully while doing it. There are moments when I don't even feel like touching and feeling and blah blah blah...there are moments I would rather sit and talk then touch and feel. A rave is a great time to reflect, if you can find a quiet enough spot to do it in...yes that is difficult at times at parties, but it is possible. The below comment is so wrong it insulted me. I wasn't even a member of this site, I registered specifically to make sure that people know not to listen to the foolish comment below. That person is WRONG. I have reflected a lot at raves in the past 6 years that I have been in the scene, I have talked and expressed myself more than I can even say in the 7 years that I have been doing E. This movie is the BEST depiction of a rave, ever. It makes you feel like you're there, the end is better than any other rave movie I have ever seen (GO pretty much sucked) and um...yea, I love Groove because of the way it truthfully depicts not only the scene, but the feelings involved in the scene and in rolling. This movie is TRUE. Period.",
         "Finally! A film that dead-on nails the rave experience. It's about time that an emotionally accurate depiction was shown to the public. These intimate underground parties are truly a positive unifying force; bringing all sorts of people together through music. There have been some previous attempts on film to capture the rave scene. Last year's film, \"Go,\" tried, but the rave segment was merely a background setting. The story wasn't ABOUT the party. \"Party Girl\" was a pretty cool take on the New York scene of several years ago, but still failed to capture the true passionate essence of THE PARTY itself. Mainstream media has inaccurately and negatively smeared raves as being wholly BAD just because of some reckless drug use. Trying to use scare tactics by harping on the constant drug overdoses. It is indeed very unfortunate that there are party-goers who are not smart enough to know their limits. One must remember however that most rave folks' intentions are pure, like the promoter states in the film: It's all about the \"nod\"... the subtle, grateful acknowledgement from a party-goer who's spirts were lifted by the party. The rave experience is not solely about the pursuit of profit or the \"perfect\" drug high. It's about joining with your loved ones, friends, and peers in a magical and musical setting where anything seems possible. Even if only for a night (into an early morning!). \"Groove\" definitely captures this vibe and you can't help but love it. Even if you're not in the \"scene,\" I beleive that there is a universal message of compassion and community that should speak to all. \"Groove\" literally puts you IN the party... the surround sound with the sounds of other party-goers talking around you create this amazing illusion. You feel like you're actually in the movie, taking part. \"Groove\" doesn't make you feel like an outsider. It wraps you up and sucks you in and leaves you jones-ing for more. That's why you'll have to make sure that you make plans to go out and dance right after you see it. \"Groove\" IS the Saturday Night Fever\" for the Millennium. Get up and dance and FEEL IT!!!"
      ],
      "genres": [
         "Drama",
         "Music"
      ],
      "productionCompanies": [
         "415 Productions",
         "Groove LLC"
      ],
      "summaries": [
         "On Friday, a single e-mail blips through the Internet. The word spreads quickly through the city: the party is on. Saturday evening, two hundred people secretly converge at an abandoned San Francisco warehouse. As the sun sets the records start spinning, setting into motion a night that no one will forget. Meet David Turner, a Midwest transplant. He moved to the city with aspirations of starting his career as a writer but his hopes have stalled. After four years he finds himself writing instruction manuals for a computer company. Overworked and with little social life, David spends his time alone, his dream of being a novelist a distant memory. That night, his brother Colin Turner invites him to GROOVE. Colin has a surprise for his new girlfriend, young raver sprite Harmony Stitts, and he wants David there. David reluctantly agrees and is shocked when Colin proposes to Harmony at the party. In the ensuing celebration, they take Ecstasy and suddenly, David is thrust into the world of the San Francisco underground. In a chance encounter, David meets longtime New York raver Leyla Heydel and makes an unlikely connection. Through their budding relationship, they're reminded of a sense of possibility and freedom in their lives they had all but forgotten. But as the party rages on, Colin reveals a deep secret, one that threatens to destroy his relationship with Harmony. When the sun rises the party disappears, and the chaos of the last twelve hours changes the two brothers forever.",
         "An underground rave in San Francisco is the meeting point for many people from different social backgrounds and beliefs. Throughout the night and the many DJ's performing in the party, they will discover love, friendship and many other emotions that will change their lives forever.",
         "An inside look into one night in the San Francisco underground rave scene."
      ],
      "budget": 500000
   },
   "movielensId": 3790,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-06-08",
      "dvdReleaseDate": "2000-12-05",
      "directors": ["Greg Harrison"],
      "runtime": 86,
      "movieId": 3790,
      "title": "Groove",
      "mpaa": "R",
      "actors": [
         "Hamish Linklater",
         "Denny Kirkwood",
         "Mackenzie Firgens",
         "Lola Glaudini",
         "Steve Van Wormer",
         "Rachel True",
         "Vincent Riverside",
         "Dmitri Ponce",
         "Ari Gold",
         "Aaron Langridge",
         "Wendy Turner-Low",
         "Bradley K. Ross",
         "Angelo Spizzirri",
         "Chris Ferreira",
         "Jeff Witzke",
         "Jill Jose",
         "Chris Stone",
         "Lew Baldwin",
         "Bing Ching",
         "Karl Ackerman",
         "Christoph Klotz",
         "Elizabeth Sung",
         "Nick Offerman",
         "Danielle Renfrew"
      ],
      "imdbMovieId": "0212974",
      "originalTitle": "Groove",
      "genres": [
         "Drama",
         "Music",
         "Romance"
      ],
      "youtubeTrailerIds": ["gGRPxq72Kfs"],
      "plotSummary": "An inside look into one night in the San Francisco underground rave scene.",
      "tmdbMovieId": 23655,
      "avgRating": 3.33278,
      "releaseYear": "2000",
      "numRatings": 302,
      "posterPath": "/vtOkzpBtutlhGsfqR1WitDGkG8R.jpg"
   }
}