{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "gay",
            "id": 237
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "mentally handicapped man",
            "id": 170179
         }
      ],
      "imdb_id": "tt0200530",
      "video": false,
      "title": "Chuck & Buck",
      "recommendations": [
         47462,
         5873,
         172854,
         5591,
         33358,
         33430,
         15850,
         28628,
         55613,
         77621,
         17021,
         89199,
         321,
         44352,
         25636,
         19965,
         21056,
         64802,
         96551,
         19094
      ],
      "backdrop_path": "/bITx1OgfEHvGmlrv8tNg1UY8iAm.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Buck O'Brien",
               "gender": 2,
               "credit_id": "52fe468bc3a36847f8104bef",
               "name": "Mike White",
               "profile_path": "/cbwwGeYAUJuSFB95i7TL98LPRRc.jpg",
               "id": 17735,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Charlie 'Chuck' Sitter",
               "gender": 2,
               "credit_id": "52fe468bc3a36847f8104bf3",
               "name": "Chris Weitz",
               "profile_path": "/xlnVbsnoP3PZCjEa2d99ETVLAFB.jpg",
               "id": 3288,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Beverly Franco",
               "gender": 1,
               "credit_id": "52fe468bc3a36847f8104bf7",
               "name": "Lupe Ontiveros",
               "profile_path": "/pnZMPs7BVeUv7rDOrtWdPEc5hAL.jpg",
               "id": 28779,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Jamilla",
               "gender": 1,
               "credit_id": "52fe468bc3a36847f8104c01",
               "name": "Maya Rudolph",
               "profile_path": "/qLDuXku39c4uwVf3h2GjFqwZqik.jpg",
               "id": 52792,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Sam",
               "gender": 2,
               "credit_id": "569beadf9251415e7300067f",
               "name": "Paul Weitz",
               "profile_path": "/u6VYkIxricoJ31MkmljXs2ZCSFQ.jpg",
               "id": 3289,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Carlyn",
               "gender": 0,
               "credit_id": "569beaf89251415e67000644",
               "name": "Beth Colt",
               "profile_path": null,
               "id": 588421,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Diane",
               "gender": 1,
               "credit_id": "569beb09c3a36858ce000723",
               "name": "Mary Wigmore",
               "profile_path": null,
               "id": 980684,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Barry",
               "gender": 0,
               "credit_id": "569beb16c3a36858cb000646",
               "name": "Paul Sand",
               "profile_path": "/7rZqavfFZUbr6MgQEBxA2xVf7jF.jpg",
               "id": 78416,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Mrs. O'Brien",
               "gender": 1,
               "credit_id": "569beb2cc3a36858c6000704",
               "name": "Pamela Gordon",
               "profile_path": null,
               "id": 154582,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe468bc3a36847f8104bfd",
               "name": "Miguel Arteta",
               "profile_path": "/c1StX0L6loDCLcQODL8Z6CPYF1t.jpg",
               "id": 61069,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "53463de60e0a265fe6000f2b",
               "name": "Mike White",
               "profile_path": "/cbwwGeYAUJuSFB95i7TL98LPRRc.jpg",
               "id": 17735,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.898856,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 44490,
      "vote_count": 22,
      "budget": 0,
      "overview": "Buck is a man-child who has lived his existence in a life of kindergarten collages and lollipops. Buck remembers his old childhood friend Chuck, with whom he feels a need to reconnect with after having invited him to his mother's funeral. Buck treks out to LA where Chuck, now a music record executive, is living his life. Buck ends up developing an obsession with Chuck and begins stalking him.",
      "similar": [
         184352,
         383526,
         449176,
         380874,
         47643,
         26280,
         160165,
         26933,
         258034,
         425193,
         338189,
         52799,
         413666,
         382475,
         222918,
         322127,
         261776,
         340684,
         10938,
         11000
      ],
      "original_title": "Chuck & Buck",
      "runtime": 96,
      "poster_path": "/1WhN17BjEMc3qfKmJvYypYXE86G.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2000-01-21",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "REMEMBER THOSE GAMES WE USED TO PLAY?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Miguel Arteta"],
      "runtime": 96,
      "synopsis": null,
      "writers": ["Mike White"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0200530/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY1NTgzNjkyN15BMl5BanBnXkFtZTcwNTYwOTcxMQ@@._V1_SY317_CR7,0,214,317_AL_.jpg",
      "actors": ["Stars: Mike White, Chris Weitz, Lupe Ontiveros | See full cast and crew »"],
      "reviews": [
         "If you're losing faith in the creativity of screenwriters, \"Chuck and Buck\" should be an eye opener. This cleverly conceived film could be called a new twist on the theme of obsessive love, yet that would not really do it justice. \"Chuck and Buck\" explores the classic tale of unrequited longing not only from a new angle, but attempts to sound the very depths of that longing. Directed with great assurance by Miguel Arteta and written by Mike White (who also plays Buck), this is a film that really succeeds in taking an audience somewhere they have (probably) never been. Nearly everyone can relate to a tale of frustrated love. Buck's monomaniacal fixation of his love object is nothing new to movies. This character could recall, by turns, John Heard in \"Chilly Scenes of Winter\" or Isabelle Adjani in \"The Story of Adele H.\". And, like those and myriad other lovesick character studies, \"Chuck and Buck\" offers the viewer some basis of the obsession. Where the new film is unique is in the extremely close observation of a lovestruck character as a manchild. Buck has-in the deepest emotional sense-truly never left his childhood behind. His bedroom is replete with every little-boy accessory: piles of boxed board games, stuffed animals, and the persistent motif, an illuminated plastic globe that displays lollypops. When his mother dies at the outset of the film, Buck-now 27-instantly transfers his emotional dependency onto Chuck, his best friend from childhood. Not surprisingly, the latter has moved forward into an adult life. Chuck has gone to LA, taken a job with an independent recording company, and gotten himself engaged. Buck tracks his old friend down, inviting him to his mother's funeral, and wastes no time in letting Chuck know that the special quality of their childhood relationship-a sexual one-has not been forgotten. In fact, Buck wants to take right up where they left off some sixteen years ago. As might be expected, Chuck, his fiancee in tow, heads immediately for the Hollywood Hills. When the indomitable Buck relocates himself to LA to pursue his romantic destiny, the two men embark upon one of the oddest, most entertaining and most wrenching psychodramas yet encountered on screen. One of many notable aspects of the film is its completely unapologetic attitude to homosexuality. Buck certainly has a problem, but it is one of infantilism, not of sexual orientation. Even in moments of dire frustration at Buck's relentless advances, Chuck never condemns his friend for who he is. For some, an identification of homosexuality with infantilism may be seen as a subtext here. But to this reviewer, the sexuality issue serves a more symbolic end: these childhood friends whose names rhyme are two sides of one coin. They have more in common than Chuck, perhaps, would admit and their bond goes deeper than even Buck could know. Chris Weitz does very fine work bringing an exasperated Chuck to life. Although his character is much less finely drawn, Chuck can elicit as much audience-identification as Buck does. Weitz' facial expressions, as realizations slowly dawn upon him are expert and compelling. In the role of a neighborhood theater guardian angel, Lupe Ontiveros is downright marvelous. She finds the exact key to a character who discovers herself through association with the enigmatic Buck. Best of all is Mike White as Buck, a textbook case of perfect casting. White could not look more suited to the role: his slightly drooping, half-open mouth and shock of red hair are both comic and oddly endearing. So identified with is White with Buck that it is difficult to avoid thinking the role is somewhat autobiographical. In a film of many fascinating and clever touches, one especially stands out. Running out of avenues to Chuck, Buck decides to write and produce a play about his frustrating friendship. With the help of the Ontiveros character and some hilarious backstage tribulations, the play is performed and, as a conciliatory gesture, attended by Chuck. The upshot of this entertaining, but disturbing episode is unexpected and moving. Shot on digital video tape by Chuy Chavez, the film has a fuzzy, home-movie quality. And the many hand-held shots have only a slight documentary feeling, due to the complete lack of any sense of improvisation in this tightly scripted venture. \"Chuck and Buck\" takes chances with it characters and its narrative. While some of its components may work better than others, it boldly questions the meaning of emotional maturity and friendship. Highly recommended.",
         "Highly enjoyable, terrific look at the sometimes difficult transition between childhood and adulthood. Basically deals with the relationship between Chuck and Buck. 'Best' friends in childhood, but who have now taken completely different paths. Chuck is a successful record executive with a beautiful girlfriend. Buck is still immature and longing for the 'good old days'. Buck tracks Chuck down and tries to turn things back to the way they were, which leads to many problems. Keenly looks at many universal human experiences from catering to that 'inner child', avoiding change, holding on to memories of simpler times, and even facing the fact that people can change and drift apart. It does all this while still conveying it's message (that accepting change is your best medicine) without ever being too preachy or too cute. Fairs better than other films of similar type (FLOUNDERING, FREE ENTERPRISE) simply because the characters and situations are more consistent. This allows the viewer to better identify with their own similar experiences. White as Buck is dynamite. Not only does he convincingly play a 11 year old, but he actually LOOKS like one despite being a adult. Has a good non-flashy finale that,in it's own low key way, really hits home. A winner. Look quickly for Paul Sand as one of the playhouse directors",
         "Chuck & Buck (2000) was one of those small US films that created a big buzz a few years back. I finally got round to seeing it on DVD and was quite impressed. It follows in quite a long history of 'loser' cinema, the sort of film where the anti-hero is the star. I suppose you could mention many of the film noir detectives such as Kiss Me Deadly's Mike Hammer as some of the earliest examples. Penn's Bonnie and Clyde also challenged the popular conceptions of hero/antihero which continued into the 1970's with films such as Scorsese's Taxi Driver. It is still a popular genre in US cinema to this day with such films as Happiness by Todd Solondz, Zwigoff's Ghost World and Todd Louiso's Love Liza or One Hour Photo to name but a few recent examples. The challenge is inevitably how to get the audience to care and sympathies for characters which you would otherwise probably avoid at all costs; people who are otherwise repulsive, morally reprehensible or even down right sick. Full credit to Miguel Arteta and his team for this very good film centring around two childhood friends Chuck and Buck who meet up again in adulthood. Buck, played by writer Mike White, is a mess. His mother dies in the first scene but this seems to take a back seat as soon as Buck sees his old friend at the funeral. However when Buck comes on to Chuck after the wake, the innocence of their earlier relationship and Buck's current motivations is thrown into question. Although better known for his writing, White is actual a very good character actor (You may have recently seen him in School of Rock as Jack Black's room-mate, held captive by his dictator of a girlfriend). He's one of those actors that just look naturally pale and sickly, as if he hasn't seen the light of day for some months. This is not far from the truth as regards to the character of Buck who has been caring for his sick mother, whose ghastly coughs are among the first sounds in the film. He catches perfectly a guy verging on the mentally retarded with some severe emotional problems, but whose nervous twitches and stammering speech are also strangely endearing and charming. Chris Weitz (better known for unleashing the American Pie franchise with his brother Paul, also in this film), plays Chuck, or Charlie as he now prefers to be known, a successful LA record company executive with a pretty wife, a nice house, BMW...the works. Weitz is an interesting casting decision. His relative inexperience in acting shows, but in a good way, manifesting in the superficially charming yet wooden and impersonal mask of a young, powerful professional. His face is chiselled enough to be good looking, but his sticky-out ears and slightly ratty face give an indication that he may once have been geeky enough to hang out with a guy like Buck. Cast-wise good support all round particularly Lupe Ontiveros as Beverly, recruited by Buck to help produce and direct his play \"Hank and Frank\". She brings a real down to earth honesty that really strengthens the play within the film sub-plot. Paul Weitz is also terrifically wooden, naturally or not, as the actor chosen by Buck to play Frank in his play. Beth Colt is also good in the slightly underwritten role of Chuck's wife, who becomes unsettled but also genuinely intrigued by Buck and his boyhood relationship with her future husband. The reason I think Chuck and Buck works so well is that purely by spending time with Buck and seeing him obviously distressed by being spurned by Chuck there is some degree of sympathy created. Most people know, to some extent, what it's like to meet up with close friends from the past and the various feelings which arouse from that, particularly if they've changed radically as people. Feelings of nostalgia, maybe jealousy and envy, superiority or amazement that you ever liked them at all. OK, so the whole homosexual sub-plot does complicate the experience a little but it shouldn't put people off as it is not presented in a particularly explicit manner until one final scene. Some worthwhile issues are raised particularly regarding Chuck's character. Is he repressing his real desires in order to conform, is Buck just in search of love whoever it may be from? There are a few opportunities for the film to take a whole darker twist a la Happiness which I'm glad did not happen. Now I'm no psychologist but I'm not too sure what to make of the conclusion of the film. Spoiler - After one last sexual experience together, Buck seems to start some sort of journey to maturity signified by him throwing away his collection of toys. Could this be a final closure, enabling both characters to move on? Buck is invited to Chuck's wedding and he looks at the newly-weds with genuine happiness for them, rather than the jealousy he previously felt towards Chuck's fiancée. The film appears to end on quite an optimistic note - a fresh start for both, emphasised by a reprise of one of the earlier songs, Gwendolyn Sanford's wonderful 'Freedom of the Heart' (I've got freedom of the heart / It's a brand new start.) But can it really be that simple? Just how much can people ever change? I want to finally highlight a couple of technical aspects. First, the music is absolutely fantastic. The music co-ordinators, including ex-Beck and REM drummer Joey Waronker, have found some wonderful songs that are childish, joyful, melancholy and creepy all at once. They really help root the viewer in Buck's retarded view of life and are also creepily ironic as they often accompany Buck in scenes verging on criminal stalking. A clever use of the power of sound/music over an audience. The other point I wanted to mention was the digital cinematography. I was undecided about this. On the one hand I appreciate that it gives lower budget films a huge advantage in terms of eliminating film stock/developing costs. It can also be used just as expressively as film and does have a particular aesthetic quality. However I thought that the image quality was particularly muddy on this film even on DVD. A brief aside: For people who like to really read between the lines of films, one critic's review I read ( I believe either David Edelstein or J. Hobermann) made a very interesting possible interpretation of the film regarding the relationship between the independent and studio film industries. As I've mentioned previously the casting is particularly relevant here, White- the acclaimed indie writer, Weitz - the young powerful studio player. I'll leave you to ponder those sort of meta-filmic interpretations at your own leisure! 8/10",
         "I agree this movie had dark undertones. The look and feel was definitely low-budget but the story stood up well. It definitely made me feel uncomfortable at times---kinda like when you want to say to a character in film \"No, PLEASE, just DON'T do that!\" I felt so sorry for Buck, he did not mean to be the way the was...he just didn't know any other way. This definitely is not a light-hearted fun movie. It makes you think and feel a lot. A tiny bit too short, by today's standard's but it got the point across well.",
         "The notable thing about Chuck & Buck is not just that it's a clever, well made movie with a fascinatingly odd central character, but that it doesn't go where you expect it to. At first Chuck & Buck seems like a more serious take on The Cable Guy, another weird movie about a strange stalker. Buck is a truly weird, disturbing guy, an adult seemingly incapable of leaving his childhood behind and unable to understand the world around him. But the relationship between the principals is more nuanced than one is first lead to think and the movie refuses to make any of the obvious choices, moving it beyond fascinatingly weird to genuinely intelligent and thoughtful. Much of the movie's appeal is undeniably its weirdness, but the movie is far more than a one-trick pony.",
         "What a surprising beautiful and tragic film that Mike White has created. I say Mike White instead of the director (who also did an exemplary job) because it was his penmanship that crafted this film into such a powerhouse. When I rented the film, I did not expect to be so submerged with so many bold styles and emotional thematic elements. I was not expecting to see such a high caliber of acting and storytelling mixed together into one small Sundance winning picture. In other words, I wasn't expecting really anything when I placed this film into my DVD player, so when the film finished and I picked my jaw off the floor, it became instantly clear that I would never experience another film like this one again. From the way that it was filmed, to the small budget of the production, to even the taboo subject it presented, Chuck & Buck is one of those films that will shock, amaze, and really pull at the strings of your heart. It is a film, first and foremost, about friendship and the destructive impact that childhood moments can have on our futures. I cannot speak of this film without mentioning first the brilliant mind of Mike White. Not only did he accomplish the first challenge of this film \u0085 writing it, but he also stole the entire film by also playing one of the leads, Buck. While most film watchers, sadly, will remember him as Jack Black's friend in School of Rock, his true talents are completely showcased in this film. He completely looses himself in this character and it is absolutely obvious to those of us watching the film. During all of this film, I never once saw Mike White, the actor, but instead I saw the character of Buck. That is a rare accomplishment in the acting world. Nine times out of ten in these types of films, you are handed moments where the actor or actress is simply themselves with a different type of voice. That is not the case with Mike White, he completely embodies his character. From the hand motions, voice, and even reactions, he is Buck. He is the character he has set out to play. This can happen because you can tell he is very compelled to this character. He is not into the story for the money, but instead to tell the story as honestly as possible. This was very obvious throughout the film. These actors, now directors and writers, placed their heart and soul into this picture, and it seeped through the television. This is truly one of those rare instances where you could see why people decide to make films. While I wasn't overly impressed with the acting ability of Chris Weitz (since Mike White overshadowed him), he did help contribute to the overall scheme of the story. This is a thrilling tale, and it is difficult to see it as the comedy that IMDb has labeled. This was a completely human story told with such precise honesty and honor that I have no doubts that anyone that watches it will walk away with a different perspective. This wasn't your typical \"stalker\" film, there were so many different and deep layers to this story that you could easily watch it three or four times a day and still get caught up in a different aspect. I don't know if this makes sense or not, but there were moments when I could see the friendship, the insanity, and the sorrow. The ending brought the story full circle and really had me in suspense until the final moments. Nothing is handed to you right away, as the story develops, you are shown more and more until the utter power of this film is hanging on your own shoulders. It is deep and amazing, and I cannot stop using that word \"amazing\" enough. Overall, I thought this was an exceptional film for 2000. I think that White should have been handed more and more acting roles throughout the years, but it still makes me happy to see him writing. This was a film about friends who never quite left their childhood years, and have been waiting for that one moment to close the door of to their past. This is not a film for everyone, but if chosen to explore will reveal some thickly layered characters with superb acting by Mr. White. This is a drama that carries relevance in today's society and will continue forever to be a cultural staple in the film world. I loved it, and hope others will see the powerful nature of Chuck & Buck. Grade: **** out of *****",
         "Great film and quite unsettling in its handling of the relationship between the two men. The character of Chuck (the music exec) is a really awful character and I did find it slightly unbelievable that he would be so unsympathetic to Buck. I loved the immediacy of the shooting style and the quality of the video. It had a direct home video quality. I also liked the traits of Buck and his view of the world. That really comes across well. I remembered this film from years back, possibly a trailer and I was glad to finally track it down. It did not disappoint. I genuinely shocked me in a couple of moments but it was more about the use of language in an unexpected way which was in itself something I hadn't experienced for a while in a film. Great story, written by the actor who plays Buck and great performances. Very memorable film and a title that lingers.",
         "Buck? What are you doing here? Buck? Is that you? Buck? Buck, people change. Buck, I don't ever want to see you again. Don't call, don't come by my office, don't come by my house, you're sick. Chuck? Yes Buck. Chuck will you come back to my hotel for a night of love? OK Buck. Doodleedoodleedo... WHAT WAS THAT? This is one of the worst movies I have ever seen. What an annoying, weird, stupid, piece of work.Buck is an incredibly annoying presence and we are forced to follow him through about fifty lollypops. What is even worse is the idea that the chilly Chuck would put up with this mutt's creepy invasion of his life and at the moment he clearly cannot take anymore he sleeps with the weirdo! Nice message - go ahead stalk someone, even if they tell you your sick and that they never want to see you again they really do and they really do want to sleep with you. BUCK, I NEVER WANT TO SEE YOU AGAIN. I MEAN IT.",
         "\"Chuck & Buck\" is something a little different, and that's always a plus, but from the overly-giddy music to the brackish photography--with the camera always pulled in too close to the actors' faces--it's rather an obnoxious combination of sentiment and off-putting drama (it seems designed to be these things intentionally). Childhood friends are reunited years later at a funeral, but while Charlie is now a corporate businessman in Los Angeles, Buck is a lollipop-sucking, simple-minded child in a man's body (with homosexual leanings). The leading actors (Chris Weitz, a Christopher Reeve lookalike, as Charlie and Mike White in the more showy role of Buck) are both good, yet the structure of this story (man innocently stalking man) makes one uncomfortable. There are funny scenes and quirky details in Mike White's screenplay (such as the way strangers initially respond positively to Buck), but the overall effect is queasy. ** from ****",
         "This movie was neither worthy of loving or loathing, it just kinda 'was'. I found it more interesting trying to understand its writer than the characters. Had rented it on DVD, and after watching hoped that the commentary track with the star/author would illuminate. Not even. I couldn't begin to suggest if someone else will like this movie, since clearly everyone has their own reaction and some love it. While watching it wasn't boring, I can't say I liked it, despite being comfortable with off-the-wall material. But if you happen to have serious issues with homosexuality, you will probably NOT want to see this movie, even though it isn't about being gay in the ordinary sense. I never understand people who'll go to a movie like Threesome and then groan at two men kissing. Grow up already. All the C&B men we see in any depth are disfunctional. Chuck and his bride-to-be barely communicate apparently, since she never knows anything until almost the end of the movie. Chuck is barely able to communicate period come to think of it, he's a man of actions not words... so I guess he really is straight. Buck is what the other reviewers say: creepy, pitiful, pathetic, etc., but I fail to understand how one would get stuck at 11 years old going through the US school system. If you go to middle and highschool, you WILL come out different than you went in. Too much happens, especially when combined with the hormone cocktail that is puberty. Did Buck just sit in the house until he was 22 when his mom got sick? There was little effort to explain all that either. I know guys who are stuck at 18, Hell *I* may be a guy who is stuck at 18, but 11? Just don't buy that. *** PROBABLE SPOILERS BEYOND HERE *** Its seems much more interesting things could have been done with this story. One of the cool things about Indies is that they can go out on a limb and aren't subject to test audiences, a requirement for happy endings, etc. And remember Fatal Attraction? Now there was a stalker! Buck a stalker? Eh. Kept waiting for him to do something extreme, but he never did really, unless the firecracker thing with little Tommy wasn't an accident. They could have had an interesting story arc if Sam had at first allowed Buck some latitude then got cold feet later, but they didn't do that. Or if Sam had been willing, but only for a one way 'relationship'. The actors playing Sam and Chuck are brothers in real life by the way. And the ending is as rotten as could be. Did Chuck only let Buck do the one thing, or did they complete the lil 'Chuck and Buck, S--- and ----' rhyme all the way around? Did Chuck do it because he really thought it would end it all, or because he was many martinis deep and horny? Considering the kiss, one would think he really wanted to, since even when a lot of guys 'experiment' with other dudes, kissing is rarely on the menu. In a deleted scene on the DVD, Chuck throws Buck out of his office, after their deal, so the deal couldn't have worked very well. If Sam didn't want Buck's advances, and knew he was sick (the stunted mental state, not any reference to being gay), why would he want him next door? What was the source of Buck's sudden emotional transition in the last minutes? Finding a new guy to obsess about just one door down? Finally getting that one (adult) sexual experience with someone he had powerful feelings for? At least I can relate to wanting an intimate connection just once when having a powerful crush on someone, but don't think that getting it physically would suddenly make it all better... probably the opposite. Or was his final awaking being threatened with bodily harm (again, the deleted scene)? Even for somewhat disturbed people, all this does not make sense. If there is a message here, it is too jumbled to be useful. If I'm going to watch realistic disfunctional people with real problems, I'd much rather watch Six Feet Under on HBO. There's more depth in one episode than in this. Of course I might continue to watch a show with a rarely shaven, often shirtless Peter Krause even if it didn't have depth. Chuck & Buck... Damn the luck. Mostly yuck. Did Chuck really suck? Why was Buck so struck? I'll never know, and come to think of it, I don't give a f---! If you haven't seen it and still want to, I wish you luck."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Artisan Entertainment",
         "Blow Up Pictures",
         "Flan de Coco Films"
      ],
      "summaries": [
         "Buck is a man-child who has lived his existence in a life of Romper Room, kindergarten collages, and lollipops. When his mother dies suddenly, Buck remembers his old childhood friend Chuck, with whom he feels a need to reconnect after having invited him to his mother's funeral. Buck treks out to Los Angeles where Chuck, an up-and-coming music record executive, is living his life. Buck ends up developing an obsession with Chuck and begins stalking him.",
         "Chuck and Buck were best friends when they were young. Chuck grew up, and Buck didn't. When his mother dies, Buck invites Chuck (who mostly goes by Charlie now) to the funeral. He wants to be Chuck's best friend again, but Charlie is busy working and preparing for his wedding. Buck moves to Los Angeles and tries to revive the old friendship. He also writes a play, and hires Beverly to direct it. Charlie and his fiancée Carlyn stop returning Buck's calls, but he persists.",
         "Chuck and Buck were best friends growing up until Chuck moved away when he was 11. Sixteen years later, Chuck (now Charlie) is a successful music executive, but Buck is still has the emotional maturity of an 11-year-old. When Buck's mother dies, he looks up Charlie, whom he hasn't seen since they were kids, and initiates a relationship. Charlie is embarrassed by Buck's emotional immaturity and tries to cut off all contact. Shattered by this rejection, Buck stalks Charlie and his fiancée Charlyn until Charlie is forced to re-examine their childhood relationship.",
         "An oddly naive man-child stalks his childhood best friend and tries to reconnect with their past."
      ],
      "budget": 250000
   },
   "movielensId": 3794,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-01-21",
      "dvdReleaseDate": "2000-12-19",
      "directors": ["Miguel Arteta"],
      "runtime": 96,
      "movieId": 3794,
      "title": "Chuck & Buck",
      "mpaa": "R",
      "actors": [
         "Mike White",
         "Chris Weitz",
         "Lupe Ontiveros",
         "Maya Rudolph",
         "Paul Weitz",
         "Beth Colt",
         "Mary Wigmore",
         "Paul Sand",
         "Pamela Gordon"
      ],
      "imdbMovieId": "0200530",
      "originalTitle": "Chuck & Buck",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["i2h41AY-sSg"],
      "plotSummary": "Buck is a man-child who has lived his existence in a life of kindergarten collages and lollipops. Buck remembers his old childhood friend Chuck, with whom he feels a need to reconnect with after having invited him to his mother's funeral. Buck treks out to LA where Chuck, now a music record executive, is living his life. Buck ends up developing an obsession with Chuck and begins stalking him.",
      "tmdbMovieId": 44490,
      "avgRating": 3.25143,
      "releaseYear": "2000",
      "numRatings": 873,
      "posterPath": "/1WhN17BjEMc3qfKmJvYypYXE86G.jpg"
   }
}