{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0163676",
      "video": false,
      "title": "The In Crowd",
      "recommendations": [
         86913,
         31246,
         37244,
         39424
      ],
      "backdrop_path": "/6N9x77El7AQdxvoplDSkYOVhOSD.jpg",
      "revenue": 5217498,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Brittany",
               "gender": 1,
               "credit_id": "52fe45c99251416c9103e52b",
               "name": "Susan Ward",
               "profile_path": "/sqYO5l0yvabe8REyqAsXcU0oRuO.jpg",
               "id": 65239,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Adrien",
               "gender": 1,
               "credit_id": "52fe45c99251416c9103e52f",
               "name": "Lori Heuring",
               "profile_path": "/qyflsgjbPUV2fJPxHQGklenrWzg.jpg",
               "id": 15010,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Matt",
               "gender": 2,
               "credit_id": "52fe45c99251416c9103e533",
               "name": "Matthew Settle",
               "profile_path": "/neODd3vTVEb7TXOWEZC44ZZu1yk.jpg",
               "id": 33286,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 2,
               "credit_id": "55ea2113c3a3687d3b00054e",
               "name": "Nathan Bexton",
               "profile_path": "/zSDOqtv5VRkHkdnIo4jde0ERQqv.jpg",
               "id": 19223,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 1,
               "credit_id": "55ea211cc3a3682c64006c6f",
               "name": "Tess Harper",
               "profile_path": "/gJT9fBX04LjmbOzOzYcNbA2ZLF1.jpg",
               "id": 41249,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 2,
               "credit_id": "55ea21289251413e3a007688",
               "name": "Jay R. Ferguson",
               "profile_path": "/vC2bLfSmfEvTKT0yNwPfZ8N7Aat.jpg",
               "id": 80289,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "",
               "gender": 2,
               "credit_id": "55ea21309251413e410073fb",
               "name": "Ethan Erickson",
               "profile_path": "/e0E9L3x9tGDiPvXVkXa54ue8LU6.jpg",
               "id": 149563,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "",
               "gender": 2,
               "credit_id": "55ea2150c3a3682c70007389",
               "name": "Daniel Hugh Kelly",
               "profile_path": "/6eZZbAZsupu3WHHtW3tud3o0F1u.jpg",
               "id": 22111,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 2,
               "credit_id": "55ea215c9251413e32007451",
               "name": "Taylor Negron",
               "profile_path": "/l641HJtE8WSjWAJGHAer5Hx89SG.jpg",
               "id": 37043,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Morgan",
               "gender": 0,
               "credit_id": "562e67e0c3a3681b6100b7d6",
               "name": "Katharine Towne",
               "profile_path": "/33AK0lDtxIhh7125JC7daDWMSkC.jpg",
               "id": 15012,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Sheila",
               "gender": 1,
               "credit_id": "58b1c6a7c3a368070101040e",
               "name": "Erinn Bartlett",
               "profile_path": "/Ap5xpXRNBxSYoYfqBjuRfQYByEv.jpg",
               "id": 60953,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe45c99251416c9103e539",
               "name": "Mary Lambert",
               "profile_path": "/oFgE0UQeeQqFhwsVaD5l26PH5kr.jpg",
               "id": 56263,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c99251416c9103e53f",
               "name": "Mark Gibson",
               "profile_path": null,
               "id": 60208,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Thriller",
         "id": 53
      }],
      "popularity": 1.135516,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 36047,
      "vote_count": 18,
      "budget": 15000000,
      "overview": "A mentally disturbed young woman takes a job at a posh country club and falls in with a clique of wealthy college kids where she's taken under the wing of the clique's twisted leader, who harbors some dark secrets too terrifying to tell.",
      "similar": [
         258480,
         27586,
         244772,
         401898,
         242224,
         3981,
         112160,
         858,
         141,
         634,
         437557,
         297762,
         376867,
         394117,
         370663,
         2252,
         12162,
         1359,
         1991,
         6637
      ],
      "original_title": "The In Crowd",
      "runtime": 105,
      "poster_path": "/3RcoBGv5DwDKP01GonTufZ8tWCn.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Morgan Creek Productions",
         "id": 10210,
         "origin_country": ""
      }],
      "release_date": "2000-07-19",
      "vote_average": 4.6,
      "belongs_to_collection": null,
      "tagline": "What would you do to get in?",
      "adult": false,
      "homepage": "http://in-crowd.warnerbros.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Mary Lambert"],
      "runtime": 105,
      "synopsis": null,
      "writers": [
         "Mark Gibson",
         "Philip Halprin"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0163676/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIyNDIyOTM2N15BMl5BanBnXkFtZTYwNjcxOTk4._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Lori Heuring, Susan Ward, Matthew Settle | See full cast and crew »"],
      "reviews": [
         "The In Crowd is a great teen thriller. The movie is about Adrien, a strange girl who gets a job at a posh country club, when she meets Brittany, a pretty, rich, popular girl who is the leader of 'The In Crowd.' Brittany invites Adrien to hang out with her and her friends and everything is going well at first until things go bad and Brittany turns nasty. I thought most of the cast played there parts well and even though as the movie went on you tend to know what is going to happen, the movie is still enjoyable to watch. This is definitely recommended for people who enjoy teen thrillers as this is a really good one.",
         "This beach-club teen murder mystery was pummeled by the critics and lasted about three weeks in theaters before beating a hasty retreat to the rental market. Like all films that foster extreme comments and establish preconceived expectations, this one failed to live up (or should I say down) to them. It wasn't great, but it wasn't anywhere near as bad as its critics say it was. The story was actually good, in a puerile way. What I liked about it was that it accurately portrayed the immature backbiting and excessive preoccupation with superficialities that are common among teens. In certain ways, the story was predictable. It was easy to foresee that Adrien (Lori Heuring) was kidding herself if she thought there was no ulterior motive behind Brittany's (Susan Ward) open acceptance of an outsider into the group. What was cleverly presented and not so obvious was Brittany's motive. The production was TV quality. Director, Mary Lambert has mostly TV credits on her resume and didn't push the envelope. The acting was mediocre at best. Both Lori Heuring and Susan Ward were passable but unpolished and they lacked subtlety. The rest of the cast was far worse. This film will probably find a niche with teens and twenty-something young adults, but I don't think it is camp enough to attain cult status. I rated it a 5/10. It's not terrible, but it really doesn't distinguish itself in any meaningful way.",
         "A recently released mental patient lands a job at a posh country club with the assitance of her doctor. She is immediately token under the wing of rich, pampered, and extremely popular Britanny Foster (Susan Ward), but then mysterious accidents begin to occur and people are now showing up dead. Is Britanny responsible for the occurances and for her sister disappearing years earlier or is the supposedly cured ex mental patient?? Extremely entertaining and sexy teen thriller that covers old and new ground, features a perfectly casted Susan Ward who has terrific and intense chemistry with the other lead. Besides being sexy and entertaining, the film is stylish, very fast paced, tightly edited and is pretty well directed with a sensational finale. The only thing that weakens this interprise is a few poor performances in the supporting catergory and a script that doesn't stand to close scurtney. Still well worth viewing though. Rated PG-13; Sexual Situations, Adult Themese, Drug Use and Referneces throughout film, Nudity, Profanity, Violence, and Attempted Rape.",
         "The In Crowd is your basic teen thriller with lots of trashy girls and bad lines & acting and a mediocre script, but it was tolerable. Actually, it was more than tolerable, it was actually fairly good, not the acting, by any stretch of the imagination, but it served its purpose. In my opinion, it's a great movie to watch on a slow/rainy weekend evening. I went into this film with little to no expectations and ended up being pleasantly surprised. I was sure by the reviews that it would be terrible, instead I found myself thoroughly satisfied. While TIC is no \"Cruel Intentions\", it's of the same genre. Spoiled rich kids, doing bad things to each other and sucking in the lowly outsider in the process. \"In Crowd\" has the same atmosphere and draw as any soap opera today, but the cheesy drama of soaps seems to translate well to a certain niche, but it DOES have a niche. Expect nothing more than a two hour version of \"All My Children\" and you won't end this film angry. I say give it a chance. If anything it'll end up on your guilty pleasures list.",
         "That is THE IN CROWD. The film follows a released mental patient Adrien Williams working at a country club only to be sucked in a world of sex, drinking and murder after becoming friends with the glamorous Britnay Foster. At first everything seems like a dream come true until Adrien begins to see that all that glitters isn't gold. The film was extremely entertaining and had a really great climax scene...with a traditional fun cat fight! Lori Heauring and Susan Ward bring great performances. Nathan Bexton does good too. If your looking for Rippled hunks, Babes, sex and murder than this is the film for you! Its a fun teen thriller, with some sexy undertones.",
         "The In Crowd gives us exactly what we would expect for a teen oriented thriller...and more. We have our standard story line. Crazy girl gets summer job at posh country club. Crazy girl makes friends with the overly attractive country clubbers. And then people start getting angry, then people start dying. Is it the crazy girl? the creepy groundskeeper? the seemingly nice gorgeous gal? It's not too hard to figure it out, but there is just enough plot to keep us interested the whole time...And ALOT more... There's lesbian undertones, plenty of girl fights, the aforementioned overly attractive cast. (I left the theater wondering why MY friends didn't look like the people in this movie). There's slapping, attempted drownings, shirtless guys, the occasional shirtless gal, and plenty of campy fun for teens, and for people who appreciate high quality camp.",
         "I saw this movie twice in the movie theaters. Then we rented it a bunch of times for sleep overs and the like. Well I must tell you this movie seems a little predictable at times, but it is still a good movie. What do you expect for a rated PG-13 movie? It's not going to be super scary. There isn't going to be a lot of killings, but there seems to be enough in this movie. This movie likes to play with your mind. Brittany Foster (Susan Ward) is a character who I think makes this movie better. Without Susan Ward's portrayal of Brittany this movie would not be worth watching. Lori Huering does an okay job as Adrien, but it isn't the strongest acting. Nathan Bexton's Bobby added some much needed laughs to this movie. Overall it gets 1 1/2 stars out of 4 on my scale.",
         "Finding to belong is always a struggle in life. After being locked up in any institution would change the person. Some go back to their old ways, some don't. In \"The In Crowd\", it goes to show that cliques aren't worth your while. A woman named Adrien(Lori Heuring), gets out from the psych ward, and into a country club where she can work. In the club, she meets a clique run by Brittany(Susan Ward). Her co-worker warns her about her. Naivity would settle in, then Adrien does catches on about her. Tough as nails, she handled the snake joke very well. Others would have a coronary. The lip gloss Brittany wears is the only thing that makes her look good, everything else brought out the ugly truth. When Adrien was set up for the murder of Dr. Henry Thompson(Daniel Hugh Kelly), one of the in crowds makes a trap for Brittany. It takes one person to stand out in front of the crowd, and think for one self. The rest would look at Brittany in total disgust. They'll be finding themselves a new leader. The point is, crowds can be dangerous. That's why I believe in individuality. 2.5 out of 5 stars.",
         "\"The In Crowd\" is a mindless drama about a young woman who, released from a mental hospital on a work furlough program at a resort for rich kids, becomes involved in murder and intrigue. This unfortunate film takes off like a snail on Quaaludes and spends over half the run time developing paper thin characters amidst a quagmire of filler. Although the production is technically nominal, acting is amateurish, direction poor, script blah, and the story just plain weak.",
         "I remember watching this movie on pay per view back in 2001, I remember liking it because an attractive woman was a serial killer. I had long forgotten about this film until I caught it on HBO a few weeks ago, After watching this film for the first time in 11 years I never knew how lifeless the actors and actresses were and how predictable the plot is. The story was interesting it was about a girl named Adrien who was just released from a mental hospital to work as a housekeeper at a country club/resort type place, where young, beautiful college kids lay around in the sun, play tennis, etc. She meets Brittany Hodges or actually more like saves her, when Brittany tries to fake like she drowned. So Adrien and Brittany become friends, and some strange things happen at the club. One of Brittany's so-called \"friends\" warns Adrien to go away, and to leave the huge mystery that happened a year ago alone, but Adrien knows something's up. Brittany's games are a little too much to handle sometimes. And after learning about Adrien's \"history\" she seduces Adrien's therapist while wearing Adrien's dress, then kills the therapist at a party later, and then Adrien goes to jail because they think she was the one who had sex with him, and killed him. It could have been a much better movie had the script really been tweaked, but tweaked it was not so good this is not."
      ],
      "genres": [
         "Drama",
         "Thriller",
         "Mystery"
      ],
      "productionCompanies": ["Morgan Creek Productions"],
      "summaries": [
         "Adrien Williams enters the \"in crowd\" when she is hired by a posh East Coast country club and befriended by Brittany Foster, the charismatic leader of a clique of wealthy college students who are home for the summer. Brittany takes Adrien under her wing, attempts to show her the benefits of the good life and introduces her to other members of her inner circle, including the object of Brittany's affection, tennis pro Matt Curtis. When Matt shows an interest in Adrien, Brittany begins to reveal her dark side and Adrien slowly starts to learn that Brittany and her pack of friends will do anything to protect their circle and the dark secrets they harbor.",
         "A mentally disturbed young woman takes a job at a posh country club and falls in with a clique of wealthy college kids where she's taken under the wing of the clique's twisted leader, who harbors some dark secrets too terrifying to tell."
      ],
      "budget": 15000000
   },
   "movielensId": 3797,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "2000-07-19",
      "dvdReleaseDate": "2000-11-28",
      "directors": ["Mary Lambert"],
      "runtime": 105,
      "movieId": 3797,
      "title": "The In Crowd",
      "mpaa": "PG-13",
      "actors": [
         "Susan Ward",
         "Lori Heuring",
         "Matthew Settle",
         "Nathan Bexton",
         "Tess Harper",
         "Jay R. Ferguson",
         "Ethan Erickson",
         "Daniel Hugh Kelly",
         "Taylor Negron",
         "Katharine Towne",
         "Erinn Bartlett"
      ],
      "imdbMovieId": "0163676",
      "originalTitle": "The In Crowd",
      "genres": ["Thriller"],
      "youtubeTrailerIds": ["m19HMkdP478"],
      "plotSummary": "A mentally disturbed young woman takes a job at a posh country club and falls in with a clique of wealthy college kids where she's taken under the wing of the clique's twisted leader, who harbors some dark secrets too terrifying to tell.",
      "tmdbMovieId": 36047,
      "avgRating": 2.28114,
      "releaseYear": "2000",
      "numRatings": 281,
      "posterPath": "/3RcoBGv5DwDKP01GonTufZ8tWCn.jpg"
   }
}