{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "matchmaking",
            "id": 10132
         },
         {
            "name": "orphan",
            "id": 13014
         },
         {
            "name": "identical twin",
            "id": 204353
         },
         {
            "name": "relationship sabotage",
            "id": 239145
         }
      ],
      "imdb_id": "tt0113442",
      "video": false,
      "title": "It Takes Two",
      "recommendations": [
         11025,
         34729,
         54004,
         36269,
         39227,
         36251,
         35703,
         44899,
         54005,
         57789,
         56195,
         10735,
         10897,
         14024,
         11982,
         35645,
         11355,
         7303,
         41582,
         50326
      ],
      "backdrop_path": "/5Pok9TVLoAp72PIFcoDbACcCBA9.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Diane Barrows",
               "gender": 1,
               "credit_id": "52fe452f9251416c9102a483",
               "name": "Kirstie Alley",
               "profile_path": "/fQ1EOV3dazf05uhrEVqMN2S3T0U.jpg",
               "id": 1796,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Roger Callaway",
               "gender": 2,
               "credit_id": "52fe452f9251416c9102a487",
               "name": "Steve Guttenberg",
               "profile_path": "/utLqKSEN9TX3EniBlX4BpytDunB.jpg",
               "id": 26472,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Alyssa Callaway / Amanda Lemmon",
               "gender": 1,
               "credit_id": "52fe452f9251416c9102a48b",
               "name": "Ashley Olsen",
               "profile_path": "/gIZBBtO7IGV1wxgFNCzuo7ZakwO.jpg",
               "id": 67848,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Amanda Lemmon / Alyssa Callaway",
               "gender": 1,
               "credit_id": "52fe452f9251416c9102a48f",
               "name": "Mary-Kate Olsen",
               "profile_path": "/fxTJRxHrNyZVrWZWQZOTXJnGwDY.jpg",
               "id": 67849,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Clarice Kensington",
               "gender": 1,
               "credit_id": "52fe452f9251416c9102a493",
               "name": "Jane Sibbett",
               "profile_path": "/w76SJiN72NRfUKNgmJ1ZZfYzjG9.jpg",
               "id": 92255,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Vincenzo",
               "gender": 2,
               "credit_id": "52fe452f9251416c9102a497",
               "name": "Philip Bosco",
               "profile_path": "/8B8EQk868fQF8fGZ1w33XDV5Z1S.jpg",
               "id": 6541,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Carmen",
               "gender": 0,
               "credit_id": "53a12bda0e0a26654e002152",
               "name": "Michelle Grisom",
               "profile_path": null,
               "id": 1331570,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Frankie",
               "gender": 0,
               "credit_id": "53a12be90e0a266534001f21",
               "name": "Desmond Robertson",
               "profile_path": null,
               "id": 1329538,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Tiny",
               "gender": 0,
               "credit_id": "53a12bf70e0a26653a001f48",
               "name": "Tiny Mills",
               "profile_path": null,
               "id": 1331571,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Patty",
               "gender": 0,
               "credit_id": "53a12c080e0a26654b001f13",
               "name": "Shanelle Henry",
               "profile_path": null,
               "id": 1331572,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Michelle",
               "gender": 1,
               "credit_id": "53a12c390e0a2665370021c1",
               "name": "Michèle Lonsdale Smith",
               "profile_path": null,
               "id": 1331573,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Jerry",
               "gender": 0,
               "credit_id": "53a12c490e0a266541001eee",
               "name": "Sean Orr",
               "profile_path": null,
               "id": 1331574,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Emily",
               "gender": 1,
               "credit_id": "53a12c580e0a2665370021cf",
               "name": "Elizabeth Walsh",
               "profile_path": null,
               "id": 1331575,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45309251416c9102a49d",
               "name": "Andy Tennant",
               "profile_path": "/9gK8xFzybwDnWENijTdDHiP4M6o.jpg",
               "id": 17167,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45309251416c9102a4a3",
               "name": "Deborah Dean Davis",
               "profile_path": null,
               "id": 147476,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 6.59126,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 33689,
      "vote_count": 205,
      "budget": 0,
      "overview": "Identical 9-year-olds from very different backgrounds: orphaned Amanda and wealthy Alyssa meet at summer camp and decide to switch places -- and play matchmaker between Alyssa's dad, Roger, and the kind social worker who cares for Amanda.",
      "similar": [
         20352,
         12405,
         37135,
         9325,
         11224,
         44826,
         278927,
         196867,
         10719,
         10545,
         150689,
         399055,
         342473,
         11236,
         2252,
         2268,
         283366,
         21208,
         118340,
         206487
      ],
      "original_title": "It Takes Two",
      "runtime": 101,
      "poster_path": "/l67WJL3Mjce1yoEgL4HheR5v75D.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Dualstar Productions",
            "id": 6130,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Orr & Cruickshank",
            "id": 89131,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Rysher Entertainment",
            "id": 11661,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1995-11-17",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "Two identical strangers. Two different worlds. One perfect match.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Andy Tennant"],
      "runtime": 101,
      "synopsis": null,
      "writers": ["Deborah Dean Davis"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113442/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY3OTg1Nzk4OV5BMl5BanBnXkFtZTcwNDM3MTEyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Kirstie Alley, Steve Guttenberg, Mary-Kate Olsen | See full cast and crew »"],
      "reviews": [
         "The Olsen twins' best film to date, 'It Takes Two' is a very funny romantic comedy, where Mary-Kate plays orphan Amanda Lemmon, and Ashley plays rich-kid Alyssa Callaway, who trade places in hopes of 'hooking up' Alyssa's father Roger, and Amanda's minder Diane. Steve Guttenberg plays rich-man Roger Callaway (complete with butler and camp), who is due to marry Clarice Kensington (played by 'Friend's' lesbian, Jane Sibbet). But, when Amanda and Alyssa bump into eachother, they swap families in hopes of joining Roger with Diane (the Emmy award-winning Kirstie Alley). Mary Kate and Ashley are as cute as ever, Steve is fine (and really, that's all he is), Kirstie is great as Diane, but Jane is the best as the snotty Clarice. A great little comedy - and a must for Olsen twins fans.",
         "This has got to be one of the cutest movies i've seen. I love the way that they have one rich twin and one poor twin. the best part of the movie is when they are running through the woods screaming and the song hippie, hippie shake is playing. This is the best movie out of the olsen twins collection and i would recommend you see it giving it a 10/10.",
         "It takes two is an amazing and funny story about two identical girls, yet so different, Alyssa Callaway a rich girl, and Amanda Lemmon a orphan kid, together the perfect match. They meet each other at the orphan camp and decides to shift places. Alyssa Callaway gets adopted and unfortunately is Alyssas father about to marry another woman, and they make all the effort for that to fail, instead they try to lead the orphan camp leader, Diane Barrows and Alyssas father together, if that will succeed you're just going to have to watch the movie. I think it was a really good movie made by the Olsen twins, amazing how good they can though they are so young. I give it *** of ***** stars",
         "This is such a great movie for kids and adults! The cast is great, including Kirstie Alley, the nice but tough cookie women who works at the adoption agency. Steve Guttenberg, the nice rich father who is engaged to Clarise Kensington (Jane Sibbett), the woman you love to hate. Ashley Olsen plays Alyssa Callaway, daughter of Roger Callaway (Steve Guttenberg) and a very polite and lovely young lady. Mary-Kate Olsen plays Amanda Lemmon an orphan that goes to the camp Roger's late wife and Alyssa's mother built years ago. She is also very close with Diane Barrows (Kirstie Alley). When the two girls meet unexpectidly they decide to switch places so tough girl Amanda can get rid of Clarise, and smart and witty Alyssa can get rid of the ButtKisses, the odd family who wants to adopt Amanda. The girls try to succeed in getting Diane and Roger together before his marraige to Clarise, and get Diane and Roger to adopt Amanda before the ButtKisses can. Philip Bosco also stars as Vincenzo, the loveable sweet butler of the Calaway's who always gives Alyssa a lot of slack and benifit of the doubt when it comes to her little silly escapades. All and all this is a great movie for everyone to enjoy. Great Cast, Great Movie, and the Olsen Twins at their best. 9-10/10!",
         "I stumbled on this family film while channel surfing the other night. I happened to catch it right from the opening titles. The Olsen girls had me hooked from the first minutes. I couldn't stop watching this movie until the final credits rolled. Having raised two girls I was particularly tuned into the Olsen girls. I was blown away by how cute and funny and bright they were. And I thought the love story though predictable was tastefully handled and fairly intelligent. All in all a most enjoyable experience.",
         "I saw this movie back when I was 12; I liked it then, and still wouldn't mind seeing it again. Like all kids' movies, this movie has just a few corny kid moments that older viewers, especially teenagers, wouldn't prefer. But, unlike countless other movies, \"The Parent Trap\" included, this movie doesn't let all those annoying little things, like \"I love you, honey! I love you with all my heart!...\" get too far and make the viewer want to put a grim on his face and turn off the TV. They do it by using great acting skills by countless ingenious actors and actresses, and by not having a moment of nothing, but smiles, hugs, and extra-corny laughter get too long. Also, another advantage this movie has over \"The Parents Trap\", is that even 'though the main characters are both young girls, and one is an orphan in a group home, they are never portrayed as completely helpless, and in need of adult supervision; throughout the whole movie, all the adventures and gigs the girls think-up and go through they do with the help of no one, but themselves, and constantly help each other when either would get in a tough spot. The reason this is such a big advantage for this film is that in most real life, and most movies we see, all the main action is done and held by adults, and kids are treated as little and somewhat spoiled helpless creatures, who can't take care of themselves. This fact, often unconsciously, bores and sickens the audience, sometimes even bringing feelings of disgust towards kids. But in this movie, this problem is dealt with masterfully. Not only do kids here do things all on their own, but many times the adults, when in the same situation, look up to to them for help and advice. I thought this movie was made with a beautiful plot, truly great acting, very nice camera work, and, very importantly, very good character development: enough time is taken to introduce every important character's life before getting anywhere near the main idea of the movie. I would, personally, give this movie a 10/10, hands down.",
         "I watched \"It Takes Two\" twice and I would watch it another time I guess, but I don't think I would ever tape it. It's just not good enough. But it works perfectly. The movie centers at two cute and smart little girls, who are put in different dresses, different places, different environments and different situations in order to create this common changing-your-identities-humour, this time involving children. We also have a stereotypical villainess, played by Jane Sibbett, exactly this stepmother-in-spe from every child's nightmare. We've seen these characters plenty of times, but who cares, it's the character we want to see here. Another common device is to have one really good actor in a supporting role, why not in the role of a butler? Here we have Philip Bosco, doing all the things expected from the nice butler, doing a fine job. A good thing is that the movie also focuses on the Kirstie Alley character. Kirstie Alley is exactly the right actress to play a cool, slightly crazy and likeable female lead in harmless family entertainment. The point is that the movie uses the same humour, romance and conflict as usual, but skillfully enough, so it doesn't seem like copying. And that the two little girls are so smart that they manage to solve the conflict and get to that happy ending they want. That's what some people want to see and it has often been made much worse. The Olsen twins are alright here, we don't need the best child actresses you can possibly find in a movie like that. Cute, sympathetic and funny as they still are and as the movie just is, my rating is 8 (7,6?) out of 10.",
         "This movie was extremely funny. The Olsen twins did a great job acting.However there was a major flaw in the movie. It never really explained why Diane and Roger loved each other. They never seemed to be doing very much and they hardly even talked to each other. However the funny scenes and the twins very good acting covered up for this. All in all it was a great movie, especially for comedy lovers.",
         "This film is my best ever film. I've liked it since I fist watched it on tv and it passed the time away. The twins Amanda and Alyssa are so sweet. They think up of devious plans to break Clarice and Roger up so Roger and Dianne can get married. Amanda lives in an orphanage and Dianne is her social worker. Amanda loves Dianne so much and wants to be adopted by her. Dianne feels the same way too about Amanda but the authorities say that Amanda needs a family.It is the coolest film ever and anyone out there should watch it because it does make you laugh and cry.",
         "I thought that this movie was excellent. The twins made a really great job considering they were only 8 years old. I'd really recommend this video to anyone. The video is basically about two identical strangers Amanda Lemmon and Alyssa Calaway. Alyssa is this kid whose life is so perfect as her dad is rich. Were as Amanda is an orphan And looking for a new home. On this particular day Amanda is out with her friends and the come across Alyssa's house (which is really big) and starts saying that its haunted so as a bet Amanda goes to check it out. Anyway back at the Calaway house Alyssa decides to run away. So when Amanda goes to the house the butler thinks its Alyssa and brings her in. well from then on the two actually meet and swap places. Any way you'll just have to watch the video to find out what happens next."
      ],
      "genres": [
         "Comedy",
         "Family",
         "Romance"
      ],
      "productionCompanies": [
         "Dualstar Productions",
         "Orr & Cruickshank",
         "Rysher Entertainment"
      ],
      "summaries": [
         "Alyssa (a rich girl) and Amanda (an orphan) are two little girls who are identical, but complete strangers, that accidentally meet one day. In an attempt to stop Alyssa's father from getting married to Clarice, a conceded, know-it-all, the girls get him to meet Amanda's Case Worker and switch lives to stop the wedding once and for all. Though things don't go exactly as planned when Alyssa gets adopted and Clarice moves up the wedding...",
         "Two identical strangers meet accidentally. One is an orphan (Amanda) and the other a rich kid (Alyssa). Alyssa's father decides to get married to a real horror. So the kids switch to get rid of her. In the process, Alyssa father meets Amanda's case worker..."
      ],
      "budget": 0
   },
   "movielensId": 38,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-11-17",
      "dvdReleaseDate": "2002-06-11",
      "directors": ["Andy Tennant"],
      "runtime": 101,
      "movieId": 38,
      "title": "It Takes Two",
      "mpaa": "PG",
      "actors": [
         "Kirstie Alley",
         "Steve Guttenberg",
         "Ashley Olsen",
         "Mary-Kate Olsen",
         "Jane Sibbett",
         "Philip Bosco",
         "Michelle Grisom",
         "Desmond Robertson",
         "Tiny Mills",
         "Shanelle Henry",
         "Michèle Lonsdale Smith",
         "Sean Orr",
         "Elizabeth Walsh"
      ],
      "imdbMovieId": "0113442",
      "originalTitle": "It Takes Two",
      "genres": [
         "Comedy",
         "Family",
         "Romance"
      ],
      "youtubeTrailerIds": ["6PKq7YSpO6c"],
      "plotSummary": "Identical 9-year-olds from very different backgrounds: orphaned Amanda and wealthy Alyssa meet at summer camp and decide to switch places -- and play matchmaker between Alyssa's dad, Roger, and the kind social worker who cares for Amanda.",
      "tmdbMovieId": 33689,
      "avgRating": 2.89943,
      "releaseYear": "1995",
      "numRatings": 701,
      "posterPath": "/l67WJL3Mjce1yoEgL4HheR5v75D.jpg"
   }
}