{
   "tmdb": {
      "original_language": "fr",
      "keywords": [],
      "imdb_id": "tt0205735",
      "video": false,
      "title": "Criminal Lovers",
      "recommendations": [
         12480,
         46748,
         89608,
         99002,
         43657,
         4974,
         4973,
         48561,
         84442,
         160124,
         31227,
         72593,
         222071,
         178907,
         40071,
         144804,
         2566,
         51272,
         133980,
         49653
      ],
      "backdrop_path": "/vKoXwO4tGxbok3ekMcAwDY2U32F.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Alice",
               "gender": 1,
               "credit_id": "52fe453b9251416c9102bc07",
               "name": "Natacha Régnier",
               "profile_path": "/so9iXkL7FgvKNUJ40mJJuaHXjg1.jpg",
               "id": 59826,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Luc",
               "gender": 2,
               "credit_id": "52fe453b9251416c9102bc0b",
               "name": "Jérémie Renier",
               "profile_path": "/l939A74W04uQ7CAqN7WLgLq19RV.jpg",
               "id": 51325,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "L'homme de la forêt",
               "gender": 2,
               "credit_id": "52fe453b9251416c9102bc0f",
               "name": "Miki Manojlović",
               "profile_path": "/mIQ7f8wQ18AAGkrR7qMIsurosDM.jpg",
               "id": 48791,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Saïd",
               "gender": 2,
               "credit_id": "52fe453c9251416c9102bc13",
               "name": "Salim Kechiouche",
               "profile_path": "/r6RiOVg1ycVWHQclgqGRHLm2voF.jpg",
               "id": 38865,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Karim",
               "gender": 1,
               "credit_id": "52fe453c9251416c9102bc17",
               "name": "Yasmine Belmadi",
               "profile_path": null,
               "id": 19935,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Le professeur",
               "gender": 0,
               "credit_id": "52fe453c9251416c9102bc1b",
               "name": "Bernard Maume",
               "profile_path": null,
               "id": 231424,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Le gardien de nuit",
               "gender": 0,
               "credit_id": "52fe453c9251416c9102bc1f",
               "name": "Jean-Louis Debard",
               "profile_path": null,
               "id": 231425,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe453b9251416c9102bbfd",
               "name": "François Ozon",
               "profile_path": "/zcrMs8YX5f89Ax2mEDCtaLvwKiE.jpg",
               "id": 4387,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe453b9251416c9102bc03",
               "name": "François Ozon",
               "profile_path": "/zcrMs8YX5f89Ax2mEDCtaLvwKiE.jpg",
               "id": 4387,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe453c9251416c9102bc25",
               "name": "Pierre Stoeber",
               "profile_path": null,
               "id": 420757,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe453c9251416c9102bc2b",
               "name": "François Guillaume",
               "profile_path": null,
               "id": 19375,
               "department": "Sound",
               "job": "Sound Engineer"
            },
            {
               "gender": 0,
               "credit_id": "52fe453c9251416c9102bc31",
               "name": "Dominique Petrot",
               "profile_path": null,
               "id": 32229,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe453c9251416c9102bc37",
               "name": "Philippe Rombi",
               "profile_path": "/gXnt6Dj8kPlmtHvipvLHsGvcIlX.jpg",
               "id": 4403,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe453d9251416c9102bc3d",
               "name": "Arnaud de Mauleron",
               "profile_path": null,
               "id": 579258,
               "department": "Art",
               "job": "Set Decoration"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.810772,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 33828,
      "vote_count": 28,
      "budget": 0,
      "overview": "After a perverted impulse drives them to kill, Alice and her boyfriend, Luc, drag the body into the woods, only to find themselves hopelessly lost – much like the fairy-tale plight of Hansel and Gretel. Starving and with no hope of being found, they chance upon a dilapidated cottage where a hulking man takes them prisoner and proceeds to feed Luc's sexual appetite.",
      "similar": [],
      "original_title": "Les Amants Criminels",
      "runtime": 96,
      "poster_path": "/9l97jSu2O6jnhSXiqYROWVsXH63.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [],
      "release_date": "1999-08-17",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "Their idea of foreplay was murder",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["François Ozon"],
      "runtime": 96,
      "synopsis": "The movie begins with an explicit murder scene. We later learn high school student Alice (Natacha Régnier) convinced her lover, Luc (Jérémie Renier), to murder their classmate Saïd (Salim Kechiouche), whom she claims raped her with a group of his friends. After the murder they take Luc's parents' car and go off to rob a jewelry store. When they dispose of the body in the woods, the couple get lost on their way back to their car and are captured by a mysterious forest dweller (Miki Manojlovic). Matters take an even more bizarre twist when the stranger locks the young lovers in his basement and reveals that he plans to eat them. The movie shows the events that led up to the murder of their classmate and the ordeals the two lovers undergo in the cabin. Alice is very sexually active, but Luc is still a virgin. Sometimes it feels like a bizarre twist of Grimm's \"Hansel and Gretel\" in true François Ozon style.",
      "writers": [
         "François Ozon",
         "Marcia Romano"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0205735/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg0MjcyMjgyNF5BMl5BanBnXkFtZTcwNjg0NTUxMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Natacha Régnier, Jérémie Renier, Predrag Manojlovic | See full cast and crew »"],
      "reviews": [
         "It all looks simple, but what is going on in CRIMINAL LOVERS is complex. Ozon is adept at conveying the shifts in our emotions and clearly enjoys exploring our conflicted natures. Sexy Alice (Natacha Regnier), a manipulator of men, coerces the sexually uncertain Luc (Jeremie Renier) into murdering the handsome Said (Salim Kechiouche). Although getting rid of the body proves problematic, the couple's real problems begin when they take refuge in an old cottage in the forest. The owner of the cottage is Karim (Yasmine Belmadi), an odd fellow who develops a fondness for Luc and a hatred for Alice. Perhaps Alice is his competition? The film explores fascinating sexual territory, and even reminded me, tonally, of Japanese pink films such as WIFE TO BE SACRIFICED and CAPTURED FOR SEX 2. Ozon embraces the provocative subject matter with supreme confidence and never recoils from its inherent darkness. The erotic tension remains taut throughout and the performances are beautifully balanced. The photography is subdued but stylish and the forest setting echoes \"Hansel and Gretel\". There is great intelligence behind this adult fairytale and a willingness to explore sexuality and desire that is never hampered by the stench of political correctness that handicaps so much \"edgy\" material these days.",
         "When I was a child ,\"Hansel und Gretel\" used to scare me to death.Even if they finally succeed at escaping from the clutches of the witch,some fears never fade away.The fear of the unknown forest where any person can be an enemy.The fear of unknown people you meet in the dark corners of the streets .The fear of being kidnapped and taken away far from your family. When I saw \"les amants criminels \" for the first time ,I had the same sensation as when I read the fairytale ;rarely,I felt so ill-at-ease ,in need of fresh air :Ozon's sinister tale stirred my emotions ,my subconscious,some of my childhood fears that never went away.There are a lot of hints at childhood here:outside the Grimm tale,the heroine's name is Alice (on the other side of the mirror),and the scene near the cascade ,in its quietness, where the two lovers are surrounded by animals ,recalls some Disney movie. And mainly ,mainly ,Ozon ,among only a few contemporary directors, has completely understood Hitchcock's great lesson:expect the unexpected .After their crime,the two lovers start out ,as Janet Leigh did in 1960,and I dare you to guess what will happen then! Ozon is the most gifted contemporary French director.",
         "CAUTION!! Contains spoilers This is a strange story in that normal morals are suspended. We see the main characters, April and Luc, brutally kill Said, a schoolmate, in the opening scenes. While we are not eager to treat the pair as innocents, they are curiously child-like. Alice is a pretty girl who, like a small child, can be utterly cruel one moment and then tender the next. She ruthlessly plots the murder of a boy that she lusts after. She lies to get her virginal boyfriend to help her do the killing. Yet later, she cries when he accidentally runs over a rabbit in their get-away car. What's more, she anxiously insists that they bury the rabbit, while the murdered boy's body is still in the car trunk. In one telling scene, she is in a store to buy a shovel with which to bury the boy that they have killed. As she strolls leisurely past a display of Barbie dolls we see that they catch her interest. I half expected her to stop and buy a doll along with the shovel. Luc is Alice's virginal boyfriend. As we see from his brutal participation in the opening killing, he is not an innocent either. He is still a virgin, but that may be that he's gay and hasn't figured it out yet. When April tries to seduce him Luc pushes her away and we hear that this is not the first time that Luc `can't'. He has no trouble `sticking' Said. He stabs him brutally after watching longingly for a while. After their crime, Luc steals his family car and the young couple takes off to bury the body committing a petty theft at a jewelry store along the way. But all does not go as planned After burying the body in the woods, they become lost and end up discovering a rustic cabin in the woods, inhabited by an ogre or `man of the woods'. When they are caught stealing food, `The man' imprisons them in a cellar under the cabin. Later he brings Luc up from the cellar and locks Luc in a dog collar and fastens him to the bed by tying the end of the rope to the bed. The `man of the woods' looks vile and does gross things like skinning rabbits but seems to treat Luc gently and while he does molest Luc and eventually have anal sex with him these scenes are non-violent and its ambiguous as to how Luc reacts. Throughout, the movie is curiously nonjudgmental and a bit ambiguous which I thought made it interesting. It doesn't place any value judgments on the murder, nor about the homosexual leaning of Luc, nor of `the man' molesting him. It even makes `the man' out to be a bit benevolent (When Luc and April are escaping he opens his eyes at the last moment and looks knowingly at Luc but does nothing. The film does have its plot holes and these did bother me. Several times we see Luc straining `at the end of his rope' and yet the end is fastened to the bed with a very simple knot. Why doesn't he just untie the knot? When Luc escapes he doesn't cut himself out of the collar that the `the man' put on him. I can't decide if this was a practical point or a symbolic one. In the end, after Luc has rescued the girl, he can now perform sexually with her. Prior to that the most intimate things that he did with her was to do her hair and make-up.",
         "Francois Ozon has made a name for himself in modern foreign cinema for being more daring and more inventive than most directors would dare to be, and Criminal Lovers is a film that belongs towards the top of his already impressive list of director's credits. Criminal Lovers is a modernisation of the classic Hansel and Gretal tale, which is fused with the 'criminals on the run' theme of which such earlier films such as Badlands and Natural Born Killers utilised so well. Typically for Ozon, there is more to the film than just what it's plot presents and with this common theme the modern day genius has put together a multi-layered work of art, that will be seen differently by whoever sees it. On one hand, it's an exciting crime thriller, but on the other hand it's a tale of redemption, forgiveness and/or retribution. The way that you take the movie will definitely depend on your views on the movie's themes, such as the central one that depicts murder. The film is almost too skillful for it's own good, as it masks it's underlying themes behind it's visage of a shock movie; but if you're smart, they're more than evident. The man who dared to insert a musical number into a Rainer Werner Fassbinder screenplay hasn't exactly been reserved with the shocks in this movie, and the easily offended should still make sure that they steer clear of it. The film has homosexual undertones galore and the way that the murder happens, along with the amount of sex in the movie, isn't exactly restrained either. The acting is largely good, with the two leads, Natacha Régnier and Jérémie Renier, standing out the most. They both bring exactly the right mood to their characters, which are fascinating specimens in themselves. The way that Ozon has handled the screenplay is superb, as the dialogue is believable and so are all of the character's motivations. Making your audience believe you is one of the hardest things to achieve when penning a screenplay, and Ozon has proved time and time again that he is capable of doing just that. The idea of updating the classic children's story of Hansel and Gretal is definitely a good one, and this film draws much of it's appeal from that central backbone. All in all; kudos, Ozon!",
         "This is one of the most harrowing thrillers I have ever seen. It essentially is a retelling of the Hansel and Gretel legend, where the waifs are two French students fleeing the police after their brutal impulse slaying of an Arab student, and the wicked witch is a woodsman with cannibalistic and pederastic leanings. I am always surprised when movies like this get made, first, because of the outré nature of the plot, and secondly, because the directorial talent involved, coming, apparently, out of nowhere, seems too good to be true. The final scene, in which wide-eyed Disneyesque forest creatures preside over the coupling of the young lovers, left me giggling in appreciation. The movie is infused with this same inerrant sense of irony. Not a movie for the faint-hearted, though.",
         "A wonderful modern Hänsel and Gretel version by Francois Ozon, one of today's most interesting French filmmakers. Natacha Regnier (La vie rêvée des anges) is most impressive as the scheming and unscrupulous, yet at the same time strangely innocent and childlike schoolgirl Alice who brings her impotent boyfriend Luc (not-so impressive, though ok Jérémie Renier) to killing their handsome Arab schoolmate Said she is lusting for. As for her motivations, the Rimbaud quote (\"Un crime!...\") in one of the flashback scenes seems to tell the most about it. Maybe she also hates Said because he is sexually aggressive and at the same time very desirable to her - so he doesn't give her that complete control she has with Luc who is none-menacing to her in any way whatsoever. As for Luc, whose internal development we follow the closest in the story, I don't know exactly why he is able to perform sexually in the end (in a scene that seemed to me a kind of parody to 70s softcore porn movies) when first he couldn't. It is true, Alice was menacing and even false to him (in the beginning, she tells the blindfolded Luc that she has taken off her bra when in fact she hasn't, then she photographs him half naked and tells him playfully she would send the pictures to his parents) - but then, the Man of the Woods (Serbian actor Miki Manojlovic - it makes sense that this strange character is played by a foreigner) seems also to be dangerous, doesn't he? Or is it that the Man (contrary to Alice) doesn't expect anything of him, only to stay calm and let go - that's why this in neither way attractive person is the first Luc is able to enjoy sex with? As for Luc and Said, someone here has mentioned that Luc may desire Said for himself. Though this never gets clear, but there is a tell-tale scene when Luc goes to Said's boxing class and watches him for an important period of time, while we hear strange, hymnical music on the background score. This may indicate that Luc is indeed attracted to his sexy schoolmate, though he also 'knows' that Said and his friends did terrible things to Alice (things the girl made up in order to convince Luc to take part in the killing). I also found the motif of the rabbits very interesting: rabbits here are exchangeable for people, as the same things happen to human beings as to these animals. A rabbit gets killed and so does a human; a rabbit gets caught in a trap and so does a human; a rabbit is eaten... All in all a very interesting Ozon movie. And as always in his films, there is more behind it than one may notice at first sight...",
         "I like François Ozon. Or at least, I like the idea of François Ozon. I like his challenge to bourgeois morality in Sitcom - I like his attempt to integrate this challenge into a technically limiting format. However, when it comes to committing his ideas to celluloid, I don't think that Ozon's ideas quite work. Be it in his shorts for Gay Majorettes in Space or See the Sea, his pieces always come off as half-arsed, as if they'd been good ideas in his head but not on film. Les Amants Criminels/Criminal Lovers goes half way to resolving this problem. In it, we see three rather brilliant leading performances, from Natacha Régnier (La Vie Rêvée des Anges) and Jérémie Renier as the two amants and an utterly remarkable (and disturbing) one from Miki Manojlovic (Underground) as the man who traps them in the forest. Hence, the film has been described as twisted Hansel and Gretel, and that it certainly is. Whether or not it was Ozon's intention to write a modern-day fairy tale (or whether or not this comparison/allusion is important) is not clear. However, what is clear is that, on some level, he finds this funny. Therefore, the whole thing rests, to a certain extent, upon whether you share Ozon's sense of humour (remember, in Sitcom we had a rat providing the apparatus for Ozon's exposition of middle-class morés, thus introducing S&M and masturbation to the sitcom genre ... and thus attacking his whole sitcom allusion with it). I found myself laughing ... nervously, maybe, but I found it very, very funny. Chilling? Not particularly. Unsympathetic? Certainly - in fact, Regnier's character is brilliantly drawn as both repugnant and seductive. But this is also my main problem with the film, because, while it is very clever, with a great use of music and some lovely visual touches, on a human, psychological level, Ozon's film doesn't rise above the insight afforded to us by an average TV movie-of-the-week. Yes, the oppositions of the characters are clearly defined, but they're clearly defined in tabloid black-and-white. Alice may well represent the 'other' of Luc, but we are never invited to speculate (although speculate is all that we can do, given the lack of information). Luc is seduced; Alice is a neo-noir anti-heroine. But that's as far as it goes, and that's why 'Les Amants Criminels' can be no more than an interesting sideline, a piece of fluff, rather than anything more profound. Nevertheless, Ozon shows considerable visual flair, and great talent for a certain tension, and he always has that pretty sick sense of humour to fall back on should everything else fail.",
         "Story of love and death, with some American thriller sparkles and the flavor of Ozon, \"Amants criminels\" is trip in a dark universe, with strange cages and shadows of fears. In same aspects, it is a new adaptation of \"Dangerous Liaisons\". Also, it is a adaptations of brothers Grimm tales. But important are not the images, rabbits or forest man , the murder or the rats. It is only a room of Francois Ozon universe and relevant is the desire of director to discover the limits of a situation. Not the ways but the purpose. The evil girl for the other is basic object, the homoerotic scenes, the strange land, the race different, the games and the end, the cries and forms of affection are pieces of an interesting puzzle in which the purpose may be the catharsis. A cruel beautiful film. Cold, aggressive, nostalgic, sad and strange. A film about the ways of escape. And about their fragile substance.",
         "I can not say that this is a movie for all tastes, but if you feel watching a great classic kind of tale, then go for it! I hope you have a good time and even a few laughs. I really found it funny in some parts... I have to say I liked it very much!",
         "What's going on? How does this film only have an average of 6.3? The pacing is excellent, each nuance and revelation is revealed subtly, but it doesn't let up with it's consistent harshness. I love these movies that demonstrate human characteristics through a harsh exaggerated situation. The rather graphic sex scene at the end, juxtaposed with the swat team was great, as was the very last shot of the boy. Go Ozon!"
      ],
      "genres": [
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Fidélité Productions",
         "Arte France Cinéma",
         "StudioCanal"
      ],
      "summaries": [],
      "budget": 0
   },
   "movielensId": 3800,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1999-08-17",
      "dvdReleaseDate": "2001-08-14",
      "directors": ["François Ozon"],
      "runtime": 96,
      "movieId": 3800,
      "title": "Criminal Lovers",
      "mpaa": "",
      "actors": [
         "Natacha Régnier",
         "Jérémie Renier",
         "Miki Manojlović",
         "Salim Kechiouche",
         "Yasmine Belmadi",
         "Bernard Maume",
         "Jean-Louis Debard"
      ],
      "imdbMovieId": "0205735",
      "originalTitle": "Les Amants Criminels",
      "genres": [
         "Horror",
         "Thriller",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "After a perverted impulse drives them to kill, Alice and her boyfriend, Luc, drag the body into the woods, only to find themselves hopelessly lost – much like the fairy-tale plight of Hansel and Gretel. Starving and with no hope of being found, they chance upon a dilapidated cottage where a hulking man takes them prisoner and proceeds to feed Luc's sexual appetite.",
      "tmdbMovieId": 33828,
      "avgRating": 2.96825,
      "releaseYear": "1999",
      "numRatings": 63,
      "posterPath": "/9l97jSu2O6jnhSXiqYROWVsXH63.jpg"
   }
}