{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "future",
            "id": 2964
         },
         {
            "name": "chase",
            "id": 3713
         },
         {
            "name": "time travel",
            "id": 4379
         },
         {
            "name": "dystopia",
            "id": 4565
         },
         {
            "name": "immortality",
            "id": 4978
         }
      ],
      "imdb_id": "tt0104299",
      "video": false,
      "title": "Freejack",
      "recommendations": [
         10169,
         12088,
         10447,
         6341,
         10859,
         9409,
         6723,
         14854,
         9292,
         9569,
         19382,
         11718,
         9057,
         19384,
         9271,
         10163,
         9096,
         427910,
         9306,
         9873
      ],
      "backdrop_path": "/9RxkpkOEqFYtXEpoNlLgvHQFWpi.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 15,
               "character": "Alex Furlong",
               "gender": 2,
               "credit_id": "52fe44e0c3a36847f80af681",
               "name": "Emilio Estevez",
               "profile_path": "/2NSM4zFrw3i16UYdUhfETVjqC4I.jpg",
               "id": 2880,
               "order": 0
            },
            {
               "cast_id": 16,
               "character": "Victor Vacendak",
               "gender": 2,
               "credit_id": "52fe44e0c3a36847f80af685",
               "name": "Mick Jagger",
               "profile_path": "/nrGPcc3RAvS9OgsoKnRKD3ZoJCM.jpg",
               "id": 1428,
               "order": 1
            },
            {
               "cast_id": 17,
               "character": "Julie Redlund",
               "gender": 1,
               "credit_id": "52fe44e0c3a36847f80af689",
               "name": "Rene Russo",
               "profile_path": "/aaPzuXRHdyxamPMXqu70okPaqvB.jpg",
               "id": 14343,
               "order": 2
            },
            {
               "cast_id": 18,
               "character": "Ian McCandless",
               "gender": 2,
               "credit_id": "52fe44e0c3a36847f80af68d",
               "name": "Anthony Hopkins",
               "profile_path": "/btweZvSRBiE6jaMME93BSXeTQN6.jpg",
               "id": 4173,
               "order": 3
            },
            {
               "cast_id": 19,
               "character": "Mark Michelette",
               "gender": 2,
               "credit_id": "52fe44e0c3a36847f80af691",
               "name": "Jonathan Banks",
               "profile_path": "/s6K0lromCtmSTzuX9hig8OPiRsC.jpg",
               "id": 783,
               "order": 4
            },
            {
               "cast_id": 20,
               "character": "Brad Carter",
               "gender": 2,
               "credit_id": "52fe44e0c3a36847f80af695",
               "name": "David Johansen",
               "profile_path": "/hQq0pmBBcmapA8YPxsgnDuZnEAa.jpg",
               "id": 57116,
               "order": 5
            },
            {
               "cast_id": 21,
               "character": "Nun",
               "gender": 1,
               "credit_id": "52fe44e0c3a36847f80af699",
               "name": "Amanda Plummer",
               "profile_path": "/uICpVUj29yBcwCEGVZzE77FL98W.jpg",
               "id": 99,
               "order": 6
            },
            {
               "cast_id": 22,
               "character": "Eagle Man",
               "gender": 2,
               "credit_id": "52fe44e0c3a36847f80af69d",
               "name": "Frankie Faison",
               "profile_path": "/3717JOXK2Z8qelfyvScDGimfFBf.jpg",
               "id": 13936,
               "order": 7
            },
            {
               "cast_id": 23,
               "character": "Ripper",
               "gender": 2,
               "credit_id": "52fe44e0c3a36847f80af6a1",
               "name": "Esai Morales",
               "profile_path": "/qeOm5PAxV0vDg5l9l0oqZsZg7PR.jpg",
               "id": 65344,
               "order": 8
            },
            {
               "cast_id": 25,
               "character": "Newswoman",
               "gender": 1,
               "credit_id": "5a497c559251415ca4005653",
               "name": "Jerry Hall",
               "profile_path": "/reRiD86HiRI022KDmh1aOaBHCXU.jpg",
               "id": 3800,
               "order": 9
            },
            {
               "cast_id": 26,
               "character": "Additional Dialogue Replacement (voice)",
               "gender": 0,
               "credit_id": "5aaf544fc3a36846bd030944",
               "name": "Mickie McGowan",
               "profile_path": "/k7TjJBfINsg8vLQxJwos6XObAD6.jpg",
               "id": 84493,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44e0c3a36847f80af62f",
               "name": "Geoff Murphy",
               "profile_path": "/h9qts2xTEQyaI6ICnEcyLU69y7W.jpg",
               "id": 32277,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e0c3a36847f80af635",
               "name": "Robert Sheckley",
               "profile_path": null,
               "id": 43486,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e0c3a36847f80af63b",
               "name": "Steven Pressfield",
               "profile_path": null,
               "id": 41017,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e0c3a36847f80af641",
               "name": "Ronald Shusett",
               "profile_path": null,
               "id": 5046,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e0c3a36847f80af647",
               "name": "Dan Gilroy",
               "profile_path": "/aVUOK0drciJpy3vKI2XgjvoUvAM.jpg",
               "id": 57113,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e0c3a36847f80af64d",
               "name": "Gary Barber",
               "profile_path": "/hVdFCnxL2F1wuq7BdgMoxiGBzis.jpg",
               "id": 4507,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e0c3a36847f80af653",
               "name": "David Nicksay",
               "profile_path": null,
               "id": 8305,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44e0c3a36847f80af659",
               "name": "Stuart Oken",
               "profile_path": null,
               "id": 57114,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e0c3a36847f80af65f",
               "name": "James G. Robinson",
               "profile_path": null,
               "id": 4700,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e0c3a36847f80af665",
               "name": "Ronald Shusett",
               "profile_path": null,
               "id": 5046,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44e0c3a36847f80af66b",
               "name": "Trevor Jones",
               "profile_path": "/86HjonjMXwcDyOlpaQW1SVR9CXh.jpg",
               "id": 7020,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44e0c3a36847f80af677",
               "name": "Victor Nelli Jr.",
               "profile_path": "/uWDSdSTYnJLqK9Uav5vA2vpOOwn.jpg",
               "id": 57115,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e0c3a36847f80af67d",
               "name": "Dennis Virkler",
               "profile_path": null,
               "id": 5584,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "55780d449251413e3e0014d4",
               "name": "Amir Mokri",
               "profile_path": "/g8cqAlhr0o5iRESxrUuS5ahlFpr.jpg",
               "id": 1043831,
               "department": "Crew",
               "job": "Cinematography"
            }
         ]
      },
      "genres": [{
         "name": "Science Fiction",
         "id": 878
      }],
      "popularity": 6.803857,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9278,
      "vote_count": 114,
      "budget": 0,
      "overview": "Time-traveling bounty hunters find a doomed race-car driver in the past and bring him to 2009 New York, where his mind will be replaced with that of a terminally ill billionaire.",
      "similar": [
         76341,
         8810,
         63,
         605,
         604,
         19,
         281,
         198663,
         263115,
         59967,
         335984,
         87101,
         157350,
         49530,
         2134,
         9482,
         7512,
         865,
         9739,
         9381
      ],
      "original_title": "Freejack",
      "runtime": 110,
      "poster_path": "/qS3AfhwDLVpZVOr80kNxPHIv8gE.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Morgan Creek Productions",
            "id": 10210,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1992-01-17",
      "vote_average": 5.1,
      "belongs_to_collection": null,
      "tagline": "Don't let the future pass you by.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Geoff Murphy"],
      "runtime": 110,
      "synopsis": null,
      "writers": [
         "Robert Sheckley",
         "Steven Pressfield"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0104299/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM1NjUxOTg5OF5BMl5BanBnXkFtZTcwNjMxNTIyMQ@@._V1_SY317_CR9,0,214,317_AL_.jpg",
      "actors": ["Stars: Emilio Estevez, Mick Jagger, Rene Russo | See full cast and crew »"],
      "reviews": [
         "It may well be that this movie deserves the low praise it got from the IMDb voters, but then how many newer sci-fi movies getting higher scores have really done better? This 1992 flick has been sitting on my DVD shelf for some time now and I've decided to re-watch it after seeing the new sci-fi blockbuster \"The Island\" (I've seen some parallels between the two that brought \"Freejack\" back to my mind). Special effects notwithstanding, I still believe that the older movie comes out a winner. There is just that much of a better story telling, coherence, actor play and a general ambiance that makes \"Freejack\" a movie one would want to watch over and over again. The movie is WELL-DONE. It's driven by a simple plot yet its imagery is clear and consistent and the characters have enough development for the audience to care for. A definite must for any sci-fi movie collection.",
         "You know, one thing that really bothers me is the amount of people who just refuse to relax and watch a move without having to consider whether it should win an Oscar. I don't think Freejack was ever intended to be made for serious viewing - I think every actor in it at one time during the movie has got their tongue in their cheek. What you do get in this movie are some spectacular effects, and I'm not talking about the end when you could just as soon go get a sandwich rather than watch the 2001-type slideshow. It's just downright funny. Mick Jagger as the villain giving Emilio Estevez a \"headstart\" by counting 1-Mississippi, 2-Mississippi is priceless. David Johanson shines as the shyster in any timeframe. Rene Russo gives us an early indication of screen presence. So just relax and have fun with it.",
         "A surprisingly good film with excellent performances by its actors (particularly notable are the minor cameos by an Irish nurse and a street bum) and a good, solid plot. Mick Jagger does an excellent job as a bounty hunter and Rene Russo is at her best. Contains some good chase scenes involving a number of quirky military vehicles (Soviet reconnaissance cars and US FAVs) and a number of decent sized gunfights. Satisfying all across the board.",
         "\"Freejack\" has one of the more unique twists on time travel, with people of the present being snatched away from a certain death to the future. It also begins to develop a unique feel and look to it. However, it's slow in several spots and doesn't develop the imagery as well as it could. Emilio Estevez didn't seem right for the part, he looked and came across as a kid playing in a role meant for someone older and wiser. Rene Russo is wonderful as always, and Anthony Hopkins does the best he can with his limited character, but both of them are spent on the sidelines. The real surprise was Mick Jagger, who made a wicked villain. I wonder why he hasn't tried acting in more movies. \"Freejack\" has largely been forgotten, but it's still worth a look.",
         "This film has an interesting plot. A race car driver (Emelio Estevez) is about to die in a spectacular crash during a race, but a split second before the car disintegrates, his body is stolen from the car and transported to the future to be used by another person who is dying (played by Anthony Hopkins). Estevez escapes his body snatchers and is now lost in the future. One of the snatchers is portrayed by Mick Jagger (yes, the Rolling Stone). Jagger is not, repeat, NOT, an actor, although his performance in this film is much better than I expected. Estevez is (supposedly) an actor, yet I found his performance to be almost poor. Jagger actually out-acts Estevez in this film. Hopkins gives his usual wonderful performance, although his is actually a minor role in the film. Jagger, Estevez and Rene Russo as the previous (and maybe still?) girlfriend of Estevez are the major stars of this film. There are few special effects, most of which are merely OK. I believe that this film had a very low budget and it shows, yet it falls into the \"definitely not bad\" category.",
         "There have been many movies about time travel, but \"Freejack\" is quite unique. It portrays race-car driver Alex Furlong (Emilio Estevez) getting unwillingly transported to 21st century New York, where some people want to give his young body to aging Ian McCandless (Anthony Hopkins). Estevez, Hopkins, and Rene Russo all do fair jobs with their roles, but it's really impressive seeing Mick Jagger as the villain's henchman Victor Vacendak. I mean, every once in a while, a rock star shows up in a movie, but Jagger is really neat here. Gravitating between menacing and jolly, this must have been a role through which he got some satisfaction. So, this movie does have an interesting plot, but it's mostly worth seeing just to see Mick Jagger as a bad guy. Really cool. Amanda Plummer, John Shea and Esai Morales also appear.",
         "This is an awesome bit of cheese right here, with an awesome story, fantastic low budget effects and 2 amazing performances from Emilio Estevez and Rene Russo!. All the characters were fantastic, and it has plenty of action to excite you throughout, plus Emilio Estevez and Rene Russo are simply amazing in this!. Russo and Estevez had fantastic chemistry together, and i thought Mick Jagger was surprisingly good as one of the main villains, plus the ending was really cool!. The opening crash is actually somewhat disturbing, and i thought Emilo Estevez's acting was fantastic!, plus the supporting cast was great as well!. It keeps you guessing for the most part, with only a few predictable moments here and there, and the scene where Emilio Goes for David Johansen(Brad's help), is quite funny, plus Anthony Hopkins was good in his screen time!. I rented this mainly because i'm a huge fan of Estevez and Russo's, and i was expecting an average time waster at best however what i got was an awesome bit of cheese with an awesome story, fantastic low budget effects and 2 amazing performances from Estevez and Russo!, and i say it's a must see!. The Direction is great!. Geoff Murphy does a great job here, with fantastic camera work, awesome angles, using a great location, great use of colors, and keeping the film at an extremely fast pace!. The Acting is wonderful!. Emilio Estevez is AMAZING as always, and is amazing here, he is extremely likable, had an awesome sense of humor, had a great goofy charm, had excellent chemistry with Rene Russo, in my opinion was a wonderful choice to play this role, seemed to be enjoying himself, was fantastic in the acting department, and just did an amazing job overall!. (Estevez Rules!!).Rene Russo is stunningly gorgeous, and is AMAZING as always, she had excellent chemistry with Estevez, played it straight, had a very interesting character, did excellent in her dramatic scenes and just did an amazing job overall! (Russo Rules!). Mick Jagger is surprisingly very good here, as one of the villains, he had some cool one liners, was a lot of fun to watch, and i was honestly surprised by how good of a job he did!. Anthony Hopkins is good in his screen time he had a cool character, and was very interesting to watch, wished he had more screen time though.Jonathan Banks is good as the other villain, he did a good job. David Johansen,Amanda Plummer,Jerry Hall, and Grand L. Bush all do well in there small roles. Rest of the cast do fine. Overall this is a true underrated gem and i say it's a must see!. **** out of 5",
         "If Nothing else, This film certainly deserves points for its Ambitiousness. Director Geoff Murphy seems to be trying to make this a Good film, despite the fact that he has to work with a Poor story and awful performances. This is the Kind of film you forget about the moment you walk out of the theatre.And in the Case of this film, It would be amazing if you ever thought about it again. The Story goes like this...In 1991 race car driver Estevez is taken from a Race car moments before a blazing Crash and is hauled into the Year 2009.The Idea is a Businessman who is already dead????...wants to get into his body cause Estevez's ex love rene russo who now works for the Businessman still mops about her Ex Boyfriend Firstly Estevez and Jagger give awful performances...Jagger is so bad that he comes off as more amusing than terrifying...and Estevez is all wrong for this film,He simply cant do a Dramatic role,(and the scene where He trys to pretend he is Anthony Hopkins left me in Stitches).Rene russo isnt to bad,although her and Estevez are so mismatched in this film,that I can hardly imagine her spending 18 Years crying over him. Anthony Hopkins certainly made a Mistake doing this film,He gets a Huge demerit for this one.And some of the Effects in this film look downright cheesy.And a Lot of the Direction is poor.The Film have some Funny moments,But it is all a letdown. When it was release in early 1992...I rushed out to see it...Mostly at the prospect of seeing Jagger play a baddie...that was a Mistake..I didnt mind the Film,But I expected much Better I give this....3 out of 10",
         "Emilio Estevez is on the run in this not-too-futuristic movie about a Gran Prix driver who dies in a crash out on the race course....or did he? Turns out people can be transported into the future where even Coppertone with UVA sunblock 2,000,000 won't save your skin and it's everyone for themselves. Mick Jagger is the man being paid to deliver him to the man who wants Emilio's body. The first thing I ask myself is whether this movie is believable or not. The answer is possibly. The way our society is going, we are headed for those kind of planetary results. The movie, from the enjoyment side, is not bad (they could have had a better bad guy than Jagger). But it DOES get me to think: \"Is this what we're headed for?\" Man! I really hope not!",
         "OK, I'm a sci-fi movie buff. So I'm the type of person who'd like this film. But I do have some basic standards, and Freejack is just the right sort of campy flick, sort of a \"Blade Runner\" gone slumming. It's bad, but it's a good bad, if you're into cult classics. Who should see this film: -- sci-fi movie buffs, but don't go out of your way, oh and see Demolition Man too which is similar but better -- nobody else I enjoyed the film, but campy special effects and silly plot mean I can only give it a 6 out of 10."
      ],
      "genres": [
         "Action",
         "Crime",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": ["Morgan Creek Productions"],
      "summaries": [
         "Auto racer Alex Furlong is snatched by time travel, a split second before a fatal explosion, by Vasendak's 21st-century team of techies, who plan to sell his healthy body to an ailing rich man at McCandless Corporation, for a mind transfer. He escapes, but has no rights in this nightmare future of violence and sleaze. The story concerns his survival, and his attempt to revive his relationship with his fiancée Julie, now 15 years older and an executive at McCandless.",
         "Bounty hunters from the future transport a doomed race-car driver to 2009 New York, where his mind will be replaced with that of a dead billionaire."
      ],
      "budget": 30000000
   },
   "movielensId": 3802,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1992-01-17",
      "dvdReleaseDate": "2000-07-11",
      "directors": ["Geoff Murphy"],
      "runtime": 110,
      "movieId": 3802,
      "title": "Freejack",
      "mpaa": "R",
      "actors": [
         "Emilio Estevez",
         "Mick Jagger",
         "Rene Russo",
         "Anthony Hopkins",
         "Jonathan Banks",
         "David Johansen",
         "Amanda Plummer",
         "Frankie Faison",
         "Esai Morales",
         "Jerry Hall"
      ],
      "imdbMovieId": "0104299",
      "originalTitle": "Freejack",
      "genres": ["Science Fiction"],
      "youtubeTrailerIds": ["7Zxr-Y-5YyA"],
      "plotSummary": "Time-traveling bounty hunters find a doomed race-car driver in the past and bring him to 2009 New York, where his mind will be replaced with that of a terminally ill billionaire.",
      "tmdbMovieId": 9278,
      "avgRating": 2.53608,
      "releaseYear": "1992",
      "numRatings": 1580,
      "posterPath": "/qS3AfhwDLVpZVOr80kNxPHIv8gE.jpg"
   }
}