{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "surrealism",
            "id": 9887
         },
         {
            "name": "wild west",
            "id": 155573
         },
         {
            "name": "christ allegory",
            "id": 163540
         }
      ],
      "imdb_id": "tt0068659",
      "video": false,
      "title": "Greaser's Palace",
      "recommendations": [
         90015,
         92312,
         6974,
         226701,
         43443,
         67822,
         42712,
         58257,
         37451,
         43739,
         13383,
         43109,
         60400,
         30648,
         26167,
         52849,
         40365,
         72272,
         45690,
         21058
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Jesse",
               "gender": 2,
               "credit_id": "54e2326ac3a368454d008017",
               "name": "Allan Arbus",
               "profile_path": "/6DxLQ09V5YokE1l9rxTAIRbpmWQ.jpg",
               "id": 153619,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Seaweedhead Greaser",
               "gender": 0,
               "credit_id": "5512761992514148dd001a60",
               "name": "Albert Henderson",
               "profile_path": "/6MJrBpBpHYtemSHqGGeYmtkSHYT.jpg",
               "id": 156411,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Cholera",
               "gender": 1,
               "credit_id": "54e232d8c3a368455100898d",
               "name": "Luana Anders",
               "profile_path": "/7iFXDZV0NUkagIkmLVviFUqJpmb.jpg",
               "id": 77485,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Lamy 'Homo' Greaser",
               "gender": 0,
               "credit_id": "5512767392514148dd001a66",
               "name": "Michael Sullivan",
               "profile_path": null,
               "id": 504953,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Mr. Spitunia",
               "gender": 2,
               "credit_id": "54e232b9925141454f005851",
               "name": "Hervé Villechaize",
               "profile_path": "/v2cXeoiQra79GSet6W901B9Kns1.jpg",
               "id": 10343,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Indian Girl",
               "gender": 1,
               "credit_id": "54e232c5c3a368087b001f8e",
               "name": "Toni Basil",
               "profile_path": "/gKXRSWexAbL9g10IkcLrw6NhTsu.jpg",
               "id": 8964,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Morris",
               "gender": 2,
               "credit_id": "5512773a9251410701009122",
               "name": "Don Calfa",
               "profile_path": "/4jnB2f6ADtC7pIuvGCzuZUzQhAn.jpg",
               "id": 41262,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Small boy in covered wagon",
               "gender": 2,
               "credit_id": "5512775cc3a36801bb0032da",
               "name": "Robert Downey Jr.",
               "profile_path": "/1YjdSym1jTG7xjHSI0yGGWEsw5i.jpg",
               "id": 3223,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "The Woman",
               "gender": 1,
               "credit_id": "577962f0925141716600008f",
               "name": "Elsie Downey",
               "profile_path": null,
               "id": 1054821,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe48b29251416c750b0719",
               "name": "Robert Downey Sr.",
               "profile_path": "/6ITEZoNCgMweY7Sf6DxV4T5mkwG.jpg",
               "id": 59874,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "551277b992514103e9000db2",
               "name": "Robert Downey Sr.",
               "profile_path": "/6ITEZoNCgMweY7Sf6DxV4T5mkwG.jpg",
               "id": 59874,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "551277cbc3a3686161000ea7",
               "name": "Cyma Rubin",
               "profile_path": null,
               "id": 1445467,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "551277df92514148dd001aaf",
               "name": "Jack Nitzsche",
               "profile_path": null,
               "id": 7066,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "551277f0925141045c000f2c",
               "name": "Peter Powell",
               "profile_path": null,
               "id": 55845,
               "department": "Crew",
               "job": "Cinematography"
            }
         ]
      },
      "genres": [
         {
            "name": "Western",
            "id": 37
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 0.64511,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 90715,
      "vote_count": 10,
      "budget": 0,
      "overview": "A parable based on the life of Christ. This ain't your father's Bible story, full of references about the destruction of the world through massive constipation and a New Mexican setting.",
      "similar": [
         181886,
         4011,
         9473,
         935,
         196,
         13597,
         13448,
         1429,
         31011,
         1903,
         45612,
         15092,
         588,
         1018,
         627,
         2675,
         381283,
         22244,
         8202,
         264656
      ],
      "original_title": "Greaser's Palace",
      "runtime": 91,
      "poster_path": "/6cfxbpkQkueO80u7nciwopvDtQN.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Greaser's Palace Ltd.",
         "id": 49396,
         "origin_country": ""
      }],
      "release_date": "1972-07-31",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "He's got the boogie on his fingers & the hubba-hubba in his soul!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Robert Downey Sr."],
      "runtime": 91,
      "synopsis": null,
      "writers": ["Robert Downey Sr."],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0068659/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYzMjAzOTQ4OF5BMl5BanBnXkFtZTcwNDgwOTcxMQ@@._V1_SY317_CR10,0,214,317_AL_.jpg",
      "actors": ["Stars: Albert Henderson, Michael Sullivan, Luana Anders | See full cast and crew »"],
      "reviews": [
         "Greaser's Palace is a comical, chaotic, absurdist and surreal religious parody. It's like El Topo meets The Life of Brian. Alan Arrbus plays a strange messiah-like zoot-suited actor/singer/dancer called Jessy, who one day parachutes into a field close to a Western town where a host of odd characters hang out, the main one being a constipated chap called Seaweedhead Greaser, who runs the titular saloon. Jessy has some miraculous traits - he can walk on water and heals some of the locals by telling them: \"If you feel, you heal\". One of the most memorable scenes (and my favourite) is when Jessy approaches a group of people praying and says to them: \"I bring you a message. Exactly six miles north of Skagg Mountain in the Valley of Pain, there lives an evil devil-monster. His name is Bingo Gas Station Motel Cheeseburger With A Side Of Aircraft Noise And You'll Be Gary Indiana. And he loves to hurt people. The last time I saw Bingo Gas Station Motel Cheeseburger With A Side Of Aircraft Noise And You'll Be Gary Indiana, he told me what he wants to do. He wants to come down here and kill each and every one of you. But I said to him: 'Bingo, wait a minute!'. And the reason I said that is because I believe in you people. I believe you can do the job. I believe you can help each other. I believe you can make this world a better place to live in. That's it\".  If you haven't seen this film then it must go on your must-see list of films, category surrealism. Chaotic cineastes will approve.",
         "Movie Review: Sometimes in film a scene which is weird, horrifying or disturbing is carried to such an extreme that it transcends being grotesque and becomes beautiful. Jodorowsky's \"Santa Sangre,\" Fellini's \"Satyricon,\" and all of Lynch's films have moments like these. Unfortunately, \"Greaser's Palace,\" though it tries really hard, never quite goes from ugly duckling to swan. Weird, horrifying and disturbing (and sometimes hilarious) it is indeed, but the pieces in the puzzle never quite come together. I must say this, though, Robert Downey has made one hell of a riveting film. I couldn't turn away from my TV screen for an instant. The movie seems to be a rather loosely told version fo the passion of Christ, set in the wild west. There is a Christ figure (who arrives on earth rather anachronistically via a parachute wearing a pimp suit), some disciples (about 17 of them), a miracle or three (some walking on water, some raising of the dead, a little healing, a little stigmata, etc.), and the obligatory being nailed to a crucifix. However, I don't recall the rest of the plot being in the Bible. I'm not going to try and describe it, except to say that the Christ figure is a singer-dancer-actor going to Jerusalem, to get an audition with the great agent Morris. Indeed, in one scene he puts on a little song and dance routine for his disciples, but they aren't impressed with his performance until he starts screaming and bleeding from the holes that appear in his hands, at which point they applaud. The image of Christ as showman, rather than a shaman, is quite provocative, and the audience that is only satisfied when their savior is in pain seems to be a glimpse into human nature not often afforded the viewer of this film, which is filled with cartoony violence, stilted dialogue, and unnatural posturing. The fact that this hint of truth about what we really want out of entertainment (in an age when we pay $29.95 to watch the Ultimate Fighting Championship on Pay-Per-View, who wouldn't enjoy a little screaming and stigmata?) comes in the midst of all these people doing their best to act inhuman, or at least unhuman, may indicate that there is more to this film than meets the eye. But is the movie good? I'm not certain about how good or bad it is, but I know that I was mesmerized by it. There were so many disturbing, fantastic, and humorous things...A few that come to mind are: --Herve Villechaize as the diminutive gay man who has \"Jesus\" over for dinner and flirts with him. --Herve's \"wife,\" a bearded man in drag who angrily squeezes the Messiah's testicles after he refuses to sleep with the couple. --The woman who keeps getting shot throughout the film by an unknown assailant. --Mr. Greaser's intense orgasm and/or bowel movement which causes his palace to explode (I didn't understand either...). --Lamey Homo's description of the afterlife, \"I was swimming in a rainbow with naked babies, and I turned into a beautiful smile,\" which he repeats three times during the film (he keeps getting killed and brought back to life). --The Holy Ghost. --The Native American who gets his lower back problem fixed when the Messiah turns out to be not only the son of God, but also a fairly good chiropractor. --The savage beating of a transvestite nun by Lamey Homo and the monk. --Etc. Throughout the film I was continually trying to determine whether I was watching the work of a genius or a just a load of crap. I'm still not sure, but I know one thing; this movie is fascinating, and though it never really becomes more than the sum of its parts, they certainly are interesting parts. \"Greaser's Palace,\" is weird, funny, disturbing, gross, ugly, and strange, and I wholeheartedly recommend it. I guarantee you won't forget this film.",
         "Quite simply one of the odder incarnations of a Jesus story: in a desolate town in the middle of a borax desert in the late 19th century, where Herod has a serious case of constipation, the holy ghost is a cigar smoking actor under a white sheet with eye-holes and a mouth cutout, and Jesse aka Jesus wants to be a song and dance man. But the people won't let him be. Alan Arbus is dry and laid back in the role, always puzzled and not at all a mystery. Downey hit the high point of his career with this one, possibly the last movie he made without someone looking over his shoulder. I wish he'd the opportunity to continue exploring filmmaking of this type.",
         "A woman (Job, Everyman, or Adam/Eve, though she plays another rather more narrow character in this multiple/simultaneous role) suffers the slings and arrows of a cold vicious cosmos at the center of a hot barren desert. Ouch!, it hurts, it REALLY hurts!! Trust me on this..... she gets walloped! Including the worst pain a mother could endure. Greaser (Caesar) as absolute despot, runs the world in small, a dot on the map in the middle of this desert. He is inhumanly patient, ruthless, vicious, gleeful, cruel, capricious, and whimsical. Over the course of the film he personifies welds of any two of these traits. He has an entourage of minions, lackeys, and wannabes. They perform his bidding without question. The balance of the town residents have no power, but are at the complete mercy of Greaser (standing in not only for Caesar, ruler of the known world, but also personifying the indifferent, uncaring world and cosmos). But he has the worst case of constipation the world has ever seen. For all his power, and all the aid of the Mariachi brothers, and the shining love of his own mother who he keeps in a cage, - he can't make. People go about their business as best they can, - with many rather bizarre distractions. There is a transvestite nun, or the ugliest female nun ever imagined (taking THAT bromide to its extreme logical conclusion, one quite ridiculous, but somehow fitting in this picture). A rancher has vaguely necrophilic fantasies regarding the local First Peoples. Christ Jesus turns out to be a rather exceptional chiropractor. Our female heroine keeps getting kicked in the teeth, again and again, - and again for good measure. She seems stuck in the Old Testament. Greaser's perenially disappointing son, Lamy Homo, also gets this treatment at the hands of his own father. The sins of the fathers visited upon their sons, the errors of history repeating themselves from generation to generation. An old coot in a white dress nicknamed Petunia, but who's real name is Luci(fer) tempts our other protagonist, Jesse, who although is technically not a criminal, is treated as one. A guy in a Charlie Brown ghost sheet with two round black eyes cut out protests that his role is too small. A little game of chance takes forever....... That same Jesse arrives earlier in the film via an extreme wide establishing shot of a conestoga wagon rambling, creaking, and rumbling as it crawls across the desert plain. Just as it passes, - and the scene is sedate since there's nothing else happening,- Jesse arrives in the Old West from the top of the frame via a giant parachute, hits ground, dusts off his Zoot-suit, and unsurely gains some footing with some shuffling dance steps. He continues this perfect if uncertain timing over the plain, seeking..... something. He finds \"the agent Morris\", a poor excuse for John the Baptist in any century, who also sees other futures, since he seems to wish to protect his head by wearing a space helmet. In bemused/focused reverie, Jesse performs numerous miracles for the townsfolk;some of whom become cloyingly annoying. And for this receives the attention, and the rare(unique)if unspoken admiration of Greaser. He appears on Greaser's stage, to be approved or rejected by the audience. The female lead (Adam/Eve/Job/Everyman) takes on perhaps her most significant role as that of Judas. Long before the pointlessly cryptic DaVinci Code (an insult to both Catholicism, the whole of Christendom AND Leonardo DaVinci, not to mention the likely intelligence of any typically well-read history buff; and again another Hollywood flick filmed in MurkyVision!) - Downy Sr. presents the \"fact\" of the act between Jesse and Mary Magdeline; oddly, for a film so apparently zongo and off-center, the only major departure from general Christian orthodoxy. A bad one at that, but well,it was the 70s, it was spring, we were young..... The quietest scene in the entire film is perhaps the most powerful, - where Jesse is chastened by His Father - \"You... get... going!!!\", played by a perfectly cast, cloud-white bushy-haired, bushy-bearded, Amish-looking grandfather. All in the midst of spectacularly gory and absurd carnage. Sounds like the world to me. Despite all the couching in absurdest non-linear plotting, extreme violence SEEMING to be merely lurid and gratuitous, and the many bizarre characters and subplots to nowhere, this is really a very gripping, awesome, violent, fabulous, eye-catching, mind-catching, amusing, hilarious in places, and ultimately heart-rendering re-telling of the Passion of Christ. (NOT the second coming as this or that reviewer has stated.) There are two other scenes which vie with the Father/Son meeting for most powerful/compelling/affecting sequences in the film. I omit their descriptions to provide motive for your unfilled spare time. Repectfully, Larry Hiam",
         "\"Greasers Palace\" is a wacky and strange western filled with uneasy laughter. In the 70's, Robert Downey Sr. was known for his strange and bizarre humor. At times certain jokes make absolutely no sense. That's what makes his films so funny. The story concerns a Christ like man in a zoot suit, named Jesse. He's on his way to Jerusalem to be a singer. On the way viewers are introduced to many strange characters; a guy in a ghost suit, a man dressed as a nun, and a women who repeatedly gets shot. Jesse wants to sing at the Greaser's Palace lounge. The evil Seaweedhead Greaser and his daughter preside over the palace. They are very picky on who can preform there. Sr. Greasers son is accused of being gay and is killed by his father. Thank goodness for Jesse's miraculous powers as he's able to revive Sr. Greaser's son from the dead time and time again. In some aspects the film appears to be a parody of El Topo. It also has a Montey Python style of humor and wit. Who can forget the films outrageous musical numbers too? So if your looking for a strange, nonsensical, religious, western comedy; Greaser's Palace is a film you'll most likely enjoy!",
         "I'm sure there's no such thing as a perfect robert downey movie, but some are better than others; some Downey movies are even better than other movies, generally speaking - and for its best sequences & acting, this obscure, lysergic cinematic parable, rates as one of the most memorable & thought-provoking films I've ever discovered. Downey is super-Altman; the Christian satire is simultaneously Neitzschean & Brautiganesque - Allan Arbus is excellent. Downsides to the movie are several, & typical of this filmmaker - easily a third of the movie is incoherent boring & gratuitous - Downey's self-referential homages to family & friends are typical of independent filmmakers; Downey has literally taken this type of nepotism to the level of art, but it never succeeds, in any of his movies. Yet none of his other films achieve the kind of profundity this one at least occasionally does. & in spite of its excesses & shortcomings, the film brims with political & poetic energy & ideas. Quite probably this is the work of a director who thinks the raggedness & incoherence & navel-gazing are all enhancements, or at least necessary to The Experience (etc., etc.). Bow-tied think-tankers might remain unmoved by the delicate insights of Downey. But I'd have to go so far as to say Greaser's Palace stands as a far more compelling & visceral evocation of the drug dazed visionary daydreaming that preoccupied so many well-endowed minds in the sixties & very early seventies than do, e.g., Nicholson's 'Head' or Hopper's 'Last Picture Show'. Downey, Arbus & Co. at least have much more brain to fry.",
         "I saw this movie after midnight on a movie-channel, in a dark room. I really wasn't expecting much but somehow this strange and surreal film has a mood to it that very few movies have. Don't try to make sense of it ( I don't know if there is any ) Just relax, and take it in, and you'll see what I mean. Nothing in this movie is spelled out. It is a mystery. It's very funny, and it just leaves you with a feeling of having seen something very important and meaningful about life and death, but you're not sure what... My favourite spot in the movie is when \"our\" man is asked to give something to the followers, upon which he starts to hum a continuous tone. The \"disiples\" soon catches on and sings the tone to. He then leaves them, and they dare not stop this gift they have been given. Throughout the rest of the movie you can always hear them in the background or nearby, off camera, as the movie goes on with other things! And the closing scene with the setting sun, and the music/sound just had me mesmerized! I saw it only once, in 1986, and even today I often think about it. I wish I could buy it, but I haven't seen it anywhere. I really want to see it one more time. A MUST see !",
         "The first time I attempted to watch \"Greaser's Palace\", I turned it off. I'm not exactly sure why, but maybe the absurdest humor was just a bit too low key for my taste. Recently (roughly four years later), I decided to give it another go. Its one strange film (among the most bizarre produced in the States) and obviously a film of limited appeal. However, for fans of low key absurdest humor or the brief and bizarre vogue of acid westerns in the 70s, this is certainly worthwhile. For a film so arty and bizarre, its pretty entertaining. Like the finest surrealist comedies, the jokes are hilarious because they often seem to lack a punchline. In my mind, this is Robert Downey Jr's most successful film. \"Putney Swope\" was funnier, but it hasn't aged well and was pretty uneven. On the other hand, \"Greasers Palace\" is a more cohesive work. It has a relatively linear (if completely bizarre) storyline that operates on its own inner logic. The lack of explanations or origins for the characters and events just give the film a dreamlike flow. The characters and situations are memorably offbeat. The Christ character of this parable wears a zoot suit who lands in a western town from a parachute (love the occasional anachronisms). There's also a homosexual midget who keeps getting killed and than returning to life to describe his vision of Heaven (\"I was swimming in a rainbow with millions of babies... and they was naked... and then all of the sudden I turned into a perfect smile!\"). Not to mention a pre-\"Mickey\" Toni Basil as a topless dancer. I also appreciated seeing the underrated and talented Luana Anders. \"Greaser's Palace\" doesn't really have a lot of depth behind its allegory, but its quite entertaining for fans of surrealist dry humor. (7/10)",
         "Jesus comes back to the old west as a 1930's song-and-dance man in a zoot suit and takes on local strongman Mr. Greaser, whose struggles with constipation are painful to witness. I love this film. It will never be selected as entertainment for anyone's church youth group, but its fresh take on Christianity make for a wild and very original ride. Favorite moments: Lamey Homo protesting his dad, Mr. Greaser's, disciplinary methods, \"I dreamed I was swimmin' in a rainbow and there was millions of babies and they was naked...Dad? I don't want to die any more.\" Dad's response: \"Then behave yourself!\" Sibling rivalry on the part of the Holy Ghost protesting God the Father's refusal to let him take on some of God the Son's perks (like being crucified): \"You'll never know what I can do because you never give me a chance!\" Jesus healing the paralyzed man, who is seen later in the film crying, \"I can crawl again! I can crawl again!\" It took me a moment to identify which character was supposed to be Judas, until the woman settler, who goes through so many terrible disasters, began counting out thirty pieces of silverware. It is somewhat disjointed, and definitely sacrilegious in spots, but those drawbacks are very minor. This is an original, savagely funny film.",
         "Basically this movie is wacky. It features, Jesus Christ in a Zoot Suit, God in a black cowboy outfit and the Holy Ghost in a white sheet with eyeholes and a cowboy hat. Innana or at least what I believe to be the personification of Goddess-worship also is featured and almost killed several times by unknown assailants. Herve' Villechaize has an amusing homo- sexual role with Jesus and the overall best part has to do with Greaser's Bowel movements... A must see for David Lynch fans."
      ],
      "genres": [
         "Comedy",
         "Western"
      ],
      "productionCompanies": ["Greaser's Palace Ltd."],
      "summaries": ["A parable based on the life of Christ. This ain't your father's Bible story, full of references about the destruction of the world through massive constipation and a New Mexican setting."],
      "budget": 0
   },
   "movielensId": 3803,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1972-07-31",
      "dvdReleaseDate": "2000-07-11",
      "directors": ["Robert Downey Sr."],
      "runtime": 91,
      "movieId": 3803,
      "title": "Greaser's Palace",
      "mpaa": "",
      "actors": [
         "Allan Arbus",
         "Albert Henderson",
         "Luana Anders",
         "Michael Sullivan",
         "Hervé Villechaize",
         "Toni Basil",
         "Don Calfa",
         "Robert Downey Jr.",
         "Elsie Downey"
      ],
      "imdbMovieId": "0068659",
      "originalTitle": "Greaser's Palace",
      "genres": [
         "Western",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A parable based on the life of Christ. This ain't your father's Bible story, full of references about the destruction of the world through massive constipation and a New Mexican setting.",
      "tmdbMovieId": 90715,
      "avgRating": 3,
      "releaseYear": "1972",
      "numRatings": 44,
      "posterPath": "/6cfxbpkQkueO80u7nciwopvDtQN.jpg"
   }
}