{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "college",
            "id": 3616
         },
         {
            "name": "sorority",
            "id": 10058
         },
         {
            "name": "university",
            "id": 13160
         },
         {
            "name": "sex comedy",
            "id": 170827
         },
         {
            "name": "sorority house",
            "id": 194236
         }
      ],
      "imdb_id": "tt0079257",
      "video": false,
      "title": "H.O.T.S.",
      "recommendations": [
         42298,
         93212,
         43796,
         67394,
         20278,
         38134,
         68171,
         28138,
         78325,
         100697,
         23045,
         12649,
         33734,
         42517
      ],
      "backdrop_path": "/8SIXWtGRhQvtcjABNoDo2vvY30m.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Honey Shayne",
               "gender": 1,
               "credit_id": "52fe4984c3a36847f819e845",
               "name": "Susan Kiger",
               "profile_path": "/agj6bdsixjQEfLLG80j27CwFQf5.jpg",
               "id": 200298,
               "order": 0
            },
            {
               "cast_id": 27,
               "character": "O'Hara",
               "gender": 1,
               "credit_id": "56e764c79251410926000914",
               "name": "Lisa London",
               "profile_path": "/1ni5vic163eJQeLM7wZgzfe8VUK.jpg",
               "id": 60152,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Teri Lynn",
               "gender": 1,
               "credit_id": "52fe4984c3a36847f819e84d",
               "name": "Pamela Jean Bryant",
               "profile_path": "/43sR31ONqcjYhLkFr4LtVTm8OKy.jpg",
               "id": 228958,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Sam",
               "gender": 0,
               "credit_id": "52fe4984c3a36847f819e851",
               "name": "Kimberly Cameron",
               "profile_path": "/jj7VhHKeZ93gfUEUIcWQlqAO5yl.jpg",
               "id": 228959,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Clutz",
               "gender": 1,
               "credit_id": "52fe4984c3a36847f819e855",
               "name": "Mary Steelsmith",
               "profile_path": "/qW63OkdmmqcAgK8b6Ja1cThUjiO.jpg",
               "id": 228960,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Boom-Boom Bangs",
               "gender": 1,
               "credit_id": "52fe4985c3a36847f819e86d",
               "name": "Angela Aames",
               "profile_path": "/u76XgPVGkToA1yyhd78HtYcGjQH.jpg",
               "id": 45463,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Conchita",
               "gender": 0,
               "credit_id": "52fe4984c3a36847f819e859",
               "name": "Marjorie Andrade",
               "profile_path": null,
               "id": 228962,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Debbie",
               "gender": 0,
               "credit_id": "52fe4985c3a36847f819e85d",
               "name": "Cece Bullard",
               "profile_path": null,
               "id": 228963,
               "order": 7
            },
            {
               "cast_id": 28,
               "character": "Candi",
               "gender": 0,
               "credit_id": "582bfada92514111b4004762",
               "name": "Karen Smith",
               "profile_path": null,
               "id": 101967,
               "order": 8
            },
            {
               "cast_id": 29,
               "character": "Melody Ragmore",
               "gender": 0,
               "credit_id": "582bfae592514111bb00439b",
               "name": "Lindsay Bloom",
               "profile_path": "/AiUJQ31YSNldJ3Ukq5kjqujgUq5.jpg",
               "id": 105078,
               "order": 9
            },
            {
               "cast_id": 30,
               "character": "Cynthia",
               "gender": 0,
               "credit_id": "582bfaf292514111c0004635",
               "name": "K.C. Winkler",
               "profile_path": null,
               "id": 1709423,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Richie Walker",
               "gender": 2,
               "credit_id": "52fe4985c3a36847f819e871",
               "name": "Danny Bonaduce",
               "profile_path": "/2NmscaLKD0FHphQvL7pSe5gTRCQ.jpg",
               "id": 75315,
               "order": 12
            },
            {
               "cast_id": 13,
               "character": "John",
               "gender": 0,
               "credit_id": "536c0ed90e0a2647ce00c476",
               "name": "Steve Bond",
               "profile_path": "/tqREHRvviyVp5aBLUcoGBVtTxV2.jpg",
               "id": 152705,
               "order": 13
            },
            {
               "cast_id": 14,
               "character": "Doug",
               "gender": 2,
               "credit_id": "536c0f1e0e0a2647c400cbc8",
               "name": "Donald Petrie",
               "profile_path": "/skokYnTDYIKogfeH7DU49dfhRsj.jpg",
               "id": 18281,
               "order": 14
            },
            {
               "cast_id": 15,
               "character": "Mad Dog",
               "gender": 2,
               "credit_id": "536c0f320e0a2647d400c70b",
               "name": "Larry Gilman",
               "profile_path": null,
               "id": 12980,
               "order": 15
            },
            {
               "cast_id": 17,
               "character": "Macho Man",
               "gender": 0,
               "credit_id": "536c0f6c0e0a2647c400cbcf",
               "name": "David Gibbs",
               "profile_path": null,
               "id": 1317731,
               "order": 16
            },
            {
               "cast_id": 18,
               "character": "Big Boy",
               "gender": 0,
               "credit_id": "536c0f8a0e0a2647c800cda3",
               "name": "Marvin Katzoff",
               "profile_path": null,
               "id": 1081815,
               "order": 17
            },
            {
               "cast_id": 19,
               "character": "Hunk",
               "gender": 0,
               "credit_id": "536c0f9c0e0a2647d400c713",
               "name": "Talmadge Scott",
               "profile_path": null,
               "id": 1317732,
               "order": 18
            },
            {
               "cast_id": 20,
               "character": "Dean Larry Chase",
               "gender": 2,
               "credit_id": "536c0fba0e0a2647c800cda5",
               "name": "Ken Olfson",
               "profile_path": null,
               "id": 81902,
               "order": 19
            },
            {
               "cast_id": 31,
               "character": "Stephanie",
               "gender": 1,
               "credit_id": "5a6945099251414a2b0095ea",
               "name": "Sandy Johnson",
               "profile_path": "/5x2LWHYLz9uIVGoHYFBFwhyhRst.jpg",
               "id": 15518,
               "order": 20
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4985c3a36847f819e863",
               "name": "Gerald Seth Sindell",
               "profile_path": null,
               "id": 1129542,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4985c3a36847f819e869",
               "name": "W. Terry Davis",
               "profile_path": null,
               "id": 1129543,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "54dfd9c5c3a368454b003ded",
               "name": "Cheri Caffaro",
               "profile_path": "/56m29Y9MD2lhm9M9d4tZMFGH7rP.jpg",
               "id": 558148,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "54dfd9da92514119560042ff",
               "name": "Joan Buchanan",
               "profile_path": null,
               "id": 1427284,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "54dfd9fbc3a368537a003a19",
               "name": "Don Schain",
               "profile_path": null,
               "id": 38696,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "54dfda0b9251411956004304",
               "name": "Gerald Seth Sindell",
               "profile_path": null,
               "id": 1129542,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "54dfda20c3a36855c7001f30",
               "name": "Cheri Caffaro",
               "profile_path": "/56m29Y9MD2lhm9M9d4tZMFGH7rP.jpg",
               "id": 558148,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "54dfda309251411956004311",
               "name": "Harvey Genkins",
               "profile_path": null,
               "id": 110718,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 1.952348,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 59181,
      "vote_count": 11,
      "budget": 0,
      "overview": "Four girls spurned by the popular Sorority on campus decide to start their own and steal all the men on campus away from the house that rejected them.",
      "similar": [
         325133,
         10760,
         20453,
         8469,
         9285,
         8923,
         62211,
         8065,
         489,
         12620,
         37247,
         2770,
         8835,
         52449,
         10358,
         10193,
         5559,
         291870,
         114150,
         6957
      ],
      "original_title": "H.O.T.S.",
      "runtime": 98,
      "poster_path": "/rB9pJnCn5LAsFL14ROlp9PEjQar.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "The Great American Dream Machine Movie Company",
         "id": 46609,
         "origin_country": ""
      }],
      "release_date": "1979-05-01",
      "vote_average": 4.8,
      "belongs_to_collection": null,
      "tagline": "Some like it H.O.T.S.!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Gerald Seth Sindell"],
      "runtime": 98,
      "synopsis": null,
      "writers": [
         "W. Terry Davis",
         "W. Terry Davis"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0079257/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU1NTE4NjcwNF5BMl5BanBnXkFtZTcwMzM3OTY0MQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Susan Kiger, Lisa London, Pamela Jean Bryant | See full cast and crew »"],
      "reviews": [
         "If you watched this film for the nudity (as I did) you won't be disappointed. I could have done without the bumbling crooks or the bear though. Some bottomless nudity could have be shown but for what it was I think H.O.T.S. has to be the best of its genre. It is not the sort of film that could have been made today which is a pity because it is the sort of film that is worth watching in these times. I would take mindless nudity over pivotal plot points any day. It is a shame that the DVD doesn't have any extras but as they didn't have DVDs when this was filmed that is understandable. I would have like to know more about the shooting of the film especially where they shot the football match at the end.",
         "This HAS to be my guilty pleasure. I am a HUGE fan of 80's movies that were designed to entertain and they didn't care if they offended anyone. This move has no meat, not substance, no deep thought provoking scenes. Just plain old college kids having fun and if a few breasts have to be shown, then so be it! This movie is for when you just want to relax and NOT think. Viva la nudity!",
         "Mix old-time Burlesque, \"jiggle\" TV and the basic plot of \"Animal House\", and you've pretty much summed up this example of \"B\" movies at the time Reagan became President. Of all the \"Animal House\" imitators, \"H.O.T.S.\" is probably the best. Don't watch it for great acting, writing or directing, but don't expect to spend a lot of time with your finger on the \"Fast Forward\" button either. If all you've seen is the USA edit, you've missed what is the essence of the film - beautiful topless women. It's not so much sexploitation as it is an update of the kind of show Grandpa saw in the big city when Grandma wasn't along. Not only the light, breezy attitude toward nudity, but the jokes, the pies, the seltzer, the animal acts - even two baggy-pants comics.",
         "This film is a throwback to the pre-siliconized days of Hollywood. We here at the academy admire the blossoming of natural talent as it explodes onto the screen. The film centers around the exploits of a bevy of buxom beauty outcasts (Susan Kiger, Pamela Jean Bryant, Kimberly Cameron, Lisa London, Angela Aames) as they form a sorority. Their nemesis is the snobby sorority with its buxom beauties (Lindsay Bloom, K.C. Winkler). College hijinks prevail as the film brings forth the truth about typical sorority behavior: showering, topless sunbathing, topless skydiving, wet T-shirt contests, outsmarting the pesky dean, and strip football. That's right, strip football: score a TD and the opposing team loses an article of clothing. This definitely is an Eye Candy Hall of Fame moment and causes us to reflect that they don't make movies like this anymore. As football fans it pains us to actually hope for a weak pass rush and lapses in the secondary coverage for both teams. Fire up the grill, open a beer, and enjoy the game.",
         "I saw this several years ago on the Playboy channel. It featured a few Playmates (Kiger & Bryant--an Indianapolis native), a future T.V. sidekick of Mike Hammer (Bloom) and a has-been child star (Bonaduce) all frolicking in the highjinks of college. Throw in a Hattie McDaniel/Lillian Randolph type maid for comedy relief, lots of boobies and some strip football and you have all the makings of a classic drive-in movie. H.O.T.S. was made after the success of National Lampoon's Animal House, and in some ways was better--more or less because of the girlies. While the plots not memorable (poor girls getting even with rich vixens) it does have its classic moments like the pie fight from a hot-air balloon, nude skydiving--performed wonderfully by the late Angela Aames, the real life bear scenes and the strip football game. Not a movie to watch with your wife/girlfriend/concubine/lover, but instead one to watch with a buddy or several guys over a six-pack, pizza and snacks.",
         "Topless touch football!! A wet t-shirt contest!! A jockstrap raid!! This \"SheAnimal House\" has it all. Except a plot and good actors. The film consists of several pranks and catfights between the H.O.T.S. girls and the bitchy PI house. The dialouge is a scream and the soundtrack is sublimely brilliant. Over the past couple of months it's been popping up all over cable, so do yourself a favor and watch out for it. H.O.T.S. is so bad it's good!",
         "H.O.T.S. is a fun film for a trip back to when skin flicks had a more positive fun-filled agenda. They were made simply to titillate and have a few laughs. Everything seems less cynical and jaded. The girls all have natural figures and some are Playboy playmates. The simple plot deals with a group of young women who open a non-sanctioned sorority house to get back at the snooty sorority girls who spurned and insulted them. Instead of the mean spirited tricks of today, most of the hijinks are simply innocent fun. The women are decent actresses for this genre and are mostly very attractive. To keep our attention between the topless scenes, we have mafia henchmen, a stolen bear, a hot air balloon, a funky house mother, and the cheapest robot ever seen. There's even Danny Bonnaducci of the Partridge Family. If you have a sense of humor then let yourself go and enjoy some light entertainment.",
         "I remember hearing about this movie and how it played at nearly every drive-in theatre here in Toronto. It's about a group of girls that are not accepted by the other sororities at their college, so they start up their own, and of course call it H.O.T.S. It's a fun movie, that is just bursting with drive-in nostalgia! Lots of fully endowed t-shirts, vans, fighting, and a football game showdown like no other! It's been compared to \"Animal House\", which is a good movie in it's own right, but to me nothing compares to H.O.T.S. It has it's own brand of fun & character. If you are looking for a classic T n'A movie, look no further because the H.O.T.S. girls are to the rescue, boom-boom shorts & all!",
         "While anyone who claims to have watched this movie simply for the Danny Bonaduce shots is clearly in denial of their libido, it is indeed a fine performance, meaning pleasurably hideous. Danny is some kind of semi-famous celebrity MC here in the movie, which makes you wonder if he wasnt playing himself in this role, so to speak. The shining moment of this movie, outside of the nude scenes, is when Danny gets onstage with his band to sing a song called \"Shake it Baby,\" a song which really has no other words than those. And who can ever forget the scene in which Danny Bonaduce (Richie) finds himself in bed with a live seal and enjoying the action? God knows I have tried to forget, but it is stained on my retina. There are lots and lots and lots of flopping, nude women in this movie, which serves its purpose rather well I guess. However, when you are done looking at the girls, some scenes to watch out for are: robot maid enters sorority house to find the secret cache of stolen money, extra large nude woman saves the day in a hot air balloon, and perhaps the strangest -- girls make hundreds of dollars selling \"pies\" consisting only of whip cream on a plate with glued-on nude sorority girl pictures. If for nothing else, apart from the Bonaduce madness and the kooky bumbling crooks, you have to see this movie to observe the unmeasurable extremes filmmakers will go to in trying to justify what is patently gratuitous nudity. Strip football?",
         "It's not Citizen Kane, but it does deliver. Cleavage, and lots of it. Badly acted and directed, poorly scripted. Who cares? I didn't watch it for the dialog."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["The Great American Dream Machine Movie Company"],
      "summaries": ["College exploitation film focusing on the wild escapades of the women of H.O.T.S. Sorority. The antics include but are certainly not limited to a wet t-shirt contest, a sky-diving episode, plenty of fraternity boys and even a house-keeping robot. Can the girls of H.O.T.S. overcome the scrutiny of their unliberated student counterparts and the University Administration as they unknowingly become the focus of bumbling crooks?"],
      "budget": 0
   },
   "movielensId": 3804,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1979-05-01",
      "dvdReleaseDate": "2000-07-11",
      "directors": ["Gerald Seth Sindell"],
      "runtime": 98,
      "movieId": 3804,
      "title": "H.O.T.S.",
      "mpaa": "R",
      "actors": [
         "Susan Kiger",
         "Lisa London",
         "Pamela Jean Bryant",
         "Kimberly Cameron",
         "Mary Steelsmith",
         "Angela Aames",
         "Marjorie Andrade",
         "Cece Bullard",
         "Karen Smith",
         "Lindsay Bloom",
         "K.C. Winkler",
         "Danny Bonaduce",
         "Steve Bond",
         "Donald Petrie",
         "Larry Gilman",
         "David Gibbs",
         "Marvin Katzoff",
         "Talmadge Scott",
         "Ken Olfson",
         "Sandy Johnson"
      ],
      "imdbMovieId": "0079257",
      "originalTitle": "H.O.T.S.",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Four girls spurned by the popular Sorority on campus decide to start their own and steal all the men on campus away from the house that rejected them.",
      "tmdbMovieId": 59181,
      "avgRating": 2.23148,
      "releaseYear": "1979",
      "numRatings": 162,
      "posterPath": "/rB9pJnCn5LAsFL14ROlp9PEjQar.jpg"
   }
}