{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "monster",
            "id": 1299
         },
         {
            "name": "step mother",
            "id": 5921
         },
         {
            "name": "walrus",
            "id": 7240
         },
         {
            "name": "arctic",
            "id": 8721
         },
         {
            "name": "stop motion",
            "id": 10121
         },
         {
            "name": "minotaur",
            "id": 10166
         },
         {
            "name": "seagull",
            "id": 10430
         },
         {
            "name": "potion",
            "id": 14752
         },
         {
            "name": "wasp",
            "id": 14793
         },
         {
            "name": "baboon",
            "id": 18161
         },
         {
            "name": "sailor",
            "id": 41599
         },
         {
            "name": "saber-toothed tiger",
            "id": 158017
         },
         {
            "name": "ghoul",
            "id": 158729
         },
         {
            "name": "troglodyte",
            "id": 191414
         },
         {
            "name": "sword and sorcery",
            "id": 234213
         }
      ],
      "imdb_id": "tt0076716",
      "video": false,
      "title": "Sinbad and the Eye of the Tiger",
      "recommendations": [
         17897,
         15515,
         27726,
         28763,
         18993,
         26398,
         848,
         29882,
         44126,
         10725,
         28752,
         49299,
         58902,
         40480,
         25473,
         43716,
         19143,
         831,
         21454,
         16441
      ],
      "backdrop_path": "/55g7Kwkh5yIGGCrIUdp2Tcnkpt2.jpg",
      "revenue": 16000000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Sinbad",
               "gender": 2,
               "credit_id": "52fe44a59251416c7503c0eb",
               "name": "Patrick Wayne",
               "profile_path": "/plZJV39nkOfo9kGEzmkvZKz19rU.jpg",
               "id": 30560,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Dione",
               "gender": 2,
               "credit_id": "52fe44a59251416c7503c0ef",
               "name": "Taryn Power",
               "profile_path": "/btNk9gFEwfIgBaSMkSOQ6VZN0Cj.jpg",
               "id": 37916,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Zenobia",
               "gender": 1,
               "credit_id": "52fe44a59251416c7503c0f3",
               "name": "Margaret Whiting",
               "profile_path": "/4Sg5E98WYV304E7txa75BReav3H.jpg",
               "id": 70983,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Princess Farah",
               "gender": 1,
               "credit_id": "52fe44a59251416c7503c0f7",
               "name": "Jane Seymour",
               "profile_path": "/tBWYbLSieHshqVhy1EXlv12mBjs.jpg",
               "id": 10223,
               "order": 3
            },
            {
               "cast_id": 17,
               "character": "Melanthius",
               "gender": 2,
               "credit_id": "5412ef6ac3a3682f700012c6",
               "name": "Patrick Troughton",
               "profile_path": "/97DI8IZkVYhoafymFrcHNsPHsil.jpg",
               "id": 11840,
               "order": 4
            },
            {
               "cast_id": 18,
               "character": "Rafi",
               "gender": 2,
               "credit_id": "5412ef770e0a2673170012e4",
               "name": "Kurt Christian",
               "profile_path": null,
               "id": 114644,
               "order": 5
            },
            {
               "cast_id": 19,
               "character": "Hassan",
               "gender": 2,
               "credit_id": "5412ef84c3a3682f5900138a",
               "name": "Nadim Sawalha",
               "profile_path": "/94kMNtU2FYXruX4BOOjWrWkoe2x.jpg",
               "id": 2980,
               "order": 6
            },
            {
               "cast_id": 20,
               "character": "Kassim",
               "gender": 2,
               "credit_id": "5412ef93c3a3682f62001331",
               "name": "Damien Thomas",
               "profile_path": "/20FTy5dMhGuku6H9vn8DyR7XWsB.jpg",
               "id": 26679,
               "order": 7
            },
            {
               "cast_id": 21,
               "character": "Balsora",
               "gender": 2,
               "credit_id": "5412efa10e0a26731f00141f",
               "name": "Bruno Barnabe",
               "profile_path": null,
               "id": 24742,
               "order": 8
            },
            {
               "cast_id": 22,
               "character": "Zabid",
               "gender": 2,
               "credit_id": "5412efae0e0a26731f001421",
               "name": "Bernard Kay",
               "profile_path": "/taBW6OtvfAxB6Gl4JrHz7KYtFuC.jpg",
               "id": 63000,
               "order": 9
            },
            {
               "cast_id": 23,
               "character": "Minoton",
               "gender": 2,
               "credit_id": "567454b9c3a368168e000169",
               "name": "Peter Mayhew",
               "profile_path": "/din1s5H4C4CfcnkHfEeRcdFlsVj.jpg",
               "id": 24343,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44a59251416c7503c0fd",
               "name": "Sam Wanamaker",
               "profile_path": "/aE8H0qNiON4ZN1r7KDBgPuDSA73.jpg",
               "id": 21520,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a59251416c7503c103",
               "name": "Beverley Cross",
               "profile_path": null,
               "id": 64824,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a59251416c7503c109",
               "name": "Ray Harryhausen",
               "profile_path": "/nxsvHuPnWQBFuGOq6Gs100kh74R.jpg",
               "id": 66758,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a59251416c7503c10f",
               "name": "Charles H. Schneer",
               "profile_path": "/2HUfWC6uXFy7ed3eciHwORt6aVm.jpg",
               "id": 66759,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44a59251416c7503c115",
               "name": "Roy Budd",
               "profile_path": null,
               "id": 51883,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a59251416c7503c11b",
               "name": "Ted Moore",
               "profile_path": null,
               "id": 9867,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a59251416c7503c121",
               "name": "Roy Watts",
               "profile_path": null,
               "id": 19171,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5412ee55c3a3682f700012b7",
               "name": "Beverley Cross",
               "profile_path": null,
               "id": 64824,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "5412ee600e0a26731b0013ae",
               "name": "Ray Harryhausen",
               "profile_path": "/nxsvHuPnWQBFuGOq6Gs100kh74R.jpg",
               "id": 66758,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "5412ee710e0a2673170012cd",
               "name": "Ray Harryhausen",
               "profile_path": "/nxsvHuPnWQBFuGOq6Gs100kh74R.jpg",
               "id": 66758,
               "department": "Visual Effects",
               "job": "Visual Effects"
            },
            {
               "gender": 1,
               "credit_id": "5412ee890e0a26730d001382",
               "name": "Maude Spector",
               "profile_path": null,
               "id": 10340,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "5412eea5c3a3682f65001371",
               "name": "Geoffrey Drake",
               "profile_path": null,
               "id": 30926,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 5.104741,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 11940,
      "vote_count": 52,
      "budget": 3500000,
      "overview": "Princess Farah refuses to marry Sinbad until Prince Kassim, her brother, is able to give his consent. However, the Prince's wicked stepmother, Queen Zenobia, has changed Kassim into a baboon in order to have her own son crowned as caliph. Sinbad, his crew, the Princess and the transformed Prince travel to a distant land, fighting every obstacle Zenobia places in their path, to seek the advice of a legendary wise man who can possibly tell how to end the spell.",
      "similar": [
         7191,
         124905,
         293167,
         339967,
         339530,
         5876,
         588,
         408220,
         46261,
         315011,
         9626,
         39256,
         373571,
         15767,
         3146,
         10973,
         40761,
         15766,
         12636,
         19545
      ],
      "original_title": "Sinbad and the Eye of the Tiger",
      "runtime": 113,
      "poster_path": "/oahAmW8yKUhuF4IYJPz8f0AQoms.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Andor Films",
            "id": 32838,
            "origin_country": ""
         },
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         }
      ],
      "release_date": "1977-07-15",
      "vote_average": 6.3,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "The Sinbad Collection",
         "id": 321063,
         "poster_path": "/t1vJrS8oSN9JpiLdVRhadMXy52X.jpg"
      },
      "tagline": "New!! Sinbad's Boldest And Most Daring Adventure!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Sam Wanamaker"],
      "runtime": 113,
      "synopsis": "Sinbad and the Eye of the Tiger Prince Kassim (Damien Thomas) is transformed during his coronation as Caliph of the city and kingdom of Charak (1) into a baboon by his stepmother, the witch Queen Zenobia (Margaret Whiting), who wants the throne for her own son, Rafi (Kurt Christian). The Prince's sister, Princess Farah (Jane Seymour), seeks the help of her betrothed, Sinbad (Patrick Wayne), whilst Rafi, disguised as a merchant, tries to kill Sinbad and his crew (one, Aboo Seer (David Sterne) is poisoned) with the aid of three weapon-wielding ghouls (2) (created as stop-motion models, like most of the non-human cast, by Ray Harryhausen) brought from the depths of the earth by his mother's magic: Sinbad crushingly destroys these using falling logs. A discussion the following morning on Sinbads ship between the Princess, her uncle Balsora (Bruno Barnaby), Sinbad and his crew members Hassan (Nadim Sawalha) and Maroof (Salami Coker) discovers that the only possible saviour of Prince Kassim is the Greek sage Melanthius (Patrick Troughton), who lives on the rock-and-reef-ringed fog-bound island of Cascar (3). Zenobia however, having followed Balsora to confront him, learns of their plans. Sinbad and the Princess set sail for Cascar with the enchanted Prince, who astounds the crew by being able to write and play chess. Zenobia, fearing Melanthius may well be able to cure Kassim, decides to follow on a compact bronze boat with Rafi, rowed by their servant, the Minaton (4) (stand-in Peter Mayhew), a colossal bronze minotaur-automaton made by Rafi and animated by Zenobias magic. Balsora's guard on Zenobia, Zabid (Bernard Kay), is capsized and then skewered by the Minaton during their escape. On Cascar, after a brief encounter with rock-tossing inhabitants, Sinbad persuades Melanthius and his daughter Dione (Taryn Power) of the reality of Prince Kassim's condition, and to help: Melanthius reveals that the only cure will be to journey to the land of the former Arimaspi (5) at Hyperborea, a green valley in the polar regions maintained by the Arimaspi's powers, captured in the pyramidal Shrine of the Four Elements there to which he fortunately has the key, map and sailing directions. Speed is of the essence, as not only must Prince Kassim be crowned before seven moons have passed or renounce the Caliphate, but he will also gradually lose his remaining human abilities. However Kassim is befriended by Dione, who brings him fruit and practices writing with him. Zenobia, having been delayed by her boat being damaged when approaching Cascar, transforms herself by means of a magic potion into a seagull to fly to Sinbads ship, and there resumes her human form in miniature to spy out Melanthius plans. Spotted by Kassim, and caught by Melanthius, she learns of the trip to the lands of the Arimaspi, and is able to memorize the map, but when Melanthius uses some of the magic potion on a wasp (6), which grows to a giant size and attacks him, she is able to reclaim the potion vial, escape in seagull form, and return to her own boat. However there is now insufficient potion to effect the reverse transformation, and she retains a seagull's foot. The giant wasp is killed by Sinbad using a thrown dagger. Approaching the icebound polar regions, Sinbad passes by the ice-tunnel to the Arimaspi valley as being too small for his ship, and instead conducts his team on a journey by foot across the ice-pack (with Kassim in his cage on a sled), interrupted by a fight with a giant walrus, in which one crew member falls through the ice and another is stomped flat, to reach the outer part of the warm lands of Hyperborea, where they all relax. By this time Kassim has reverted almost wholly to animal nature, and only responds to Dione. Here the group encounters a giant Troglodyte, who shows them the way to the valley of the Arimaspi pyramid-shrine, and opens the valleys great gates for them. Meanwhile Zenobia, Rafi and the Minaton with their smaller boat have been able to take the ice-tunnel via a ruined temple directly to the shrine, where Zenobia forces an entrance using magic: however a falling stone block destroys the Minaton. Sinbad's party arrives at the now-failing shrine, where giant icicles crash down, and in a fight the baboon Kassim kills Rafi by rolling him down stairs to break his neck. Melanthius successfully restores Prince Kassim to human form by passing him in a gold cage through the fall of light from the Aurora Borealis, \"the gift of the winter Apollo\", within the shrine. However Zenobia vaporizes herself and possesses the body of a sabre-toothed tiger (smilodon), the guardian of the shrine, which mauls and kills the Troglodyte and Maroof before it is slain by Sinbad, firstly transfixing it with a gaff-spear originally used by the Minaton, and then using a scimitar for the coup de grace. The party escapes the collapsing shrine, which, with the whole of Hyperborea, now becomes covered in snow, and returns to Charak, where Kassim is duly installed as Caliph: he becomes enamoured of Dione, and gives his blessing to Sinbad and Princess Farah. The appearance of Zenobia's eyes at the end may mean all is not yet over Notes (1) This spelling is used on the original storyboard reproduced p185 in 'The Art of Ray Harryhausen', by Ray Harryhausen and Tony Dalton, 2006, Billboard Books, New York (2) Ibid. In the storyboard these are called 'nightmare figures' and 'zomboids' (and numbered as four, and illustrated as five, even though three eventually appear): Ray Harryhausen however refers to them consistently as 'ghouls' thereafter (3) Spelling uncertain: however, historically, 'Cascar' is the name given by Marco Polo to Kashgar, a city on the Silk Road (4) This spelling is that used by Ray Harryhausen: the original model is illustrated also p185 in 'The Art of Ray Harryhausen' (5) Historically, the Arimaspi were a legendary people of northern Scythia. The tales of their struggles with the gold-guarding griffins in the Hyperborean lands near the cave of Boreas, the North Wind, originate in a lost work by Aristeas. (6) That the insect is a wasp is confirmed by the survival of the original model: 'The Art of Ray Harryhausen' p 208",
      "writers": [
         "Beverley Cross",
         "Beverley Cross"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0076716/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU4NjA4MDQzM15BMl5BanBnXkFtZTcwNDU1NDYyMQ@@._V1_SY305_CR1,0,214,305_AL_.jpg",
      "actors": ["Stars: Patrick Wayne, Jane Seymour, Taryn Power | See full cast and crew »"],
      "reviews": [
         "When I saw this in the theater as a 7 or 8 year old kid, I cried when it finished. It was by far the most captivating movie I had ever seen. I liked it better than Star Wars. The unbelievable stop-motion effects of Harryhausen still look great, even when compared to CGI. Things have not improved much. And Jane Seymore in the belly-dancer outfit! Good Lord! You must see this movie to believe it! The gold minotaur rowing the boat and the fight between the troglodyte and the saber-toothed tiger at the end stand out in my mind so strongly when I think of this movie.Get a copy of this movie, Jason and the Argonauts, and then Clash of the Titans and you have a fantastic Saturday afternoon of movie watching.",
         "Okay, so the film isn't a masterpiece for anyone involved, but the DVD is worth the price for Harryhausen fans. I won't reiterate a fairly lame plot but to say that a prince is morphed into a baboon and Sinbad must find a way to correct this untimely development in order to repay a friend and win the hand of the lovely Jane Seymour. All in all, the film turns out to be rather entertaining once Patrick Troughton makes it on-screen to flesh-out the dialogue. Overshadowing the movie's multiple shortcomings, however, is the always inspiring stop-motion work of Ray Harryhausen. The Trog and sabre-tooth are two fine creations and while we don't see anything on par with the 7 skeletons in \"Jason & the Argonauts\" or Medusa from \"Clash of the Titans\" there are some great moments with other creatures. While to be treasured as one of Harryhausen's last films the DVD also includes the added bonus of \"The Ray Harryhausen Chronicles\", an in-depth documentary narrated by Leonard Nimoy featuring a bio and interviews with today's FX masters. This and other features combine to make an otherwise average fantasy/adventure film worth a look--if you're a Harryhausen fan and you've got a DVD player. For all the extra features, I'll give the DVD a 6/10.",
         "This is one of my guilty pleasures; everyone makes fun of me because I love this movie. Ray Harryhausen has been panned over this film, but I think he did a fantastic job. It's inventive and eye-catching, and the Minoton is a marvel. Patrick Wayne is strong-jawed and stalwart as Sinbad, but Jane Seymour, as the princess, obviously hadn't done much acting yet when she made this film. She's really bad in the role of Sinbad's love interest. She beat Bo Derek by 4 years in starting the cornrow hairstyle, and most of her hairdos in this movie are more interesting than her acting. The biggest hoot in the movie is Margaret Whiting as the evil Queen. She's got an accent that won't quit, but as the film goes on that accent begins to fascinate the viewer; she's a really good actress, which surprised me. Even when she turns herself into a seagull. It's the outlandish creatures, scenes, and settings that a Harryhausen movie always has that are its great charms, and this film is one of the most inventive of his career. Don't expect rocket science when you watch this, just expect to be royally entertained. The new Twilight Time Blu-ray release (December 2013) of the film is a wonder and highly recommended, but hurry and order it today...there are only 3,000 copies available.",
         "(Minor Spoilers) Let's be honest and a tad realistic about this film, shall we? By TODAY'S standards, this is a \"cheesy\" kinda film compared to what technology we've got. And I think at the time of this release we had gotten \"Close Encounters of the Third Kind\" and \"Star Wars\" so our expectation levels were running higher for \"special effects\" and \"whimsy\" than this. But I still can get entertainment out of this film. How? By remembering how old I was when I saw it and WHOM I was with when I saw it. My family. I was a child. This film wasn't in my all time top ten, but it was...fun. It was one of those movies local channels threw on Sunday afternoon before or after a televised ball game..or when a ball game was rained out. Come on, admit it..you remember! And that's the point. This film's special effects were nice..not spectacular..not even up to Ray Harryhausen's standards, but the Harryhausen mark was there which made it entertaining (Admit it, you LOVED the walrus scene!! How 'bout that Cyclops?!?! As a child this was all good! You remember!!). For very young girls, this Sinbad was REALLY nice to look at back then. For the very young guys, so was Miss Jane Seymour and Miss Taryn Power. Then there was the story which was kinda fun, the adventure which was kinda whimsical and the happy ending where the bad guys got theirs'. This was done at a time of assuming children would love this kinda stuff. Back then, more would have. Now, most children don't even think \"Spy Kids\" can give them a buzz. This movie is about childhood and remembering what it was like to have an imagination and watch a story unfold for nothing but the sheer enjoyment of it...the fun of eating \"Good 'n' Plenty\", \"Snowcaps\", \"Malted Milk Balls\" and Popcorn without thinking about calorie content to make this even more fun to watch...and the \"eye candy\" of Wayne, Seymour and Power help a so-so story that's really better than a lot of stuff I've seen today that they charge ya $10 a ticket for! Parents may not have liked it as much as the children but that too is part of the fun! Have a heart when watching this. Watch this as a \"fun\" romp....as remembering when families watched shows together (..or in my case my dad mumbling under his breath about how the game was due on and he had to sit through this 'crap' first!), the pre-teen tingles of watching a handsome Wayne, young Seymour and/or Power (...ya know...before having breast implants and weighing 95 pounds was mandatory in Hollywood for women to do this kind of film work?!?) and telling your parents you were REALLY interested in the story...really. Maybe I've got a more \"nostalgic\" view about this film..its because I'm not looking for academy award winning material with this kind of film, but it does its job of...entertaining...and if you have children and want them to be children for a tad longer, this may be the film fare for them. Or just for you, if you want to curl up with some popcorn and remember \"the good old movie fluff days\" where special effects were done by hand and stop motion photography by the \"grand-daddy\" of the genre and a Sinbad movie where Sinbad actually looked like you might imagined him to look like back then and evil characters who were evil and got theirs....pretty much simplified. Open your mind and when you have a moment...enjoy. Don't take it seriously just sit back... watch...and HAVE FUN..with your children, as a family.",
         "Sinbad and the Eye of the Tiger was the third and final Sinbad movie with Ray Harryhausen creatures. In this one, a prince is turned into a stop-motion baboon and Sinbad and crew go on an expedition to Ademaspai to restore him back to human form. They face plenty of dangers on the way including several giant creatures, some of them prehistoric (more on those later). He is being followed by an evil witch with magic powers, Zenobia, along with her son and a stop-motion metal creature, Minoton. On one occasion, she turns herself into a seagull to spy on Sinbad and on return to her ship as she transforms back, she is left with a webbed foot as she has ran out of potion. She is defeated at the end in the form of a Sabre-toothed Tiger and the prince is restored back to human form. Now to those creatures: we start with a trio of ghouls and other creatures include a giant wasp, a giant walrus, a Troglodite and the above mentioned Sabre-toothed tiger. The other two stop-motion creatures, Minoton and the baboon appear throughout the movie. All of them look impressive, thanks to Ray Harryhausen. Sinbad is played well by the Duke's son Patrick Wayne (The People That Time Forgot) and the rest of the cast includes Dr Who actor Patrick Troughton, Bond girl Jane Seymour (Live and Let Die), Taryn Power, Margaret Whiting as Zenobi and Nadim Sawalha. Though not as good as the first Sinbad movie, The Seventh Voyage of Sinbad, I still enjoyed watching this one. Excellent. Rating: 4 stars out of 5.",
         "A film with animation by Ray Harryhausen. It's a pity he couldn't have animated Patrick Wayne, who's bland performance means he comes across as the least interesting Sinbad. It is Patrick Troughton's excellently enigmatic Melanthius and Margaret Whiting's icy Zenobia who are the real stars of this show. Sinbad travels to find a way to break the spell which has turned a prince into a baboon, but Zenobia, who has plans to ensure her son is crowned king in the prince's place, calls upon the help of various mythical creatures. The minotaur is by far the best of these and ought to have faced Sinbad and his crew rather than just being crushed in an ignoble exit. Other memorable creatures include a giant walrus, insectoid-faced demons and a sabre-toothed cat. Though the central character of the title is somewhat lacking, this is still first-rate entertainment and genuine escapism, two things somewhat lacking in more recent films.",
         "Sinbad the Sailor voyages to the mythic northern realm of Hyperborea to restore a caliph from an evil witch's transformation. Sinbad and the Eye of the Tiger, the follow-up to the classics The Seventh Voyage of Sinbad and The Golden Voyage of Sinbad, is an uneven conclusion to Ray Harryhausen's celebrated \"Sinbad Trilogy\". The troubled production began with a draggy script, budgetary restrictions and an inexperienced director; the film as released suffers from choppy editing, over-length and routine music scoring. One animation highlight (the giant walrus) is obscured by an optical snowstorm. The attractive cast performs listlessly and the villain is campy rather than truly menacing, although former \"Doctor Who\" Patrick Troughton is delightful as a befuddled wizard. Yet, for all its flaws, Sinbad and the Eye of the Tiger remains an entertaining escapade in the old-fashioned Saturday-Matinée tradition. Costuming and settings are colorful and the film looks handsome in widescreen. The quest for the mystical Shrine of the Four Elements has a particularly epic quality with the usual eclectic blend of mythical elements set against the backdrop of the Arabian Nights. Most importantly, Harryhausen's realistic stop-motion animation is as extraordinary as ever, with two of the animated-puppet creatures -- Kassim the Baboon and Trog the Troglodyte -- successfully functioning as actual communicative characters within the body of the story. Other wonders include insectoid demons, an over-sized mosquito, Minaton the Brass Minotaur and the saber-tooth tiger of the title. Genuine movie fantasy is a rare commodity, and Ray Harryhausen's vision and conviction shine through the circumstances of production to make this a satisfying final visit to the land beyond Beyond.",
         "Loose retelling of the ¨ 1001 Arabian nights¨ , based on ancient legends , deals with Sinbad The Sailor (Patrick Wayne) sails to deliver a cursed prince Kassin (Damien Thomas) to a dangerous island in the face of deadly opposition from a powerful witch (Margaret Whiting) . In the mysterious land Hyperboria Sinbad along with a sorcerer (Patrick Troughton) and his crew encounter magical and mystical creatures . This exciting picture contains swashbuckling , magic , fast-moving plot , thrills , impressive fights among monsters and lots of fun . It is an exciting fantasy-adventure full of special effects created by means of stop-motion technique by the magician Ray Harryhausen . The runtime is adequate with various incidents and sub-plots . Harryhausen works his animation magic around a passable-developed screenplay and engaging acting by the entire performers . The cast is enjoyable with sons of famous actors as Patrick Wayne and Taryn Power and a gorgeous and very young Jane Seymour . Agreeable film but hamhanded and confusing if you seek the hidden plot . Ray can once again claim credit for the unusual and marvelous mythical creatures springing to life , such as Smilodon , Troglodite , Mandril , an enormous mosquito , a giant Morse and many others . The picture belongs a trilogy , produced by Ray Harryhausen and Charles H. Schneer , along with ¨The seventh voyage of Simbad¨ (1958) by Nathan Juran with Kerwin Matthews and Kathryn Grant and ¨Golden voyage of Simbad¨ (1973) by Gordon Hessler with John Philip Law , Tom Baker and Caroline Munro . Great and rousing musical score by Roy Budd . Colorful cinematography by Ted Moore , filmed in Jordan (Petra) and Spain . Rating : Acceptable and passable . The motion picture was professionally directed by the usual actor Sam Wanamaker . Don't watch this one for the screenplay , which almost doesn't exist , otherwise , mildly fun . Other pictures about the great hero Simbad are the following : ¨Sinbad the sailor¨ (1947) with Douglas Fairbanks Jr , Maureen O'Hara and Anthony Quinn ; ¨Sinbad of the seven seas¨ by Enzo G Castellari with Lou Ferrigno and John Steiner and the cartoon movie ¨Simbad the legend of seven seas¨ (2003) produced by Dreamworks , a combo of computer generator and hand-drawn animation by Patrick Gilmore and Tim Johnson with voices from Brad Pitt and Catherine Zeta Jones.",
         "Evil witch Zenobia (a wonderfully robust and wicked portrayal by Margaret Whiting) casts a spell on Prince Kassim (handsome Damien Thomas) which transforms him into a baboon. Courageous legendary sailor Sinbad (a solid and likable performance by Patrick Wayne) embarks on a dangerous journey to the chilly Artic in order to reverse the spell before it's too late. Assisting Sinbad on his perilous pilgrimage are fiery Princess Farah (radiantly played by the beautiful Jane Seymour), flaky wise old wizard Melanthius (a delightfully dotty Patrick Troughton) and Melanthius' feisty daughter Dione (a winning turn by luscious blonde looker Taryn Power). Standing in Sinbad's way are Zenobia and her no-count son Rafi (a nicely venomous Kurt Christian). Director Sam Wanamaker ably maintains a brisk pace throughout, stages the frequent thrilling action scenes with considerable brio, and effectively creates a charming magical atmosphere. Ray Harryhausen's extraordinary stop-motion animation creatures include a chess-playing baboon (the sequence where the baboon reacts to its reflection in a mirror with startled grief is truly remarkable), a trio of skeletal sword-wielding humanoid insect demons, a powerful bronze colossus called the Minoton, a savage gigantic walrus, a helpful horned club-brandishing troglodyte, and a ferocious saber-toothed tiger. The scene where Power and Seymour go skinny-dipping is pretty bold for a G-rated film. Roy Budd's splendidly stirring'n'sweeping majestic orchestral score and Ted Moore's exquisitely rich, vivid and vibrant saturated color cinematography further add to the overall enjoyment of this engaging and satisfying fantasy adventure treat.",
         "Sinbad and the Eye of the Tiger starts with Captain Sinbad (Patrick Wayne) arriving ashore after a long voyage to see his friend Prince Kassim (Damien Thomas) & his sister Princess Farah (Jane Seymour), however he discovers that Kassim has been transformed into a Baboon by his evil step mother Zenobia (Margaret Whiting) using black magic so her son Rafi (Kurt Christian) can become king. In order to prevent this Sinbad agrees to do all in his power to turn Kassim back into a human being & see him take his rightful place as king of his land. First he must find a wise man named Melanthius (Patrick Troughton), but that is just the beginning of the journey that spans continents & is full of danger & evil... This English production was directed by Sam Wanamaker & I personally liked it a lot, I like all the Sinbad fantasy films & this is no exception. The script by Beverly Cross & producer/special effects man Ray Harryhausen has a simple yet functional story, it has a villain, plenty of monsters & mythical creatures, exotic locations, action scenes, sword fights, black magic & a chess playing Baboon, what more do you want? The film moves along at a nice pace, is never boring or dull & provides terrific entertainment of the kind that will never be seen again. The character's are a bit on the thin side with only Zenobia the villianess standing out as being memorable & the dialogue isn't great either but that's not the reason you would want to see Sinbad and the Eye of the Tiger is it? Persoanlly I think it's a magical, hugely entertaining fantasy adventure with plenty of monsters thrown in there for good measure. I really, really liked it, it's as simple & straight forward as that. Director the late Wanamaker seemed an odd choice, he's much more widely known as an actor & Sinbad and the Eye of the Tiger was the only theatrically released film he ever directed, everything else he directed was made-for-TV. Anyway, he does an OK job & he integrates Harryhausen's effects & monsters into the action quite well although no one set piece really stands out as being brilliant, they're all very good but not as memorable as some of the other monsters & fights Harryhausen created for some of his earlier films. I loved the bronze Minatour & he was easily my favourite creature from the film. The special effects don't hold up that well in the light of today's multi million CGI effects but I'd rather watch the magical work of Harryhausen rather than a soulless computer graphic. Interestingly Sinbad and the Eye of the Tiger came out the same year as Star Wars (1977) which probably put Harryhausen out of business & just about ended his career. Technically the film is good, with nice locations, decent effects, costumes, sets & production design. There seems to lots of varying locations as well including the open sea, rocky mountains & a snow covered pole. The acting isn't anything special apart from Whiting who seems to be enjoying herself as she plays it up as the villain. Sinbad and the Eye of the Tiger is a terrific film, it has all the elements one wants in a fantasy film such as this. My only question is why is it called Sinbad and the Eye of the Tiger? Sure there's a cool sabre-toothed tiger in it but it doesn't have much significance & it's eye is never even mentioned or has any relevance at all. This was the third & final Sinbad film following The 7th Voyage of Sinbad (1958) & The Golden Voyage of Sinbad (1973)."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Drama",
         "Family",
         "Fantasy"
      ],
      "productionCompanies": [
         "Columbia Pictures Corporation",
         "Andor Films"
      ],
      "summaries": [
         "Sinbad must deliver a prince transformed into a monkey to the lands of the Ademaspai to restore him to his human form in time for his coronation. On the way he must contend with the evil witch Zenobia, her son and their magic, and several nasty-looking Ray Harryhausen beasties.",
         "Princess Farah refuses to marry Sinbad until Prince Kassim, her brother, is able to give his consent. However, the Prince's wicked stepmother, Queen Zenobia, has changed Kassim into a baboon in order to have her own son crowned as caliph. Sinbad, his crew, the Princess and the transformed Prince travel to a distant land, fighting every obstacle Zenobia places in their path, to seek the advice of a legendary wise man who can possibly tell how to end the spell.",
         "Sinbad The Sailor sails to deliver a cursed prince to a dangerous island in the face of deadly opposition from a powerful witch."
      ],
      "budget": 0
   },
   "movielensId": 3807,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1977-07-15",
      "dvdReleaseDate": "2000-07-11",
      "directors": ["Sam Wanamaker"],
      "runtime": 113,
      "movieId": 3807,
      "title": "Sinbad and the Eye of the Tiger",
      "mpaa": "G",
      "actors": [
         "Patrick Wayne",
         "Taryn Power",
         "Margaret Whiting",
         "Jane Seymour",
         "Patrick Troughton",
         "Kurt Christian",
         "Nadim Sawalha",
         "Damien Thomas",
         "Bruno Barnabe",
         "Bernard Kay",
         "Peter Mayhew"
      ],
      "imdbMovieId": "0076716",
      "originalTitle": "Sinbad and the Eye of the Tiger",
      "genres": [
         "Action",
         "Adventure",
         "Family",
         "Fantasy",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["gNOHaOd5BDQ"],
      "plotSummary": "Princess Farah refuses to marry Sinbad until Prince Kassim, her brother, is able to give his consent. However, the Prince's wicked stepmother, Queen Zenobia, has changed Kassim into a baboon in order to have her own son crowned as caliph. Sinbad, his crew, the Princess and the transformed Prince travel to a distant land, fighting every obstacle Zenobia places in their path, to seek the advice of a legendary wise man who can possibly tell how to end the spell.",
      "tmdbMovieId": 11940,
      "avgRating": 3.16012,
      "releaseYear": "1977",
      "numRatings": 484,
      "posterPath": "/oahAmW8yKUhuF4IYJPz8f0AQoms.jpg"
   }
}