{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "suspense",
         "id": 9937
      }],
      "imdb_id": "tt0105813",
      "video": false,
      "title": "White Sands",
      "recommendations": [
         40480,
         9409,
         31650,
         31611,
         11306,
         29739,
         9605,
         29355,
         10598,
         18587,
         20307,
         31597,
         9057,
         13571,
         55448,
         27303,
         6,
         26789,
         12395,
         10383
      ],
      "backdrop_path": "/1HIzjuDlT1Dzqx24h7hK1D1xgnw.jpg",
      "revenue": 9,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Deputy Sheriff Ray Dolezal",
               "gender": 2,
               "credit_id": "52fe47d49251416c750a6d05",
               "name": "Willem Dafoe",
               "profile_path": "/xM5lhOR5tWWdIlFpBDeZJx9opIP.jpg",
               "id": 5293,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Lane Bodine",
               "gender": 1,
               "credit_id": "52fe47d49251416c750a6d09",
               "name": "Mary Elizabeth Mastrantonio",
               "profile_path": "/jNIGODCEy216bbPnj28ky5E4L3Q.jpg",
               "id": 1161,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Gorman Lennox",
               "gender": 2,
               "credit_id": "52fe47d49251416c750a6d0d",
               "name": "Mickey Rourke",
               "profile_path": "/AvGzQ8fvjurGmZW3W1wlQ5WfSeT.jpg",
               "id": 2295,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Greg Meeker",
               "gender": 2,
               "credit_id": "52fe47d49251416c750a6d11",
               "name": "Samuel L. Jackson",
               "profile_path": "/AvCReLikjzYEf9XjTQxbv3JWgKT.jpg",
               "id": 2231,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Bert Gibson",
               "gender": 2,
               "credit_id": "52fe47d49251416c750a6d15",
               "name": "M. Emmet Walsh",
               "profile_path": "/dLf79xlsmE40rog0gryjxsZJzml.jpg",
               "id": 588,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "FBI Agent Flynn",
               "gender": 2,
               "credit_id": "52fe47d49251416c750a6d19",
               "name": "James Rebhorn",
               "profile_path": "/cRbeDNPpcWKP0nLkXo5Bi1tq61w.jpg",
               "id": 8986,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Noreen",
               "gender": 1,
               "credit_id": "52fe47d49251416c750a6d1d",
               "name": "Maura Tierney",
               "profile_path": "/sG8ZxJtdMoNlBOOkMZVABxSH5F0.jpg",
               "id": 16307,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Roz Kincaid",
               "gender": 1,
               "credit_id": "52fe47d49251416c750a6d21",
               "name": "Beth Grant",
               "profile_path": "/zAT9GvzJE0ytL3C36L461cgKI9p.jpg",
               "id": 5151,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Ben Dolezal",
               "gender": 0,
               "credit_id": "52fe47d49251416c750a6d25",
               "name": "Alexander Nicksay",
               "profile_path": null,
               "id": 84624,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Delmar Blackwater",
               "gender": 0,
               "credit_id": "52fe47d49251416c750a6d29",
               "name": "Fredrick Lopez",
               "profile_path": null,
               "id": 36905,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "FBI Agent Ruiz",
               "gender": 2,
               "credit_id": "52fe47d49251416c750a6d2d",
               "name": "Miguel Sandoval",
               "profile_path": "/x0mn76606kpJtzzl0B2nfJlZXkE.jpg",
               "id": 30488,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "FBI Agent Demott",
               "gender": 2,
               "credit_id": "52fe47d49251416c750a6d31",
               "name": "John Lafayette",
               "profile_path": "/huvVSvGLpcRG64KZ1mvqr25FrNn.jpg",
               "id": 84625,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Harold Kleinman",
               "gender": 2,
               "credit_id": "52fe47d49251416c750a6d35",
               "name": "Ken Thorley",
               "profile_path": null,
               "id": 84626,
               "order": 12
            },
            {
               "cast_id": 14,
               "character": "Casanov",
               "gender": 2,
               "credit_id": "52fe47d49251416c750a6d39",
               "name": "Jack Kehler",
               "profile_path": "/huxiFLWgthatgaEIT4u36muUJMg.jpg",
               "id": 1240,
               "order": 13
            },
            {
               "cast_id": 15,
               "character": "Peterson",
               "gender": 2,
               "credit_id": "52fe47d49251416c750a6d3d",
               "name": "Royce D. Applegate",
               "profile_path": "/clLumMCdFDvaLa8wMR5L6WkP1u6.jpg",
               "id": 22251,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47d49251416c750a6d43",
               "name": "Roger Donaldson",
               "profile_path": "/AeqGthH9k1e7FJ8XJHycFNPQVvT.jpg",
               "id": 21370,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47d49251416c750a6d49",
               "name": "Daniel Pyne",
               "profile_path": null,
               "id": 29378,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 4.816209,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 19380,
      "vote_count": 36,
      "budget": 0,
      "overview": "A small southwestern town sheriff finds a body in the desert with a suitcase and $500,000. He impersonates the man and stumbles into an FBI investigation.",
      "similar": [
         949,
         189,
         336843,
         910,
         996,
         654,
         1939,
         8834,
         10285,
         845,
         9272,
         1923,
         2163,
         223,
         9411,
         1645,
         5236,
         1427,
         2502,
         4771
      ],
      "original_title": "White Sands",
      "runtime": 101,
      "poster_path": "/7XderqM5oxzbWanJq6FLvpmFLdA.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Português",
            "iso_639_1": "pt"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Morgan Creek Productions",
            "id": 10210,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1992-04-24",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "Crime Drama Thriller",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Roger Donaldson"],
      "runtime": 101,
      "synopsis": null,
      "writers": ["Daniel Pyne"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0105813/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk0MTgwNDM4N15BMl5BanBnXkFtZTcwNDY5MDMyMQ@@._V1_SY317_CR10,0,214,317_AL_.jpg",
      "actors": ["Stars: Willem Dafoe, Mary Elizabeth Mastrantonio, Mickey Rourke | See full cast and crew »"],
      "reviews": [
         "A wonderfully subdued and suspenseful film about a police deputy who takes on the identity of an apparent suicide victim, ostensibly to locate the victim's \"killer.\" Of course, in the process he gets more than he bargained for--or did he? Perhaps he was seeking an exciting and intriguing diversion from boredom all along. The story stretches the limits of believability throughout, yet this is easy to forgive and forget in light of magnificent performances by Willem Dafoe, Mickey Rourke and others, which draw you deep enough into the action that you'll soon forget none of this could ever happen. Rourke is the definition of \"cool\" as Gorman Lennox, a sleazy yet charismatic arms dealer. But it is Dafoe who turns in the best performance as an ordinary man who is compelled to put himself into an extraordinarily dangerous situation for reasons even he probably doesn't quite understand. I was thoroughly entertained just watching Dafoe's reaction every time circumstances threatened to blow his cover. All told, Deputy Ray Dolezal (Dafoe) is one of the most genuinely likeable characters I've seen on film. With a clever script, plenty of plot twists, outstanding performances and marvelous desert cinematography, White Sands is definitely a film worth watching.",
         "Here is another modern-day film-noir, featuring interesting characters played by a diverse cast. That cast is led by Willem Dafoe, who reminds me a lot of another noir actor, Dan Duryea. There is the usual corrupt government/military officials angle but the plot does have a few neat twists and is generally a non-nonsense kind of story. However, I did find the storyline a bit confusing, especially in the last half hour. On a second viewing, five years later, a few things cleared up but not a lot. I guess it will take looks to figure out everything, especially the very end. I'm not usually a fan of Elizabeth Mastrantonio, but I thought she was exceptional in here: by far, the best and most interesting character. The movie has a nice soundtrack. Overall, the good outweighs the bad and the somewhat confusing story helps draw me back for future viewings. Aside notes: this must have been one of Samuel L. Jackson's first films because he was listed as \"Sam Jackson\" in the closing credits. Unbilled were three always-interesting actors: Fred Thompson, Mimi Rogers and Jack P. Ryan.",
         "A New Mexico state sheriff assumes the identity of a dead man he finds in the desert and sets out to solve the crime all by himself. Willem Dafoe is the lawman who bites off more than he can chew and stumbles from one situation to another, all with bad guys and mysterious women who want the money he found in the desert with the man who was killed. The plot is not easy to follow and is populated with heavies and shadowy figures but somehow the film maintains interest throughout. The supporting cast is very good, with Samuel L. Jackson, Mickey Rourke, Mary Elizabeth Mastrantonio and M. Emmet Walsh heading the list, and Dafoe and Mastrantonio have a nice shower scene together. Senator Fred Dalton Thompson is also good in a brief appearance. Partick O'Hearn contributes a nice music score.",
         "This interesting cop thriller has a convoluted plot that gets a bit out of hand in the second half, with improbable, needless twists added only to provoke a surprised response on the audience's part (consider, for example, Mickey Rourke's true identity), but it has been stylishly directed by Roger Donaldson (who has already shown his competence with the first-rate \"No Way Out\") and acted with restraint by the three leads; Rourke is particularly magnetic. Samuel Jackson also has an amusing supporting role. (**1/2)",
         "In order for a movie to hold our attention by presenting interesting and exciting events that exceed what might happen in our normally more mundane lives, we have to suspend our natural critical view that, 'things wouldn't happen that way in real life...'. 'It's a movie', so we cut it some slack and accept things that on the whole, might be somewhat unlikely. Right at the outset White Sands demands a great deal from our reserves of suspended disbelief, and this is because a small hick town sheriff, who turns out to be a very thorough and exacting crime scene detective, responds to the discovery in his jurisdiction, of an apparent suicide victim who has a briefcase containing a huge amount of money, by becoming the sole self-appointed investigator. Then he discovers a lead, and with no backup what-so-ever he decides to take the whole briefcase full of money and set out in a convertible '65 Corvette no less, on a quest to find information about the deceased through pretending to be that person! As our good sheriff drives off and away from his beautiful wife, in his oddly chosen very valuable classic convertible sports car, all alone and with half a million bucks in unknown and unsecured evidence in a briefcase on the seat beside him, we know that he has no idea whom he might meet. What will such people think of this money-stuffed briefcase packing shill of the victim whom for all our sheriff knows, might know is in fact dead? We may well be excused for thinking, 'That wouldn't happen that way in real life'. Do ya think? With a lesser actor in the lead role we might be inclined to see if it isn't too late to get out of our seats and go back to the ticket booth and make a scene about a refund, or to make a phone call and see if the video store is still open, but it's Willem Dafoe and he does pretty darned well with the material. If our next thought, seeing this lone man set off on his quest with his unsecured briefcase of money, is something along the lines of, 'This can't be good...' then we are treated to the fulfilment of our forebodings. It does become much better though. If we forgive the movie's presumption to this point then we are treated to a somewhat less demanding remainder. To say any more would be to do a job of telling that the movie actually does much better than I can. There are several big names in the cast and they do a commendable job. The plot thickens, the characters develop and the viewer is never required to strain credulity to the degree demanded by that setup scenario. It's a generally satisfactory movie and if not in the league of the giants, you shouldn't regret viewing it. Present ratings are rather harsh for this drama but for my part I'd think it warrants a solid 7.",
         "Trying to figure out \"White Sands\" is like trying to put together a jigsaw puzzle with quite a few missing pieces. This overcomplicated movie challenges the viewer's understanding way too much, and eventually you will lose interest. It really is a shame because the cast gives their best effort with what is a severely disjointed script. Mary Elizabeth Mastrantonio and the blue Corvette are easy on the eyes, but it's not enough to maintain momentum, and the whole thing derails twenty minutes in and never recovers. True there are a few strong scenes, but a plethora of dead material is unfortunately connecting them. Not recommended. - MERK",
         "Mickey Rourke is truly one of America's finest actors. He has been dismissed because of his irrational behavior, however, that takes nothing away from his talent and penetrable screen prescene. White Sands has wonderful atmosphere, capturing the desert with splendid cinematograpy. Willem Dafoe makes for an excellent protagonist to journey with through the maze that is the plot. A bonus in watching White Sands now is the post-Jungle Fever but pre-Pulp Fiction Samuel L. Jackson. He makes for a slimy antagonist. All of this and M. Emmet Walsh, in an autopsy scene to die for, make for an enjoyable movie experience.",
         "This movie started out promising. Ray ( William Dafoe ) investigates an apparent suicide in the middle of the desert of a man with a briefcase full of money . After following clues ( including one found out of someone's stomach ) Ray eventually finds himself in trouble with criminals and the F.B.I. But after the first 40-60 minutes, the movie loses interest and becomes dull and boring. Even with the supporting cast of Mickey Rourke and Samual L. Jackson, White Sands trails away from the initial interest of the start and becomes a cliched \" everyone chasing after the money \" flick. I would only recommend this film for fans of Dafoe or people with nothing to do on a Saturday afternoon. 4.5/10",
         "This is one of the most action packed movies ever. Great cast, great plot, great storyline to boot. \"White Sands\"is awesome. And it's a blast. Here you have a small town sheriff (Willem Dafoe) who uncovers a big mystery. An undercover FBI Agent, and suitcase with half a million dollars. That to him is a big break from the small town life. He goes out to the motel where the victim was staying at. Gets more information, decides to fill in the role of the dead-man, and find himself way over his head. He later meets fellow agent Meeker(Samuel L. Jackson), CIA Lennox(Mickey Rourke) , and Lane Bodine (Mary Elizabeth Mastrantonio), a woman of means join in on the fun. The question is simple, Who to trust? Well, we know it's not Lennox. He's violently murderous. He had the two internal affairs men killed in the desert. And Meeker is no good. He is bound by greed. Big money equals big ego. If I was a Fed, I would stave off temptations. Only Lane was the one he could trust. During the shower scene, she was the one who could return Dolezal back to his regular life. But when convince him that she's very helpful, he had to live it up! And does he ever. Lane's persuasive actions makes Dolezal more intrigued than ever. For the record, Meeker's greed got the best of him. That made him the dirtiest FBI Agent ever. For the sheriff deputy, I think he had enough fun in his life. As long as he doesn't mention this whole scenario with his family. Awesome, totally awesome, what more can I say? 4 out of 5 stars!",
         "There is absolutely nothing wrong with this movie and it is an excellent rental option when you are undecided on what to get in your favorite movie rental service/place. Very good plot, the dialogs are great and the ending is definitely not predictable. Rourke was in his downhill after a flash rise to fame due to 9 1/2 weeks (if you are an 80s guy like me, you know what I mean), but he still gives a good performance and one of his lines was just the best of the whole movie. Samuel Jackson was solid and Dafoe balanced as always. As a bonus the sexiest performance of Mastrantonio in her career. The movie has ups and downs and does not keep you nailed to your chair, but that is the story telling style of the director and I am cool with it."
      ],
      "genres": [
         "Action",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": ["Morgan Creek Productions"],
      "summaries": ["A small southwestern town sheriff finds a body in the desert with a suitcase and $500,000. He impersonates the man and stumbles into an FBI investigation."],
      "budget": 0
   },
   "movielensId": 3810,
   "movielens": {
      "languages": [
         "English",
         "Español"
      ],
      "releaseDate": "1992-04-24",
      "dvdReleaseDate": "2000-07-11",
      "directors": ["Roger Donaldson"],
      "runtime": 101,
      "movieId": 3810,
      "title": "White Sands",
      "mpaa": "",
      "actors": [
         "Willem Dafoe",
         "Mary Elizabeth Mastrantonio",
         "Mickey Rourke",
         "Samuel L. Jackson",
         "M. Emmet Walsh",
         "James Rebhorn",
         "Maura Tierney",
         "Beth Grant",
         "Alexander Nicksay",
         "Fredrick Lopez",
         "Miguel Sandoval",
         "John Lafayette",
         "Ken Thorley",
         "Jack Kehler",
         "Royce D. Applegate"
      ],
      "imdbMovieId": "0105813",
      "originalTitle": "White Sands",
      "genres": [
         "Action",
         "Crime",
         "Drama",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": ["uDANCwhxAYw"],
      "plotSummary": "A small southwestern town sheriff finds a body in the desert with a suitcase and $500,000. He impersonates the man and stumbles into an FBI investigation.",
      "tmdbMovieId": 19380,
      "avgRating": 2.94606,
      "releaseYear": "1992",
      "numRatings": 343,
      "posterPath": "/7XderqM5oxzbWanJq6FLvpmFLdA.jpg"
   }
}