{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "independent film",
         "id": 10183
      }],
      "imdb_id": "tt0077742",
      "video": false,
      "title": "Interiors",
      "recommendations": [
         22477,
         28384,
         11337,
         22478,
         8288,
         30890,
         11382,
         8217,
         12762,
         19200,
         9689,
         11448,
         11686,
         11561,
         5143,
         9684,
         11562,
         10849,
         9716,
         10569
      ],
      "backdrop_path": "/xS01X3FDDYvDNdoj9hEqsUH9iBy.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Renata",
               "gender": 1,
               "credit_id": "52fe46869251416c7507b20d",
               "name": "Diane Keaton",
               "profile_path": "/fzgUMnbOkxC6E3EFcYHWHFaiKyp.jpg",
               "id": 3092,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Flyn",
               "gender": 1,
               "credit_id": "52fe46869251416c7507b211",
               "name": "Kristin Griffith",
               "profile_path": "/dRQh5YUXcCVVCxTRKaIjWbKT2qo.jpg",
               "id": 164343,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Joey",
               "gender": 1,
               "credit_id": "52fe46869251416c7507b215",
               "name": "Mary Beth Hurt",
               "profile_path": "/A1Whvk91g7uMZHjRX5rdxJsofeY.jpg",
               "id": 54782,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Frederick",
               "gender": 2,
               "credit_id": "52fe46869251416c7507b219",
               "name": "Richard Jordan",
               "profile_path": "/9Wv303Zx9yU8zp2sEG1cZbpYRre.jpg",
               "id": 12518,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Arthur",
               "gender": 2,
               "credit_id": "52fe46869251416c7507b21d",
               "name": "E.G. Marshall",
               "profile_path": "/iQnivIob2OiXuVCepECf72xS2tQ.jpg",
               "id": 5249,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Eve",
               "gender": 1,
               "credit_id": "52fe46879251416c7507b221",
               "name": "Geraldine Page",
               "profile_path": "/zyGpaCsHZUJRUyFUJNlTQ6dBs6F.jpg",
               "id": 41283,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Pearl",
               "gender": 1,
               "credit_id": "52fe46879251416c7507b225",
               "name": "Maureen Stapleton",
               "profile_path": "/7zazX6qycXK1CBXkNT1t9FCEEkk.jpg",
               "id": 21151,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Mike",
               "gender": 2,
               "credit_id": "52fe46879251416c7507b229",
               "name": "Sam Waterston",
               "profile_path": "/fKmtS6OdDWPiAdxZflbJGz1eWml.jpg",
               "id": 8975,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46869251416c7507b209",
               "name": "Woody Allen",
               "profile_path": "/wpcOUlaszvJoVRf1yLbDtu7u4FI.jpg",
               "id": 1243,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46879251416c7507b22f",
               "name": "Daniel Robert",
               "profile_path": null,
               "id": 421542,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "52fe46879251416c7507b235",
               "name": "Mario Mazzola",
               "profile_path": null,
               "id": 421541,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "52fe46879251416c7507b23b",
               "name": "Tommy Dorsey",
               "profile_path": "/uOnjhLFSzjMnghratcLu79kBRJh.jpg",
               "id": 534016,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46879251416c7507b241",
               "name": "Ralph Rosenblum",
               "profile_path": null,
               "id": 6848,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe46879251416c7507b24d",
               "name": "Woody Allen",
               "profile_path": "/wpcOUlaszvJoVRf1yLbDtu7u4FI.jpg",
               "id": 1243,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46879251416c7507b259",
               "name": "Mel Bourne",
               "profile_path": null,
               "id": 10441,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "5388484fc3a3681aea00404d",
               "name": "Gordon Willis",
               "profile_path": "/6gOmfatlF7UdhaHi2tPsZMb5vmz.jpg",
               "id": 3097,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "568d5348c3a3685f8901bc0e",
               "name": "Joel Schumacher",
               "profile_path": "/ijI5sCPqDvT18NRWCeBqw8BJIZx.jpg",
               "id": 5572,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "59afb3e1925141078a06a6e4",
               "name": "Jack Rollins",
               "profile_path": "/4zEeD2lPss6tFhgGzMIdoc68VDa.jpg",
               "id": 6994,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "59afb3eec3a3681fcc01131a",
               "name": "Charles H. Joffe",
               "profile_path": null,
               "id": 6993,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "59afb41c92514107af0679eb",
               "name": "Nathan Boxer",
               "profile_path": null,
               "id": 3178,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 0,
               "credit_id": "59afb432925141076506a83d",
               "name": "Bernard Hajdenberg",
               "profile_path": null,
               "id": 1882922,
               "department": "Sound",
               "job": "Sound Editor"
            },
            {
               "gender": 0,
               "credit_id": "59afb441c3a36824430104ce",
               "name": "Jack Higgens",
               "profile_path": null,
               "id": 1882923,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 5.096222,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 15867,
      "vote_count": 112,
      "budget": 0,
      "overview": "A look at a dysfunctional family dominated by the controlling madness of its matriarch, Eve. Her reluctant husband and their three daughters make doomed efforts to cope with Eve's demands, while also trying to get on with their own lives. But, all bets are off when an ebullient stranger enters the picture.",
      "similar": [
         3134,
         11564,
         281,
         133805,
         2142,
         22323,
         294963,
         948,
         8810,
         298312,
         14433,
         1359,
         141,
         185,
         101,
         205,
         949,
         12162,
         8923,
         769
      ],
      "original_title": "Interiors",
      "runtime": 93,
      "poster_path": "/ykwQHyjAAgYEVKjMulWnrd3EOze.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "United Artists",
         "id": 60,
         "origin_country": ""
      }],
      "release_date": "1978-08-02",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Woody Allen"],
      "runtime": 93,
      "synopsis": null,
      "writers": ["Woody Allen"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0077742/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQxOTgwNzk2MV5BMl5BanBnXkFtZTcwMTA0NzA2NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Diane Keaton, Geraldine Page, Kristin Griffith | See full cast and crew »"],
      "reviews": [
         "It appears that many critics find the idea of a Woody Allen drama unpalatable. \"Interiors\" gets slammed as a forced, awkward, heavy-handed and cheapened imitation of Bergman (most noticeably \"Cries and Whispers\") and usually discussed in context of \"Annie Hall\" that preceded it and \"Manhattan\" that followed. Well, \"Annie Hall\" was funny as hell and I love \"Manhattan\" - it's directed with an authority that I don't think was matched in another Woody Allen film (\"Crimes and Misdemeanors\" had touches of such visual elegance). With the exception, of course, of \"Interiors\" which preceded it. \"Interiors\" is Woody Allen putting aside his neuroses and directing with unshakable confidence. Granted, Bergman has already cleared the path for him to some degree, but \"Interiors\" stands on its own. Visually and aurally it's a quiet film, permeated with silences, dark off-white colors, beige and grays mostly, despair and sadness. It's the existential hell and it's a lot quieter than the descriptive terms make it seem. Narratively, \"Interiors\" has the fluidity and grace of any other of Allen's more successful films. Like the multi-character \"Hannah and Her Sisters\" or the parallelism of \"Crimes and Misdemeanors\" the stories, relationships and situations rise and build naturally. \"Interiors\" is, essentially, the story of an upper-class family shattered, if not exposed and tested, by the divorce of the parents and the ensuing collapse of the mother. The title, of course, refers not only to the profession of the mother who is arguably the central character and definitely the emotional and psychological catalyst for the events of \"Interiors,\" but also works on a metaphorical level. Interiors that Allen implies are those that shatter when the mother, phenomenally played by Geraldine Page, is forced to face the separation from her husband. The neat world constructed by her starts to crumble revealing not only the painful truth to her, but also to her daughters who are greatly affected by this as well. The truth, of course, is that nothing was perfect in the first place - the interiors were simply created to shelter from the reality of family crisis, bottled-up emotion, undue expectations, selfishness, synthetic love and conflict. The conflicts that arise, or rather expose themselves, bring to light themes that are quite frankly very Allenesque. Allen explores the burdens of existence, namely the inevitability of death (and the question of the immortality of art), loneliness, the failure of relationships (and thus violation of trust), and the search for meaning in life. \"Interiors,\" however, differs from his other films in that it takes a distinctly psychological approach to these problems. It does so by not exposing its themes through \"situations\" (like Woody Allen finding out that he might be dying in \"Hannah and her Sisters\" and attempting suicide), but rather through realistic psychological observation of familial relations - particularly mother-daughter ones. Like many Bergman films, \"Interiors\" is psychological to the core, even though I don't recall a single shrink in the film. It's also dramatic and quieter than all other Allen films. Finally, it would be a shame not to mention that, while obviously very Bergmanesque, the film is seeped in the atmosphere of many Chekhov plays, bordering on the psychological darkness of Ibsen. \"Interiors\" is the American film version of early-20th century European theatrical drama - the problems of the well-off, upper-class families not being able to survive social, emotional and psychological instability that they themselves contributed to creating. We are talking of people with intellectual and monetary resources - resources that we treat as essential to happiness. \"Interiors\" like many of the darker of Allen's comedies, is a quietly terrifying question-mark - it is directed at our lives and our values. And the answers are nothing, but perturbing. Little to laugh about really.",
         "This is one of Woody Allen's strong and quite films that, like most, is multi-layered. On the surface layer it presents an inside look at a dysfunctional family that is coming to terms with themselves, the divorce of their parents, and finally the death of their mother. Under this quite, but strikingly sorrowful first layer is a second layer of insight of considerably more importance. The underlayer is about the interaction of the principal characters and how they attempt to manipulate each other in generally destructive patterns that are even now becoming more and more prevalent in our socioeconomic culture. Not surprisingly, after a second or third look, this film should be included as part of the curriculum for medical residents working towards the specialty of Psychiatry. It is definitely a film about the destructive and continuing decaying family structure with which we are becoming more and more aware. It is not a film about morality, so important an issue in the 1990's, but about the simple misunderstanding of parenting in families that leave so many in our society emotionally crippled. The result is seen in the three daughters, representing the generations of bored and depressed young and middle aged, middle class people that spend great amounts of time and money trying to prove to themselves that they are happy and cope with the idea of real happiness that has eluded them. Of the films that will survive as anthropological glimpses of the 20th and possibly 21st Centuries in the United States, this film will be on the short list.",
         "I do not praise films simply because other people or critics love it; I also don't praise films simply because other people or critics hate it. I really do think for myself, so you can take it as an assured commendation when I say that this is one of the best melodramas ever put on film. I'm not a pseudo-intellectual; I don't think Woody Allen is perfect, and I'm not out to impress anyone with my taste. I simply loved the movie - the script, the visuals, the acting... all touched me deeply and moved me nearly to tears, which happens to me only about once for every hundred movies I see. People have complained that the movie is morbid, self-indulgent, that the characters are shallow; but I think that all three of these elements actually contribute to the film. Morbidity is a part of life, and this film is not an attempt to cover up the sad truths of existence with cheap laughs or explosions; self-indulgence does not preclude quality, and many of the best films ever made have been self-indulgent. And the characters exhibit both shallowness and depth, just like real people... I think that mostly people who criticize this film either don't have the attention span to relate to a slower movie, or they lack a certain empathy with those who suffer, or they simply expect every Allen film to be a comedy. If you can get past those hangups, though, you might just find that you love this movie too.",
         "John Waters said that if this film was made under a Swedish pseudonym, they would of called it a masterpiece. Woody Allen was only able to get a film like this made after he won all those Oscars for Annie Hall. Everyone is great in here and it's nice that there's no soundtrack. This is one of Woody Allen's best films.",
         "Allen's first really serious film plays like an Bergman film. It's a dead serious study of a very dysfunctional family. The father (E.G. Marshall) wants a trial separation from his wife (Geraldine Page). This totally destroys her life but her grown children try to help. One daughter (Diane Keaton) keeps giving her false hope that her husband will return. Meanwhile she has issues with her husband (Richard Jordan)--he finds her very condescending about his writing and she reacts with anger. Another daughter (Mary Beth Hurt) tries to get her mother to face reality. She has no direction in life herself and her husband (Sam Waterston) wants a child. A third daughter (Kristin Griffith) barely figures in this. Somber, bleak, quiet and stark. Full of angry, unsatisfied people--the only humor is provided by Maureen Stapleton who shows up late in the movie. This film contains many emotionally vicious moments. It's unpleasant sometimes but you can't stop watching. The dialogue is great--full of fascinating insights into what the characters are feeling. Occasionally the actors sound like they're giving speeches instead of talking but that's rare. Marshall seems ill at ease in his role but everyone else is dead on target. Especially good are Page who is frightening--you can see her trying not to feel and control everything at the same time. Keaton is just superb--one of her best ever dramatic performances. A highlight is the last sequence between Hurt and Page. The film sometimes seems over-directed--everything is so precise and ordered but it fits the tone of the movie. Also the ending is a little too pat and Griffith is given nothing to do--I often wonder what she was doing in this. Still this is an exceptional drama. It's not for everyone--it may be too bleak for most people but I think it's Allen's best drama. A 10 all the way.",
         "Interiors (1978) This is one of those dark, serious, realistic personal dramas that critics shook their heads at in 1978. It wasn't because it wasn't good--it's frankly a brilliant combination of the big three: acting, writing, photography. It was because it was directed (and written) by Woody Allen. And Woody Allen is funny, right? Critics at the time, however, to their credit, gave the film a fair reading, and for three brilliant excerpt of period reviews, I recommend the Wikipedia entry on the movie. So watch this film thinking it's by someone else, if you have to. take it in on its own subtle terms as three sisters watch their own deficiencies bloom when their parents abruptly separate. There is some familiar territory here, actors Allen has turned to many times (including Diane Keaton, of course, who he was once, in 1970, involved with). The world is one that might actually be parallel to his own, not Jewish New York but rather a highly educated literary set with money and ambitions, but deeply steeped in the arts. In short, \"Interiors\" was and is appreciated but always with a feeling that it isn't quite complete, that it isn't what it could have been. It's easy to see that it is unremittingly dour, almost to perversion. And you might say that it plays the Bergman card too hard without overt appropriation (which makes it merely derivative, that worst of echoes). It is fair, I suppose, to say that Allen really has succeeded, but not in the remarkable ways he had succeeded so clearly in his earlier films, including his previous nugget, \"Annie Hall,\" which is in my view his first true drama, but which has the benefit of also being funny. Or you can just sit back and take it in for what it does do so well, letting the interior lives of these people seem as shattered and pathetic as they really seem. The photography by Gordon Willis is admirable for being beautiful and inventive without being distracting. Allen and Willis make clear this intention with opening shots, a series of fixed camera views of rooms, and then views out windows, all framed with classic proportions, but sequenced to pull you in. But look how often the camera follows two people as they walk and talk, either up close in front of them, or along the beach through an irregular snow fence. Its pace and \"tastefulness\" of the photography almost seems designed by one of the main characters, the troubled interior decorator mother played with uncanny effectiveness by Geraldine Page. Expect nothing in particular here except a tour-de-force that works on its own depressing terms.",
         "I believe 'Interiors' is Woody Allens finest hour: it is his masterpiece. The best film of 1978 and one of the finest American films ever. The acting by the entire cast is superb. If any one film derserved an academy award for ensemble acting, it's this one. Geraldine Page is chilling in her cool intensity; Mary Beth Hurt is astounding and Maureen Stapleton is a revelation. Diane Keaton; E.G. Marshall; Sam Waterston; Richard Jordan and Kristin Griffith are equally great. When I get down on myself and question my intellect, thinking of my appreciation of 'Interiors', reminds me of my own potential and love of the cinema. 11 out of 10. Darren Cunningham",
         "The three daughters of a quiet attorney and an imperious matriarch are alternately offended and benumbed by their parents' divorce and their dad's \"hasty\" decision to remarry (leaving mama to fend for herself, probably something she needs but does not enjoy--there's no one to boss around). Ingmar Bergmanesque drama from writer-director Woody Allen, who does not appear or even feel present (Pauline Kael of The New Yorker claims his neuroses have been transposed to the mother-character, but I never felt like I was watching something created by Woody Allen). All the actors are quite fine playing characters who are high-strung, uptight, woebegone (yet oddly, never intentionally comical), yet the flatness of the dialogue and the listlessness of Mary Beth Hurt's frequent narration may strain some viewers' patience. Some of the wordy sequences tend to ramble, and what words! Allen has a fixation with non-textbook terms for multiple abnormal psychoses; and no matter how educated Hurt's character is supposed to be, I had trouble swallowing some of the high-brow talk in her third-act put-down of Geraldine Page. The movie--seriously well-scrubbed, sterile and somber--has many conflicts and personality quirks which feel real and intricate, and Page's high society dementia is riveting (alternately, Maureen Stapleton's gaudy low-class is also superb). The three sisters remain enigmas that confound and confuse (each other and the viewer) but Diane Keaton's gritty reserve as the eldest daughter is the one I gravitated towards. Not a masterpiece (as some critics claimed back in 1978), but certainly not a dud. It's Woody's art-house gambol, a dark one, and it leaves behind a fascinating imprint. *** from ****",
         "Interiors is one of the most divisive films of one of the most love-it-hate-it directors. For me Interiors is not one of Allen's best films(Annie Hall, Crimes and Misdemeanours, Manhatten, Hannah and Her Sisters, Husbands and Wives) with some dialogue monologues that ramble on a bit too much, but when it comes to his most underrated films Interiors is very high on the list. It is very easy to see why people wouldn't like it with how bleak it is and how it's different from much of what Allen has done, but those are hardly reasons to dismiss Interiors because apart from the occasional rambling it is a great film. It is very stylishly shot with good use of locations, probably Allen's second most visually striking 70s film after Manhattan. Like Annie Hall, there's no music score and that's not a bad thing at all, Interiors is a very intimate and intricate film and having no music added to that quality. Much of the dialogue is full of insight and pathos, to me it did have dramatic weight and it is one of Allen's most honest films along with Husbands and Wives. The screenplay is not \"funny\" as such and is not as quotable as Annie Hall, but it wasn't ever meant to be. The story is paced deliberately but how Interiors was written and performed ensures that it isn't dull, it was very moving(personally it didn't topple into melodrama) and layered storytelling- didn't notice any convolutions- deftly handled. Allen directs assuredly in one of his more restrained directing jobs. The characters are neurotic and not the most likable, but are written and performed with such compelling realism that in the end there is some sympathy felt for them. The cast was a talented one in the first place, and none of them disappoint. Especially good are Geraldine Page, in one of her best performances, in very frightening and heart-breakingly tormented form and Mary Beth Hurt, the centrepiece of the story and is very affecting. Maureen Stapleton is a breath of fresh air as the most lively character- an anti thesis to the rest of the characters but not an out of place one- and E.G. Marshall brings a great deal of quiet dignity. Diane Keaton when it comes to Woody Allen films is better in Annie Hall and Manhattan but plays a purposefully shrill character with gusto. Richard Jordan and Sam Waterson are fine. Kristin Griffith is good too but her part seemed underwritten. All in all, won't be for everybody but a great film from personal perspective and one of Woody Allen's most underrated. 9/10 Bethany Cox",
         "This is one of those films that when you recommend, you should also warn.It is a very mature work about a very sick and warped family. It is also a very beautifully realized piece of filmmaking. The only real complaint I have about it is that it wasn't recorded in stereo or surround. Since Woody Allen is deaf in one ear, I guess he doesn't care. Thank God, he isn't color blind. Geraldine Page is absolutely devastating as the suffocating wife as she creates the woman of limited imagination and total self importance who strangles the joy of living out of her immediate family. She is a pathetic villain whose sick arrogance is the bane of every one she touches with her sterile iciness. This is a cautionary tale about what mental illness can do if left unchecked and untreated. It is also Woody Allen doing Bergman like Stanley Donen doing Hitchcock in Charade, not a lesser film than Bergman, just an American take on the same kind of situation. Bergman is not as good as Bergman. Every Good filmmaker gets elevated to such outrageous levels of hype in this disturbingly stupid era of 100 best lists that a lot of very good movies get ignored and filmmakers of previous eras are treated like trash, so that a self promoting cretin like Tarantino whose films are all style and absolutely zero substance can be lionized by a bunch of film school educated idiotic critics. This is not a must see, but it is an important film for the film scholar. As much as Enchanted April is life affirming, this one is life threatening. Talked to death has never been done better."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Rollins-Joffe Productions"],
      "summaries": [
         "Homage to Ingmar Bergman in this family drama involving a fashionable Long Island interior designer who tries to impose her overbearing, critical standards on her husband and her three grown daughters. The film is a realistic look at the relationships among one artistically-oriented family; one daughter is a successful writer; the second is looking for an artistic outlet; and the third is an actress. The mother has been deserted by her husband, their father. She thinks and hopes they may reconcile, but she soon learns that he has other thoughts that circle about a new acquaintance, a woman who has had two husbands and is still lively.",
         "Arthur decides to leave his wife Eve. Their three adult daughters Joey, Flyn and Renata must suddenly face up to the disintegration of the family: Eve feels quite helpless but Arthur is reluctant to come back. And the daughters also have some personal problems in their relationship with each other, their spouses and their parents...",
         "A dark story of three sisters (Renata, Joey and Flyn) and their attempts to come to terms, not only with their own lives, but with the divorce of their parents.",
         "Three sisters find their lives spinning out of control in the wake of their parents' sudden, unexpected divorce."
      ],
      "budget": 10000000
   },
   "movielensId": 3813,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1978-08-02",
      "dvdReleaseDate": "2000-07-05",
      "directors": ["Woody Allen"],
      "runtime": 93,
      "movieId": 3813,
      "title": "Interiors",
      "mpaa": "",
      "actors": [
         "Diane Keaton",
         "Kristin Griffith",
         "Mary Beth Hurt",
         "Richard Jordan",
         "E.G. Marshall",
         "Geraldine Page",
         "Maureen Stapleton",
         "Sam Waterston"
      ],
      "imdbMovieId": "0077742",
      "originalTitle": "Interiors",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["lhphrzgPpaE"],
      "plotSummary": "A look at a dysfunctional family dominated by the controlling madness of its matriarch, Eve. Her reluctant husband and their three daughters make doomed efforts to cope with Eve's demands, while also trying to get on with their own lives. But, all bets are off when an ebullient stranger enters the picture.",
      "tmdbMovieId": 15867,
      "avgRating": 3.51777,
      "releaseYear": "1978",
      "numRatings": 619,
      "posterPath": "/ykwQHyjAAgYEVKjMulWnrd3EOze.jpg"
   }
}