{
   "tmdb": {
      "original_language": "no",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0117817",
      "video": false,
      "title": "The Other Side of Sunday",
      "recommendations": [],
      "backdrop_path": "/zQpFvi7wD59jUsKaIbZ6CVULpYA.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1001,
               "character": "Maria",
               "gender": 1,
               "credit_id": "52fe470ac3a36847f8120775",
               "name": "Marie Theisen",
               "profile_path": null,
               "id": 589174,
               "order": 0
            },
            {
               "cast_id": 1002,
               "character": "Mrs. Tunheim",
               "gender": 1,
               "credit_id": "52fe470ac3a36847f8120779",
               "name": "Hildegun Riise",
               "profile_path": "/ayRlsTnpEZac3AAx5oSD8YJ6KJN.jpg",
               "id": 589175,
               "order": 1
            },
            {
               "cast_id": 1003,
               "character": "Johannes",
               "gender": 2,
               "credit_id": "52fe470ac3a36847f812077d",
               "name": "Bjørn Sundquist",
               "profile_path": "/4e4fDL75LqtIQXLtbkvc2oCx209.jpg",
               "id": 71186,
               "order": 2
            },
            {
               "cast_id": 1004,
               "character": "Moren",
               "gender": 0,
               "credit_id": "52fe470ac3a36847f8120781",
               "name": "Sylvia Salvesen",
               "profile_path": null,
               "id": 589176,
               "order": 3
            },
            {
               "cast_id": 1008,
               "character": "Olav",
               "gender": 0,
               "credit_id": "59a71cbec3a3683c7a004686",
               "name": "Martin Dahl Granfalk",
               "profile_path": null,
               "id": 1879520,
               "order": 4
            },
            {
               "cast_id": 1009,
               "character": "Anna",
               "gender": 0,
               "credit_id": "59a71cd3925141579d0041a4",
               "name": "Ina Sofie Brodahl",
               "profile_path": null,
               "id": 1879521,
               "order": 5
            },
            {
               "cast_id": 1010,
               "character": "Birgit",
               "gender": 0,
               "credit_id": "59a71ce8c3a3683c7a0046b9",
               "name": "Ann Kristin Rasmussen",
               "profile_path": null,
               "id": 1879522,
               "order": 6
            },
            {
               "cast_id": 1011,
               "character": "Young Priest",
               "gender": 2,
               "credit_id": "59a71cf292514157a5004142",
               "name": "Jørgen Langhelle",
               "profile_path": "/vS1SRN0UwHTK3OvCYiQ6nUB9kQ6.jpg",
               "id": 47177,
               "order": 7
            },
            {
               "cast_id": 1012,
               "character": "Seaman",
               "gender": 2,
               "credit_id": "59a71cfbc3a3683c7a0046d5",
               "name": "Hallvard Holmen",
               "profile_path": "/w3jG1xUSgY8y1ZCMr4lCmFrJZQM.jpg",
               "id": 116387,
               "order": 8
            },
            {
               "cast_id": 1013,
               "character": "Bård",
               "gender": 2,
               "credit_id": "59a71d0792514157a5004154",
               "name": "Kai Kennet Hanson",
               "profile_path": "/nkvfq2Agc91IYYk66QYT5E698jL.jpg",
               "id": 1481433,
               "order": 9
            },
            {
               "cast_id": 1014,
               "character": "Pål Helge",
               "gender": 0,
               "credit_id": "59a71d17c3a3683c8700411c",
               "name": "Petter Width Kristiansen",
               "profile_path": null,
               "id": 1479707,
               "order": 10
            },
            {
               "cast_id": 1015,
               "character": "Tulla",
               "gender": 0,
               "credit_id": "59a71d2ec3a3683c7a004715",
               "name": "Henriette Engesæth",
               "profile_path": null,
               "id": 1879523,
               "order": 11
            },
            {
               "cast_id": 1016,
               "character": "Stian",
               "gender": 0,
               "credit_id": "59a71d37c3a3683c87004139",
               "name": "Kristian Aaby",
               "profile_path": null,
               "id": 1879524,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe470ac3a36847f8120771",
               "name": "Berit Nesheim",
               "profile_path": null,
               "id": 589173,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "55ddf36ec3a36816430026c2",
               "name": "Reidun Nortvedt",
               "profile_path": null,
               "id": 1500695,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "55ddf37a9251410cf10025e1",
               "name": "Lasse Glomm",
               "profile_path": null,
               "id": 1178591,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "55ddf382c3a3686582002c7c",
               "name": "Berit Nesheim",
               "profile_path": null,
               "id": 589173,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 0.070739,
      "production_countries": [{
         "iso_3166_1": "NO",
         "name": "Norway"
      }],
      "id": 46754,
      "vote_count": 1,
      "budget": 0,
      "overview": "The Other Side of Sunday, also known in Norwegian as \"Søndagsengler\", is a movie that criticizes the small, and often tight, church community. We follow the Preacher's Daughter, Maria, on her journey to liberate herself from the stiff church community and her father.",
      "similar": [
         258480,
         27586,
         370663,
         401898,
         244772,
         12793,
         10735,
         3981,
         858,
         112160,
         141,
         634,
         376867,
         394117,
         437557,
         242224,
         17130,
         10818,
         11421,
         43923
      ],
      "original_title": "Søndagsengler",
      "runtime": 103,
      "poster_path": "/z4YFXbIljqoCys5dTqIeRkLcnLb.jpg",
      "spoken_languages": [{
         "name": "Norsk",
         "iso_639_1": "no"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Norwegian Film Institute",
            "id": 61792,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "NRK Drama",
            "id": 3083,
            "origin_country": ""
         }
      ],
      "release_date": "1996-02-09",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Norway",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Berit Nesheim"],
      "runtime": 103,
      "synopsis": null,
      "writers": [
         "Lasse Glomm",
         "Berit Nesheim"
      ],
      "originalLanguage": "Norwegian",
      "imdbLink": "http://www.imdb.com/title/tt0117817/",
      "coverLink": null,
      "actors": ["Stars: Marie Theisen, Hildegun Riise, Bjørn Sundquist | See full cast and crew »"],
      "reviews": [
         "I'd not heard of this film before it appeared on our TV and, going by the extent of feedback to IMDB, it has not been widely seen or appreciated. The storyline is simple. It concerns a teenage girl growing up in late 1950s Norway, in a strict religious household, with her father the local pastor. She begins to realise that there is more in the world than strict orthodox Christianity. This leads to increasing tensions and her gradual rebellion. The film is warm and human, and there is enough wit and humour to prevent it becoming tedious, dry, or just another \"teenage rebellion\" movie. Having had a relatively similar upbringing, I found a great deal of honesty in this film. The photography, acting, late 1950s musical background and overall quality are excellent, with possibly a nod of recognition to Bergman. As I said in my one-line summary, this film really does deserve more recognition.",
         "\"Søndagsengler\" is a norwegian movie that have all genres: comedy,drama,religion,but about all:love.It's a pity that this movie not won the Oscar,because is most to deserved,in my case,that Kolya.The Academy Awards Jury not choose movies that,really,deserved it.Well,this movie is so sensitive,like all norwegian and scandinavian movie,and entertaining,with beautiful sequences,marvelous screenplay and excellent performances. But,I follow thinking that this movie deserved the Oscar. Now,\"The Other Side of Sunday\" is one of my favourites films and one of the best of all times. My opinion:You must see this movie.",
         "I consider this movie to be outstanding - well worth a 10. It is a totally Norwegian production and therefore doesn't suffer the defects of the Scandinavian co-productions with characters confusingly and variously speaking in Swedish,Danish and Norwegian. The plot is straightforward and the cinematography is excellent. The acting is first class and as a Norwegian Broadcasting Corporation production is up there with the best that the BBC can produce. I am surprised that Marie Theisen has seemingly dropped out of films after a second film which I have been unable to obtain. The present film received a well deserved Oscar nomination. Ms.Theisen now appears to be a film reviewer for Kanal 24 in Norway. Such a pity that she is out of the production side.",
         "Beautiful film for the art to describe the ineffable essence of an age, the subtle desire, the fear of social class, the image of religious vision like strong and necessary shell , the forms of beauty. It is exploration of a special metamorphosis in a delicate way, in kindly images, refined colors, with deep respect for atmosphere's details. A young girl in an ambiguous war with a rigid world. A father for who the rules are untouchable, hypocritical gestures of a small universe, ethics like masks of general peace, slices of ordinary existence and vagueness of desires, dreams and feelings. Mary is not a victim or rebel spirit. She is only explorer of her life. Her bold gestures or words, the innocent game, the refuge beyond the family's sphere are not elements of a real fight but steps for self definition. It is a splendid film for the science to suggest the forms of existence's assume. For the sweet colors and for gentleness of artistic expression. For the discover of emotions like seeds of everyday. For the taste of Sunday.",
         "Maria is the teenage daughter of a rigid, authoritarian pastor in a conservative branch of Norway's state church in the early 1960s, and the time is approaching when she is supposed to be confirmed. However, she dreads her upcoming confirmation, because she doesn't want to live the drab, glum life that women in her church seem to lead. She wants to enjoy her youth, but her father even objects to her going to a café for a Coke with her friends.Her mother's serious illness and academic pressures only add to her stress. Maria befriends a woman who is a member of her church; the two of them are obviously kindred spirits who feel constrained by the strict rules of their community. What will she decide when the time comes to take her confirmation vows, especially after her life is shaken by bereavement? Almost all the coming of age stories I have seen or read have been about boys or young men. This film is unusual in that it's about a young girl trying to figure out who she is and her place in the world.",
         "Hmm I see that this film has been enjoyed all over the world, and I must say I'm a little surprised.. I am a Norweigian and I have seen it a couple of times when it has gone on the TV for some years ago, but I never thought it would reach out to so many people... The funny thing is.... I'm in it. Now a 27 year old man going on 28, its strange seeing that even now, almost eleven years after, it still touches people. My part wasn't big, though I had a few lines, but it is such a strange feeling to have been part of something that still is held so close to the heart that some of the \"fans\" of the film keep it. I remember being a little embarrassed the first time I saw it on the premiere in Oslo, cause I guess i was hoping for something more exciting. You must remember I was only 16. But now I see it in a different way. I hope you all still will enjoy the film as I enjoyed being part of it..",
         "Norwegian coming-of-age story about a teenager realizing the strict church life in the 1950's is not for her. Almost the whole entire background is Scriptural church life while our main character is discovering herself. She's learning in her heart that she does not want to turn into a \"church hag.\" Her dad is the pastor and quite a strict father not to mention a hypocrite. It's a well-told story with bits of humor and a lot of hopefulness for people who don't want to conform to a way of life that is being forced upon them, a way of life they know is not for them. Longing, tragedy and hope. A decent film that moves along at a nice pace. Not so sure it deserved to make the short list to be nominated for the Academy Award for Best Foreign Language Film. Interesting yes. But I can't help but wonder if that was in large part a slap in the face of religion. In any case, I suppose it was an alright watch but nothing anyone needs to immediately download. Norwegians perhaps. Otherwise there surely are better films from Norway. 6.2 / 10 stars --Zoooma, a Kat Pirate Screener",
         "There's a brief scene in the movie where the camera focuses on sunflowers between transitioning from one important scene to another. That's the visual which remained with me \u0096 that of sunflowers. And the flowing river water. Water brings peace. This movie is about the honesty and expression of sunflowers. Its about the flow of emotions like the flow of river water. Experimenting with lipstick, trying a night out with the boys, are signs of tasting life, hanging out in a café, finding room to be in the strict environment portrayed in the movie. There are several controversial themes the movie touches upon, without taking a hard stance on any. Messaging is subtle \u0096 open for multiple interpretations. The father, a priest, is shown bearing down on his family and in the process weighing himself down. There are underlying themes of tensions between father and daughter. There is dialog between kindred spirits about finding one's own God \u0096 a God which lets one be without extracting forgiveness for existence, finding space away from authoritarianism. The movie ends with the girl finding herself on a wide open road, her hair open, her heart open. Its all very symbolic.",
         "It is the late 1950s in a small village in Norway. Bjørn Sundquist plays Johannes, a priest in the Church of Norway. Johannes has a wife, a son, and two daughters. The story revolves around Johannes, his pretty older teenage daughter Marie (Marie Theisen), and his church organist and assistant Mrs. Tunheim. Oddly we never know the family name of Johannes' family--the only person with a last name is Mrs. Tunheim, and we never know her first name. Johannes is stern and unyielding in his behavior. In the pulpit he is seen promoting the usual Christian pieties; his congregation looks like they are attending a funeral rather than a service. The rule is to look straight forward during a service and the first hint we get of what is to come is Marie's pinching her sister during a service. Johannes is harsh with his family and a prominent theme is the ongoing battle of wills between him and Marie. However, in several scenes we see a human side of Johannes that somewhat soften the initial stereotypical image that we might have of him. Marie struggles to understand her religion and her burgeoning sexuality. Even in the face of the rigidity of her father's religious positions (or because of them) Marie has questions. As one example of her questioning consider this conversation with Mrs. Tunheim: Marie: Do you think God did a poor job when he created man? Mrs.Tunheim: Why do you ask? Marie: He created us so that we have to ask forgiveness all the time. Isn't that a poor creation? Or this reflection: \"Isn't it just some sort of invention to love and cherish until death do you part? I love meatballs, but I cannot promise God that I will do that for the rest of my life.\" The movie often mixes humor with its more serious considerations. Music plays an essential role in the film, ranging from Bach to 50s pop ballads. Music contributes to some exquisitely beautiful scenes like the one where Marie swims naked in the river. All the actors capably handle the subtle complexities demanded of them, but it is ultimately Marie Theisen who carries the film and raises it above the average. She perfectly captures the questioning innocence at the core of Marie's personality and the stubborn persistence to find her own way in an environment that is trying to impose conformity. Marie is not about to give up on God, she is just looking for her own God--a God of nature, a God of forgiveness, a God who likes us when we are happy. This movie can be seen as a kinder and gentler version of a Bergman film that treats the same themes. Expect surprises on the way to a definitive final scene.",
         "Yet another great movie set in the 50s about growing up. It just says it all. It is impossible to break the spirit of this young girl, no matter how hard the overly religious father and society tries. An important and beautiful film indeed."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "NRK Drama",
         "Norwegian Film Institute"
      ],
      "summaries": ["The Other Side of Sunday, Also known in Norwegian as \"Sndags Engler\", is a movie that criticizes the small, and often tight church community. We follow the Preachers Daughter; Maria in her journey to liberate herself from the stiff church community and her father."],
      "budget": 0
   },
   "movielensId": 3817,
   "movielens": {
      "languages": ["Norsk"],
      "releaseDate": "1996-02-09",
      "dvdReleaseDate": "2000-07-11",
      "directors": ["Berit Nesheim"],
      "runtime": 103,
      "movieId": 3817,
      "title": "The Other Side of Sunday",
      "mpaa": "PG-13",
      "actors": [
         "Marie Theisen",
         "Hildegun Riise",
         "Bjørn Sundquist",
         "Sylvia Salvesen",
         "Martin Dahl Granfalk",
         "Ina Sofie Brodahl",
         "Ann Kristin Rasmussen",
         "Jørgen Langhelle",
         "Hallvard Holmen",
         "Kai Kennet Hanson",
         "Petter Width Kristiansen",
         "Henriette Engesæth",
         "Kristian Aaby"
      ],
      "imdbMovieId": "0117817",
      "originalTitle": "Søndagsengler",
      "genres": [
         "Drama",
         "Comedy",
         "Foreign"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The Other Side of Sunday, also known in Norwegian as \"Søndagsengler\", is a movie that criticizes the small, and often tight, church community. We follow the Preacher's Daughter, Maria, on her journey to liberate herself from the stiff church community and her father.",
      "tmdbMovieId": 46754,
      "avgRating": 3.12353,
      "releaseYear": "1996",
      "numRatings": 85,
      "posterPath": "/z4YFXbIljqoCys5dTqIeRkLcnLb.jpg"
   }
}