{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0205461",
      "video": false,
      "title": "Thomas and the Magic Railroad",
      "recommendations": [
         29474,
         25163,
         36859,
         74101,
         338107,
         19809,
         68665,
         29098,
         40341,
         33695,
         44126,
         42040,
         22792,
         161495
      ],
      "backdrop_path": "/zj7kSw5oGbtiUXzEmfTuizj2fTR.jpg",
      "revenue": 19748009,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Mr. Conductor",
               "gender": 2,
               "credit_id": "52fe46a39251416c7507ea7b",
               "name": "Alec Baldwin",
               "profile_path": "/zFtp13AZyPbqbj6yHujPWHO5ioh.jpg",
               "id": 7447,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Grandpa Burnett Stone",
               "gender": 2,
               "credit_id": "52fe46a39251416c7507ea7f",
               "name": "Peter Fonda",
               "profile_path": "/dgorN06SQ9ZNL2NY3I7BNxg93lc.jpg",
               "id": 8949,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Lily Stone",
               "gender": 1,
               "credit_id": "52fe46a39251416c7507ea89",
               "name": "Mara Wilson",
               "profile_path": "/twFydeLmcbYR7DFBgs3cKe4es8O.jpg",
               "id": 11717,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Mr. C. Junior",
               "gender": 2,
               "credit_id": "5aa73c47c3a36839dd0136c0",
               "name": "Michael E. Rodgers",
               "profile_path": "/ieEr4YelUtW1DQNRQbGSTFG8zBe.jpg",
               "id": 154903,
               "order": 3
            },
            {
               "cast_id": 22,
               "character": "Patch",
               "gender": 2,
               "credit_id": "5aa74503925141722200d0da",
               "name": "Cody McMains",
               "profile_path": "/s4IdZpHpTcbb8n3ucb0W3MZNT6L.jpg",
               "id": 154038,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Stacy Jones",
               "gender": 1,
               "credit_id": "5aa73be20e0a263dd3017c36",
               "name": "Didi Conn",
               "profile_path": "/DDtCcwPcYlG1I6HW6Va8oruXDO.jpg",
               "id": 8895,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Billy Twofeathers",
               "gender": 2,
               "credit_id": "5aa73c069251415e3c014d8a",
               "name": "Russell Means",
               "profile_path": "/7cmcwlWqZ2iJycikffenrLZnWbg.jpg",
               "id": 3203,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Lily's Mother",
               "gender": 1,
               "credit_id": "5aa73c6bc3a36839da014fac",
               "name": "Lori Hallier",
               "profile_path": "/p3idcs25JleLI06edPm8rDKPJAp.jpg",
               "id": 44203,
               "order": 7
            },
            {
               "cast_id": 7,
               "character": "Young Bernett (voice)",
               "gender": 0,
               "credit_id": "5aa73c319251415e45014ad9",
               "name": "Jared Wall",
               "profile_path": null,
               "id": 1239386,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Young Tasha (voice)",
               "gender": 0,
               "credit_id": "5aa73c879251415e45014b10",
               "name": "Laura Bower",
               "profile_path": null,
               "id": 1997065,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Thomas (voice)",
               "gender": 0,
               "credit_id": "5aa73cd2c3a36839d1016b54",
               "name": "Eddie Glenn",
               "profile_path": null,
               "id": 1997067,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Diesel 10 (voice) / Gordon (voice) / Splatter (voice) / Tumbleweed (voice)",
               "gender": 2,
               "credit_id": "5aa73d69c3a36839da015071",
               "name": "Neil Crone",
               "profile_path": "/8LYTbOzuqFQoSOFRggM28JzgEXb.jpg",
               "id": 5941,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Percy (voice)",
               "gender": 0,
               "credit_id": "5aa73d850e0a263dc70163f5",
               "name": "Linda Ballantyne",
               "profile_path": null,
               "id": 1222890,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Henry (voice) / Dodge (voice) / Bertie (voice) / Harold (voice)",
               "gender": 0,
               "credit_id": "5aa73dbdc3a36839dd0137e7",
               "name": "Kevin Frank",
               "profile_path": null,
               "id": 1997073,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "James (voice)",
               "gender": 1,
               "credit_id": "5aa73dd60e0a263dca016862",
               "name": "Susan Roman",
               "profile_path": "/ou9m8eYl0xFifQrIBl7mD6hW4Hh.jpg",
               "id": 87462,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "Toby (voice)",
               "gender": 2,
               "credit_id": "5aa73de30e0a263dd6016773",
               "name": "Colm Feore",
               "profile_path": "/ack88BRQ7mApRMOdaiOqEUh2FDu.jpg",
               "id": 10132,
               "order": 15
            },
            {
               "cast_id": 20,
               "character": "Lady (voice)",
               "gender": 0,
               "credit_id": "5aa73df49251415e48014a20",
               "name": "Britt Allcroft",
               "profile_path": "/2AY5uVfk7qUP5OmGW44gofCpBwh.jpg",
               "id": 113733,
               "order": 16
            },
            {
               "cast_id": 21,
               "character": "Annie (voice) / Clarabel (voice)",
               "gender": 0,
               "credit_id": "5aa73e239251415e3f01566c",
               "name": "Shelley-Elizabeth Skinner",
               "profile_path": null,
               "id": 1997076,
               "order": 17
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe46a39251416c7507ea85",
               "name": "Britt Allcroft",
               "profile_path": "/2AY5uVfk7qUP5OmGW44gofCpBwh.jpg",
               "id": 113733,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5aa7462c0e0a263dcd016eed",
               "name": "Britt Allcroft",
               "profile_path": "/2AY5uVfk7qUP5OmGW44gofCpBwh.jpg",
               "id": 113733,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5aa7463e9251415e390160e1",
               "name": "Phil Fehrle",
               "profile_path": null,
               "id": 1412353,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5aa7468a0e0a263dc401754f",
               "name": "Hummie Mann",
               "profile_path": null,
               "id": 53839,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "5aa746a79251415e480151d6",
               "name": "Paul Ryan",
               "profile_path": null,
               "id": 157451,
               "department": "Crew",
               "job": "Cinematography"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 1.620216,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 16110,
      "vote_count": 15,
      "budget": 0,
      "overview": "Mr. Conductor's supply of magic gold dust, which allows him to travel between Shining Time and Thomas's island, is critically low. Unfortunately, he doesn't know how to get more. Meanwhile, Thomas is fending off attacks by the nasty diesel engines. Getting more gold dust will require help from Mr. C's slacker cousin, his new friend Lily and her morose grandfather, plus the secret engine.",
      "similar": [],
      "original_title": "Thomas and the Magic Railroad",
      "runtime": 85,
      "poster_path": "/jxG520Lc2QFfP2RwRU7Kfnh0sxW.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/wgDks2qYgwN6u1OkW1bBre0rf4F.png",
            "name": "Isle of Man Film",
            "id": 2268,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Britt Allcroft Productions",
            "id": 37618,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Destination Films",
            "id": 769,
            "origin_country": ""
         }
      ],
      "release_date": "2000-07-26",
      "vote_average": 4.3,
      "belongs_to_collection": null,
      "tagline": "Little Engines CAN Do Big Things...",
      "adult": false,
      "homepage": "http://www.magicrailroad.com",
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Britt Allcroft"],
      "runtime": 85,
      "synopsis": null,
      "writers": [
         "Britt Allcroft",
         "Rev. W. Awdry"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0205461/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk3MTUyODI0MF5BMl5BanBnXkFtZTcwODU0OTIyMQ@@._V1_SY317_CR9,0,214,317_AL_.jpg",
      "actors": ["Stars: Alec Baldwin, Cody McMains, Russell Means | See full cast and crew »"],
      "reviews": [
         "With evil engine Diesel back on the track and looking to get rid of the old steam engines. Mr Conductor is put in charge of using his gold dust to jump around the area and keep an eye on Diesel - but his supply runs out and he finds himself stuck. Meanwhile Diesel is looking for the steam engine that got away from him in the past - the same engine that was repaired and hidden by Grandpa Burnett many years ago. Being a reasonable fan of Thomas in my youth I decided to watch this film to see what it was like. The first problem of the film is that it doesn't resemble the UK version, with characters and sentiments added for the American audience. This isn't a major problem - only that it affects what I remember from the original series. The plot is very fragmented and is far too hard for very young children to follow; the basic is good but the addition of various characters and such just complicates things. The issue I had with the story was the fact that it is almost totally lacking in any sense of fun or wonder; I don't mean it should have been hilarious but it should have been at least enjoyable. Instead, there is no sense of fun here - it is very plodding and makes it nigh on impossible to stay with. The animation is basic but is more or less true to the original series; downside of that is that the trains all look rubbish - with the eyes being the only bits that move (constantly). However the film straw is the fact that the cast are pretty poor. The voice work on the trains is very simplistic and it just made all of them sound the same. Peter Fonda is awful and can't even muster the energy to deliver the most basic of lines (when his granddaughter returns he says `Oh Lily. I'm so glad you're back' with all the emotion of a man reading out his shopping list). It's like he got drunk and woke up to find himself contractually obliged to do this film and decided to not even put in a little bit of effort. Baldwin tries hard and is actually OK because he is at least putting in effort; more than that, considering his tough guy image, this was a strange role for him to play and he does do it pretty well although I would have liked his character to insert more of the wonder and fun that he hints at rather than delivers. Overall this is a pretty poor film that never really goes anywhere. The plot is weak - too complex for tots and too convoluted for adults to bother with. The acting is roundly poor and the film manages to be totally missing any sense of fun. It's easy to tire of kids films that are full of knowing humour but this is one film that was crying out for a bit of silliness or tongue in cheek humour.",
         "Where is the English charm? Why are all of the Engines now American? I watched this movie as I thought it would be a good tribute to Rev.W.Awdrey's life long work. It's not at all. The engines just sound annoying and the plot doesn't work at all. Has Britt Alcroft decided to go behind his back completely. Surely if Awdrey were alive today he would not be impressed at all. I am not a child but I still think that children should be shown a sense of consistency from the TV series. It's a bad film. The Island of Sodor makes no sense. Thomas is a British masterpiece and this film has ruined it. The producers should be ashamed. That's all I have to say.",
         "Okay, I understand that this is a kid's movie, and that it's intended to simply be fun. However, that's no excuse for the wreck of a screenplay provided by Britt Allcroft. Some day I may be compelled out of sheer obsession to document the many problems with this movie, but the most fundamental flaw is the continued use of the \"Shining Time\" additions to the Awdry stories. Didi Conn is the only thing shining in Shining Time, created for US TV audiences to stitch together the excellent model railroad Thomas stories. The only thing is, they didn't need to be stitched together, as they stand up just fine on their own in book and video. Worse, the Shining Time portions on TV are excruciating to watch...and now the whole premise is brought to a movie. Now it seems there's some kind of magic railroad connecting a mythical British island railroad to Shining Time, clearly in the USA. In fact, it must be in Lancaster, PA, USA, because the Strasburg Railroad locomotive #475 makes a few appearances in the movie (in Strasburg and Harrisburg, PA) and I doubt it's ever been across the Atlantic. Anyway, to make a long and painful story short, there's almost no motivation for any of the characters in this story to do anything at all. Somehow Mr. Conductor (not an Awdry creation) is running out of gold dust, which will somehow make his \"universe\" fall apart. There's no mention as to why supplies would dwindle to nothing when it's the only thing holding Sodor together - Mr. Conductor is pretty irresponsible if you ask me. He summons his idiot brother who is no help at all, and together they and the rest of the characters stumble on the answer and save the day in a completely underwhelming conclusion. The gold dust emergency happens to coincide with the apparent return of a diesel engine intent on destroying steam engines. The whole evil-diesel and his predictable sidekick-duo are completely unnecessary and just scare the little kids (like my two-year-old). I assume that the marketing folks needed a few more new characters to work into the merchandising mix because there's no excuse for the plot damage caused by the diesel. Your kids may enjoy the railroad scenes, but don't watch this movie unless you want your brains to leak out of your head and turn to mush. The models are great, but the acting and writing are ridiculous. Avoid at all costs!!!",
         "It is stunning that in this day and age of movie tie-ins, that the creators (or better said owners) of the Thomas the Tank Engine franchise couldn't find a better major movie outlet for their goldmine. Face it, if they would have put 2 seconds of thought into this clunker it would have been huge. Basing it on the Shining Time Station theme was the first mistake. Why not have a nice little movie about the Island of Sodor and its engines? Why insult the audience by creating human characters that are DREADFULLY acted? Again, a simple little movie would have made a mint. It has been 6-7 years since this movie came out and I wonder why another attempt at a Thomas movie hasn't been made. This is the most popular character for children ages 2-6. Parents (like myself) would kill for a decent big screen adaptation to take children to. Seems like somebody is missing the boat here. As for this movie, it has all been said within the previous comments. The acting by Peter Fonda is downright embarrassing, and the storyline is confusing. More focus should have been put on the engines and less on wooden human characters. It gets a 3 from me because despite all its flaws, my 3 year old loves it, therefore giving daddy a much needed rest from time to time. Time for another try at a Thomas movie. Anybody up for it?",
         "For those parents who are considering buying this movie, please don't. For those who received as a present, you now know who of your friends wish you to go insane. I am writing this review from the inpatient psychiatric unit after being made to watch this movie by my three year old. On the 453rd time I broke and ran down the street believing I was being chased by Naughy Diesel #10. This movie in a word...terrible. My wife and I sit in the car during trips and recite the HORRIBLE dialog to each other. It has so many plot holes it is amazing. I am thinking about taking a roll of Kodak super-8 and running between the butt cheeks of a horse with the scoots, and selling as the sequel to this movie, It would surely be less of a piece of crap on film.",
         "My wife and I took our 3 year old to see this film and we all enjoyed it. In the age of lots of shoot 'em up and Pokemon \"crap\" Thomas was refreshing and light. For all those who have slammed this film as being the worst of 2000 I can only imagine that they have no sense of wonder and either don't have kids or don't read to their kids. Take your little ones, leave your synicism at the door and be a kid again. Its o.k. to enjoy a kids film!! :)",
         "My son loves this movie. We rented the DVD and then he saved his own money to buy it. He still loves it 2 years later. Although It is a little bland for adults. Kids eat it up. That is really all I have to say. but they require that this comment be 10 lines long. My point is that all of the comments I read were really negative about the movie. When in fact it served it's primary objective. And the at was to entertain children. I don't think that anyone made the film wanting to get nominated for any awards. They just wanted to entertain children and make some dough in the process. The end. I have met the 10 line minimum. I give it 3 out of 10 stars.",
         "... you watch this movie and wonder why the Thomas universe was screwed up so much by it! In short, the film is good enough to keep my kids riveted. They, who are already fans of Thomas, took the movie in stride. All they really cared about was watching the trains. However, there are other aspects to the film that ruin it completely, and pretty much separate it from the rest of the Thomas universe. As far as I've seen, Diesel 10 was never really evil before now (or afterwards, I'm not to sharp on the whole Thomas Chronology). The whole magical connection and making Sodor some quasi-hidden land of magic trains comes completely out of left field. The saving graces are the models and sets used for the models, as detailed and wonderful as ever. On the acting side, Baldwin makes up for Peter Fonda, who's acting makes me think that he's coming off of a bad trip, frankly. What counts, in the end though, is that the kids enjoyed it. let's face it, they aren't as nit-picky as we are!",
         "My top 10 Problems with this movie... 1 Peter Fonda looked like he was on 'ludes the whole movie... especially when his missing granddaughter turns up and he blurts \"lily. i'm so happy to see you\". I've never seen a actor emote less. 2 Alec Baldwin. Not that he is bad in this. He seems to be about the only actual actor trying to act. But all I could think of was GlenGary Glen Ross. I was dying for him to scream \"YOU THOUGHTLESS LITTLE PIG\" to the Lily character. I wonder how far they got into shooting before Alec realized what a major piece of crap he was involved in. 3 Was the Native American driving the train supposed to be some sort of lame joke? You know.. an injun driving an engine. What was he even doing in this movie? 4 The Yahoo Serious brother or cousin or whatever. Simply annoying. Although the \"Shell Phone\" joke was good. 5 What exactly are the rules about who shrinks and who doesn't when they travel thru the magic railroad. They're definitely not consistent. 6 How exactly did Patch get all that coal to the cave? 7 The engines are barely in this movie at all. And when they are, some speak with a brit accent and others don't. WTF? Plus the engine with the most lines (Diesel 10) isn't even one of the main Thomas and Friends characters. 8 What was Diesel 10 doing there in the first place if he was such a pain in the a..? 9 The opening sequence at Shining Time with the James Taylor-ish music and the juggler was simply lame. At least it was big waving red flag at the beginning of the film alerting me to keep my expectations low. 10 What was with Lily climbing on things? Was it foreshadowing some event that never happened? 11 The whole Gold Dust concept confused the hell out of me. What it's for, where it comes from, all of it... was frustratingly unclear. Well I could go on and on. I'm not going to cheap out at this point and say \"but my kid liked it\" like everyone else. Yeah, he'll sit and watch it. But he'd sit and watch just about anything that had Thomas in it and it is a shame that they totally squandered an opportunity to make a decent feature movie with some beloved characters. Too bad.",
         "I took my two girls to see this yesterday, and I was very disappointed. The trains have little to do with the (confused and disjointed) plot of the film, they give what can best be described as extended cameo appearances, which presumably are meant to prop up the wooded acting performances (of all but Didi Conn). The film seems to have been edited at random, several plot lines just suddenly disappear. The children just about enjoyed it, but not as much as they usually enjoy a childrens' film."
      ],
      "genres": [
         "Adventure",
         "Comedy",
         "Drama",
         "Family",
         "Fantasy"
      ],
      "productionCompanies": [
         "Gullane Pictures",
         "Destination Films",
         "Isle of Man Film Commission"
      ],
      "summaries": [
         "Mr. Conductor's supply of magic gold dust, which allows him to travel between Shining Time and Thomas's island, is critically low. Unfortunately, he doesn't know how to get more. Meanwhile, Thomas is fending off attacks by the nasty diesel engines. Getting more gold dust will require help from Mr. C's slacker cousin, his new friend Lilly, and her morose grandfather, plus the secret engine he's hidden all these years and couldn't get running.",
         "An evil diesel locomotive called Diesel 10 has arrived on the Island of Sodor, with the intention of destroying the steam locomotives. His plan is to locate a magical lost engine and destroy her in order to remove the magic from the Island. Sir Topham Hatt, normally in charge of the railways on Sodor, is on holiday and has left Mr. Conductor in charge. Mr. Conductor has problems of his own. The mysterious gold dust that allows him to magically transport from place to place is running out, and without it there will be no way for anyone to travel to Sodor. The lost engine is able to travel between Sodor and Muffle Mountain via the Magic Railroad, but nobody knows where she is. An old man named Burnett Stone lives on Muffle Mountain, near Shining Time. Unknown to everyone, he is the guardian of the lost engine. The engine crashed after an earlier encounter with Diesel 10, and ever since then he has been trying to repair her, so far without success."
      ],
      "budget": 19000000
   },
   "movielensId": 3820,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "2000-07-26",
      "dvdReleaseDate": "2000-10-31",
      "directors": ["Britt Allcroft"],
      "runtime": 85,
      "movieId": 3820,
      "title": "Thomas and the Magic Railroad",
      "mpaa": "G",
      "actors": [
         "Alec Baldwin",
         "Peter Fonda",
         "Mara Wilson"
      ],
      "imdbMovieId": "0205461",
      "originalTitle": "Thomas and the Magic Railroad",
      "genres": [
         "Animation",
         "Drama",
         "Family",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Mr. Conductor's supply of magic gold dust, which allows him to travel between Shining Time and Thomas's island, is critically low. Unfortunately, he doesn't know how to get more. Meanwhile, Thomas is fending off attacks by the nasty diesel engines. Getting more gold dust will require help from Mr. C's slacker cousin, his new friend Lily and her morose grandfather, plus the secret engine.",
      "tmdbMovieId": 16110,
      "avgRating": 1.82547,
      "releaseYear": "2000",
      "numRatings": 212,
      "posterPath": "/jxG520Lc2QFfP2RwRU7Kfnh0sxW.jpg"
   }
}