{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "paris",
            "id": 90
         },
         {
            "name": "suicide",
            "id": 236
         },
         {
            "name": "france",
            "id": 254
         },
         {
            "name": "gambling",
            "id": 395
         },
         {
            "name": "bridge",
            "id": 3450
         },
         {
            "name": "knife",
            "id": 4728
         },
         {
            "name": "seine",
            "id": 5771
         },
         {
            "name": "glucksspiel",
            "id": 8818
         },
         {
            "name": "knife throwing",
            "id": 18106
         }
      ],
      "imdb_id": "tt0144201",
      "video": false,
      "title": "The Girl on the Bridge",
      "recommendations": [
         38414,
         64968,
         31300,
         64983,
         57726,
         31517,
         16242,
         8897,
         49693,
         156231,
         76772,
         42463,
         80560,
         67385,
         66070,
         43101,
         12513,
         64559,
         33833,
         134625
      ],
      "backdrop_path": "/rZmeujCA8oo47PCsfuhMhGeVjm0.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Adèle",
               "gender": 1,
               "credit_id": "52fe43679251416c7500f03b",
               "name": "Vanessa Paradis",
               "profile_path": "/78CpZ2bltGSuUiQerXbo3Y298eK.jpg",
               "id": 65007,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Gabor",
               "gender": 2,
               "credit_id": "52fe43679251416c7500f03f",
               "name": "Daniel Auteuil",
               "profile_path": "/lWXsmJwL4H2RyJpC8p7hLFl27pZ.jpg",
               "id": 6012,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Takis",
               "gender": 0,
               "credit_id": "52fe43679251416c7500f043",
               "name": "Demetre Georgalas",
               "profile_path": null,
               "id": 65008,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Irène",
               "gender": 1,
               "credit_id": "52fe43679251416c7500f047",
               "name": "Catherine Lascault",
               "profile_path": null,
               "id": 65009,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Contortionist",
               "gender": 0,
               "credit_id": "52fe43679251416c7500f04b",
               "name": "Frédéric Pfluger",
               "profile_path": null,
               "id": 271955,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Bride",
               "gender": 0,
               "credit_id": "52fe43679251416c7500f04f",
               "name": "Isabelle Petit-Jacques",
               "profile_path": "/2BcudeMWtUkbVUbZyErFaIyT295.jpg",
               "id": 91272,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Miss Memory",
               "gender": 0,
               "credit_id": "52fe43679251416c7500f053",
               "name": "Mireille Mossé",
               "profile_path": "/6NBOAx1hP0l423uEa2kjUsdr4UK.jpg",
               "id": 4394,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "TGV Ticket Conductor",
               "gender": 0,
               "credit_id": "52fe43679251416c7500f057",
               "name": "Didier Lemoine",
               "profile_path": null,
               "id": 300166,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Kusak",
               "gender": 0,
               "credit_id": "52fe43679251416c7500f05b",
               "name": "Bertie Cortez",
               "profile_path": "/bsdlJWSU6VUMm75fpGvRlhHjpTX.jpg",
               "id": 71305,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Italian Waiter",
               "gender": 2,
               "credit_id": "52fe43679251416c7500f05f",
               "name": "Stéphane Metzger",
               "profile_path": "/lrQthI3W6FkNQ4W4dFiD5QykHM6.jpg",
               "id": 4290,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Suicide Victim",
               "gender": 0,
               "credit_id": "52fe43679251416c7500f063",
               "name": "Claude Aufaure",
               "profile_path": "/3ipASXqmhVp7y6kYlejyNAou8ET.jpg",
               "id": 145129,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "TGV Waiter",
               "gender": 0,
               "credit_id": "52fe43679251416c7500f067",
               "name": "Farouk Bermouga",
               "profile_path": "/v4DmghjudqqqS3tUcAijBq3MlsL.jpg",
               "id": 283238,
               "order": 11
            },
            {
               "cast_id": 19,
               "character": "Mr. Loyal",
               "gender": 0,
               "credit_id": "52fe43679251416c7500f06b",
               "name": "Nicolas Donato",
               "profile_path": null,
               "id": 579328,
               "order": 12
            },
            {
               "cast_id": 20,
               "character": "Italian Megaphone",
               "gender": 0,
               "credit_id": "52fe43679251416c7500f06f",
               "name": "Enzo Etokyo",
               "profile_path": null,
               "id": 579329,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43679251416c7500f019",
               "name": "Patrice Leconte",
               "profile_path": "/dvtsf5ZlmnDOv1AIrG3kvM0tWZ2.jpg",
               "id": 37626,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe43679251416c7500f01f",
               "name": "Serge Frydman",
               "profile_path": null,
               "id": 65005,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43679251416c7500f025",
               "name": "Christian Fechner",
               "profile_path": null,
               "id": 11203,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43679251416c7500f02b",
               "name": "Hervé Truffaut",
               "profile_path": null,
               "id": 65006,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43679251416c7500f031",
               "name": "Jean-Marie Dreujou",
               "profile_path": null,
               "id": 20524,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe43679251416c7500f037",
               "name": "Joëlle Hache",
               "profile_path": null,
               "id": 35394,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 3.665234,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 10401,
      "vote_count": 47,
      "budget": 0,
      "overview": "It's night on a Paris bridge. A girl leans over Seine River with tears in her eyes and a violent yearning to drown her sorrows. Out of nowhere someone takes an interest in her. He is Gabor, a knife thrower who needs a human target for his show. The girl, Adele, has never been lucky and nowhere else to go. So she follows him. They travel along the northern bank of the Mediterranean to perform.",
      "similar": [
         1427,
         979,
         8065,
         46705,
         284276,
         996,
         43923,
         2048,
         707,
         77949,
         59967,
         2142,
         3600,
         283227,
         190469,
         8195,
         3134,
         168098,
         3989,
         86838
      ],
      "original_title": "La Fille sur le pont",
      "runtime": 90,
      "poster_path": "/ld5VGPwRsAvi6Gsv2tS0RCBQgZT.jpg",
      "spoken_languages": [
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "ελληνικά",
            "iso_639_1": "el"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "UGCF",
            "id": 36213,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Canal+",
            "id": 5358,
            "origin_country": "FR"
         },
         {
            "logo_path": null,
            "name": "France 2 Cinéma",
            "id": 15671,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Les Films Christian Fechner",
            "id": 461,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Sofica Sofinergie 5",
            "id": 23446,
            "origin_country": ""
         }
      ],
      "release_date": "1999-03-31",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Patrice Leconte"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Serge Frydman",
         "Serge Frydman"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0144201/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTA4MjI5NzAzOTJeQTJeQWpwZ15BbWU2MDc5NjcwOQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Vanessa Paradis, Daniel Auteuil, Frédéric Pfluger | See full cast and crew »"],
      "reviews": [
         "For years I was asking myself: the beauty of the early French films, the poetic realism, the simplicity and magic of the early Italian neorealists - where have they gone? I was missing that moment of pure cinema magic, the feel of people, the love for life in the movies. The unforgettable pictures of our childhood created by people like Carne and Vigo, Rene Clair, de Sica and Fellini. Now they are back. Patrick Leconte has created a very original, highly enjoyable little masterpiece that has it all in a modern movie. This beautiful black and white love story is a great moment of contemporary cinema that leaves you with that deeply happy feeling, that cinema sometimes seem to have forgotten about. As a producer and director myself, I was searching for a long time for any modern piece of film that picks up on that wonderful poetic movie tradition that combines reality with a flowing, surreal dream-like storytelling that your heart directly understands. Leconte's gentle and lighthearted, yet perfect command of visual language and editing makes this simple little story about a knife-thrower and cabaret artist and his \"victim\" and partner, a suicidal young woman, one of my happiest cinema experiences in the last 20 years. That people do this kind of movies these days, gives you hope. We need more movies like this. This is a film that nobody should miss that loves poetry, love, life and circus as major elements of cinema and human existence. Congratulations to Patrice Leconte and his inspired DP Jean Marie Dreujou.",
         "Girl on the Bridge is an absorbing piece of film fiction and, to my mind, an instant classic. From the choice of its stars to the use of a gritty, many shaded black to white spectrum, it is a spellbinding expression of director, Patrice Leconte's, mastery of the art of filmmaking. Every throw of the knife notches up the suspense to an ecstasy of fear on behalf of the characters you come to love. This is an unusual romance that leaves the viewer enlightened and lighthearted without any sacrifice of reality. The Girl is portrayed by Vanessa Paradis, who, in her person and in her manner, invokes memories of both Brigitte Bardot and Audrey Hepburn, a radiant, sensuous mix that is haunting and captivating. There's rapturous innocence despite her frequent and intense sexual encounters, and some part of her remains pristine throughout the most seemingly perverse scenes. Seduction for her must be emotional and intellectual, not merely sexual, because her body is routinely given, and through her experiences, we realize its satisfactions do not ultimately satisfy. Although some scenes recall other great pictures of yesteryear, such as The Seventh Veil, Girl makes new, inspired use of beloved film moments to make its own statement: the human spirit deepens and expands to the extent to which it trusts in, and is dedicated to, love. To love is to risk, and in this film of heart thumping suspense, we come face to face with the dangers love entails. Love, like this film, is not for the faint of heart. I, for one, am looking forward to my second time. Many compliments to Patrice Leconte and his wonderful collaborators!",
         "A 'quirky' story from a director who likes to keep the viewer guessing - as in the wonderful 'Hairdresser's Husband'.The dialogues are wonderful in this movie, far wittier than the semi-silly 'Ridicule'; Although the subtitles are not perfect (which they rarely are, it's a very tough craft), they were difficult to read on top of that, at least in the film print I saw. But the storyline and the relationship in the movie more than carries it. Because of the occasional awkward subtitling, some of the lines might seem sillier than they are in the original French. The black & white cinematography is truly outstanding, beautiful & fitting. Daniel Auteuil shows more physical liveliness in this role than usual, and he's a true pleasure to watch; but the heart of this movie is truly Vanessa Paradis - an outstanding performance, full of charm & and pathos. The chemistry between the principles is enchanting. Leconte has completely succeeded in presenting a 'higher love' story.",
         "Patrice Leconte's \"The Girl on the Bridge\" is a film that on second viewing seems better than when we first saw it. In a way, it appears to be a change of pace for M. Leconte, a man whose films have always been received well by his fans. As written for the screen by Serge Frydman, the movie presents a different take on love between two lonely people. In fact, this original film begins and end on bridges with a reversal in what Adele and Gabor are trying to do. At the start, it's Adele the one that is at the end of her rope, and at the conclusion, it's Gabor who does a complete role reversal when everything seems to be hopeless for him. Adele and Gabor never consummate their love as we follow when their lives comes together. Adele, during the interview with what appears to be either a social worker, reveals the sordid aspects of her life to the camera in an amazing sequence that sets the tone to the rest of the film. M. Leconte and his camera seem to be in love with the lovely Adele. The two principals, Vanessa Paradis and Daniel Auteuil are perfect in the film. Both actors do excellent work together. The magnificent black and white photography by Jean Marie Dreujou is perhaps the best asset for the film. The music score adds to the mood of the film.",
         "The old Hollywood formula, Boy Meets Girl, Cute, is given a nice French twist is this very funny and intriguing romantic comedy starring Daniel Auteuil and Vanessa Paradis. Paradis is Adele, a twenty-something waif who looks like a Parisian model except for the charming and disarming gap between her two front teeth. She's sur la pont and looking to jump off into the Seine. Auteuil appears as Gabor, a forty-something carnival knife thrower, looking for a new and more exciting target. He taunts her a little, shames her a bit. She gets insulted and jumps. He jumps in right after her. Well, I have it on good report that Nora Ephron is jealous as hell. I mean wouldn't, say, Meg Ryan and Mel Gibson just be adorable meeting like this? I...don't...think...so. For one thing, this would never work in the American cinema since one of the essentials is that the \"boy\" be twenty years older than the \"girl\" so that his patience with her frequent liaisons is plausible. Hollywood would have to find another slant on their relationship (something banal no doubt) and alter the ending to make it more romantic. But Hollywood can do that! Watch for the remake--a Nancy Meyers film, directed by Ephron--in theaters everywhere, circa 2010. Since the script, containing some very witty dialogue by Serge Frydman, and the fine acting by Auteuil and Paradis, carry the show, Director Patrice Leconte was able to film this on the cheap in glorious black and white, which doesn't detract from the film at all. I didn't really notice there was no color until about twenty minutes in because I was so taken with, first, Paradis as the girl who could never say no, and then Auteuil who is funny, commanding, and obviously having a great time. By the way, the device of her being interviewed to open the film makes us think for a moment that we are being shown a video recording of that interview. Following a well-established cinematic convention of rendering video recordings in black and white, this makes our minds accept the black and white cinematography without question. Paradis is child-like and sexy by turns. The scene after the train passes and she says to Gabor something like, \"You KNOW what I want to do, and I want to do it NOW,\" leads to a rather strange, but clearly erotic, symbolic sexual experience. Paradis plays her part very well. The theme is the mystery of capricious luck, believed in passionately by those who feel they have none, which is how Adele and Gabor feel before they meet each other. Together, however, they can call the number at roulette, win at the lottery, and find gold on the ground! The enigmatic and rather predictable ending warrants some pondering. Are they going to live happily ever after as man and wife, lovers, or as a kind of father/daughter team? It's not clear, and that's deliberate. Draw your own conclusions, but don't miss this one. It's definitely worth seeing. (Note: Over 500 of my movie reviews are now available in my book \"Cut to the Chaise Lounge or I Can't Believe I Swallowed the Remote!\" Get it at Amazon!)",
         "In Paris, the needy and unlucky Adèle (Vanessa Paradis) is a complete loser, used by all the men in her life. In a Parisian bridge in the night, when the Adèle is close to commit a suicide, a knife thrower Gabor (Daniel Auteuil) invites her to be her target in his show. She accepts the invitation, and they become a great success in show business. Like to halves of a bill, when they separate, they become losers again, and realize that only together they would succeed in life. \"La Fille Sur le Pont\" is a magnificent and delightful fable about two half-souls who meet each other in a Parisian bridge, completing their lives with lucky and happiness. The story in some moments recalls the wonderful movies of Frank Capra, in other moments is quite erotic. The performances of Daniel Auteuil and Vanessa Paredis, showing a perfect chemistry, deserve a nomination to the Oscar, most of their dialogs are fantastic, the direction of Patrice Leconte is splendid as usual and the black& white photography is stunning. \"La Fille Sur le Pont\" is a movie to be revisited many times and highly indicated to fans of filmed poetry. My vote is nine. Title (Brazil): \"A Garota da Ponte\" (\"The Girl of the Bridge\")",
         "Two tragic characters: A beautiful girl, on the edge of a bridge contemplating suicide, and a broken man, on the same bridge for the same reason. The man is a believer. He believes in fortune. He's been around, and he's seen many things. He can tell when the wheels of fortune are turning, and in the face of the young girl he sees salvation for them both. He senses a feeling stronger than fate or Kismet or whatever you want to call it. A conviction that two people can be made for each other, that two people can connect in a way imperceivable and unobtainable for most of the world, a connection so deep and so strong, that it can make them invincible. In most movies of this kind, you expect the characters to discover how right they are for each other along the way. In this movie they know it the instant they meet, but they're too proud and too overwhelmed to accept the fact that it could be so easy. Patrice Leconte takes us on a wonderful journey around Europe, and fills each black and white frame with such colorful feelings that it's next to impossible not to be taken in by the mere suggestion that there can be a perfect match for each person, and that together they can take on the world. La fille sur le pond, is a movie about fortune, destiny, love, danger, lust, luck, romance but above all, I think that it's about connection. Connection on a level so high that it becomes divine. This movie is unique and in it I find refuge whenever I feel alone or lonely.",
         "An artfully shot, black and white contemporary French film, \"Girl on the Bridge\" is a peculiar sort of romantic drama about a man and a woman bound together by an alloy of danger, fatalism, luck, libidos, and sharp steel. On one level the film is preposterous; on another, implausible; and yet on another a compelling, fantastic drama. A good watch for the jaded.",
         "... this one's very far from being one of them, unfortunately. Populist detractors of French cinema, knee-jerk Europhobes, phobics of subtitles, blinkered viewers who divide all cinema between Hollywood vs. \"pretentious\" art-house: if you really want to pick on a French movie that you think embodies all the clichés of Gallic cinema you so love to hate, take your vitriol out on this one! Leave masters like Rivette, Truffaut, Resnais, Rohmer, Denis, Varda and other, much better Leconte movies alone! La Fille Sur le Pont's main players: Gabor, a middle-aged man played by the ubiquitous, but always pleasant to watch Daniel Auteuil and Adèle, a lithely beautiful, gazelle-like young woman who has the face of Vanessa Paradis. Predictably, Adèle is emotionally messed up, fragile and yet sexually promiscuous. The two meet when the charismatic grouch, Gabor, intercepts the girl on a Parisian bridge and prevents her from committing suicide (wasn't that also how Emmanuelle Béart's character and her boyfriend met in La Belle Noiseuse?). Gabor is an itinerant knife-thrower, by the way - sans toit ni loi. Naturally enough, since we are talking about a girl who has nothing to lose, Adèle becomes his target. Despite the rocky beginning, in which the two spend much time squabbling, there is naturally a strong attraction between them (in fact, as clichéd as all this may sound, the first 20 minutes of the movie, in which Gabor and Adèle's relationship is first established, were my favourites). We even get to meet a previous living target of Gabor's, a woman now performing in another circus number, at the venue where Adèle is about to perform for the first time. We see that this \"ex\" of Gabor's is also fragile and messed up, besides still preserving a clingy dependence on the knife-thrower. So, it seems that what Gabor has to offer women is somehow life-affirming, and better than sex. And in fact, watching Gabor and Adèle at work, you cannot help thinking: who needs these two to literally have sex when all that knife-throwing is more suggestive of penetrative sex than a steamy Tinto Brass scene of your choice? In retrospect, I think this movie's main merit was to make me discover how charming and beautiful Johnny Depp's squeeze is - I had no idea. Sadly, Vanessa Paradis could not save the little movie from being just a nice-looking, superficially funny, substanceless piece of fluff, furthermore a hit-parade of French movie clichés that I thought would be beneath Leconte. Beineix's Betty Blue, Senta from Chabrol's silly La Demoiselle d'Honneur, Romane Bohringer's character in L'Appartement, even Jeanne Moreau as Catherine in Jules et Jim, and countless others: why are so many women in a certain category of French cinema invariably characterized as fragile and irrational, unsettlingly unpredictable and self-destructive, even suicidal? Yet, they are also intoxicatingly seductive and sexually voracious, fickle and capricious. They're the ultimate misogynist's sex fantasy, a woman that frightens (the vagina dentata myth being a symbolic exasperation of this fear of femininity) and enslaves the male (because sexual attraction is biologically inescapable). Paradis's Adèle was in fact a rather tone-down, sweetened version of one such stock female creation - in fact, perhaps a part of Leconte was distancing himself from this prototype and playing with it, though the other part of him was embracing it. But the fact that in the end Leconte shows us Gabor's fragility and Adèle's nascent strength goes some way towards showing that the director was also partly turning the stereotype on its head. The \"Betty Blue\" is what I call the female French movie prototype of the fragile-sexy-doomed heroine, which DOES certainly also exist in other cinematic traditions, though I seem to observe it more often in French movies. It's a fictional embodiment of womanhood that can be traced right back to the doomed \"femme fatales\" of the 19th century French artistic movement The Symbolists. The scenes of La Fille Sur le Pont that were set in Italy, Greece and Turkey were rather dubious in their astonishingly twee and simplistic stereotyping as well. They were the equivalent of accompanying any scene set in Paris with sappy accordion music and a view of the Eiffel tower in the background. Was Leconte trying to be \"Fellinian\" in that raffle scene in San Remo? Oh, puhleez! Give me Tandem, Ridicule or L'Homme du Train any day over this candy floss, Patrice.",
         "A trustworthy value of contemporary French cinema (in 1996, the French Minister for Arts and the director of the national center of the cinematography hailed him as a French worthy ambassador), Patrice Leconte can brag himself to rank among a handful of French filmmakers whose popularity is continual in France and abroad, especially since \"Ridicule\" (1996) was virtually unanimously lauded. On this site, several of his films exceeded the 1000 even 2000 votes mark. This one \"la Fille Sur Le Pont\" is near to the 3000 votes mark and appears to be the most well-known of Leconte's flicks abroad. A word to his devotees and they seem to be numerous: I urge them to watch \"Tandem\" (1987). It is Leconte's towering achievement and his sleeper. To come back to \"la Fille Sur Le Pont\", this cracker basically revolves around a young girl, Adèle (Vanessa Paradis). She's only 20 years old and she got a raw deal. Apparently interviewed by an emcee on the telly, she assesses her rueful life and can't see her future. One evening, she's cracking up and is about to jump from a bridge into the river Seine. Fortunately, she's saved at the last minute by a knife-thrower, Gabor (Daniel Auteuil) who becomes fond of her. He hires her as the target for his show and will make her enjoy life again. From then onwards, luck smiles on them, the lead a freewheeling adventure and Gabor becomes increasingly enamored of his young protégée. \"La Fille Sur Le Pont\" is the movie in Leconte's filmography which heralds a series of films in which a love story is one of the staple elements of these flicks. It is perhaps the artistic success of this film which incited him to continue in this vein with the subsequent pieces of work \"la Veuve De Saint Pierre\" (2000), \"Félix et Lola\" (2001) and at last \"Rue Des Plaisirs\" (2002). In reality, Leconte had already adventured in the domain of the love story well before \"la Fille Sur Le Pont\". Love stories were main threads in the nearly dreamlike \"Le Mari De La Coiffeuse\" (1990) and \"Le Parfum d'Yvonne\" (1994) and they gave brilliant results. When I read Leconte's intentions on this film, I had misgivings. The director wanted to make a work which was supposed to be a homage to the New Wave, hence the shooting of Gabor and Adèle's adventure in a black and white cinematography. Leconte had lauded François Truffaut and Jean-Luc Godard as \"masters\". Ahem!... There's no accounting for taste. But he kept his trademark and his movie remains accessible to everyone who likes being told a story. The liberties dear to the New Wave clique are subdued and tamed, a stabled content and form with perhaps an emphasis on the content, no amateurish side in the directing, except in the very first sequence and a scenario which encapsulates several directives including a classic but absorbing storytelling and an analysis of the two main protagonists' persona. Leconte pulls off with gusto to create a timeless atmosphere. The first sequence comes out of the blue and sets the scene for the unique aura in which the film bathes. It is realism and fairy tale in the same package. Everything in the scenery, the costumes, the cinematography and the directing seem to be dovetailed to produce this pristine poise. An impression reinforced by a discerningly chosen music. But also, \"la Fille Sur Le Pont\" is a success story and Leconte is very astute at this game. He refuses a good number of constricting codes of the genre or diverts them in a neat way. For example, the viewer will have to wait the tail end to see Gabor and Adèle exchanging their first kiss. The scenarist Serge Frydman did a first-class job with an abundance of witty cues. My favorite lines are: \"Knives are dangerous\" \"you know, everything's dangerous nowadays...\" or \" the first time I had sex, it was uncomfortable\" \"yes the first time you have sexual relationships it is usually uncomfortable\" \"no no, it was in the toilets of a gas station. It was uncomfortable\". Always on the plus side, Leconte was obviously interested with the persona of his two main characters and perhaps more Gabor than Adèle. In spite of his apparent self-confidence and his deadpan humor, he conceals a deep vulnerability and has his own weaknesses. Like Adèle, he's unsure about the future (check the sequence when he's on the rails and a train arrives in front of him). He's a \"Lecontian\" hero par excellence. He's apparently sure of himself but hides a deep fragility. He is also admirably portrayed by Daniel Auteuil who garnered a deservedly César in 2000. As for Vanessa Paradis who when she was 14 years old scored a big hit in France with \"Joe Le Taxi\", she unveils another face of herself with unsuspected skills of actress. With a \"feel-good\" sentiment which suffuses the whole movie, \"la Fille Sur Le Pont\" is the ideal flick to restore confidence to the ones who lost it. Gabor says that \"luck is a matter of life and death\" but when it affects someone at a loss, it can work wonders. A wondrous movie to rank among the magnum opus in Leconte's filmography."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Canal+",
         "France 2 Cinéma",
         "Les Films Christian Fechner"
      ],
      "summaries": ["It's night on a Paris bridge. A girl leans over Seine River with tears in her eyes and a violent yearning to drown her sorrows. Out of nowhere someone takes an interest in her. He is Gabor, a knife thrower who needs a human target for his show. The girl, Adele, has never been lucky and nowhere else to go. So she follows him. They travel along the northern bank of the Mediterranean to perform and in the process win a big fortune through gambling. Although both of them continue a platonic relationship, the sex-starved girl attempts to sleep with handsome guys she encounters throughout the journey. Finally, Adele falls in love with a newly-wed groom and both of them elope to Greece, while Gabor is stuck in Turkey. Then Adele is dumped by the groom. Only by now both Gabor and Adele realize that luck isn't with them unless they get together again. But both of them are so broke that they can't even feed themselves, let alone getting back to Paris and reunite..."],
      "budget": 0
   },
   "movielensId": 3822,
   "movielens": {
      "languages": [
         "Français",
         "ελληνικά",
         "Italiano"
      ],
      "releaseDate": "1999-03-31",
      "dvdReleaseDate": "2000-11-27",
      "directors": ["Patrice Leconte"],
      "runtime": 90,
      "movieId": 3822,
      "title": "The Girl on the Bridge",
      "mpaa": "",
      "actors": [
         "Vanessa Paradis",
         "Daniel Auteuil",
         "Demetre Georgalas",
         "Catherine Lascault",
         "Frédéric Pfluger",
         "Isabelle Petit-Jacques",
         "Mireille Mossé",
         "Didier Lemoine",
         "Bertie Cortez",
         "Stéphane Metzger",
         "Claude Aufaure",
         "Farouk Bermouga",
         "Nicolas Donato",
         "Enzo Etokyo"
      ],
      "imdbMovieId": "0144201",
      "originalTitle": "La Fille sur le pont",
      "genres": [
         "Drama",
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["5Tsg_dVhNi4"],
      "plotSummary": "It's night on a Paris bridge. A girl leans over Seine River with tears in her eyes and a violent yearning to drown her sorrows. Out of nowhere someone takes an interest in her. He is Gabor, a knife thrower who needs a human target for his show. The girl, Adele, has never been lucky and nowhere else to go. So she follows him. They travel along the northern bank of the Mediterranean to perform.",
      "tmdbMovieId": 10401,
      "avgRating": 3.82817,
      "releaseYear": "1999",
      "numRatings": 678,
      "posterPath": "/ld5VGPwRsAvi6Gsv2tS0RCBQgZT.jpg"
   }
}