{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "london england",
            "id": 212
         },
         {
            "name": "sibling relationship",
            "id": 380
         },
         {
            "name": "waitress",
            "id": 828
         },
         {
            "name": "weekend",
            "id": 2677
         },
         {
            "name": "personal ad",
            "id": 175499
         }
      ],
      "imdb_id": "tt0171865",
      "video": false,
      "title": "Wonderland",
      "recommendations": [
         131366,
         150630,
         10146,
         99657,
         44914,
         138522,
         118153,
         83374,
         13798,
         26851,
         59950,
         94393,
         43000,
         80705,
         246473,
         28974,
         25497,
         54140,
         30784,
         42984
      ],
      "backdrop_path": "/y7m9cK4HY89QfiMy9PEHMGhuSUk.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Debbie",
               "gender": 1,
               "credit_id": "52fe44e09251416c9101fed7",
               "name": "Shirley Henderson",
               "profile_path": "/jP59SLmQj6fdInN7n0pLvl5jjQf.jpg",
               "id": 1834,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Nadia",
               "gender": 1,
               "credit_id": "52fe44e09251416c9101fedb",
               "name": "Gina McKee",
               "profile_path": "/pyPapwCdP9rL7PGnD1MRjHZg4Nd.jpg",
               "id": 18022,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Molly",
               "gender": 1,
               "credit_id": "52fe44e09251416c9101fedf",
               "name": "Molly Parker",
               "profile_path": "/iCG1XrXkg09R9eK52PYUEA3HVX5.jpg",
               "id": 27125,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Dan",
               "gender": 2,
               "credit_id": "52fe44e09251416c9101fee3",
               "name": "Ian Hart",
               "profile_path": "/35KSRxsFR20QGDhIrZn7G4Jkc2g.jpg",
               "id": 10985,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Eddie",
               "gender": 2,
               "credit_id": "52fe44e09251416c9101fee7",
               "name": "John Simm",
               "profile_path": "/5D2ZDf6yX65fnvzvE9hIT6D30b4.jpg",
               "id": 42604,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Tim",
               "gender": 2,
               "credit_id": "52fe44e09251416c9101feeb",
               "name": "Stuart Townsend",
               "profile_path": "/8xnPcuwJEz2aiPr4NoqgfBj6lnW.jpg",
               "id": 56778,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Darren",
               "gender": 2,
               "credit_id": "52fe44e09251416c9101feef",
               "name": "Enzo Cilenti",
               "profile_path": "/lGFHPUsOlAnncpZLfdFXCGq2nji.jpg",
               "id": 91494,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Melanie",
               "gender": 1,
               "credit_id": "52fe44e09251416c9101fef3",
               "name": "Sarah-Jane Potts",
               "profile_path": "/ht2y7pN4Ud91EangkRmnMWYwaJu.jpg",
               "id": 80417,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Eileen",
               "gender": 1,
               "credit_id": "52fe44e09251416c9101fef7",
               "name": "Kika Markham",
               "profile_path": "/fSMt8f9B1mQQPF6x0FcUk1Viq5C.jpg",
               "id": 42567,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Bill",
               "gender": 2,
               "credit_id": "52fe44e09251416c9101fefb",
               "name": "Jack Shepherd",
               "profile_path": "/dnqU4tBeRI1zAh0c70PZJJOZCAE.jpg",
               "id": 45587,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Franklyn",
               "gender": 2,
               "credit_id": "555a377ec3a3682f61002b96",
               "name": "David Fahm",
               "profile_path": null,
               "id": 111437,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "Donna",
               "gender": 1,
               "credit_id": "590286ed9251413e210006cd",
               "name": "Ellen Thomas",
               "profile_path": "/4eXX2U6Ho7bbcQzyN9HM0pj2x4O.jpg",
               "id": 30434,
               "order": 11
            },
            {
               "cast_id": 23,
               "character": "Jack",
               "gender": 0,
               "credit_id": "59028703c3a368291d0006e2",
               "name": "Peter Marfleet",
               "profile_path": null,
               "id": 1805471,
               "order": 12
            },
            {
               "cast_id": 20,
               "character": "Alex",
               "gender": 0,
               "credit_id": "5660615e92514179130038ab",
               "name": "Nathan Constance",
               "profile_path": "/9SWqFotcZ57nMC3rUg64ruOKG69.jpg",
               "id": 1220314,
               "order": 13
            },
            {
               "cast_id": 21,
               "character": "Danny",
               "gender": 0,
               "credit_id": "58961242c3a368089f00cc05",
               "name": "Anton Saunders",
               "profile_path": "/iIYHxvZx7HcV5FNIeFCdvHAyRjs.jpg",
               "id": 208460,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44e09251416c9101fecd",
               "name": "Michael Winterbottom",
               "profile_path": "/hnzUhUXiWy7ThflTzPTRb869mnB.jpg",
               "id": 172,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44e09251416c9101fed3",
               "name": "Laurence Coriat",
               "profile_path": null,
               "id": 109478,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.071951,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 32640,
      "vote_count": 12,
      "budget": 0,
      "overview": "There's little wonder in the working-class lives of Bill, Eileen, and their three grown daughters. They're lonely Londoners. Nadia, a cafe waitress, places personal ads, looking for love; Debbie, a single mom, entertains men at the hair salon after hours; her son spends part of the weekend with her ex, a man with a hair-trigger temper. Molly is expecting her first baby and its father acts as if the responsibility is too much for him.",
      "similar": [
         634,
         1562,
         253,
         646,
         657,
         667,
         699,
         708,
         714,
         334,
         8967,
         858,
         866,
         244772,
         111,
         2288,
         4347,
         277216,
         122906,
         11012
      ],
      "original_title": "Wonderland",
      "runtime": 108,
      "poster_path": "/2Po9R5qBcIofbeIlUcIXslsEEDI.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/16fY7pucCzn7WSOYxOGRHlAayL3.png",
         "name": "British Broadcasting Corporation (BBC)",
         "id": 3324,
         "origin_country": "GB"
      }],
      "release_date": "1999-05-13",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Michael Winterbottom"],
      "runtime": 108,
      "synopsis": null,
      "writers": ["Laurence Coriat"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0171865/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUwMDgxOTM3N15BMl5BanBnXkFtZTcwMzc4MTIyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Shirley Henderson, Gina McKee, Molly Parker | See full cast and crew »"],
      "reviews": [
         "I caught this on TV without knowing who it was by and I was instantly captivated. The first thing is that it's filmed and set where I live, around the Elephant and Castle, as well as in Soho, and it's about the people I see every day. It's absolutely spot on about the kind of lives people around here lead and the way individuals and different social groups interact. What lifts it above the sort of social realism common in British cinema is the cutting, the cinematography and Michael Nyman's lovely music, which must be his best work post-Greenaway. While I've never been a big fan of the 'poetry of degradation' school of art, somehow the ugliness and squalor of South East London are transformed by this film and the lives of the characters are invested with real dignity. Though it may deal with the same sort of subject matter as Ken Loach or Mike Leigh, the style and approach are very different - the difference between a great piece of prose and a poem. I guess you could say Winterbottom and Nyman do for London what Scorsese and Herrmann did for New York in Mean Streets and Taxi Driver. This is a beautiful film and I feel real gratitude to Michael Winterbottom for bringing our lives to the screen in such a way.",
         "This may be the best film of 2000 (at least that's when it was released in Australia). Whilst film-makers like P.T. Anderson have made admirable attempts at personal drama in the last few years, and Mike Leigh continues to tell us that no-one suffers like the poor (as if we didn't know that), Michael Winterbottom has re-defined the genres. This is English kitchen sink drama without the tired clichés of class wars, which have seemed a bit anachronistic since the fall of the Tories. Shot in a stunning cinemascope (1:2.35) and available light, with the tiniest of crews, this is London as you've only seen it if you've seen it for yourself. The cast shines. I defy anyone to make it through this film without falling in love with Gina McKee. That's not to say that Shirley Henderson and Molly Parker are anything less than charming. Ian Hart and Stuart Townsend are wonderful. Keep an eye out for the beautifully natural performance of David Fahm as Franklyn. Jack Shepherd, Kika Markham and John Simm round out the main cast with equally powerful performances. A great script from first time screen-writer Lawrence Coriat. Michael Nyman turns out his most subtle and restrained music score yet. Michael Winterbottom is turning out to be the Stanley Kubrick of the 21st century. Who else has been able to jump from one genre to another with such ease and grace? This is a compelling film, well worth having your own copy of.",
         "The city of London has featured in innumerable films - a vast, intensely varied metropolis, it has served as a vivid backdrop countless times. From the sun-drenched banks of the Thames in 'Four Weddings and a Funeral' to the gloomy squalor of Camden Town in 'Withnail & I' it is always an interesting setting for a story. But in 'Wonderland', directed by Michael Winterbottom ('Jude', 'Welcome to Sarajevo'), it almost gains a life of its own. Superficially a story of the day-to-day lives of three sisters, Wonderland is more about the city and the millions of people who live in it than the troubled family the plot centres on. They are Nadia (Gina McKee), a single woman desperately in search of friendship and romance, Debbie (Shirley Henderson), a single mother with a young son (Peter Marfleet) and Molly (Molly Parker), a pregnant woman whose husband (John Simm) is having doubts. The camera follows them (mostly Nadia) as they travel through the busy streets of the capital. It does not concentrate on just the characters, often lingering on faces and groups, giving the film a real-life edge. This is added to by the hand-held camera work and the slightly grainy quality of the image, which is as though a much larger picture has been magnified to concentrate on these people. The stories themselves are uniformly (and depressingly) realistic, although they all end on a high note, leaving the viewer surprisingly upbeat. Winterbottom has a knack of coaxing great performances from good actors and does not fail here, with the quietly miserable couple of Kika Markham and Jack Shepherd as the sisters' parents standing out. Wonderland will never break any box office records and is certainly not flawless, but it is an admirable film and it warms the cockles of this reviewer to see such worthy films still being made in Britain.",
         "This film hit home and touched me so deeply on a personal level, its not even funny. And I believe it should have a fairly wide appeal, as well. The main limiting factor is that it may only be fully appreciated by Britons and anglophiles. There are so many specifics of daily working class London life, and the accents are slightly thick, that non-Britons may not be able to connect. I read a review of this film in the Village Voice (it was very positive, and I rented the title on the strength of the recommendation) and one of the things it said was that this film didn't avert its eyes from the ugly things in life. And that is exactly what give this film is weight and poignancy. This film even manages to capture one of the most difficult (and therefore least often seen, in films) aspects of modern working class life: the mind numbing crassness, tedium and insignificance. And at the same time, it manages to give dignity to these people's lives and gives them hope for finding threads of meaning in the garbage heap of modern life. The thought that came most forcefully to me at the end of this film was: how many years of suffering do the working class have to endure before their lives are portrayed with dignity and meaning? One thing about this film that is consistently downbeat, and that the film maker had the good sense not to try and sugar coat, is the awful over crowding in modern Britain. This aspect is truly horrific, suffocating and overwhelming. And maybe this is the most topsy-turvy aspect of this film, that modern Britons are expected to endure this with good grace, but I don't know, I can't say. The music is lovely as well, very well chosen, very understated. And its all in a minor key, of course. Its films like this that re-affirm my faith in film as an artistic medium. But, although this film gives a sweet dignity to the recent past, it doesn't seem to hold out any real hope for the future. And it is this sidestepping of facile hopefulness where this movie really hits the deepest. This film says, in my opinion, that any progress towards a livable future is going to take everything we have to struggle to achieve.",
         "This isn't a cute film. It's no \"Notting Hill\", that's for sure. How London has been portrayed in this film is no advert for the place. Cold, nervous, loud, lonely. This is London. Warts and all. Shot in an eerie, lonely manner the film deals with individuals, whose lives have criss-crossed (or ultimately will). I suppose at the hub of the film is a tired train-wreck of a marriage between two upper middle-aged people. The mother, unable to show affection, unable to give anything at all, and a father who keeps the act up, while hurting deep down. He's popular with the neighbors, his wife is aggressive, spiteful and is in denial of what a couch-potato she has become. They have four children, all \"adults\". Three girls and a son, of whom they have very sparse contact (the father dotes, and longs for him). It's in the lives and relationships of the three daughters that the film is centered. All of whom have scars from their up-bringing. I presume the mother's problems have been handed over to the girls. One, a young mother, has difficulty showing affection to her son. Another constantly on the look out for someone to love her. It's very, very agonizing. The third daughter is heavily pregnant, and is in a relationship with a guy who has problems of his own. Gritty. Scary and ultimately warm. (Well a few degrees above 0 Kelvin, anyway). I found it very interesting. Makes one think.",
         "This movie has only just come out on DVD in Britain, that is a shamefully long time for a film to reach the country it was made in. But now it is here, and possibly finding a new audience, I thought I'd write a quick review. If you have read some of the other reviews, you will no doubt be aware of the 'kitchen sink' factor in this film. Well, I'm not going to deny that, the subject matter would not look out of place in a soap opera. . . .however it is the performances, the script and the fantastic style of this movie which pulls it out of the mundane and into the cinematic. Michael Winterbottom is clearly a director who like several of his British contemporaries such as Mike Leigh and Shane Meadows, believes that the drama around us in everyday life is worthy of the big screen. The film has a fine ensemble of characters, three very different sisters, their estranged brother and squabbling parents. The performances are brave and heartfelt in all cases, and even though the drama takes place over one weekend, the characters really do evolve. The most enticing thing about the film is the way it is shot and scored. Sean Bobbitt's time lapse photography and dogma style 16mm cinematography combined with Michael Nyman's emotive music is a really fantastic combination. This film shows London how the people who live there see it, namely from the ground. Nearly every film set in London now seems to have to include the Gherkin, the Tate modern and the Millennium wheel, what Winterbottom presents us with is something simultaneously far less and far more remarkable.",
         "Although not classified as a film for TV, `Wonderland' is very much in the style of a production for that media, and indeed might even be classified as `soap-opera'. But forget anything and everything you have seen of that type of film: `Wonderland' is totally in another sphere, with a well-constructed story of a long-weekend, magnificently natural performances and excellent dialogues. One constantly thinks of the theatre playhouse element as the actors carry forward this sociological document, excellently choreographed by Michael Nyman´s music. Here indeed is a richly rewarding 100-odd minutes of your time. The characters are immediate and thus so real that you cannot but fail to be swept into the story. Intertwining levels from the elderly couple, down through their daughters to the young grandson, all lends palpable reality to the price of living in the backdrops of a teeming faceless city. Set over the weekend on which the ever faithful and conservative British continue celebrating `Guy Fawkes Night' commemorating the attempted blowing up of the Houses of Parliament by said Guido Fawkes a few centuries ago, the film cleverly brings together ordinary Londoners at a particular moment which undoubtedly is crucial to each of them. The cast is splendid; the performances are exactly right, natural, and thus so realistic; there is no forced over-the-top stuff here. Whereas I can easily sympathise with the symptomatic causes underlying the nonentity of suburban life in gigantic cities, and therefore can easily feel for these people in Winterbottom's very welcome offering in this film, I can so easily again see why, when barely twenty, I took to my heels and left London for other pastures. Thanks for reminding me, Mr. Winterbottom. But thanks also for a fascinating insight into fine character-making in a very enjoyable film.",
         "'Wonderland' is a story about ordinary people told in an extraordinarily beautiful way. The visual style of the film draws you close--you're not watching a movie, but you are an observer, an eavesdropper on the lives of a South London family and their friends. It's almost as if you saw someone on the bus, and then were able to follow them to their home and around where they work, unseen, for a few days. You believe these people exist, in reality--you _recognize_ these characters because you've seen them before. There's an incredible musical score by Michael Nyman. It supports and builds the drama of the story, and illuminates the inner struggles of the characters. It's a beautiful movie. Fans of Wong Kar-Wai's ChungKing Express will enjoy this. I saw this movie at a Saturday midnight showing in Barcelona, with Spanish subtitles. You could feel the emotion run through the audience. Everyone stayed for the credits.",
         "This is a very artful piece of work which looks like it was made by the Dogma mob \u0096 hand \u0096held camera, minimal lighting, grainy film, but it is actually very well put together by Michael Winterbottom with superior acting, good musical score (by Michael Nyman) and a reasonable amount of dramatic tension. Initially I thought `God this is boring' as three days in the life of three sisters and their family, lovers and friends, all ordinary Londoners, unfolded, but by about a third of the way through it got interesting. By the end I was starting even to care about the characters. It was a little like watching a television series where the fairly ordinary characters unfold slowly, but somehow over time get a hold on your imagination. Except of course this film is just over 100 minutes long. We see most of the story through Nadia, the middle sister, played by Gina McKee, who last popped up at a dinner party in `Notting Hill'. This time it's inner South London, and Nadia is answering lonely hearts ads without great success. Her older sister Debbie (Shirley Henderson, the tiny diva from `Topsy Turvy') who has an ex husband and a 10 year old son, seems to have no trouble picking up men, while Mollie (Mollie Parker) the youngest, is awaiting the birth of her first child. In a whirl of lights, crowded streets, traffic, noisy bars, cigarette smoke and small ill-lit rooms, their interwoven stories are played out. In the background, but close at hand are Mum and Dad, despising each other but still living in the same house. All the sisters are well portrayed but Kika Markham and Jack Shepard, trusty old troupers that they are, practically steal the show as the disillusioned parents. The sister's men (and their mostly absent brother) are portrayed as weak, shallow or stupid, but the sisters are a forgiving bunch (unlike their mother). It really is quite an achievement to make an interesting, honest movie about lives so mundane that they make `This Life' look like `Melrose Place'. If I were such an ordinary Londoner and I saw this film I think I'd experience the shock of recognition. And then consider emigrating. The life of the contemporary ordinary female Londoner is not far removed from quiet desperation, it seems. And perhaps that's so for the men too. It's just that they notice it a bit less.",
         "\"Wonderland\" is a well-articulated drama about working people in London going through the emotional chaos of everyday life. What makes it special is that it shows a family with little or no parental support struggling to hold together by the fortitude of its siblings. It is a special film in two other ways: characters act out their roles within unstaged, real world settings and, at the same time, the characters are shown, mostly in isolation, responding to these same settings. By doing so, the film highlights even more the chaotic, transitory, and even aimless behaviors of urban life. We see the mother, Eileen (Kika Markham) relieving her frustrations by playing in an actual bingo hall, the estranged father, Tim (Stuart Townsend) taking his son Jack (Peter Marfleet) to a wildly contested soccer match, an emotionally wounded woman, Nadia (Gina McKee) riding a double-decker bus filled with revelers, and the piece-de-resistance of one of the pregnant characters, Molly (Molly Parker) giving live birth. The film even uses fast forwarding frames in two scenes, one involving Nadia and her lonely-hearts club failures and the other when the dishonest husband James cannot return home to his wife, to illustrate their out of control, misdirected lives. Another treat of this film is that we don't initially know the identity of the characters and their connection to each other until the film slowly unfolds bits and pieces of their story. While that might tax the patience of some people, I became much more alert to the story. What was annoying was the overemphasis on the background nightlife of London and the heavy dramatic score, a score that seemed to tip off in at least two places that the film was prematurely ending. Overall, \"Wonderland\" is a well-acted, worthwhile film because it successfully portrays real-life situations involving real-life struggles in a unusually candid and poignant way."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "British Broadcasting Corporation (BBC)",
         "Kismet Film Company",
         "PolyGram Filmed Entertainment"
      ],
      "summaries": ["There's little wonder in the working-class lives of Bill, Eileen, and their three grown daughters. They're lonely Londoners. Nadia, a cafe waitress, places personal ads, looking for love; Debbie, a single mom, entertains men at the hair salon after hours; her son spends part of the weekend with her ex, a man with a hair-trigger temper. Molly is expecting her first baby and its father acts as if the responsibility is too much for him. Eileen is bitter, complaining about her husband and the dog next door; Bill's a doormat. His West Indian neighbor offers him a drink; her own grown son locks himself in his room most of the time. Will anyone connect during this Guy Fawkes weekend?"],
      "budget": 0
   },
   "movielensId": 3823,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-05-13",
      "dvdReleaseDate": "2001-02-20",
      "directors": ["Michael Winterbottom"],
      "runtime": 108,
      "movieId": 3823,
      "title": "Wonderland",
      "mpaa": "",
      "actors": [
         "Shirley Henderson",
         "Gina McKee",
         "Molly Parker",
         "Ian Hart",
         "John Simm",
         "Stuart Townsend",
         "Enzo Cilenti",
         "Sarah-Jane Potts",
         "Kika Markham",
         "Jack Shepherd",
         "David Fahm",
         "Ellen Thomas",
         "Peter Marfleet",
         "Nathan Constance",
         "Anton Saunders"
      ],
      "imdbMovieId": "0171865",
      "originalTitle": "Wonderland",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["OuXCatJa9ys"],
      "plotSummary": "There's little wonder in the working-class lives of Bill, Eileen, and their three grown daughters. They're lonely Londoners. Nadia, a cafe waitress, places personal ads, looking for love; Debbie, a single mom, entertains men at the hair salon after hours; her son spends part of the weekend with her ex, a man with a hair-trigger temper. Molly is expecting her first baby and its father acts as if the responsibility is too much for him.",
      "tmdbMovieId": 32640,
      "avgRating": 3.59176,
      "releaseYear": "1999",
      "numRatings": 425,
      "posterPath": "/8IY99QjN6jeTrfu7Q4eiKAaiYE0.jpg"
   }
}