{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "new love",
            "id": 1605
         },
         {
            "name": "love of one's life",
            "id": 2038
         },
         {
            "name": "unexpected happiness",
            "id": 2203
         },
         {
            "name": "dying and death",
            "id": 3737
         },
         {
            "name": "success",
            "id": 3836
         },
         {
            "name": "kiss",
            "id": 5091
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "relationship",
            "id": 14534
         },
         {
            "name": "unhappiness",
            "id": 156455
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "fear of dying",
            "id": 222114
         }
      ],
      "imdb_id": "tt0174480",
      "video": false,
      "title": "Autumn in New York",
      "recommendations": [
         4806,
         4380,
         9441,
         9560,
         1921,
         10862,
         2057,
         8874,
         4823,
         2251,
         11823,
         4478,
         397,
         14326,
         1641,
         17813,
         6435,
         2018,
         11232,
         795
      ],
      "backdrop_path": "/zXsskYrKF8QSivBykfMp48AdtuM.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Will Keane",
               "gender": 2,
               "credit_id": "52fe439a9251416c75016d4d",
               "name": "Richard Gere",
               "profile_path": "/hqMhNyTqIStibnhBh8SjyfpU665.jpg",
               "id": 1205,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Charlotte Fielding",
               "gender": 1,
               "credit_id": "52fe439a9251416c75016d51",
               "name": "Winona Ryder",
               "profile_path": "/gUyEOZpZlGBUkUxCxyoLEc9WejR.jpg",
               "id": 1920,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "John Volpe",
               "gender": 2,
               "credit_id": "52fe439a9251416c75016d55",
               "name": "Anthony LaPaglia",
               "profile_path": "/22sOEc37TsxxcnIl1XmucuW3IDl.jpg",
               "id": 57829,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Dolores \"Dolly\" Talbot",
               "gender": 1,
               "credit_id": "52fe439a9251416c75016d59",
               "name": "Elaine Stritch",
               "profile_path": "/4QGJE8HwbJXdb7MrsINR8zJtDzp.jpg",
               "id": 36802,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Lisa Tyler",
               "gender": 1,
               "credit_id": "54304fae0e0a26464c000ffa",
               "name": "Vera Farmiga",
               "profile_path": "/oWZfxv4cK0h8Jcyz1MvvT2osoAP.jpg",
               "id": 21657,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Sarah",
               "gender": 1,
               "credit_id": "54304fbac3a36831b20010ed",
               "name": "Sherry Stringfield",
               "profile_path": "/5WKuBl3sCqVY1VkQUCxZjd8sRjR.jpg",
               "id": 33653,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Lynn",
               "gender": 1,
               "credit_id": "54304fc8c3a36831ac001058",
               "name": "Jill Hennessy",
               "profile_path": "/maXA4XgLsHLFy2ww3UvI4jUK27z.jpg",
               "id": 50877,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Dr. Tom Grandy",
               "gender": 2,
               "credit_id": "57df2f54c3a36809560097ca",
               "name": "J.K. Simmons",
               "profile_path": "/jPoNW5fugs5h8AbcE7H5OBm04Tm.jpg",
               "id": 18999,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Simon",
               "gender": 2,
               "credit_id": "57df2f5dc3a3681d4b00249a",
               "name": "Sam Trammell",
               "profile_path": "/4xBWETAFhlpBVOb9xp6MjovpCjd.jpg",
               "id": 131006,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Dr. Sibley",
               "gender": 1,
               "credit_id": "57df2f6cc3a368141f00e267",
               "name": "Mary Beth Hurt",
               "profile_path": "/A1Whvk91g7uMZHjRX5rdxJsofeY.jpg",
               "id": 54782,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Shannon",
               "gender": 1,
               "credit_id": "57df2f75c3a368141f00e269",
               "name": "Kali Rocha",
               "profile_path": "/jAVDvtUNZg8IiwpLBeyAeZRfDQI.jpg",
               "id": 149665,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Michael (Doorman)",
               "gender": 2,
               "credit_id": "5a03059dc3a36863910176a6",
               "name": "Bill Raymond",
               "profile_path": "/9qUefRsvEzitR2j8CwtXYbddayE.jpg",
               "id": 7576,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe439a9251416c75016d5f",
               "name": "Joan Chen",
               "profile_path": "/ekWS5bAB0kv4RColHqYaUAoXz0I.jpg",
               "id": 6720,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe439a9251416c75016d65",
               "name": "Tom Rosenberg",
               "profile_path": null,
               "id": 68602,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe439a9251416c75016d6b",
               "name": "Gary Lucchesi",
               "profile_path": "/zQRUANlcJXa1TFVoCYK1vjIMmEh.jpg",
               "id": 3953,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe439a9251416c75016d71",
               "name": "Gabriel Yared",
               "profile_path": "/2qihER03E1ISTUYqHgUKBA9ow93.jpg",
               "id": 5488,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe439a9251416c75016d77",
               "name": "Allison Burnett",
               "profile_path": null,
               "id": 54781,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe439a9251416c75016d7d",
               "name": "Ruby Yang",
               "profile_path": "/4FSLvqE0oDyMB6MOoP6lyT6duIl.jpg",
               "id": 66168,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe439a9251416c75016d83",
               "name": "Gu Chang-Wei",
               "profile_path": "/eezHOkQN2FowBSiviMle0nziixt.jpg",
               "id": 66169,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 5.791761,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10641,
      "vote_count": 194,
      "budget": 65000000,
      "overview": "Autumn in New York follows the sexual exploits of Will Keane - New York restaurateur, infamous verging-on-50 playboy, master of the no-commitment seduction - until he runs into an unexpected dead end when he meets Charlotte Fielding. Charlotte is half Will's age and twice his match, a 21 year-old free spirit yearning to get out and taste the excitement of adult life.",
      "similar": [
         858,
         8390,
         17130,
         290762,
         10691,
         1903,
         13,
         587,
         175,
         10571,
         40807,
         1381,
         1374,
         334,
         634,
         637,
         38,
         901,
         1213,
         11216
      ],
      "original_title": "Autumn in New York",
      "runtime": 103,
      "poster_path": "/tQ5ze794HtDjxTxYVxHRn7AzbSL.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Lakeshore Entertainment",
            "id": 126,
            "origin_country": ""
         },
         {
            "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
            "name": "Metro-Goldwyn-Mayer",
            "id": 21,
            "origin_country": "US"
         }
      ],
      "release_date": "2000-08-11",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "He fell in love for the first time. She fell in love forever.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Joan Chen"],
      "runtime": 103,
      "synopsis": null,
      "writers": ["Allison Burnett"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0174480/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU2MzAwNTI1NF5BMl5BanBnXkFtZTYwMzAwNTE5._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Richard Gere, Winona Ryder, Anthony LaPaglia | See full cast and crew »"],
      "reviews": [
         "Whilst everyone is naturally entitled to their own opinion, I was rather shocked to read the large number of negative comments about this film on the site. A redress is therefore more than necessary ! Compared to a lot of the violent rubbish we get in the cinema today, here is a film without violence, beautifully made, and concentrating on \"L O V E ! \" Naturally the story is all the more intense as we know that one of the protagonists's days are numbered, and why not indeed ? A parallel may be drawn with the film LOVE STORY but in AUTUMN IN NY, the dialogues are much less crude and closer to reality. The film is technically, plastically, very beautiful ( I m very sensitive to Autumn leaves ) and this film ranks with the best in the autumn ' genre ', ie, \"All that Heaven allows\", featuring Rock Hudson & Jane Wyman, and \"The Trouble with Harry\" by Alfred Hitchcock. Rarely is autumn sunlight put to such good use as in this film. The subtle autumn light of New York accompanies the autumn of Charlotte's own short life towards the winter's snow and her voyage into eternity. Too much emphasis is placed on the difference in age between the two protagonists as well as supposed flaws in their characters. Who cares ? Love is Love ! Why should't a play-boy discover true love ? I think it is wonderful. Let's face it, true love is the only thing in the whole wide world that all peoples can agree on ! This film is reminiscent of the great American weepies of the 40's such as Waterloo Bridge or Random Harvest, but with present-day film quality as an extra a bonus. Unfortunately, these kind of romantic melodramas seem to have lost favour with the public today, which is a great great shame, as romance and love are eternal themes which will never die. I think the film will stand the test of time and hopefully at a future time when violence and evil sentiment on the cinema screen will be less sought after than today will come onto its own. Indeed a second viewing of the film allowed me to appreciate even more the plastic beauty of the film which I missed the first time round as I was worried how it was going to end. In addition to that I was even more impresses the second time round by the performance to the two actors. So long live beauty and romance as portrayed in this film and let's hope there'll be more to come in the cinema of the future.",
         "This movie has many weaknesses, but there is something really superior about it nonetheless. On the negative side, everything people are saying is true; the dialogue is clunky, the plot is predictable, and the chemistry is weak. On the other hand, the charisma of both the leads is amazing and I really fell in love with Winona Ryder's character. I think the makers of this film were resigned to the the fact that as far as writing was concerned, they weren't breaking any new ground. What they did instead was dress up the standard love story with great actors, nice clothes, and pretty settings. Despite the gloss, there is a story here that everyone can identify with at some level. The result, in my opinion, is something magical that I can't pin down. I think it's a success.",
         "Although a little boring at some points \"Autumn In New York\" managed to truly emotionally entertain and interest me. Even after seeing it I am still discovering the hidden meanings it tries to give us. Ironically despite being a romantic drama the romance between the main actors is the biggest downer of this movie. I must have missed the part when Winona Ryder's character's age is revealed, but she just doesn't pass as a 21 year old. I thought she was supposed to be like 26 or something. Not that there's a big difference in age, but she was a bit misscast, despite her child like face. On the other side she was really attractive in this movie and constantly reminded me of this cute girl I know. Gere looks and feels pretty old, but he's a believable 48 year old playboy. The movie is hence held together by good dialogues and nice and memorable scenes. There's also a great line Gere says to Winona after he cheats on her and realizes he screwed up: \"Can you let me love you?\" I've read some pretty different explanations of this movie, but basically I think it's about Gere's character slowly discovering he's been missing a great deal of life, he's never loved. So after \"accidentally\" falling in love with Charlotte he can't bear the though of her dying and tries everything in his power to prevent her death(this might have something to do with his previous life where he was always the one with power, whilst the women weren't). But he has to realize that in Charlotte's case he's completely powerless and there's where the point of the movie lies. He chose true love (despite knowing that Charlotte was going to die soon) over the life he thought he was happy with. It might sound ridiculous but I kind o envy the guy. I too would rather truly love a woman, if only for a short period of time, than spend a life with a woman I didn't love. I would be a happier man, even after that true love would, for some reason or another, leave me, because I'd know I loved, even if it didn't last. I was pretty surprised at most of the bad reviews and comments, but on the other side I couldn't help but to agree with most of them. It is a crude love story and it is somewhat predictable and boring, but it was overlooked for the most important reason it tries to tell us. Despite being an unconventional and hardly believable love story \"Autumn In New York\" is a movie that in the end managed to show me you have to take even the biggest sacrifices to find true love. Sad and Beautiful. 7/10",
         "This film has been savaged by critics and it's easy to see why. The story is oooollllllddddd (young girl dying of an incurable disease) and some of the dialogue is beyond belief. But it is well-acted (Ryder and Gere give two of their best performances) and it looks beautiful. Basically the acting and photography kept me in my seat. Take those things away and it would probably be unwatchable. So, not too bad but not good either.",
         "Slow and somber, muted and subtle, Autumn in New York isn't like most movies. Set against a backdrop of pastels and shades, this sad yet engaging story about doomed love is full of symbolism and metaphor revolving around renewal and decay, second chances and confronting one's past, and hearts on the mend both spiritually and physically. Winona Ryder plays Charlotte Fielding, a young woman blessed with simple good looks but stuck with a faulty heart that threatens to limit her days. Richard Gere plays Will, an older man whose years of toil in the restaurant business are starting to pay off. Will suffers from an ailment of a different kind, an inability to stay true to his woman, something that tends to hurt others more than himself. As it turns out Will once even dated Charlotte's mother only to cruelly jilt her by seducing her best friend. Ever the womanizer, Will can't help himself, and when they meet one night, he hatches a plot to woo Charlotte. Already giddy at his very sight, Charlotte is easily swept off her feet and is soon in love. Alas, Will hasn't changed much. When Charlotte intuitively discovers that he's been cheating, their relationship hits the rocks. Only this time Will does feel bad and finally tries to break out of his pattern of deceit. Meanwhile, his notoriety as a restaurant owner turns into something of a two-edged sword as the daughter from the woman he seduced then spots his photo on a magazine cover and tracks him down. What follows is Will's efforts to not only put the pieces back together but create a future that both he and Charlotte can share. The trouble is, it could also mean some very radical surgery that Charlotte may not survive. Although set in New York, it could just as easily have played out in a small northern British Columbia town as the six degrees of separation rule very much applies. In fact, it's Charlotte's grandmother who introduces the two, despite knowing all to well how Will treated her daughter. Don't expect any car chases, fireball explosions, or over the top special effects. But do expect a movie that is splendidly shot in hues of orange and yellow, green and grey, and opts for opaques and shadow over bright and blinding. And while the pacing is as slow as molasses, Autumn in New York nonetheless seeps deep into the psyche and remains there all season long.",
         "I just saw the movie and I liked it. Both Gere and Winona gave excellent performances. The actors and cinematography are beautiful. Nice shots of NYC. Chen uses shadings and reflections beautifully. I don't care what the critics say, I thought it was a great movie. Winona is as beautiful as ever and gives one of her best performances. Her face is so radiant and hauntingly beautiful. I can't get her out of my mind. Too bad her nude scene was cut from the film. It would have been her first. Go see it if you like Winona or Gere. I give it 3 stars.",
         "Will (Richard Gere) is a New York City restaurateur and ladies man, in his middle forties. His life's motto is definitely love 'em and leave 'em and have fun in between. So, when he meets Charlotte (Winona Ryder), a beautiful young lady half his age, he is surprised at how smitten he is with her. Wanting to make a connection, he hires her to make a hat for his date to a charity function. When she shows up at his apartment on the evening of the affair, he informs her that his date is sick. Would she, Charlotte, take her place? She agrees and they have a lovely evening together, one that lasts all night. Love is in the air, all right. But, Charlotte confides in Will that she has a dire medical condition, one that is threatening her life. What will their future hold? This is really a nice film for those who like to sigh and cry over a set of star-crossed lovers. Gere is great as the aging lothario and Ryder positively enchanting as the spunky and lovely young lady in his life. The rest of the cast members, including Anthony LaPaglia, Sherry Stringfield, and Elaine Stritch, are great. Then, too, the film is replete with lovely costumes, sets and scenery, making for a very beautiful watch. If you have a hankering for romances, even and especially ones that elicit tears, you should get this film without delay. On an autumn evening, with a fire blazing and mugs of hot chocolate on hand, you will feel very satisfied when the story is spent.",
         "The critics may trash \"Autumn In New York\" because of the fact that MGM decided not to screen the movie to those who make career of tarnishing other people's works. However, \"Autumn...\" is a 'good' romantic drama with terrific performances by Richard Gere and Winona Ryder. Some people may criticize the film due to its abundance of cliches throughout the movie, but it would be almost impossible to not have any cliches in a romantic drama such as \"Autumn...\". This one certainly is a winner in my heart. The film is wonderfully directed by Joan Chen and it was beautifully shot by the cinematographer, Changwei Gu. New York never looked so beautiful!",
         "\"Autumn In New York\" has delectable shots of brown and golden leaves fluttering down in the winds from craggy old tree branches, covering wet sidewalks and surrounding two movie stars staring into each other's eyes. But these stars (Richard Gere and Winona Ryder) are distinctly un-New York, and the filmmakers keep everything mushy, flip and coy. Ryder looks lovely, but she giggles too much in between her incredulous comments: \"REALLY?!\"...\"WOW!\"...\"AM-MAAZING!\" Gere, laughing with his mouth closed, gives a bloated performance, scrunching his face while tearing up at his black, beady eyes. Anthony LaPaglia is much better in a smallish role as Gere's best friend, Elaine Strich is amusingly jaded as Ryder's disapproving grandmother (although her line about only being able to afford pistachio nuts is ludicrous when she lives in such beautiful New York digs), but this romance cops a corny plea from \"Love Story\", and how long ago was that? The fact that some reviewers actually fell for this is, like, AM-MAAZING! *1/2 from ****",
         "Don't say that I didn't warn you....but if you have anything better to do like go for a root canal or a vasectomy, then do that! But don't go anywhere near the video store today. Even if your wife or girlfriend promises you that \"Special Treat\" if you bring home \"Autumn in New York\", don't do it. It's one of those rare films that every man in this world fears he has to watch to show his girl that he has some sensitivity. I am not against those typical \"chick flicks\". There have been many enjoyable ones over the years - most starring Meg Ryan, Tom Hanks, Goldie Hawn, Bette Midler, or Dustin Hoffman. But this piece of garbage is totally unwatchable. How tired are us guys watching aged, over-the hill rich guys making it with cutesy pubescent \"teens\"? This story has been done and redone so many times on the screen, it's not original, funny, identifiable, sympathetic, or emotional. There is no surprise or even happy ending. And as for the chemistry between Richard Gere and Wynona Ryder....a big fat ZERO. The dialogue between the two was so lame as to be embarrassing. It appeared that both characters were reading from the teleprompter and couldn't wait to get the thing over with and collect their paycheck. I was at least hoping that the character, Charlotte, would get arrested for shop-lifting at Bloomingdale's just to add some spice to the movie. And speaking of spice...the \"love\" scenes were as bland and cold as re-frozen ice cream. And the scene with Will cheating on his babe Charlotte made no sense at all and was just a useless distraction. Somebody here wrote that the movie at least had some great scenes of N.Y. From what I can tell, it appeared that the movie was filmed in Hollywood and used phony N.Y. backdrop shots behind the actors. I just got no feel for the City or it's people. And one last criticism, is there helicopter service between Cleveland and New York? This whole story seemed like a big fraud to me. At least it's out of the theaters and not cheating any of us guys out of $18.00 for 2 tickets."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Metro-Goldwyn-Mayer (MGM)",
         "Lakeshore Entertainment"
      ],
      "summaries": [
         "Love story da groppo in gola per due 'belli e impossibili' di Hollywood, di quelle che ti fanno sperare per tutto il film in un eccezionale lieto fine. In una New York autunnale ed umida, Will è uno chef cinquantenne molto amato dalle donne e senza storie troppo lunghe da raccontare, Charlotte è una ventenne dalla salute precaria ed entrambi sono convinti che la loro avventura durerà poco. Sarà vero? Ma l'amore può essere più forte di tutto quando un male incurabile sta minando il fisico della ragazza?",
         "Forty-eight year old Will Keane is a successful restaurateur and serial womanizer, his reputation generally preceding him. When he is introduced to twenty-two year old Charlotte Fielding by Charlotte's grandmother, Will's old friend Dolly who he has not seen in years, there is a mutual but slow to acknowledge attraction. After their first date, Will and Charlotte agree that their relationship will never progress to one of a long term standing, but for different reasons: while this is Will's somewhat standard modus operandi, Charlotte announces that she has a terminal heart condition. Charlotte's admission makes Will look at this relationship differently, he being told by his best friend John that if he is going to continue to date Charlotte that he better treat her well. Their relationship does end up being different than both expect, for Charlotte which could mean a change from her current \"let me die in peace\" attitude to want to fight for her life. And Will's time with Charlotte is further influenced by his encounter with a young woman named Lisa Tyler.",
         "A May-December romance. He's 48, on the cover of New York magazine, an upscale restaurateur, and a womanizer who rejects ideas of love. She's 22, living with her grandmother, artistic, facing a tumor that's life-threatening, which she tells him about the morning after their first night, when he tells her not to expect permanence from him. Will finds Charlotte unprecedented and unpredictable, and experiences feelings of love, but she packs him off when he's casually unfaithful. He's stung, and he's also flummoxed by the appearance of a young woman from his past. Can he convince Charlotte to take him back, and can he help her through her illness and change his irresponsible ways?",
         "Romantic drama about an aging playboy who falls for a sweet, but terminally ill, young woman."
      ],
      "budget": 40000000
   },
   "movielensId": 3824,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-08-11",
      "dvdReleaseDate": "2001-01-02",
      "directors": ["Joan Chen"],
      "runtime": 103,
      "movieId": 3824,
      "title": "Autumn in New York",
      "mpaa": "PG-13",
      "actors": [
         "Richard Gere",
         "Winona Ryder",
         "Anthony LaPaglia",
         "Elaine Stritch",
         "Vera Farmiga",
         "Sherry Stringfield",
         "Jill Hennessy",
         "J.K. Simmons",
         "Sam Trammell",
         "Mary Beth Hurt",
         "Kali Rocha",
         "Bill Raymond"
      ],
      "imdbMovieId": "0174480",
      "originalTitle": "Autumn in New York",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["U1K6d26T9f4"],
      "plotSummary": "Autumn in New York follows the sexual exploits of Will Keane - New York restaurateur, infamous verging-on-50 playboy, master of the no-commitment seduction - until he runs into an unexpected dead end when he meets Charlotte Fielding. Charlotte is half Will's age and twice his match, a 21 year-old free spirit yearning to get out and taste the excitement of adult life.",
      "tmdbMovieId": 10641,
      "avgRating": 2.41894,
      "releaseYear": "2000",
      "numRatings": 1684,
      "posterPath": "/tQ5ze794HtDjxTxYVxHRn7AzbSL.jpg"
   }
}