{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "dancer",
            "id": 733
         },
         {
            "name": "amateur soccer",
            "id": 8864
         }
      ],
      "imdb_id": "tt0156757",
      "video": false,
      "title": "Mad About Mambo",
      "recommendations": [
         64523,
         86913,
         5248,
         14167,
         49478,
         44857,
         102059,
         39213,
         77291
      ],
      "backdrop_path": "/rdnaChiHzsConxjsGssYBrQGbZb.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Danny Mitchell",
               "gender": 2,
               "credit_id": "52fe462ac3a36847f80f065f",
               "name": "William Ash",
               "profile_path": "/pQgdzvRQVT3gDItNptsHhaCdRiU.jpg",
               "id": 86044,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Frank Mallin",
               "gender": 0,
               "credit_id": "52fe462ac3a36847f80f0663",
               "name": "Alan McKee",
               "profile_path": null,
               "id": 75977,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Sidney McLoughlin",
               "gender": 2,
               "credit_id": "52fe462ac3a36847f80f0667",
               "name": "Brian Cox",
               "profile_path": "/m15C58NWii5WCIg57Llr7hejnfy.jpg",
               "id": 1248,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Lucy McLoughlin",
               "gender": 1,
               "credit_id": "52fe462ac3a36847f80f066b",
               "name": "Keri Russell",
               "profile_path": "/6fZ5ceRvZtRkRm06HgaV4qCpJNY.jpg",
               "id": 41292,
               "order": 3
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "554b25e392514146920016da",
            "name": "John Forte",
            "profile_path": null,
            "id": 1464511,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.904346,
      "production_countries": [{
         "iso_3166_1": "IE",
         "name": "Ireland"
      }],
      "id": 43079,
      "vote_count": 10,
      "budget": 0,
      "overview": "High school student tries to improve soccer skills by practicing dance and falls for his dance partner.",
      "similar": [
         68817,
         1788,
         407655,
         10560,
         10409,
         804,
         9762,
         38050,
         342473,
         313369,
         10527,
         44214,
         10545,
         15157,
         12545,
         1792,
         962,
         63710,
         8079,
         121986
      ],
      "original_title": "Mad About Mambo",
      "runtime": 92,
      "poster_path": "/olRqSSHmfqaUM3hg5B4ErvaFK8R.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Columbia Tristar",
         "id": 6564,
         "origin_country": ""
      }],
      "release_date": "2000-04-04",
      "vote_average": 4.5,
      "belongs_to_collection": null,
      "tagline": "Fall in love... With the beat",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Ireland",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Forte"],
      "runtime": 92,
      "synopsis": null,
      "writers": ["John Forte"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0156757/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU2Mzg2MTYyNV5BMl5BanBnXkFtZTcwOTMxNTkxMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: William Ash, Maclean Stewart, Tim Loane | See full cast and crew »"],
      "reviews": [
         "I think I am the first Brazilian here to post a comment about this movie. I know I should be happy that they made a movie with \"Brazilian\" things in it, and I know I should laugh about others ignorance of Brazil instead of getting mad. But I just can't. I am just tired of this. First of all, and the most important thing: Mambo is not Brazilian. Never was and never will be. Period. Samba doesn't even sound like Mambo and Mambo is danced in a complete different way. Mambo is beautiful but it's not Brazilian, sorry. And by the way I think real samba is played in this movie like just once or something. The whole time is like other Latin rhythms in Spanish or other Brazilian songs that have nothing to do with samba. When the \"Brazilians\" in the movie are cheering in the soccer game they are using Mexican sounds. Come on! Latin Americans are completely different from each other, have completely different music, customs, culture...why put them all in a basket like they are all the same same same? It's like saying French culture and German culture is the same. It's not! I know this is just a silly movie and I shouldn't even care but the message those silly movies around there give...Than people start thinking that all Latin rhythms are the same not giving a dawn that Cuban music and Mexican music are so different from each other. I was happy tough when the girl said that in Brazil we speak Portuguese. Thank you for that. Portuguese and Spanish are very similar but the sound of those languages is completely different. And the Ricky Martin song in the \"samba dancing\"? Oh, my God.... And that dancing was samba? Really? Wow.... How different from what I though samba was. Anyways... I think my parents are right seating in the living room laughing a lot about the ignorance people have about my country and Latin culture. Because actually...it is funny that a guy decides to make a movie and doesn't make any research about the culture or country(any!!!), using stereotypes and making a total fool of himself with this festival of cultural stupidity. And that guy that played a \"Brazilian\"? Oh, lords.... Ok, ok.... people...please.... if you want to make a movie about or showing other cultures pleeeeeeeeeeease make some research about it, talk to people from those countries. Like those \"Iranian\" soldiers in American movies speaking Turkish. Hahahahaa Some people don't notice but some do and it is just ridiculous! hahaha I should really just laugh.",
         "This was one of the less publicised dance-based films that surfaced in the past few years. And it's quite a shame that it didn't get more publicity, as it was one of the better ones. While the likes of Centre Stage has pretensions of grandeur, and Bootmen is a mild emotional letdown, Mad About Mambo offers an uncomplicated, fairly convincing love story, set against the beautiful backdrop of Ireland, and blended with some tasteful scenes of dance. In fact, it is Danny and Lucy's dance sequences that charm the most. Unlike numerous other movies that have tried to make things appear as glitzy and glamorous as possible (Centre Stage again), these moments are a stripped down, purely romantic affair. Note that when they dance in the middle of the stadium, lights are dimmed and we barely see anything aside from these two characters. The only problem I had with the main love story is that while convincing, it develops too quickly. The writers could have easily added a little more in the early parts of Danny and Lucy's relationship without boring the audiences, as the film is quite short. William Ash fares well as Danny, but Keri Russell's feisty female lead, Lucy, is probably the biggest highlight of the film. That, and the one of Danny's friends who aspires to run his own fashion house. Recommended for dance junkies and anyone who enjoys a light-hearted romantic comedy, but be warned that while it's quite charming, there isn't really a key point to the film that will hold it in your memory for long afterwards. Grade: B",
         "I don't know why this film didn't get wide release in 2000 when it first made the rounds in theaters, but now that it's available on video you shouldn't miss the opportunity to rent it. This was a nice, pleasant, entertaining film. Nothing \"great\" or Oscar worthy, but who cares? The story flowed, the sound track was great, and the comedic elements hit their marks. Although Keri Russell's Irish accent may not have achieved the subtle nuances of an Irish native, she did a fine job! And William Ash (the soccer 'Mambo king') and Brian Cox (as Keri's father) were fine as well! What more can you ask for? Over all, this was a nice, fresh romantic comedy that was more entertaining than another film set in Ireland a fews years prior, The MatchMaker (with Janeane Garofalo).",
         "What immediately caught my attention was the setting. Not a glorified, beautiful city, but a real, human reflection of Belfast. In terms of the movie, I found the lead male fostered a positive cathartic relationship with the audience, without the stereotypical poor boy/rich girl sympathies. I found, despite my two left feet, the mix of football and samba to be perfect. Although I was drawn aback when actress Keri Russell took the screen, she delivered a thoroughly enjoyable performance. Don't expect cinematic genius, just enjoy the film and its down to earth story.",
         "While I didn't expect this movie to get Godfather-like voting, I was so disappointed over the comments and the overall mark, that I felt the need to write a comment myself (which I usually never bother) Many comments have pointed out that the title is misleading (no mambo in the film, only samba and rumba), the dancing is not top-notch, the storyline is typical (poor boy meets rich girl) and many characters are stereotype. Nevertheless the movie is very sweet and touching. Both lead characters are adorable, the acting is overall good, most jokes are funny (albeit some over the top) and the idea of the film, a romantic comedy combining soccer and Latin dancing, set in grey and politically unstable Belfast, is pretty original. As for the dancing, we can see some beautiful legs and dresses and Keri Russell doing a decent job, while the level fits the reality of a couple where one part has only taken up lessons recently. In line with the story, the dance scenes are more about relationship than excellence. I found some of the characters to be very original, too (Rudi, Mickey). I lived in Ireland for three years and got all nostalgic about the setting, the all-boys-schools, the typical Irish lads and the accents, so maybe I am biased. But still, Danny's and Lucy's pool dance was more romantic and touching than any scene in Dirty Dancing (which I love, by the way).",
         "The movie isn't bad. It's a decent story, but I wouldn't have paid to see it. I have to say I'm a bit impressed by Keri Russell's Irish accent. Not perfect, but not bad for an American. I personally can't do one at all, but hers wasn't bad. A few slips here and there. The story is pretty good in a lot of ways, but isn't atypical of the kind of storyline they're producing. I think some people were a little too concerned with the dance aspect, but the acting was terrific. I think Keri Russell is a very professional and believable actress. There were some technical \"mistakes\", for example, Luis Miguel singing \"La Gloria es Tu\", which is Spanish, and the Mambo is Brazilian and really goes more with Brazilian music, which of course would be in Portuguese. Still, overall, I liked the movie. I give it a 7.",
         "Maybe the film is too European, because of the football and the cry out of social and political problems but, one thing's for sure, there is very little mambo, or none at all, in this movie. There was plenty of \"salsa\" and other modern \"Latino\" music in it, though. Maybe most of the world think that when you talk about mambo or salsa, you can put it all in the same box and say \"It's all Latino music\". There you are, missing the real concept. The movie was supposed to have told the story of a young footballer, wanting to improve his game by taking lessons of \"samba\", music originated in Brasil, but unfortunately the samba gets mixed up with the word mambo, and then mixed again with some \"buenos días\". How long is it going to take filmmakers to realise that it's very easy to find out the differences between different countries, cultures and music.",
         "Definitely not a movie you'll remember for the ages, but a sweet, enjoyable one nonetheless. Ireland's beauty is challenged only in this movie by Keri Russell's. However, I did take a deep breath and ask myself if I liked this movie only because of those 2 things. Naah...it's sweet and enjoyable. Check this one out.",
         "I don't know why everyone is so negative about this film. We just saw it on video and I really liked it. OK, so I don't know that much about dancing and what is what but apart from some cringe moments (like at the competition), I really really liked it!! Really good feel-good movie... My fav parts are when they dance in the pool and the final end dance.. ;o) He shows a lot of emotion and I guess it just brought me back to those highschool crushes.. those moments when it was just so.. wow... ;o)Really inspired us to take up dancing lessons again.. anyway, just a really fun feel-good movie and that fashion-concious friend was wonderful!! Maybe I just haven't been around enough Irish but I thought the accents were OK.. at least we could actually understand them!!",
         "I am usually sick of movies like this one, but for some reason, I was a bit entertained by this one. Maybe (as someone already mentioned) because it reminded me of my days back to high school. Who knows? I think that the story is a bit different than in other movies with the similar content. For example, I expected that it would be a classic love-teenage-sweet story (or whatever), and that they would just appear in the competition and win it. But I was completely wrong, and was a bit surprised with what happened at the competition. I agree about the most comments regarding poor dancing, Latino music etc, but I am not a big fan of all these things so that I didn't care much about it. Another thing that I liked, and that differs from the stereotype, is the place - Belfast, and lack of glamour and high-class houses, expensive cars, etc (except very few scenes). In summary, I give 7 to this movie, although it might be too high and not fair comparing to some other really great movies. But again, who cares. Cheers."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "First City Features Ltd.",
         "Gramercy Pictures (I)",
         "Phoenix Pictures"
      ],
      "summaries": [
         "Danny Mitchell, a working-class Catholic high school student in West Belfast, Ireland, dreams of playing professional soccer, but first he has to perfect his timing. He starts taking dance classes, where he meets Lucy McCloughlin, an upper-crust Protestant, with whom he falls in love.",
         "A Catholic high school student, trying to perfect his soccer timing by practicing dance, falls in love with his dance partner."
      ],
      "budget": 0
   },
   "movielensId": 3829,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-04-04",
      "dvdReleaseDate": null,
      "directors": ["John Forte"],
      "runtime": 92,
      "movieId": 3829,
      "title": "Mad About Mambo",
      "mpaa": "PG-13",
      "actors": [
         "William Ash",
         "Alan McKee",
         "Brian Cox",
         "Keri Russell"
      ],
      "imdbMovieId": "0156757",
      "originalTitle": "Mad About Mambo",
      "genres": [
         "Comedy",
         "Romance",
         "Foreign"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "High school student tries to improve soccer skills by practicing dance and falls for his dance partner.",
      "tmdbMovieId": 43079,
      "avgRating": 2.97727,
      "releaseYear": "2000",
      "numRatings": 44,
      "posterPath": "/wweY34HkSCl6mSvIPHpxJlm2l1p.jpg"
   }
}